[
  {
    "text": "RANT: I'm sick of incompetent recruiters Sorry to sound harsh, but it's true, a lot of recruiters don't know how to recruit.\n\nI come from a chemical engineering background. I have experience with manufacturing, so I'm familiar with large-scale equipment, batch solutions, gases and liquids, etc. I would be interested in something like this. \n\nBut when a recruiter reaches out to me and sees I have experience with data, and they think I would be a good fit for a data entry position, that's when I ask \"what are these people thinking?\"\n\nEven recuriters contact me for mechanical or electrical engineering positions. Which makes me think they think all engineering is interchangeable, but that's not the case at all.\n\nI get the feeling they just see a few keywords on your resume/linkedin and automatically think you're a good fit.\n\nI know there are good recruiters, but man are there a lot of bad ones too.",
    "title": "RANT: I'm sick of incompetent recruiters",
    "subreddit": "jobs",
    "timestamp": 1628797774,
    "score": 68,
    "keyword": "man engineer"
  },
  {
    "text": "Thought some might find this funny I was a recent architecture graduate. 5 years of grueling all-nighters, etc etc.\n\nWent to a job interview with a husband and wife firm. During the interview, I said very little and they basically talked over each other the entire time. \n\nAnyways, they \"offered\" me a position at the company. However their \"offer\" was an informal email for 10k less than the national average for an intern architect. And in the same job offer email they said \"IF YOU WANT TO MAKE MORE MONEY, GO BACK AND GET AN ENGINEERING DEGREE\"\n\nNeedless to say I turned them down.  But man, after spending 8 months looking for a job offer, and this is the first one you get, really hard to turn anything down. \n\nUpdate: I eventually took a job for 10k more than the national average, and have been very happy with my current company",
    "title": "Thought some might find this funny",
    "subreddit": "jobs",
    "timestamp": 1627052270,
    "score": 14,
    "keyword": "man engineer"
  },
  {
    "text": "Bizarre Job Search Advice So I have been looking for a job since I graduated last fall and I have heard all the prototypical advice from my grandparents (write a letter to the CEO, barge into a place you want to work and tell them you need a job, etc...) but the other day my grandfather was talking to me about how to get a job with no relevant experience and his advice was just abnormally stupid. He literally advised that I tell potential employers that I will work for free for two weeks and if they don't like me, they don't have to pay me. Like wtf... This man was an engineer at a large company for many many years and this is the best advice he's got to give? I'm curious what kind of crazy advice others in this subreddit might have received while looking for a job",
    "title": "Bizarre Job Search Advice",
    "subreddit": "jobs",
    "timestamp": 1617554673,
    "score": 13,
    "keyword": "man engineer"
  },
  {
    "text": "How do I transition from retail to professional? My whole life, due to my autism and my family’s low finances I was told by teachers, community leaders and guidance councillors that I was born to be a burnout and work at Walmart. Always, the eager overachiever I set out five years ago to prove them wrong and make myself a better life. I want an office job, I learned early on that no one would hire me as an administrative assistant and I need a specific degree. \n\nRight now, I’m a civil engineering student with a 3.4 GPA trying to get experience in a professional environment, obviously applying for internships but also any office jobs I can find that fit my study hours. My entire industry was basically destroyed by the virus and in my downtime I’ve begun applying to lots of places. What employers seem to look at isn’t my years of university but my eighteen years of manual labour, retail and food industry experience. \n\nI talked to my therapist about this and he had the same issue. Because he didn’t want to flip burgers, he paid his way through his two degrees and his masters program by being a semi-professional MMA fighter. Then, when he graduated no one would hire him, forcing him to start his own practice. \n\nThere seems to be an impenetrable barrier between retail and professional. I have a great resume, I have bulletproof references, I’m confident, not cocky in interviews, I’m a company man and am willing to take on any task. What do I need to do to show employers my potential?",
    "title": "How do I transition from retail to professional?",
    "subreddit": "jobs",
    "timestamp": 1614172488,
    "score": 10,
    "keyword": "man engineer"
  },
  {
    "text": "What does a Product Manager do at Spotify? Through conversations with mentors, peers, and friends, I’ve found many best practices – systems of thinking, ways of working, routines – that deserve some recognition.\n\n**I’ll be doing a ‘Career Spotlight’ where I interview high performers in different industries to dig into their perspective on the role, mindset, and habits.**\n\n&#x200B;\n\nOur first spotlight will be with Angela, a Product Manager at Spotify.\n\nAngela is a PM at Spotify where she builds data products.\n\nLet’s kick this off …\n\n&#x200B;\n\n# What do you do at Spotify? What does product management at Spotify mean?\n\n**Angela:**\n\nI’m product manager at Spotify focused on building data products. In short, my role as a PM is to help identify problems, turn them into opportunities, and build products to solve those problems.\n\nWhat is a data product you might ask? An example is that we build pipelines to gather data. then use this data to build machine learning (ML) applications and analytics tools.\n\nOur team’s goal is to amplify the voice of Spotify customers and share insights back to the business from customer feedback.\n\n&#x200B;\n\n# What has your path to Spotify and product been? What were some of the biggest challenges you faced?\n\n**Angela:**\n\nMy path has always revolved around my interest in data and ML. I’ve always had a specific interest in this area, which is a little unconventional for a business grad. \n\n**A bit about myself:** I graduated in 2016 from business school at Western University in Canada, and participated in Bell’s rotational program which gave me an opportunity to try out different roles. I completed rotations in analytics, corporate strategy, ML projects, and finally moved into the data science space as a PM. Throughout these rotations, the type of work that I owned had always changed, **but the common thread was that my role was always centered around data and business analytics.** \n\nI was fortunate enough to have the opportunity to bring the first Hackathon to Bell with three amazing coworkers (shoutout to Nat, Aly, and Cindy!). This idea was inspired by the realization that we stored a vast amount of data and had an opportunity to create products from it.\n\n>**One thing I learned was that if your day job isn’t giving you the opportunity to learn or develop skills in areas that you’re interested in – you have to find or create your own opportunities.**\n\nIn this case, I was incredibly fortunate to be surrounded by great mentors, a driven peer group, and an innovative data science org!.\n\nWhen I was searching for my next opportunity, **one of the biggest challenges I faced was figuring out how I fit into the data world with a business background.**\n\nIn hindsight, there were a ton of opportunities. But at the time, I had assumed the only way into this world was to be a data scientist or engineer. From networking (and with many people generously giving me their time), I figured that what I wanted... was to be a technical PM. From there, I started looking for roles that would allow me to stay close to the development of data and ML products, and that’s how I ended up at Spotify.\n\n>**Another (more personal) challenge is that I’ve always found it tough to sell myself or share my work.** I’m not sure if this is a cultural thing, but I’ve always had a strong focus on modesty. I found this conflicting because in the professional world, a large chunk of your progression is determined by your ability to vouch for yourself and create visibility on the value you bring.  \n**Over time, I genuinely developed respect for people who were proud of their work, and spoke about it proactively.**\n\nThis was an *‘Aha!’* moment for me. It made it much easier for me to be comfortable with sharing my work and vouching for myself. This is currently still a work-in-progress!\n\n&#x200B;\n\n# What would your job look like if it were easy?\n\n**Angela:**\n\nIn this hypothetical world: **users know exactly what they want**. We design a product that suits our users’ needs perfectly. All stakeholders are on board with no conflicting priorities or timelines. Development goes perfectly, no bugs in testing. Adoption exceeds our expectations. (This is an unrealistic dream that would take the fun out of things! ;) )\n\n&#x200B;\n\n# What is something you want to highlight about product that is not commonly known?\n\n**Angela:**\n\n>**Make your job obsolete!**\n\nThis was something that surprised me in the product world, but is a common misconception. You’ll always hear *“be the CEO of your product”* which may lead many to believe that they need to be in full control of all workstreams. But since there are SO many things to focus on in the product space, it’s important to empower others to be able to manage initiatives and product streams. You'll do your best when your team members can lead within the group. This allows PMs to prioritize product discovery and what the team should be focusing on next!\n\n&#x200B;\n\n# What key habits, mindsets, or behaviors do you attribute most of your career accomplishments to?\n\n**Angela:**\n\n**Setting up systems to get things done**. Creating rules has been important for me to maintain discipline and honestly, has made it easier for me to remember all the things I need to get done. Also, it takes the decision-making out of deciding whether or not I want to do something (e.g. workout every other day at 5PM). \n\n**Writing shit down!** From minor things such as to-do lists to larger goals – writing things down has made it significantly easier to visualize what needs to be done\n\n**Focusing on** [**the happiness advantage**](https://www.amazon.com/Happiness-Advantage-Principles-Psychology-Performance/dp/0307591549). This might sound cheesy but ...happy people do better at work! Invest in your relationships (friends, family, colleagues) to keep you grounded when stressed or overwhelmed, and make sure to pay it forward when you are managing people (i.e. give people time to reset and take time for mental health). \n\n**Be open to revisiting skills you dislike / find uncomfortable**. Some of the best opportunities come from that! I used to dislike the idea of project management... now I’m in a product manager role where I’m always doing some amount of project management.\n\n&#x200B;\n\n# What unconventional advice have you received that has been most influential thus far in your career?\n\n**Angela:**\n\n* You always want a 10th (wo)man in the room that’s going to challenge your thinking\n* **Feedback is a gift**\n* There are people that are easy to work with and people that you will learn from\n* Reading is like compound interest!\n* My first mentor always told me to make time / space for personal hobbies and interests (e.g. taking acro classes) and to NOT to spend all my extra time focused on my career. This one really made me think. Sometimes it can be a challenge but it’s important to maintain a good perspective and ground yourself!\n\n&#x200B;\n\n# For those wanting to pivot into tech or product – how would you advise them to spend their time and energy?\n\n**Angela:**\n\n* I’d highly advise folks to listen to podcasts on tech interviews (or jump into clubhouse sessions). Hearing others talk through tech / product development was incredibly helpful for me to get into the minds of those in tech & product.   \nSeek opportunities in your day job to practice product skills. Product strategy and user journey mapping can be practiced in other areas too – they aren’t exclusive to ‘product’.\n* I sometimes felt overwhelmed and had ‘learning FOMO’ from seeing all the resources out there. Focus on what you’ve learned and take it at your own pace! Don’t beat yourself up over all the articles / podcasts you’ve missed. \n* Follow and read posts from current product managers. They usually share content that is a reflection of their day-to-day. It’s a great way to get in their minds, understand what challenges they’re dealing with, and what the world of product and tech looks like. Some great platforms are Twitter, Medium, and of course, Substack!  \n\n\n#### Further reading:\n\n**Books**\n\n* [Cracking the PM Interview](https://www.amazon.com/Cracking-PM-Interview-Product-Technology/dp/0984782818/ref=sr_1_3?dchild=1&keywords=cracking&qid=1616674542&sr=8-3)\n* [Product Management's Sacred Seven](https://www.amazon.com/Product-Managements-Sacred-Seven-World-Class/dp/0578740583/ref=sr_1_1?dchild=1&keywords=parth+detroja&qid=1616674534&sr=8-1)\n\n**Articles**\n\n* [John Cutler](https://medium.com/@johnpcutler)\n* [Reforge](https://www.reforge.com/blog/racecar-growth-framework)\n\n**Podcasts**\n\n* [Product School](https://open.spotify.com/show/1XBrhVLsQOIAv3KFBqnzrX?si=tSgPnw4iQL-KzXmUR9arfA)\n* [Product to Product](https://open.spotify.com/show/4rbibgKTXCW3W1mWaEcuIF?si=-3u24P1bTEynLcT7FsjmdA)\n\n**Personalities**\n\n* [Shreyas Doshi](https://twitter.com/shreyas?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor)\n* [Bangaly Kaba](https://twitter.com/iambangaly)\n\n&#x200B;\n\n**To those reading: thank you for taking the time to read this.**\n\nThis article took a while to put together. If you enjoyed it, I’d love for you to **subscribe or share it with a friend**. \n\n[https://andrewmp.substack.com/p/career-spotlight-angela-hu-product](https://andrewmp.substack.com/p/career-spotlight-angela-hu-product)",
    "title": "What does a Product Manager do at Spotify?",
    "subreddit": "jobs",
    "timestamp": 1616709787,
    "score": 10,
    "keyword": "man engineer"
  },
  {
    "text": "A Short Story (literally): 15-Year IT Pro Struggles to Gain Employment. **It All Started With Personal Development**\n\nIn 2011 after 3.5 years of working with a telecommunications company as their Systems Engineer, it happened... I was considered for a promotion as the organization's IT Manager. For me, it was an honor because I started as their low-wage help desk technician but studied my butt off to learn how to build and implement IT infrastructure; it's where I wanted my skills to go, not just for me but for the growing organization.\n\nDuring my first two years of employment I was given several raises due to my unwavering commitment to getting the job done no matter what it took -- early days, late nights, weekends... it didn't matter, I was there getting the job done because I loved and still love what I do and the company needed it done. I remember one year we suffered a 3-day outage due to an ice storm where I slept in the office so I could lend a hand wherever I was needed whenever I was needed.\n\nAs a stipulation to the promotion to IT Manager I was tasked with attending a personal development event where I was a little reluctant at first but found myself acutely listening to the speaker resonate with every once of my being. It was like he created this event specifically for me -- it was, only he didn't know it, or perhaps he did because it was for people like me.\n\nI enjoyed the event so much I bought a number of CDs off the back table and the first thing I did was pop the first CD into my car's CD player -- The Seven Habits of Highly Effective People by Dr. Steven Covey (may he rest in peace). That event changed the entire course of my life. It led me to self-reflect; it provided me with additional resources; and I left with a new perspective on life and my role within it.\n\nOne month later, I received the promotion. I was humbled, I was proud, and it gave me a sense of accomplishment. I didn't attend college because I never did well academically. I was always the self-education type, only learning what would be most beneficial to me and my interests and not wasting time or money on the things that didn't interest me.\n\n**Climbing the Proverbial Ladder**\n\nAs I progressed through my personal development journey and well over 100 audiobooks later on the subject, I found myself dreaming about what life would be like living life outside of the office; pursuing my dreams such traveling the planet and seeing the beauty of it all before I abruptly depart from some crazy accident or progressive sickness, rather than working for the people at the top of the company who're living out their dreams. I was tired of getting emails such as  \"It is with a heavy heart that we're announcing Jonathon Xxxx, a committed member of the company team has passed...\" It made me realize that there is more to life than working for the man.\n\nStill, despite the dreaming, because who really can afford to chase their dreams, I kept being the dedicated team member I had become and continued delivering value to the organization by keeping the infrastructure growing, updated, secured, and mostly trouble free; there's always going to be something to respond to.\n\nI was hiring people to assist with the tasks and processes I created so I could focus on implementing new technologies and bringing new office locations online. We were growing and I found that my team and I were playing a major role in that growth. Although we were seen as more of a cost center than a source of income, I knew that if it wasn't for my team and I keeping the infrastructure running smoothly, it would have a ripple affect throughout the company which would affect real sales. So even though we were viewed that way, I knew different.\n\nThroughout the continued growth and expansion of the company, I did what I do best and that was give my position and the company my all; eventually I was considered and promoted to the Director of Operations. I was beyond elated and was presented with a contract that stated if I were to stay with the company for X number of years and the company sold within that time, I would receive a 50K bonus -- yep, the company was looking to sell.\n\nI didn't know it at the time but that's what happens in the telecom industry, entrepreneurs build companies to sell them and my company was in the position to do the same thing -- we grew an amazing company with zero debt and it was attracting a lot of attention.\n\n**Personal Growth and Entrepreneurship, An Uneven Match**\n\nAs I continued down the path of my personal growth journey I really started to take an interest in entrepreneurship and what it could mean to living out my dreams of traveling. For me, I paid close attention to passive income streams and thought to myself, as I always do, \"Look what you've accomplished here. If you can do all of this, what else can you push yourself to do? You're clearly capable. Go for it!\" ...and I did.\n\nWith much disappointment and yet excitement I handed in my letter of resignation and decided I was going to pursue entrepreneurship and chase my dreams. My VP and I had an amazing relationship and he simply wanted me to do what I thought was best for me; asking me to stay  where I respectfully declined. The entire company left their door open to me after the send off, if I ever wanted to return the door was always open. What a feeling.\n\nI went out and tried several projects ranging from selling responsive websites to building an eBay business; not at all prepared for how hard any of it was going to be. I read books. I listened to audiobooks. I tried and kept trying and was met with failure after failure. I thought personal development was hard because you have to really dig deep, but entrepreneurship... if you're ill-prepared as I was, it will swallow you up and spit you out to try again -- if you dare.\n\nUltimately, I had to turn back. If I didn't turn back I was going to drown and sink to the bottom of an entrepreneurial sea of failures. Beaten, battered, and bruised I swallowed my pride and crawled back to the company that saw me off to live my dreams and to pursue something new. Because I built such good relationships with the top executives I was welcomed back with open arms.\n\nI was not offered the position I left because it had been filled by someone I grew to know and like. Instead, I was offered a new role within the newly created DevOps team as a Sr. DevOps Engineer in which this gentlemen was now V.P. of Operations.\n\n**Back In the Saddle**\n\nI've always been the techie type. I love technology and I love making it work. I had always wanted to focus solely on cybersecurity as there is just something so raw about it that attracts me to it and now was yet another chance for me to practice in that area.\n\nGiven my history within the company with effectively designing and securing infrastructure, my new role as the Sr. DevOps Engineer was to build out the new AWS environment so that we could break down the monolithic LOB application into micro services where the software development team could role out new changes using a CI/CD pipeline; keeping the application decoupled and the deployments distributed.\n\nAs I stated, I'm not a software developer, I'm an infrastructure guy and I focused all of my efforts on designing, securing, and building out the organization-based AWS environment using infrastructure as code (IAC), Terraform. Terraform was just coming onto the IaC scene when I was implementing it so there was little documentation on Terraform and Vault but I persevered and managed to get things built and operational in the mock environment.\n\nI was loving what I was doing. I studied to get certified as an AWS Solutions Architect Associate and was feeling fantastic with obtaining it but something internal was still pulling at me.\n\nI talked with my new VP and we discussed what I was dealing with. Being an ex-entrepreneur himself he completely understood what I was going through. I never thought of myself as a failure after starting my personal development journey because a mentor of mine once said:\n\n&#x200B;\n\n>\"Failure is an event, not a person.\" \\~Zig Ziglar\n\n&#x200B;\n\n...and ever since then I stopped letting small event-based failures stifle my ambitions.\n\nAfter nearly two years of preparing myself through countless books, endless research, and sleepless nights I decided to give entrepreneurship another shot; only this time I took some time to travel the United States and live out part of my dreams in case I failed yet again.\n\n&#x200B;\n\n**Small Dreams Are Better Than None**\n\nI have a 2013 FJ Cruiser that I prepared for the journey. I built a bed platform, a custom shower, an awning, installed additional battery power, solar panels, a power inverter, and implemented a few other nice-to-haves then I hit the road.\n\nI traveled from NH to Key West, FL, to crossing the United States hitting every state from FL to California; pretty much everywhere I could go and with no plan in-place. I just drove. I visited a ton of national parks, met some of the most amazing people on the planet that are out there just living life and enjoying the freedoms they've been given, and I wouldn't trade any of it for anything.\n\nI traveled for 4 months and without a care in the world. No emails. No outages. No meetings... To me, this is was what dreams are made of. Sadly, as with all dreams, I eventually wake up and am pulled back into reality, although, that trip was pretty real. No tropical vacation could ever compare and I've been to a few.\n\n&#x200B;\n\n**Time to Build That Business**\n\nReturning home I didn't know what I was going to do for a business. I had a few ideas but I wasn't quite clear. I thought I could start a cybersecurity consultancy since I've always held an interest in that area but I didn't have much experience in the way of penetration testing, more just blue team-type of experience where I would harden infrastructure. Although I knew my old company's infrastructure footprint it made it a little easier to harden it. Not knowing a potential client's infrastructure would require performing various reconnaissance technics including web application attacks and well, like I said, I didn't have much experience there so I kept trying to drum up some ideas.\n\nWhile I was considering a few options I figured I would do some side work for people in the way of construction. I've always been good with my hands and figured I could bring in some extra cash while I worked out a bigger plan. Well low and behold, that work ended up turning into a full-time job. I had a ton of work coming in and it started to expand into a business.\n\nI grew the business by applying learned information that I obtained through countless books such as \"The E-Myth Revisited\", \"The Pumpkin Plan\", \"The Toilet Paper Entrepreneur\", and many others. They all helped me tremendously. After two years of applying learned information and technology to my growing business, while building side hustles using the same technologies and methodologies, because remember, the goal for me was to build passive income streams and there's no better way to build passive income than to build automated processes... it all came crashing down. COVID.\n\nIt was a two-year startup. All of the money I had coming in was now going to the piling bills and I didn't have any more income to run the business. I was done. My goose had been cooked. After I ate a healthy dose of humble pie I decided I'm done with entrepreneurship. It's a hard row to hoe and after all that blood, sweat, and tears (literally) I've realized the entrepreneurship game is not for me.\n\nI played in a sandbox I was not meant to be in -- like programming. I love the idea of creating, it's just not the area for me to play in. I'm a techie who loves to build and manage infrastructure that was influenced by a dream.\n\n&#x200B;\n\n**So Here I Am**\n\nI've ruined my credit. I've lost relationships. I've lost my vehicle... I chased my dreams and it ended in a nightmare. The only thing I have left are some really good friends, a dog that loves me like no other, and the unwavering commitment to not be beat by all of this because after all:\n\n&#x200B;\n\n>\"Failure is not a person, it is an event.\"\n\n&#x200B;\n\nI've applied for so many positions in the tech industry to go back where I belong and the constant rejections are relentless. As a hiring manager, I always hired based on someone's attitude and willingness to make things happen. One's attitude will always get them much further than their aptitude; that was always my philosophy anyway.\n\nI've been out of a professional technology role for a little over 2 years, yes, and that time is increasing with each passing day. I study everyday on sites like [ITPro.TV](http://ssqt.co/m5kyfgc) (referral link) to stay abreast and pickup where I left off. I spent 15 years in IT and to be turned down consistently for chasing your dreams... ugh. It's really disheartening.\n\nI cannot return to my old company because they were bought out by a much larger organization and that organization has outsourced nearly all its departments; those that have stayed want to leave. My old VP, who I had the conversations with regarding entrepreneurship, he passed of coronary heart disease not long after I started my business.\n\nI don't know what the issue is but I know how I ended up here. I took a risk and it didn't work out. It's certainly not from lack of effort.\n\n&#x200B;\n\n**In closing**\n\nI know we're all busy and if you've read this far... thanks for reading. If you're considering doing something similar, just be cautious and prepared because things can change in an instant and you'll need to be prepared for that change or suffer a similar fate.\n\n&#x200B;\n\nWhat would you all suggest? Just keep applying? Time is ticking and the cash is running out.",
    "title": "A Short Story (literally): 15-Year IT Pro Struggles to Gain Employment.",
    "subreddit": "jobs",
    "timestamp": 1621373492,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "Job as a way to pay the bills I think this is going to be quite an unpopular post here but there's something I've been seeing quite often: a job/career is just a way to pay the bills and that you shouldn't attach yourself to it or let it into your personal life. This to me is quite depressing to see because a job takes up to 8 hours a day 5 days a week. Then outside those hours you have commuting time, cooking, cleaning, taking care of others things etc which for some people doesn't leave a lot of spare time for yourself. I'd like to do more than trade an hour of my life for an hour of free time and that time at work is also time in my life I will never get back. This is why I choose careers which have meaning to me and jobs where I don't dread going to. For example: ecology research, pet shelter, park ranger and a teacher. They were more than simply a way to make money and felt meaningful to me. I sometimes worked more than I was required because I wanted to, I'd come home and do more research or prepare a cool lesson and sometimes I actually couldn't wait to go in the next day. This isn't a 'if you love what you doing, you never work a day in your life post'. More often than not, I was working and often the work was not necessarily enjoyable/pleasureable. Sitting for hours on end in the hot, humid Malaysian jungle I just couldn't wait to get out of there sometimes or dealing with a class of hormonal teenagers. The problem is the negative conotations that come with 'work'. During my jobs, I knew that I was working but I didn't have the misery that came with other jobs, jobs I did **just** to earn money and get out of there ASAP. Jobs where I just wanted to do the bareminimum and not spend more than a single second. Jobs that I dreaded going to.\n\nI am against trying to turn your hobbies into a career because soon, what makes them hobbies often fades away. I love playing basketball, gaming and woodworking but I'd never try to turn them into careers. Again, it's about finding something that's **meaningful** to you so you don't feel you are simply giving up your finite time for cash. Work doesn't just have to be for survival. I know that if I'm going to invest my time and energy, I want to make sure it's something beneficial to society/humanity and possibly long lasting. Now I don't think of retiring early anymore or 'if only I won the lottery' because I'd still be doing what I'd be doing. I understand that there is life outside work but work also takes up a huge amount of our time because let's say you didn't have to work, what would you do? You can't fill up your time with just hobbies and leisure because it will become very boring and very empty really fast. \n\nWhy am I posting this? When I was younger I used to spend a lot of time on threads like this and I developed that mentality of a job as just being a way to earn money and you should distance yourself from it. I also got the idea that almost every job market was saturated so I avoided a lot of careers from it yet I saw pretty much **everyone** I know get jobs in their fields that were supposedly hard to get into despite not being overachievers and some rather the opposite. Despite everyone posting how bad the job market, it's all anecdotal just like my experience. Literally, one of my friends who barely passed uni (2.1/4 gpa), didn't go to a very reputable one, took time off, had NO work experience was able to land a civil engineering job working in state railways just a couple of months after she started looking. I was supposed to have a job and make money and I did, but the money was never worth it. I was throwing 8 hours away almost every single day for something I didn't believe in or care for (jobs like retail, banking and corporate, although retail was quite tolerable but I couldn't imagine it long term). If you believe that a job is just a way to make money and pay the bills then that's fine. I'm just offering an alternative view on what work should be and honestly, something that changed my life entirely (god damn did I get depressed everytime I just heard the word 'work' because it was anti-life). There's a reason Elon Musk still works 70 hour weeks even though he's the second richest man in world and I don't think it's just money. It's for those who aren't sure what they want to go into and like me, knew deep down that work as just a way to pay the bills is depressing as hell. Most of what people post on here is anecdotal and are mostly negative. It is not an accurate representation of the real world (you'd likely find one just hearing peoples experiences) and you should just pursue whatever career you want despite what other people tell you. It's **okay** to make your career part of your identity. But most importantly, don't ever sell your soul, don't just chase money or material objects and don't ever let any company push you to do what you don't agree with or consider unethical. I don't often use the term 'What do you do for a living?' anymore because I don't do something to live, I live to do something I want.",
    "title": "Job as a way to pay the bills",
    "subreddit": "jobs",
    "timestamp": 1609889286,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "Got denied a position, but want to email hiring manager about other positions...Good idea? I was recently not chosen for a Lead engineer position after a technical interview.  It was a longshot so I am not really upset.  However, I know I am qualified for a mid-level, maybe Senior level position within this company.  \n\nI basically want to email the IT manager who interviewed me and say, \"Hey, I don't really care that you didn't hire me for that lead position - it was a long-shot, but I really want a mid/senior level engineer position.  Do you have any openings?\"\n\nIs this a good idea?  I'm struggling to write an email to convey this properly and afraid that they would \"blacklist\" me especially if I had to work underneath the man/woman that got hired instead of me, even though I don't care.  I really want to work at this company for better work/life balance.",
    "title": "Got denied a position, but want to email hiring manager about other positions...Good idea?",
    "subreddit": "jobs",
    "timestamp": 1628519148,
    "score": 4,
    "keyword": "man engineer"
  },
  {
    "text": "I'm quitting this job after almost 2 months working here and I don't know what to do Hi there, \n\nI'm a little bit lost and I need some of your expertise. \n\nI am a junior electrical engineer with about 3 years of working experience, in this short period I've worked for 3 companies, however, I got laid-off last year due to covid so I did freelance work for almost a year.  \n\nI got hired as a Service Engineer back in Mid-Sept at this Japanese company which hires mostly internationals H1 employees, the company struggles to hire  American talent, and well, the office culture is based on the Japanese working culture (Which I found really interesting and hence why I took the job). \n\nSo a few incidents have been happening however, something very fucked-up happened 2 months ago with an international co-worker who is a Junior engineer at the firm, and I've been thinking to pursuit legal grounds on what happened, not because of money or anything, but because I want to prevent this to happen to another recent hire. \n\nSo on my 1st  week of work I was assigned to this man,  let's call it 'K' to work with him in various maintenance related-work for a week.  that week on a Thursday, I came early as always, but I noticed this guy had an attitude, he seemed pissed, I politely ask him if there was anything to do. \n\nHe asked me in a defying way 'Oh so you're an electrical engineer right?', I politely said 'Yes' \n\nthen we enter a room where the machinery utilities are (Air compressors, tower water, etc.) -Keep in mind that that was my 2nd time entering this room, the first time I entered that room was the day before, and just for like 5 seconds- K  then proceeded to give an assignment, which I couldn't really understand given his thick accent,  for my understanding he wanted me to set an alarm inside a high-voltage air compressor. He never asked me if I had worked with air compressors before or anything. I politely said that I would do anything I could do.  \n\nHe then said that I could've had 30 mins to finish this task.\n\nI asked him if it was all safe to do the job by myself, he switch-off the air compressor knob and said 'yes'.  (He forgot to turn off the main power supply, something I didn't know).\n\n Before I proceeded to work on it another co-worker: 'R' enters the compressor room and tells me to stop working on it, cause it'll be hazardous, (he points out to the main switch feed which wasn't off) which makes me freak out.\n\n\\-It appears co-worker K did not follow the OSHA electrical regulation to look out/tag out the main supply-, R co-worker proceeded to the lookout and tag out the main supply, then telling me that it's safe for me to work on the air compressor this time, he stayed with me for about 2 hours. \n\nI was extremely bothered about the whole situation with co-worker K, so 2 hours later I approach my manager to explain the whole situation about the K co-worker did.  It seems like my manager called him out about this situation. then an hour later 'K' co-worker approaches me in the utility room -I was still working on this air compressor-  begins to yell at me, cusses me, and harass me (as retaliation for telling my manager about the incident early that morning),\n\nHe called a 'little bitch', 'I'm full of shit', 'He doesn't understand why this company hired me', etc. \n\nI proceeded to talk to my manager about the harassment. \n\nI quit this job 4 weeks later, kinda ashamed of myself cause I don't like to jump around from workplace to workplace, but it's a toxic environment, I was thinking that  I should move on with a labor attorney I would like to prevent this to happen to any recent hire and especially I'd like to sue this 'K' co-worker. \n\nI've could've died due to negligence. also early this week I learned that the 'K' co-worker did not have OSHA safety training before. despite working in this company for almost 2 years. \n\n&#x200B;\n\nI need advice, I don't really know what to do. sorry if it was too long!",
    "title": "I'm quitting this job after almost 2 months working here and I don't know what to do",
    "subreddit": "jobs",
    "timestamp": 1637353338,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "Need advice on final probation meeting - response to their feedback + false allegations I am a UK graduate mechanical engineer who works at a sustainability data analysis company. This is my first job, and the following is my story on the drama that unfolds.\n\nThey say that my outcome of probation will be solely determined by my response on Monday. Any help would be appreciated.\n\nTheir feedback as part of the final probation review report is broken down as follows:\n\n* Not attending a meeting (I have proof that I did) - manager X telling manager Y (Y does the performance reviews) that I didn't attend meeting.\n* Coming late to a meeting because I had not pre planned my brother's discoloated shoulder. Their response is that I should have told them early before coming late to a meeting.\n* Using VBA macros to automate stuff when it should have been done manually - failure to follow procedure. They say we don't want you to stop innovating (they just want me to spend longer time on it by doing manually, or they trying to avoid paying me higher salary). I sent manager X macro-**disabled** file as requested, with the same data, the very same day, 10 min later.\n* A data analysis dashboard project that had lack of data points to create forecasts that were required **by the brief**. Their response to my findings was that someone else had done it (he told verbatim: \"there was a big hint\"), and I could have looked at examples to garner 36 data points required to create a data visual. *I have tried looking at every root and sub folder to find this guy's dashboard for my own learning and feedback sake but to no avail.* Now, they claim this shows lack of initiative and attention (how is it my problem if the data is insufficient? There aren't even 36 data points and I have looked at this from different angles).\n* Alleging I didn't attend the webinar (manager Y) , however I communicated this to manager X in the morning team meeting, and I have my findings written for proof.\n* Claiming I detracted f**in a two man data entry project** but failing to provide any evidence for what and where this detraction took place? He said last Fri there were duplicates but considering there were 1700 entries this could've been done by either of the colleagues.\n* Using a pointer to point to relevant information in the powerpoint is detracting according to manager Y.\n\nOf course there are some parts of the feedback that I recognise I need to improve upon: namely communicating early which would have avoided it (or so they claim).\n\n**So they make false allegations for performance review, the feedback has barely enough practical information to be learnt from, and want to hear a final response which** ***would result in either being made permenant, terminated or probation extended.***\n\nThey say due to these reasons my performance is \"highly\" concerning, and want to give a chance to show **how I could mitigate the above points in the future.**\n\n*Other information that shows no proper learning planning: my other junior had told me from inside that they are planning to do presentation with other two colleagues (including me) next week, and shouldn't be worried as it is a formality???  I asked if I should learn client systems or hold off till the decision and the manager Y said I will do this with my colleague*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI feel they don't appreciate my skills of programming, BI, SQL, Excel, statistical analysis, and engineering I bring (after being there for around three months), and want a data entry admin clerk instead. I was only given two visualisation projects in span of three months, and was recommended to do  a masters apprenticeship instead of diploma due to high technical knowledge by the preceding learning provider (sponsored by the company).",
    "title": "Need advice on final probation meeting - response to their feedback + false allegations",
    "subreddit": "jobs",
    "timestamp": 1625397335,
    "score": 2,
    "keyword": "man engineer"
  },
  {
    "text": "Washing machine engineers of Reddit, why do you insist on decieving us by having the washing machine lie to us and force us to endure the longest minute known to man?",
    "title": "Washing machine engineers of Reddit, why do you insist on decieving us by having the washing machine lie to us and force us to endure the longest minute known to man?",
    "subreddit": "AskReddit",
    "timestamp": 1621077007,
    "score": 14,
    "keyword": "man engineer"
  },
  {
    "text": "\"Father, this girl was way more helpful fixing my car than you've ever been\" Just a story about me, a guy and his broken car, and his misogynistic father.\n\nI just got home and parked my bike as I saw a car with an open hood and some tools scattered around on the floor. Then I heard some mild cursing and a guy came around that car and did something with a wrench in the engine area for a second, then he looked for another wrench. I just asked \"Can I help with something?\" He turned to me and said \"I don't think so. I just need to remove this part so I can reach the headlight. These damn modern cars have so little space in here!\" I came closer and had a look. \"I think I can reach in there. Do you need to change the lightbulb?\" He looked a little surprised. \"Yeah. You can try tho.\" I reached in there and managed to change the light bulbs. Then we chatted a little about  how in newer cars everything is built in and how you have to remove stuff to be able to reach other stuff.\n\nHe then noticed that my arm was completely dirty and said \"I'm so sorry, now you got dirt all over your arm.\" I shrugged and told him that I need to adjust my bike's gearshift anyways and that it's always a hell of a mess. \"Oh, you know how to adjust those? Can you show me?\" I nodded and pointed at my bike. \"Do you have (gear I needed) here? So I don't have to go upstairs to get mine.\" He got his toolbox and we worked on my bike. I told him everything I knew about adjusting brakes and gearshifts and then he got his own bike and we repaired it together. It was a lot of fun and I learned a few new things too. \n\nWe were about to pack our stuff, that's when I heard a male voice behind me. \"Showing the ladies how it's done, huh?\" I turned around and saw an older middle-aged man that kinda looked familiar to the guy. \"Not that you'd need that knowledge anyways, a girl as pretty as you always finds someone to fix stuff for you\" and looked at the guy. \"Father, how about you stop being awful to random people?\". The older man completely ignored his son and turned again to me. I just stood there and looked him dead in the eye with a raised eyebrow. Suddenly he got really insecure and his fassade almost dropped. \"Son, how about I show you how to fix a car on your own?\" The guy sighed heavily (appearently it wasn't the first time his father tried to show how manly he is) and said in a monotone voice: \"Father, this girl was way more helpful fixing my car than you've ever been. Just leave.\" He turned back to me and his father eventually left.\n\nHe told me that his father always pretends to do father-son stuff when other people are around but doesn't give a shit about him. Also his views about gender roles have been stuck in the last century, even the constant calling out doesn't reach his dickhead.\n\nWe continued chatting for another 2 hours and maybe I made myself a new friend today :)",
    "title": "\"Father, this girl was way more helpful fixing my car than you've ever been\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1620408595,
    "score": 1649,
    "keyword": "man engineer"
  },
  {
    "text": "I hate when you finally feel comfortable in your own skin and men have to ruin it. I’ve always suffered from self esteem problems due to being abused as a teenager and almost being SA as a adult.\n\nRecently I’ve started to be more confident so decided to wear clothing that would reflect that.\nFor some context I am wearing lots of shorts and crop tops without bras.\nA week ago I decided to head out and pick up some food, on my way back home I had one dude stop for me at the crossing and as I was almost over the lines he revved his engine and drove past me really slowly making me incredibly uncomfortable.\n\nThen about 1/2 minutes later a older man pulled his car over and offered to drive me home. This dude didn’t understand no until I said it to him a few times.\nI managed to get him to leave but I was still terrified as fuck and came home a complete mess.\nI actually walked the rest of the way home with my shopping bad clutched to my chest because I was so scared it would happen again.\n\n\nCAN WOMAN PLEASE BE ALLOWED TO FEEL COMFORTABLE IN WHAT THEY WEAR WITHOUT A MAN VOICING HIS OPINION.",
    "title": "I hate when you finally feel comfortable in your own skin and men have to ruin it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616458443,
    "score": 292,
    "keyword": "man engineer"
  },
  {
    "text": "Just wanted to share my great news with someone: after years of endometriosis pain I finally got my hysterectomy! I’m recovering right now and it’s just settling in how much better I’m going to feel and I wanted to share with how I got here. I had to fight tooth and nail to get here and it’s been a long time coming. Diagnosed with endo and PCOS in 2011. Never wanted kids but they kept telling me I had to wait til I was older to get a hysterectomy because I might change my mind. I didn’t like that but I kind of understood it. It’s a huge life altering decision and you’ve got to make sure it’s what you want. I am not the same person at 33 as I was at 23 (thank god). I occasionally waffled about having kids but only fostering/adopting. Never once have I wanted to push one out. \n\nI’ve had six surgeries to remove endometriosis. Found a doctor here in Orlando who changed my life and did a different kind of surgery (excision) which meant I could stop having those yearly surgeries. When I hit 30s and my pain was coming back she said yeah it’s time for the hysterectomy. All my other options were just as likely to increase my pain as decrease it. \n\nBut she doesn’t do hysterectomies, so I had to see someone else. The lady she wanted me to go to didn’t take my insurance so I had to see someone else.\nGuys... this doctor was the most sexist asshole. Told me I wasn’t old enough to make a decision about kids yet. I’M 33!!!! I straight up asked him if I said I wanted to get pregnant would he tell me I wasn’t old enough to decide and he LAUGHED and said “of course not.” Of course not. Of COURSE not. I left mid appointment which I’ve never done before because I was tired of arguing and didn’t want him digging around in my insides by that point anyway.\n\nSo here’s what I did. I’ve been with my boyfriend six years by that point. We were planning on getting married but like whatever we’ll get to it later. He’s an engineer and had great insurance while I’m a teacher and .... not great insurance. So we got a domestic partnership which allowed me to get on his insurance which allowed me to see the original doctor. That’s what I had to do to get this surgery which is ridiculous. I love my partner but it’s beyond irritating that I had to tie myself to a man to be able to get rid of my uterus. \n\nBut at least I finally got it. I’m in pain now but it’s so worth it. I hopefully won’t be crying during sex anymore - maybe I could actually even enjoy it?? Crazy. (Guys, find a man that not only stops during sex the second you start crying but will stop before you start crying because he senses your body tense from pain.  Seems like a given but it’s super not. Pro tip: we’re supposed to like sex, too) No more periods that send me to bed for three days with a heating pad crying. No more endless surgery on a body part I didn’t even want. \n\nDisclaimer, however - this doesn’t necessarily mean my endometriosis is gone for my fellow endo ladies. Sometimes a hysterectomy is touted as a cure-all for endo and it’s not but can definitely be a life changer for many endo sufferers. Just want to throw that out there.\n\nTL;DR: Uterus got evicted for failure to not be an asshole and I’m super happy about it",
    "title": "Just wanted to share my great news with someone: after years of endometriosis pain I finally got my hysterectomy!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1617640947,
    "score": 273,
    "keyword": "man engineer"
  },
  {
    "text": "I wish hyper feminine women would stop making assumptions about gender nonconforming women like me who wish to not be valued by their looks, especially in male dominated fields. I'm someone who supports all women, especially hyper feminine women with anything feminine being sneered at. My sister is hyper feminine and I would love for her to feel like she has a place in STEM. What I feel is missing from the discourse is understanding why STEM attracts a handful of tomboys/gender nonconforming women.\n\nThe issue had with femininity growing up is that it seemed to only cater to those who could afford it. My family was working class during my formative years, so my style resulted in a certain aesthetic, and hyper femme girls made fun of me for not wearing what they were wearing, and a whole lot else since I'm not conventionally attractive (I'm underweight and my hair doesn't grow past my shoulders). Despite all of that, I don't have a problem with hyper femininity---I have a problem with *specific* hyper feminine women who berate other women for not conforming to their standard of beauty.\n\nI find solace in STEM because I felt it was a space where I'd appreciated for my mind. I understand that women can be both smart and beautiful, and I support it! It just neglects to acknowledge why unconventionally attractive women in STEM aren't as keen to presenting femininely, possibly because they don't identify with the aesthetic, difficult experiences  with hyper femininity, the list goes on. I'd hate to be overshadowed by conventionally attractive women because they're easier on the eyes than I am when we both want to contribute to the same goal. Tech I feel is one of the only spaces where I feel I'm valued for my brain first.\n\nIf we can accept that hyper feminine women exist not for the consumption of men, I'd love for people to recognize that gender non conforming women exist for the same reasons. We just want to exist as women without people accusing us to conforming with masculinity, or accusing us of hating hyper femininity because of the patriarchy.\n\nUpdate: Just want to clarify some points here\n\n1. I think labels are stupid. I shouldn't have used them, and I'm sorry for using them. I think not categorizing women is what'll solve the problem here. When I say hyper feminine, engineers like [Naomi Wu](https://www.asian-sirens.net/uploads/2016/11/1549-500x666.jpg) come to mind (who I highly recommend watching for kick ass builds), or anyone from the Miss America circuit. It means a woman is just extremely girly, and exaggerates the look (think Bratz dolls or Barbie!). **I agree it is important STEM is a welcoming space to different types of women.** Part of my angst was that the discussion surrounding certain women gatekeeping is often inflicted towards gender non conforming women who've often had negative experiences with people valuing them for their appearance and interests, especially feminine women.\n2. I DO believe women can be both beautiful and smart. I've said this multiple times in the original post, and there was a group of women who believe I believe otherwise, which isn't true. There is also another women accusing me of wanting to look like a man, which is frankly classist and sexist just because I deviate from her standard of beauty. I could have articulated this better. What I was trying to say was that just because there are some women who want to put in the extra mile to be beautiful as well, doesn't mean that same standard should be applied to all women. Moreover, I wish femininity wasn't just about the aesthetic, but the character traits like patience, warmth, empathy, etc, all of which I feel isn't reinforced enough. Women should just be allowed to be themselves. By assuming I *want* to look like a man, be like a man necessitates the need for this post, which is a plea to let me be myself\n\nUpdate 2: Thank you so much for the awards!! They mean a lot! And thank you to the users who listened, understood, and offered support. It means a tremendous amount.\n\nI'm really sorry if my initial post caused some knee jerk reactions. I just didn't want people, men or women, to further pit women against each other because some happen to appear conventionally feminine while others didn't conform to traditional beauty standards. I've faced so many micro-aggressions here because I'm a gender non conforming women sharing my personal experience. I also could have responded to some of the knee jerk comments in a more civilized way too, and I apologize for my approach. To be called an incel, a man, a misogynist, etc because I'm a gender non conforming women sharing my experience with the discourse involving SPECIFIC women is egregious. This post was never to attack women who are traditionally feminine, and I hope we can all come to a better understanding about our different lived experiences in STEM with the goal of improving the culture for ALL women!",
    "title": "I wish hyper feminine women would stop making assumptions about gender nonconforming women like me who wish to not be valued by their looks, especially in male dominated fields.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634697498,
    "score": 187,
    "keyword": "man engineer"
  },
  {
    "text": "My brothers are misogynistic and I am so disappointed, I thought they respected women more. My brothers and I were watching a YouTube video that went pretty viral. We watched it cause we actually know the guys being interviewed and they were spouting a bunch of misogynistic crap throughout the whole video. I was disgusted by it and to hear my brothers echo their sentiments the whole time through was DISGUSTING. I know they see me as “one of the guys” but they honestly thought I’d accept this. The biggest issue I had was at one point they said it’s biology. “Men can cheat and it means nothing, women always get emotionally attached” and then explained that women look for quality partners and men look for quantity to dominate. And they AGREED. It’s fucking stupid. These are grown men, one in dental school, one an engineer. Intelligent men. And they think that women can’t be sexually liberated. They also think that so long as a man is providing for his girl cheating is meaningless. I feel like I don’t know them. They’re buffoons.",
    "title": "My brothers are misogynistic and I am so disappointed, I thought they respected women more.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626037162,
    "score": 154,
    "keyword": "man engineer"
  },
  {
    "text": "My dad saw my perspective for once So to start off my dad is pretty traditional. I was a teenager who liked to do things my own way and was very independent, didn't like any help, and I'll admit, was a little bit of a smart aleck. So we butt heads a little bit but nothing super major. \n\nThree years ago he brought me to this mechanics garage to surprise me with a car he bought and that I'd pay monthly on. I was elated I had a rusty old car (that I loved) from a police auction that was like $500 but needed work constantly so I was excited to get one that I knew wouldn't leave me stranded anywhere. \n\nThe shop was run by this old man. When showing me the car, he spoke to me like I had never even seen a car before. He explained what/where the engine was, how to start the car, how to do the turn signals, and how to put it in gear. He then sat in the car and had me drive it around the block so he could show me how to drive it....it was an automatic car. He chastised me on my turns, my braking, and my speed. We literally drove in a circle about a block...\n\nAnyways I just washed it off and was polite because he was just an old man. \n\nWell today I'm home and I needed an oil change. Since having the car, I had the exhaust replaced and the windshield, and I'm friends with a mechanic in my home town so I get it checked out if I have any questions. \n\nI told my dad I was going for an oil change and I heard a rattling this morning and wanted him to listen to it and he suggested we take it to the old man we bought it from. I was hesitant. He asked why and I explained that I didn't like that guy. My dad seemed surprised at this and asked why. I was finally able to put into words that I didn't like being spoken down to. I don't like when people assume I'm dumb. He brushed it off and said he was \"just an old man\" and was \"trying to help\" and I explained that he had acted like I had never seen a car before. I said I didn't like to be mansplained. I once I said that, my dad said, \"he wasn't mansplaining. What are you some sort of feminist?\" I said \"fuck yeah dad, I think women are equal\" and he goes \"me too, I have four daughters and your mom\" (to his credit, my mom is a badass and super strong independent woman). I explained that women currently aren't equal and he asked how. I knew this could go two ways, but I explained that more women in america have died since 2000 from their partners, than men have died in the war. He asked if it was true and looked it up. He didn't really say much after that. But on the way to the shop he said if the guy says anything like last time he would say something. I said no, that I will say something. I was nice to the man and the man mostly spoke to my dad at first. But then I chimed in explaining the work ive had done on it, the tires, and new exhaust I bought and said I think the exhaust just needs to be tighted since it was recently installed. And when the man asked for my dads phone number for when the car was ready I spoke up and said \"actually you can call me!\" And my dad beamed and put his arm around me. \n\nI know it's nothing huge, and I truly think my dad has good intentions, but I am just happy he was able to see it from my side instead of this starting an argument like it would have before. \n\nTo strong women! May we know them, may we be them, may we raise them.",
    "title": "My dad saw my perspective for once",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615573955,
    "score": 112,
    "keyword": "man engineer"
  },
  {
    "text": "So I have a story that shows two ends of the spectrum of male strangers This story happened a while ago now, but I thought it’s worth sharing. This was a terrifying incident that I will probably never forget, but I try to hold onto the good message in the story. I’m not sharing this as a ‘not all men’ type message, because that’s not the point, I just think it helps me to remember that for every bad person there’s at least one good person, and I find that comforting. Similar to the message of ‘look for the helpers’, really. \n\nI live in a country where cycling is a main form of transport, and I was working shifts at the time which meant I was cycling to work at around 5-6am in the winter. So, dark. I work in an engineering company, so lots of men, and it’s in a location where there’s not much else other than my company, an industrial estate, and a small town. Therefore I rarely came across people on the morning cycles, maybe one or two along the way, usually people also cycling to my work. \n\nOne morning I cycled past a guy on a moped/scooter. He was looking confused and hovering around a path that would go down towards our company - lots of new people to the company get confused at this path, and I was half asleep, and that is the only reason I did what I did next, because I would never normally engage. But we made eye contact and I thought he had to be from my company so I said, all ok? \n\nHe asked for directions to the center of the town, I pointed down the other road, and he kept asking for more details. Now my guard went up, because he immediately crossed the road to be next to me, so I just told him I couldn’t give him anything more specific and just go down that road. He asked if I was starting work soon, I said ‘yep’ and cycled off. He followed me on the scooter, riding right next to me, VERY CLOSE, trying to ask where I was from, where I worked etc. I kept repeating ‘I have to go, please leave me alone’. \n\nFor a second he fell behind me and I thought he was going to let me go, then I felt his hand on my ass. I screamed at him NO GET OFF ME, and started cycling like a lunatic to get away. \n\nNow at this point I registered that there was another man on a bike ahead of me, taking the same path that basically only leads to my company, so I was hoping against all hope that he was going there. I cycled to catch up to him, he had headphones on but as long as I stayed next to him, the guy on the scooter was staying way behind. I have no idea how much of this the man was registering at this point.\n\nAs we came up to the company - a few minutes later -  the ‘nice stranger’ went to veer off to a different entrance than the one I needed, and I panicked as I realized I would be alone again with the scooter guy, who was still following - So I flagged the stranger down, said please help this guy won’t stop following me. The nice stranger (no quotes now) was horrified, asking me questions and was I okay etc. The guy on the scooter immediately disappeared down another road as soon as I started talking to the nice stranger. \n\nWe waited a few minutes and it seemed he had gone, \nbut the nice stranger still insisted on cycling with me to my entrance and checking I got in okay, even though it meant he would be late for his shift. At this point I was obviously terrified, shaking and half crying / half laughing, and he just kept talking to me about random mundane things to keep me calm, I guess. I’ve never seen him since, I never even got his name. I’m just glad I remembered to thank him 300 times. He wasn’t particularly old - mid 20s like me - and had only started in the company recently, poor guy had a hell of a morning thanks to me. \n\nIt was one of the most terrifying incidents I’ve ever had, the moment I realized I was in an empty industrial estate at night with a guy who could outpace me may never leave me, but whenever I think of it, I just think of the nice stranger too, and it helps me to not think everything is so bleak.",
    "title": "So I have a story that shows two ends of the spectrum of male strangers",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615551556,
    "score": 32,
    "keyword": "man engineer"
  },
  {
    "text": "I Am A Young Woman Entering Engineering - I Am Excited as Much as I Am Scared Hello friends, I am a long time lurker. Using a throwaway because I don't like having people know information about me on my main.\n\nI recently got accepted into my number one college and program for Engineering. Initially, I was super super excited. I have always enjoyed STEM as a whole with a huge passion. I remember growing up to science videos covering pretty much any topic and falling in love with the creative problem solving behind it. I remember being disappointed not seeing other women often, which is why I was so excited to be accepted into my program of choice. Not only would I be able to mix my love for art and science, but I get to have the potential to inspire other girls who love science and math to enter the field.\n\nBut now as I get closer to going into college, I'm starting to get really nervous. The program doesn't have many women, around 20% of the cohort is women. I know that I'm going to have to stick up for myself and other women in the program against men who will talk over us. I know I am going to have to be constantly proving myself in the field. I know I will face heavy sexism everywhere I go. And I am afraid of that. I am afraid of the accusations that I only got into the program because I am a woman, I am afraid of the suggestions that I \"did favors\" to get in/get a job, I am afraid of effectively being stomped on everywhere I go. From my college life to the rest of my career. It's already been suggested to me a couple times that I only got in because I am a woman while simultaneously telling me that it's not harder for women in STEM. Never mind my being in the full IB program with constant high marks and my obvious love for the arts and sciences and my understanding that engineering is a mix of the two.\n\nFrom women either in college for STEM, or in a career within STEM, or in a career that is male-dominated- is this what you experience? Do you have to constantly raise your voice? Are you cat-called at work? Will it be harder for me because I am a woman, or am I manufacturing these problems in my head? Do you have any advice for me?\n\nThank you\n\nEdit: Thank you for the responses! I really appreciated hearing from women in the field! The general theme seemed to be to focus on myself as my work will show others that I am worthy of being here. It still doesn't quell my nervousness of the overarching problem that people see woman as lesser than in comparison to men in jobs. Such as, assuming the man is the doctor rather than the woman, etc. But it's up to us and the following generations to change that by having more of us in the field. Some people showed concern that I'm setting myself up for failure, but please know that I am going to continue no matter what. This post was half me ranting and half me trying to get a feel out for what it feels like for women in STEM.\n\nThank you again for your replies!",
    "title": "I Am A Young Woman Entering Engineering - I Am Excited as Much as I Am Scared",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1619383561,
    "score": 34,
    "keyword": "man engineer"
  },
  {
    "text": "After everything I've been through as a nurse... I've just had contact from one of my best friends. We have only sporadic contact now because she lives with a man who controls her and physically and mentally attacks her. I've stood by her for five years, told her she is a Muppet, and any time she wants to leave there is a spare room here, where he doesnt know where I live. \n\nSo I was stoked to hear from her. \n\nAnd then she hits me with \"yeah, I've been working [in gigs, as a sound engineer] and despite not being vaccinated or having access to hand sanitisation etc. I've never caught Covid. \n\nThat awkward silence. Why are you not vaccinated, I ask. \n\nOh because the doctor said I couldn't because of my lung issues (scarring from pneumonia at birth and hx of spontaneous pneumothorax)\n\nI'd speak to the doc again, the research has come along way since then. \n\nYeah but I've worked with folks with Covid and I've not caught it. I'll be fine. \n\n...\n...\n...\n\nI can forgive someone staying with a violent, controlling asshole because \"she loves him\". But not getting vaccinated? ERP. \n\nI did sorta ask if her much older partner, 51 to her 30, was vaccinated. Awaiting a response. I bloody hope not. I've never wished Covid on anyone, but someone who has singularly destroyed my beautiful, charismatic friend into a neurotic bundle of nerves, I can not summon any concern for if he ever has Covid. \n\nGod. Why is my friend so stupid? At what point do I have to stop hoping she will smarten up? I told her about my 42yr old who died, with no medical hx or risks. I hope it sticks in her brain. \n\nI've never expected such insanity from even her. She was the one who tipped me off to Covid back in November 2019 when she was following the outbreak in Wuhan (in the two beautiful weeks HE left HER.) Im gutted. I told her straight. The world is a better place with you in it. Get the vaccine. \n\nI guess living in the UK where there are less antivax nutters made me a bit complacent. I didn't expect this to be an issue here, especially not with my friends. What the hell can I do though?",
    "title": "After everything I've been through as a nurse...",
    "subreddit": "nursing",
    "timestamp": 1633462693,
    "score": 35,
    "keyword": "man engineer"
  },
  {
    "text": "Engineering student forever grateful for your help \nHey,\n\nI was hoping you guys could help me!\n\nI’m a third year engineering student and we are currently conducting a study on the viability of integrating autonomous mobile supply robots in hospitals!\n\nThese robots would ensure that all medical supplies could be transported without cross-contamination between the storage room and the necessary floor.\n\nWhat I need from you guys today is to help me better understand the current state of affairs inside hospitals because their isn’t much online truthfully...\n\nThe product would be something similar to the Aethon Tug robot seen online.\n\nAny and all help will be greatly appreciated☺️\n\nEdit:\n\nBy current state of affairs I just want to know how does the medical supplies get from the delivery truck to your guys station currently! \n\nIs it a one man job and if so which department is it. \n\nIs everything stored together ? \n\nWhat are the current precautions regarding cross contamination ?\n\nIs cross-contamination that could happen from travelling between floors on a stock route even a thing?\n\nThe autonomous robot would only be replacing the routes not the filling of said carts by the warehouse team.",
    "title": "Engineering student forever grateful for your help",
    "subreddit": "nursing",
    "timestamp": 1612044898,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "Seeking advice for considering Nursing Primarily posting as I have been seeking as many opinions or ideas I should consider with pursuing Nursing.\n\nContext: 22 y/o male, previously worked at Discount Tire for 6 months, offered and took a FT scribing job back in 3/2021. Primarily working in Hem/Onc for both an NP and MD but I've scribed in various clinics (Pulmonology, Lung Trans, Cardiology, Heart Trans, Fam/Med, Ortho, etc...it's a teaching institution, when a scribe calls out, I take the shift as an opportunity to experience a new clinic if I am off that day.) I can say that no matter what, healthcare is a calling for me, Jesus I cannot emphasize how much I **love** my job solely for the exposure (pay not so much), especially Oncology. I work for some real OG's in Oncology (An NP with 40 years exp, and MD with 20 years exp in Heme, both have been working together for past 15 years, fantastic mentors to have.) Of note, I do not have my undergrad, I have 2 years of college (mechanical engineering) so most sciences and geneds completed. I'd be expecting to graduate with an Nursing BSN by end of Fall 2024 with my current schooling timeline. \n\nNow  I am seeking advice for the current path and long term path I am thinking of. I want to be a Nurse  with the goal of trying to apply to med school (in like 6-8 years). Nursing offers flexibility/variety, an honest paycheck, all the while earning the responsibility to interact and care for patient. Now when I tell people this plan, they tell me well why not just apply to med school now after finishing your undergrad. Personally, I want to travel, work, and still be in healthcare while in my twenties, and not committing to expensive schooling followed with the certainty that I would be doing this for the rest of my life. I'm too new to the world of healthcare to definitely say: yes I would like to spend 350k to commit most likely the rest of my life to being a Doctor. I think it's there somewhere, but I need more time to make my decision, and Nursing currently offers a great short term path (in terms of schooling) to enter an industry I enjoy, be paid more than $12.50 an hour, and travel/enjoy a life before committing to a multi-decade long career. Now when I tell nurses, resident, med students, fellows, they tell me that most people when they commit to one profession stick to it, and in terms of wanting to be a provider, then why not become an NP instead. Thing is I want to eventually be the final resort/coordinator of care for when complex cases arises, and by no means am I trying to downplay NP or any of that hateful circlejerk that goes around with NPs/PAs, but from having the opportunity to scribe for both an NP (Keep in mind 40 years of exp in Onc only) and an MD (20 years as an attending), seeing him being the final decision maker/recommendations for complex cases, because of his education and journey through the model of medicine, I truly see the importance of the brutal nature of going down the path of medicine, and I know I want to eventually earn that, but man I cannot convince myself that the time is now as I am twenty year old who wants to life a little bit of life that is not solely intertwined in medicine. The only person that has given me the most sound advice is the attending I work with, who says do what you feel is currently right, do not stress about schooling, and I know a Nurse who at 35 took the pre-reqs for med school, applied and is now a resident, so there is no reason you can't do the same. And honestly it's been the best advice I've been given, but so many others have told me that \"once you're a nurse u/stinky_scribe, you stay in that lane in healthcare,\" and personally I am like screw that mentality, but I need to make sure my 22 year old still developing pre-frontal cortex is not overlooking anything with this plan, so here I am taking anything advice that I should consider with this.",
    "title": "Seeking advice for considering Nursing",
    "subreddit": "nursing",
    "timestamp": 1638412091,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "Is 23 too old to pursue a career in nursing? I'm from Riverside, CA and for a long time \"didn't know what I wanted to do\" in life. Graduated high school with 2.5 with math and science only being my A & B classes. Since 16 I didn't know what I wanted to do but all I know is that I wanted to help ppl. Got in CBU on a wrrestling scholarship and was pursuing an engineer degree (only cause the old man wanted it). Funny enough my mom was an RN for about 20 years and I was always fascinated by her stories but didn't think I'd be your \"typical\" nurse. Fast forward 3 years. Working job to job because I can't find my passion, tried a few things here and there and like always doesn't feel like my passion. Is 23 too late to late to start studying to be a nurse? If not, what are best steps to get me on path to start a career in nursing? Any and every thought or advice is welcome ! Please and thank you :)",
    "title": "Is 23 too old to pursue a career in nursing?",
    "subreddit": "nursing",
    "timestamp": 1635235626,
    "score": 0,
    "keyword": "man engineer"
  },
  {
    "text": "Project Management I’m in a position where I need to implement a project management system for a team of about 15 engineers and drafters. Our company has gotten by with everyone basically managing themselves for a long time now but we’ve gotten to the point where we’re bringing several new people on it’s getting pretty unwieldy.\n\nI’m starting the process of researching different project management software, methods, etc. but my impression going into it is that most of these systems are geared towards a larger group of people collaborating on only a few larger projects (is this an off-base assumption?). That’s just not how our company works. The way we operate, we might have over 100 open projects with varying scopes, priority levels, and numbers of people working on them at any given time.\n\n* One type of project might be a larger customer-driven design project that requires hundreds of man-hours and is ongoing for months to years and requires coordination between a project leader (usually a mechanical engineer), the customer, an electrical engineer, a drafter, and a production engineer to varying degrees throughout the process. \n\n* Another type of project is a simple modification to one of our existing products that mostly falls on a drafter with one engineer signing off on it (think changing a cable length). This could be anywhere between 5 to 40 man-hours\n\n* Another type of project might be a R&D project where we’re investigating a new technology and trying to come up with a proof of concept before developing it into a prototype that we can sell before moving onto a full-fledged product release\n\n* Another type of project is researching production process improvements that may be ongoing for many months or years\n\n* Another type of project might be writing a blog post or whitepaper for the website\n\n* The list goes on...\n\nWe need a system that will help manage the few 800 man-hour projects that require a lot of coordination without bogging down the dozens of 8 man-hour projects in unnecessary bureaucracy. To me, the most important things are managing project priorities, keeping track of who’s responsible for what projects, and adding accountability in the form of deadlines and milestones. \n\nAny thoughts or suggestions you guys have on the type of software and systems that we should be looking into would be appreciated!",
    "title": "Project Management",
    "subreddit": "engineering",
    "timestamp": 1619013514,
    "score": 129,
    "keyword": "man engineer"
  },
  {
    "text": "Is my company biting off more than it can chew? Is it sustainable? I've been in my company for about 5 years, been focusing on R&D for our company's own products (motors).\n\nUntil recently I was streamed to the engineering applications team and that's where I was bombarded by many different brands/requirements.\n\nTo name a few, although we sell a certain brand of servo drive of our own, we are distributors to more than 6 other different brands of servo drives and we are required to have in-depth technical know how to each and every one of them. In specific motion control, control theory, systems integration. If you're in this field, I'm sure you know it's already a huge topic itself.\n\nOn top of that, because of the rise of robots (industrial/collaborative), we were also required to know about 2 to 3 of them and be good enough to sell them as distributors, offer guidance, solutions, services to both potential and existing customers. \n\nEvery once in a while, we receive weird requests that is not pertaining to the portfolio offering of the company. For example, customers who enquire about induction motors which is not part of our technical expertise nor products. And mind you some of the questions are specific to IEC standards. Frankly, you can possibly be extremely conversant in all of them standards right? \n\nThat's where I started pondering whether my company is biting off more than it can chew. Specifically the sales team that tries to bite all possible sales regardless of their relevance and potential profit. For example even wanting my team to work on a service project that uses a particular PCI motion controller which is completely unknown to the team in terms of technical know how. \n\nI understand that it's a tremendous opportunity for growth and experience. But my team is only 4 man strong and we have a huge portfolio offering. We can hardly perfect our skillsets with a specific product offering. Jack of all trade but master of none!\n\nI spoke to a fellow senior robotics regional technical support today and he shared with me about his scope of work and I was astounded to heard that he likes his job's focus, that is the line of cobots that his company offers instead of being everywhere. \n\n\nWhich brings me to my question. Am I being too sensitive or naive? Or am I kindda right that my company is trying to dip their fingers into too many sauces?\n\nEnlighten me please!",
    "title": "Is my company biting off more than it can chew? Is it sustainable?",
    "subreddit": "engineering",
    "timestamp": 1635253527,
    "score": 25,
    "keyword": "man engineer"
  },
  {
    "text": "Not sure if this is the right place, but engineers got us into this mess maybe you can get us out. So I'll try to explain as best I can but I don't have pictures right now, I'll update tomorrow with pics.\n\nI work at a gravel crusher, we strip mine, dump gravel into a feeder and convey up to crushing cones. Yesterday the shaft of our feeder head pully snapped halfway inside the drive sode bushing. Since then 6 of us and a welder have tried literally everything, about 20 man hours, to extract the chromium shaft from said head pully/ the god forsaken bushings. \n\nSo far have sheered two pusher bolts, only one of which could be extracted, and shattered a bearing we were using to pull the shaft with using longer pusher bolts. Nearly causing a severe injury, thankfully there will only be bad bruises. I should mention the bushings are in an extremely awkward position, about a foot between head pully and I-beam frame of the feeder. \n\nThere has been a lot of hits with a 50 pound slegde hammer, prying, wedging, anti sieze and finally... welding an eye to the shaft itself and pulling so hard the entire feeder slid over, while hitting from the otherside with a hammer, while trying to push with the bolts. Resulting in a while quarter turn of said pusher bolts. And no decerable movement of bushings or shaft.\n\nSome evil engineers designed this beast.\n\n[pics](http://imgur.com/a/wHFdcQi)",
    "title": "Not sure if this is the right place, but engineers got us into this mess maybe you can get us out.",
    "subreddit": "engineering",
    "timestamp": 1631240384,
    "score": 14,
    "keyword": "man engineer"
  },
  {
    "text": "Drawing Control 101 Hey folks.  So I work for a company that is clawing it's way out of the dark ages.  For about 15 years, the NA branch of this company survived off the EU counterparts engineering dept and drawings.  The production manager here would take those drawings and have the US vendors adapt the part for him to make it fit.  We're left with tons of off-drawing changes that need to be recaptured.  It sucks, but it is what it is.\n\nThe problem we're having now is the inability to decide on how to manage drawing control within our little group.  There's only 3 of us; one is the boss who is not an engineer by trade nor has worked in an engineering capacity at any other company.  He thinks stamps are way too cumbersome.  My coworker is about the same age as our boss and is a degreed engineer, but has spent his entire time as an engineer in a fairly sheltered role and also wants to avoid stamps.  I have bounced from MEP to custom automation and a few places in between, and drawing and rev control to me means reference stamps on all drawings not meant for quote or purchase, all purchase orders require a stamped copy of the drawing being purchased.  \n\nIn the midst of this, I am the low man on the totem pole and so I'm definitely not going to get it my way, so drawings are unstamped.  Now we're only nearing the completion of the first drawing packet when our purchasing department is requesting drawings.  Purchasing has taken these drawings and made hole pattern changes, material changes, etc, off drawing and without engineering input.  I argue this is the destined outcome of uncontrolled/unstamped drawings and in essence that any purchasing dept shouldn't be blindly trusted.  The other two argue that the engineers aren't at fault for those off-drawing changes and what they choose to do with the drawings is out of our control and not our responsibility.  To me it's like handing a toddler a knife and saying \"it's not my fault\" when they misuse the tool and get everybody hurt -- you're responsible for their ability to royally fuck up, even if you don't advocate for fucking up or actively help the up fucking.\n\nMakes me curious how the rest of you do it?  How would you guys handle purchasing agents wheeling and dealing off drawing?",
    "title": "Drawing Control 101",
    "subreddit": "engineering",
    "timestamp": 1629914011,
    "score": 16,
    "keyword": "man engineer"
  },
  {
    "text": "General advice/ questions post Hello all, \n\nI am a 35 year old male who has been trying to make life work in my Indiana town since I was asked to leave at 18.\n\nA short history, I live in a suburb of Indianapolis, IN. I’ve lived here since I was born. My mom and dad divorced when I was about 8 years old. I loved with my mom and my dad was around but was addicted to drugs and alcohol. He was in and out of jail, nothing major. My mom is a little crazy. Anyways she remarried when I was 18 to a man who didn’t want me living with them and they asked me to leave. Enrolled in college for more of a place to stay than anything. It was. Biotech program at a community college. I ended up not finishing due to my unstable home life I didn’t even have created yet. Bounce around a cpl years and work and when I’ve finally got my home life in half working order I enrolled in another community college for biology/applied science and received an associates. I couldn’t find a job that paid anywhere near the ability to pay back my student loans and normal life expenses. My mom then got divorced again and my dad went to prison for meth. My sister who I will now mention is 4 years older than me, she married into a successful family and is now a millionaire and barely talks to any of us. \n\nMy mom eventually wanted to move to Florida and pretty much wasted her life savings on moving down there and getting condos a few weeks at a time claiming she was looking for a job but never found one. My dad got out of prison and has stayed clean for solid year and has been working construction again. Wile visiting my mother in Florida I was able to visit with a friend who had recently moved down there and recently graduated. He opened my eyes to engineering and how many different fields there are. I had absolutely zero exposure to it before. He was really peaking my interest. Then, come to find out, my grandpa, great uncle, cousin and 2nd cousin are all engineers! (Funny enough my mom is estranged from them :)) \n\nWriting this all down makes me feel like we are a super trashy family and maybe we are. You wouldn’t know it from the outside looking in. I don’t want to be like them. I know I’m better, smarter, more dedicated and just to damn inquisitive, and ambitious to just labor and live paycheck to paycheck \n\n\nI’ve always dreamed of having a nice place, bills paid, being mentally fulfilled with my days...  \n\nMy question to you all would be how to circumnavigate this path. How do I explore my avenues of this field, figure out the best way to transverse the path. I would like to know your opinions on the field. What you can do with it, what’s a safe field, what’s a risky field but super interesting and high pay off. \n\nI’ve figured out enough to know how interested i am in a real world practical education and training but other than that I’m a babe lost in the woods. \n\nSo to wrap this up, thank you to anyone with any information you leave or anyone who reaches out. I appreciate your time and thought!!",
    "title": "General advice/ questions post",
    "subreddit": "engineering",
    "timestamp": 1617109691,
    "score": 14,
    "keyword": "man engineer"
  },
  {
    "text": "Is there an equivalent resource for EEs as Marks' Standard Handbook is for MEs? See title. I have found to be Marks' Standard Handbook for Mechanical Engineers extremely useful over the years. Is there an equivalent for Electrical Engineering? My friend's son just got accepted into college for EE and I am looking for a good gift for the young man.\n\nThanks.",
    "title": "Is there an equivalent resource for EEs as Marks' Standard Handbook is for MEs?",
    "subreddit": "engineering",
    "timestamp": 1619674831,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "\"The Guy Who Spent $30 Million Building Trump’s Wall Is Looking for Buyers\" - article on border wall infrastructure & the economics of it & the... charismatic builder promoting it [The Guy Who Spent $30 Million Building Trump's wall is Looking for Buyers | Bloomberg.com](https://www.bloomberg.com/news/features/2021-07-22/trump-border-wall-builder-tommy-fisher-is-looking-for-a-buyer)\n\nJUST FROM A CIVIL ENGINEERING PERSPECTIVE... I don't like the idea of building a wall this close to a riverbed. Erosion is already taking the wall down, and I don't think his vegetation will save the day like he hopes it will. This is like a levee, but with only the downsides (screws with the river's natural flow) and not many of the upsides (doesn't prevent flooding).\n\nHe's being sued by the federal government because he's screwing with the Rio Grande.\n\nBut then if you kick the wall back from the riverbed, then you seal in a lot of land and houses between the wall and the river. There's an interesting paragraph about a family that lived in this no-man's-land between a wall and the river, and they lost their house to a fire because the fire department couldn't navigate the wall access quickly enough.\n\nIf i take off my civil engineering goggles, i do get some schadenfreude at the last paragraph, where it mentions that the wall functions like a big beacon for migrants as they're really TRYING to get picked up by Border Patrol so they can claim asylum. Womp womp.\n\nAnyways, interesting article about wall building and politics and private-public infrastructure and riverbed management and the business of big infrastructure projects.",
    "title": "\"The Guy Who Spent $30 Million Building Trump’s Wall Is Looking for Buyers\" - article on border wall infrastructure & the economics of it & the... charismatic builder promoting it",
    "subreddit": "engineering",
    "timestamp": 1627395668,
    "score": 1,
    "keyword": "man engineer"
  },
  {
    "text": "Just Hold It In Ah social media challenges. I always thought they were stupid as hell: Tide Pod challenge, ice and salt water challenge, coronavirus challenge. I now how another to add to the list: the Devious Lick challenge.\n\nIn the past two days, we have had urinal dividers ripped from the walls, electrical faceplates being stolen, toilets clogged with three or four toilet paper rolls, flush valves being smashed, a freaking AED stolen, graffiti, room signs torn off the walls, the Lord knows how many supplies from the art room are gone, and several pieces of sound equipment from the theater are missing, They even stole from the maintenance crew who are now using loaned equipment from theater and the engineering classes, mostly just drills and box cutters, to do their jobs.\n\nNow, the students are pissed because they can't use the bathrooms during class or lunch anymore. Just hold it in. Well, the idiots among you ruined that for you. I'm sure you're fucking familiar with the feeling by now with all the idiot anti-vaxxers running around. \n\nI hate to sound like a crabby old man, but this is just another sign of moral decadance in the next generation. I'm taking bets, people, is the next challenge trend going to involve murder, kidnapping, or armed robbery all for the sake of clout on social media?",
    "title": "Just Hold It In",
    "subreddit": "Teachers",
    "timestamp": 1631710242,
    "score": 59,
    "keyword": "man engineer"
  },
  {
    "text": "I put together a list of various YouTube channels **Biology:**\n\n* [Journey to the Microcosmos](https://www.youtube.com/c/microcosmos/videos) \\- microbiology, microscopy\n* [Deep Look](https://www.youtube.com/user/KQEDDeepLook/videos) \n* [Crime Pays But Botany Doesn't](https://www.youtube.com/c/CrimePaysButBotanyDoesnt/videos) \\- botany\n* [Animalogic ](https://www.youtube.com/channel/UCwg6_F2hDHYrqbNSGjmar4w/videos)\n* [Microbehunter](https://www.youtube.com/c/Microbehunter/videos) \\- microscopy, microbiology\n* [PBS Eons](https://www.youtube.com/channel/UCzR-rom72PHN9Zg7RML9EbA/videos) \\- ancient history\n* [Natural World Facts ](https://www.youtube.com/user/NaturalWorldFacts/videos)\n* [zefrank1 ](https://www.youtube.com/c/zefrank/videos)\n* [Basin79](https://www.youtube.com/c/Basin79/videos) \\- spiders\n* [Ben G Thomas ](https://www.youtube.com/c/BenGThomas/videos)\n* [AntsCanada ](https://www.youtube.com/user/AntsCanada/videos)\\- ants\n* [Anthill Art ](https://www.youtube.com/c/Anthillart/videos)\n* [TierZoo](https://www.youtube.com/c/TierZoo/videos)\n* [Made in the Wild](https://www.youtube.com/c/MadeintheWild/videos) \\- zoology\n* [Stated Clearly](https://www.youtube.com/c/StatedClearly/videos)\n* [MBARI ](https://www.youtube.com/user/MBARIvideo/videos)\\- marine biology\n* [Anthöny Pain](https://www.youtube.com/c/Anth%C3%B6nyPain/videos)\n* [Nature on PBS ](https://www.youtube.com/c/naturepbs/videos)\n* [BBC Earth ](https://www.youtube.com/c/bbcearth/videos?view=0&sort=p&flow=grid)\n* [Quaoar Power](https://www.youtube.com/c/QuaoarPower/videos)\n* [Animal Fact Files](https://www.youtube.com/c/AnimalFactFiles/videos)\n* [Cornell Lab of Ornithology](https://www.youtube.com/c/LabofOrnithology/videos?view=0&sort=p&flow=grid)\n* [Planet Fungi](https://www.youtube.com/c/PlanetFungi/videos)\n\n**Physics:**\n\n* [Physics Girl](https://www.youtube.com/c/physicsgirl/videos)\n* [Fermilab ](https://www.youtube.com/user/fermilab/videos)\n* [Physics Videos ](https://www.youtube.com/user/EugeneKhutoryansky/videos)\n* [DrPhysicsA](https://www.youtube.com/user/DrPhysicsA/videos)\n* [Minutephysics](https://www.youtube.com/user/minutephysics/videos)\n* [For the Allure of Physics](https://www.youtube.com/channel/UCliSRiiRVQuDfgxI_QN_Fmw/videos)\n\n**Chemistry:**\n\n* [Periodic Videos](https://www.youtube.com/user/periodicvideos/videos) \n* [NileRed](https://www.youtube.com/user/TheRedNile/videos)\n* [NileBlue](https://www.youtube.com/c/NileRed2/videos)\n\n**General Science:**\n\n* [Veritasium](https://www.youtube.com/c/veritasium/videos)\n* [The Science Asylum ](https://www.youtube.com/user/TheScienceAsylum/videos)\n* [The Action Lab ](https://www.youtube.com/c/TheActionLab/videos)\n* [Steve Mould](https://www.youtube.com/c/SteveMould/videos)\n* [Domain of Science ](https://www.youtube.com/user/dominicwalliman/videos)\n* [Sci Show](https://www.youtube.com/user/scishow/videos)\n* [Minute Earth](https://www.youtube.com/c/minuteearth/videos)\n* [Real Science](https://www.youtube.com/c/realscience/videos)\n* [Sixty Symbols](https://www.youtube.com/user/sixtysymbols/videos)\n* [Alpha Phoenix](https://www.youtube.com/c/AlphaPhoenixChannel/videos)\n* [It's Okay To Be Smart ](https://www.youtube.com/user/itsokaytobesmart/videos)\n* [Up and Atom](https://www.youtube.com/channel/UCSIvk78tK2TiviLQn4fSHaw/videos)\n* [Arxiv Insights](https://www.youtube.com/channel/UCNIkB2IeJ-6AmZv7bQ1oBYg/videos)\n* [Nottinghamscience](https://www.youtube.com/user/nottinghamscience/videos)\n* [Sabine Hossenfelder ](https://www.youtube.com/c/SabineHossenfelder/videos)\n* [BackstageScience](https://www.youtube.com/user/BackstageScience/videos)\n* [Sciencephile the AI](https://www.youtube.com/channel/UC7BhHN8NyMMru2RUygnDXSg/videos)\n* [Verge Science ](https://www.youtube.com/channel/UCtxJFU9DgUhfr2J2bveCHkQ/videos)\n\n**Anatomy:**\n\n* [Institute of Human Anatomy ](https://www.youtube.com/c/InstituteofHumanAnatomy/videos)\n* [Armando Hasudungan](https://www.youtube.com/user/armandohasudungan/videos)\n\n**Science Experiments and Building Stuff:**\n\n* [Applied Science ](https://www.youtube.com/user/bkraz333/videos)\n* [Thought Emporium](https://www.youtube.com/user/TheChemlife/videos)\n* [StuffMadeHere](https://www.youtube.com/c/StuffMadeHere/videos)\n* [Tech Ingredients](https://www.youtube.com/user/TechIngredients/videos)\n* [Mark Rober](https://www.youtube.com/user/onemeeeliondollars/videos)\n* [Cody's Lab](https://www.youtube.com/user/theCodyReeder/videos)\n* [TheBackyardScientist ](https://www.youtube.com/user/TheBackyardScientist/videos)\n* [The Post Apocalyptic Inventor ](https://www.youtube.com/channel/UCDbWmfrwmzn1ZsGgrYRUxoA/videos)\n\n**Math:**\n\n* [3Blue1Brown](https://www.youtube.com/channel/UCYO_jab_esuFRV4b17AJtAw/videos)\n* [Numberphile ](https://www.youtube.com/user/numberphile/videos)\n* [Eddie Woo](https://www.youtube.com/c/misterwootube/videos) \n* [Vihart](https://www.youtube.com/user/Vihart/videos)\n* [Stand-up Maths ](https://www.youtube.com/user/standupmaths/videos)\n* [Mathologer](https://www.youtube.com/c/Mathologer/videos)\n* [patrickJMT](https://www.youtube.com/user/patrickJMT/videos)\n\n**Engineering and Electronics:**\n\n* [EngineerGuy](https://www.youtube.com/user/engineerguyvideo/videos)\n* [Mr Carlson's Lab ](https://www.youtube.com/user/MrCarlsonsLab/videos)\n* [Simply Electronics ](https://www.youtube.com/user/sutty6/videos)\n* [Technology Connections](https://www.youtube.com/channel/UCy0tKL1T7wFoYcxCe0xjN6Q/videos?view=0&sort=p)\n* [styropyro ](https://www.youtube.com/user/styropyro/videos)\n* [Real Engineering](https://www.youtube.com/channel/UCR1IuLEqb6UEA_zQ81kwXfg/videos)\n* [The Engineering Mindset](https://www.youtube.com/c/Theengineeringmindset/videos)\n* [Practical Engineering ](https://www.youtube.com/user/gradyhillhouse/videos)\n* [How To Mechatronics ](https://www.youtube.com/user/DejanNedelkovski/videos)\n* [AvE](https://www.youtube.com/c/arduinoversusevil2025/videos)\n* [DiodeGoneWild](https://www.youtube.com/channel/UCQak2_fXZ_9yXI5vB_Kd54g/videos)\n* [SeanHodgins ](https://www.youtube.com/channel/UCE-bw6PRKuDlH6fP1mP4nOw/videos)\n* [GreatScott!](https://www.youtube.com/user/greatscottlab/videos)\n* [Afrotechmods ](https://www.youtube.com/user/Afrotechmods/videos)\n* [Zilipoper](https://www.youtube.com/user/zilipoper/videos)\n* [Vidduley](https://www.youtube.com/channel/UCnSqwyD8RmO-nX1EF_UJXaw/videos)\n* [JerryRigEverything ](https://www.youtube.com/c/JerryRigEverything/videos)\n* [Kyle.Engineers](https://www.youtube.com/c/KYLEDRIVES/videos)\n* [Engineering Explained ](https://www.youtube.com/user/EngineeringExplained/videos)\n* [ElectroBOOM ](https://www.youtube.com/c/Electroboom/videos)\n* [Esperantanaso](https://www.youtube.com/user/Esperantanaso/videos)\n\n**Computer Science:**\n\n* [Ben Eater ](https://www.youtube.com/user/eaterbc/videos)\n* [Two Minute Papers ](https://www.youtube.com/user/keeroyz/videos)\n* [Sebastian Lague ](https://www.youtube.com/c/SebastianLague/videos)\n* [sentdex ](https://www.youtube.com/user/sentdex/videos)\n* [Computerphile](https://www.youtube.com/user/Computerphile/videos)\n* [jdh](https://www.youtube.com/c/jdhvideo/videos)\n* [george hotz archive](https://www.youtube.com/c/georgehotzarchive/videos)\n* [freeCodeCamp ](https://www.youtube.com/c/Freecodecamp/playlists?view=1&sort=dd&shelf_id=0)\\- learn to code\n\n**Space:**\n\n* [Anton Petrov](https://www.youtube.com/c/whatdamath/videos)\n* [Everyday Astronaut ](https://www.youtube.com/channel/UC6uKrU_WqJ1R2HMTY3LIx5Q/videos)\n* [Jared Owen ](https://www.youtube.com/user/captainranic/videos)\n* [SEA](https://www.youtube.com/channel/UCG9ShGbASoiwHwFcLcAh9EA/videos)\n* [PBS Space Time](https://www.youtube.com/c/pbsspacetime/videos)\n* [Deep Sky Videos](https://www.youtube.com/user/DeepSkyVideos/videos)\n* [Dr. Becky ](https://www.youtube.com/c/DrBecky/videos)\n* [Isaac Arthur ](https://www.youtube.com/channel/UCZFipeZtQM5CKUjx6grh54g/videos)\n* [Sci Show Space](https://www.youtube.com/user/scishowspace/videos)\n* [Astrum ](https://www.youtube.com/user/astrumspace/videos)\n* [Cool Worlds](https://www.youtube.com/c/CoolWorldsLab/videos)\n\n**Iconic:**\n\n* [SethEverman ](https://www.youtube.com/user/SethEverman/videos)\n* [Dillon The Hacker](https://www.youtube.com/c/DillonTheHackerisgod/videos)\n* [bill wurtz  ](https://www.youtube.com/user/billwurtz/videos)\n\n**Lectures:**\n\n* [Crash Course](https://www.youtube.com/c/crashcourse/videos)\n* [Khan Academy ](https://www.youtube.com/c/khanacademy/videos)\n* [AK Lectures](https://www.youtube.com/c/AKLECTURES/playlists)\n* [MIT OpenCourseWare](https://www.youtube.com/c/mitocw/videos)\n* [The Organic Chemistry Tutor](https://www.youtube.com/c/TheOrganicChemistryTutor/videos)\n* [Bozeman Science](https://www.youtube.com/user/bozemanbiology/videos) \\- physics, biology\n* [YaleCourses](https://www.youtube.com/user/YaleCourses/playlists)\n* [Harvardphysics](https://www.youtube.com/user/harvardphysics/videos)\n* [Professor Leonard](https://www.youtube.com/c/ProfessorLeonard/videos)\n\n**General Explanation:**\n\n* [Kurzgesagt - In a Nutshell](https://www.youtube.com/c/inanutshell/videos)\n* [Wendover Productions](https://www.youtube.com/user/Wendoverproductions/videos)\n* [Joe Scott](https://www.youtube.com/c/joescott/videos)\n* [D!NG](https://www.youtube.com/channel/UClq42foiSgl7sSpLupnugGA/videos)\n* [Half as Interesting](https://www.youtube.com/c/halfasinteresting/videos)\n* [Tom Scott](https://www.youtube.com/c/TomScottGo/videos)\n* [New Mind ](https://www.youtube.com/channel/UC5_Y-BKzq1uW_2rexWkUzlA/videos)\n* [Vsauce ](https://www.youtube.com/user/Vsauce/videos)\n* [Vsauce2 ](https://www.youtube.com/user/Vsauce2/videos)\n* [TED-Ed](https://www.youtube.com/user/TEDEducation/videos) \n\n**Graphic Design, Motion, and 3D:**\n\n* [Motion Science](https://www.youtube.com/c/MotionScience/videos)\n* [Texturelabs ](https://www.youtube.com/c/Texturelabs/videos)\n* [Video Copilot ](https://www.youtube.com/user/videocopilot/videos)\n* [Spoon Graphics ](https://www.youtube.com/c/spoongraphics/videos)\n\n**Motivation:**\n\n* [Mateusz M](https://www.youtube.com/user/TheMiro0r/videos)\n\n**Music:**\n\n* [Harry Mack](https://www.youtube.com/c/HarryMack/videos)\n* [DOMi & JD Beck](https://www.youtube.com/c/DOMiJDBeck/videos)\n* [CharlesBerthoud ](https://www.youtube.com/channel/UCAi_uNeDWRXj8C8yw358gWw)\n* [Daniel Thrasher ](https://www.youtube.com/c/danielthrasher/videos)\n* [The Dooo](https://www.youtube.com/c/TheDooo/videos)\n* [Markus Veltri](https://www.youtube.com/c/MarcusVeltri/videos)\n* [Marc Rebillet ](https://www.youtube.com/c/MarcRebillet/videos)\n* [Kyle Landry](https://www.youtube.com/c/kylelandry/videos)\n* [Tony Ann](https://www.youtube.com/user/tonyannmusic/videos)\n* [lara6683 ](https://www.youtube.com/c/lara6683/videos)\n* [Majestic Casual ](https://www.youtube.com/c/majesticcasual/videos)\n* [MrSuicideSheep ](https://www.youtube.com/user/MrSuicideSheep/videos)\n* [Mariana Froes](https://www.youtube.com/c/mariffroes/videos)\n* [ibi ](https://www.youtube.com/c/ibiBerlin/videos)\n* [Fkj](https://www.youtube.com/channel/UCxqkOxQYocXRtSqlotgXh7w/videos)\n* [steezyasfuck](https://www.youtube.com/c/steezyasfvck/videos)\n\n**Chill:**\n\n* [Reid Gower](https://www.youtube.com/user/damewse/videos)\n* [Macro Room ](https://www.youtube.com/c/MacroRoom/videos)\n* [Hsinchuen Lin](https://www.youtube.com/c/hsinchuen/videos)\n* [Ingleton Pottery ](https://www.youtube.com/c/IngletonPottery/videos)[ ](https://www.youtube.com/user/billwurtz/videos)\n* [Yukikawae](https://www.youtube.com/channel/UCLGSpxD0XXHnbXtDJJqMqDw/videos)\n* [Kraig Adams ](https://www.youtube.com/c/KraigAdams/videos)\n\n**Outdoors:**\n\n* [Primitive Technology ](https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA/videos)\n* [AlfieAesthetics](https://www.youtube.com/user/AlfieAesthetics/videos)\n* [Learn Your Land ](https://www.youtube.com/c/LearnYourLand/videos)\n* [Yellow Elanor](https://www.youtube.com/c/YellowElanor/videos)\n* [Paul Stamets ](https://www.youtube.com/c/paulstametsofficial/videos)\n\n**History:**\n\n* [Sam O'Nella Academy ](https://www.youtube.com/channel/UC1DTYW241WD64ah5BFWn4JA/videos)\n* [Dan Carlin](https://www.youtube.com/user/dancarlinpodcaster/videos)\n* [Historia Civilis ](https://www.youtube.com/c/HistoriaCivilis/videos)\n* [Military History Visualized ](https://www.youtube.com/c/MilitaryHistory/videos)\n* [HistoryMarche ](https://www.youtube.com/c/HistoryMarche/videos)\n* [OverSimplified](https://www.youtube.com/c/OverSimplified/videos)\n* [Fire of Learning](https://www.youtube.com/user/Fireoflearning/videos)\n* [The Great War ](https://www.youtube.com/c/TheGreatWarSeries/videos)\n* [Drachinifel](https://www.youtube.com/c/Drachinifel/videos)\n\n**Documentaries:**\n\n* [Channel 5 with Andrew Callaghan ](https://www.youtube.com/c/Channel5YouTube/videos)\n* [FRONTLINE PBS | Official ](https://www.youtube.com/c/frontline/videos)\n* [All Gas No Brakes](https://www.youtube.com/channel/UCtqxG9IrHFU_ID1khGvx9sA/videos)\n* [kimgary](https://www.youtube.com/channel/UCOuf_kStlWnhuauw4ce8l-w)\n\n**Blue Collar:**\n\n* [ChrisFix](https://www.youtube.com/c/chrisfix/videos)\n* [HVAC-R Videos](https://www.youtube.com/c/HVACRVIDEOS/videos)\n* [Speedkar99](https://www.youtube.com/c/speedkar99/videos)\n* [AC Service Tech LLC](https://www.youtube.com/c/acservicetechchannel/videos)\n* [HVAC School](https://www.youtube.com/c/HVACSchool/videos)\n* [Word of Advice TV](https://www.youtube.com/c/WordofAdviceTV/videos)\n* [MikeHoltNEC](https://www.youtube.com/c/MikeHoltNEC/videos)\n\n**Comedy:**\n\n* [Vlog Creations ](https://www.youtube.com/c/VlogCreations/videos)\n* [Casually Explained ](https://www.youtube.com/c/CasuallyExplained/videos)\n* [Internet Comment Etiquette](https://www.youtube.com/user/commentiquette/videos)\n* [Alex Ernst ](https://www.youtube.com/user/TheAlexErnstShow/videos)\n* [surreal entertainment ](https://www.youtube.com/c/surrealentertainment/videos)\n* [twomad ](https://www.youtube.com/c/threemad/videos)\n* [Berd ](https://www.youtube.com/c/Berdboi/videos)\n\n**Other:**\n\n* [Lemmino](https://www.youtube.com/user/Top10Memes/videos)\n* [melodysheep ](https://www.youtube.com/user/melodysheep/videos)\n* [Exurb1a](https://www.youtube.com/user/willunicycleforfood/videos)\n* [Dictionary of Obscure Sorrows](https://www.youtube.com/user/obscuresorrows/videos)\n* [Internet Historian ](https://www.youtube.com/channel/UCR1D15p_vdP3HkrH8wgjQRw/videos)\n* [Company Man](https://www.youtube.com/channel/UCQMyhrt92_8XM0KgZH6VnRg/videos) \n* [Objectivity ](https://www.youtube.com/c/ObjectivityVideos/videos)\n* [Booking Hunter TV ](https://www.youtube.com/user/BookingHunterTV/videos)\n* [NightHawkInLight](https://www.youtube.com/c/Nighthawkinlight/videos)\n* [Incognito Mode](https://www.youtube.com/channel/UC8Q7XEy86Q7T-3kNpNjYgwA/videos)\n* [Sharkee](https://www.youtube.com/user/AhSharkee/videos)\n* [Mikasacus ](https://www.youtube.com/channel/UCIWEHR8n8GiLMWY8v7IP0Gg/videos)\n* [Thomas Schwenke ](https://www.youtube.com/user/ehochzwei/videos)\n* [Frost ](https://www.youtube.com/c/FrostV45/videos)\n* [Ahoy ](https://www.youtube.com/user/XboxAhoy/videos)\n* [LockPickingLawyer ](https://www.youtube.com/c/lockpickinglawyer/videos)\n* [EdwardCurrent](https://www.youtube.com/user/EdwardCurrent/videos)\n* [BG Kumbi](https://www.youtube.com/c/BGKumbi/videos)\n* [Disrupt ](https://www.youtube.com/c/DisruptReality/videos)\n* [Simply Explained](https://www.youtube.com/c/Savjee/videos)\n* [EdisonTechCenter](https://www.youtube.com/user/EdisonTechCenter/videos)\n* [Captain Disillusion ](https://www.youtube.com/c/CaptainDisillusion/videos)\n* [Robin Baumgarten](https://www.youtube.com/c/RobinBaumgarten/videos)\n* [Daily Dose Of Internet ](https://www.youtube.com/c/DailyDoseOfInternet/videos)\n* [Sciencium](https://www.youtube.com/user/sciencium/videos)\n* [xkcdHatGuy](https://www.youtube.com/c/xkcdHatGuy/videos)\n* [The Slow Mo Guys ](https://www.youtube.com/user/theslowmoguys/videos)\n* [Michael Reeves ](https://www.youtube.com/c/MichaelReeves/videos)\n\n**Podcasts:**\n\n* [Materialism](https://podcasts.google.com/feed/aHR0cHM6Ly9waW5lY2FzdC5jb20vZmVlZC9tYXRlcmlhbGlzbQ?sa=X&ved=0CBoQ27cFahcKEwjgj5L-4Kr0AhUAAAAAHQAAAAAQQg) \\- material science\n* [Lex Fridman ](https://www.youtube.com/c/lexfridman/videos)\\- long form podcasts with the world's greatest minds\n* [Old Radiolab](https://www.wnycstudios.org/podcasts/radiolab/radiolab-memorable-episode-results) \\- listen to any episodes from 2017 and before\n* [After On - Rob Reid](https://podcasts.google.com/feed/aHR0cHM6Ly9hZnRlcm9uLmxpYnN5bi5jb20vcnNz) \\- science and technology\n* [Hardcore History](https://podcasts.google.com/feed/aHR0cHM6Ly9kY2hoYWRkZW5kdW0ubGlic3luLmNvbS9yc3M) \\- history in depth\n* [The Anthropocene Reviewed](https://podcasts.google.com/feed/aHR0cDovL2ZlZWRzLndueWMub3JnL1RoZUFudGhyb3BvY2VuZVJldmlld2Vk) \\- reviewing aspects of earth on a 5 star scale\n* [Ologies](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5mZWVkYnVybmVyLmNvbS9PbG9naWVz) \\- interviewing people with different science jobs\n* [50 things that made the modern economy](https://www.bbc.co.uk/programmes/p04b1g3c/episodes/downloads)\n* [Speaking of bitcoin](https://podcasts.google.com/feed/aHR0cDovL2ZlZWRzLnNvdW5kY2xvdWQuY29tL3VzZXJzLzM1MTM2NzYxLW1pbmR0b21hdHRlci90cmFja3M) \\- general cryptocurrency discussion\n* [30 animals that made us smarter](https://podcasts.google.com/feed/aHR0cHM6Ly9wb2RjYXN0cy5maWxlcy5iYmNpLmNvLnVrL3cxM3h0dHc3LnJzcw)\n* [This podcast will kill you](https://podcasts.google.com/feed/aHR0cHM6Ly93d3cub21ueWNvbnRlbnQuY29tL2QvcGxheWxpc3QvYWFlYTRlNjktYWY1MS00OTVlLWFmYzktYTk3NjAxNDY5MjJiLzkzZTI3MWJmLTU3ZGEtNDUyNi05MzdhLWFiMDQwMDI0MzczMi8xNWI2OWRhMS0yMDAwLTRmMzUtYTNlYy1hYjA0MDAyNDM3NGYvcG9kY2FzdC5yc3M) \\- disease and epidemiology\n* [Unscrypted Podcast](https://podcasts.google.com/feed/aHR0cHM6Ly9hYW50b25vcC5jb20vY2F0ZWdvcnkvcG9kY2FzdHMvdW5zY3J5cHRlZC1wb2QvZmVlZC9wb2RjYXN0Lw) \\- explanation of cryptocurrency\n* [Big Biology ](https://podcasts.google.com/feed/aHR0cHM6Ly93d3cuYmlnYmlvbG9neS5vcmcvcnNzLWZlZWQ_Zm9ybWF0PXJzcw)\\- biology \n* [Stuff to blow your mind](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vc3R1ZmZ0b2Jsb3d5b3VybWluZA) \\- random cool stuff\n* [Invention](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vSFNXODkzNjQ0MDYyNw) \\- exploring different inventions\n* [TWIV](https://podcasts.google.com/feed/aHR0cDovL3R3aXYubWljcm9iZXdvcmxkLmxpYnN5bnByby5jb20vdHdpdg) \\- the current state of virology\n* [Astronomy Cast](https://podcasts.google.com/feed/aHR0cHM6Ly9hc3Ryb25vbXljYXN0LmxpYnN5bi5jb20vcnNz) \\- astronomy\n* [Origin Stories](https://podcasts.google.com/feed/aHR0cHM6Ly9vcmlnaW5zdG9yaWVzLmxpYnN5bi5jb20vcnNz) \\- evolution, anthropology\n* [Life's Little Mysteries](https://podcasts.google.com/feed/aHR0cHM6Ly9hdWRpb2Jvb20uY29tL2NoYW5uZWxzLzUwMTY3NjMucnNz) \\- general science\n* [Daniel and Jorge explain the universe](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vZGFuaWVsYW5kam9yZ2VleHBsYWludGhldW5pdmVyc2U) \\- cosmology, particle physics\n\n**Booklist:**\n\n* [Full list](https://book4you.org/booklist/99231/aa21a5)\n\n**Non-english:**\n\n* [Deus Ex Silicium ](https://www.youtube.com/user/dexsilicium/videos)\n* [Dr Nozman ](https://www.youtube.com/c/DrNozman/videos)",
    "title": "I put together a list of various YouTube channels",
    "subreddit": "Teachers",
    "timestamp": 1638972604,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "Are there any good careers out there? (rant) For context, 19 year old male picking and choosing between degrees/careers. \n\nI have a fairly wide range of interests. Despite this, I want to pick a career path and specialise. I'm great at studying and have an optimistic work ethic. \n\nHowever, when I research careers (particularly on reddit) it's just a sadness fest. Want to study law? \"It's oversaturated and too competitive pick something else.\" Want to study engineering? \"I've been on the job hunt for 8 months and sent out 200 applications, don't do engineering.\" Want to pursue clinical psychology? \"It's too competitive with 3% acceptance rates for the doctoral program and has low pay.\" \n\nI understand that the world is competitive and that's actually something I look forward to, but when you are constantly seeing these statistics and anecdotal stories about how careers aren't sufficiently lucrative, it gets a little frustrating. Like are there any careers that I can just put hard work in and become successful? Am I too naïve to think luck isn't an element here? I think it's possible that I'm learning the tough truth of the world but damn man there's really no career I am fairly interested in that has any promise? \n\nMy family taught me a lot of valuable life lessons but they are different from me and thus I have no real role model. My alternative is google and reddit to find vocational direction but that doesn't prove to be helpful either. \n\nI'm just stuck here approaching September with no future career in mind. \n\nIs anyone else feeling the same way?\n\nApologies for the babbling, my frustration hit a limit.",
    "title": "Are there any good careers out there? (rant)",
    "subreddit": "careerguidance",
    "timestamp": 1629762165,
    "score": 152,
    "keyword": "man engineer"
  },
  {
    "text": "How do you professionally handle guilt trip attempts from management while resigning? (TLDR; General tips on a professional break/ leaving the doors open for a future return?)\n\nI recently gave 2 weeks notice from my first serious job... This past week, I’ve gotten calls from 3 managers who tried to get me to stay (directly or indirectly). The first just sounded super dejected. The second called promising counteroffer in 24 hrs (which never came). The third said something like “you got that promotion last year and are doing so well! Can you just wait a bit longer?” I’m not even a manager or responsible for anything major... just a specialized mid-level grunt. It feels terrible saying “no, thank you” so much.\n\nMy main reason is the model of the company itself, so the managers cant fix it. Once offices open, they’d want me to move. 6-18 months later, there will be a different client. If less that 45 miles, we commute. Else, we get a very tight budget and short notice to move... I can’t handle that stress anymore. \n\nSo, I want to keep a good impression - just in case someday I want return. I kept my responses to “recent family changes restrict my location,” and gave no criticism otherwise.\n\nI’m worried how bad resigning looks or if I’ll get more calls like that. Any suggestions or advice for handling them?\n\n This job was a ton of “firsts” for me, so it’s scary. Anyway thanks for reading.\n\nEdited to remove unneeded details.\n\n\nEdit: got a call like “if there’s anything we can do to get you to stay...” I’m panicking a little. I seriously didn’t expect this response. I’m just a small fish I keep telling myself.\n\nUpdate: calls keep coming. I feel really weird about causing trouble and shaking everyone up!!! Oh man. But... current company still hasn’t given a written counter offer.\n\n\nFinal edit, a couple months later:\nPHEW, so glad that’s over. It was a rough few weeks. It’s all fine now tho. :) life goes on. So, if you’ve found this post by typing the same question in a search engine — you’ll be OK! It sucks, you’re not alone... but you gotta do what’s right for your life. You’ve already been compensated for your work, so you don’t owe anyone anything.",
    "title": "How do you professionally handle guilt trip attempts from management while resigning?",
    "subreddit": "careerguidance",
    "timestamp": 1613623435,
    "score": 25,
    "keyword": "man engineer"
  },
  {
    "text": "I'm 28, I have 2 degrees in engineering and Computer Science and I only have experience working as an Intern. I can't get over the hump of finding a Full-time Job. What should I do? As the title stated, I haven't ever been an FT employee for a company. I feel so worthless and embarrassed that I'm a 28-year-old man that has only ever been an intern my entire life. I have friends that are moving to senior positions and everybody cracks jokes about how I'm still an intern doing a second degree. Fuckign destroys me, man. I knew these 22-year-old kids I used to train that now have FT jobs while I'm still unemployed. My mental health has been deteriorating because of this and I realized I'm not very smart when it comes to decisions. \n\nI graduated in 2017 with a chemical engineering degree, I had 1.5 years of internship experience in an Oil and Gas company but there was a huge oil downturn and I couldn't find a job. I started the 2nd degree in CS for the sole purpose of becoming a student again to join an oil company as an intern and use my chemical engineering degree to become an FT employee there. That plan was almost going to work but it failed when the pandemic hit in March 2020 and oil tanked. \n\nI now had to fully commit to CS, got an 8-month internship while I was doing FT school. I graduated from CS last month and in my 8-month internship, I barely learned anything. My programming skills are non-existent due to my lack of focus on the fundamental courses when I had no intention of doing CS early on. The internship also failed to land me a FT job because they had \"staffing issues\". So, essentially got rejected by them as well. \n\nNow, I am graduated with 2 degrees and still unemployed. I could barely code and my engineering experience is meaningless now. I lack the focus to grind through and keep sending applications at times. I think I may have ADHD...\n\nMy current plan is to learn Java again from scratch while applying to postings to get interview experience. I don't even want to apply to developer jobs because I can't code for shit and the whiteboard coding questions scare me. \n\nSorry, this is a complete mess of a post, it's around 3 AM here and my brain is not working.",
    "title": "I'm 28, I have 2 degrees in engineering and Computer Science and I only have experience working as an Intern. I can't get over the hump of finding a Full-time Job. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1622961805,
    "score": 16,
    "keyword": "man engineer"
  },
  {
    "text": "Work towards my passion, or work towards survival, THEN my passion? Hi, I'm an electrical engineering undergrad who graduated on Dec 2019. Under various circumstances, I found myself an engineering job at the end of 2020 and I have been working there since. It is a medium sized company, I am in a 4 man technical support team and we are fairly close to each other, and I am learning a lot from them. Sadly, the pay and benefits that the company is giving me is pretty terrible, and so is my boss.\n\nAfter working as an engineer for a few months, I found that it's something that I do not like doing. Within that time span, I have also found passion in illustration. I have been working on my illustration skills for about 9 months now.\n\nMy question is this: I have 2 routes planned regarding my career path. Ultimately, I would like to end up working in the art world. However, as my skills are still developing, I am unsure which is the best decision to make. Here are the 2 paths I have mapped out for my career:\n\n1. I stay with my company, suck up the terrible pay, and work hard on my illustration skills so that I can quickly apply for illustration jobs. I am concerned on how long that would take me.\n2. I apply for better electrical engineering jobs with better benefits, which would likely require me to spend extra time learning new skills. This would slow down my illustration career progress, but I get a more stable, survivable income. And once that happens, I continue to work on my illustration career.\n\nI am 25 this year, and I understand that my perspective of the working society could be immature. I'd appreciate any advice regarding my concerns over my career. I also have heard that while other companies may provide better pay and benefits, having people that you are able to work, learn, and freely express yourself far outweighs low pay rate and benefits in your early career. Lastly, I still live with my parents (if anyone needs this information to be taken into consideration). Thank you all for your time.",
    "title": "Work towards my passion, or work towards survival, THEN my passion?",
    "subreddit": "careerguidance",
    "timestamp": 1637143474,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "Two roads diverged in a yellow road?  I am at a crossroad in my career, and feel I am about to make the biggest decision in my life. I have two great career paths in front of me, and I am completely lost to which choice is best. Either option will result in a lost opportunity. It's just a matter of which path in the woods I should take.\n\nI currently work for a fortune 500 company in Engineering. For the past 5 years, I have thrived and have risen through the ranks. Our growth in this sector is near unprecedented, roughly 25% YoY. Additionally, we've struggled with attrition in the \"old guard\". This combination creates significant opportunities. I rose through the Engineering ranks, took a role in the management team, and now I have been offered a position as Director of Engineering. This has been my dream job, my skills well align to the work, I love my coworkers, and thrive in the stress. The climb has been, frankly, absurd. Each promotion has felt like it would be the last for some significant period of time, yet opportunities just keep coming.\n\nThat said, there is now another path. My dad started his own company 4 years ago. Completely different industry, but it has exploded in a very short time. It started as a 1 man firm and has already grown to a stable mid-size company spread across the country. What's more, it is clear they are only just getting started. He has capitalized on an underserved market, and outperforms his competition substantially. Calling them a disruption to the market would be an understatement. He wants me to come on board, learn the ropes, and help him grow the business. There is a high potential their portfolio will increase fourfold in the next two years. I'd start off with a bit less salary than I have now, but the long term potential would be directly tied to future prospects. I would also take a role with the executive leadership team, and have the chance to grow as a strategic planner. Perhaps most importantly, I trust him implicitly, and he has a frustrating habit of being right way more often than not. He obviously is aware of how well things have gone at my current employer. When asked if he would jump ship if he were in my shoes, he didn't hesitate. He is incredibly confident that I'd be better off joining his team than continuing on my current career.\n\nWhichever way I go, I am closing the book on the other opportunity. I have been wrestling this choice for the past two weeks, and running out of time to make a decision. Every hour I change my mind, talk myself into or out of a choice. The last couple nights I couldn't sleep. Looking for some perspective!",
    "title": "Two roads diverged in a yellow road?",
    "subreddit": "careerguidance",
    "timestamp": 1624021434,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "Choosing a New Position ?  \n\nHey Reddit!\n\nI am an engineer in a rotational program at an automotive company where we do three one year rotations and then get placed into a more permanent role. I am at the end of my rotations and am in the process of deciding what to apply to as my permanent full-time role. One of my previous teams has an opening and it is pretty set that if I want it, I would probably get it. I am going back and forth on whether or not I should go for this one or try for something else. We submit three roles that we are interested in and then interview and are placed by the program leaders. So note that if I put it as an interest it is about 90% certain that it will be my role, while if I do not, I risk getting something that is not at all what I want to do.\n\nPros:\n\n\\-I know exactly what my job will be and am familiar with it. While it has its busier and less busy times, the overall work/life balance is great and I would get to work from home quite a bit while still getting to do hands on work that I love.\n\n\\-There are a lot of perks with this role since it is one of the bigger vehicle programs such as better job security, getting to use vehicles for personal use, more staff/support, etc.\n\n\\- It is at the corporate office location geographically that I prefer the most, where as some of the other roles would make me have a much longer commute and be in less favorable areas.\n\nCons:\n\n\\-My main point of concern/biggest concern is that I am not a huge fan of the man I would be working directly with. He is not awful, just your typical mans-man boomer that has pretty obvious controversial political opinions. He lives to work and nothing else so takes everything super seriously and is way too detailed with a lot of things. There were often days that I worked with him where I would feel so burned out just listening to him tell the same weird story a million times over lol. He has always been extremely nice to me and even took extra time to teach me a lot of the coding skills I have during the year I worked with him. It should also be noted that I will not be working with him 24/7 especially once I am more familiar with my duties, but there will always be a lot of contact with him and travel together. I know a lot of people have coworkers they do not like, it is just that I have LOVED all of my other teams that I have worked on and consider a lot of them actual friends, where as he is probably the worst personality I have worked with.\n\n\\-The type of work it is often looked down on a bit, and people do not get promoted as often within it. I do not have a huge problem with that since I have no desire to be a manager and I do not have to do this role forever, but it is something to consider.\n\n\\-While it is good experience, it is not a super technical role, and I worry that it would be better to do something where I would expand my technical knowledge more, familiarize myself with other software, areas of work, etc.\n\n\\-There is an opening in another area with my first manager and team that I LOVED, but the job is less secure, has less perks, would be more stressful etc.\n\nSo far there are no other roles that I REALLY want to do, but a few that I am pretty interested in. I know that this is not super permanent, and I could always do this role for a few years and then move on, but I am just really struggling. Any input would be appreciated!",
    "title": "Choosing a New Position ?",
    "subreddit": "careerguidance",
    "timestamp": 1633988953,
    "score": 2,
    "keyword": "man engineer"
  },
  {
    "text": "Anyone else feel like LeetCode encourages bad programming practices? I'm a mid-level Data Analyst (Spend roughly 50% of my time coding), and previously I worked as a software engineer. Both places are fairly well known financial firms. In total, 5 years of experience. \n\nI've recently been doing LeetCode mediums and hards to prep for an upcoming interview with one of the Big Tech Companies, it will be my first ever interview with one of the Big Tech companies. However I seem to continously get dinged by not optimizing for space/memory. \n\nWith 5 years of experience, I feel I've been conditioned to substitute memory optimization for the ability to easily refactor the code if requirements change. I can count on one hand the number of real-world issues I came across where memory was a problem, and even then moving from grotesquely unoptimized to semi-optimized did wonders. \n\nHowever, looking at many of the \"optimal\" answers for many LeetCode Hards, a small requirement change would require a near total rewrite of the solution. Which, in my experience, requirements will almost always change. In my line of work, it's not a matter of if requirements will change, but how many times they will.\n\nWhat do you all think? Am I the odd man out?\n\nIf anyone works at one of the Big Tech companies, do requirements not change there? How often do you find yourself optimizing for memory versus refactoring due to requirement changes?",
    "title": "Anyone else feel like LeetCode encourages bad programming practices?",
    "subreddit": "cscareerquestions",
    "timestamp": 1629981453,
    "score": 1447,
    "keyword": "man engineer"
  },
  {
    "text": "A journey from one year of unemployment to multiple job offers **TL;DR:**\n\nI quit my job as an entry level QA/STE/SDET/whatever you want to call it last June. Life doesn't go quite as planned, so I spent last July to March of this year being sad and doing nothing. I decide to go all in on LeetCode for \\~3-4 months, and land multiple offers from big tech companies, learning a bit about myself & the study process along the way.\n\n**Where it all began:**\n\nI left my job in testing almost exactly 1 year ago today for a handful of reasons. I would say the biggest reasons were that I wanted to make a transition into SWE and burnout from poor WFH practices that I had. I told myself I would take a \\~2 month mental break before getting back to the grind. The day after I put in my 2 week notice, I get dumped by my girlfriend. This makes me sad.\n\nThe 2 months I set aside for myself pass, and I start trying to do LeetCode (henceforth abbreviated LC). It was hard and I felt like it was going nowhere. At some point in November I began applying to jobs, hoping that having an interview would push me to study. I get ghosted/rejected by every company. This makes me even sadder and I sink into a slump that lasts until March, where I do not accomplish anything career related.\n\nI instead sunk all of my time into playing video games, because I was good at these. Eventually I realized that I was deriving almost all of my happiness and self value from how good I was at these games. This made me very scared about the direction I was heading in my life and I decided to make some major changes.\n\n**The power of habit:**\n\nI had about \\~100 LC problems solved prior to all of this. Link to my LC profile if you want to see just how closely the submission history matches the story I am telling: [https://leetcode.com/aTastyStrawberry/](https://leetcode.com/aTastyStrawberry/)\n\nIn mid-late February, I logged in to LC hoping to change the direction of my life. I attempted to do some problems but struggled as expected. I was getting pretty frustrated, but then I noticed something called \"February LeetCoding Challenge 2021\". I clicked on the link and read about it. The challenge advertised itself as a beginner-friendly challenge that is essentially just solving 1 question per day. I thought this sounded pretty cool, but since it was already mid-late February, I told myself I would just do the March daily challenges.\n\nMarch comes by and I actually forget to do the first few days, but I've had enough at this point and I refused to wait until April to make a change so I decided to just start a few days late. I actually got kind of lucky with this, because in more recent months some of the problems at the start have been a bit too difficult to consider \"beginner friendly\". I promised myself that no matter what, I would solve at least the daily problem every day. I found my confidence growing over time as I began to remember old concepts about DS&A. This eventually snowballed into a system where I was solving several problems per day, every single day.\n\n\"Alright, time to log in and do my daily problem. Oh, this problem is pretty similar to what I just did. Might as well do this problem too. Oh, well I'm already on the website, and it did feel kind of good to solve those other problems. Might as well do some other problems while I'm here.\"\n\nThere are 3 major learnings here, which I will touch on. Some of these are really obvious and you probably already know them to be true.\n\n1. The hardest part about building any habit is starting. After you establish the habit, everything after just seems to fall into place with a fraction of the effort.\n2. If you're struggling with LC, you probably aren't as stupid as you are making yourself out to be. In most cases, it just means you haven't learned a fundamental concept or you're a bit rusty. When I was a kid I watched a show called \"Are you smarter than 5th grader?\" and I always remembered thinking adults were so stupid for not being to get basic trivia. Looking back at this, it's clear that it's absurd to expect somebody to be able to recall some obscure fact that they may or may not have learned 20+ years ago.\n3. I didn't hate/dread LC itself. Turns out I LIKE doing LC. I just hated being bad at LC. If you really hate doing LC, try doing it seriously for a bit. If you still hate it afterwards, that is fair and understandable. But who knows? Maybe you'll come to enjoy it.\n\n**The first offer:**\n\nMy resume went through \\~8 revisions between February and April. I was beginning to get interviews, and oh man did I bomb my first few. I had an interview where I knew that I was going to fail about 5 minutes in. I had a phone interview where my interviewer asked me a multithreading question that I didn't know the answer to, and I spent the next 15 minutes more or less guessing what to do with 0 feedback/mercy from him. It felt really bad, but I remained optimistic by telling myself that no matter what, I was improving over time.\n\nTwo months in to my LC grind, I had the good fortune of being given a referral to interview for a big tech company by a hiring manager. I'm comfortable enough with LC at this point. I could solve most medium problems in < 15 minutes. I breezed through the OA and get invited to the final round. Despite failing a bunch of interviews before this, I actually felt somewhat confident for this interview. The reason I felt confident for this interview specifically was because these types of interviews are pretty well documented. I knew that I was going to be asked these LC style questions that I was so familiar with at this point. In order to not burn myself out prior to the interview, I instead shifted my focus over to behavioral elements of the interviews.\n\nEvery other day or so, I read a post that is titled something like \"I am a QA engineer right now, how hard will it be to get into SWE?\" My answer to this question is that you will either be at an advantage or a disadvantage, but you are the one mostly in control of which one that is. Learning to talk about your own experiences is an important skill that should not be overlooked. Take time to practice talking yourself up and build confidence in whatever it is that you did. Learn to spin your experiences in ways that are relevant to where you are applying to. The worst thing that can happen in this position is you convey to the interviewers that you do not think you have what it takes to succeed. Do not let this happen under any circumstances.\n\nThe day of the interview arrived and I completely crush it. I signed an NDA so I can't give out the exact problems, but what I can say is that I was asked questions between the medium and hard difficult on LC. Funnily enough, I had actually done none of the exact problems before on LC, but my fundamentals were strong enough to work through the problems extremely comfortably in the time allotted.\n\nI receive an offer. It's a really good one for an entry level position according to [levels.fyi](https://levels.fyi). I tell my Asian parents the good news. They verbally abuse me for only 5 minutes compared to the usual 30. Life is good. The story has come to a close, seemingly.\n\n**The second offer:**\n\nI had some other interviews lined up still when I received my initial offer. I knew that if I could get a competing offer, I could maybe up my TC by a fair amount of money. Or better yet, maybe I could get an offer from somewhere I'd want to work for even more. I had already done all of the studying, so I figured it just made sense to interview while my LC skills are still fresh and at their peak. I was in the loop with two big tech companies, who I will refer to from now on as Company A and Company B.\n\nI had final interviews scheduled with Company A. After acing a phone interview with Company B, a recruiter calls me and tells me that I'm invited to a final round with them. I'm ecstatic, and then the recruiter drops a bomb on me. I'm not interviewing for an entry level position. I'm interviewing for a level 2 position, and down levelling is not an option since there are supposedly no available spots.\n\nPanic. I had geared all of my preparation towards finding an entry level position. I haven't studied system design at all. The recruiter tells me that she understood the nerves, but to try my best and that I might surprise myself. After talking to a few friends about the situation, I made the decision to cancel my final interviews with Company A and go all in on studying system design. I studied 55+ hours of system design over the next 5 days.\n\nI went into these interviews with a win-win, learning attitude. I told myself \"If I do well on this interview and get an offer, that's cool. If I don't, that's OK because now I know what to expect when I interview for the next level up 1-2 years from now.\" Funnily enough, I had 0 nerves because I was expecting to completely fail.\n\nI tried my best in these interviews, and I know for a fact that I had a strong performance on the coding interviews, but wasn't so sure about the others. I also signed an NDA for this, but I would say that this interview difficulty mostly fell between medium and hard LC questions as well. And once again, I've done none of the exact problems before. I get a call back from the recruiter the next day.\n\nI've done well enough in the interviews to skip a few steps and I am given an offer on the spot. I don't believe it. I pinch myself, I don't wake up. One and a half months ago I had woken up from a dream that I got an offer from one of my dream companies. That hurt to wake up from, and I wanted to make sure this wasn't just deja vu. I take some time to process the info and think about it. Over the next 48 hours, my offer's compensation changes and I was really happy with it. I also spent a lot of time talking to a few friends and mentors before deciding to take the leap and sign on with Company B.\n\n**On interviewing & software engineering:**\n\nI'm not here to debate/discuss the current state of tech interviews. Do I personally think it's silly that some random NEET can study LC and cram system design in 5 days and get a SWE2 offer, while somebody who has been working hard as a SWE1 for 2 years might have difficulties getting naturally promoted? Yes, but that talk is not for now.\n\nInterviewing is a skill. It does not definitively say anything about your software engineering skills. Do not let rejection from these interviews bring you down about your potential as a software engineer. Similarly, I do not believe passing these interviews makes me a better software engineer than anyone else. I've never even had the title of \"Software Engineer\" in my life before!\n\n**On shortcuts and \"the secret sauce\":**\n\nShortly after receiving my offers and telling a few people about it, I suddenly had a lot of people reach out to me asking me for any tips and tricks I had. How did you do it? What's the secret sauce? The funny thing is, a good number of these people are people I had asked to study with from day 1. They gave me a number of excuses that I won't go into detail about in this post. They saw me studying day and night. I told these people that the \"secret\" was right in front of them the whole time.\n\nOutside of a few things like the Blind 75 list and LC premium telling you what problems are frequently asked, there is no secret sauce. It just comes down to how much you are willing to put in.\n\n**Personal tips for LeetCode:**\n\nBelow I will list a couple of the strategies & tips that I utilized throughout my 3-4 months of daily LCing. I just want to quickly say that this is what worked for me. As you dive into your own LC journey, it's entirely possible that you develop a system completely different from mine, and that's ok if it works for you!\n\n1. The most important thing is sustainability. A lot of people who start new habits tend to go extremely hard and burn themselves out all too soon. To avoid this, I asked myself this question: \"Can I see myself repeating the same level of grinding tomorrow?\" If there was any doubt, I usually would stop.\n2. Pick your problems wisely. Do not do problems for the sake of increasing your problem count unless you are just starting out and need a confidence boost. Challenge yourself. Problems you solve should accomplish one or more of these things: teach you a new concept, teach you to apply a familiar concept a different way, reinforce your understanding of a concept, or combine multiple concepts you've learned already.\n3. Don't cheat. Remember the goal. We are here to learn, not to specifically solve problems.  If you've been stuck on a problem for a long time, it can be tempting to go look for \"just a hint\" by looking at what the beginning of the solution might look like. I felt this too, and I realized that this was just my fragile ego speaking. My ego wanted to be able to say \"oh yeah, I knew that\". Remember, you are here to learn. If you're stuck on a problem, chances are you don't understand certain concepts well enough to move on. And that's OK! Move on to other problems and come back maybe a month later. Maybe you'll understand it then. The problems that challenge us the most are often the most valuable-do not cheat yourself out of a valuable learning experience. \n4. Work on your coding style as you do LC. When I first began the grind, I know for a fact that I was typing pure garbage. It was tempting to move on from a problem the moment I saw that my solution was accepted. Remember, LC is merely a means to practice for the technical coding interview. You should revise your code until you would consider itself presentable in an interview. I remember thinking to myself that this was so time consuming, but honestly this saved time as the months flew by, since cleaner code is easier to debug and think about. Being able to write readable & stylistically good code is a skill in itself that should not be ignored.\n5. If you can get a friend to study with you, do it. Having somebody hold you accountable is a proven tactic to work in just about anything. If you can, discuss problems with them too. Being able to talk about problems is a skill that is arguably just as important as being able to come to the optimal solution. I owe so much of my success to the people who have studied and discussed problems with me.\n6. If you are somebody who chokes under pressure, you should consider doing the LeetCode weekly contests. As somebody who does not perform well under intense pressure, I began doing the contests every week to simulate a situation where I need to code under pressure. I believe this was a huge contributor in me being able to perform in a stressful interview setting.\n7. This is a more personal thing, but I cared a lot about my acceptance rate. After I've written a solution to a problem and pass the base cases, I never immediately hit Submit. I always add a few test cases of my own to make sure I've done my due diligence on some obvious edge cases. I think this habit made me very good at spotting things that could go wrong. This proved to be very valuable to me in the interview process because I was able to catch bugs in my code logically and independently.\n\nAgain, these are just rules that I followed. There are a handful of others but this post is just so god damn long already I don't want to go into more depth.\n\n**Closing thoughts:**\n\nI also often get asked what I would do differently if I could do all of this over again. Honestly, I would keep most of it the same. The biggest thing I would change is my levels of physical activity throughout this grind. I wish I went to the gym/outside more, and that I ate healthier throughout the process. I feel so physically sick and unhealthy, but that's the next grind I guess.\n\nIt's crazy to think about, really. If you told me four months ago that I would one day be in this position I would probably tell you not to make mean jokes. I'm still processing it to be completely honest. In a conversation with my parents, they recommended that I reflect on the experiences and what I learned. \n\nI figured that one way I could do this via a Reddit post. Honestly, it would be so cool if just one person gains something from this. I'm a pretty big lurker on Reddit and I'm a noob at making posts, so I'm just going to say some things now that feel like natural ways to end posts. Apologies if the formatting is complete garbage. English isn't my first language (technically true), so please go easy on me.",
    "title": "A journey from one year of unemployment to multiple job offers",
    "subreddit": "cscareerquestions",
    "timestamp": 1624140404,
    "score": 526,
    "keyword": "man engineer"
  },
  {
    "text": "Revature: A comprehensive, no BS review Hello all. From my experience, there is a lot of unclear, mixed, and odd information on Revature online, specifically on this subreddit. I am going to write this review of Revature (my experience thus far) in attempt to publicly clear some of it up. I hope this will benefit some of you. The following two paragraphs will be an introduction to what Revature does; skip them if you are already familiar.\n\n**WHAT IS REVATURE?**\n\nWhat is Revature? Revature is a sort of hybrid combination of employment agency and software engineering/coding bootcamp. It is marketed as the bridge between the infamous “2+ years experience” requirement you see on “entry level” jobs and people without said experience. Revature is not the only company that does this; there are others like them. FDM Group is one I can name off the top of my head. But Revature undoubtedly is the most well-known, likely because they have somehow managed to post job listings on nearly every job board in seemingly every city in the US. And guess what those listings are titled? Yep, “entry level software engineer. No experience needed!”\n\nThey have recruiters who guide you through easy little entry interviews to get you signed up for a training start date. These trainings usually take place on a few college campuses, I *think* mostly in the East and South US. Florida, Virginia, West Virginia, Texas.  *As of writing, all of the trainings are happening remotely due to the pandemic; mine was remote*. If you do not have much experience with coding, they will tell you that you have to do a 2-4 week online live class called Spark, and this training is completely unpaid and contract free. After you pass that, you can qualify for one of the bootcamp trainings, during which you get 10 days contract free and then are told you have to sign to continue. After training, you go to a staging phase where Revature works to find you positions with various companies and get your interviewed for them. These companies are almost entirely massive companies, a lot of Fortune 500s. Revature then pays you 45k (more if in high COL) your first year of work, and then 55k your second year of work (also more if high COL). They then will offer you a third year contract free if you want, and that’s 75k salary. You are offered a small stipend to help cover moving costs when moving to on-site training and job sites.\n\nIn short, Revature trains people (a \\~3 month bootcamp) in various techs and then contracts them out to companies to work for 2 years. And you’re paid for the entire experience. They really do this; it’s not a scam. But there are some catches and some sketchy things that I will address.\n\n**THE CONTROVERSIAL THINGS**\n\nIt mostly sounds marvelous, right? What’s the catch? The *big* one you’ve probably already heard of is the contract and how it works. The contract has all these little conditions you aren’t supposed to break, the main one being that you can’t just up and leave once you’ve signed their contract. If you do break the contract, they say you will be charged with a whopping 46k. It used to be less and they recently have increased this.\n\nAnother catch is that you are basically paid minimum wage until you actually start a job for whatever company they contract you out to. That means that during the bootcamp and the staging phase (which usually ranges anywhere between 1-3 months), you will make very little. And on top of that, your 2 year clock on the contract doesn’t start until your first day with a client. This means training and staging time does not count towards that 2 years, even though you’re still locked in at that point.\n\nPerhaps the worst catch of all is what I see as the Revature nightmare situation. This has to do with a mixture of being locked into that contract and being moved around geographically. Technically, the clients you are contracted out to are often bringing you on for big projects. Rarely, someone will reach completion of the project and the company will then say “k, we’re done with you then” and send you back to Revature, where you are placed back in the staging phase where you will again make minimum wage. That is, until they find you another company to go work for or until you’ve been in staging for \\~3 months (and they then let you go penalty-free).  You could also get sent back if the client doesn’t like you, but you have to be a big underperformer or do something bad for this to occur otherwise Revature will fight for you to keep you in your position.  But during non-pandemic times, this literally means you would have to move from your training site where you are in staging, to the job site where your client is located, and then back to the training site again when they are done with you. Yes, you can a small stipend to help cover moving costs, but Revature doesn’t give a damn if you have to break leases or eat big costs for long-term stays at Airbnbs. With Revature you have to be light on your feet, and you could be sent across the country at a week’s notice. There’s a lot of geographic unknown.  And who knows, maybe they are more reasonable with this than I’m giving them credit for.  I never personally spoke with anyone who went through this, I just know it is possible in theory.  In most cases, you go to your project and you stay there the whole time, problem free.\n\nThe pay is also, without a doubt, fairly low.  People also rage about this.  Being a software engineer getting paid 45k isn’t wonderful, but it’s just for one year, and it’s enough to live off of.  The value of Revature isn’t the salary, it’s the resume building and the increase of the future value of your salary.  Maybe you can go get a job making 60k for the next 4 years, or maybe Revature will pay you 45k for year 1, 55k for year 2, and then you go land a job making 100k afterward.  Maybe not, who knows, but you get what I’m saying here.  Be real with yourself and consider how much you’d be missing out on if you didn’t do Revature.  If you’re like me, you wouldn’t be missing out on anything.\n\nLastly, I’ll mention that you don’t usually get to pick what tech you are trained in.  I had no idea what I would be trained in until day 1 of my paid training.  Some people I spoke with mentioned that their recruiter gave them a choice.  Mine didn’t, but it worked out fine.  Revature is only training people in tech that they believe employers see as marketable, otherwise they can’t sell you to them.  This is how Revature works for you, and they’re looking out for you during that entire 2 years because they win when you win.\n\nSo that’s the bad. When you hear people badmouthing Revature, they usually stop here.  But let me tell you: for me and man others, the good far outweighs the bad. *Virtually no one gets stuck with the contract breakage fee, even people who actually break the contract*. I think it’s obvious as to why. The contract is, to a degree, a scare tactic that has to be in place for Revature’s business to be possible, otherwise people would take their paid training and then scoot off to do their own thing. But they are transparent about it, they went over the contract with us many times, and we all knew what we were getting into. Sure, in a perfect world that breakage fee wouldn’t be there, but if you just don’t break the contract, there’s never going to be any issue at all. If something does happen like they can’t find you a job, they literally will just tear your contract in two and say “you’re free to go.” They do not try to stick people with it, it’s just meant to keep people on their track for 2 years and that’s it. I know of absolutely no one who has gotten threatened or stuck with the fee.\n\nThe minimum wage thing is often blown **WAY** out of proportion too. People rage about how Revature is so awful for paying you minimum wage, but you have to remember that *you are literally being paid to learn.* Imagine if you had gotten paid to go take college CS courses, wouldn’t that be great? Instead, you had to pay out of your butt for tuition. Bootcamps are like this too, usually! You pay a massive 10k+ sum of money and just hope that what you got taught will land you a job. With Revature, not only do you not have to pay a fat sum of cash, you will actually *make* cash while learning, and it puts the incentive on them to ensure that they are teaching you stuff that will actually make YOU money and land YOU jobs, because they have to sell you. And besides, you’re only going to be paid minimum wage for a few months. That is extremely short term, and then you begin to make a living wage. The bootcamp and staging pay is just meant to allow you to not go into debt and to put food on the table until you get to the actual job.\n\n**MY PERSONAL EXPERIENCE**\n\nI do not have a computer science degree.  I majored in business and had little to no coding experience previously, just some experience with VBA when messing around with Excel and maybe like 2 hours experience with Javascript.  I had to do their initial 4 month unpaid class and that just solidified for me how much I liked doing this stuff.  I started getting into Revature right as the pandemic was getting bad so I had a few bumps concerning that, but in the end, Revature trained me in a fantastic, relevant, modern tech that I love doing.  I pretty quickly went from training to getting a real software engineering job with a real tech company, even without a CS degree.  I’m a couple months into my project/actual job now and I’m really liking it.  Coworkers are great and the job is going to look great on my resume.  And on top of all this, I now have a network of bright blooming software engineers from my training batch.  They’re going to all kinds of companies and I keep in touch with them.  Teaching myself would not have given me this.\n\nDuring training, I was working extremely hard and at most was doing like 15 hour days.  Definitely worked weekends, though they aren’t paid.  However, later in the training, my work hours plummeted and I would sometimes only be working for 4 hours a day.  Note that you’re paid for that 8 hours a day, nothing more nothing less.  The training varies based on your trainer and how he or she wants to do things.  Mine liked to lecture for around half the day and then leave the rest of the day open for us to do some self teaching and to experiment and work on projects.  I liked this approach, as our trainer was still completely open and available for questions and consultation even after releasing us.  Think of training like it is a very full college semester, except you’re getting paid for it.\n\nRevature WILL release you if you do not perform well in training, but they won’t make you pay the fee.  It’s not all hand holding either, so you really have to keep your head down and focus and work hard during that training.  The people in my batch who were already software engineers found the training to be easy overall, whereas people like myself found it to be hard.  It varies between people.  It was challenging doing it 100% remote, but you get used to it after a while and start to appreciate it too.\n\nDuring staging, you’re “supposed” to be working for 8 hours a day to practice on your own and stuff, but most everyone just slacks off and collects the 8 hours of pay while they wait for interviews.  Just how it is.\n\nAnd then after that, it’s just the job for the next 2 years!  This is when you finally get paid the living wage.  You hardly even interact with Revature at this point, they just pay you.\n\n**BOTTOM LINE**\n\nRevature is a great opportunity if you’re like me and want to get into the tech field and don’t have a CS degree and you can manage possibly having to work on the other side of the country. It has its downsides like every job does and Revature has a lot it needs to improve, but none of these cons are enough to lead me to tell you to avoid it. If you already have a CS degree, I don’t really know why you’d be trying to get into Revature. Many of my fellow trainees are not as happy with Revature as I am because they didn’t get nearly as much out of training, *because they already knew how to do most of what we were taught*. They are extremely overqualified. If you have your CS degree, pick a marketable tech and do your own projects and push them to GitHub. Apply to jobs everywhere. Otherwise, if you’re fine with making a bit less for a measly 2 years, then yes, Revature will be a fine option to get you over that entry-level job hump that we all dread.\n\nI'll be glad to speak on anything you have questions about.  Drop me a comment and I'll respond.\n\nAnd finally, *if you found this review helpful and are going to sign up for Revature,* I do have a referral link that will yield me a bonus. You don’t have to use it, and I’m not making this review to advertise it, but I’d greatly appreciate it if you did and it would be a great way to thank me. If you’ve already signed up, I’d appreciate it if you asked your recruiter if you could apply the referral link to your profile nonetheless.  I'd prefer to not leave it out here publicly though, and will provide it to you via DM if interested.\n\n&#x200B;\n\nEDIT: One guy here has brought up a good point, and that's alternatives.  You can find my comment below where we discuss it, but I want to add here that Capital One's CODA program is another \"hire and train you before putting you to work\" gig that is almost certainly going to be better.  I knew about it and wanted to do it, but they were not hiring.  I was trying to find a job at the start of the pandemic and had very little confidence that they would start hiring again anytime soon.  Check that out and apply to it if you can before doing Revature.",
    "title": "Revature: A comprehensive, no BS review",
    "subreddit": "cscareerquestions",
    "timestamp": 1609520496,
    "score": 334,
    "keyword": "man engineer"
  },
  {
    "text": "PSA/Rant. Recruiters who won't give you a salary range should be ignored and unlimited PTO is (still usually) a scam I am so sick and tired of recruiters playing the ridiculous game of being so ambiguous about the range of salary, and I will never for the life of me fucking understand it. \n\nOf all the behaviors that are normalized in the recruiter industry this is one that personally drives me the most crazy, because it can lead to so much wasted time (on both ends). \n\nA typical Linkedin thread will go - \n\nRecruiter:\n\n>Hi, <ME>  \n>  \n>I am reaching out to see if you are interested in the following Software Engineering opportunities with roles that offer healthcare, sponsorship, 401k match, relocation and remote opportunities, as well as unlimited PTO! Can we schedule a time for a 30 minute call?\n\nWhich I'll reply:\n\n>Hi, <YOU>  \n>  \n>Thanks for reaching out. I'd like to ask the salary range on the position before dedicating any time over the phone. Can you provide that please?\n\nRecruiter:\n\n>That will depend on where you're located, how experienced you are, and in some cases how you perform in the technical interviews\n\nMe:\n\n>All of this information is on my profile. Can you please provide the range for my YOE and location? (if you don't want to check, it's 15, and $MAJOR\\_USA\\_CITY\n\nRecruiter:\n\n>I'd be happy to discuss on a quick call! Can you provide a phone number and time I can reach out?\n\n\\--- \n\nI'll spare you all the rest, but the ultimate result was I browbeat him into giving me a range (for principle, if anything, knowing I wasn't going to go with this recruiter) which was significantly lower than my expectations and what I currently make. 30 minute phone calls with recruiters are expensive when they only happen in business hours, and require context switching, and I've found they still often don't want to give you a range for the position in question. We, as CSCareer Prospects, need to start making a hard stop on recruiters playing these games with us. It has no benefit to us to wait until the negotiation phase to talk about these things. Sure, some companies have something of a \"blank check book\" when it comes to offers, but not every opportunity (or even most) is some mega-corp-FAANG opportunity. Most companies operate on a budget where roles are clearly defined, and salary ranges exist for said roles. This information is there, and they are just refusing to give it to you unless you're willing to potentially waste your time speaking with them. \n\n&#x200B;\n\n\\---\n\n***Unlimited PTO - we've all seen the talk about it. I'll say it again. Don't let recruiters honey-pot you with this bullshit.*** Not to beat the dead horse but all this means is that you will feel more guilty about taking your PTO (because you didn't \"earn it\"), and that the company doesn't have to pay out any PTO when you quit or are let go. It benefits the company way more than you, gives them way more authority in rejecting your time-off requests, and I've rarely seen it benefit me in any way. Actually, I quit a company (not to name names, but let's just say their name rhymes with SlackCountry, they like to claim they've trademarked a geographic term that is incredibly common to use, love suing the shit out of companies for using this \"trademark\", giving all developers access to their single, not backed up production database, and firing CTOs) because I had booked a full vacation to Europe ***after getting approval via email from my manager.*** He later (the week before the trip) told me that another guy on the team is taking PTO and \"because I didn't tell him about this PTO\" I would have to work / be on call that week. I showed him my email, he said that it didn't matter and they still needed someone to \"man the fort\" and that I'd have to work. I, for the first time in my career, gave my 1-day notice to quit. He begged me not to, reverted his statement about my PTO, tried everything. I interviewed at a job with an old (good) manager and was hired within a week, before even starting my vacation, which the new company streamlined and paid me for. \n\n**Tl;dr - stop letting recruiters breadcrumb you to an opportunity you'd of never taken anyways, and start questioning their use of unlimited PTO as a selling point. Ask pointed questions about how much time off the average engineer at their company takes, off, what the process for requesting time off and getting it approved is, and bonus if you can ask for an OTR interview with someone who's not on the team you're interviewing for to get more insight into the company's policies and general \"culture\".**",
    "title": "PSA/Rant. Recruiters who won't give you a salary range should be ignored and unlimited PTO is (still usually) a scam",
    "subreddit": "cscareerquestions",
    "timestamp": 1630517949,
    "score": 319,
    "keyword": "man engineer"
  },
  {
    "text": "HR sitting in on 1-1s Foo\n\n\n\nI am the lead software engineer at a small, pre-series A company.  I have been working there for over a year.  All of my colleagues have loved working with me and I had nothing but a stellar performance review.\n\nThe communication between me and my boss has been a bit shaky.  although, I feel as if it has gone downhill.   Come last April, I had moved to Iceland and I was having breathing problems.  It was a combination of the withdrawals from a medicine I can’t get here and a bit of anxiety.  We were nearing a deadline and my boss asked if I was ok.  I told him I was struggling to breathe.  I got the rest of the work done but he told me to still take a few days off.\n\nThis is where it gets weird.  When I got back from taking a few days off, our HR woman was sitting in our 1-1.  She has continued to be sitting in our 1-1s and it is so awkward.  The weird part is that like, my job security isn’t unstable.  When all of this started happening I asked where I stood, and I was told that I was chill.  My boss the other day even asked me if/when I wanted to move back to America and we’ve talked about the upcoming work for the rest of the year.\n\nWe don’t have any sort of leadership in place other than the CTO (my boss).  Our CEO is completely useless and doesn’t do shit and there’s no one else that can do anything really.\n\nSo, it’s been 2 months and every single time our HR lady has been sitting in on our meetings.  It makes me extremely uncomfortable that my boss doesn’t feel comfortable talking with me in a 1-1 situation.  Supposedly we are going to be getting a PM and VP of engineering, but empty promises are pretty common here.  From my understanding, she has occasionally sat in on other folks 1-1s.  But the key word is occasionally - she shows up to all of mine. \n\nThings blew up a bit during our last 1-1.  At the very end of our conversation, my boss was like “we need to add postman tests to this.”   I was confused because in order to get postman working, I needed him to review my code that was open for two weeks.  I told him I was confused because we needed to get this merged in before I could do postman.  (As a background I have several pull requests 1-3 months old, waiting for his review).  I felt like he started to put the blame on me when I told him that I was concerned about how we can do postman tests.  He said things like “you are supposed to take ownership why don’t you know how to do this” and started like, man-splaining really hard to write unit tests.  Which i already know how to do lol.  My concern was that we didn’t have it integrated in and he was being the blocker, and we haven’t written any postman tests as a company (because again, he was holding me up).\n\nThere isn’t anyone I can turn too.  The HR woman doesn’t do shit.  Our CEO doesn’t do shit (I have literally never seen her on a single zoom call all of 2021).\n\n\nSo i am not fully sure what to do?  I like my work and my colleagues beyond my boss.  I hate how dysfunctional and all over the place my company is.  I know that I am getting low balled but I chose this job because I liked my boss and the product originally.\n\nIdk have you run into this situation before?  Where like your boss has a person from HR sit in every single one of your meetings?",
    "title": "HR sitting in on 1-1s",
    "subreddit": "cscareerquestions",
    "timestamp": 1623591868,
    "score": 77,
    "keyword": "man engineer"
  },
  {
    "text": "Working at startup as jack of all trades -- I feel suffocated Okay here is the story. I still haven't graduate (in my senior year), I was working with that famous professor in mechanical engineering in a top-10 school over the summer in a research project which was a huge success and we introduced some very computer science-y stuff into the field and wrote a textbook and multiple papers. Everything is perfect so far and I made some very powerful connections because of that professor. After the project was done, he wanted me to work at his startup to take that knowledge and put into work in that field; easy-peasy task and I know what am doing and everything supposed to go great.\n\nOnce I started, I found out later that the CEO is not him but a former student of his who is very bossy and annoying like hell and the professor is just a scientific advisor. From here all the problems began\n\nNo one knows shit about software development, so I told them that I need to have aws to do backend stuff they don't listen and tell me to go figure it out, they expect me to do backend and frontend and algorithms stuff (like really advanced optimization stuff\u0010) so I'm supposed to know from production-level C++ to production-level Javascript and devops stuff and they would surprised that I tell them I don't know that language or that framework (they think they all are the same). and I'm extremely underpaid relative to the knowledge I gave them and the CEO is always breathing down my neck and nag me to finish stuff that are supposed to take months to finish in a normal job in a week or two and she is extremely rude and thinking that she is the CEO of tesla or something and how I dare that I said she is wrong about something or that I request something from her without saying please :\")\n\nWhen I told them that I need a team they don't do anything because that I have the knowledge to complete the project but they don't know that I work 10-12 hours a day to meet their ridiculous deadlines.\n\nI'm only staying to keep my relation with that professor to help me get into graduate school but otherwise this is giving me depression.\n\nShould I flip them off?\n\n&#x200B;\n\nUpdate 1: I told my professor who is supposedly is a very decent man that my boss is so toxic and he told me to stop bitching and I should cut her slack because she has so much pressure from the investors\n\n&#x200B;\n\n&#x200B;",
    "title": "Working at startup as jack of all trades -- I feel suffocated",
    "subreddit": "cscareerquestions",
    "timestamp": 1610553873,
    "score": 18,
    "keyword": "man engineer"
  },
  {
    "text": "Old job willing to take me back, but have to wait a month or two? Context: Software engineer in data, about \\~2.5-3 YOE\n\nI left my first job out of college in January 2021- was a great fit there and had amazing culture/mentorship, but pay wasn't great because I was a college hire. This new one offered me nearly 70% more salary + a title bump + it seemed like a good stepping stone career-wise, so ultimately after a hard decision, I decided to take the jump.\n\nHowever a few months in I've found that I feel like I'm not getting the onboarding support I need to perform my best in my new role, - got a bad review first few months in, and many red flags have shown up that i've noticed on my first project - high associate turnover, non-technical scrum master, managers not showing up to meetings consistently- so I contacted my old manager who is willing to take me back with a title bump and salary- but some more work needs to come in (likely not until August/September). Unfortunately this likely means no paper offer for a few weeks.\n\n&#x200B;\n\nKnowing my old work there's never a shortage of stuff to do so it's very likely I'll be able to go back, but man, it's so hard to resist the temptation of quitting now. I've been assigned a few tickets currently that I've had trouble tackling, but I'll be switching teams after this sprint so I'll have a fresh start in two weeks. Ultimately I know the best decision is to just tough it out for this sprint, but these last few months have really taken a hit to my confidence as a developer in the industry.\n\nMy apologies- this came off as more of a vent/rant than advice seeking. Still, I appreciate those of you that took the time to read this.",
    "title": "Old job willing to take me back, but have to wait a month or two?",
    "subreddit": "cscareerquestions",
    "timestamp": 1624492693,
    "score": 13,
    "keyword": "man engineer"
  },
  {
    "text": "Do I need to put in my two week, or can I just quit? Hello all, \n\nSome context, I’ve been working at this start up for 3 months now, and it’s my first job and I’ve hated it since day 1. Some of the senior engineers, including the boss berate the newer engineers when they make a mistake, or when the senior engineers don’t understand something, and have raised their voices to the point of shouting. The work I do here is meaningless, they were so disorganized when I first joined, all the manuals they gave me to learn the software they used were wrong, I ended up finding and editing typos for them. Third and this is a personal small thing, it’s an hour away from my house. It’s overall been a burden on my mental health. Some of the engineers are nice, and I have become friends with them. I recently got a job offer, that pays nearly twice as much as my current job(I’m getting underpaid significantly here) and I plan on taking it, and the new location gave me two weeks until I start. The biggest reason why I am hesitant about putting in my two weeks is because the boss yells at everyone and is basically a man child, if he ever hears something he doesn’t like, or misinterprets something he doesn’t like, he yells, LOUDLY, and I don’t want to put in my two weeks if he’s going to act immaturely. I also have to move out of my house next week, I live with my parents and they are moving into another house and I have to carry most of the stuff since they are getting older. I also have money saved up so it wouldn’t be a problem if I went two weeks without working. Really any advice would help.",
    "title": "Do I need to put in my two week, or can I just quit?",
    "subreddit": "cscareerquestions",
    "timestamp": 1635449934,
    "score": 11,
    "keyword": "man engineer"
  },
  {
    "text": "Mid-thirties and just can't decide what is next, advice greatly appreciated So I'm a mid-thirties engineer. I've never worked for a FAANG though I was rejected by FB once after making it through the final interviews. I have worked for several Fortune top 50 companies and I also have started my own business consulting. Currently, I bill at \\~$115/hr 40 hours a week as a consultant.\n\nI've been getting both a little bored of my consulting gig, and as I get more grey hairs I start to find myself thinking about what I want to be doing in 5-10 years, so I decided to see what was out there.\n\nI've currently got two offers from startups, one is an Insurtech that I feel actually has a good chance of being very successful, the other is from a cryptocurrency startup that either is going to go to the moon or be out of business depending on regulation and market conditions, but the crypto place is packed with truly brilliant people. Both of these offers have me paying the startup tax of having a crappy \"Senior Engineer\" title. Base salaries are 160-170k or so with TC's around 200k but basically it's more about the stock being worth a lot more hopefully in the future.\n\nI've also got several established big name non-FAANG companies seeking me out as a principal engineer that I am currently interviewing with.\n\nPart of the reason I'm tiring of consulting is that I find for the first 6 months to a year of a contract, there are many problems I can solve via writing code, but after some time those sorts of problems wane and the problems remaining become mostly institutional and since I'm not \\_that\\_ invested with the company and don't want to try to work my way up over the next decade to actually effect change. In my view, getting that Principal Engineer title would be a good step to a future director role with more responsibilities (I enjoy mentoring, making technology decisions, growing a team around me much more than I enjoy actually writing code.)\n\nIf I were in my mid-twenties, I'd probably go with the crypto startup in a heartbeat. High risk, but potentially huge reward, but old man me thinks that gambling away 40k a year or so in actual income from the reduced base salary isn't worth the hopeful to the moon payout that may never come, so I'm kind of leaning towards just continuing to consult until I do actually land a PE role. I mean given that I'm certainly in the running for a PE position, and given that my income from consulting is much higher than the base pay of what these startups are offering, do I really want to pay the opportunity cost of investing the next 4 years of my career into a Senior Engineering title that may not ever pay dividends.\n\nTL;DR: Old dude (sort of) debating between super-high risk super-high reward crypto startup, middle-risk middle-reward insurtech startup, or just continuing to make really good money consulting while trying to land a principal engineering role in an effort to spin that off into a director position in the future. What do?",
    "title": "Mid-thirties and just can't decide what is next, advice greatly appreciated",
    "subreddit": "cscareerquestions",
    "timestamp": 1632602493,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "I'm I making a big mistake in my career/life? **A bit of context**\n\n* Country: Panama (Latin America)\n* In my twenties\n* Graduated 3 years ago as a Bachelors in Engineering in Computer Systems (the closest thing to Comp Sci I had available)\n* Last job was a year ago as a 'Data Science/Analyst'\n\n**The problem**\n\n* Job prospects in software development absolutely suck in my country. Most companies that offer software developer roles are very small (think less than 50 employees) that outsource you to local banks/companies to work on legacy applications. Aside from the horrible hours and low pay, it feels awful that they make free money by just being useless middle man.\n* Economic activity of my country is very centralized in working for banks or the Panama Canal. Very few international companies exist and those that do are here for cost-cutting (think outsourced finance departments, call centers, etc)\n* COVID-19 devastated the job market. Most companies stopped hiring and unemployment rates are expected to reach %20 because of the pandemic. Despite the horrible impact to the economy, our government decided to lock down again for 2 weeks (our government is as competent as you can imagine for a third world latin american country).\n* I decided to leave my barely related to CS job (Data Analyst) to focus on getting good at programming Jan 2019 (Covid hit 2 months latter).\n* My last job experience can be summarized as doing Excel and VBA Macros in a Finance Department where everything was done in Excel.\n\n**My proposed solution**\n\nI don't want to seem like a negative nancy, but things are pretty bad in my country.\n\nSo I came up with the following plan:\n\n* Study a Master’s Degree in Canada in Computer Science\n* Stay in Canada, since immigration is way friendlier compared to the US.\n* Work my way up into a Software Engineering role and take all internship opportunities possible while studying the masters.\n\nMy doubts regarding this plan is that a Master’s degree is seen as unnecessary for where I want to be career wise (the most I can imagine myself being is a Software Dev at a FAANG).\n\nAlso, it would be a big investment, and I'll burn through my savings and a small inheritance.\n\nCOVID has also impacted the global/Canadian job market, if the job market doesn't pick up by the time I'm done with the masters (2 years) all that investment would have being for nothing.\n\nSo, what do you think? Is it a crazy idea?\nShould I just get a whatever job and get good enough to be a remote dev instead of doing the masters?\n\nThank you for reading my wall of text.\n\nTLDR: Latin america is trash tier, go get a Masters in Canada or get gud enough to be a remote dev?",
    "title": "I'm I making a big mistake in my career/life?",
    "subreddit": "cscareerquestions",
    "timestamp": 1610478990,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "Undergraduate accounting programs do an absolutely horrendous job of preparing you for the work force. Agree/Disagree?\n\nNothing can ever prepare you 100%, but honestly all of the shit you NEED to succeed is nowhere near taught or practiced enough. \n\nHow many programs DONT EVEN HAVE excel courses required, or even offered at the university? What about Tableau, Alteryx, SQL, Python, etc…? We spend all day and night going over the debits and credits, but man fuck our roles are honestly 90% being tech savvy and 10% actual accounting knowledge.\n\nThe demands of this industry continue to rise more and more, and I don’t feel like I’m prepared for jack all shit. Accountants are not engineers, and we aren’t data scientists. Yet it feels like we have to be able to utilize the same skills and techniques that they do in order to succeed in our profession. \n\nAm I the only one who is concerned about this massive transition the industry is seeing?",
    "title": "Undergraduate accounting programs do an absolutely horrendous job of preparing you for the work force.",
    "subreddit": "Accounting",
    "timestamp": 1635053100,
    "score": 827,
    "keyword": "man engineer"
  },
  {
    "text": "Pursue accounting or engineering? Hi, i’m a recent high school graduate who has taken a year off to decide what I want to do with my life.\n\nUltimately, I’ve narrowed down into these two careers. \n\nReasons for engineering:\n\nRespectable Job,\nUsually high employment rate ,\nGood salary ,\nSeems flexible ,\nCan potentially go to space or work with nasa/spaceX, which is an interest ,\nSeems more exciting than accounting\n\nReasons for accounting:\n\nVery flexible and useful in business field ,\nCan go into different strands of business,\nCan start my own business and excel ,\nDad is a successful business man ,\nBe able to invest and be an entrepreneur ,\n\nAlthough starting salary is not as good as engineering, there seems to be good growth potential and higher earning opportunities to",
    "title": "Pursue accounting or engineering?",
    "subreddit": "Accounting",
    "timestamp": 1629996062,
    "score": 35,
    "keyword": "man engineer"
  },
  {
    "text": "What I learned from 1.5 years in tax technology at B4 (some thoughts apply in general for accounting/tax) Alright, so I am totally out of B4, out of tax, out of accounting, everything. Looking back, I'm grateful for getting my foot in the door in software development, which tax tech allowed me to do, but man I wish I knew a lot of things when I started that I know now. So, to that end, I thought I'd share what I wished I knew with you guys who are aspiring accountants. Also, I get a lot of PMs asking about tax tech, so here ya go.\n\n\\#1 ACCOUNTING DOES NOT PAY AS MUCH AS EVERYONE HERE CLAIMS\n\nI don't like all caps, it's annoying, but this point is so important I felt the need to highlight it. I don't know if the vast majority of people on r/Accounting are making up their comp, it used to pay more, whatever, but you will not make as much as you think. Your starting salary in MCOL, which is where I'm at so I'll use that as an example, is going to be about 52k for audit and 55k for tax at B4. If you go into advisory, it'll be higher at around 60k. Tax tech we started off in high 60s. Keep in mind this is for a profession that requires a bachelor degree and a master's degree as well as extra work on the side (CPA) to optimize your chances of success. These starting salaries haven't budged from what I've read since about 2008. I did initially look at industry tax jobs, since I was hating my job pretty bad at the 6 month mark, but even with 2-3 YOE you're looking at around 70-80k. Which, yes, that is the vaunted 20-30% bump everyone talks about, but 70-80k doesn't go that far in MCOL anymore. If your spouse works, you'll be fine, but just be forewarned. When you're watching Becker and the lawyer dude, forget his name, is talking about how you'll be swimming in benjamins that's just not true. Also, for the fact you need a BS + MS + CPA to do it, the ROI is not great. It's better than a lot of industries still, but it pales in comparison to other degrees like data science, computer science, etc.\n\n\\#2 Tax technology is not worth the higher salary to start in\n\nSimply put, it's kind of interesting, and kind of neat, but if you think tax is niche and will pigeonhole you well tax tech will do it even more so. I think it's fine if you know for sure that's all you want to do with your life, but if not, I think a safer path would be to start in regular tax and get compliance experience first then do tax tech. That way, if you decide you don't want to do it forever, you have the compliance experience everyone will expect you to have.\n\nCaveat: If you get to the end of your degree, and realize you're not a huge fan of accounting or you otherwise have a strong interest in data / tech, then tax tech as a first job is a good choice. Obviously it got me into software development, and many of my colleagues left for software development or data analyst jobs, so it's good to get related experience for that kind of stuff.\n\n\\#3 Work-life balance is not much better in tax tech or advisory in general from talking to my colleagues\n\nYou likely won't work 80-100 hours a week like you will in tax or audit (fun fact that's not much above minimum wage if you calculate your effective hourly rate) but you will still be expected to work nights, weekends, work on every single vacation, cancel PTO, work over holidays or holiday break, all at the drop of a hat, if that's what your manager wants. So, your total hours will be less, but your WLB will be just as trash as it otherwise would be in the other practices. Also, all of the people at manager and above seem to work 60+ hours a week. It's a horrible life that I would not wish on anyone.\n\n\\#3 The CPA is underrated for interviewing\n\nYeah, you may be wondering why I'm saying this since I left accounting completely, but if you think all the BS of accounting is stupid look up the interviewing process for software engineers. It's insane. There is no certification, like there is with CPA, where you can just get B4 experience and CPA then be super competitive for jobs. It's way more like a luck-based lottery interviewing in other fields, so for interviewing and getting jobs, accounting is ahead of most industries.\n\n\\#4 You don't have as much stability as you think\n\nWhen I left a week ago, it was about a month after the B4 firm I was at announced that they were laying off 4% of everyone in the tax practice or asking them to take 20% salary reductions. They also cancelled bonuses, slashed benefits, and gave me a 2% raise. There is absolutely no guarantee of you keeping your job in an economic downturn nor are you going to get 10-15% raises on average like everyone here brags about in public. You are just as likely to get screwed, whether it's due to covid, an asshole manager, etc. Which leads me to my final point...\n\n\\#5 Do not stay in public accounting\n\nSeriously. The clients are leeches. They try to squeeze as much out of you for as little as possible. This leads to very unethical crap like time getting eaten, managers asking you to work on PTO, etc. in this insane but hopeless effort to always please the unreasonable client. Also, every firm will say they're against eating time, but if you don't, inevitably you will get punished one way or another. It is a very toxic relationship, and it permeates audit, tax, advisory, everything, and frankly I just don't see it changing. The public accounting model is essentially a pyramid scheme where the people at the top exploit the hell out of the people at the bottom (you) while dangling the carrot of some day making partner in front of you to justify all of the abuse they will subject you to.\n\nTo that end, you should very much consider yourself a mercenary. Do not stay longer than you have to. You do not owe them shit. They will exploit you as much as possible, so do the same to them. Make them pay for all the food you can. Make them pay for your CPA. The moment the clawbacks expire on your signing and/or CPA bonus, consider looking. Some people here advocate for staying until senior associate, and maybe for the title bump that may be worthwhile, but seriously the moment you have determined it is best for you to leave (and the sooner the better) then get the fuck out. You should give no loyalty to them, because I guarantee they will give none to you.\n\nAlso, a lot of industry jobs aren't much better. Due to the nature of deadlines in tax and accounting, you're going to be working over 40 hours a week regularly. Sorry. This subreddit seems to give the impression that once you escape to industry everything is magically better. It's not. Plenty of people joined my practice, coming from industry, and talking about the hours they worked and WLB they had, there wasn't much difference. Maybe for private companies it is but publicly traded companies have filing deadlines, hence why the public accounting firms work you like dogs, to meet those deadlines. Obviously, they still apply if you're on the other side. You may get some improvement, and it's fair to assume that'll be the case at most companies, but the hours / WLB in this profession just aren't great and you can't sugercoat that fact.\n\nHope it helps guys. Still a much better choice to do accounting than say marketing, history, business, and a lot of other crap. Try to avoid any debt if you can, and failing that, take on as little debt as possible because seriously with what you'll get paid you'll have a decent middle class life to start if you don't have a lot of loans but if you do then you're going to be living check to check.",
    "title": "What I learned from 1.5 years in tax technology at B4 (some thoughts apply in general for accounting/tax)",
    "subreddit": "Accounting",
    "timestamp": 1609541433,
    "score": 31,
    "keyword": "man engineer"
  },
  {
    "text": "How much finance work do you actually have to do in the real world? Everything finance related that's come up in my coursework has just been a nightmare. Not even Farhat could save me. \n\nI just want to debit and credit, man. I don't give a fuck about pensions or time value of money. If i was good at math I'd have done engineering instead.",
    "title": "How much finance work do you actually have to do in the real world?",
    "subreddit": "Accounting",
    "timestamp": 1630203258,
    "score": 6,
    "keyword": "man engineer"
  },
  {
    "text": "Confused high school grad Hey guys,\n\nI just graduated high school about two years ago. took a gap year to figure out what i want to in life, as well as find my passion. however i was unsuccessful. my dad is a business man and my mom is a house wife, my family mostly just consist of business people and engineers. i don’t have a true passion per say, however i did have a few interests along the way. \n\nstarting with astronomy/astrophysics, until i realized how sparse the job market is and that i don’t know if i’ll like physics. \n\nthen i looked into being a pilot for a long time, i do enjoy aviation and think it’s pretty cool but it’s not really a stable job and i don’t know if i like the fact i’ll be away from home A LOT.\n\nI got into law and forensics but i was discouraged because i’m an introvert and not talkative enough to be a lawyer, and there aren’t much jobs in forensics.\n\nafter i got into medicine but then i realized, i don’t think i have it in me to put myself through the restless nights and crazy stress.\n\ni looked into dentistry as well but then i realize it’s kind of nasty and dentists have a high suicide rate.\n\ni looked into engineering and computer science but i really hate math, well trig atleast, and i think there’s a lot of that in those fields.\n\nso now i’m at accounting/business.\n\ni’m not really sure what i want to do in life, however i know the type of lifestyle i want, and that is to live comfortably, travel the world, drive nice cars, buy something and not have to look at the price tag, you know? \n\ni wasted a year already and i got into a canadian university for accounting .\n\ni’m wondering how flexible and useful this degree would be to me. \n\ni def do not want to be an accountant all my life. but i’m wondering if the skills and degree could land me jobs in different business strands, such as ib, consulting , marketing, etc.\n\nor even if i were to open my own business or expand my family business (liqour), get into real estate and things like that\n\nthanks for reading and i appreciate any response.",
    "title": "Confused high school grad",
    "subreddit": "Accounting",
    "timestamp": 1629478039,
    "score": 5,
    "keyword": "man engineer"
  },
  {
    "text": "Business-focused YouTube channels to learn about a new industry 👇 For anyone who is struggling to understand the client’s business, I have a made list of the best YouTube channels for self-education ✌️ \n\n1. Bloomberg QuickTake\n2. CNBC\n3. Wired\n4. ColdFusion\n5. Economics Explained \n6. Y Combinator\n7. Slidebean\n8. Business Casual\n9. Company Man\n10. Wendover Production \n11. Real Engineering\n12. Kurzgesagt\n13. Poly Matter\n14. Business Insider\n15. The Rest Of Us",
    "title": "Business-focused YouTube channels to learn about a new industry 👇",
    "subreddit": "consulting",
    "timestamp": 1617850676,
    "score": 42,
    "keyword": "man engineer"
  },
  {
    "text": "Staffing Consultant: which state should I register my LLC or INC? I work as a middle-man to place Software Engineers on short-term contracts with different companies.  I am resident of Connecticut, and my partner is resident of Florida. I work with companies in different states (e.g. company A headquartered in Georgia but has office in New Jersey). The Software Engineer that I place is resident of New York. Where should I register my LLC or INC as primary state? and where should I register as Foreign Entity?\n\nI am in the process of contacting some lawyers and will share their response here. Meanwhile, it would be nice to know your thoughts.",
    "title": "Staffing Consultant: which state should I register my LLC or INC?",
    "subreddit": "consulting",
    "timestamp": 1614780062,
    "score": 1,
    "keyword": "man engineer"
  },
  {
    "text": "Can someone put a name to this type of behavior? My brother and his girlfriend/ babymother/ enabler/ sugar mother broke up. Now he is living with us (mom, younger brother and I ). My mom especially around men have a tendency to make comments to try to embarrass me. Like the other day she made a  comment in front of my older brother along of the lines of “ don’t leave tampons laying around in the bathroom, we have men living here now”. Which then I asked her has she ever seen a tampon laying around in the bathroom? She was stuttering and dumbfounded. Other instances she’ll make fun of my cooking skills (I try to eat on the healthier side and we’re Haitian).Or the way I clean ( I have a specific cleaning schedule). She’ll find a way to just try to embarrass me in front of MEN. She’ll bring up the fact that I am not social, or she feels like I’m going for a man career (I’m in schools for engineering).Its to the point where I felt very inadequate and worthless. My mom and I have a very good relationship as long it’s one sided. But what do you call this behavior?",
    "title": "Can someone put a name to this type of behavior?",
    "subreddit": "blackladies",
    "timestamp": 1635018690,
    "score": 80,
    "keyword": "man engineer"
  },
  {
    "text": "Girl accuses her father of raping her. After he spends 10 years in prison, she admits she had made it up. But police will not prosecute her as 'it may keep others from coming forward.\" Yes, right, by allowing this wretched being to ruin a man's life and not even be told off - we are telling other women that there is nothing to lose in framing a man. \n\nCan you imagine this father, found guilty of raping his 11-year-old daughter, and what life in prison must have been like for him? Can you imagine, police, social workers, judges, all being taken in by the lies of a 11-year-old?\n\nThis is not an isolated case - if you put in a search engine - father falsely accused of rape - page after page comes up. And these are the cases that were discovered because they could not be hidden since the main witness admitted that she had made it all up! [https://www.dailymail.co.uk/news/article-2124170/Cassandra-Kennedy-Father-freed-decade-jail-daughter-admits-lied-raping-11.html](https://www.dailymail.co.uk/news/article-2124170/Cassandra-Kennedy-Father-freed-decade-jail-daughter-admits-lied-raping-11.html)",
    "title": "Girl accuses her father of raping her. After he spends 10 years in prison, she admits she had made it up. But police will not prosecute her as 'it may keep others from coming forward.\"",
    "subreddit": "MensRights",
    "timestamp": 1626385544,
    "score": 5989,
    "keyword": "man engineer"
  },
  {
    "text": "I feel so much scared living in this world as a man In my family we were brother and a sister… my family always taught me (mostly mom) to respect women and support and protect women… I am like guardian for my sister (she is just 1 year younger than me)… \n\nWhenever her friends visits our home I used to lock my self in room or get out of the home to give them freedom (as per rules set by my family)… so girls can have their time….\n\nI never hurt any women by any means… I had many female friends who used me for their advantage like from studies to job… \n\nI got married, treated my wife the best I could… she wanted to do masters after marriage I provided all support from financial to mental to even finish her academic projects along with my job… I even gave her father good money to build their own home.. approx 600K and help her brother to get the job… and helped her mother also.. I even payed the medical expenses of her father additionally when he suffered kidney issues… even when my wife did hit me with a baseball bat or scratch my skin or punch me in face or chest….if I don’t listens to her ….people used to call me rock/pillar of their family … \n\nWith my wife I have a son… suddenly she decided to leave me… when I confronted.. she filed fake cases on me and my parents.. ended up paying child support and maintenance to her for life (even she is a professor in a engineering college) … Not yet officially divorced….but separated since 5 years…\n\nNot able to see or talk to my son since 5 years… but I can’t say this to anyone… the moment I start to share this with men….either men run away from me or they just change the topic… no women except my mother supported me… my sister doesn’t care much and my female friends and my sister told me to “Map Up” and “Take it as a Man”… \n\nThe point I am trying to make is … forget about getting justice but as a man I am not even being heard… \n\nPeople laugh on jokes about women hitting men… including other men..\n\nI am really really scared to be even around women … I know I should not generalize it …. But it’s like not all snakes are venomous but can you tell which one don’t? Same way I don’t know which women will not take advantage of me or  laugh at me…",
    "title": "I feel so much scared living in this world as a man",
    "subreddit": "MensRights",
    "timestamp": 1632766084,
    "score": 299,
    "keyword": "man engineer"
  },
  {
    "text": "Feminist dogma is deliberately selected to hide narcissism. thoughts? The inability to cooperate with others and consider others' perspectives is key in narcissistic personality disorder. very often as I hear people discussing attributes held by a man said to be narcissistic I think \"that sounds fairly common among women,\". I have come to the conclusion that feminist talking points are specifically engineered to disguise toxic feminine narcisism as righteous indignation. \n\nAs an example of what I am talking about I draw your attention to [Second to last paragraph of this post](https://www.reddit.com/r/AmItheAsshole/comments/lpuqbg/aita_for_wearing_a_tank_top_and_shorts_around_my/). OP said Roommate was \" tearing down other women\" because she (at an appropriate time, place, and 1 on 1) asked OP to be a bit more modest when Roommate had company over. the whole rhetorical method of representing such a respectful request as an attack makes it so OP can ignore how she imposes on Roommate and focus ONLY on how Roommate's polite request was an imposition on her.\n\nwhat do you think? Does feminism disguise and buttress narcissism? Is it a coincidental function of dogmas created with no regard to it? or am I seeing links that are not present?",
    "title": "Feminist dogma is deliberately selected to hide narcissism. thoughts?",
    "subreddit": "MensRights",
    "timestamp": 1614066325,
    "score": 90,
    "keyword": "man engineer"
  },
  {
    "text": "I've been quiet for a long time PART 1\n\n2009  \nMy son was born after what I thought was an accident. I fell inlove with my son as soon as I saw him come out of my (at the time) girlfriends vagina. Yes I looked down.  \nI was 20 years old and changed my life to suit being a father. I quit my studies to become an engineer, and started working instead to support my new family. I payed for everything at home. My girlfriend used what money she got for being a mother, on herself.\n\nMy money was OUR money and her money was... well her money.\n\n3 months after our son was born the company I worked for packed up shop in the small town that we lived in and wanted employees to move to a way smaller town, close to the Norwegian border which was not ideal. 40/42 of us turned in our letters of resignation.\n\n  \nThis ment that I was a really young man with a family to feed, without a job.  \nI knew that my girlfriend wanted to study in Finland since that's where she was from. So was I but hadn't lived there since I was 2 years old and didn't speak the language.\n\n  \nI was young, no job, girlfriend and a newborn to feed. I didn't finnish engineering school. I needed to make big decisions.  \nWe're moving to Helsinki!  \nThat's what I decided. In Helsinki my girlfriend could study as she wanted, become a hairdresser which was her dream profession. Since I didn't have a degree, I had the plan to start a construction company and hire people with degrees and I DID! Even first year the companys finances was on the positive side. I thought I did well for myself.  \n\n\nFast forward to 2012  \nMy days up until now have been: Wake up at 5.30, start working at 6.00 and end at 15.00 (3pm). Drive home, pick up my girlfriend and son and then take her to evening school (20km). 16.00-20.30 (4pm - 8.30pm)  \nDrive home, feed my son and play with him. Then go and pick his mother up at 20.30 (9.30), come home try to relax which normally resulted in me passing out on the couch.  \n\n\nDecember 2012  \nMy girlfriend got her degree in hairdressing. This ment that I had no excuse to push my military service up anymore.  \n\n\nJanuary 2013  \nI joined the marines. I didn't get to go home for the first 5weeks.  \nBragging (skip if you don't like it): First time I ever shot a gun I shot a 95/100 with iron sights at 150m.  \nBecause of this I was put as a sniper for our platoon, which ment more training and less visiting home in the weekends.  \n\n\nFebruary? 2013  \nI get my first weekend permit to go home. I was so excited to see my girldfriend and most of all my son who was 4 at the time! I kept imagining how my girlfriend would come up and hug me, ofcourse with some sexual tention.  \nI get home, unlock the door and walk inside. From the hallway I can see my girlfriend in the couch holding my laptop. I shout an enthustiastic HI! but get a mere \"oh you're home\" response.  \nI sense that something is wrong but my son comes running into my arms, welcoming me home just as I imagined. His mother doesn't move from the couch.  \n\n\nAfter this I did not get to visit home much. Maybe every 3-4 weeks? weekend permision. But with the train ride I was basically only home on Saturdays.  \n\n\nJune 2013  \nIf you're good at what you're doing where I did my service, you collect \"vacation days\". For example if you shoot a perfect score on moving targets etc.  \nI saved up enough days to take a week off in the summer. I planed to drive back to visit my parents and ofcourse take my family with me.  \nAs we were visiting my girlfriend asked me for another kid. She told me that our son was not a mistake. She had stopped taking her pills and had even put her legs up against the wall to keep \"fluids\" in.  \nI was shocked and felt like my whole life was a lie. I had given everything up because of what I thought was a mistake.  \nI still loved my son more than anything in the world but... shocked.  \nSince I was still doing my service I asked her to wait a few months until I got out of the military so that I could feed them. The whole time I was there she could not pay the bills and I was not allowed to take out a salary from my company for legal/tax issues.  \n\n\nThat night I pulled out.  \n\n\nOctober 2013  \nI get a text \"When you finally get to go home, you can start looking for your own place\"  \nMy first thought is \"my own place?, I've payed for everything these past 6 years\"  \n\n\nSeptember 2013  \nI'm out of the marines. No one is there to greet me. I jump on a train to travel the 100km back to Helsinki, jump on a buss from the trainstation for the 30min to my house. The whole way I'm wondering \"What have I done wrong? Can I fix this? Is it my fault? When I get back home everything will turn back into normal. I knew something was wrong from the first time I visited home\"",
    "title": "I've been quiet for a long time",
    "subreddit": "MensRights",
    "timestamp": 1626568114,
    "score": 75,
    "keyword": "man engineer"
  },
  {
    "text": "EXCELLENT ARTICLE, WEBSITE AND RESOURCE FOR MEN AND BOYS ISSUES: Thrive in 2025 - Help Your Son Succeed in School Excellent article and a great model (the organisation too) for how boys and mens issues should be written:\n\n[https://www.parents.com/kids/education/thrive-in-2025-help-your-son-succeed-in-school/](https://www.parents.com/kids/education/thrive-in-2025-help-your-son-succeed-in-school/)\n\nAnother organisation: [https://boysinitiative.org/](https://boysinitiative.org/)\n\nI encourage everyone to start things like this, help things like this and so on. In my opinion the most important issue in MRM is education and also anti male attitude. I actually think the other stuff legal rights are the easiest to fix as it only takes a small lobby group and legal challanges (Marc Angelucci RIP talked about this... the laws are already there peopel just need to sue, make cases... when MRAs make cases they almost always win as its hard to argue against them - if you have read my previous posts MRAs have had massive legal victories worth billions of dollars with barely any legal resources)\n\nLads need dads is another example of a UK org. Absolutely fantastic organisation, very well received, even main stream wise, gets funding, positive press, has highest award i.e. queens award that a UK charity can get etc.\n\n***An infant organisation is the X for boys - I give that as an example to show how OVERWHELMINGLY positively that is being received, and if done smart MRM activism is inredibly positively received!! You literally cant criticise x for boys or lads need dads without sounding like a completley unhinged, sexist, misandrists.... which is why no one does critcisise them, and quite the opposite, they are very well received, they just need to get bigger.***\n\n&#x200B;\n\n**Author is from Building Boys:**       \n\n## We believe\n\n### 📷There’s no such thing as a “typical boy”\n\nAll  boys are different. So while boys, generally speaking, are prone to  movement and risk-taking, we know that’s not true of all boys. We steer  away from stereotypes.\n\n### 📷All boys can succeed\n\nWe define “success” as productive engagement with the world. All boys have something important to contribute to the world.\n\n### 📷Asking a 5-year- old boy to sit still for most of the day is ridiculous\n\nBoys,  especially young boys, learn best through play, movement and  experimentation. Schools that push early academics hurt far more boys  than they help.\n\n### 📷Playing with sticks, swords and toy guns is absolutely OK\n\nThe  research is clear: there is no link between “violent” play and true  violence. Pretend weapons play is perfectly healthy and may help boys  cope with their fears and feelings.\n\n### 📷Boys cry too\n\nYou’ll  never hear us say, “man up!” in an effort to stifle emotion. For too  long, boys and men have been encouraged to hide their feelings. We want  to make it OK for boys to feel (and express) their emotions.\n\n   \n\n### 📷Understanding boys is the first step toward effectively parenting and educating boys\n\nBoys  are different than girls, and so is their experience of the world. In  order to best help our boys, we need to learn all we can about them and  their experience.\n\n### 📷Boys’ interests should be respected\n\nToo  often, boys’ interests are belittled and considered “a waste of time.”  But an interest in anything can lead anywhere, and that’s as true for  video games and sports as it is for Newtonian physics and engineering.\n\n### 📷Boys deserve the facts about sex. And relationships\n\nIt’s  almost impossible to avoid porn in today’s digitally connected world.  That’s why it’s more important than ever to provide our boys with  accurate information regarding sex, health and contraception, and why  it’s absolutely crucial to talk to our boys about love, respect and  relationships as well.\n\n### 📷Most adults are well-meaning\n\nThe  vast majority of teachers, coaches and parents genuinely want to help  the kids in their charge. But they don’t all understand boys, and some  haven’t confronted or resolved their own issues. Sharing information and  working together is more productive in effecting change than blame and  shaming.\n\n### 📷Building boys will improve the world\n\nHealthy,  confident boys grow into healthy, confident men. Together, we can  expand our boys’ opportunities and make a difference for the  next generation.",
    "title": "EXCELLENT ARTICLE, WEBSITE AND RESOURCE FOR MEN AND BOYS ISSUES: Thrive in 2025 - Help Your Son Succeed in School",
    "subreddit": "MensRights",
    "timestamp": 1619386179,
    "score": 54,
    "keyword": "man engineer"
  },
  {
    "text": "The Activision/Blizzard lawsuit alleging widespread harassment of women ignored Men who were also harassed. from [thegamer](https://www.thegamer.com/blizzard-devs-male-harassment-report/)\n\n>A report from Kotaku alleges that male employees were also subjected to sexual harassment within the walls of Activision Blizzard. One employee on Twitter (whose name was withheld for his protection) shared that he experienced unwanted shoulder-rubbing, sex proposals, and conversations about sex acts in front of colleagues who remained silent. He didn't take any issues to HR as he feared this would lead to gossip around the office. He also alleges that other employees he confided in brushed off the incidents.  \n>  \n>Another story comes from Cher Scarlett, a former engineer at Blizzard. She not only corroborates the frat-boy culture that the lawsuit claims is still happening, but mentions that senior managers would regularly engage in games where they would grope male colleagues' genitals. One such was called \"gay chicken\" and tasked managers with being \"the first man to grab the others' junk.\" Scarlett says she knows of at least three men who reported Activision Blizzard to the DFEH, which resulted in the current lawsuit.\n\nHere's the thing, the language of [the lawsuit](https://regmedia.co.uk/2021/07/22/activision_blizzard_complaint.pdf) explicitly places the blame of harassment on male employees and frames the problem as coming from maleness. Quoting for example:\n\n>Defendants workforce is only about 20 percent women. Its top leadership is also exclusively male and white.  \n>  \n>Male employees proudly come into work hung over, play video games for long periods of time during work while delegating their responsibilities to female employees, engage in banter about their sexual encounters, talk openly about female bodies, and joke about rape.\n\nEvery time Men are mentioned in this document it's stories of what they did wrong or characterized as if all males were the owners and privileged few of Activision/Blizzard, extrapolated from a handful of stories yet mentioned in duplicate throughout the document. I could not find any mention of the male victims or any effort to find male criticism of the workplace culture (even though you can find it online). The way in which the lawsuit is phrased makes it sound as every male employee is guilty of these acts and that clearly is not the case as they signed the open letter and participated in the walkout.\n\nAs it says above, the DFEH was able to file this lawsuit on part because of male employees reporting their harassment to the DFEH after having been rebuked by HR. Yet the DFEH assigns them no importance, and even demonizes them in the report.\n\n>Plaintiff DFEH, an agency of the State of California, brings this enforcement action against Defendants in its prosecutorial role, seeking relief in the public interest for the state **and for Defendants' female employees(\"the Group\").**\n\nThis is a betrayal. This is no different than what Blizzard's HR department did to it's employees. These Men reported to the DFEH and it thanked them by seeking justice exclusively for female employees. Unless these clients actually are supported but aren't included in the filing by their appropriate sex, then this lawsuit will be stealing from male victims. The DFEH is charged with protecting 'all persons from unlawful discrimination' and this ain't it.",
    "title": "The Activision/Blizzard lawsuit alleging widespread harassment of women ignored Men who were also harassed.",
    "subreddit": "MensRights",
    "timestamp": 1629849339,
    "score": 56,
    "keyword": "man engineer"
  },
  {
    "text": "‘Dear sirs’ Does this email opening irk anyone else beyond belief? I work in a male dominated field (engineering) and I get this email opening ALL the time. I have my name and she/her pronouns in my email signature, and even then people still reply to me with ‘dear sirs’. \n\nIt’s hugely outdated and assumes that there couldn’t possibly be a woman on the other end of an important decision making email, or that any supervisor or senior with expertise in this field such as myself would automatically be a man. I can’t stand it.",
    "title": "‘Dear sirs’",
    "subreddit": "Feminism",
    "timestamp": 1639754914,
    "score": 306,
    "keyword": "man engineer"
  }
]