[
  {
    "text": "Mexican man cleared in sexual assault of schoolgirl because he didn't 'enjoy' it: Diego Cruz, 21, one of four privileged youths dubbed ‘Los Porkys’ who abducted and vaginally penetrated the teenager, did so without ‘carnal intent’ a judge ruled",
    "title": "Mexican man cleared in sexual assault of schoolgirl because he didn't 'enjoy' it: Diego Cruz, 21, one of four privileged youths dubbed ‘Los Porkys’ who abducted and vaginally penetrated the teenager, did so without ‘carnal intent’ a judge ruled",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1490784663,
    "score": 78,
    "keyword": "mexican judge"
  },
  {
    "text": "Hijab and Black Lives Matter: white in-laws pissed... advice? Long time lurker on this sub. Not sure if this is the best place for this, but I've seen other posts with great advice from this sub and you guys have already been very helpful. Black Lives Matter and wearing a hijab are two issues affecting women across the country, and the big women's march on Washington (and across the world!!) was SO INSPIRING. As a young woman, these issues and many more are affecting me every day. I have a daughter, and I want to be part of the movement that makes the future BETTER for the next generation to come. \n\n----\n\nI just moved in with my white, Italian-American in-laws who think of themselves as totally-not-racist individuals. (Spoiler alert, they are racists.) \n\n\nThey are Trump supporters, support the Mexican wall, support the travel ban aka Muslim ban, and more. But this isn't about \"politics\" this is about morality. I am not a democrat. They often vote democrat. We are not pushing political party agendas here. When you inquire further- and don't let them get away with vague phrases but push for them to say what they really mean- they can say some real doozies. Like that \"white people/culture is inherently better.\" Or that they \"don't want to help those in need if it takes away from our own kind.\" Although they'd never word it that way by their own choice, they admit these thoughts when backed into a corner. And yes they did use those exact words when you make them face it. \n\n\nI'm much more progressive and liberal, myself. (Surprise!) But they ARE open to having some passionate debates with me. They think I'm smart, thoughtful and kind and will occasionally concede their point to me. We've been going at it since the inauguration, right around the time I moved in. They secretly love the arguing and so do I, but I'm still deeply concerned. \n\n\nWhen we discuss these issues, I genuinely hope to bring new information to the table to change their minds and sometimes I do. (Yay!) We all can influence our social circles no matter how big or small the impact may be. \n\n\nAnyway. Today I got a Black Lives Matter t-shirt in the mail. I needed an oversized t-shirt to wear with my new leggings, and I knew this would be a conversation starter. I often wear t-shirts about my beliefs (like \"some chicks marry chicks\" which they have no issue with.) First thing out of their mouths before I even tried it on were: \"Why would you wear this, you're a white girl. You're not even dating a black guy.\" And of course, \"All lives matter.\" \n\n\nWe discussed it at length today and I told them tomorrow I am going to wear this shirt at dinner (I'm making dinner that night), and ALSO a hijab. (There is an invitation for people to try the hijab for a day in solidarity with acceptance of other cultures, although, I still will criticize religion and oppression don't get me wrong, but this is about tolerance.)\n\nThey are so upset. Don't worry, they also love it. We are very respectful on both sides. Like I said, on a certain level they enjoy being challenged. I'm not in any danger, and I won't lose my home or anything like that. But they did say that they wouldn't eat dinner at the same table as me if I wore either item. My plan is to let them sit while I stand in the kitchen, however, I know they will invite me to join as well and then they will stay too. At least, I think they still will, we are just going to get into some heavy (good) conversation. I hope I can encourage them to open their world view. \n\n\n**So, this is why I need your help... can you please help \"prep\" me for some common questions/rebuttals etc. about BLM, and \"anything related to a hijab\" which could honestly be anything from left field considering they aren't super informed on these issues despite having their strong opinions.**\n\n\n(Another example, TRIGGER WARNING RAPE, my mother in law was on a jury back in the day for an alleged rape, and the jury --and judge!-- forced the alleged victim to remove her hijab to testify so they could \"better tell if she's lying\".) \n\n\nI have a decent grasp on the basics, but I want to bolster my \"ammunition\" of statistics, articles sources, examples, memes, etc. They have this idea that the black community, and pretty much any minority, hasn't contributed anything as a whole \"like us whites.\" They say, \"how come on the news it's always blacks and immigrants committing crimes and killing one another.\" \n\n\nTHE FACT THAT THEY DO NOT SEE THEMSELVES AS RACIST IS THE MOST DANGEROUS, CONCERNING PART TO ME.\n\n\nThank you in advance, fellow women. And men. And non binary folks. You all rock my world. \n\n\n**Tl;dr: Please help me handle black lives matter and racist issues in general tomorrow at dinner with my in laws. Thank you!**",
    "title": "Hijab and Black Lives Matter: white in-laws pissed... advice?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1486083534,
    "score": 0,
    "keyword": "mexican judge"
  }
]