[
  {
    "text": "Assault at Church **I’m writing this encounter nearly thirteen years after it happened. It’s sleepless nights like now when I’m compelled to reopen old memories. So, if you don’t mind reading about a naive preteen, asinine (and racist) adults and one sick pervert all mushed into one story, here goes:\n\n-\n\nIt all started in the summer of 2006 at a local teen bible study group (where really it was a place for teens to hang out and volunteer at). The location was held in an Asian Empowerment-Christian church so everyone was 99.9% Asian so my being not full Asian (I’m Japanese and Mexican), I nonetheless stood out like a sore thumb. And other church members often made jabs at my tan skin and high bridged nose, and adding things like “Sorry we don’t serve tacos! Just fried rice!” to even doubting my Japanese last name (“Did you take this name from an anime?”). I sound like I’m digressing but this information will be relevant in a bit. \n\nIn retrospect, I don’t know why I didn’t catch these red flags. I should’ve just left and enjoyed my summer at home. I sat alone most of the time anyway. No one noticed my discomfort save for one person. \n\nLogan.\n\nLogan was this tall Asian twenty-something year old man. He was related to one of the Bible study leaders but only showed up a few times a month. Logan was slim and tall, wore Hollister apparel and slick, black hair that parted at the middle. I remember his humor and laidback style made me feel comfortable around him. Logan even went as far as to ruffle my hair and sit next to me during bible study. He even went as far as commenting on my looks, saying he liked my eyes a lot. That I looked mature for a thirteen year old. Quite the charmer, I thought.\n\nOne day, we were supposed to meet up at a baseball game and Logan offered me and a few others a ride for carpool. As luck would have it, when I arrived at the church (our meet up location), he was the only car there. I asked him where the others were to which he replied that they they all left early since they didn’t want to wait up on us. I found it strange since it wasn’t even that late to begin with. Ignoring my gut, I silently went inside the car anyway.\n\n This is when it starts getting scary. \n\nAs I was opening the backdoor, he was motioning for me to sit in front. I usually didn’t feel comfortable sitting in front with non-family members at the time. I insisted that I was okay - I even joked that he was my chauffeur. But Logan’s face didn’t show that he took my awkward humor well. He turned around with a serious expression. Not saying a word. I stared back, wondering what was wrong. Before I was able to ask, Logan reached over for my hand and began smothering kisses on it. Stunned and confused, I immediately yanked my hand back. I was speechless, not even asking why he was doing what he was doing. His eyes were still glaring and his usual kind voice was now more hitched and deep. “It’s fine. You know me. You like me,” he whispered as he unclipped his seatbelt. He began lifting his body towards the backseat. In that split second, I knew I was in danger. I saw that the backdoor wasn’t locked and I opened the car to make a run for it. I don’t know what came over me that day but I remember losing control of my body at that moment. All senses were hazy. \n\nI later found myself in the pizza parlor that was down the street. I sat there in one of the booths. I just had to be around other people. Other strangers where I could feel immersed once again. Hidden away from Logan’s eyes. After what felt like an hour, I called my friend (who lived nearby) if she and her mom could pick me up. \n\nIt was the last time I ever stepped into those church grounds. I didn’t tell anyone immediately and I had planned it that way until I received a call from the church leader - Logan’s sister. She asked if I was alright and where I had been. It was then that I broke down and spilled the story about what happened to me. She didn’t say anything. Only silence hung around the atmosphere. I doubted at that moment if I made the right decision. \n\nLogan’s sister finally broke the silence and I wished she hadn’t.\n\n“You’re at that age when...we don’t know what we seek. We look for something to compensate what we’re missing...which is usually the case for Hispanic girls like you. It’s no wonder you guys get pregnant so early, you know? Break away from that, ok?”\n\nI didn’t even believe what I was hearing. She was insulting me in every way possible under the guise of a benevolent church leader. Someone who was meant to help - not judge you nor your race. I felt like throwing up. Is this really what my experience is worth to others?\n\nMy thirteen year old self didn’t say anything and just hung up. I hated myself for even trusting her - of all people. His sister. I had all these thoughts swirling over me. What did I do to deserve this unfair situation? I didn’t bother anyone. I was not trying to tempt anyone. Why did it matter whether I was Mexican too? Where is Logan now? Would he come back and show up to finish what he started?\n\nSuch thoughts accompanied me all throughout my teen years. I couldn’t help it. The damage was done. I was stupid and naive. \n\nFast forward to now, I am doing much better thankfully. I’m not fully absolved from my past unwanted memories but things have indeed improved. I have loving friends and a sweet significant other. My parents are still my greatest pride. \n\nI just hope that on nights like now that my idle mind doesn’t betray me anymore. I don’t ever want to meet or let alone think of Logan or his sister again.",
    "title": "Assault at Church",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554966681,
    "score": 17,
    "keyword": "mexican judge"
  }
]