[
  {
    "text": "History of feminism the way they don't want us to know! This is the speech the Cambridge feminists did not want anyone to hear. Its Elizabeth Hobson's speech from the Justice 4 Men & Boys event yesterday. Published with her permission.\n\nHello and welcome to The History of Feminism, I want to make two disclosures before I begin: firstly, that this lecture will concentrate on the Western world – particularly the Anglosphere. I am not suggesting that, that’s where feminism’s boundaries reside or denying its existence elsewhere but it does start here and here is where my real expertise lie. And secondly: this may come as a surprise to you but I am not a feminist. I am an ex-feminist but after studying the movement, I struggle to see how any reasonable person could know what I now know and be anything other than opposed to it. I’d like to thank the powers that be at Cambridge University for refusing to bow to pressure from the mob and allowing these talks to go ahead and I’d like to condemn the emotional reasoning of those who would have stopped them. The purpose of further education is not to make people feel comfortable, it’s to challenge preconceived ideas and to build the capacity to meet challenging concepts head on and to grow from those experiences. Universities should be arenas wherein students build resilience, tolerance and dignity but increasingly activists are subverting these spaces to feed anxiety, black and white thinking and hysteria within their communities which is harmful to the search for truth that they should be engaged in – and harmful to the individuals that they claim to want to protect (including themselves). So, finally, thank you to everyone sitting here now: to those who’ve come in support of our work, those here out of curiosity, and especially to anyone who’s expecting to be offended, yet intending to engage because that shows some strength of character!   \n\nBefore I get stuck into the recorded history of feminism, I need to take a moment to illuminate the biological roots of the movement. Human beings are a gynocentric species – this means that we prioritize the needs and well-being of women over men. This is an evolved instinct that came about as a result of women being the limiting factor in reproduction – ie. women have a much lower ceiling on how many offspring they can physically produce – and in small communities that are subsisting this makes them highly important because they potentially hold the key to whether or not the collective will survive at all. This is why we traditionally send only men to war, this is why we have the “women and children first” Birkenhead Drill, this is why people are more likely to put themselves at risk to save a woman in danger than a man – and it’s why we have feminism. Feminism has taken our gynocentrism and weaponized it. \n\nMen’s role in this evolutionary sense is to act as a genetic filter – both to mitigate gene replication errors (ie. Preventing less successful combinations multiplying by barring many men from reproducing) and to produce and retain genetic recombinations that enhance the fitness of offspring. To these ends, male fitness is constantly policed to ensure that women’s standards are met before they gain sexual access – which is why far fewer men than women reproduce.  Because the pay-off of carrying particularly successful genes is so much greater for men (women will likely have the opportunity to reproduce if their fitness is moderate, men may well not), evolution gambles with male genes. This results in very different bell curves for men and women in terms of IQ and physical and psychological health, with men being over-represented at either end of the distribution (particularly intelligent/healthy or unintelligent/unhealthy) and women clustering around the middle. Feminists focus on the apex of male achievement to prove that men enjoy greater success than women (whilst ignoring the biological reasons that catapult a minority of men to the stratosphere) and on the acts of the most malevolent minority of men to generalize their patterns of behavior as emblematic of masculinity (whilst ignoring the fact that the very demographics that preoccupy them show that what is emblematic of masculinity is actually variability).  \n\nSo, human beings have always valued women more than men and been more critical of men than women. These were necessary instincts in tribal communities but they have been manipulated to privilege women to the point of dysfunction – and this began with the development of proto-feminism, which arose in the late Middle Ages. Queen consort of France and England, Eleanor of Acquitaine spearheaded a movement within her court to subvert the chivalric code (which had traditionally governed relations between knights and lords and the general public) to regulate the behavior of men towards women. These women initiated a system of romantic feudalism wherein noble men were under irresistible pressure to identify a lady as midons (my lord) and to submit to her will and delicately accept any scorn that his midons saw fit to extend to him. Eleanor established Courts of Love in which she and her noble women would administer “justice” in romantic disputes. Not only may many men in particular recognize this state of gender relations – but the modus operandi that Eleanor and co used to achieve their supremacy is entirely familiar: they generalised about all men based on the poor behaviour of a minority, asserting that women needed protection from men’s violations, and they pushed forward a narrative of women’s moral superiority, justifying female dictatorship. Within 200 years, Eleanors’ ideas had spread and saturated throughout Europe and throughout the class system. \n\nLa féminisme proper was born in the revolutionary France of the late eighteenth century – the political force first, the term around half a century later. In 1791, Olympe de Gouges published The Declaration of the Rights of Woman and the Female Citizen in response to the Declaration of the Rights of Man and of the Citizen. By publishing this document, de Gouges hoped to expose the limitations of the French Revolution in the recognition of women’s rights and to initiate changes in the Declaration of the Rights of Man to include sex equality. De Gouges opened her Declaration with the quote, \"Man, are you capable of being fair? A woman is asking: at least you will allow her that right. Tell me? What gave you the sovereign right to oppress my sex?\" [close quote]. In the preamble, de Gouges mirrors The Declaration of the Rights of Man, explaining that women, just as men, are guaranteed natural, inalienable, sacred rights - and that political institutions are instituted with the purpose of protecting these natural rights. She closes the preamble by declaring that \"the sex that is superior in beauty as it is in courage during the pains of childbirth recognizes and declares, in the presence and under the auspices of the Supreme Being, the following Rights of Woman and the Female Citizen.\" [close quote]. She was one of a small number of women beheaded for treason during the revolution. \n\nCharles Fourier is credited with having originated the word \"féminisme\" in 1837. A founder of utopian socialism and a slightly later supporter of women's rights, he believed that all jobs should be open on the basis of skill and aptitude rather than sex segregated and that traditional marriage could potentially hurt woman's rights as human beings, he himself never married. Fourier is believed to have influenced Karl Marx who argued as early as 1844, in his Economic and Philosophical Manuscripts, that women’s position in society could be used as a measure of the development of society as a whole. In The Communist Manifesto, Marx and Friedrich Engels celebrated the dissolution of the bourgeois family, with an erosion of the status of the father already taking effect as women entered the workforce. This, they believed, would lead to “a higher form of the family” in which women would be the true equals of men. Several years ago, at a FiLiA debate I heard Sheila Rowbotham explain that nobody could understand feminism without reading this book. International Women’s Day itself, has Bolshevik roots. Clara ‘The Grandmother of German Communism’ Zetkin and Rosa Luxemburg, at the Socialist Internationale in 1910, advocated for a Women’s Day but the date was not set in stone till 1921 when the USSR officially adopted March 8th which was selected to commemorate a specific date that led to the Russian Revolution. Specifically, a 1917 workers strike at a weapons factory in Petrograd. The women workers strike that modern feminists claim was the inspiration for International Women’s Day did not start until March 9th. \n\nMoving to the United States, in the pioneering Declaration of Sentiments from Seneca Falls in 1848 (generally taken as the seminal text of the first wave of feminism - though I would argue that it’s actually the second after de Gouges declaration) the claim was made that “The history of mankind is a history of repeated injuries and usurpations on the part of man toward woman, having in direct object the establishment of an absolute tyranny over her.” This is not justified by the history – of men risking their lives both in work and war to provide for and protect women, their families and their homes. Granted, the text highlights a series of injustices that women were subject to, however such a claim remains myopic and misleading. Under coverture legislation for example, while husbands did become the legal owner of all family assets, in reality, this came with responsibilities, and wives were not left entirely devoid of rights – their rights were simply different. Husbands could be criminalised for failure to keep their families as well as he could reasonably be expected, wives’ permission was required to sell any houses owned by the family – and actually if a member of a man’s household ran up debts, he was legally responsible for their repayment. Yes, women deserved to be granted various rights – but so did men, who did not deserve the derision they received from first wave feminists (including Christabel Pankhurst who notably explained in her 1913 book The Great Scourge, that men were “little more than carriers of venereal disease”). Furthermore, in his 1913 volume ‘The Fraud of Feminism’, Ernest Belfort Bax identified “two distinct sides” to feminism: an “articulate political and economic side embracing demands for so-called rights”, legitimately – and “a sentimental side which insists on an accentuation of privileges and immunities”. There is no mention in The Declaration of Sentiments (or any first wave texts) of the privileges and immunities enjoyed by women, nor any injustices faced by men.  \nThe women’s suffrage movement in the U.S. was tainted by racism. Although an African-American abolitionist, Frederick Douglas, did take to the stage at Seneca Falls – no African-American women are believed to have been present. Furthermore, feminist heroines like Elizabeth Cady Staton who organized the meeting at Seneca Falls and was a co-author of the declaration embraced her racism explicitly, characterising black men as inherently inclined towards rape, throughout her career. She also argued vehemently against the 15thAmendment (that would extend the vote to African-American men), claiming that it would degrade women to follow black men into the franchise.\n\nThe Women’s Social and Political Union – or Suffragettes – in the U.K. were not afflicted by racism. They actually took pride in the strength of support for women’s suffrage throughout the British Empire. The night before the coronation of George V in 1917, a demonstration was held to demand the right for women to vote, which featured an “Empire Pageant” featuring representatives from India, Australia, New Zealand, South Africa and the West Indies – and Indian Princess, Sophia Duleep Singh, was a major donor. They were not, however, devoid of bigotry – and I don’t just mean towards men – British Suffragettes held a special contempt for the working classes. Not only did they fail to rally behind the truly progressive call for universal suffrage, preferring to campaign for women to be able to vote “on the same terms as men” (ie. with property qualifications) but they embarked on a campaign of terrorism that may have hurt some middle and upper-class opponents (or insufficiently active supporters) financially but would put working class lives in both direct and indirect danger. They smashed shop windows and burned or bombed 17 industrial premises, including a lino factory, a laundry, woodyards and freight yards. They also targeted the café at Kew Gardens with an arson attack – destroying a business that was owned and staffed by women and destroying their livelihoods in a pre-Welfare State society. When the proprietor went to the WSPU to complain, she was told that she was taking ‘too personal a view of the matter’ and that the staff would no doubt be glad that they had lent support to the women’s cause.  96 homes were targeted. One was that of the Chancellor of the Exchequer, Lloyd George, which was empty under renovation. The bomb exploded just before his builders were due to start work so narrowly avoided injuring them, it did however destroy tools which were provided by the men themselves – who may well have ended up on the streets or in the workhouse as a result of their loss. Other houses – though the Suffragettes insisted that they only targeted them when empty – actually contained staff who were put at risk. Sulphuric acid and phosphorus in letter bombs caused a number of postmen to suffer severe lung damage and/or burns. A bomb planted outside the Bank of England would, if it had not been defused by a policeman, have gone off in a busy commercial area mid-afternoon. A bomb at Lime Street station, Liverpool, was packed with nuts and bolts to maximise harm. A bomb containing 24 cartridges of gunpowder was placed in the toilets of a theatre to go off during a matinee performance. The congregation at St John’s, Smith Square, had to put out a bomb containing 5½lb of gunpowder. Another bomb was chucked into a full Territorial Army barracks. The jockey whose horse ran over Emily Davison at Epsom in 1913 (Herbert Jones) suffered flashbacks to the event throughout his life until he committed suicide in 1951. The idea of these women as noble heroines is an outrage to any right-thinking person – and the idea that their terrorism led to the extension of the vote is implausible. They dropped their suffrage campaign entirely with the onset of WW1 (and a £20,000 grant from the government) and embarked upon their white feather campaign, for which they have further blood on their hands. Universal suffrage was won by quietly committed lobbying from the suffragist movement – and the sacrifice of so many working-class men in the war.\n\nTo understand the evolution of feminism from first to second wave, we need to look at the birth of critical theory. Critical theory emerged from the intellectual collective known as The Frankfurt School. They began their mission in 1923 with the establishment of the Institute for Social Research at the University of Frankfurt. Initially, founder Felix Weil and director Carl Grunberg, along with fellow orthodox Marxists, tasked themselves with making Marxism a viable alternative economic system to rival capitalism but from 1930 under, new director, Max Horkheimer the focus shifted to an examination of the culture out of which Capitalism flourishes, in order to subvert it to accommodate Marxism. Thus critical theory was established. The group moved its activities to the U.S. in 1933, in response to the rise of Hitler, to become associated with the University of Columbia in New York. Here, Erich Fromm pioneered the marriage of Marxist theory with Freudian theory and characterised the family (which they rightly identified as the building blocks of Capitalism) as repressive and pathological. Herbert Marcuse’s Eros and Civilization was published in 1955 in which a society based on free love and no work that liberated the human natures (that he felt were being repressed by Capitalist society) was proposed. This book was a major channel through which neo-Marxist ideas fed into various liberation movements in the 1960s, including of course feminism. Of feminism, Marcuse claimed that “the Women’s Liberation Movement is perhaps the most important and potentially the most radical political movement that we have.” Marcuse’s sentiments were echoed by Shulamith Firestone, founder of the Redstockings collective, who published The Dialectic of Sex in 1970, another utopian (or dystopian, depending on your perspective) radical classic that argued that the domination of men as a ‘sex-class’ over women as a ‘sex class’ (or “underclass”) was based in biology which needed to be overcome through advances in medical science that would liberate women from the “barbaric” practise of childbirth. She held the nuclear family, which she labelled a tyranny, in contempt and advocated for rationally constructed non-permanent bonding relationships between people who voluntarily undertook their upbringing in which “the dependence of the child on the mother (and vice versa) would give way to a greatly shortened dependence on a small group of others in general”. Kate Millet’s sister recollected a consciousness raising group that she attended with Kate in the New York of 1969 that opened with a back-and-forth recitation:\n\n“Why are we here today?”\n\n“To make revolution”\n\n“What kind of revolution?”\n\n“The Cultural revolution\" \n\n“And how do we make Cultural Revolution?”\n\n“By destroying the American family”\n\n“How do we destroy the family?”\n\n“By destroying the American Patriarch\"\n\n… it goes on, but you get the gist! Feminism became the leading vanguard in the subversion and desecration of a comparatively decent, prosperous civilisation. Their battle in this culture war was the decimation of the family and they would achieve victory in that battle by destroying men – a process they would enact by attrition of the esteem in which men were held, their identities and eventually their rights. \nA host of extreme misandrists poured forth bile during this period, thinkers like:  \n\n• Andrea Dworkin (“Under patriarchy, every woman’s son is her potential betrayer and also the inevitable rapist or exploiter of another woman.”),\n\n• Catherine Mackinnon (“Male sexuality is apparently activated by violence against women and expresses itself in violence against women to a significant extent.”),\n\n• Valerie Solanas (“to call a man an animal is to flatter him”),\n\n• Robin Morgan (“I feel that 'man-hating' is an honourable and viable political act”)\n\n•  Germaine Greer (“Men are the enemy”),\n\n• Shulamith Firestone (“all men are selfish, brutal and inconsiderate”) \n\nMarilyn French (“All men are rapists and that’s all they are”).\nHowever, I think it’s well worth looking at the more apparently benign representatives of the movement and unpicking what they had to say. In 1970, Irina Dunn coined the phrase “A woman needs a man like a fish needs a bicycle”, which was popularised later by Gloria Steinem. Referring to whom, I ask? To the countless generations of men who had endured the dirtiest, most dangerous and thankless labour to support their families? To their relatively recent male ancestors who fought for women’s suffrage (such as Jeremy Bentham and Henry Fawcett) and the elected representatives who would ensure such legislation passed (such as John Stuart Mill, whose male constituents elected him on a platform including female suffrage)? To their fathers who may well have participated in World War Two to protect their societies and families? To their brothers? Friends? Lovers? I believe Gloria Steinem had many of those – and was supported morally and financially by a number of them too. It may sound cute and catchy but it’s both contemptibly narcissistic nonsense and reprehensibly offensive.\n\nSecond wave feminism saw campaigns for equal pay which was realised in 1963 with The Equal Pay Act in the U.S. and in 1970 in the U.K. with our Equal Pay Act. It is, of course, entirely fair to legislate against malicious sex discrimination but, as we can see from the landmark case that led to Barbara Castle implementing the U.K.’s Equal Pay Act, the nature of the acts is far more expansive, responding not to simply the same jobs but to “work of an equal value”. The Ford Dagenham machinists strike in 1968 followed a re-grading exercise by Ford who classified sewing seat covers for cars (predominantly performed by women) as less skilled than jobs on the production line (largely done by men), resulting in a fifteen per cent pay disparity – and the court to which the case was referred found in Ford’s favour. There was no sex discrimination in this famous case, simply fair pay for different roles, but feminist activism continues to force the hands of employers not to make rational economic gradings but to ensure that men and women go home with increasingly similar pay packets regardless of relevant factors, and hey it has almost certainly led to less pay for Patriarchs, weakening their ability to provide for their families and putting stress on their relationships so it’s a win-win for feminism.\n\nSecond wave feminists also fought for access to contraceptive pills and abortions. The pill entered the U.S. market in 1960 but it wasn’t until 1972 there that it was made available to single women and, previously being at the discretion of individual medical practitioners in the U.K., it was incorporated into the National Health Service by Barbara Castle in 1974. This has led to far greater choice for women in terms of life paths, more sexual freedom and better physical health outcomes – and yet some have experienced a historically new pressure to be sexually active and a corresponding ennui in response to their sex lives, whether they believe they’re lacking or they fail to find meaning in casual sex. Abortion was legalized in 1967 in Scotland, England and Wales and found to be a constitutional right in 1973 in the U.S. There has always been a proportion of women who have killed their babies, bodies of new-borns believed to have been suffocated at birth have often been found behind Roman villas and prior to the act women turned to untrained practitioners who would administer folk-medicines or insert knitting needles into the womb through the cervix and obviously medicalised abortion up to a certain point is more humane for both the unborn child and the mother – and far safer for the latter. However, the callousness with which feminist activists typically have and still do approach the subject shows no concern for the sanctity of human life and precious little for the psychological well-being of the women who are told that expelling a “clump of cells” is a liberating act that will have no deleterious impact on her whatsoever (yet alone any sympathy for the men involved).\nA concerted struggle, on the part of radical feminists, began against pornography during the second wave. Feminist campaigners like Andrea Dworkin and Catherine Mackinnon joined forces with the religious right to raise concerns about trafficking and coercion in the industry and claimed that men’s consumption of porn led to increased risk of sexual assault and rape for women in free societies, as well as diminishing their capacity to be viewed as full human beings. In the U.S., several states enacted local ordinances that intended to treat porn as a violation of women’s civil rights and to allow women who believe they have been harmed by porn to seek damages in civil courts. The Dworkin-Mackinnon Ordinances were opposed as a threat to women’s freedoms by sex-positive feminists such as Camille Paglia and Wendy McElroy and were eventually shot down as violations of the First Amendment.\n\n The third wave of feminism emerged in the 1990s. It is characterised by intersectionality. Rebecca Walker, one of the founders, explained that “Feminism, in order to stay relevant, had to become about more than gender equality.” In an effort to be more inclusive, third wavers have embraced the grievances of – well, anyone who will identify straight white men as the problem. With literally no “rights” to be won, feminism became increasingly navel gazing – or more specifically a little lower – and obsessed over the minutiae of female existence in the modern Western world, finding oppression and abuse everywhere – from the make-up aisle to the bedroom. On university campuses posters were going up with the Ms. magazine study statistic that one in four college women was the victim of rape or attempted rape. This feminist lie was concocted by Dr Mary Koss who broadened the definition beyond any reasonable limit and in defiance of the 73% of her apparent “victims” who did not classify their experiences as rape. Take Back the Night Marches were growing, with participants chanting “2, 4, 6, 8, No More Date Rape” and giving emotional monologues about mistreatment at the hands of men. A moral panic was underway that still resonates darkly today. If Paglia, McElroy and their sex positive cohort thought that they had won the war for the hearts and minds of liberated young women in the 1980s, they were to be dramatically disproven just a decade later by an anxious and vulnerable generation of feminists. \nIn 1993, the Duluth Model was created in Duluth, Minnesota, founded by Ellen Pence (not, I believe related to Mike but certainly a good reason for his rule…). Used in all U.S. states (although recently seriously weakened by Donald Trump) as well as 17 other countries (including the U.K.), The Duluth Model is a gendered theory based on feminist beliefs. It contends that men’s violence towards women is based on a sense of entitlement arising from being part of the privileged ‘sex-class’ in a Patriarchy. Moreover, it expands the definition of domestic violence to include all manner of behaviours – from threatening to leave her or commit suicide to displaying weapons to making her feel guilty to making big decisions to giving her an allowance… It’s a mix of both clearly abusive behaviours and behaviours that exist in a very grey area that could conceivably be part of fairly healthy relationships. There is very little room left in Duluth Model theory or indeed the agencies that employ it for male victims of domestic violence, especially where it’s perpetrated by women, and it is a recognised phenomenon to see male victims end up in Duluth-inspired abuser intervention programmes that teach them that their masculinity is problematic. Erin Pizzey (founder of the first U.K. women’s shelter) describes the lead up to such instances using the acronym: DARVO. It stands for ‘Deny, Attack, and Reverse Victim and Offender’, she says that “A particular trait of women abusers when confronted with their behaviour, for example by the police, is to turn the tables on their victim by claiming to be the victim themselves.”… A police force informed by Duluth, of course, is inclined to believe her.\n\nAnd now a new wave of feminism appears to be quickening, with a schism between older third wavers and a new generation. Rene Denfield writes that current feminists “promote a new status for women: that of the victim” while Naomi Wolf laments that a substantial segment of modern feminism is devoted to victimhood. \n\nIn recent decades feminists have successfully promoted the idea of 'Believing the victim,' in cases of alleged violence, harassment or sexual misconduct against women - regardless of available evidence. In the words of Lena Dunham: “Things women don’t lie about: rape.” This subjective reasoning has led to campus rape trials in kangaroo courts across the U.S., Australia and Canada (they’ve been advocated for here in the U.K., but remain to be implemented, although the Varsity student newspaper informs me that they’re under serious consideration here at Cambridge now). They are governed by amateurs with inadequate legal training, who are given licence to assess innocence or guilt with a balance of probabilities standard of adjudication. With this trend we are witnessing a move away from the longstanding legal principle of ‘innocent till proven guilty’ and toward the dangerous principle of ‘guilty till proven innocent’ – paving the way for the systematic ruination of innocent lives. And the current state of affairs is not enough for some feminists who want to see men, not guilty till proven innocent but guilty upon accusation. Julie Lalonde, an “expert” brought into Ottawa University during the hysteria around a rape allegation (that proved false) to tackle the institutions “rape culture” believes that \"Every time we see a high-profile sexual assault trial result in an acquittal, it sends women back 50 years\" [end quote] and Emily Lindin tweeted that “I'm actually not at all concerned about innocent men losing their jobs over false sexual assault/harassment allegations.” \n\nUnder feminist Director of Public Prosecutions, Alison Saunders the U.K.’s Criminal Prosecution Service became embroiled in a scandal wherein targets set for rape and sexual assault prosecutions encouraged police forces to withhold exonerating evidence from courts. Innocent men were incarcerated, that’s a fact – and as a rule, their victimisers have retained anonymity and avoided their own well-deserved sentences for perjury.\n\nThe #MeToo movement has proven itself to be a malevolent witch-hunt, with a body count. A prime example of feminist aggression into the lives of non-feminist men and women who do not need feminism to dictate acceptable behaviour, at best it can only serve to diminish the romance, comedy and beauty (as well as some discomfort and tragedy) – in other words the colour – from our lives. As Camille Paglia pointed out, “Leaving sex to the feminists is like letting your dog vacation at the taxidermist.” At worst it serves to destroy men (professionally, personally, legally, or even totally). In August 2018, Brendan O’Neil counted four suicides as a result of #MeToo allegations – Benny Frederickson, head of a Stockholm arts centre, Carl Sargeant and an unnamed Labour party activist and Jill Messick, a movie producer, who killed herself as a result of harassment she received for defending Harvey Weinstein. Since then I have counted another four: Swaroop Raj, a Noida technician from India, American skating champion John Coughlin, Arghya Basu, filmmaker, and Armando Vega Gil, Mexican rockstar, who committed suicide after an anonymous woman claimed that he told her he would like to teach her to kiss when she was 13 and he was 50. I have no doubt that there are many that we have missed.   \nAnd the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?... We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately... I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying...”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending [pride] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalise the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonise men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.\n\nRegardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance. \n\nMasculinity as a whole is utterly vilified and demonized in our societies. The endeavour can begin at school, intensifies in university – and in the workplace increasingly, and reaches a tragic crescendo in family courts where men are denied access to their children who would bring such critically important meaning to their lives and be the ultimate expression of their masculinity. There is a gender justice gap for those convicted of crimes. Sex discrimination in the U.K. criminal justice system has a long history: e.g. flogging as a punishment for female criminals was banned in 1820 but continued for men until 1967 – that’s 147 years! Presently, men account for around 95% of the total prison population despite only committing 3.4 times more crimes than women. Factors that explain this disparity include: a greater percentage of convicted men being sentenced to prison, men being given longer sentences on average than women, women being paroled earlier than men (despite being more likely to be disciplined for bad behaviour whilst incarcerated) and women being more likely to have mitigating factors (such as age, dependents, lack of previous relevant convictions and the appearance of genuine remorse) applied to their sentences. And yet, feminist activists (such as Women in Prisons, Baroness Corston and Julie Bindel) have committed themselves to widening the gender justice gap – enabled by sentimental authorities. Our Tory government has committed itself to taking a rehabilitative approach when dealing with women offenders, which I think is great, but the voices of our male offenders (as well as the experts on effective justice) are utterly ignored when they raise the question: “What about the men?” \n\nThe cultural obsession with the gender pay gap is being driven by disingenuous authoritarian feminists with no regard for personal choice, meritocracy or human well-being. The focus is exclusively on the mythical glass-ceiling with no interest paid to the fate of those men employed in the glass-cellar dangerous and dirty jobs that women don’t want, who are increasingly at risk of unemployment due to automation, and/or the ever-present risks of workplace injury and death. Quotas are being used by many organisations which discriminate against men, sometimes caucasian men specifically. This is not only immoral in that it unfairly disadvantages individuals but also frankly stupid with the potential to impair the functioning of sectors rejecting meritocracy and therefore the economy and society in general. Moreover, the clunky way in which the government has demanded that businesses publish their “gender pay gap statistics” may ultimately lead to men being chosen over women for the kind of minimum wage jobs that very few do out of choice. “Equal pay” is being acquired for women performing even dissimilar roles to male counterparts, regardless of relevant facts such as: whether they work fewer hours. For example, the BBC’s former China editor Carrie Gracie was awarded £280,000 in back pay to bring her earnings in line with Jon Sopel, the North America editor, despite the fact that his job was more intensive and he was on air significantly more than her. She has donated her pay-out to The Fawcett Society. There are also several battles raging to secure equal pay for (mainly female) supermarket store workers as (mainly male) warehouse workers. An Asda spokesman clarified (in response to coverage consistently suggesting otherwise) that ““At Asda, hourly paid colleagues doing the same job in the same location are paid the same. Men and women doing the same job in our retail stores are paid the same. Men and women doing the same job in our distribution centres are paid the same. Pay rates in stores differ from pay rates in distribution centres for legitimate reasons” [end quote]. Differences in comfort, exertion and safety in the roles have been labelled entirely illegitimate reasons to offer different levels of pay to workers in the coverage of the stories, and the Court of Appeal agreed earlier this year and ruled against Asda.\n\nNow, the U.K. is facing the extension of hate crime legislation to include the charge of misogyny. In line with current hate crime legislation, the charge will require no evidence of hateful motivations but rather be governed by the perception of the victim or any witnesses involved. This shameful waste of police time will offer another avenue for malicious women to use the law to harm innocent men; as well as diverting precious resources from the fight against actual crime. And do not think that these “crimes” will not be acted upon by sensible officers, a perception of indifference from the police in such instances will be treated (as it is with current hate crimes) as “secondary victimisation”, with Greater Manchester Police clarifying that action will be taken against police accused of indifference towards “victims” and “whether or not it is reasonable for them to perceive it that way is immaterial” [end quote]. \n\nIn the interests of nuance, I accept that there have been and are individuals who identify as feminist who don’t fit into the negative description of the movement that I’ve just given. There are feminists who want equal rights for men and women, equal treatment, choices, opportunities. Feminists who have compassion for men and value them. But what impact have they really had on the trajectory and achievements of the movement? They’ve been marginalised heretics pleading intelligently and rationally but essentially ineffectually with their hysterical peers. While their hysterical peers have been lobbying our institutions irresponsibly and illogically but consistently successfully for policies and procedures that are damaging our societies.  \n\nFeminism, though once it was at least partially in practice, is now “progressive” in name only. Feminists don’t look around at our wonderful civilisation with gratitude and awe and want only to extend and protect the liberal values that have brought us here. Feminists look at our civilisation with anger and malice and want to burn it to the ground, rending our liberal values assunder, and to remake it in their own image. And feminists understand that “Power is in tearing human minds to pieces and putting them together again in shapes of your own choosing”, as Orwell explained through O’Brien in 1984, that’s why the epicentre of feminist indoctrination is in the education system where young and malleable minds proliferate to be manipulated by feminist historiography. Thankfully, we non-feminist women and men are studying and expressing our findings and more and more individuals are learning to see through the feminist narrative. I look forward to a post-feminist future.",
    "title": "History of feminism the way they don't want us to know!",
    "subreddit": "MensRights",
    "timestamp": 1558867022,
    "score": 395,
    "keyword": "mexican director"
  }
]