[
  {
    "text": "Sam Club Manager won't hire \"Cholos/eses\" I went to Sam's club for an interview and the manager was a cool guy but he told me that he does not hire people from wal-mart aka \" ghetto people \" or Cholos/eses. I have no problem with it but isn't it messed up cause some of my family/friends are \" cholos \" and their cool.\n\n\n\n\nThe manager is Mexican I think, pretty sure he's not white",
    "title": "Sam Club Manager won't hire \"Cholos/eses\"",
    "subreddit": "jobs",
    "timestamp": 1510963305,
    "score": 21,
    "keyword": "mexican manager"
  },
  {
    "text": "Worried about Resume So I have two years of hospitality experience listed on my resume. Several companies I worked for caused me to quit without notice. \n\n1) a new restaurant in town: boss was vulgar and when i texted him i was quitting he faked apologized and said I was a part of the gay jokes he was making as a condition of employment. (violation of EEOC) He also pretended to fire me several times. The pay was crappy as well. $30 for an eight hour shift of doing nothing.\n\n2) a casino: i was here for 6 months, there was this really bad manager and when it started slowing down she was showing her true colors. She got several girls to write a false report on me and then told on me. I was so wrapped up in the drama/retaliation I got myself fired.\n\n3) a mexican restaurant: there were several employees here who were really mean to me and would not cooperate. I told my boss about it and one of them flipped out, so I changed positions. The other apologized but didn't mean it, then continued to be abusive towards me, pushing me around and doing everything herself. I had two jobs at this time, my sleep schedule was messed up and I started being late when I was nearing the 3 month probation end. So I ended up quitting without notice.\n\nAs you can see, I have both physical and mental reasons for walking out the door without a warning. Did I do the right thing? Because I have 3 other jobs where I did put my two weeks in. All managers were nice to me. \n\nI'm just worried if I change my mind in the future and would want to return to these jobs or future employers would have the stink face about it.",
    "title": "Worried about Resume",
    "subreddit": "jobs",
    "timestamp": 1492833325,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "I spoke out against discrimination today I don't normally let people's hateful words bother me, but this...it was too much. I was sitting at my desk when a lady walked up, wanting assistance to order checks. She was older, seemed nice.\n\nShe sat down and I was pulling up the check order system when she goes, \"thank god you're not one of those brown people.\"\nI was taken aback. I couldn't have heard that right. \"Excuse me?\" Was all I could even think to say.\n\"I can never understand those Mexicans. And they can't help me. Thank goodness you're not one.\"\nI take a lot of shit at work. But that type doesn't fly. I gave her back her debit card and told her that if she wished to speak like that she could leave. She continued while she tried to take out her ID card, which was expired anyways. I told her I would not be able to help her today, and that she would be welcome to come back when she could speak about other human beings in a respectful manner.\n\nI know it's not a big thing, but that...I can't tolerate that.\n\nThanks for listening.\n\nEdit: To clarify some things. I work at a bank, and my manager heard the conversation and backed me up. We have a no tolerance policy for hate. I was firm but polite, I did NOT demean her. She did not make a scene. She said okay and left.\nAlso, I am also brown. I am mixed and my husband and his family are Mexican.",
    "title": "I spoke out against discrimination today",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495755227,
    "score": 102,
    "keyword": "mexican manager"
  },
  {
    "text": "Can a young man of 23 years of age with a criminal past and poor credit possibly have a brighter outlook for a future career? (Heads up, it's a bit of a read) So I'm a 23 year old male with a criminal record. I was once a very good kid and In fact enlisted with the us marine corps, 3.6 gpa in highschool and in great shape at the age of 18 before I spiraled into becoming a depressed, drug addicted young man quickly getting arrested for multiple marijuana charges, resisting arrest, and a controlled substance charge. I lost my chance with the marine corps, I haven't held a steady job until about 10 months ago I was hired at chipotle Mexican grill after sitting in jail for 6 months on a burglary of habitation which I'm now serving 6 years deferred adjudication with the possibility of getting off early. I've been doing what I can to meet all requirements of my probation and I'm actually close to finishing most my financial and community service aspects of my probation within my first year. I'm doing well currently at chipotle and recently received good news that I'll soon be a kitchen manager. Despite how well things are going now I can't help but feel depressed that I have nothing accomplished by now, and I feel like my future career in whatever I may study for in college will be hindered by my criminal past. I have a credit score of 560 with many medical bills that have gone into collections already. I don't want to continue struggling like this and I'm trying to find the best possible route to a better future. I know there can't be one \"fix it all answer\" but I'm asking you guys that may have a better insight to my current situation on how to go about with my current life situation and college. What could I even possibly study given my history. I know I can get my record sealed but that would be 5 years after I successfully get released from my felony probation. Any help? I'm glad to answer any questions to clarify.",
    "title": "Can a young man of 23 years of age with a criminal past and poor credit possibly have a brighter outlook for a future career?",
    "subreddit": "careerguidance",
    "timestamp": 1500471633,
    "score": 9,
    "keyword": "mexican manager"
  },
  {
    "text": "I work at a hotel. The cook at the restaurant in the hotel says racist shit on the reg. What can I do? The cook recently said \"there's so many Mexicans in here you all should start a mariachi band\". The restaurant manager (latino) just asked for an apology and the cook refused. The manager and 2 servers complained to our GM and HR... They both literally said that the staff made up the story together and rehearsed it. After the conversation and they thought they had hung up, the GM and HR were making fun of the restaurant manager for being Mexican. He recorded it. \n\nHe resigned shortly after and is planning to sue. \n\nWhile that goes down, I feel like I can use my white privilege in this situation. I want to go straight to corporate and tell them what's been going down. But I don't have any evidence or was even there when it happened. But I definitely believe them. \n\nI hate that I work for a company like this.\n\n\n\nA past cook has said shit to black servers about \"eating all the collards greens\". I'm sick that I'm working at a company that lets this shit go on for so long.\n\nThat same cook also handed a Latino cook a brick after the election and said \"better start building!\" which made one of the latino servers cry. They told her to calm down.\n\nI've gotta do something. I hate to bother you ladies with this, but I know if I asked any other subbreddit, it would be half assed. \n\nThank you all in advanced... \n\nedit: so appearently the CO is coming down! He'll be here all week! He lives out of town so this is a big deal from what I'm hearing... There's going to be a lot of people talking to him. Me being one of them.",
    "title": "I work at a hotel. The cook at the restaurant in the hotel says racist shit on the reg. What can I do?",
    "subreddit": "blackladies",
    "timestamp": 1499656279,
    "score": 24,
    "keyword": "mexican manager"
  }
]