[
  {
    "text": "Advice on going from a “chill, laid back” workspace to a more structured and traditional one? Ok so I’ll try to make this short.\n\nI’ve been at my current job for 4 years. I love my coworkers and my direct managers, but the upper management is a joke. In 4 years I have received TWO small raises. I was promoted to supervisor of an entire division three months ago and received a raise of TWO DOLLARS after four years of work. I commute an hour each way daily and it’s taking a toll on my vehicle. I do not feel like a supervisor. The channels of communication at this company are practically non-existent and half the time I get chewed out it’s because everyone was provided information except me, you know, THE SUPERVISOR. They also refuse to hire good, long-term employees for me to train and the boss opts for temps instead and even told me he prefers “the Mexicans because they are cheaper from the temp agencies. Probably illegal. Good for me.” \n\nThe one good thing about working here is that when the higher ups aren’t around the work environment is chill as hell. If you’re late one day by mistake no one will say anything to you. If you take a little extra time on your lunch break? No sweat. Take a quick break whenever? Sure. It’s very relaxed and very chill. But I’m afraid this may have actually become detrimental to the way I view “work”. I barely remember what it’s like to work somewhere “structured”.\n\nAnyway, I became so frustrated that last week I started sending out applications. Yesterday I got a call from a company that is 15 minutes from my house and has a STARTING pay that is higher than I’ve ever made here in four years. On top of that, it’s literally the exact same job I do here. I’d require no training and I’m already certified in the protocols they use as they are the same ones we use here. They even have a 4.1 on Glassdoor. I’m excited and have an interview scheduled for Thursday but I’m worried that if accept the job I will be even more miserable there because I’ve been so “spoiled” by the relaxed environment of my current job. It’ll be more money, but also more rules and more traditional “work” if that makes sense. Don’t get me wrong, I’m a hard worker. I am not lazy and work hard which is part of why I’m so frustrated about my pay and the respect I’m shown. \n\nI know I should accept the new gig if I get it, but I also know that once I do my days of accidentally oversleeping and not stressing about it are over, etc. But I also know that that is generally how work goes, it’s just going to be a matter of sliding back into a “normal” job.\n\nHas anyone experienced anything like this before? Does anyone have any advice?\n\nTL;DR: No respect and low pay at my job of four years, but a very relaxed and chill work environment. Got an interview at a new company with better pay and much closer to my house. But I’m afraid that I will miss the “relaxed” vibes of my current job so much that I’ll be miserable.",
    "title": "Advice on going from a “chill, laid back” workspace to a more structured and traditional one?",
    "subreddit": "jobs",
    "timestamp": 1623156362,
    "score": 5,
    "keyword": "mexican manager"
  },
  {
    "text": "Job offer after 6 months of my last interview 6 months ago i was invited by a tech company for a position as project manager. The interviews went well and they sent me an offer (draft) but their HR legal were not familiar with my type of visa (TN)  the process was delayed and they had to fill the position. (I disclosed from the start that my work authorization was under a TN visa)\n\nA few days back they contacted me again with a new offer (which is attractive)  and they got clearance from their HR legal counsel. \n\nRight now I'm pretty happy were I am, the project I'm working on is winding down and i enjoy the slow rhythm  after a few months of hectic activity at breakneck pace. I'm currently happy with the money make. Just a few weeks I had talks with my manager about my growth path and I have had excellent feedback from our customers (i got a shout out at our quarterly US town hall).\n\nMy employer is a public company operating in multiple countries and its stock has done extremely well in the last few quarters, strong growth, etc. \n\nThe Company that extended the offer is a small private company in the AI/finance ecosystem, that just a few months ago got a 70 - 80 million funding round by a large and well known NY private equity firm.\n\nNow I like where I'm now in my current job, and I felt a little disrespected when they they didn't follow through the first time they send me an offer, though i totally understand their reasons.\n\nCurrent Job: Ok money/benefits,  career growth in the near future.  \n\nJob Offer:  Slightly better money (20% more), stock options. The tech sounds interesting and the company may have crazy growth in the future. \n\nNow, in my current company most of the employees are Indians, in the new company most of the employees are Israelis so there may be some cultural shock at the beginning. (I'm the only mexican in my team but i adapted well to my Indian bosses/coworkers,  I have heard rumors that Israeli work culture is tough )\n\nShould I take the offer ? or should I stay. I'm on the fence.",
    "title": "Job offer after 6 months of my last interview",
    "subreddit": "jobs",
    "timestamp": 1640326137,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "I'm a woman in construction... This is a bit of a vent so bare with me, I have a lot to say...\n\nI'm a woman and I work in construction.  I used to be strictly in construction administration, but recently was promoted to production manager.  I was promoted to production manager because I know what I'm doing, I know the industry, I know how to talk to people, and I'm good with the crews.  Basically, I was promoted because I am, in deed, good at it.  And yes, I am a woman.  I'm also a small woman and an attractive woman and I wont make apologies for that or pretend that it isn't a factor in my day to day life.  Being a small, attractive, woman has often been an asset to me so no, I'm not going to \"hide it\" or pretend it isn't a thing.  Because goodness knows, if you're a woman in construction, you at least should have the decency to be butch enough that the men aren't attracted to you.  Sorry.  It's not my problem if you can't control yourself at work... Even if, it often becomes my problem in reality...\n\n1st vent: the white conservative men who dominate my industry are ALL racist and sexist.  This isn't y the first yard I've worked on an every single construction company I have worked for has rewarded a toxic culture of verbal abuse that is usually racially or sexually/homophobically motivated.  IF any of these men AREN'T actually racist, it is impossible to tell because they ALL laugh along with the constant jokes about race and sexuality.  There is one guy who calls all the crew members \"Mexicans\" as if that's an insult and not a country.  He knows full well that NONE of them are Mexican, but they are brown so he doesn't respect them.  So he makes a point of calling them all Mexicans basically to say without saying \"Don't come at me with that we're different cultures/countries bullshit.  You're brown so I don't respect you so you're Mexicans to me.  Try to say something about it.\"  He likes to call me \"The Jew\" because I'm Jewish.  He makes comments like \"Is that Jew speak?  Let the Jew handle the money.  Is that some weird Jew custom?  Is that Jew food?\"  Like, I'm not offended by being called a Jew, but he is obviously trying to offend me.  Lord knows what he says when I'm not around.  And they all go along with it.  The crew can't talk back to him because he's higher on the food chain and everyone with any power thinks he's hilarious.\n\n2nd vent: I went to the lumber yard to pick up a unit of CDX and some guy who recognized my company vehicle asked if I was the owners wife.\n\n\"Um... No?\"\n\n\"Then what are you doing here?\"  He actually had the nerve to ask me what I was DOING there.  As if it's a private fucking club.\n\n\"Working?\"\n\n\"This is YOUR job?\"\n\n\"Um... Yeah?\"  Cue he and his counterpart literally looking me up and down and proceeding to feel very entitled to comment on my physique and \n\n\"Well, you ARE pretty fit!  You have a GREAT body!  I bet you're stronger than you look.\"  Cue me just rolling my eyes and walking away.  Like, seriously?  Is this just a thing you do to everyone or just me?\n\n3rd vent: The only men who have crossed boundaries with me have been the white conservative men.  The latinos - who are supposedly all rapists - have been nothing but respectful.  They see me driving the big rig and think it's fucking great.  The white guys make inappropriate comments to/about me all the time and one of them actually went so far as being banned from talking to me outside of email because he was sexually harrassing me in the middle of the goddamned night.  They act completely fucking shocked to see me drive the box trucks and act like I turned into a watermelon if I correctly identify a screw.  Meanwhile they all tell me to \"watch out for the Mexicans\", who are almost all Salvadorean and most of them are married and have, like, I said, been nothing but respectful.\n\nI know I chose this.  I chose to be a feminine woman in a conservative and male dominated industry.  So, may be it's my fault.  Like, I could've been a nurse or something that is more acceptable for women to do, and still probably get sexually harrassed and have to deal with assholes and fuckwads.  But, I'm not going to apologize.  There is a toxic culture of racism and sexism in this industry and me being a small attractive woman who can drive a box truck is not the problem.  The problem was already there and I love getting out of the big rig and shocking everyone in Dunn Lumber who thinks it's a private boys club.  Get used to it motherfuckers!  Women can drive box trucks and fork lifts, too motherfuckers!  Small women are mighty!  Pretty girls can be tough!  I don't have to ugly myself up to make you comfortable, I don't have to dumb myself down to make you comfortable, and being 5\"0 has never stopped me from doing ANYTHING I wanted to do.\n\nAnyways, I don't know what the answer is.  I'm just venting and I'm done now.  Thanks.",
    "title": "I'm a woman in construction...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1632365976,
    "score": 217,
    "keyword": "mexican manager"
  },
  {
    "text": "What's the deal with women who not only protect creeps, predators, and human traffickers, but also even help them find new victims? Isn't that the ultimate betrayal of their own gender? I hear / read about this sort of thing all the time:\n\nThe horrifying case of Karla Homolka\n\nElegantly dressed women who go out recruiting teenage girls and young women for \"modeling\" and \"hostess\" jobs, which are merely fronts for sex trafficking rings. \n\nA notorious Mexican madam / female gangster whose specialty was providing underage girls to preferred clients. \n\nAnother case I heard about where some suburban teenager tried to pimp out her *own little sister*. \n\nA father managed to track down his young teenage daughter and niece, who were kidnapped and trafficked by a notorious street pimp and two of his \"girls\" days earlier. The pimp put up a fight, but it was the two *women* who held the father down and bashed his head with rocks, just because he wanted to save his young daughter and niece from ending up like *them*. \n\nWhat goes though the minds of women who do this? With all the things that women have to go through in this world, why would any of them want to sell out their own gender in such a shitty way?",
    "title": "What's the deal with women who not only protect creeps, predators, and human traffickers, but also even help them find new victims? Isn't that the ultimate betrayal of their own gender?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624769476,
    "score": 26,
    "keyword": "mexican manager"
  },
  {
    "text": "Micro and macroaggressions at work. I need to vent this out because, while I wish I could, I don't feel like I can take this to HR (I don't think my complaints will remain anonymous and I fear backlash). I also have to be very vague about my job here and I'm not going to tell you where I work if you ask in comments or pm me.\n\n&nbsp;\n\nI started at my job 3 months ago. My first day, I was riding with a man who was showing me the ropes. He seemed fine at first but when we were driving around the \"ghetto\" as he called it, he said, \"I'm not racist at all but these people always have garbage all over their yards. They should take more pride in their community. \" he clearly meant black people. We were in a historically redlined area. I'm white and very female presenting (my gender is a garbage fire though) so he clearly felt safe saying something that was definitely racist to me. I told him I had lived in that area and that there was a huge problem with trash cans getting knocked over and blown away. I didn't know what else to say and I feel terrible for not fully calling him out. He later said, \"I'm not sexist but this might sound sexist but girls usually want to work [less physically demanding position] and not [more physically demanding job].\" He said girls, not women, which from any other person, I might forgive since it's so ingrained in us to call all ages of women girls. Out of his mouth and in this context, it felt so condescending. I've seen plenty of women in both of those positions so I don't know what thought process led him to that conclusion.\n\n&nbsp;\n\n\nI recently switched positions at my job so I had to undergo more training.  My training group seemed cool at first except for one mean woman who is clearly going to feed into the gossip mill at work. Definitely one of those popular girls who think they're better than everyone when she was in high school and never grew out of it. Anyway, one day she came in with something on her mind. \n\n\nHere's what she had to say: \"Jojo Siwa came out as gay, which is...fine. But my 7 year old watches her and she started talking about it in her YouTube videos because her [brand/media empire] is crumbling around her. I don't care if she's gay but don't push your gayness on my kid. How do I explain that to her....[later in conversation after looking up Jojo's gitlfriend] Oh man, this is definitely her first love. She's going to get her heart broken and go back to guys.\"\n\nOther people, including my trainer, chimed in with like oh this probably a phase, didnt you all experiment in high school, she'll grow out of it, oh yeah you shouldn't have to explain that to your kids. Meanwhile, I'm sitting there, queer as fuck and fuming. I tried to chime in about how these exact conversations is what keep people from coming out and continue portraying gay people as a bad, weird thing that you have to explain to their kids. This talk is what make bi/pan people question their own identities, whether or not they are attracted to the same gender and non-gender conforming people or if they are just going through a phase. These conversations kept me in the closet until I was 30 and still makes me question if my sexuality is real or if I'm \"barsexual\" or just doing it for the male attention. It's so, so, so easy to explain to your kids the existence of GSM people. \"Some people like boys, some like girls, some like everyone regardless of who they are, some don't like anyone. You can like whoever you want and I will accept and love you just the same.\" Your kids will understand. Making it out like it's a bad thing that is hard to explain to your kids is how you make your queer and trans kids grow up to hate you and cut contact.\n\n&nbsp;\n\nIn the same class,  some other woman said, \"if you meet a true mexican lady in her 40s, they all have orangutan tiddies.\" This is also the same woman who was incredulous that I ate at a certain local chain that sells chicken,fish,sandwiches, hot dogs, etc. Apparently I am too white to be eating there. She herself was also white and apparently felt that only black people ate at this restaurant. Lolwat?\n\n&nbsp;\n\nAll of these conversation topics were fine but me saying my former manager was the worst person besides Trump was a touchy subject I shouldn't talk about. \n\n&nbsp;\n\nThis is the last thing and maybe fairly benign but made me feel uncomfortable for my future in this office. I overheard some man say to a woman, \"I've got a big package for you, if you know what I mean.\" And she said something back like your package isn't big enough for me. I don't know if these people are friends and this was just how they talk to each other but I worry that this is indicative of the future sexual harassment I'll have to deal with and even have to play along with so not to be ostracized at work. I'd already heard about a man that was pushed into retirement after he had so many complaints of harassment against him so I can already tell this company is not going to take a hard, zero tolerance stance on sexual harassment and will instead make sure the harasser still receives his retirement benefits, only making him leave after he receives numerous complaints. \n\n&nbsp;\n\nThis is a good job. I want to have a future here. I'm just immensely frustrated that I've witnessed all this bigotry within such a short period of time whereas I'd maybe had a small handful of experiences like this over the course of many years and several different jobs (well, excluding the state government job I had with the manager worse than Trump, the hostile work environment caused me to quit and left me traumatized).\n\n&nbsp;\n\nWhat do you all think about this? Have you experienced similar things in your work place? How did you handle it?",
    "title": "Micro and macroaggressions at work.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1612971606,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "Architecture, Ottawa, Egypt, Where should I go from here?  \n\nHello, I don't use Reddit much, sorry if the advice I'm searching for is a bit vague, tldr at bottom of wall of text.\n\nWall of text:  \nGrew up in Ottawa, Canada, moved to Egypt in 10th grade, finished high school there, great grades, revolution! but also economic decay, a lot of events lead to me being in a Mexican standoff (actual), very long story, got into the faculty of engineering at a mid-sized university there, studied architecture, work with good friend to change stagnant faculty, start 2 clubs, all clubs get banned (politics), work for allowing the use of 3d programs for design in faculty, success!, old powerful professor is an abuser of female students, become the class that does something about it, lead class in lawsuit, lots of drama, stalemate as it got out of hand and minister of education wanted it to go away, finish 5-year program, top of class for a bit, politics happen, get shunted, tied for second, still 95th percentile, graduate in Aug 2017 and become a part of the syndicate of engineers (architecture falls under engineering in Egypt), co-found 2 startups, one succeeds another \"fails\", also work as a project manager for 2 years for the family construction company, have been teaching art for 4 years now, make a bit of a name for myself in my city as an architect/artist/entrepreneur, have a massive network all over the country, if your rich in a third world country its always blood money, no matter how \"clean\" it seems, move back to Canada in Aug 2018, father and sister are here, fathers is a non practicing architect, both sisters are also architects, find various non career work, life slows down \\*a lot\\*, get educational equivalency through Carleton and CACB in May 2020 (lol economic downturn really hampers my slim chances of getting a job), registered now with CACB as intern architect (for those unaware, in Canada its a 4 year undergrad plus a 2 year masters to become an intern), last year had a gallery for my art, sold a piece for a thousand dollars so I guess a \"career\" as an artist maybe viable, though I would rather architecture, worked at the end of 2020 for 3 months on a tiny home on wheels start up idea, however it was not financially viable after I finished the market research/business plan  \nRecently landed a sales job working for a construction magazine where base/commission would have paid about 60k a year but I quit two weeks in because cold calling+ sketchy+ not architecture  \nCurrently I'm working as a merchandiser part time, now have lots of time to work on career  \nFinancially I have no debt at all, and about 6 months worth of living expenses saved up\n\ntl;dr:  \nRegistered intern architect (Ontario) with foreign education and experience has hard time finding career job in field that is dying slowly and is known for being quite saturated, where the margins are extremely thin and half of the people in that field end up switching careers 5 years down the line  \n\n\nWhat I have currently:\n\nI have my updated resume, a prewritten 2 thirds of a cover letter to customize for each application (WIP), a website with a bunch of stuff on it (portfolio, art, music, renders, photography etc), and my architecture portfolio, indeed profile is up to date, so is LinkedIn, though I don't have many contacts on LinkedIn  \nI am a year into an application to become a construction officer in the CAF, however paperwork from Egypt is a nightmare and Covid has made everything much slower, international background check will take at least a year \\*after\\* I'm done everything, so I don't expect this to pan out anytime soon\n\nCurrent plan is to actually resume applying to construction management/architecture jobs through the OAA website/Indeed, I am looking at doing an undergrad in Civil engineering since I enjoy it quite a bit (not a s much as architecture or art) and probably some of my courses will carry over, also gets me into the \"system\" which is I think the main issue, though I may be wrong, aiming for the co-op program at Carleton, haven't reach out to them yet  \nI can post my website if anyone wants it, though wont post in now because maybe it will get flagged as spam? Idk how reddit algorithms work.  \nAny advice is welcome, I can elaborate on any point that is unclear.",
    "title": "Architecture, Ottawa, Egypt, Where should I go from here?",
    "subreddit": "careerguidance",
    "timestamp": 1624904574,
    "score": 2,
    "keyword": "mexican manager"
  },
  {
    "text": "11 months after graduating, Starting first 6 figure job as Software Engineer -- A Bit Nervous tl;dr: starting first real position, any advice or resources for a new developer who wants to become a great developer and senior software engineer?\n\nLooking forward, Need advice:\n\nI'm looking for advice on what I can do in and out of work to reach the peaks of a career in software engineering. Are there books you recommend every software developer should read? Are there things you wish you would have been doing or did when you began your career? What should I always keep in mind, what are some pitfalls (technical, interpersonal, financial, etc) to avoid? What productivity/efficiency techniques have helped you the most in your career? Any blogs or podcasts you recommend that touch on these things? \n\n\n\nA bit of my history: \n\ntldr: graduated with no internships at age 27, Went from unpaid internship to 73k dead end position, to a 100k offer that I start next month.\n\nI come from a poor immigrant family (Mexican), my dad is dead. I went back to school at 22 after waking up in a soulless, full-time, minimum wage job in a factory wondering how I got there and whether I could find a more impactful path in life. I managed to knuckle down and jump from a community college to 4-year university which I graduated from last year right as COVID hit. \n\nThe job hunt began with no internships under my belt and as expected resulted in a SCARCE amount of interviews. \n\nI started an unpaid  internship with a group of MBAs who were part of a UCI  start-up incubator. I wrote a simple Alexa skill using NodeJS that allowed a user to book an appointment with a (simulated) clinic. Even though it was relatively simple features, being thrust into AWS IAM intricacies and so on felt very overwhelming as I was their only developer. We reached a project checkpoint right before summer and I resigned to find a paid job, ready to work at a grocery store if I had to while I job hunted. I wasn't in a position to be unemployed for very long.\n\nLuckily, I got hired full time at 73k with TCS in August as part of a huge hiring surge they were conducting during COVID. They are a behemoth of bureacratic tape and after a positive initial experience in the training phase, all coding stopped and a dizzying shuffling began where I felt like I was lost in a crack of the company not coding anything and having no direction at all. I was on leetcode grinding and learning each day, sending out applications. \n\nA recruiter reached out on LinkedIn one day in late November and after a series of interviews with the company I got an offer for 100k that I start soon and want to bring a consistent \"A game\" to. My family tree pivots forever here with me, and I'm ready to do what it takes and apply all that I can muster to be competent enough to continue on this path seeking  mastery.",
    "title": "11 months after graduating, Starting first 6 figure job as Software Engineer -- A Bit Nervous",
    "subreddit": "cscareerquestions",
    "timestamp": 1613787298,
    "score": 28,
    "keyword": "mexican manager"
  },
  {
    "text": "I wanted to change jobs so I can be Nomad, but they promoted me to be manager Hello, \n\nI found myself in funny situation, when pandemic started, I found myself Mexican girlfriend, where I spent all the lockdowns and \"WFH\" we had in Europe. Now after more than year, I need to work again from the office and my original plan was to find a new work, where I can work remotely, from like september or something similar. \n\nBut as my position is growing, on my yearly review they promoted me to manager (with 1 direct report). I know, that obviously I cannot leave company now, as being manager for 1 month only would look terrible on my CV. \n\nWhat is the \"appropriate minimum time\" that I should stay so it doesn't look bad afterwards? I guess something like 1 year is absolute minimum. \n\nAnd no, company is completely against WFH unless its prohibited by government to go to the office.",
    "title": "I wanted to change jobs so I can be Nomad, but they promoted me to be manager",
    "subreddit": "cscareerquestions",
    "timestamp": 1624564065,
    "score": 2,
    "keyword": "mexican manager"
  }
]