[
  {
    "text": "Principal assigned me to dual language... I'm not fluent. Edit: I should also include that I'm a 25F high school math teacher and last year I taught half my sections in algebra 2 and the other half in statistics. \n\nFor context I'm a now second year teacher about to start my second year at the same school in a few weeks. The school that I work at is about 40% Hispanic, with the rest of the population being predominately white. Its also important to mention that I am half Mexican (mestiza) with a Hispanic first and last name. I was never raised speaking Spanish and learned the language only through high school and college in which I've studied about 5 years collectively. \n\nAt the end of the year in May/June, my principal casually dropped the news on me that I would be assigned a section of dual language algebra 2. I had no prior warning of this and my immediate reaction was to say that I wasn't fluent and didn't know how I'd be able to teach the course. My conversational Spanish is enough to get by, but it's no where near the level of a native speaker. His reaction in turn was to kind of dismiss my worries and say that he'll make sure I'm supported to help me teach the class. \n\nOver the last few weeks of school, I desperately ran around and talked to a bunch of people including the union rep and my department head and they all had the same answer which was that he was within his rights to assign me that class, but that it did seem unfair. I also sat down with a 1-1 with him and told him that I did not have the Spanish to support the class, and while he listened and empathized, he ultimately needed me to teach the course because there are no other teachers who could support a dual language class. Also as far as supports that he had loosely promised, I found out that there really wasn't any since there was no dual language curriculum, no guaranteed bilingual EAs, nor any other teacher in the district who has done with course. \n\nI am now 2 weeks out from PD and I have never felt more anxious about teaching. I'm more scared than last year which was not only my first year but also the beginning of \"COVID schooling.\" While my principal did come to an agreement that he would be satisfied which however I handle the class, assuming I do my best to make it a dual language experience, I am terrified of teaching this class. I know my Spanish isn't good enough and it feels even more embarrassing considering that my name and face just scream \"Hispanic\", which is something I've dealt with my whole life.\n\n I'm at a loss with how to move forward and quitting isn't an option right now considering I have nothing else lined up and it's so close to the start. Anyone have any words of wisdom for me or even remotely shared experiences? I don't want this to be the thing that makes me hate my job or hate this school, but everything about this situation is giving me anxiety and making me dread the beginning of school.\n\nEdit 2: Thanks to everyone who was able to chime in and give advice. It means a lot to have the support and sympathy from many fellow educators. I just wanted to add that there seems to be a little bit of confusion on what dual language is in comparison to ESL. While I am unsure about other states/districts, where I'm at, the main difference is that ESL takes speakers of other languages and has the goal of building fluency in English while DL on the other hand is a program that begins at the kindergarten level and has the goal of achieving bilingual fluency in English and the target language. Students who are in DL are not always native speakers and are cohorted from kinder up through 12th grade. They are all usually fluent in English but have varying levels of fluency in the other language. While it's simpler to offer a 50/50 experience in elementary school, at the high school level, this balance is harder, therefore the program relies on immersion since there are usually fewer DL course offerings due to limited staff.",
    "title": "Principal assigned me to dual language... I'm not fluent.",
    "subreddit": "Teachers",
    "timestamp": 1629105036,
    "score": 57,
    "keyword": "mexican principal"
  },
  {
    "text": "Cinco de Mayo & Appropriation Not sure if this was policy/politics or support/advice so i used my best judgement!\n\nI had a white student come in today in a brightly colored poncho and large sombrero. Think \"Spirit Halloween Mexican Costume\" levels here. He came into my classroom before school, obviously looking for a reaction, and I didn't give him one because I wanted to make sure my response was right.\n\nI have him two class periods from now. I have pulled aside some of my latinx students to gauge their reaction, because I am also white and I don't want to speak from a place of privilege instead of an informed one. (Maybe it is offensive to me, but my latinx students don't care and I'm fighting a battle for nothing) I did have a few kids say it was funny/not a big deal, but the rest of them did tell me they found it offensive.\n\nI think if a white student came to school in blackface, they would immediately be asked to leave. However, with this it seems more like a \"grey area\". My school has a lot of latinx students, and I feel like this action is extremely inappropriate and not for school. How do I approach this student appropriately? How can I let him know that it is ok to celebrate cinco de mayo, without treating the Mexican culture like a joke?\n\n&#x200B;\n\nEDIT: I stopped by my admin's office during lunch to get their advice. While they acknowledged that this sort of behavior is not appropriate (and our dress code does forbid racist depictions) because we have not explicitly taught them ways to appropriately celebrate the holiday, it is not fair to force him to remove the clothes or seek punishment. While I don't agree with this, I am put in a position where now taking direct action would be going against my principal's/ass.t principal's direct wishes/instructions. Talk about a rock and a hard place.  \n\n\nEDIT 2: Thank you for all the helpful replies and PMs about this. While my intentions were good, I think I have a lot to learn about the ways I refer to my students and interact with them. I am still a new teacher, and there's lots of things I have yet to master. I really appreciate everyone helping me with this! My VP ended up calling the student to the office to speak with him. She has many of years of experience on me, and I feel comfortable handing the situation over to her.",
    "title": "Cinco de Mayo & Appropriation",
    "subreddit": "Teachers",
    "timestamp": 1620235781,
    "score": 3,
    "keyword": "mexican principal"
  },
  {
    "text": "[Texas] [11th] - A teacher wants to suspend my son for a joke he made in class and i need advice on what to do. \nHe's started his Junior year of high school a few weeks back. One of the classes he's taking this year is Spanish 1. On the first day of the class, the teacher asked the class if anyone had any prior knowledge on the language beforehand. He said a few kids raised their hands, he raised his too. The teacher asked them what they knew, then she asked my son. He said \"The only spanish i know is from watching George Lopez\" (It came on Nickelodeon all the time when he was growing up). He said it got a laugh out of the class, but i guess the teacher took offense to it. That's what he told me. They laughed, he said some quotes from the show. (I Got This and Oh, Que La)\n\nBecause recently, i got called in by the principal, the spanish teacher reported him because it was a \"racist joke\". She told me what happened and it was pretty much the same thing he told me. I asked if anything else happened and the teacher got even more mad, she said \"Racism is a big deal. I don't think you're sending the right message by taking this so lightly.\" \n\nI asked what the big deal was, she said The George Lopez Show perpetuates negative stereotypes about mexican people and that people in the class have started repeating the same phrases.  I asked the principal if it was really such a big deal and they just said they weren't familiar with the series to form an opinion but he'd take the side of the teacher.\n\nShe wants to suspend my son. I looked into her a little bit and she's sort of one of those far left SJW people. Her social media is full of anti Trump and similar stuff, like Pro Antifa. The principal is following her lead because he doesn't know anything about the show and is just taking her word for it.\n\nWhat should i do?",
    "title": "[Texas] [11th] - A teacher wants to suspend my son for a joke he made in class and i need advice on what to do.",
    "subreddit": "Teachers",
    "timestamp": 1632897205,
    "score": 0,
    "keyword": "mexican principal"
  }
]