[
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 69,
    "keyword": "mexican director"
  }
]