[
  {
    "text": "My new job has me stressed out and I've been here for 9 months. It's been almost a year at my new job as an administrative assistant at a car manufacturing plant. Let's just name it Q. I had the opportunity on getting the job on the floor as assembly. I got promoted the first few hours as administrative assistant since they were looking for someone to train. I am bilingual and this plant does cater to a lot of supervisors/managers from Spanish speaking countries and sometimes they depend on me to translate/help. My Spanish isnt perfect but its good enough to get around. \n\nI had the opportunity to be trained by a girl named Trish (not her real name), and let me tell you.... it has gone downhill with her since the beginning. She would poke fun of the way I pronounce English words \"economy\" I would get tongue tied with my Spanish and say eckenomy. She would go around the plant telling people it sounded cute. Okay, so I let that one go. \nShe made a disgusting face at my fingers one time and asked why were they red? I used to eat flamin hot cheetos with lime. She said oh okay that's weird. I let that one go too.\nWe celebrated a big event at my job and me and the accounting team (there is some parts of my job that requires to balance a yearly budget, book keeping so I do some accounting), we had went out to eat and I honestly NEVER dress up. Depression humbles me so I'm usually in shorts and a shirt. Well I felt okay for once and wore one casual lilac ankle length dress and my coworkers were complementing me on it. I actually felt good about myself for once and returned a thank you. When one of them noticed my trainer wasn't saying anything, trainer turned around and said I \"looked culturally appropriate for my culture.\".... that was the most professional and carefully worded racism I've ever received. I'm a light skin mexican (full blooded) and I was shooketh. I've dealt with racism before for working In a mexican restaurant. But in a corporate world?? No one and even myself knew how to respond to that. Well I shouldn't make excuses for the others. Well I decided to let that one go too because in the corporate world you can't have feelings and I need this job for experience since I was in the restaurant industry for 10 years. \n\nWell fast forward to now, trainer still looks for problems. I'm saying her opening the business office supplies with my name on and leaving it out and my boss has gotten onto me for that because of possibility of theft in my office area, (its happened before), she will purposely get into a conversation between me and person B and I will always ask her if she needs something and she always says oh I'm just checking up on you (JUST PLAIN NOSEY), or acts like she is getting a plate near my office just to hear the conversation. And I wish that was the last one but she really REACHED for this one. There is \" office plants\" and I was only told to be in charged of one in the lobby and 2 outside the building. My trainer left 3 of supposedly hers at my window. I stopped watering them because if it isn't my job, why should I be doing hers? I'll do anything else but do her job. I told her 3 times to water them. Well one of them died and she made a big scene about it and tried to get her other friend to bully me and blah blah blah just drama over a dead plant... she even got a girl in the accounting team to come look at it and make some ugly comments too... they walked by me and said those things... well I had it and went to h.r. to report and h.r. told me to have a conversation with her over the ordeal.\nSure, I can do that, but what's to say if she continues this childish bullying/antics or it gets worse? Some of my coworkers have noticed this mistreatment too. I love my job and it's my 1st time in the corporate world, it's why I don't want to stand up or don't know how to... but I know losing sleep and losing my appetite over this is NOT worth it. I would just like the advice if I should just go find another job or stay and talk to her and hope for the best?\n\nTLDR; have issues with my trainer and she has been nosey, making fun of me for the way I pronounce a few words (bilingual), for having  red hot cheetos fingers dye,  and told me I \"looked culturally appropriate for my culture\" as a light skin mexican. I talked to h.r. about it and she said to talk to the trainer about the issues. I feel like the level of maturity is not there for the trainer if I do have this talk when she will more thsn likely flip the script...im scared to lose the job because I need the experience to look for another one.",
    "title": "My new job has me stressed out and I've been here for 9 months.",
    "subreddit": "jobs",
    "timestamp": 1688812147,
    "score": 48,
    "keyword": "mexican manager"
  },
  {
    "text": "Not growing , Should I quit my job? I am at a point in my life where I am not really sure what to do , and I would like to read your advices or expiriences if you have been some where similar.\nNot an english native speaker , I am from Mexico , I apologise for any mistake.\n\nLittle back ground , I [24 M] studied mechatronics engineering (2016-2020) , mostly because my father forced me to , and becase my friends were going to study that. That being said , I did never studied,  I had a problem with videogames , or maybe it was the fact that I did not truly like the career , both?\n\nI mean that was interesting to me , but I was not enjoying it. And even then, somehow I managed to be the best of the class in some subjects and be just a little behind of the higest grade who was really making a big efford, ( 94/100 vs me 93/100).\n\nSo I was always chill and some how people got the idea that I was a genious.\n\nBy the end of my career I realised that I had a problem and that those were not the smartest choises , but what was done was done.\n\nI tryed to look for a job but covid made it really hard , so I spent about 1 year and a half unemployed , depressed ( yes playing video games ) , thinking that I was not good enough , also my knowledge I did very little to keep it with me fresh and close. \n\nBy agoust 2021 , A friend told me about a job in USA, I applied and got hired , but I did not really know what was truly about , so my maintenance job ended up being a job as a loader , It was a little dissapointing but yet WAY better than where I was , also salary was a little over the minimum  (11.25$/h) but It was about 2- 3 times of what a senior engineer makes in mexico. Also I was living rent free.\n\nSo I stayed for the money also with the promise thag I could get a better position in the future , move fowards  some months to mid 2022 , I get a new position as a warehause supervisor and and 2 more dollars per hour (13.5$/h) , taking care of shipments , logistics and staff. \n\nAnd I have to say that despite all the suffeeing , the 13h shifts 6 days a week , the stress and problems , at the end of the day I feel that I was doing something that I like and I was learning the tricks of the trade ,But that chapter came to and end. By late 2022 thag contract was over and I had to go back to the lines or to the maintenance team in a new company.\n\nI applyed to maintenance and got the job , barely because I had no experience on the field but I am somewhat good at english.\n\nSo the thing here is I am making way more money now (21.5$/h)  , but the thing is that this enviroment is really bad , the boss and supervisor are not training us at all , we got no manuals or means of study , we are not allowed to do NOTHING at all with out asking for autorization , no matter how small it is , there are days in which I do not do nothing at all , also they only make us do the heavy phisical work , just like a loader , and the work that need some technician knowledge , wheee I could learn they keep that for themselves or people from their same nationality to which they allow them to have way more freedom ( they are not americans btw ) \n \nI have learnd a few thing from my maintenance coworkers ( also mexicans) , but they are like that with at of us , despite that some of my coworkers have really good knowledge and experience and they fix things that our boss and supervisor can not.\n\nOne of my oldest coworker told me that I would learn very little from an enviroment like this. And I think that I am close to the point where I can not learn any more by myself and without my boss letting us do any work that requires technician knowledge at all.\n\nAlso we work with chemicals and powdered graphite  , and we do not get the proper personal protection equipment , and even if we do not work with those materials they are somehow always in the eviroment and a facemask is not really enough.\n\nAs you can see this is messing upnwith me since and not growing any real knowledge or skill , and also this 13h shifts are taking me away from things like relations ships and self care.\n\nI want to quit this job and get a nice 9 to 5 in data science or something that was like that warehause supervisor job that I had , but I do not have real knowledge in anything to do that given my background.\n, nor the time to study something new. \n\nAlso since I work under a workpermit quitting and finding a new job is a gamble , because I have to request a new work permit , and the job has to be related to my career/profile , and logistics/data science is not really realated to mechatronics / maintenance , that makes things even harder and unlikely to get a new job , The only good thing about this job is that I have been able to save money and help my parents and sibilings.\n\nI still have about 14 months ( which I do not have problems to complete)  left in my current work permit and this contractor that I work for is sued and under investigation since their bad practices , and renewing my work permit here is very unlikely to be approved.\n\nAnd If I happen to go back to mexico , salaries and job opportunities are way worse , but atleast I would have some freedom to study.\n\nI just feel really lost and not growing at all in my profecional career , any advices on this?\n\nEdit: Also I would like to add that I am a little uncertain/affraid of a change of path on my career , I spent 4 years on a degree to end in a place that I do not like , what if it happens again? How can I be sure that changing my profile is the right call? , and the one thag I choses is the one?",
    "title": "Not growing , Should I quit my job?",
    "subreddit": "jobs",
    "timestamp": 1676886941,
    "score": 2,
    "keyword": "mexican manager"
  },
  {
    "text": "Why can't the women just smile more, the ingrates! Don't they realize they hurt my manly man feelings? A (somewhat) Historical Perspective. So, as it often happens to me, I started reading online about some topic or other and I went down a rabbit hole that eventually took me to the role of women in wars. After lots of reading and googling I landed on the Wikipedia article about *soldaderas*, who were women combatants (and at least one officially known trans man) during the Mexican Revolution. \n\nThe conflict lasted from 1910 to 1920 and an estimated 2.7 million people were killed (that's over 20% of the population at that time, yo!), with roughly one million being civilians. It was bleak. Entire towns were raped, sacked, and burned. The Federal army would conscript all the able bodied men who hadn't already joined the Revolutionaries, leaving the whole village or town defenseless against either outlaws or worse: Federalist AND Revolutionary battalions full of rapists. Very often they would order the able bodied women to join their army too, and kill whoever refused.\n\nAccording to a lot of sources, most women joined as camp followers, since being in close physical proximity to an adult relative or spouse meant protection from rape and abuse (usually), even if it meant they were basically slave labour and could die in a massacre; commanding officers also favoured the practice since it would raise morale and reduce rates of desertion. \n\nThen there were the other women, the ones who picked up the guns and joined either army in combat roles despite the men's objections. Some commanded only women, others commanded many men. At this point I can only speculate, but I think it's safe to say that these women knew that shit was going down. They knew then, as we do now, that every second they existed was a window of opportunity to be abused, tortured, or killed... or they could just march into battle, you know? I mean, they're going to get killed anyway, right? Might as well end it quick. \n\nImagine being in that position, imagine steeling yourself for battle. If you're lucky to have a horse, you pray that you don't fall. If you're on foot you pray your gun doesn't jam and that the horse that tramples you will kill you fast. Maybe you have relatives waiting for you back home, maybe you don't because they were all murdered by the army you're fighting against, or by the army you're fighting for, war is messy like that. You wonder if the next time you're raped (yes, again) it will be by the enemy troops or your own people, but that's not important now. What's important now is staying alive, against all odds, logic, or common sense, because surely you must be irrational to want to stay alive in this hell. \n\nThese and many more things go through your head as you wait for the charge...\n\nAnd then this motherfucking clown:\n\n>In November 1911, a Swedish mercenary, Ivar Thord-Gray, who was part of Villa's forces observed preparations for battle. \"The women camp followers had orders to remain behind, but hundreds of them hanging onto the stirrups followed their men on the road for awhile. Some other women carrying carbines, bandoleers [sic] and who were mounted, managed to slip into the ranks and came with us. These took their places in the firing lines and withstood hardship and machine gun fire as well as the men. They were a brave worthy lot. It was a richly picturesque sight, but the complete silence, the stoic yet anxious faces of the women was depressing, as it gave the impression that all were going to a tremendous funeral, or their doom.\" \n\nReally, Ivar? Really? They WERE going to a tremendous funeral AND their doom! 1 in 5 Mexicans died during that war! BUT NOOOOO! Ivar baby wants ThE pIcTuReSqUe WaMeNz to smile more because it fucking depresses him. \n\nI can almost hear him: \"Hey I know you gals are facing cannon fire and machine guns, but... would it kill you to smile? You'd look prettier!\" \n\nI know, I know, I'm mostly tired too, so much so that I don't even react when that kind of stuff happens in my life anymore, but for some reason this quote really got me. \n\nUGH! \n\nThank you for coming to my TED talk.",
    "title": "Why can't the women just smile more, the ingrates! Don't they realize they hurt my manly man feelings? A (somewhat) Historical Perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1695301760,
    "score": 66,
    "keyword": "mexican manager"
  },
  {
    "text": "Why lie to me? Some background: I started a new job, yesterday was my first training day. Now, I’m mixed( black and native) so my skin is lightish but I have dark hair. Why the description? Because my new job is mainly made of Hispanics/ Mexican Americans and Latino people. \n\n\n\n\n\nThey started speaking Spanish to me.\nWhen I said I didn’t understand they asked me if I was mixed. I told them I was and they asked why didn’t my one parent teach me Spanish and it clicked for me that they thought I was mixed with their roots. When I told them I wasn’t, they all said they thought I was Dominican. ( I get that a lot but most of the time from older white women who assume I don’t speak English for some reason) \n\n\n\n\nThe assistant manager was training me. His friend kept walking back and forth saying hi( he doesn’t know English well) and I’d say hi to be nice. Well the AM asked for my number for said friend I’ll call J. I said NO immediately and quickly explained that I don’t date, I study with Jehovah witnesses and I’m probably never going to date. As soon as I finished the AM said it’s for a work group chat, basically to cover shifts. \n\n\n\n\nSo naturally I felt (teeny tiny bit) bad for going on my lil tangent and apologized and gave him my number, to which he didn’t believe it was my number and proceeded to call me to check. (Red flag 1)  basically I get home to see he added me on Snapchat. And there is no work group chat. \nHe thought I was pretty and wanted to know if I would go out with him. \n\n\n\n\nI told him no straight up but my problem isn’t with J. I would’ve told him no anyway. It’s the fact that the AM lied to me, and either lied to J or J was secretly in on it cause he thought that if I talked to him it would change my mind. I just hope the AM doesn’t say anything to me cause I’ll call him out ( not rudely tho but definitely setting boundaries.)",
    "title": "Why lie to me?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1683766762,
    "score": 19,
    "keyword": "mexican manager"
  },
  {
    "text": "Afraid to File a HR Complaint I know this isn't typical \"work reform\", but I feel like it's something that deserves more attention here. \n\n&#x200B;\n\nWarning: Long tl;dr at bottom \n\n&#x200B;\n\nI am a white male, CISHET presenting human. (I'm fairly pansexual) I am currently working as a mountain bike trail builder for a small town, and it's a job I absolutely adore. This is true for my winter role as well. The problem is that in the summer, I loathe many my coworkers. It didn't take long to realize that I just didn't want to interact with them because of their topic of conversation, and the \"know-it-allness\" of one of them. \n\n&#x200B;\n\nSo it all came to a head the other day when I expressed my opinion of what the next work on the trails should be. And the Know-it-all guy rolled his eyes as if to say \"oh look at the dumbass speaking\". This when he hasn't been on our trails all summer due to injury, and every day we go to perform the work he keeps telling the bosses we should do, having a reason not to help. \n\n&#x200B;\n\nSo I called him on it by saying \"Could you not? Especially if you're not going to come help string trim?\" And he fucking blew up at me \"Why, I could string trim circles around you!\" Yeah, I don't really care, it's irrelevant. He continues to lash out and act a fool, even saying I'm the cause for all the problems on the team. \n\n&#x200B;\n\nStatistically, he's right. In a later team meeting I mentioned my being the outsider of the group, and that's okay with me. I always have been. (Two of them and a boss work together on a different winter job, and the other guy has worked with them for years.) I have various examples of this being true, and was told then by one of them \"that's not how it works here, you're not the outside person, you're not a victim.\" or something of this sort. \n\n&#x200B;\n\nI even mentioned to my boss that when I realized their conversation topics were not things I want to talk about, I just stepped out of them. He then proceeded to ask me if that was the best thing to do, placing the blame on me. Here's the conversation topics:\n\n&#x200B;\n\nThis girl they had nicknamed \"solar eclipse\" because she was under 18 and you can't look at her. Now that she's turned 18, she's referred to as \"Lunar\" and they gawk more openly. Kinda like when Emma Watson was turning 18 and people essentially had countdowns for it.\n\n&#x200B;\n\nThey spend much of their time talking shitty about, or making fun of people when they're not around said person. Even those they claim to be friends with.\n\n&#x200B;\n\nI have heard many times the valuation of women according to the size of their tits. Or rather, the only characteristics I hear about women from these men are bodily characterists. And of course one of them who is about to be a father is the typical \"I have to protect my daughter from men\" types, which is to say he feels he needs to protect her from people like himself and his friends.\n\n&#x200B;\n\nThey still call things they don't like \"gay\". They refer to some traits of humans, derogatorily, as \"woman\" or \"female\". \n\n&#x200B;\n\nAnd you can most certainly, according to them, judge the quality of a Mexican restaurant according to \"little abeualitas in the  kitchen.\"\n\n&#x200B;\n\nOh, and they also leave their work trucks idling when mowing large lawns for an hour or two at a time so they can get into a cold truck when they're done. Even when it's parked next to the climate controlled building our team office is in.  Or when they go into the store for minutes at a time, or gather implements for the day from storage, etc.\n\n&#x200B;\n\nFuck this drives me nuts.\n\n&#x200B;\n\nIt's a team of five. I only get along with one of them. And since the foreman is on a winter crew with two of them as EMTs at a different job, he's probably not going to support me in this, either. He's too close to the problem.\n\n&#x200B;\n\nThe boss/manager litterally just sat there while the dude raged at me, and him, about me being the problem with the team, because no one challenged them then. (I've only directly done so twice.) So he's not really capable of being quality help, and spent his time explaining to me that he hired people for their strengths, and thus doesn't focus on their weaknesses. Weaknesses such as laziness, being an argumentative know-it-all, etc. I was also told that if someone is causing problems and can't work as a team member, he has no reason to invite them back for the next season. Which I'm guessing is me, the guy who's waiting to be screened for Autism and ADHD. Cause it's true, I'm the burr under the saddle, and against sexism/racism/homophobia like this, I'm okay with being the odd person out until it makes my life miserable in a place it shouldn't. \n\n&#x200B;\n\nThere is no way there won't be retaliation if I take this to HR. I see no way it will get smoothed over, either. Because I just don't tolerate this sort of shit and don't want to be around it. So by removing myself from it, I'm accused of \"having a shitty attitude.\"\n\n&#x200B;\n\nAnd it's not like they wouldn't hide all this in front of women, or Mexicans, or gay people.  The bosses don't see it, and I do because I'm sort of out in the field with them. And it's not just them. I hear this bullshit in my locker room at the other job, particularly during our Pride week. One guy even talked about how stupid and illogical women are while I was, ironically, on the phone with my partner who is a professor. And if I file a complaint, it's basically the equivalent of dropping an armed hand grenade in the room while they're wearing body armor and I'm not. I really don't know what to do. Especially without putting my winter role at this job in jeopardy, when this crew isn't around and I get along with everyone because they aren't like this. \n\n&#x200B;\n\n&#x200B;\n\ntl;dr I work with a bunch of men who only talk about women according to physical characteristics, judge Mexican restaurants by \"the little abeualitas\" in the kitchen, and spend a lot of time talking shit about their \"friends\" behind their backs, and letting truck engines idle for hours a day. I removed myself from these interactions, and have had to defend myself a couple times, and am accused of having a shitty attitude and being the source of all friction from the team. But if I take it to HR, there is no way there won't be retaliation, and it might cost me ability to work a labor service I really love providing for the community. \n\n&#x200B;\n\nI just needed somewhere a bit to rant. Maybe to get some insight.",
    "title": "Afraid to File a HR Complaint",
    "subreddit": "WorkReform",
    "timestamp": 1690666358,
    "score": 9,
    "keyword": "mexican manager"
  },
  {
    "text": "Im a delivery driver for a small business and it sucks  \n\nI (24, male) work for a dental lab. Basically, when you go to your dentist and need a crown, partial, implants or dentures, they order from us. \n\nIt's a small business, and the boss has no idea how to manage money. He owns three different cars, one for business meetings, a nice Mercedes that's kept in storage most of the time.( which I don't have a problem with because you need a nice car to show that your legit, I guess) but he also has a Cadillac SUV, and a Tacoma. Idk what his wife drives. \n\nAnyways, it just looks bad when he has to pull up at gas stations to hand me a different credit card for the gas. That's why I'm mentioning it. Like the card declines half the time. I've had to buy some gas here and there because if there's no money on the card and no cash in the business purse, then I'm fucked. Can't work. Plain and simple. Oh and dentists can't get their cases for their patients. So if your dentures are taking forever to get to you, I'm sorry, it's not entirely my fault. \n\nI work for California minimum wage, $15/hr. I have no benefits. No sick time. No 401k. No insurance. Nothing else. Just pay. \n\nI have a company car provided, and expense wise they take care of it, like oil changes and shit. But they have no idea, like no clue about car repair or even maintenance. \n\nI was driving a 2010 Kia soul, with 285,000 miles. Cracked windshield, fucked alignment that drives to the left. \n\nBefore it was stolen, the brake pads were grinded down to nothing. The transmission was failing. One headlight was out. One taillight was out. The key snapped off a while ago, and it was just glued back on pretty much. \n\nIt was sketchy to drive, and I was getting scared. (No I did not steal the car ok, I know what your thinking) \n\nSo I'm glad it's gone. But, when I did have it, it was so hard getting parts and getting any sort of permission to take care of it. \n\nWhen it was stolen, I couldn't work, because they refused to rent a car daily. I couldn't work for a full week and was looking at other jobs. \n\nI didn't want to use my own car, because it's  new (under 50k miles new, which is as new as someone my age can get) and if I wrecked it, I would owe like $20k while finding a new car. (never been in an accident btw) and the mileage is killer. Years of use in a month basically because I'm driving over 100 miles a day. And they aren't going to reimburse me for the mileage. \n\nI am lucky enough to get paid at all. Is basically what my supervisor told me. So, yeah I'm trying to have this job be as temporary as possible. \n\nBut to get to the real point for the post; it sucks. \n\nIm given  routes by someone who doesn't know where everything is. They don't know how long it takes to get from one place to another. They never calculate traffic. They expect me to drive fast, which I'm not going to do, I will not risk life and limb for this bullshit. Im a California driver, so I'm already driving fast enough. \n\nThe doctors talk and complain to me, like I know what dental problems they are having. I'm a driver, not a fucking technician. And they never have the cases ready to go at a moments notice. Alot of them have two hour lunches and they complain that we never come by. They keep reminding me their lunch hours, like our schedules can easily accommodate theirs. Like bro I don't have lunch till I'm done. Hell most of the time I'm eating while I drive. \n\nI can't shit, because there's literally no time for it. Recently, I've had like a whole page of destinations for my morning route, ( this particular day, it was a 3 hour route, but they kept telling me it should have been less than 2 hours, and then they keep adding places when I'm on the road, like wtf). It took me all day that time. They were on my ass, asking me why it took so long. \n\nI didn't have the words, tried going through the route with them about it, but they insisted I was fucking around. I'm just over it with them, looking for work somewhere else.\n\nThe doctors are horrible, they complain all the time. Their staff always try to leave early, and lie about me not being in time for deliveries and pick ups. \n\nBut the worst thing is that no one believes Im working in good faith. Both the doctors and my own co workers think I'm some fuck who doesn't want to work. My only friend is an older Mexican man, who knows what's up, and told me before everyone there are fucking idiots. He owns his own business, this is a side gig for himself. \n\nBut oh my god, people are so incompetent and I'm suffering because some fuck doesn't want to run his business like a business. \n\nI'm not the only one who suffers. A Japanese man living in Texas is a remote worker, a tooth designer working for us part time. He hasn't been paid this entire month. \n\nThe boss is in Vegas, and people have not been paid. I also heard this is more of a hobby for him, because his wife is rich. So basically he's a beta male cuck who has people depend on him but he just likes to pretend he's a business owner. That's it, that's my boss. \n\nBefore this I was working for a overnight courier franchise, at a warehouse. I worked long hours, graveyard. It was horrible, it gave me insomnia. But, at least they gave me sick hours, health insurance, and let me work overtime. They wrote me up for attending my grandmother's funeral, and withheld a check from me, but idk it was better than getting fucked by some people who have no concept of business. \n\nThe warehouse job also had pizza night on Friday so I mean that was cool. \n\nBut fuck small businesses man. At least the ones run by an idiot.",
    "title": "Im a delivery driver for a small business and it sucks",
    "subreddit": "WorkReform",
    "timestamp": 1702700929,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "Someone close helped me get a job that I ended up hating, should I quit? So, the title basically... \nI (23M, don't know if its relevant) recently graduated here in Mexico from my master's in operations research. I did mechanical engineering for my undergrad. I've always had the dream of permanently moving to Europe. As I'm single and just starting my career, I thought this would be the perfect time to try it.\nOne of my main areas of interest is data analysis and business intelligence. I've even taken additional certifications and courses to work in this industry. Thinking I would be doing exactly that, I reached out to a relative who's the CEO of the Mexican division of a small Spanish IT consulting and digital transformation company.\nI got the a one-year contract offer to work with the Spanish team and started mid-December. I've hated it every single day since then. It really seems I've bit more than I can chew. They have me taking certifications on cloud computing and informatics, things I didn't study in university and only have a very basic grasp about.\nThe company, I guess through my relative, agreed to help me with any documents I need for the Visa process to move to Spain. \nTo make matters worse, I'm doing 100% remote work right now. Due to the time difference, there's a very small window of time to ask questions. For the rest of the day, I'm stuck trying to understand the material on my own.\n\nI'm starting to second guess my decision. I definitely think I can eventually move to Europe via another path, maybe a corporate management job once I have more experience. And I know there are plenty of data analysis and BI opportunities here that would make me a lot happier, allow me to get to know people in a real office, and give me experience.\n\nHowever, I feel like I have my hands tied. My relative helped me get the job in the first place and I feel I'd leave him in a very bad position if I suddenly decide to quit.\n\nAny advice?",
    "title": "Someone close helped me get a job that I ended up hating, should I quit?",
    "subreddit": "careerguidance",
    "timestamp": 1673534619,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "Where to go after working fast food? Hello, I'm new to this sub and after scrolling through a few posts and I seem a bit younger than most posts here but anyways here's my situation. \n\nI got hired at a certain popular  \"mexican\" fast food place just about three years ago at 16 and I climbed the ranks to manager.\nI have not liked being the boss and having to deal with people (both employees and customers). I'm a positive person and I don't like being rude and that tends to be my downfall when needing to be bossy. \n\nAll that said I'm moving to a new state soon and will need a new job while I look into higher education. What are some good opportunities that are a show up work hard and leave kind of job that pay well? Not necessarily benefits or rewarding work but honest and good paying.\nI like the prospect of automotive work like tires or oil and I plan to go into aviation in the future. \n\nThanks in advance for the replies and sorry for any bad formatting.",
    "title": "Where to go after working fast food?",
    "subreddit": "careerguidance",
    "timestamp": 1686630771,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "Would you take a sales position that starts with base and then transitions to full commission? I (M23) don’t have no one depending on me and have expenses of about $2,500 a month. I have an offer right now for Inside Sales B2B for a very well established Mexican security systems and wireless distributor, they have 40+ years in the market and want now to start in the USA (the role I am offered). I will start of with a few accounts that they already have. They’re customers are pretty much installers of security/wireless systems.\n\nThe offer is the following:\n\nWith a weekly pay of $28/hr for the first 3 months, with a sales goal of $30k in June and then changing to $15/hr or commission pay (whichever amount is higher).\nCommissions are uncapped with a max value Paid Profit * 0.09 or 0.5% * sale items.\n• Additionally, every month you will receive an email with special items that give additional bonuses.\n\nI have met and talked to Human Resources guy and Operations Manager for the new USA location and they keep saying that 60k a year is VERY realistic and their avg sales rep is doing 80-90k and top one maxing out at 120k, but that is Mexico and there’s always higher profit in the USA.\n\nI am fluent in both English and Spanish so the company not only has sold me in it being a good chance with good products and small competition, but their people too seem very nice and mostly speak Spanish where I can communicate better.\n\nI have past experience in sales doing on my own as a 1099 logistics agent but was not to successful since I started full commission and that was very stressful, I am in the purchasing department now and do not enjoy it at all.\n\nI do miss sales a lot since there’s a tons of potential to make money and I just love talking to people, I think this is a great chance since it’s the first time I’ll ever do sales as a W2 and with more formal training and support.\n\n\nWould you take an offer where it first starts with base and then turns into comision only? If yes, why? If not, how could I counter offer this?",
    "title": "Would you take a sales position that starts with base and then transitions to full commission?",
    "subreddit": "careerguidance",
    "timestamp": 1676917039,
    "score": 1,
    "keyword": "mexican manager"
  },
  {
    "text": "Why am I not getting interviews? Hello everyone,\n\nI was working remotely as a marketing operations manager for an American startup, they found me through LinkedIn and hired me, sadly I was laid off 8 months ago. I'm a Mexican citizen and currently residing in Mexico. Unfortunately, there aren't many opportunities for these marketing ops roles within Mexican companies. Consequently, I've been actively applying for numerous remote positions with companies and startups based in the United States and Canada.\n\nHowever, I've noticed that almost all of these companies ask about having a work permit, which I don’t have. I believe my resume is strong, so it appears that the lack of a work permit might be the primary reason why I'm not even considered for interviews. Let me clarify that my intention is not to migrate to the US or Canada; rather, I simply wish to work remotely from my own country.\n\nI would greatly appreciate any advice or suggestions you may have on how I can increase my chances of being considered for interviews. Thank you all!!",
    "title": "Why am I not getting interviews?",
    "subreddit": "careerguidance",
    "timestamp": 1687580226,
    "score": 0,
    "keyword": "mexican manager"
  },
  {
    "text": "A1 at a Big4 - getting fired? Throwaway account for obvious reasons.\n\nI started in audit at a B4 this September after graduating in May and have been on a public audit job since then. Over the weekend, I was at my offices holiday party which was at a rooftop bar/Mexican place. While there, I did consume a few alcoholic drinks. \n\nThe food style was grab and go so during the party, (my gf was there as well), I grabbed a taco while taking with her and some of my senior/regular managers and their spouses. Since this was a taco place, there were many different options including chicken, fish, steak, vegetarian, etc… Anyways, I grabbed by accident and took a bite of a mushroom taco (wtf) and got instantly sickened by the texture and taste. and had to throw up so I do so over the side of the open balcony since trust me, I wasn’t gonna make it to a trash can or bathroom. I want to reiterate that I didn’t throw up because of alcohol but because of the mushroom taco. \n\nRight after this, I was asked to leave the venue and even offered an uber by some partners I haven’t met yet. My question is, am I getting fired for this? I didn’t get any emails from HR yet and I tried to explain the miscommunication on-site to the partners that I can’t handle mushrooms and accidentally ate the taco but they really wanted me to go so I just left. Although i didn’t charge the company money with an uber and left on my own.\n\nWill I be fired for this? How can I apologize to the managers and explain it was a taco and not alcohol issue?",
    "title": "A1 at a Big4 - getting fired?",
    "subreddit": "Accounting",
    "timestamp": 1701588944,
    "score": 199,
    "keyword": "mexican manager"
  },
  {
    "text": "My boss thinks white men are more competent. She's a middle aged white woman too.  I'm a white passing Mexican young woman.\n\nI got my white boyfriend a job working with me in a corporate type office job. The issue is that my boss gives my bf all the opportunities that I feel should be given to me. Mostly because I have not only already performed the work when they needed and made award winning improvements. I proven my competence many times over and had to work way harder than my boyfriend to get half as much. \n\nIt's like my boss has us switched around in her head. Like she thinks all the work I've done was actually done by my boyfriend. Everything I've wanted she's given to him. The position he was promoted to, that I thought I was a shoe in for, has exclusively been held by white men. \n\nI was actually the first Hispanic female in her department to have ever been promoted from hourly to salary. The company has existed since the 80's and she's been in the department for 20 years. And she did everything to prevent my promotion, going so far as to make a position just for me which was the same work plus my previous position for 3/4 of the wages paid.  \n\nShe chooses to have a less productive and competent person do the task because she believes white men are unequivocally more competent. The black men and Hispanic team members have also been passed over on ALL opportunities in favor of less experienced white men. We're the only minorities in the department btw. \n\nAnd she always insists on working with the white men in our department, even going as far as re-writing the job description to work under her instead of the actual managers. It's creepy, but I never disclosed the employee I recommended is also my boyfriend. \n\nI know this job isn't forever, but I just needed to vent. Me & the bf are good, it's not his fault that he benefits from a white patriarchal society while I suffer.",
    "title": "My boss thinks white men are more competent.",
    "subreddit": "Feminism",
    "timestamp": 1689373817,
    "score": 8,
    "keyword": "mexican manager"
  }
]