[
  {
    "text": "Position Advice Hey guys,\n\n&#x200B;\n\nI was recently offered a position at a high school to teach English. The principal offered me two trajectories. Either to teach sections of freshman and senior English OR ELD courses (smaller class sizes; and also where my training is) and Mexican-american literature courses. Obviously it's down to my personal preference but any advice on which might be better?",
    "title": "Position Advice",
    "subreddit": "Teachers",
    "timestamp": 1559420464,
    "score": 2,
    "keyword": "mexican principal"
  },
  {
    "text": "Spanish Teachers, how badly did I mess this up? I recently created a program that allows me to mass-text all 130 of my students parents at once. Most of them are Spanish speakers and I can’t say I know enough to hold a conversation despite being Mexican-American. For this reason, I usually use Google Translate to help me when I want to sent a message home. \n\nSo I sent home the following message in hopes of connecting with parents: \n\n\"Hello Señora ______ Cuando termina la etapa de luna de miel del año escolar y cuando comenzamos a sentirnos cómodos en nuestras rutinas, yo quería para ofrecer una frase: 'El éxito es la culminación de nuestros pequeños hábitos diarios de la forma en que hacemos nuestras camas a la forma en que interactuamos con los demás'. Si tiene un momento esta semana, reflexione sobre esta idea con Zaida ya que estos pequeños recordatorios a menudo pueden tener un gran impacto. Muchas gracias por permitirme conectarme con usted a través del texto. Mr. Casica\n\nI meant to communicate something along the lines of \"As the honeymoon stage of the school year ends...\" but apparently this didn't translate well and some parents let my principal know. Does it really translate that bad?",
    "title": "Spanish Teachers, how badly did I mess this up?",
    "subreddit": "Teachers",
    "timestamp": 1571371063,
    "score": 2,
    "keyword": "mexican principal"
  },
  {
    "text": "Tips for a first time teacher who will be teaching at an international school! Greetings r/Teachers! Long time lurker and first time poster here. A few weeks ago, I accepted a job at a Mexican international school that teaches my province’s curriculum. I will be teaching grade two and moving there at the end of April. \n\nThis is my first formal teaching position. Do you have any tips for 1) teaching at an international school for the first time; 2) working with ELL students; 3) specifically living/teaching in Mexico; and/or 4) establishing a professional presence at an international school? I have done as much research and planning as I possibly can, am actively learning Spanish and am in regular communication with my principal and other staff; but I figured this community could provide me insights I may need. \n\nThanks in advance!",
    "title": "Tips for a first time teacher who will be teaching at an international school!",
    "subreddit": "Teachers",
    "timestamp": 1554254739,
    "score": 1,
    "keyword": "mexican principal"
  }
]