[
  {
    "text": "Someone close helped me get a job that I ended up hating, should I quit? So, the title basically... \nI (23M, don't know if its relevant) recently graduated here in Mexico from my master's in operations research. I did mechanical engineering for my undergrad. I've always had the dream of permanently moving to Europe. As I'm single and just starting my career, I thought this would be the perfect time to try it.\nOne of my main areas of interest is data analysis and business intelligence. I've even taken additional certifications and courses to work in this industry. Thinking I would be doing exactly that, I reached out to a relative who's the CEO of the Mexican division of a small Spanish IT consulting and digital transformation company.\nI got the a one-year contract offer to work with the Spanish team and started mid-December. I've hated it every single day since then. It really seems I've bit more than I can chew. They have me taking certifications on cloud computing and informatics, things I didn't study in university and only have a very basic grasp about.\nThe company, I guess through my relative, agreed to help me with any documents I need for the Visa process to move to Spain. \nTo make matters worse, I'm doing 100% remote work right now. Due to the time difference, there's a very small window of time to ask questions. For the rest of the day, I'm stuck trying to understand the material on my own.\n\nI'm starting to second guess my decision. I definitely think I can eventually move to Europe via another path, maybe a corporate management job once I have more experience. And I know there are plenty of data analysis and BI opportunities here that would make me a lot happier, allow me to get to know people in a real office, and give me experience.\n\nHowever, I feel like I have my hands tied. My relative helped me get the job in the first place and I feel I'd leave him in a very bad position if I suddenly decide to quit.\n\nAny advice?",
    "title": "Someone close helped me get a job that I ended up hating, should I quit?",
    "subreddit": "careerguidance",
    "timestamp": 1673534619,
    "score": 1,
    "keyword": "mexican ceo"
  }
]