[
  {
    "text": "Did I do the right thing? So I’m in training for a new job & I was paired to do a short project with this older guy that was in the military. He has said things I don’t like before, but I always brushed them off because I always think, “whatever, people are not perfect & it’s unfair to judge people for every little thing they say.”\n\nSo the guy has mentioned before that he doesn’t like that democrats want to “take his guns” which is dumb to me, but I did not think it was enough to worry about, even though I lean more towards the Democratic Party. I brushed it off\n\nYesterday got really weird though. I was grouped via zoom alone with him & we were talking about car accidents & he mentioned that his buddy was hit by “an illegal” that “wasn’t even supposed to be in this country” & I was taken aback. I’m Mexican & that term feels gross to me & has been used in hateful ways. This man is white, so it stung more & in the past he mentioned he was annoyed when people spoke Spanish when he was in the military. \n\nThis same day, while we were alone, he said he was catholic & that he does not hate gay people & believes they should have rights, but that they are committing a SIN. This implies the LGBTQ is immoral, so I was really uncomfortable.\n\nI was so annoyed and upset that I told my trainer that I did not want to be grouped with him anymore.\n\nThis caused them to report the guy & I feel strangely guilty.I believe people deserve to believe what they want, even if I disagree, but this felt horrible. \n\nI’m conflicted because I feel like I did the right thing, but I also didn’t try to talk to him about it to resolve it. I didn’t have the energy to with all the other stress I carry & I was grossed out.\n\nShould I have talked it out with him first? Am I a tattletale? Did I do the right thing?",
    "title": "Did I do the right thing?",
    "subreddit": "jobs",
    "timestamp": 1679784548,
    "score": 2,
    "keyword": "mexican judge"
  },
  {
    "text": "Shut your CRT ass up! My husband last night wanted to have dinner with his parents and I was down. Then he mentioned some of his parent’s friends would be there, and I was still willing to go because the in-laws are my in-laws. \n\nLet’s call the new friends Marti and Barty. Marti seemed like a nice and sweet lady, but Barty on the other hand was a real asshole. \n\nWhen we first got there my in-laws and their friends were in the dining room eating, and my husband and I are were in the living room. While we were eating I thought I overheard Barty saying some real off-putting shit about Mexicans and Cuban, but whatever I let it slide because I wasn’t sure. \n\nAfter they got done I heard my MIL say let’s go to the living room to join us, and oh my I wish I would have left then because they brought up that I was a school teacher. \n\nIt was the usual I wIsH I hAD tW0 moNthz oFf or I CoUlD dO tHaT jOB iF iT wAsNt fOr thE kiDs teeHEE and blah blah blah blah. Nothing that really bothers me because I, my husband, and in-laws know how hard I work, so whatevs. \n\nThen Barty says, “I hear they’re teaching kids to be racist in schools.”\nFIL replies, “No, they are starting to teach Critical Race Theory.”\nBarty, “Yes thats the thing” and then they both look at me.”\nSo I say, “No, no one is teaching CRT, and it’s not even in most state standards.” Barty says, “No they are teaching it at schools because I heard it from Dr. Phil.”\nThen I politely say, “No, actually they are not because K-12 students cannot grasp CRT. CRT is usually taught in grad school or upper level college, teaching CRT would be unable to be taught to K-12 students because they do not have a firm understanding of Law, History, or theory to properly apply CRT”. \nBarty stares at me and says, “We’ll it’s being taught.” \n\nI cannot fathom how people still take the word of Dr. Phil these days lol and this man knows no teachers and ain’t even from here. \nSo what I really wanted to say is “SHUT YOUR CRT ASS UP. Motherfucker, YOU don’t even know what CRT is! Students aren’t even on grade-level and you think they can learn CRT??” \n\nBest part of last night was the official start of summer! It was also my birthday! And FIL said we ALL would have dinner again next week! Yaaaaaay!\n\nEdit: wow I did not think this would blow up like it did lol thanks for the coins, idk how to use them but I’ll figure it out 😆 and thank you for the responses as well some of them were hilarious too. \n\nSomeone commented I should make videos or posts about this subject matter and honestly it’s worth it. Even if I wasn’t teacher, you all out there are amazing individuals, and yes the compliment even extends to those who judged me based on this post or my Reddit account. \n\nFinally, I just wanna say that I was raised and believe that everyone does deserve respect and kindness, especially if you are a guest in someone’s home, and if anyone ever were to cross a line or boundary l was also taught to stand up for myself too.",
    "title": "Shut your CRT ass up!",
    "subreddit": "Teachers",
    "timestamp": 1685809259,
    "score": 6052,
    "keyword": "mexican judge"
  },
  {
    "text": "Afraid to File a HR Complaint I know this isn't typical \"work reform\", but I feel like it's something that deserves more attention here. \n\n&#x200B;\n\nWarning: Long tl;dr at bottom \n\n&#x200B;\n\nI am a white male, CISHET presenting human. (I'm fairly pansexual) I am currently working as a mountain bike trail builder for a small town, and it's a job I absolutely adore. This is true for my winter role as well. The problem is that in the summer, I loathe many my coworkers. It didn't take long to realize that I just didn't want to interact with them because of their topic of conversation, and the \"know-it-allness\" of one of them. \n\n&#x200B;\n\nSo it all came to a head the other day when I expressed my opinion of what the next work on the trails should be. And the Know-it-all guy rolled his eyes as if to say \"oh look at the dumbass speaking\". This when he hasn't been on our trails all summer due to injury, and every day we go to perform the work he keeps telling the bosses we should do, having a reason not to help. \n\n&#x200B;\n\nSo I called him on it by saying \"Could you not? Especially if you're not going to come help string trim?\" And he fucking blew up at me \"Why, I could string trim circles around you!\" Yeah, I don't really care, it's irrelevant. He continues to lash out and act a fool, even saying I'm the cause for all the problems on the team. \n\n&#x200B;\n\nStatistically, he's right. In a later team meeting I mentioned my being the outsider of the group, and that's okay with me. I always have been. (Two of them and a boss work together on a different winter job, and the other guy has worked with them for years.) I have various examples of this being true, and was told then by one of them \"that's not how it works here, you're not the outside person, you're not a victim.\" or something of this sort. \n\n&#x200B;\n\nI even mentioned to my boss that when I realized their conversation topics were not things I want to talk about, I just stepped out of them. He then proceeded to ask me if that was the best thing to do, placing the blame on me. Here's the conversation topics:\n\n&#x200B;\n\nThis girl they had nicknamed \"solar eclipse\" because she was under 18 and you can't look at her. Now that she's turned 18, she's referred to as \"Lunar\" and they gawk more openly. Kinda like when Emma Watson was turning 18 and people essentially had countdowns for it.\n\n&#x200B;\n\nThey spend much of their time talking shitty about, or making fun of people when they're not around said person. Even those they claim to be friends with.\n\n&#x200B;\n\nI have heard many times the valuation of women according to the size of their tits. Or rather, the only characteristics I hear about women from these men are bodily characterists. And of course one of them who is about to be a father is the typical \"I have to protect my daughter from men\" types, which is to say he feels he needs to protect her from people like himself and his friends.\n\n&#x200B;\n\nThey still call things they don't like \"gay\". They refer to some traits of humans, derogatorily, as \"woman\" or \"female\". \n\n&#x200B;\n\nAnd you can most certainly, according to them, judge the quality of a Mexican restaurant according to \"little abeualitas in the  kitchen.\"\n\n&#x200B;\n\nOh, and they also leave their work trucks idling when mowing large lawns for an hour or two at a time so they can get into a cold truck when they're done. Even when it's parked next to the climate controlled building our team office is in.  Or when they go into the store for minutes at a time, or gather implements for the day from storage, etc.\n\n&#x200B;\n\nFuck this drives me nuts.\n\n&#x200B;\n\nIt's a team of five. I only get along with one of them. And since the foreman is on a winter crew with two of them as EMTs at a different job, he's probably not going to support me in this, either. He's too close to the problem.\n\n&#x200B;\n\nThe boss/manager litterally just sat there while the dude raged at me, and him, about me being the problem with the team, because no one challenged them then. (I've only directly done so twice.) So he's not really capable of being quality help, and spent his time explaining to me that he hired people for their strengths, and thus doesn't focus on their weaknesses. Weaknesses such as laziness, being an argumentative know-it-all, etc. I was also told that if someone is causing problems and can't work as a team member, he has no reason to invite them back for the next season. Which I'm guessing is me, the guy who's waiting to be screened for Autism and ADHD. Cause it's true, I'm the burr under the saddle, and against sexism/racism/homophobia like this, I'm okay with being the odd person out until it makes my life miserable in a place it shouldn't. \n\n&#x200B;\n\nThere is no way there won't be retaliation if I take this to HR. I see no way it will get smoothed over, either. Because I just don't tolerate this sort of shit and don't want to be around it. So by removing myself from it, I'm accused of \"having a shitty attitude.\"\n\n&#x200B;\n\nAnd it's not like they wouldn't hide all this in front of women, or Mexicans, or gay people.  The bosses don't see it, and I do because I'm sort of out in the field with them. And it's not just them. I hear this bullshit in my locker room at the other job, particularly during our Pride week. One guy even talked about how stupid and illogical women are while I was, ironically, on the phone with my partner who is a professor. And if I file a complaint, it's basically the equivalent of dropping an armed hand grenade in the room while they're wearing body armor and I'm not. I really don't know what to do. Especially without putting my winter role at this job in jeopardy, when this crew isn't around and I get along with everyone because they aren't like this. \n\n&#x200B;\n\n&#x200B;\n\ntl;dr I work with a bunch of men who only talk about women according to physical characteristics, judge Mexican restaurants by \"the little abeualitas\" in the kitchen, and spend a lot of time talking shit about their \"friends\" behind their backs, and letting truck engines idle for hours a day. I removed myself from these interactions, and have had to defend myself a couple times, and am accused of having a shitty attitude and being the source of all friction from the team. But if I take it to HR, there is no way there won't be retaliation, and it might cost me ability to work a labor service I really love providing for the community. \n\n&#x200B;\n\nI just needed somewhere a bit to rant. Maybe to get some insight.",
    "title": "Afraid to File a HR Complaint",
    "subreddit": "WorkReform",
    "timestamp": 1690666358,
    "score": 8,
    "keyword": "mexican judge"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 71,
    "keyword": "mexican judge"
  }
]