[
  {
    "text": "Your list of companies that promote from within TL;DR\nAs the title states, which companies do you know that promote from within? It can be any company. The higher the potential pay, the better. \nPlease also mention if you need a degree or certification, but preferably post jobs that need no prior education. \nAlso paying apprenticeship is okay to post here as well. \n\nThanks \n\n\nBackstory: \n\nI’m asking this question because I’ve worked for Chipotle Mexican Grill for 6 years, gaining 5 promotions all the way up to restauranteur (district manager), which at the time I was making 55k a year plus bonus. I left working there because I wanted to be a good wife and mother, and the hours didn’t allow me to do that. Also that role was hella stressful :/\n\nLong story short, I’ve had 3 other jobs that fit the life style I wanted, but they didn’t pay so well. Now that my daughter is older, I’m looking for a higher paying job - with unconventional hours being okay. What I’m finding to be a struggle is that with my combined 9 years of working experience isn’t landing me anything higher than $15 bucks an hour. It also doesn’t help that I’m petite, look late teens, and trying to apply for manager positions. I’ve been searching for a new job for 6 months, and I’m starting to accept the fact that I might have to do this the hard way and work my way up again. \n\nThat’s why I’m asking the people of reddit to guide me to a job with high earning potential, even though you have to start at 0 and grind your way up.",
    "title": "Your list of companies that promote from within",
    "subreddit": "jobs",
    "timestamp": 1555074899,
    "score": 2,
    "keyword": "mexican manager"
  },
  {
    "text": "Is it normal for an assessment test to require a third party organization manage your webcam??? Test got terminated for no reason Im a new recent graduate in CS and I've been earnestly trying to find a job and I finally landed in a place where I can start doing the interview process. The first step is a assessment. I dont know what this employer does with this assessment because they said I will start training super soon. Its an entry level software dev position and they are doing training etc. BTW my recruiter STRAIGHT GARBAGE. I emailed him countless times to get more info never a single response like WTF? But i digress. First part that I've never done for an assessment is for the webcam to be accessed by a third party company. Welp f it i need this job. During the test it told me image violation meaning my face some how wasnt in frame. Im like \"Wtf my face is right here\" so i put a book under my laptop on my lap so its level with my face. While taking it my laptop began to slide off my leg and i accidentally touched the mouse pad of my laptop. My cursor was at the top of the browser and click......... I get a window violation and my test is terminated. This is not only frustrating asf but i have anxiety taking these sort of test. Also im a new grad where tf you learn about j2ee. Where do we learn to use enterprise software??? I've used different frameworks and code things from scratch. J2ee wasnt event apart of the job description. \n\nThe company I just applied as I recently learned today is a very discriminatory place. The place laid off all 30+ new hires that were african american. Dont believe?? find the review and i have friends who went to this place. They graduated in may did the whole training and did good got hired on and after a few weeks all african american employees fired for no reason. A lot of them know their ish so wtf?? In new york its the same type reviews. I may have strayed a bullet idk. \n\nTLDR: Why are some recruiters so bad? I cant get a single response at all from the one who recruited me. I messaged on linkedin and via my gmail. Did all of you have to do the same webcam thing? I dont like it one bit :/ . What is an effective course for j2ee since this assessment was based on that? Are all entry level software engineer test like this?\n\n\nFOR THOSE WHO DONT BELEIEVE HERE IS A REVIEW About this company. If your in my state you probably seen it if you researched the company.   ->\n\n \"This is the worst dicriminative place to work. Turns out their management team is the worst deceiving lying manipulative (Chonia Ballard, Karthic) unprofessional clueless individuals who know nothing about  insurance claims. They would train new hires to process 40 claims a day for commercial and government payors. What stood out to me the most was how they house their native Indians on one side and my black folks on the other side like a slave plantation. I witness Chonia mistreat and displace several of her own black people for this Indian guy (Karthic). Then turn around and laid off all 30 new hires who were all black African American aside from the Mexican and Caucasian woman who quit the second week of training.\"",
    "title": "Is it normal for an assessment test to require a third party organization manage your webcam??? Test got terminated for no reason",
    "subreddit": "cscareerquestions",
    "timestamp": 1568602437,
    "score": 0,
    "keyword": "mexican manager"
  },
  {
    "text": "Looking for work as a middle aged, straight, white male... It sucks. I have a professional career, make good money, and for the most part enjoy what I do. However, I haven't enjoyed doing it for the organization I am currently employed with. I've turned in just over 50 applications and resumes, only to be denied each and every time. What makes this harder for me to believe, is I am considered a preferential hire as a disabled veteran. \n\nI did an interview about 3 weeks ago at a place for the same position I currently am in. I was well qualified for the position, and did the best interview of my life. The manager of the department I was applying in even said I gave, word for word, the exact same answers as her on several of the interview questions only to be denied the job with a boiler plate email.\n\nAnyways, I go look at their website because the staff is listed. Sure enough, they hired a black female who had zero experience. I know, because the blurb under her picture says it is a new position for her and she is looking forward to learning about the job because she is coming out of Walmart. Wtf?\n\nNot only that, but the manager I hired with kept making remarks like, I see you parked in the employee spots and not guest parking, just getting your new spot warmed up? Even showed me my desk. \n\nThis individual, with zero college, military, no experience in the position, got the job over me, with college, military, and a lot of experience, got the job over me.\n\nJust wanted to vent. I live in probably the most progressive state in the US. Everyone is incredibly concerned with the appearance of being a diverse business here. As a white guy I am really feeling the sting of not being able to find a new job in the same field even after turning in over 50 applications. The diversity hiring and affirmative action here is being pushed so hard, that someone with no experience, in a professional career field, is being hired simply because of the color of their skin, and what is between their legs. The fucked up thing is, this is a very hard job with a lot of turnover. I guarantee that within 3 months that position comes back open because they won't last. Which, isn't going to help that individual who got the job either because their work history will be fucked up, making it harder to get the next one. I'm at the point of giving up. It feels hopeless. That was the absolute best interview I have ever had, only to get brushed off for a person out of fucking Walmart. About to just start lying and say I'm native American or Mexican because my skin is a bit darker. Bet I get any job I want then!",
    "title": "Looking for work as a middle aged, straight, white male... It sucks.",
    "subreddit": "MensRights",
    "timestamp": 1566408350,
    "score": 185,
    "keyword": "mexican manager"
  }
]