[
  {
    "text": "Guys I need some help, got suspended from my job for unfair reasons So I have been employed at a restaurant that is corporate for 7 years. Never had any write ups, never had any reprimands, nothing. Always on time, always the one to volunteer to work extra. I serve, bartend and hourly manage. Haven't called out a day in over 2 years and that was when I had the flu. When the gm wants to leave early, I am the one that picks up the slack so they can leave.\nAnyway, we have had alot of complaints lately through email about service in the restaurant, especially how rude the host stand is. The host stand is one of the areas I am in charge of so I have been feeling alot of heat from this. We have nothing but kids on the host stand (I am in my 40s), so I decided it was time to put my foot down and I had to get stern with them. I told them to put away their phones, stop eating at the front, stop going to the back and flirting with the cooks and to do their job. Stuff I have been trying to get them to do all along but they haven't been.\nSo I get called in the office yesterday and told I am suspended until further notice and under investigation because my name came up for saying discriminatory remarks towards certain races. I said that was ridiculous and asked what was supposedly said. The manager wouldn't tell me. Just said they will complete their investigation and let me know. \nI feel like these kids have all ganged up on me and made up things to get me out of there. I have been called \"mean\" by them alot lately. I know things are sensitive in corporate and they have to take allegations seriously but how can they get away with this? \nAn amusing thing about this is I am white, they are basically accusing me of being racist and my husband and children are mixed race. I just don't get it and need some serious opinions and advice please.",
    "title": "Guys I need some help, got suspended from my job for unfair reasons",
    "subreddit": "jobs",
    "timestamp": 1549822933,
    "score": 2,
    "keyword": "mixed race judge"
  },
  {
    "text": "If aliens created Reddit to judge the human race what would their report say?",
    "title": "If aliens created Reddit to judge the human race what would their report say?",
    "subreddit": "AskReddit",
    "timestamp": 1570808489,
    "score": 41,
    "keyword": "mixed race judge"
  },
  {
    "text": "NASA has just received a message from intelligent aliens; A powerful space fleet is within firing range of Earth. The aliens will allow us to send them ONE meme, and they will judge the human race on it and either spare us or destroy us. What meme do we send?",
    "title": "NASA has just received a message from intelligent aliens; A powerful space fleet is within firing range of Earth. The aliens will allow us to send them ONE meme, and they will judge the human race on it and either spare us or destroy us. What meme do we send?",
    "subreddit": "AskReddit",
    "timestamp": 1574113437,
    "score": 5,
    "keyword": "mixed race judge"
  },
  {
    "text": "I think this roommate might be grooming a young girl. I'll do my best to be clear with this information, but honestly my heart is pounding like crazy. I don't want anyone to get hurt and I'm trapped with indecision. So, I've made a throwaway account because I need some place to put all these feelings I have.\n\n&#x200B;\n\nObviously, specific information is hidden for the sake of privacy. The beginning is going to seem to go on for a while, but I want to get all of this information of my chest so that I get the best help to understand what's happening.\n\nSo there's me (28m), my gf (25), our friends Mary (26f) and James (31m), Barry (27m), and Sam (13f)\n\n&#x200B;\n\nI live in a decent neighborhood, economically speaking. It's mostly middle-class with free wifi at the shopping centers, farmer's markets on weekends, and middle school parades through the neighborhood for holidays or the local football team. My block is a mix of town houses and apartments, which is where I and many of my friends live. I have high functioning autism as well as ADHD, so I tend to be a little \"outside the lines\" when it comes making friends and hanging out, which means I know my fair share of who I like to call neurodivergent people. \n\n&#x200B;\n\nOne of my friends, let's call him Barry, I've known for almost 10 years. When I first met him, he had been walking around with a hat with fox ears and a matching tail hanging out of his back pocket. He shares an apartment with three other guys and we're similar in age. We bond over our love of video games and anime, although when it comes to anime all he wants to watch are harem themes, where one boy/young man (the hero) is surrounded by a supporting cast of girls/young women who all want his attention and it just isn't my thing.\n\n&#x200B;\n\nAt some point, Mary moves in as she's dating James, who lives there. Eventually her and James, my gf and I all become pretty good friends. As for me and Barry, over time our relationship has become very strained. When I told him that I couldn't come over to hang out one day, he tried to tell me that I hurt everyone around me by jerking their feelings around and don't respect other people's time. When I started to date my current partner, who is also Barry's and Mary's mutual friend, he held an intervention at his house to tell us that we're spending too much time together and it's destructive to our other relationships.\n\n&#x200B;\n\nOne day, Barry and I were talking about consent and sex positivity. I reveal that one of our friends (who doesn't live in the house) had loudly slapped my gf's butt out in public and that isn't remotely cool at all. Barry's attitude was \"You don't get it. He's just like that. He's always been like that. Why is that a big deal?\" We argue for hours about respect and how women fight an uphill battle for basic shit. He continues to take the stance that I'm misinterpreting the event. He infers that women act like gold-diggers because that's just biology (what). . . and then he says \"If it's the end of the world and she doesn't want it, it doesn't matter. ***The preservation of the human race is way more important, wouldn't you agree?***\" I leave and blow off everything with him, now realizing that he is an actually full-blown nightmare person.\n\n&#x200B;\n\nThat was early last year. Now, the only time I see him at all is when I come over to hang out with Mary or James, since they all share rent together. But lately, Mary has been telling me that Barry has been going to a small, out of the garage dojo ran by an old instructor on the other side of the block (roughly twenty-five minutes away by foot). There's maybe anywhere from 8-12 student there during a lesson and I knew Barry had been attending for all these years. These days, he's essentially the instructor's protige, sometimes leading classes, and will pay special attention to the one and only young girl there who's about to start high school, Sam. Apparently, Barry and Sam text every day, asking what she's doing, how her day was, how her family is doing, how's school. And he's been doing this for years.\n\n&#x200B;\n\nHe's positioned himself as a pillar of support for this young girl over the last 5-7 years, since her parents started taking her to the dojo. He's openly told me that he's depressed and that he \"doesn't want to be a wizard,\" meaning a 30-year old virgin. He's said that \"age is just a number and girls mature faster than boys\" and that he's \"good at playing nice for parents.\" His notification tone for her texts is a loud cat's meow. \n\n&#x200B;\n\nI worry that he may be manipulating her, filing her head with nonsense about the way boys and girls are because of \"biology\" or grooming her to act \"properly\" for his tastes in anime lolis. He's quick to anger, works out, and is a walking Dunning–Kruger effect, interupting people often just to be loudly wrong.\n\n&#x200B;\n\nSo, there you have it. I don't know what to do. I've thought about going to the dojo and speaking to the instructor directly about this. Chances are that he has Sam's and the family's numbers, but I wanted to see if there's other options available OR if I'm way out of bounds here, acting paranoid, and trying to pry into a teenager's private life for my own sense of warped sense of safety or morality. I honestly feel crazy about this and need more feedback.",
    "title": "I think this roommate might be grooming a young girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1546563688,
    "score": 22,
    "keyword": "mixed race judge"
  },
  {
    "text": "My first dating experience was a wreck. Throwaway because the person described knows my Reddit username.\n\nIn my third year of college, I met a guy online through a game and became friends with him. He lived many states away from me in the US and I knew he was older than me. We chatted daily and played together.\n\nThis fast friendship continued into my senior year. We had been playing a different game together and voice chatting more often. I think I was actually charmed by his voice. It was deep and rich, and he had a great laugh. I didn't expect him to be incredibly good looking, but he was kind and funny, and his breadth of experience as an older guy (I didn't know then how much older) was very appealing. He was easy to talk to, and I confided in him. I had been seriously struggling with undiagnosed clinical depression and anxiety. I think he thought of me as a side hobby of sorts. Just a problematic girl he met online who he wanted to help. \n\nI confessed to him, and was rejected. He seemed more incredulous that I would want a relationship with him.\n\nI was always open to him about my life. He knew how old I was, what I sounded like, even what school I went to. On the contrary, I knew very little about his appearance or height, or even his race. After I showed him my picture, he was surprised because apparently he expected me to look like Sadako from The Ring. The compliments felt good to receive, even though it hurt that he thought I was so scary/unattractive. I'm a 175 cm (5'9\") Asian girl, and at that time, I was 115 lbs. The next day, his tune changed, and he seemed to be considering the relationship. And then later that week, he said that I should be happy, because he had reconsidered my feelings for him and was willing to give the relationship a go.\n\nMy feelings at this point were already mixed. That day, when I confessed to him, I had asked to see his picture after I showed him mine. But he was evasive and ended up showing me a picture of him from many years back, when he was in college. When I asked for a more recent picture, he showed me one that was incredibly blurry and I couldn't make out any of his features. Then he reluctantly told me that he was 39 years old. I had known he was older, but never in my wildest dreams had I expected him to be so much older than me. There was a 17 year age gap between us. Relationships with such age gaps often do work out, but I was still super concerned and immediately knew that my strict Asian parents would NEVER approve of him. \n\nAll of this was obviously raising flags and I was now regretting confessing to him, but when he said that he liked me back and wanted to progress with the relationship, I hesitated to go back on my word. I had never dated before and was a complete virgin, and honestly, I craved a relationship. I wanted to feel desirable, to feel loved and attractive. We started dating. For us, that meant phone calls lasting 4-6 hours and many texts in between. He encouraged me to seek therapy for the panic attacks and suicidal thoughts I kept having (senior year became very stressful, with all the looming thoughts of the uncertain future ahead). For that, I will always be thankful to him. No one else in my life had ever told me to go into therapy. My parents told me I would get over it and that this was a phase that everyone went through. He was the first person to tell me that it wasn't normal to think about how I would end my own life on a daily, if not hourly, basis.\n\nAnd then, after a few weeks of daily conversation, he showed me his body and face.\n\nTo be honest, I was completely repulsed. I feel bad saying that about anyone but I would have never wanted an intimate relationship with him if I had seen his appearance beforehand. Everything about him was simply not my type. He was very overweight (although he was working hard to lose it) and much shorter than me. 17 years older than me and balding. I started realizing this would never work. I had fallen in love with his personality, but I could not feel even an ounce of attraction to his body.\n\nThis is important, of course, because he also taught me about phone sex and sexting. I became very good at moaning, because I knew it turned him on. However, I could never bring myself to actually imagine his body on top of mine. It scared me a little. But for him, it was all too easy. He would tell me about erotic fantasies he had about me. He seemed to always be thinking about sex, and masturbated to porn frequently. I was happy to think that he found me so attractive, but at the same time, I was pretty scared.\n\nI told him once that I was hesitating, that I liked him, but was not attracted to him. BUT I was willing to still give it a try, that maybe I would get over it. He must have sensed these feelings growing in me after he showed me his picture, because he totally assumed that I was dumping him and had apparently planned to lash out at me. His vengefulness and anger was frightening. I don't remember everything he said then, but one thing stuck: He thought I at least owed him sex.\n\nI think I was too much in shock and too overwhelmed by my mixed feelings to realize how concerning those words were. He was never a bad person. I think now that he was seriously lonely and thought of me like a rice cake dropped into his lap from the sky. At almost 40, his dating opportunities were becoming rather slim. He told me that I was his \"last chance\" to find love and marry, have kids, and live the rest of our lives together.\n\nAnd so... my chance to end the relationship decisively slipped away from me, and we continued dating. He made plans for the future, and I continued worrying and doubting. He booked a flight and planned to come see me, and I continued to dread actually meeting him. I know I should have told him clearly that it would not work between us, but I didn't. I felt bad that he had helped me so much, and that we had spent so many hours talking. I didn't want to have been a waste of his time and care. And most of all, I could not bring myself to destroy his \"last chance.\"\n\nWhen my anxiety about the relationship came to a head, I told him I needed a break. To this day, I regret having not laid things out clearly. But I felt bad about everything, and just wanted to escape from the mess. I knew I was essentially stringing him along this whole time and lying to him, but I honestly never meant to hurt him. I was 22 years old, completely naive, and had no idea how to express my own wishes, how to listen to my body's signals, and how to heed the red flags I had seen along the way.\n\nI offered to recoup the cost of the flight. He rejected that offer at first, but the next day he sent me a very formal text saying he had reconsidered and wanted me to pay $250. At that time, that was a lot of money for me, but I agreed and sent him the check immediately.\n\nI believe I was an asshole in this relationship. I could have avoided all this pain for both of us by listening to my true thoughts and realizing that no amount of worrying is going to suddenly make me feel attracted to a body that isn't my type. He knew, from the very beginning, that I was vulnerable and incredibly naive. I had a lot of fault in this, but he also manipulated my feelings and withheld his appearance and personal details (namely his age) from me until it was too late for me to easily back out. He KNEW that I would find him unattractive, and so he kept me in the dark for a long time.\n\nI wrote all of this to finally process my lingering feelings. It's been 2 years since then and I'm in a loving, non-long-distance relationship with someone else. I'm even getting married soon, but I still have pained thoughts about my first boyfriend sometimes and I realized that I never really got over it. I'm scared to invite criticism, but I know I need to hear it.\n\n(Edited typo about my height!)",
    "title": "My first dating experience was a wreck.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1561470315,
    "score": 16,
    "keyword": "mixed race judge"
  },
  {
    "text": "Assault at Church **I’m writing this encounter nearly thirteen years after it happened. It’s sleepless nights like now when I’m compelled to reopen old memories. So, if you don’t mind reading about a naive preteen, asinine (and racist) adults and one sick pervert all mushed into one story, here goes:\n\n-\n\nIt all started in the summer of 2006 at a local teen bible study group (where really it was a place for teens to hang out and volunteer at). The location was held in an Asian Empowerment-Christian church so everyone was 99.9% Asian so my being not full Asian (I’m Japanese and Mexican), I nonetheless stood out like a sore thumb. And other church members often made jabs at my tan skin and high bridged nose, and adding things like “Sorry we don’t serve tacos! Just fried rice!” to even doubting my Japanese last name (“Did you take this name from an anime?”). I sound like I’m digressing but this information will be relevant in a bit. \n\nIn retrospect, I don’t know why I didn’t catch these red flags. I should’ve just left and enjoyed my summer at home. I sat alone most of the time anyway. No one noticed my discomfort save for one person. \n\nLogan.\n\nLogan was this tall Asian twenty-something year old man. He was related to one of the Bible study leaders but only showed up a few times a month. Logan was slim and tall, wore Hollister apparel and slick, black hair that parted at the middle. I remember his humor and laidback style made me feel comfortable around him. Logan even went as far as to ruffle my hair and sit next to me during bible study. He even went as far as commenting on my looks, saying he liked my eyes a lot. That I looked mature for a thirteen year old. Quite the charmer, I thought.\n\nOne day, we were supposed to meet up at a baseball game and Logan offered me and a few others a ride for carpool. As luck would have it, when I arrived at the church (our meet up location), he was the only car there. I asked him where the others were to which he replied that they they all left early since they didn’t want to wait up on us. I found it strange since it wasn’t even that late to begin with. Ignoring my gut, I silently went inside the car anyway.\n\n This is when it starts getting scary. \n\nAs I was opening the backdoor, he was motioning for me to sit in front. I usually didn’t feel comfortable sitting in front with non-family members at the time. I insisted that I was okay - I even joked that he was my chauffeur. But Logan’s face didn’t show that he took my awkward humor well. He turned around with a serious expression. Not saying a word. I stared back, wondering what was wrong. Before I was able to ask, Logan reached over for my hand and began smothering kisses on it. Stunned and confused, I immediately yanked my hand back. I was speechless, not even asking why he was doing what he was doing. His eyes were still glaring and his usual kind voice was now more hitched and deep. “It’s fine. You know me. You like me,” he whispered as he unclipped his seatbelt. He began lifting his body towards the backseat. In that split second, I knew I was in danger. I saw that the backdoor wasn’t locked and I opened the car to make a run for it. I don’t know what came over me that day but I remember losing control of my body at that moment. All senses were hazy. \n\nI later found myself in the pizza parlor that was down the street. I sat there in one of the booths. I just had to be around other people. Other strangers where I could feel immersed once again. Hidden away from Logan’s eyes. After what felt like an hour, I called my friend (who lived nearby) if she and her mom could pick me up. \n\nIt was the last time I ever stepped into those church grounds. I didn’t tell anyone immediately and I had planned it that way until I received a call from the church leader - Logan’s sister. She asked if I was alright and where I had been. It was then that I broke down and spilled the story about what happened to me. She didn’t say anything. Only silence hung around the atmosphere. I doubted at that moment if I made the right decision. \n\nLogan’s sister finally broke the silence and I wished she hadn’t.\n\n“You’re at that age when...we don’t know what we seek. We look for something to compensate what we’re missing...which is usually the case for Hispanic girls like you. It’s no wonder you guys get pregnant so early, you know? Break away from that, ok?”\n\nI didn’t even believe what I was hearing. She was insulting me in every way possible under the guise of a benevolent church leader. Someone who was meant to help - not judge you nor your race. I felt like throwing up. Is this really what my experience is worth to others?\n\nMy thirteen year old self didn’t say anything and just hung up. I hated myself for even trusting her - of all people. His sister. I had all these thoughts swirling over me. What did I do to deserve this unfair situation? I didn’t bother anyone. I was not trying to tempt anyone. Why did it matter whether I was Mexican too? Where is Logan now? Would he come back and show up to finish what he started?\n\nSuch thoughts accompanied me all throughout my teen years. I couldn’t help it. The damage was done. I was stupid and naive. \n\nFast forward to now, I am doing much better thankfully. I’m not fully absolved from my past unwanted memories but things have indeed improved. I have loving friends and a sweet significant other. My parents are still my greatest pride. \n\nI just hope that on nights like now that my idle mind doesn’t betray me anymore. I don’t ever want to meet or let alone think of Logan or his sister again.",
    "title": "Assault at Church",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554966681,
    "score": 16,
    "keyword": "mixed race judge"
  },
  {
    "text": "Grooming by moms best friend As a young girl, between the ages 11-17, my mom had a very good friend that I'll call D. D had always been a seemingly nice and overly generous guy. As my mom's relationship with my dad deteriorated, her relationship with D got more and more close. So things start getting weird when D is trying to find a new place to live and ends up moving in not even a minutes walk away from our home. At the time though, since I was young and naive I didn't think much of it. D would have my mom over a lot and she would take us with her cuz we always had fun there. It was a surprisingly nice change from the atmosphere at home. He also had kids of his own so I would hangout with them too along with my other siblings. \nEventually he would start giving me money all the time for no reason. As a child I loved this, and we were so close so I completely trusted him. He had even met most of my close friends too at this point. \nAs me and my siblings grew older we got into smoking pot. We soon learned that D was also into such things. We eventually would go over every other day just to get some weed and have a nice blaze space. We would bring our friends even, and if it wasn't obvious my mom was not joining us for these specific visits. She knew we were smoking but she didn't know the extent of the visits.\nOver time we started getting creepier and creepier vibes from him and I was starting to think that he was \"friends\" with my mom to get to us and our friends. He never made particularly inappropriate comments to me, but to at least 3 of my friends he made very creepy jokes or was just straight up being a creep. At this point in time though, we were very heavy smokers, and would continue going there just for a hoot. \nThis eventually lead to D doing harder drugs with some of my friends and my sister. We were probably 15-16 at this point. So D was giving shrooms to my 15 year old friend. Now before you judge my mom she was being lied to throughout all of this. She really trusted him and he abused the fuck out of her trust. D was one of those people that loves to claim how honest they are and how they can never lie. So she continued to rely on him for his support during my mom and dad's split. It's not like we told her either, we were just a couple delinquents looking for some free drugs or money. \nDespite how weird shit got, for a long time I denied the creepiness of it or I was too young to fully understand. But these days I look back and feel so dirty, used and groomed by such an older man. I feel like I deserved it because I got something out of it (weed). Shit maybe I did, I just hate that he had almost everyone I cared about mixed up in his sick little fantasy where all these teenage girls come over and ask him for shit. Im sure that's why he was always so generous, but when you came to ask him for something he became reluctant. Almost as if he wanted us to beg him for it. \nThis shit was long but I really wanted to get this off my chest.",
    "title": "Grooming by moms best friend",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1577174669,
    "score": 13,
    "keyword": "mixed race judge"
  },
  {
    "text": "First precedent setting opioid case against a drug manufacturer is now on trial. https://www.cnn.com/2019/05/28/health/oklahoma-opioid-trial-start/index.html\n\nhttps://www.cnbc.com/amp/2019/05/28/oklahoma-and-johnson-johnson-face-off-in-the-first-opioid-crisis-trial.html\n\n(I'm going to mix and match quotes from these two articles without specification for ease of reading.)\n\nFor many reasons I believe that the State of Oklahoma will lose this case.  The major reason is because the State's theory of liability is primarily based on the defendants' marketing.  \n\n>...the State needs to prove that Janssen's marketing statements were misleading, that doctors acted on that and that patients took the drug as prescribed and became addicted or died.\n\nHad the defendants been marketing to unsophisticated consumers this would be a better theory.  Except they were not.  They were marketing to doctors.\n\n>Oklahoma Attorney General Mike Hunter in opening statements Tuesday accused drugmakers of a \"cynical, deceitful, multimillion-dollar brainwashing campaign to establish opioid analgesics as the magic drug.\"\n\nBrainwashing doctors?  Really?  That's going to be a hard sell to the judge who is determining this case.  (No jury.)  An even harder sell with this evidence:\n\n\n>Ottaway (defense attorney) said that in 2009, when Janssen said opioids were rarely addictive, the Food and Drug Administration also said the drugs \"rarely caused addiction.\"\n\nDid defendants also brainwash the FDA?\n\n\n\nThe next problem is causation.\n\n>J&J denies wrongdoing, arguing that its marketing efforts were proper and that the state cannot prove it caused the opioid epidemic given the role doctors, patients, pharmacists and drug dealers played.\n\n>He cited the CDC report (the chart is based on) as concluding that \"States as regulators have the responsibility and authority to monitor and correct illegal prescribers.\"\n\nIf 7-Eleven illegally sells cigarettes to minors is Marlboro responsible?  The State has an interesting theory on causation.\n\n\n>\"If you oversupply,\" he repeated over and over, \"people die.\"\n\nShould Marlboro limit their production of cigarettes to prevent minors from obtaining them?  By what percentage?  Who decides this?  \n\n\nNext we have a problem with damages.\n\n>He noted the opioid deaths reflected in the state's chart did not differentiate between those taken as prescribed.\n\n>Ottoway concluded his opening Tuesday afternoon, noting that the total documented cases of addictions or death attributed to one of the Janssen medications in the case amounted to \"zero.\"\n\nThat last quote really surprised me.  It should be rather obvious that you can't just slap up a chart of all opioid related deaths, illnesses and other related costs and then blindly claim the defendants are responsible for all of them.  The State should at least have attempted to parse out market share and percentage of  illegally imported or manufactured drugs.  \n\nIt is not an accident that this is the first opioid case to come to trial.  Defense attorneys carefully select which cases to settle and which to try.  This is a precedent setting case expected to heavily influence a much larger class action scheduled for trial in October.  If anyone is interested in the dispute on whether or not this is properly a nuisance law violation, the legal theory is weak but enough to get to trial.",
    "title": "First precedent setting opioid case against a drug manufacturer is now on trial.",
    "subreddit": "medicine",
    "timestamp": 1559489780,
    "score": 12,
    "keyword": "mixed race judge"
  },
  {
    "text": "Nurses who talk negatively on patients... when it’s not the patient who’s in the wrong. (Technically... sorta). Just a frustration from today. Rant....\nAlright I know most of the time nurses can get really annoyed at patients for silly things or at times very important things.  This time, the irritation was toward another nurse.  Today I got borderline defensive for my patient because nurses kept rolling their eyes toward things he said as if he was supposed to magically understand things.  The words, “Okay first off all. He doesn’t have the same education we do, so yeah he’s not going to get it right away” came out of my mouth today. In a more irritated than pleasant tone.\n\nI was going to avoid doing a backstory and throw out a random rant but I’ll just take a break to write this out. My patient’s heart rate is in the 200s when he gets up and walking. I was told by day shift and an RN who had him last night that he can be argumentative and says he doesn’t believe “us” because he doesn’t feel anything. Okay, points there. Sometimes people have heart attacks and strokes and wouldn’t or don’t know it has happened to them.  Then they tell me he argues when they take his vitals because, “See it’s 114 there, and you’re telling me it’s 200.”  FIRST OF ALL. Did NO ONE explain to him WHY it’s normal when the vitals are taken?\n\nPerhaps because he is sitting down and the machine only picks one number in one second to use? We as nurses know this, but why does my patient not know this?  Because he was never explained that, everyone just expected him to understand the concept of everything being done.  I brought him up to the nurse’s station and pointed at his heart rate. High as heck. I told him hey sit down and I bet you anything it’ll go down.  We watched it and I joked, “Oh it’s not gonna move cuz you’re staring at it.”  So he looked away, and lo and behold 30 seconds later after a min of sitting his heart rate is down.  And I tell him to look.  I say, now this is what happened when they take your vitals.  When you stand it’s going to shoot straight back up.  I felt his radial and I put my hand over his heart. I could feel it racing and I told him to do the same.  He actually looked surprised to be able to feel it like that.  (To me it seemed like he got so used to the feeling on the “inside” that his heart racing didn’t phase him anymore).  Or maybe he really didn’t feel it from within.  I said it feels like your heart is trembling.  He said my hands are shaking but they always do that (!!!) Poor guy just always thought everything he felt with this heart rate was his “normal.” 🤯 \n\nHe leaves and eventually comes back half an hour later.  At this point I didn’t know he was up there with us.  I hear the monitors ding so I go print out a strip of 226. And I turn around to find him standing at the corner nurse station and he says, “Oh man that’s high.  But I don’t feel anything, I don’t get it.”  Yes it is. And that why we’re doing a heart cath.  Totally different interaction with him than with the other nurses.  When he leaves, the nurse who had him last night says to me, “Can you believe him?  What does he think, we’re messing with him?”  And I try to keep calm and say, “I get him.”  That he doesn’t have the same education and background we do, so WE get it. Quickly and easily when we see that stuff.  He won’t.  That’s why I had him come to station face to face with his heart rate to understand.  Moral, please don’t get irritated with your patients if they get argumentative.  Or when shifts say negative things about them.  It’s not always them starting stuff or being “needy” with meds.  Sometimes it’s just the simplicity that they don’t see what we see.  They don’t understand what we understand.  And why should they? Did they go to nursing school? No. They didn’t. So explain it to them, instead of judging them. Please.\n\nUpdate: Went back in a few min ago to give some insulin.  He ended up telling me he just had a mini cryfest/breakdown.  After getting closer to understanding what’s happening and could happen heart wise, it scared him... saying he’s not ready for something to go wrong in the heart cath. 😰 \n\nTLDR; I hate when nurses treat patients like they’re doing something wrong by being argumentative or going against what we say.  THEY DONT UNDERSTAND THINGS THE WAY WE DO. Until someone explains it to them.",
    "title": "Nurses who talk negatively on patients... when it’s not the patient who’s in the wrong. (Technically... sorta). Just a frustration from today.",
    "subreddit": "nursing",
    "timestamp": 1567558882,
    "score": 39,
    "keyword": "mixed race judge"
  },
  {
    "text": "Out of school for 2 years...bit of a rant Hey everyone ! First reddit post ever but I've lurked on reddit for years. I hope this is the right place to post. If not, please redirect me.\n\nAlright long story short , I finished nursing school two years ago. I didn't immedietly sign up for my certification exam for a number of reasons , mostly depression mixed in with the fact that my clinical placements were awful in terms of giving me more confidence in my physical nursing skills (I could study theory all day). Basically it terrified me that I could be responsible for patients if I passed the test with my theory knowledge , but I never got to practice injections (besides the occasional insulin injection in my FINAL consolidation), starting IVS , inserting catheters etc. It basically terrified me that I'd get a job , get orders for things i'd never really practiced , and have to 'wing' it. I also at the time had a job (still have) as a PSW in a 24 hour living facility where we are allowed to give out medications (pills and insulin) and do basic nursing care things like basic trach and gtube care. So I got to feel like I was helping out individuals and I got comfortable. The reason I was drawn to nursing was because a) straight up love learning biology b) the idea of those therapeutic-nurse client relationships , of helping someone through their tough times. Unfortunately all of my placements had me with preceptors who were gruff , seemed to hate their jobs and patients , and over all really shocked me to my core. They did not seem to have time for students , I was always afraid to ask questions because they were the stereotypical 'eat your young' nurses who loved an excuse to make you feel incompetent.I admit I had a crisis , I was afraid in 10 years I'd be bitter too and didn't know how I would make a career out of it. To be fair , my consolidation preceptor was pretty good , but it was at a nursing home where I did not get the chance to practice many skills .\n\nAnyway , sorry for rambling.  My question is : my husband has encouraged/forced me to sign up for the certification exam . Writing it in 6 days. I highly doubt I'll pass. But on the off chance I do , is there like a nurse retraining course or something I can take before applying for a job ?? Or are there facilities out there , that when they hire a nurse , they actually train you? I am terrified.\n\nSide note/PSA : if your hearts desire is to be a stay at home parent , be honest about it. Ever since I was a young girl , I always wanted to be a staybat home Mum, but girls were always encouraged to want 'more' growing uo and I felt ashamed to tell people that is what I wanted. So I chose a career I THOUGHT would allow me to nuture people, but I am really not happy. But I can't tell people that now. My gusband , his family , my family , will think I am just saying it now because I don't want to work outside of the home. I should have been honest with myself and others since I was a teenager , then maybe I wouldn't be in this mess. But since women these days are supposed to want to work outside the home , I was afraid no man would want me as his wife, and that people would judge me as lazy or unambitious. So here I am. My mental health is really going through the ringer. I fantasize about offing myself daily so I don't have to deal with having a career for the next 38 years I don't think I want. (No kids yet ). Don't worry , I won't.\n\nIm in Ontario Canada.",
    "title": "Out of school for 2 years...bit of a rant",
    "subreddit": "nursing",
    "timestamp": 1574430121,
    "score": 2,
    "keyword": "mixed race judge"
  },
  {
    "text": "Kid quote of the day... (H.S.) “I’m not afraid of my mom, she’s white.”\n~a mixed race sophomore boy with lots of teenage attitude \n\nContext: one of the table groups was discussing how their parents react when teachers call home.",
    "title": "Kid quote of the day... (H.S.)",
    "subreddit": "Teachers",
    "timestamp": 1550194970,
    "score": 17,
    "keyword": "mixed race judge"
  },
  {
    "text": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans? **TL;DR/ Daily objective:** I am posting here seeking resources about research or programs about how U.S. public schools can respond to and change a culture of fighting and truancy. The \"goal,\" is not to expel all the students who've ever caused trouble--the goal is to create a school culture where students don't want to cause serious trouble, and former \"troublemakers,\" can receive and flourish form a quality education. I am hoping that we can compile some crowd-sourced resources including: links to online articles and research studies, names or links to programs with high success rates that our school could look into buying or implementing, book suggestions that contain this kind of information, or other concrete data-based evidence or action plans. Anecdotes would be appreciated, but anecdotes are not evidence and our school can implement a school-wide, multi-year improvement plan based on an anecdote. I will post basic details, then more detailed details underneath this TL;DR/objective comment; if you read this intro and have ideas, go ahead and post them without reading it all, but if you have the time or interest, I will give many details. \n**If you read the title of this post, my TL;DR/ objective right here, or my following detailed information and think to yourself, \"This is stupid, why is this person asking for help on reddit/ trying to fix a whole school/ believing that school culture improvement can happen/ working too hard/ not seeing the red pill ~truth~ and just blaming all the Black students,\" and you would like to make a disparaging or simplistic comment, please reconsider doing so and maybe go do something fun like eat some cheese crackers instead.** \n\n\n**Basic details:**\n\n\n-School location: Flyover state, USA \n\n\n-School demographics: 40% white, 20% Hispanic or Latino, 25% Black, 10% choose not to say/identify only as mixed race; 5% Asian/ Pacific Islander, Native American, and other. \n\n\n-80% of students on free and reduced lunch \n\n\n-Advanced Placement Participation Rate: 15%\n\n\n-Standardized test scores: below state averages \n\n\n-Important/ successful departments and programs: art, theatre, speech and debate, fine arts, music, ballet and dance, pre-career EMT, pre-career dental, pre-career welding, pre-career autoshop, pre-career automotive, pre-career fire science\n\n\n-Location part II: in a weird area that covers of dense-population urban areas, suburban areas, and about 20% farm kids \n\n\n-Gang activity in the area: Exists, present in some schools but mostly limited in ours, little to no direct gang affiliations, tags, or threats, but about 5-10% of students have direct gang ties or affiliations; lots of students joke about who is what or call other students members of gangs to call them stupid (\"Yeah well you go ahead and be your dumbass self, gangster disciple motherfucker,\" \"Miss, you know I'm Mexican, you can't fail me or I'll sic the Kings on you.\")\n\n\nProblems: Fighting, retaliatory fighting, people wanting to know about and watch fights, understaffed/ ineffective/ elderly/ moderately racist/ lazy security staff, truancy and loitering within the school/ hallway-wandering, phones, sexist comments and catcalls toward girls from boys, horseplay/joking around that turns serious, boys \"just joking,\" around with touching girls when they've said stop repeatedly and genuinely don't want to be touched, \"playing around,\" by taking another student's phone, parts of the school mysteriously smelling like mint/mango/ creme/ cucumber/ fruit/ Virginia tobacco, mysterious rectangular flash drives plugged in all over the place, students who think they can responsibly and reasonably handle their weed but show up smelling like skunks and unable to answer higher-level questions or complete complex tasks, disrespect to teachers, disrespect from a select few teachers who hate teenagers.\n\n\n-Most students are good or fine, typical high school students who are also fed up with people who walk the hallways, who fight, and who disrupt classes. But also everyone loves watching fight videos. \n\n\n-Students of all races participate in fights, hallway-wandering, and class disruptions/ disrespect toward teachers. However, Black and Hispanic students doing these activities are seen as bigger troublemakers while white students are more likely to get a warning and no true referral. Also, Black students are more likely to be stopped in the hallway by teachers and security guards and asked for a pass, even students who do not habitually wander hallways but are just genuinely trying to go pee, or really did forget their notebook in their 5th hour classroom.\n\n\n**Heckin' details**\n\n\nWe have a current epidemic of fights. One fight happens, then other students get mad because of who attacked whom, yeah, but also because of who tried to hold someone back, who DIDN'T try to hold someone back, who filmed, why they filmed it (it was funny? it was tea? they were supporting their friends? an attempt to create and preserve evidence of what truly happened? evidence of teacher or police mistreatment? who knows), who previously had beef with the person who was fighting and it got re-ignited, who got suspended or who didn't get suspended, etc, etc... So there's groups of students who are on edge, then there's a fight, then other people hear and try to run toward it, problems emerge while breaking up the fight, students get suspended, they miss classes, they get in bad trouble at home OR don't get in any trouble bc of uninvolved or otherwise \"let's get them back,\" parents, they smoke a lot, they return to classes, they're behind on work and annoyed by how students are looking at them (because everyone knows who was in the fight), students get on edge, then there's a fight, then other people hear it and try to run toward it, then...the cycle continues. \n\n\nWe also have a problem of students loitering/ skipping but staying in the building. There is a core group of students who come to near every class late, leave their materials in lockers, get out of class by finagling a pass from an exhausted teacher or a sub or just plain walking out, they walk to their locker and friends' lockers and stop to pee in the juul rooms, they walk by their friends' classes that hour and wave to them from the windows, OR my favorite, a random wandering student walks into another teacher's classroom and insists on talking to their friend (??? I've had students walk in my door if it's propped open, push past me if I open it assuming the student is a pass-runner, or POUND on my doors making me think there's a life-threatening emergency), the students walk slowly and on their phones, or people scream at each other, fights break out... hopefully at some point, hallway-wanderers will be intercepted by a teacher or security guard. Then they're either simply snapped at \"Get to class!\" and the student looks serious, says they're going, and walks away to wander another day, or they're taken down to our dean's office where they get in trouble. \n\n\nAnd that's another problem; what do we do with students who continue these negative behavior patterns? \n\n\nIt's obvious that students fighting and skipping have no place in the classroom setting and need to be suspended, as punishment for their actions AND to keep them from distracting or even harming other students; obviously we need to suspend or expel troublemakers.\n\n\nIt's also obvious that students are skipping or getting in small fights so that they can get suspended and stay home from school, plus the fact that having troublemaking students OUT of school-- where they have order, rules, meals, staff who care, and access to quality public education, which is a right in our country and a way to lift people out of poverty--is undesirable and possible unethical; it's obvious we have to keep students in school and we can't just give students what they want and suspend or expel them. \n\n\nWe have many teachers and administrators who are prepared to try their best to take our school from okay to great, to make our strengths shine and **fix** our problems, rather than covering them up or kicking them further along the road. Not all teachers and admins are spectacular. But there's enough of us to make changes, as long as we know what changes to make, we work in sync, we reflect on progress, we use our resources, and we have a some but not an unreasonable amount of Jimmy John's work-til-8:00PM sessions. There are also students who are WONDERFUl, talented, hardworking, resourceful, curious, growth-oriented, compassionate, and more. We've had successful community outreach programs (food drives, volunteer programs, community elder outreach), and many students are incredibly frustrated about fights, hallways, and disrespect to teachers, and know that those are some stupid ways to go through life and handle problems. \n\n\nPlease, let me know what you know that can help. I cannot thank you enough for giving me any info to look into and report to my team.",
    "title": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans?",
    "subreddit": "Teachers",
    "timestamp": 1549597210,
    "score": 9,
    "keyword": "mixed race judge"
  },
  {
    "text": "To the two people who shaped me to be who I am today - thank you Middle school is a scary, awkward, and all-around bad time for everyone to go through. The other students judge you, the new class structures confuse you, and you don’t know if you’re still a kid anymore, or if you’re in the weird gray area known as “tweens.” With everything swirling around you, stressing you out and making you want to curl up in a bathroom stall and cry during the class changes, the teachers can make or break those three years, and even beyond.\n\nI was an odd kid; there’s no way around it. Blunt-cut bangs mixed with old My Chemical Romance t-shirts and photos of Star Trek characters taped to the inside of my locker did not make for a kid who was going to be popular. I had friends, don’t get me wrong, but I still felt like an outsider; someone that did not, and would never, fit in. Walking around with the idea that no one really cares fucked me up for a good while.\n\nThen, you two came along. Back-to-back, one in sixth grade and one in seventh grade, you both managed to make me feel like someone actually cared, that my interests meant something and would get me somewhere in life.\n\nIn sixth grade, I walked into the first day of school and hated it up until the last class of the day. The bell for sixth period rang, and when I walked into your class, there was something in the air that made every bad thing that happened that day fade away.\n\nYou were at the front of the class, an older man who reminded me of my dad. After introducing yourself to us as Mr. Damanda, you had a kid go to your desk and pull out a copy of the Hobbit. You then proceeded to recite the first page aloud to us, with the kid holding the book checking every word that came out of your mouth. You said every word correctly, of course, and it made my Tolkien-loving self realize that maybe, just maybe, this year wouldn’t be the worst thing ever.\n\nEvery single fucking day I looked forward to your class. The anecdotes you’d tell us about your childhood, friends, or the various animals you’d interacted with over the years always made me laugh, even when I was in mental states that I didn’t know how to get out of. With every reading log, you never accused me of lying when I’d write down the number of pages I’d read. You’d seen me in class and knew that I was absurdly fast when it came to reading, tearing through a hundred pages in less than an hour. You saw the photos my friends taped to my locker on my twelfth birthday; instead of telling me to take them down, you mentioned how you also liked Fall Out Boy, and that the photo of Spock with “Party Like a Vulcan!” written on it made you laugh.\n\nThe end-of-week homeworks weren’t my favorite thing to do at first, but after a while, I grew to love them. You always added insightful comments to my assessments and opinions of whatever novel I’d been reading; showing me how to improve my ideas and what I was doing right. Even years later, I still have every single homework that you edited.\n\nWhen it came time for the final project of the year, making a short, fifteen-page novel, you didn’t laugh at me when I said I didn’t think I could draw well enough to make it a storybook. You heard my words, and instead of forcing me to do something I didn’t want to, you let me write through the pages I should’ve been coloring. You allowed the writer in me that I’d been holding back to flourish; when I wrote past the fifteen-page limit, you never once told me to delete something. You’d have me drop the double spacing to singular, and you had me decrease the font size. It ended up being seventeen pages, but you let it slide.\n\nMost of all, you let a twelve-year-old who was confused about who she was write a story where two women fall in love at the end, married and happy, even when that kind of marriage wasn’t legal across the country yet. You allowed me to feel safe to be who I was, to test the waters of who I wanted to be, and nurtured my love of writing to be the creature it is today. I remember going back to your classroom on the last day of eighth grade, and when I told you I made it into the writing program at a high school nearby, the excitement on your face made me close to tears. You believed in my writing when I never did, and I can never thank you enough for it.\n\nSeventh grade was a similar story, yet different in the ways I needed it to be. I’d been looking forward to my science class all day, and when you welcomed me inside, I knew I had been assigned the best science teacher the school had. You started the class off with a powerpoint on why science matters in the modern world, and when it reached a slide about Mars, you and I had a back-and-forth conversation that I still remember fondly to this day.\n\nEvery single day was a new topic, a new area to bring my fascination into, and you knew it. We’d end up talking the class away over whatever new discovery had come up in the news, and the other kids in class would occasionally join in. I thought of you as the mom I never had, a maternal figure who loved me, supported me, and knew that I would do something great with my life. When you saw me, you didn’t see the broken-down girl who sheared off her hair into a pixie cut halfway through February because she didn’t know who the hell she was anymore; no, you saw a girl who loved the stars and world more than anything else, you saw a girl you believed in, you saw a girl who you wanted to see succeed in her life, and you made sure that I knew it. On the last day of school, your last day before retirement, I cried when I hugged you goodbye, and I saw you cry as well.\n\nNext fall, when I was in eighth grade and had an assignment in English to interview someone I idolized, I asked my art teacher if she could message you about it through Facebook, and you said yes. I came in after school with a notebook, my phone, and the biggest grin I’d had since June. When I saw you, all I wanted to do was hug you and call you “Mom” instead of Mrs. Conway, the second of which would’ve probably weirded you out. I left it to just a hug instead and started the interview. After we finished, you gave me a calendar filled with bird photos (since you took up photography ever since you retired) with a note on the back, wishing me luck in whatever career I chose to take up in the future.\n\nEver since I left the brick building I spent three years in, I’ve thought about you two. I think of Mr. Damanda when the story I’m working on passes fifteen thousand words, or when I read my work aloud at the open mic nights hosted at my school, run by the very program I’m apart of. I think of Mrs. Conway whenever the world’s knowledge of the universe expands, whenever I find myself looking up at the night sky, wondering what could possibly be out there, and knowing in my heart that I want to be the one to discover it.\n\nTo all of the teachers out there who wonder if it’s worth it, who think that they aren’t changing lives and making kids into the best versions they will ever be, I can assure you that there’s no one more influential to us than people like you.\n\nPeople like you give the kids who never want to go home a place to feel loved. People like you help the kid who doesn’t know who they are become who they want to be. People like you ensure that the childlike wonder we feel never fades, and turns into something for the betterment of everyone on Earth.\n\nPeople like you are the reason why myself, and thousands upon thousands of others, never gave up. Whether you make an impact in one student’s life, or every student that passes through your doors, you changed a kid’s life forever, and we can never, ever thank you enough.",
    "title": "To the two people who shaped me to be who I am today - thank you",
    "subreddit": "Teachers",
    "timestamp": 1555647400,
    "score": 9,
    "keyword": "mixed race judge"
  },
  {
    "text": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals) Hi all! I am a first year teacher in the public school system, but I work in a Pre-K/VPK Blended classroom. For those who may be unfamiliar (as I was, since I'm originally from a state who doesn't have VPK), basically I have x amount of gen ed kids on my roster, and my co teacher has x amount of special needs kids on hers. Technically, I'm supposed to teach for the first 3 hours of the day (as VPK is 3 free hours unless you pay extra for wraparound care) and my co teacher is supposed to make accommodations for the special needs kids on her roster. However, she \"doesn't agree with the co teacher model\" and has decided she is the \"teacher\" and I am the \"assistant\". The biggest problem with this being that I actually am a certified teacher and have 10+ years experience working in a preschool setting. Anyway, she decided I could have a 10 minute teaching slot before my 3 hour VPK kids go home. Whatever. \n\nThat isn't even the part I'm here for advice about. This teacher is miserable. In no certain order, these are just some of the things that have occurred since mid August, when the school year started:\n\n-She made a comment that, last year, she recommended that all the \"blacks\" in her class be put in the \"black\" kindergarten teachers' class just because that teacher is also black.\n\n-While commenting on a mixed race student on my roster, she said she would not claim the \"black half\" as it would \"only make life harder\".\n\n-She makes unprofessional comments and holds unprofessional conversations with parents at drop off and pick up.\n\n-She chases my parents out of the classroom if she thinks they've been in talking too long (she has done this multiple times with one of my parents who has deep concerns about her child's behavior and mental well being).\n\n-She constantly berates, belittles and corrects my teaching style, going so far to even suggest I should change how I have always taught to match hers.\n\nJust a few days ago, she was pulled in by our admin and told that there had been a few parent complaints regarding her, and that one of my students refers to her as \"the mean teacher\". Here is where I need advice - do I go to admin over this? I'm told that everyone \"knows how she is\" already, but I don't feel like that makes her behavior okay. But, I'm new and she has been at this school for 14ish years (only in pre-k for 3, though). Has anyone else dealt with a terrible co teacher, as well? I'm kind of at my wits end.",
    "title": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals)",
    "subreddit": "Teachers",
    "timestamp": 1573167874,
    "score": 7,
    "keyword": "mixed race judge"
  },
  {
    "text": "Math Anxiety Advice Hi there! Sorry for the long post on mobile. I’m really struggling with teaching math and have had anxiety around it and could really use some advice. \nI’m currently student teaching 5th grade and everything had been going really well until I started taking over math. Math has always been challenging for me, not sure why. Usually if I have rules/steps it helps and in terms of teaching, I know how to “do” the problems but the big shift of getting students to understand the “why” behind the equation has been throwing me off. I also get stuck on trying to anticipate the incorrect ways they’ll try to solve the problem or their crazy ways of solving it they are correctly but I have no clue how they got to the answer or if it will work for every answer. I also am more of a visual learner so having students say a bunch of numbers in guided instruction without having a chance to write it down and “see” what they mean is a struggle for me. \nEvery time my mentor teacher or someone brings up math I instantly have to suppress the feeling of my heart racing and feeling like I could cry at any moment; it’s like I automatically feel judged but I know they aren’t usually judging me. I have absolutely no idea why this happens or how to stop it. (I have social and performance anxiety so I know about those types). \nI’ve definitely had a few low points and it hasn’t been easy but I’ve taught math a few times, with a sigh of relief when it’s done. I like teaching it one on one to help kids, for some reason just being the sole source or “right” or “wrong” for whole class instruction in terms of math scares me, but I’m fine with all other subjects. \nToday a sweet student told me that she and the class can tell I’m nervous when I teach math and that it seems like it takes me a little bit to realize someone solved the problem incorrectly while I type it on the screen. I told her I do this so I can tell what they’re saying and also so everyone feels heard, not just typing up the ones who are “right” while just avoiding the wrong answers, which she said she didn’t realize it was a strategy (not sure that it is, but I’m going with it). Not going to lie, hearing that from her broke my heart because I’m worried that I’ll fail these kids, or pass on my math fear onto them. \nDid any other teachers have this problem when they started out? \nAny advice or resources for teaching math with anxiety or in general?  Or just teaching while having anxiety? M",
    "title": "Math Anxiety Advice",
    "subreddit": "Teachers",
    "timestamp": 1555486088,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Help! Ghosted after accepting job offer?! I recently quit my job of 6 years that I loved because I was recruited by another company through LinkedIn who saw my skills/experience and thought I would be a perfect fit for the job as manager overseeing 3 different high volume locations on a high school campus. \n\nRecruiter invited me to a invite only job fair. When I arrived the HR rep automatically assumed I was there for a \"shift supervisor position\" which is way lesser of a position than I was going for/ qualified for. She said there was only shift supervisor & assistant management positions open. I told her I must have been mislead, and I had spoken to a recruiter on linked in. Only then did she \"check her computer\" & see that in fact, there was a full management position open. \n\nThe interview itself was with the general manager, & I completely nailed the interview. This company focuses on guest service and standards so I answered my questions around that. My district manager from my previous job used to be this managers district manager as well, so I made sure to ask if she knew him in the interview. They did seem worried that I had worked only low volume locations(my companies high volume doesn't touch their low volume), but loved that I had experience as a leader in 3 stores, supporting other locations & had opened a brand new location in the area recently as well. I also had all the management training done, certifications done, & experience training leaders/tms for the district.  I almost expected to be hired on the spot. But was told they needed to get through the rest of the applicants, see how the day plays out & then would get back to me. \n\nThe recruiter reached out to me and asked what I thought. I was completely honest, I told him about the mix up & how the hr rep seemed to judge me based on my age. He said he would figure out what happened because he had spoken prior directly with her & said that I specifically was there for the upper level management position. He basically hinted that I was overqualified. \n\nThe manager reached out to me and asked me to come in for a second interview with another manager. The interview was with both managers. It was extremely laid back and it seemed like more of a meet & greet then an interview. When I explained all the training I had, the second manager asked the first what one of them was- and the first goes \"thats the training you're doing now.\" The second manager asked the first if we talked about pay, where the first manager kinda of whispered - well I think that *hr rep* will discuss that. \n\n2 weeks went by and I thought ok, not happening. Then I get a call from the hr rep apologizing because they realized noone had reached out and then offering me the position. I explained I was still interested but was currently at work & asked if I could call back in a few hours. \" Ok no problem! \"\n2 minutes later the 2nd manager calls me and asks if I'm still interested, I told her I just spoke to Jessica & I was, but I was at work and would call back in a few hours. I called back and neither answered their phones, kept ringing. I left a voicemail on one. Noone ever called me back but HR rep emailed me the welcome packet, job offer, etc. The position was for assistant manager (a position lower than I had interviewing for) but salary pay & higher than I was making at the job I was working. I completed all the paperwork (e-sign) sent it in, and asked if It was possible for a later start date so I could remain professional with my employer & give them correct notice. Hr rep replied it was no problem and since I let them know about my vacation during interviewing. She offered I start the day I come back. I said that would be great!\n\nSince noone had called me back to discuss more of the position, I reached out to check about dress code. They said they would order me a shirt & asked what size. I replied back with size & a thank you. Now time has gone by and I am meant to start in 6 days. I reached out the day before my vacation to the 1st manager, Ccd the 2nd manager in, & did not get any responses.... I asked about the rest of the dress code, and where exactly/what time I would be reporting to since there are 3 locations on campus. \n\n3 days have passed since I sent the email. I'm on vacation at the other end of the country & would rather not make a phone call because the manager speaks very broken English and it's hard for me to find somewhere quiet here. Should I fwd the email to the HR rep and ask for her help? I dont know what to do and dont understand why they are ghosting me😭",
    "title": "Help! Ghosted after accepting job offer?!",
    "subreddit": "careerguidance",
    "timestamp": 1566572804,
    "score": 131,
    "keyword": "mixed race judge"
  },
  {
    "text": "I can't get beyond an Associate's... Is it enough? Hey guys I'm Chubak. Ever since I was a kid I wanted to be a software developer. I started with games, jumped to web, jumped to graphics, jumped to games again, a and then landed on ML and DL. But I found it to be too trite, not much coding involved if you aren't a Master's student reading 10 journals a month, writing one each quarter. So I decided to do the sane thing and re-learned everything I had learned about web back in 2010. And how it has changed! Back then jquery was a big thing. Nowadays people don't spit on jquery. Back then Node.js was just something experimental that nobody knew nothing about, but today a lot of websites are written using Node. Back then, my future job title, \"full-stack developer\" was rarely used, because front-end and back-end devs were segregated more than Saudi Arabia segregates boys and girls. But these days everyone \"fancies\" himself a full-stack dev. Anyways, things have surely changed since I was 17! I did some Wordpress jobs back then, these days a lot of people who fancy themselves web developers just set up Wordpress. Well I'm not the one to judge them. But Wordpress has serious security flaws and it's written in one of the worst languages ever. These days people use PHP frameworks like Code Igniter, Lavarel, and Phalcon. But back then PHP was strong. And there's this \"thing\" that is popular in my country, [ASP.NET](https://ASP.NET), and I call it a \"thing\" because to me, propriety software are eternally \"things\" to be reckoned with. Anyways, I have an issue.\n\n&#x200B;\n\nThe year of National University Exam, let's shorten it to NUE, that was when I was 18, 8 years ago. I was diagnosed with diabeetus and I was already bipolar. I was a mess, I kept breaking down doors and jacking off to a pornstar I had fallen in love with and planned to recreate her in my lab a la Doctor Frankstein. So I failed the NUE. But I really wanted to get into a state university, it was so eye-catching to me, so I enrolled in the English NUE and ceremonially got into English lit at FUM. But I was still a mess, so I fell in love five times, became a pill popper, mixed Ambien with alcohol and had to spend a month in the nuthouse. So I dropped out. Up until 3 months ago, I used to sit behind my computer all day, coding and shit. And I hadn't planned on getting a Bsc in software engineering, like I had planned to back when I was 18. But there was this old, quaint community college near our house, very near, like 2 minutes away, and I enrolled in it. It only offers an Associate's, and I plan on getting it. But no further.\n\n&#x200B;\n\nI'm a Christian convert and I feel chocked in this country, so I really wish to immigrate to a Christian country (to the wisenheimer who says Papau New Guinuea, fuck you). Would an Associate's degree be enough?\n\n&#x200B;\n\nThanks. Off to read The Numbers.",
    "title": "I can't get beyond an Associate's... Is it enough?",
    "subreddit": "cscareerquestions",
    "timestamp": 1575813456,
    "score": 0,
    "keyword": "mixed race judge"
  },
  {
    "text": "Life After Public Accounting   \n\nI have been a long time lurker on this sub, using everyone’s advice since I was interviewing for B4 internships so I wanted to pay it forward. I have found my time on this sub has had mixed reviews of B4/public accounting so I wanted to share my experience now that I have exited into industry. \n\nOne thing that I constantly struggled with was, does this job suck or do I think it is supposed to suck because that is what I have been told since being a college student. To be honest, a little bit of both. It is easy to get caught up in the complaining and whining which can overall bring your mood down. It is best to allow yourself to vent and then move on. Some parts of the job were great –  working with smart and motivated people, flexible work schedule, the ability to see and understand how a company is ran, while other parts – long hours, non-value add to a business (imo), pressure to make the client’s problems our problems were absolutely awful. This will be up to you to judge what is worth it. For some people, 1 year is plenty and they will move on, others may make it to senior, some stay until the day that they retire. For me, I always took it 6 months at a time. I knew that my opinion of the job could be determined by the teams I was on, what was going on at the client, or personal/family issues that the demands of the job and my drive to stay there were going to be fluid. \n\nMy biggest piece of advice is that everyone’s path is going to be different. Once you can accept this, your life will be much better. Often times we compare ourselves to our peers, duh the firms do for compensation, but when you take a step back realize that how can you compare your time on a large public job to those people that juggle 8 private jobs year-round? It is best to worry about yourself and look out for yourself, because no one is going to do that for you. You don’t have to be a jerk, crushing those in your path, but I find that it is easy to get caught up in office drama if you are constantly worrying about everyone else.\n\nWith that being said, I exited after 5 years in B4 public accounting for a job at a top 25 public company that I would venture to say \\~90% of the world is familiar with. I had my manager schedule in-hand, when the opportunity arose. I was always open to hear opportunities but always knew I was never going to just leave for anything. If you work your butt off in public accounting, don’t just leave for anything because you are frustrated. BE PICKY! You have earned it. While public accounting isn’t the only way to have a successful accounting career, it sure can open up some doors. I have met various successful people in industry who have had varied public accounting experiences. When I told my partners and managers of my departure, some thought I would be stupid to leave without 1 year of manager experience. They made me feel as though I couldn’t be successful without the firm. I knew I was taking a risk. Maybe the new job wasn’t going to be sunshine and rainbows as promised. Maybe I wouldn’t like what I was doing. Maybe I would be bored and not challenged and struggle to get through a 40 hour work week. But I knew that a job like this wouldn’t come around again. I would be leaving for a 45% raise, better benefits (health, 401K, etc), more PTO and the ability to actually use it, flexibility in owning my schedule, not to mention no more working until 3AM for months on end. In my leaving I realized the people that truly cared about me were happy as they realized what type of an opportunity this was for me, while others showed their true colors – showing me that basically I was nothing more than a warm body that was willing to work ungodly hours. As it all turns out, I am in a manager roll here, with everything turning out as promised. It is okay to trust your gut and remember than not everyone is going to have the same path.\n\nPublic accounting isn’t always fun – probably not even 50% of the time. Take time for yourself and take care of yourself. Don’t be pressured by what you are supposed to do or expected to do. Leave after 1 year, 2 years, 5 years, 10 years or stay forever. You don’t need to apologize to anyone. This is your career and your life. Good luck all!",
    "title": "Life After Public Accounting",
    "subreddit": "Accounting",
    "timestamp": 1562183048,
    "score": 168,
    "keyword": "mixed race judge"
  },
  {
    "text": "Cover letters & \"cold emailing\" advice I'm a 1L at a T30 school, and I'm currently on the hunt for a summer job. I'm not in the \"top\" of my class, but my grades are fine (B+ average), and I have two years of work experience before law school at a consulting firm. My school uses Atlas, and I've applied to MANY jobs, internships, and externships, but I've only gotten a handful of interviews. \n\nI'm convinced that my cover letter is so bland that it gets lost in the mix. I would greatly appreciate any advice on how to spice up my cover letter. \n\nAdditionally, I'm at the point where I'm going to look outside Atlas for a summer job. I've heard mixed things about \"cold emailing\" law firms in my area. I know that the big law firms are out of the question, but I would love to hear if any of you had cold emailed smaller firms. Do you ask to buy a lawyer a coffee and chat about their job? Do you just ask if they have any summer positions open? Is it out of the question to cold email a judge? I've heard so many conflicting stories.\n\nThanks in advance. Any advice is greatly appreciated.",
    "title": "Cover letters & \"cold emailing\" advice",
    "subreddit": "LawSchool",
    "timestamp": 1551723369,
    "score": 3,
    "keyword": "mixed race judge"
  },
  {
    "text": "I'm enraged by the treatment given to Bothem Jeans' Murderer and so are MANY MANY of my FB friends who have made their opinions on the subject quite clear. \n\nWhere does my rage stem from?\n\nFrom the fact that a black man would never hug ME. That Black judge, my sister? would NEVER hug ME. MY tears would never be met with any sympathy at all, but rather written off as fake and insincere. Stroke my hair?! Offer me a tissue?! HA!!\n\nBecause of my race and gender COMBINED, the narrative for me would NEVER include leniency, empathy, or support. \n\nBecause I have to teach my daughter that the Black Woman is not allowed to make mistakes and certainly never allowed to be remorseful for them. There is no such thing as Black woman tears, or missing black woman syndrome. \n\nMy rage comes from unexpressed grief for what shouldn't be but is. \n\nWe can, and will, change our world for the better. But not without acknowledging where we are now.",
    "title": "I'm enraged by the treatment given to Bothem Jeans' Murderer",
    "subreddit": "blackladies",
    "timestamp": 1570129389,
    "score": 147,
    "keyword": "mixed race judge"
  },
  {
    "text": "Not just Grown-ish: Black-ish has a color problem too Been thinking about this a lot and wanted to speak on it. As someone who is lighskin and frequently mistaken for mixed race I try to be very aware of my privilege within the black community and slight advantage in white spaces. I've never been able to fully appreciate Blackish or partake in the hype surrounding it because the majority of the cast seems to be made up of \"safe\" black people. Palatable for white audiences, that is. Other than the little girl, the rest of the family range from light to medium skinned. Half are biracial. Outside of the main family few of the guest characters are dark skinned, and it's always bothered me and kept me from getting into the show. If it's not representative of all of us then in my opinion it's not representative at all. \n\nContrast this with black entertainment in the 70's and even 80's and 90's when seeing dark skin on black shows, even dark skinned women, wasn't as sparse and uncommon. Even though I feel we have more overall representation today, it is less reflective of our features than before from my vantage point. There was less black representation back then but when there was, the characters were predominantly non-biracial black folk. As far as colorism in black hollywood, we've gone backwards. Name an attractive, popular dark skinned (or non biracial) actress besides Lupita and (sometimes) Gabrielle Union. Now compare that to Yara Shahidi, Amandla Steinberg, Tessa Thompson, Laura Harrier, Zendaya. These are the faces young black women in my age group have. It's not as alienating for me because (to a degree) I look like them. But most black women don't. There are no dark skinned equivalents. It really saddens me and as someone who wants to write and direct movies/tv someday, I hope to amend it with my work. More of us gotta start writing content and casting ourselves. \n\nI do see it getting a little better in the music industry. We have Lizzo, a rise in female rappers with regular black backgrounds and black features, although even that has been overshadowed by Cardi B. The new black female artists who've enjoyed the most success, other than Lizzo, are biracial or lightskin. Jorja Smith, Ella Mai, H.E.R (Black passing but still biracial), in addition to Cardi who has had the most. Beyonce and Rihanna still reign supreme. \n\nStill! There's hope. A few years ago I really couldn't see people like Lizzo (or Noname) getting exposure or a chance to become popular. I think the internet has allowed for a lot of people to get platforms they wouldn't otherwise have, which has indeed resulted in oversaturation and mediocrity, but also for some great talents to emerge and get traction. \n\nWhat do you ladies think about this issue?",
    "title": "Not just Grown-ish: Black-ish has a color problem too",
    "subreddit": "blackladies",
    "timestamp": 1556978071,
    "score": 86,
    "keyword": "mixed race judge"
  },
  {
    "text": "The Many Sins of College Admissions: Jeannie Suk Gersen writes about the conclusion to the court ruling on Harvard University’s use of race in admissions, which alleged that the school discriminated against Asian-American applicants, from the federal judge Allison Burroughs.",
    "title": "The Many Sins of College Admissions: Jeannie Suk Gersen writes about the conclusion to the court ruling on Harvard University’s use of race in admissions, which alleged that the school discriminated against Asian-American applicants, from the federal judge Allison Burroughs.",
    "subreddit": "asianamerican",
    "timestamp": 1570552134,
    "score": 26,
    "keyword": "mixed race judge"
  },
  {
    "text": "I call Bullshit on the False rape accusation sticky from Mens Lib sub. Actual lies are being told.  \n\n>Fact Checking False Rape Accusations and Why We Shouldn't Fear a False Rape Epidemic.  \n>  \n>📷  \n>  \n>One of the main resistance to changes in how police and society handle Rape, Sexual Assault and even Harassment is the counter argument that men then would be plagued by False Rape accusations. The fear is always that we crossed some line that no longer allows reasonable doubt and that one man life can be sent to jail by one accusation. We of course have seen stories of such things in the news and everytime we question wither these are isolated stories or a sign of a larger epidemic we don't get to see. When does the drive of combating rape go to far? Is it an issue to fear?  \n>  \n>So how common is this issue? Is it really a threat to men? How many false rape accusations are there?  \n>  \n>How Many False Rape Accusations are there?  \n>  \n>[Most experts agree that false rape accusations make the total of 2-10% of the total accusations of rape.](https://www.nsvrc.org/sites/default/files/Publications_NSVRC_Overview_False-Reporting.pdf) As quoted from the handbook  \n>  \n>A multi-site study of eight U.S. communities including 2,059 cases of sexual assault found a 7.1% of false reports (Lonsway, Archambault, & Lisak, 2009).  \n>  \n>Link to it here --> [http://www.scirp.org/(S(i43dyn45teexjx455qlt3d2q))/reference/ReferencesPapers.aspx?ReferenceID=1238871](http://www.scirp.org/(S(i43dyn45teexjx455qlt3d2q))/reference/ReferencesPapers.aspx?ReferenceID=1238871)  \n>  \n>[A study of 136 sexual assault cases in Boston from 1998-2007 found a 5.9% of false reports (Lisak et al., 2010).](https://www.ncbi.nlm.nih.gov/pubmed/21164210)  \n>  \n>[Using qualitative and quantitative analysis, researchers studied 812 reports of sexual assault from 2000-2003 and found a 2.1% of false reports (Heenan & Murray 2006).](https://www.ncjrs.gov/app/abstractdb/AbstractDBDetails.aspx?id=243182)  \n>  \n>And why not add some more papers to the mix.  \n>  \n>[2017 Study into the FBI Database found that between 2006 to 2010 the Average number of false rape accusations or baseless accusations was 5.55%, and robbery had a higher false and baseless accusation rate of 5.76%](https://www.researchgate.net/publication/315728247_The_Prevalence_of_False_Allegations_of_Rape_in_the_United_States_from_2006-2010)  \n>  \n>[Another metastudy by Claire E. Ferguson, and John M. Malouff published in December 17th, 2015 put the number of False Rape Accusations at 5%](https://link.springer.com/article/10.1007/s10508-015-0666-2)\n\n&#x200B;\n\nSo keep in mind that ALL of these numbers are minimums. These all represent the number of false rape accusations made to the police that provably false using rigorous standards. \n\n&#x200B;\n\n And while it may be small, the 2-10% is actually 2-11%. They round that 2.3% number down to 2% so it's only fair to round the 10.9% up to 11%. You can either say 2.3%-10.9% or you can say 2-11%. It's a small thing but it irks me. \n\n&#x200B;\n\nBut all of these numbers are minimums. Just like when 3-5% of cases end up with convictions. That means a minimum of 3-5% of rape cases taken to the police are true. A MINIMUM.  \n\nThis three minute youtube sums it up very well. \n\n[https://www.youtube.com/watch?v=I8zSDvaYrRw&list=LLIiza3uxnPBzZKoXthGOenQ&index=9&t=0s](https://www.youtube.com/watch?v=I8zSDvaYrRw&list=LLIiza3uxnPBzZKoXthGOenQ&index=9&t=0s) \n\n&#x200B;\n\n&#x200B;\n\n>Now I know that 2-10% is alot and enough to give anyone pause considering how epidemic sexual assault is. But consider a few things.  \n>  \n>[1 in 6 of women report they have been sexually assaulted.](https://www.rainn.org/statistics/victims-sexual-violence)\n\n&#x200B;\n\nIf you check the link it takes you to Rainn. The 1 in 6 women will be rape in their lifetime comes from where? I checked the footnote. Oh it's from...\n\n National Institute of Justice & Centers for Disease Control & Prevention, Prevalence, Incidence and Consequences of Violence Against Women Survey  \n\nThis is the precursor to the CDC NISVS survey. Guess what the CDC NISVS survey also found? It found that for years of 2010-2012 female-perpetrated \"made to penetrate\" sexual assault on men, (rape, for lack of a better word,) was at parity with male perpetrated rape for these years. Let that sink in for a minute.\n\nWhen you are done letting that sink in, ask yourself why a sub called r/menslib is not mentioning that in 2012 there were over 1.5 million instances of female-on-male rapes according to the CDC NISVS survey in 2012? (Although they don't call it that, but prefer the more awkward, \"made to penetrate\" sexual assault) '\n\nThis links to the CDC NISVS survey data so you can check for yourself. The lifetime stats are much lower than the year over year and despite my inquiries to the CDC I have not gotten an answer as for why that is. However, for each year of 2010, 2011, and 2012 we find parity between the sexes for sexual assault/rape perpetration. Look at the 12 month data.\n\n&#x200B;\n\nThis blog does a very good job of breaking this down:\n\n [https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) \n\n&#x200B;\n\n>Only a 1/3rd of sexual assaults are reported to police. So at its 2-10% of 33%  \n>  \n>This statistic covers if or not an accusation is false, wither or not a specific suspect is named which I will show below is a more interesting stat. The majority of false rape accusations are made against non existent strangers the victims claim they don't know.\n\n&#x200B;\n\nThis is a nice rabbit pulled out of the hat. Why are we assuming that all of the sexual assaults not reported to the police are true? I for one have been the collateral damage victim of a false/baseless rape accusation made on social media. Ostensibly, rape accusations that are not taken to the police and are merely posted on Twitter, Facebook, or added a circulating anonymous rapist list, or made at a bar, or something... are MORE likely to be false. Not less. Yet this author would have you believe that they are all 100% true. Magic! \n\nOf course there are many rapes that happen that are never taken to the police. For example, the 1,5 million incidents of female on male \"made to penetrate\" rape that I mentioned above. Almost none of these are reported. Less than 1 percent. These male victims of female perpetrators are hidden by systemic cultural bias.\n\n&#x200B;\n\n>Soo how many false rape allegations lead to false arrests and convictions then?  \n>  \n>How many people Falsely Accused of Rape actually go to Jail?  \n>  \n>Thankfully we found that the answer is very low.  \n>  \n>[National Registry of Exoneration who keeps track of how many innocent people have been... well... exonerated found that since 1989 in the US ~~52~~ people have been exonerated for sexual assault that they didn't do. People exonerated on false accusations of Murder was 790 people.](http://www.law.umich.edu/special/exoneration/Pages/browse.aspx)  \n>  \n>  \n>  \n>  \n>  \n>Note: Innocent Project has listed 276 exonerated with Sex Crimes, this is the highest number I can find. Thanks [/u/MealReadytoEat\\_](https://www.reddit.com/u/MealReadytoEat_/)  \n>  \n>[British Home Office did a detailed study and report on the issues of false rape accusations in 2005 and found that out of the 216 cases of rape that was false in the UK, 126 of them have a formal complain filed by the accuser, **39 of them had a named suspect** and only 6 of them were arrested. Out of the 6 arrested only 2 have charges and **0 of them had a conviction.**](http://webarchive.nationalarchives.gov.uk/20100408125722/http://www.homeoffice.gov.uk/rds/pdfs05/hors293.pdf)  \n>  \n>[Another Study by the University of Pittsburgh found that only 18% of False Rape Accusastions name a suspect](https://search.proquest.com/docview/1900298026?pq-origsite=gscholar)\n\n&#x200B;\n\nNevermind the fact in 1996 the FBI backtested over 25,000 rapekits and found that 1 in 4 excluded the primary suspect, in almost all cases, as fingered by the primary witness/alleged victim.\n\n  [https://www.ncjrs.gov/txtfiles/dnaevid.txt](https://www.ncjrs.gov/txtfiles/dnaevid.txt) \n\n*Conducted in June 1995, the nationwide telephone survey of 40 public and private laboratories that performed DNA tests sought answers to such questions as: From the time the laboratories began DNA testing, how many cases have they handled? Of that number, what percentage yielded results that excluded defendants as sources of the DNA evidence or were inconclusive?*\n\n  *The 40 surveyed laboratories yielded 19 whose available data were sufficient for the purposes of this study. The 19 included 13 at the State/local level, 4 in the private sector, an armed forces laboratory, and the FBI's laboratory.*  \n\n*Most of the laboratories had initiated DNA testing only within the previous few years. Twelve began testing between 1990 and 1992. Three of the four private laboratories began in 1986 or 1987, while the FBI started DNA testing in 1988.*  \n\n*Seven of the laboratories reported using RFLP testing; four, PCR testing; and eight, both types of tests.  The 19 laboratories reported that, since they began testing, they had received evidence in 21,621 cases for DNA analysis, with the FBI accounting for 10,060 cases. Three of the 4 private laboratories averaged 2,400 each; the State and local laboratories averaged 331 each.* \n\n ***In about 23 percent of the 21,621 cases, DNA test results excluded suspects, according to respondents****. An additional 16 percent of the cases, approximately, yielded inconclusive results, often because the test samples had deteriorated or were too small. Inconclusive results aside, test results in the balance of the cases did not exclude the suspect.*  \n\n***The FBI reported that, in the 10,060 cases it received, DNA testing results were about 20 percent inconclusive and 20 percent exclusion; the other 18 laboratories (11,561 cases) reported about 13 percent and 26 percent, respectively.\\**** \n\n *Unfortunately, the laboratories were unable to provide more details. They did not maintain data bases that would permit categorization of DNA test results by type of offense and other criteria. What happened to the suspects who were excluded through DNA testing also cannot be determined. Were they released, or were they charged on the basis of other evidence, for example?  Thus, only the most general information is known about the results of DNA testing by laboratories. To  obtain more detailed information would require a comprehensive research project.*   \n \n\nThat's hard forensic data that puts the ballpark figure of false rape accusation at about 1 in 4. Now to be fair, some of these may have been genuine mistaken identity. But if you are the man under arrest by the police accused of rape, you would call that a false rape accusation.\n\n&#x200B;\n\n&#x200B;\n\n>Fact is that the majority of false rape accusations don't even name a suspect. And throwing this into the picture of the total of the numbers of rape really proves how rare false rape **Convictions** are. Vast majority of false rape accusers always accuse a non existent stranger who raped them and usually not someone specifically. Which means that beyond wasting time and resources majority of false rape accusations are harmless to the general public because no one person is accused.  \n>  \n>When you take these studies and add them to what we already know about rape a more complete picture forms:  \n>  \n>1/6 women claim to have experience sexual assault, follow by a 1/3 reporting the assault to police, then **worst case scenario** 1/10 are false. Out of those false rape accusations 9/50 name a suspect, out of false rape accusations that accuse someone 15/100 get an arrest and, out of those who are arrested for a rape they didn't do only 1/3 have charges placed against them.\n\n&#x200B;\n\n**This is so wrong as to be a lie. Remember, according to Dr. Lisak's metastudy, a minimum of 2-11 percent of all rape accusations taken to the police are PROVEN to be false.** \n\n&#x200B;\n\n>So 1/6 x 1/3 x 1/10 x 9/50 x 15/100 x 1/3 = 0.00005  \n>  \n>Which mean out of all the women you meet you have a **0.005% chance of being falsely charged of Rape.**\n\n**A blood vessel in my frontal lobe just exploded. I can't even begin to understand what the heck he is doing with the numbers here. Can anyone help me out with this. Like I have a headache just from trying.** \n\n&#x200B;\n\n>Compare this to the fact that [6.4% of men openly admitted of committing the strictest possible definition of rape](https://davidlisak.com/wp-content/uploads/pdf/RepeatRapeinUndetectedRapists.pdf) and 23% of that 6.4% admitted of multiple rapes.\n\n&#x200B;\n\nThis link is dead. But let's look at a couple other studies that look at the number of people openly admitting to committing rape. \n\n Hogben, Byrne & Hamburger (1996) Lifetime prevalence of 24% for women having made a man engage in sexual activity against his will \n\n[https://www.tandfonline.com/doi/abs/10.1300/J056v08n01\\_05](https://www.tandfonline.com/doi/abs/10.1300/J056v08n01_05)\n\nSexually Aggressive Women  **Anderson, Struckman-Johnson 1999** – 43% of college women admitted to using verbal or physical pressure to obtain sex  (No ebook available. I've ordered a print copy in the mail but it won't arrive for another week.)\n\n [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6245084/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6245084/) \n\nI'm just saying, there is one half of the equation being left out here. It is likely the smaller half. But why are we still pretending in 2019 like it doesn't happen? It happens all the time. Go check out r/teacherswhorape for a daily update of female pedophiles.\n\n&#x200B;\n\n&#x200B;\n\n>Why False Rape Accusations happen?  \n>  \n>Many people who fear False Rape Accusations claim that women in the work force will make a False Accusation against a man in a higher position, or a student who is going to fail an exam will accuse a professor, or rape or that a vengeful ex, or a woman who regretted sex later.  \n>  \n>But the realities of this is very surprising.  \n>  \n>[According to a review done by the LAPD found the reasons for a False Rape accusations is unwanted pregnancies or more commonly \"Missed Curfews\" by young teenagers. It turns out that 55% of False Rape Accusations according to this review are for hope of getting medical care or psychiatric medication by the very poor and destitute](https://www.ncjrs.gov/pdffiles1/nij/grants/237582.pdf)  \n>  \n>[Also it is noted that half of the False Rape Accusations are made by Parents of children.](http://www.d.umn.edu/cla/faculty/jhamlin/3925/4925HomeComputer/Rape%20myths/Police.pdf) Either by pressuring the child to go to the police or accusing someone of rape without the child knowing. It is also important to note that the rare Serial False Rape Accusers tend to have a history of being a legitimate victim Sexual Abuse as a child.  \n>  \n>As this shows that the False Accuser the majority of the time aren't the serial accusers we hear on the media nor are in tech jobs, nor college students who regret sex. Instead it is usually either the very poor looking for free medication, teenagers trying to get out of trouble and parents of children who make the vast majority of False Rape Accusations.  \n>  \n>Also there are no corolations with the age of the accusation or the number of sexual partners of the accuser and wither their accusations are true or not. Add this to the fact that [most legitimate victims lie to themselves and others saying that they weren't sexually assaulted when they really were. This denial often is due to the fact that the majority of victims know their abusers personally before the assault and often change their stories or denied that they were as a way to cope the trauma.](http://journals.sagepub.com/doi/pdf/10.1177/0886260517726412?casa_token=TR0lDTFQ-9cAAAAA%3AXFQbcARRx9QC1UnefnGp3FIc0pMTR4K5X-49EvzFMnXxeQxUba98DKlj4DcWjJOvFeihHXQTGwd5Vw&) I can personally attest to that.  \n>  \n>Special thanks to [/u/ILikeNeurons](https://www.reddit.com/u/ILikeNeurons/)\n\n&#x200B;\n\nWhy does he leave out De Zutter(2017)? [https://www.researchgate.net/publication/313830325\\_Motives\\_for\\_Filing\\_a\\_False\\_Allegation\\_of\\_Rape](https://www.researchgate.net/publication/313830325_Motives_for_Filing_a_False_Allegation_of_Rape) \n\nReasons for a false rape accusation:\n\n* Material gain: to receive money, [professional promotion](https://en.wikipedia.org/wiki/Promotion_(rank)) or other material benefits.\n* Producing an [alibi](https://en.wikipedia.org/wiki/Alibi): a false allegation is used to cover up other behaviour, such as being late or absent to an appointment.\n* Revenge: to retaliate against a disliked person by damaging the reputation, freedom or finances.\n* Attention: an attempt to receive any kind of attention, positive or negative, by anyone.\n* Sympathy: a special kind of attention-seeking whereby the complainant tries to improve a personal relationship with a specific individual.\n* 'A disturbed mental state'; this may include false memories (\"sexual hallucinations\") or pathologic lying.\n* Relabeling: consensual sex is relabeled 'rape' to the police, because of its 'disappointing or shameful character'. De Zutter et al. argue that a distinction should be made between some acts during a consensual sexual encounter that a participant did not want or had no desire to engage in but nonetheless gave consent to (e.g. to please their partner) on the one hand, and rape (nonconsensual sex) on the other, but that many lay people and even some scholars do not make this distinction and confuse the two. It is often when accounts of such 'unwanted consensual sex' are told to friends and family that the latter interpret it as rape, and put the complainant under pressure to file an allegation.\n* Regret: after having had consensual sex, a complainant experiences negative feelings such as disgust, shame, and sorrow; when others notice this and ask about the source of these negative feelings, they are prone to view the encounter as rape and put the complainant under pressure to file an allegation.\n\n### 'Don't know'\n\nAccording to De Zutter et al. (2017), 20% of complainants said that they did not know why they had filed a false allegation.[\\[8\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-Zutter2017-8)\n\n&#x200B;\n\n While we are at it, wikipedia also lists false memories as a reason for a false rape accusation. \n\n### False memories[[edit](https://en.wikipedia.org/w/index.php?title=False_accusation_of_rape&action=edit&section=2)]\n\nThere are several ways in which an alleged victim can accidentally come to believe that they have been raped by the person(s) they accuse. These include, but are not limited to:[\\[7\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-French-7)\n\n* [Recovered memory therapy](https://en.wikipedia.org/wiki/Recovered_memory_therapy): memories of sexual abuse 'recovered' during therapy in the absence of any supporting evidence, based on the [Freudian](https://en.wikipedia.org/wiki/Sigmund_Freud) notion of \"[repression](https://en.wikipedia.org/wiki/Repression_(psychology))\"[\\[7\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-French-7)\n* The victim's confusion of the memory of the real rapist with the memory of someone else\n* [Memory conformity](https://en.wikipedia.org/wiki/Memory_conformity): memory can become contaminated when co-witnesses discuss their recall of events\n\n&#x200B;\n\nLet's not forget that in the UK, \"alleged\" rape victims are paid in cash regardless of whether the accused is found guilty or not.  \n\nJemma Beale collected 11,000 pounds before being caught. That's a hell of a side gig.  falsely accused nine men of raping her on separate occasions, while a further six had supposedly sexually assaulted her.  \n\n[https://thewarrzone.blogspot.com/2019/03/the-hard-lessons-of-jemma-beale.html](https://thewarrzone.blogspot.com/2019/03/the-hard-lessons-of-jemma-beale.html) \n\nShe is unique in that she is one of the rare false rape accusers to be prosecuted. \n\n&#x200B;\n\n&#x200B;\n\n>Why didn't you include those other \"Studies\"?  \n>  \n>Since I am from the future I know this will be bring up sooo I will nip it in the butt before it shows up in the comments. And if they still show up without talking about this section of my effort post you have my permission to shame them.\n\nSmall thing, but the saying is \"nip in the bud.\" Like a plant. Shame is how feminism works, right? They shame people into submission. Like #metoo. If you stand up to a false rape accusation they shame you as a RAPE APOLOGIST. \n\n&#x200B;\n\n>People who fear the False Accusation \"Epidemic\" that is supposedly happening like to point to the \"other studies\" on these issues. What are these other \"studies\" and why don't I use them in my analysts? Well because they are bad. Flat out bad or rely on a misconception of the nature of sexual assault. And there are alot of them. Lets take sample out of the list Wikipedia provided.\n\n&#x200B;\n\n>[Also these studies expose a much larger issue when it comes to research into sexual assault.... What is Sexual Assault and what is False Sexual Assault. When you look at studies the older ones tend to have uhhhhhh questionable views of what is and isn't sexual assault.](https://www.cambridge.org/core/services/aop-cambridge-core/content/view/CA29549D811B7C639DFF2754197BBF9C/S0008197306007069a.pdf/false_allegations_of_rape.pdf)\n\nI would say the same argument could be flipped on the new definitions of rape coming our of Academic feminism. \n\n&#x200B;\n\n>Then if you look at other higher studies like Kanin and Jordan you figure out that they are working on the police definitions of False or Not. Unfortunately that means that they consider a story false if the victim:  \n>  \n>Failed a Polygraph [Click here if you wanna know why the Polygraph is \\^\\^\\^bullshit](https://www.vox.com/2015/10/18/9560391/polygraphs-wrong-police)  \n>  \n>If the victim delayed reporting their rape  \n>  \n>If the victim was [\"Intellectually Impaired\"](https://www.npr.org/2018/01/08/570224090/the-sexual-assault-epidemic-no-one-talks-about)  \n>  \n>If the victim has signs of mental illness  \n>  \n>If the victim was intoxicated  \n>  \n>If the victim withdraw the complaint  \n>  \n>And if the victim was determined by police to be a \"Slut\"\n\n&#x200B;\n\n&#x200B;\n\nThere are criticism to make of Kanin. Small sample size, sure. Undisclosed location, also iffy. But according to Kanin, the police only classified an accusation as false if the alleged victim confessed to it being false AND they were able to corroborate the new story with the defendant and other witnesses. It did involve a serious, but not mandatory, offer of a polygraph test. But the offer of the polygraph test was merely a catalyst. An accusation was on classified as false if the alleged victim herself recanted. In 41% of the cases, the alleged victim did so. \n\nThere are legitimate concerns about this study I listed above. But the author has told another lie. No accusation was regarded as false at any time because of a failed polygraph or for any of the above listed reasons. I'll have to read the Jordan study because the author definitely lied about Kanin so I can assume he probably lied about Jordan as well. In fact, I completely distrust this guy.\n\n [https://link.springer.com/article/10.1007/BF01541619](https://link.springer.com/article/10.1007/BF01541619) \n\n&#x200B;\n\n>While false complaints do occur, approximately **three-quarters of the incidents concluded by the police to be false appeared to have been judged to some extent at least on the basis of stereotypes regarding the complainant’s behavior, attitude, demeanor or possible motive.** Suspicious file comments were made by the detectives regarding a woman who laughed while being interviewed, others who were seen as ‘attention seeking,’ and some who were said to be ‘crying rape’ for revenge or guilt motives.\n\n**Attention seeking, Revenge, and guilt** are all common and legitimate motivation for a false rape accusation according to self confessed accounts accumulated by De Zutter 2017. See above. \n\n&#x200B;\n\n>That's right. 75% of False Rape Accusations labeled as such by police were not because they were proven false but on the gut feelings of the police. Which means we get plenty of **false false rape accusations**. This is probably a bigger issue then men being falsely accused of Rape. [There have been plenty of documented cases of police pressuring victims to sign false confessions claiming they made up their sexual assaults.](https://www.propublica.org/article/false-rape-accusations-an-unbelievable-story) Its why one of the major reasons why [out of 1000 rapes only 6 rapists will go to jail while for robberies 20 will go to jail and 33 of assault and battery](https://www.rainn.org/statistics/criminal-justice-system).  \n>  \n>Using Fear as a WeaponWhy do we talk about False Rape Allegations all the time, and how its used as a political weapon.\n\nThe police deal with the shittiest people of society all day every day. You are allowed to be skeptical of the police. You are not allowed to completely write them off. I call bullshit. It might not be as high as 75% but it's high. In the UK false rape accusations are so common that police now demand that \"alleged\" victims hand over their phones when making an accusation that can check to see if they texted the accused the following morning something like, \"Thank you for the great sex last night.\" \n\n&#x200B;\n\n>Though most rational people don't see this as such a major issues within far conservatism and the Manosphere you tend to see false accusations be pushed as the major issue against men. In fact I decided to do my own study where I went to [r/MenRights](https://www.reddit.com/r/MenRights/) typed it \"Rape\" and look at the 102 top posts by [r/menrights](https://www.reddit.com/r/menrights/) on the subject. I only accepted posts of two categories, male victims of sexual assault and stories on false rape accusations. As expected [r/MenRights](https://www.reddit.com/r/MenRights/) had more posts about false rape then male victims of rape.\n\nStop kidding yourself. False rape accusations are a HUGE concern for men. Innocence is no defense against a rape accusation. Your life, your reputation, your friends, you family, your career, your honor, your legacy are all permanently and irrevocably damaged by a false rape accusation. It's shameful. \n\n&#x200B;\n\n>As you can see despite the fact that men are [1 in 33 in odds of being raped, that 1 in 10 rape victims are male](https://www.rainn.org/statistics/victims-sexual-violence), and as stated before only 0.005% of rape accusations lead to a man being arrested as stated above. MRAs post more about and care more about false rape accusations then male victims of sexual assault. Why is that? Why do we even talk about false rape so much if its more rare than males being raped? I get a suspicion that plenty who champion this cause are arguing disingenuously.\n\nInteresting that he mentions a man being arrested but how come so few women are arrest for rape even though there are multiple studies going back to the 1980s indicating it's massively underreported. \n\n&#x200B;\n\nFalse Rape accusations are not RARE. They are AT LEAST 2-11 percent of all rape accusations taken to the police. I'd bet that number is much higher since the #metoo movement when every single sociopathic liar KNOWS that they will be #believed. Oftentimes in spite of evidence. \n\n&#x200B;\n\nFalse Accusations are rampant enough that only segregation can solve it\n\n>Yeaaaa... This covers harassment as well. Plenty of people have been using the fear of false rape accusations against men as proof that women should be \"isolated\". [They also openly brag to each other that they \"won't hire more qualified women because I am too scared of a lawsuit\"](https://youtu.be/dHiAls8loz4?t=87). As stated before the case of someone falsely accusing someone else in the workplace environment is ultra rare as most false rapes come from children or the homeless, and the vast majority don't name suspects. If anything men should be worried about sexual harassment from coworkers as it is way [more statistically likely that men will be a victim of sexual harassment](https://www.washingtonpost.com/local/social-issues/men-account-for-nearly-1-in-5-complaints-of-workplace-sexual-harassment-with-the-eeoc/2018/04/08/4f7a2572-3372-11e8-94fa-32d48460b955_story.html?noredirect=on&utm_term=.06fb338bce7a) then falsely accuse of harassment themselves.\n\nChoose one.\n\nAdopt a #Believewomen policy and eliminated due process for men in the workplace. \n\nOr demand that women be hired at equal rates as men. \n\n&#x200B;\n\n>False Rape Accusers should get same length sentence as Rapists  \n>  \n>This is a common cry for those within the MRA movement is that these false accusers are getting off to easy. That they ruin countless men lives and only get slap of the wrists. But that shows a great error in their thinking is the trust that the criminal justice system gives just punishments to rapists in the first place. If we are going to punish false accusers the same way that we do punish rapists then false accusers should get:  \n>  \n>[10 Years of probation](https://www.cbsnews.com/news/former-houston-doctor-convicted-of-sexually-assaulting-patient-gets-probation-2018-08-19/)  \n>  \n>[3 Months of Jail](https://en.wikipedia.org/wiki/People_v._Turner#Sentencing)  \n>  \n>[5 Years of probation](http://www.kdrv.com/content/news/Medford-Man-Sentenced-to-Probation-for-Rape-of-Middle-School-Girls-492038491.html)\n\n&#x200B;\n\nInstead of listing three anecdotes, how about some actual data?\n\n \"**Prison sentences** for **rape** are not uniform. A study made by the U.S. Department of Justice of **prison** releases in 1992, involving about 80 percent of the **prison** population, found that the **average sentence** for **convicted** rapists was 9.8 years, while the actual time served was 5.4 years. \"\n\nBut just for fun, let's look at three false rape accusations that resulted in jail time:\n\n Colo. man imprisoned for 28 years after woman dreamed he raped her expected to be freed after convicted rapist admits to crime, \n\n [https://www.nydailynews.com/news/crime/new-trial-man-jailed-28-years-dream-rape-claim-article-1.2469667](https://www.nydailynews.com/news/crime/new-trial-man-jailed-28-years-dream-rape-claim-article-1.2469667) \n\n Accused Of Florida Rape 70 Years Ago, 4 Black Men Get Posthumous Pardons\n\n [https://www.npr.org/2019/01/11/684540515/accused-of-florida-rape-70-years-ago-4-black-men-get-posthumous-pardons](https://www.npr.org/2019/01/11/684540515/accused-of-florida-rape-70-years-ago-4-black-men-get-posthumous-pardons) \n\nLest we forget Emmett Till\n\n [https://en.wikipedia.org/wiki/Emmett\\_Till](https://en.wikipedia.org/wiki/Emmett_Till) \n\n&#x200B;\n\n&#x200B;\n\n>That of course doesn't count the countless who have sexually assaulted and get away with it. If MRAs called for this guideline I can't help to feel they would be even more disappointed in the sentencing expecting 20 years but IRL only getting a few months. If we treated false rape accusers the same as rapists then we as a society wouldn't take them that seriously.\n\nFor both men and for women. Countless women who have sexually assaulted and gotten away with it. \n\n&#x200B;\n\n>Also I want to quickly address the other MRAs call for those who have been falsely accused to be placed on the Sex Offender Registry Lists. Uuuuuuuhhh What?!? This is improper use of such a list number 1, and 2 that publicly available list would then create a public list of people you can rape without repercussions. Think about it. If you publicly branded people as \"False Rape Accuser\" then which people would rapists target?\n\n&#x200B;\n\nI'm actually opposed to the Sex Offender Registry Lists as they currently stand in our country. Female Pedophiles are very often offered a plea deal to stay off the registry.\n\n&#x200B;\n\n&#x200B;\n\n>Putting extra laws and punishments on this mush smaller issue of False Rape Accusations put more pressure on legitimate victims of sexual assault. Under the existing law there are cases of legit victims being classified by police as false victims. If you add additional punishment then we will punish legitimate victims of rape 20 years in prison for just reporting their rape and police not believing in them. And that will have a chilling effect on the rest of victims of sexual assault out there. Its hard enough as is, but if you are unable to prove it and you \"act like a slut\" then you could face jail time\n\nThis is just as true for rape victims. The UK is seeing an influx of innocent men convicted of rape because of horrible #believewomen policies. It is an actual nightmare. \n\nI think false rape accusations need to be rigorously prosecuted when there is substantial evidence of malicious intent. Just because the defendant is not convicted doesn't mean it was a false rape accusation. But in many cases, there is evidence of clear malicious intent, yet the false accuser is not punished, \"lest we discourage others from coming forward.\" (Other false accusers?)\n\n [https://metro.co.uk/2017/09/27/man-cleared-of-rape-after-victim-said-ill-ring-police-tomorrow-its-going-to-be-fun-6958964/amp/?ito=article.amp.share.top.twitter&\\_\\_twitter\\_impression=true](https://metro.co.uk/2017/09/27/man-cleared-of-rape-after-victim-said-ill-ring-police-tomorrow-its-going-to-be-fun-6958964/amp/?ito=article.amp.share.top.twitter&__twitter_impression=true) \n\n&#x200B;\n\nAlso check out r/falserapeaccusations\n\n&#x200B;\n\n&#x200B;\n\n>Conclusion\n\n&#x200B;\n\n>That's why [r/MenRights](https://www.reddit.com/r/MenRights/) and Reddit as a whole under reports on male victims of rape. Because admitting that rape of men is a common thing only helps prove that rape in general is a very common affair and that the 1 in 6 statistic was right the whole time. That Rape is a real problem in western society and forces them to stop ignoring it.\n\n&#x200B;\n\nMultiple written lies have been told by the author of this post. When it was first posted, a great many redditors pointed out how poorly his math was put together. Instead of changing or editing his post, he merely deleted the comments. That is called suppression of the truth and it makes you a bad person.  \n\n&#x200B;\n\nNo one is denying that rape is a serious issue. The good news is that according to the BOJ, rape, along with other violent crimes has been dropping steadily since the 1960s. In 2012 the number pivoted because for the first time in USA history, the FBI legally acknowledged that men can be raped. Unfortunately it has been worded such that female on male \"made to penetrate\" sexual assault is still not rape. Women can only rape men if they anally penetrate them. We still have a long way to go for true gender equality. \n\n&#x200B;\n\nSo remember this TL;DR when you think about False Rape Accusations.\n\n>TL;DR  \n>  \n>For both genders you are way more likely to be raped then falsely accused of rape.\n\nNobody actually knows how likely you are to be falsely accused of rape. At a minimum, 2-11 percent of rape accusations made to the police are false. Probably the number is closer to 1 in 4 due to hard forensic evidence of backtested rapekits that excluded the primary suspect, (as fingered by the alleged victim,) 23% of the time. But we don't really know. It's probably safe to say that you are more at risk of being false accused of rape in 2019 than at any other time in human history because of the public demonstrations of #believewomen. Many still believe Ford's accusations against Kavanugh despite being thoroughly discredited by Leland Keyser. [https://www.washingtonexaminer.com/news/just-didnt-make-any-sense-leland-keyser-now-challenges-story-of-kavanaugh-accuser-christine-blasey-ford](https://www.washingtonexaminer.com/news/just-didnt-make-any-sense-leland-keyser-now-challenges-story-of-kavanaugh-accuser-christine-blasey-ford) \n\n\" **I don’t have any confidence in the story,” Keyser told** ***New York Times*** **reporters Robin Pogrebin and Kate Kelly**  \n\n **\"Those facts together I don't recollect, and it just didn't make any sense,\" Keyser told the authors.** \n\n **\"It would be impossible for me to be the only girl at a get-together with three guys, have her leave, and then not figure out how she's getting home,\" Keyser told Pogrebin and Kelly. \"I just really didn't have confidence in the story.\"** \n\n **A few days** [**before the hearing**](https://www.cnn.com/2018/09/22/politics/kavanaugh-ford-accuser-nomination/index.html)**, Keyser’s attorney said, “Simply put, Ms. Keyser does not know Mr. Kavanaugh and she has no recollection of ever being at a party or gathering where he was present, with, or without, Dr. Ford.”**\n\n**\"Keyser later said she felt pressure by both \\[Ford classmate Lucy\\] Gonella and Ford's friend Monica McLean to change her story,\" Pogrebin and Kelly wrote.**\n\n**\"I was told behind the scenes that certain things could spread about me if I didn't comply,\" Keyser told the authors.**\n\n&#x200B;\n\n\\#metoo has already been politically weaponized. This is ridiculous. WE are being gaslighted. This is bullshit.\n\n&#x200B;\n\n>The estimated number of false rape accusations are around 2-10% at the highest.\n\nThis is a lie on several levels. It's 2-11%. And that is a minimum. And that's if you only consider surveys conducted by feminists or women's advocates.\n\n&#x200B;\n\n>For 216 False Rape Accusations only 39 named suspects, and only 2 got charged. That means that only 18% of False Rape Accusations actually accuse someone and that only 0.9% of false rape accusations ended up on court.\n\nI'm pretty sure this stat is referring to how many false rape accusers got charged. So now you are just making up numbers. You are either lying or grossly mistaken. \n\n&#x200B;\n\n>Vast majority of false rape accusations are made by Teenagers, Parents of Children, and the Homeless.\n\nThere's no way to know this. And there is also no citation. \n\n&#x200B;\n\n>55% of False Rape Accusations are in hopes of getting free medical treatment. Next major category is from teenagers justifying their absences to parents.\n\nDid I miss the source for this. Why are you ignoring De Zutter (2017)?\n\n&#x200B;\n\ntl;dr #metoo is a puritanical, sexist witchhunt that strips men of due process while refusing to hold women to the same standards, as per Asia Argento, Katy Perry, and Amber Heard. It's is a moral panic. Much like McCarthyism we will look back on #metoo with a deep sense of shame for vigilante mob justice conducted in the name of false rape accsusations.",
    "title": "I call Bullshit on the False rape accusation sticky from Mens Lib sub. Actual lies are being told.",
    "subreddit": "MensRights",
    "timestamp": 1575621828,
    "score": 670,
    "keyword": "mixed race judge"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 511,
    "keyword": "mixed race judge"
  },
  {
    "text": "Fact Checking \"Fact Checking False Rape Accusations and Why We Shouldn't Fear a False Rape Epidemic.\" The following post was originally posted to r/MensLib to fact check one of their highest rated submissions of all time. This post was not allowed past mod filters and was promptly deleted from that sub. Here is the same post unedited. When this post refers to \"this subreddit\" it is referring to r/MensLib where it was originally posted:\n\n&#x200B;\n\nBefore I start I'd like to add a trigger warning for Sexual Assault Survivors. This post analyzes statistics on the subject of false rape accusations. This analysis is not meant to diminish the experiences of survivors or to call them into question, but to correct errors in statistics that are commonly used, especially since they are being propagated by this subreddit. I will add that unreported sexual assaults are rampant, and I have personal experience. That said, I cannot abide misusing statistics for any political reason. [Fact Checking False Rape Accusations and Why We Shouldn't Fear a False Rape Epidemic](https://www.reddit.com/r/MensLib/comments/9hraly/fact_checking_false_rape_accusations_and_why_we/)is currently the third highest post on [r/MensLib](https://www.reddit.com/r/MensLib). It is linked on the sidebar as a resource, has 3.7K upvotes and it's been quintuple gilded, and thus serves as a representation of what this sub is about.Given that this post is used as a resource, it's important to be self-critical to ensure this sub is not misrepresenting data. This post has some critical errors that must be remedied if it is going to continue to represent this sub. I will go through the entire post to point out inconsistencies, but I will start with the most glaring error\n\n# Do False Accusers Name Suspects?\n\nMuch of this post is built upon a [study of the attrition of rape cases from the British Home Office](https://webarchive.nationalarchives.gov.uk/20100408125722/http://www.homeoffice.gov.uk/rds/pdfs05/hors293.pdf). This post contains a section which talks about how false complainants are rarely charged for perverting the course of justice. From the study:\n\n>There were 216 cases classified as false allegations: as a proportion of all 2,643 cases reported to the police this amounts to 8 per cent; as a proportion of the 1,817 cases not proceeding beyond the police stage it is 12 per cent (see Table 4.2). In only six of these cases was there evidence of anyone being arrested, and in only two cases were charges laid, although there were at least 39 named suspects. Six advice files were submitted to CPS, **with respect to possible charges being laid against the complainant** for perverting the course of justice, and two were charged. (emphasis added)\n\nThe author of the original post uses this statistic about false accusers rarely being named as suspects to mean that false accusers rarely name suspects. From the OP:\n\n>out of the 216 cases of rape that was false in the UK, 126 of them have a formal complain **filed by the accuser**, 39 of them had a named suspect and only 6 of them were arrested. (emphasis added)Fact is that the majority of false rape accusations don't even name a suspect... Vast majority of false rape accusers always accuse a non existent stranger who raped them and usually not someone specifically... Which means that beyond wasting time and resources majority of false rape accusations are harmless to the general public because no one person is accused.For 216 False Rape Accusations only 39 named suspects, and only 2 got charged. That means that only 18% of False Rape Accusations actually accuse someone and that only 0.9% of false rape accusations ended up on court.\n\nThis misreading shows a blatant misunderstanding of police categorizations. By definition, cases that are categorized as \"False Allegations\" by the police cannot be cases that are cleared by arrest. These are two separate and distinct categories. The BHO study was talking about how often the false accuser gets charged. Much of the post uses this misreading to draw faulty conclusions. This is the main error in this post and it is a critical one. I believe this is a big enough error to qualify this post as \"spreading of false information\" if it remains pinned to the sidebar of this sub. As a further investigation though, I will go through the entire post line by line.\n\n# How Many False Rape Accusations are there?\n\nThe author cites the 2-10% statistic here. This statistic is problematic for a couple reasons. Firstly, the 2% number comes from a study which isn't talking about the percentage of accusations that are found to be false, but the number of false allegations that result in action against the false accuser. From [Heenan, M., & Murray, S. (2006). Study of reported rapes in Victoria, 2000-2003. Melbourne, Australia: Office of Women’s Policy, Department for Victorian Communities\"](http://www.austlii.edu.au/au/journals/CICrimJust/2012/4.pdf):\n\n>\" In 17 (2.1%) of cases, the case outcome was clearly categorized as a false report, and the alleged victim had either been charged or had been told that she (there were no male victims among these 17 cases) would be charged unless they desisted with the complaint. **There was a much larger proportion of cases where police were confident or reasonably confident that the allegations were false, but there was no attempt to institute charges against the alleged victim**.\" (emphasis added)\n\nAny citation of 2% that references this study is comparing apples to oranges. The citation from the Lonsway, Archambault, & Lisak study from 2009 is a much better representation of the actual number at 7.1%. According to the FBI this number is 8%. There is another problem with this statistic however, it's not properly qualified in the post. \"False Accusations\" in this context are cases that have been found through thorough police investigation to be false. This number does not in any way represent every case in which the accusation may have been fabricated. Generally there is not enough evidence to classify a case as false, even if it meets these qualifications. In order for a case to be classified as false it generally requires the accuser admit to fabricating the report. Here are factors that do not qualify a case as a false accusation (From [Lisak 2010](https://cdn.atixa.org/website-media/atixa.org/wp-content/uploads/2016/03/12193336/Lisak-False-Allegations-16-VAW-1318-2010.pdf)):\n\n* A case in which the victim decides not to cooperate with investigators\n* A case where the victim lies about certain aspects of the incident.\n* A case in which investigators decide that there is insufficient evidence to proceed toward a prosecution.\n\nThe amount of evidence needed to proceed to prosecution is \"[Probable Cause](https://www.law.cornell.edu/wex/probable_cause) (From the Legal Information Institute): \"a reasonable basis for believing that a crime may have been committed... Courts often adopt broad, flexible views of probable cause when the offenses are serious\"By claiming 2-10% of claims are false without qualification, the OP is wrongly insinuating that 90-98% of accusations are true. Here is the full breakdown of police disposition of cases from the [Lonsway, Archambault & Lisak study](https://www.evawintl.org/Library/DocumentLibraryHandler.ashx?id=1223):\n\n* Unfounded/False: 7.1% (thorough investigation revealed no crime occurred)\n* Unfounded/Baseless: 8.5% (accusation did not meet standards of a crime, criminal report)\n* Exceptionally Cleared: 17.9% (police exhausted all possible avenues but were unable to clear by arrest for outside reasons)\n* Cleared by Arrest: 20% (at least one person was arrested and charged with commission of an offense, and turned over to the court for prosecution).\n* Suspended/Inactivated: 28.6% (Accusation not pursued due to inability to name a subject, accuser non-cooperation, or not enough evidence to meet the qualification of probable cause)\n* Closed as an informational report: 17.9% (accusation did not meet the standards of a crime, non-criminal report)\n\n[Image](https://i.redd.it/2ppyb23ag4731.png)\n\nIt's misleading to cite the percentage of all accusations that are false, without qualifying that only 38% meet the standard of \"probable cause\".The OP also links a meta-analysis here, which uses the other studies in its analysis. This is basically \"double counting\" the other studies used. In other words the meta analysis does not offer further evidence, it only re-offers the same evidence. The other study linked by the OP seems to check out as the data comes straight from FBI statistics [(Ferguson, Malouff 2015)](https://link.springer.com/article/10.1007/s10508-015-0666-2).\n\n# How many people Falsely Accused of Rape actually go to Jail?\n\nThis section is completely flawed and must be completely scrapped if this post is to have any semblance of legitimacy.The section starts off by claiming the number of people that go to jail for false accusations is low because the number of people exonerated from jail for sex crimes is low. This logic does not follow because those exonerated are only a percentage of those in jail for false accusations and it's impossible to know that ratio. The [British Home Office study](https://webarchive.nationalarchives.gov.uk/20100408125722/http://www.homeoffice.gov.uk/rds/pdfs05/hors293.pdf) is here linked for the first time where the OP claims that the report is talking about \"complaints filed by the accuser\", when it is really talking about charges filed by the police *against* the accuser. The OP links a \"study by the university of Pittsburgh\" as a second and separate source, which only links back to the BHO office study and is not it's own resource for the number quoted here by the OP. This is just a bad citation.\n\n>Fact is that the majority of false rape accusations don't even name a suspect.\n\nThis statement is just blatantly false. It's technical true that NO false accusations charge the accused with a crime, using the police definition of false accusation used in all of the OP's citations. That's not what OP is trying to say though, and is clearly misusing the definition of \"false accusation\". A lot of math is presented here which is built on this critical misunderstanding of the BHO study. Also the OP claims that 10% false is the worst case, which again is misrepresenting the breakdown of police classifications. The worst case is that a large portion of those cases classified as \"baseless\" or \"suspended\" are fabricated.\n\n# Why False Rape Accusations happen?\n\nConsidering that so much of OP's argument is built on the [BHO study](https://webarchive.nationalarchives.gov.uk/20100408125722/http://www.homeoffice.gov.uk/rds/pdfs05/hors293.pdf), it's surprising that this study is not mentioned in this section. That study actually contains detailed information about why the false accusations were made:\n\n>the majority of cases in which the complainant themselves admitted the allegation was false could be categorized as the often quoted motives of ‘revenge’ (n=8) and ‘cover-up’ (n=25)\n\nOut of a total of 53 cases in which the accuser admitted to fabricating the complaint 47% were for a cover up, such as covering up an affair, and 15% were for revenge, such as hurting an ex-partner.**The OP blatantly lies here** by claiming that 55% of False Allegations according to an [LAPD review](https://www.ncjrs.gov/pdffiles1/nij/grants/237582.pdf) are for \"getting medical care or psychiatric medication by the poor and destitute.\"From the LAPD review:\n\n>**Only six cases (10.9%) were primarily motivated by a desire to seek medical attention or a need for medication**\n\nHere is the break down from the linked LAPD review:\n\n* To provide an alibi or avoid trouble: 40% (missed curfew or was breaking the law: 23.6%, unfaithful to partner: 16.4%)\n* Anger or Revenge: 23.6% \n* Attention or Sympathy: 41.8% (medical: 10.9%, Personal: 30.9%)\n* Mental illness: 32.7%\n* Regret/Guilt: 12.7%\n* Victim Never Alleged Rape: 3.6%\n* Unable to Classify: 9.1%\n* Multiple Motives: 50.1%\n\n\\*motivations are not mutually exclusive\n\nThe OP claims that the providing an alibi category is mostly teens trying to get out of trouble with parents but 41% of the cases in this category were to provide an alibi for cheating on a partner.\n\n>Instead it is usually either the very poor looking for free medication, teenagers trying to get out of trouble and parents of children who make the vast majority of False Rape Accusations.\n\nThis is a misrepresentation. Even if each of the cases were mutually exclusive, which they aren't, alibi for missed curfew or breaking the law (13) and people seeking free medication (6) would only make up 34.5% of cases. Also the \"missed curfew or breaking the law\" category also is not exclusively made up of adolescents trying to get out of trouble.The omission of the largest categories: rape allegation to garner attention or sympathy: 30.9%, Mental Illness 32.7%, anger or revenge 23.6%, qualifies as lying by omission. The OP also claims that \"half the false rape accusations are made by parents of children\". The link here is broken and I could not dig into this claim, but this claim is not supported by any of the other studies cited in this post. OP Claims:\n\n>Also there are no corolations with the age of the accusation or the number of sexual partners of the accuser and wither their accusations are true or not.\n\nWith no citation. I assume the OP means \"age of the accuser\", but the OP could mean delay in reporting. If the OP means age of the accuser this does not match the British Home Office Study which states:\n\n>Cases involving 16- to 25-year-olds accounted for a higher proportion of cases designated false (52%, n=112) than of cases that proceeded (42%, n=221).\n\nIf the OP means the delay in reporting an accusation I cannot find any research on the relationship between these two factors.From OP:\n\n>[most legitimate victims lie to themselves and others saying that they weren't sexually assaulted when they really were](http://journals.sagepub.com/doi/pdf/10.1177/0886260517726412?casa_token=TR0lDTFQ-9cAAAAA%3AXFQbcARRx9QC1UnefnGp3FIc0pMTR4K5X-49EvzFMnXxeQxUba98DKlj4DcWjJOvFeihHXQTGwd5Vw&)\n\nOP sites [an article](https://journals.sagepub.com/doi/pdf/10.1177/0886260517726412?casa_token=TR0lDTFQ-9cAAAAA%3AXFQbcARRx9QC1UnefnGp3FIc0pMTR4K5X-49EvzFMnXxeQxUba98DKlj4DcWjJOvFeihHXQTGwd5Vw) about \"legitimate victims\" but this study has no qualifications of the victims as \"legitimate\", especially since they are \"lying to themselves and others\".\n\n# Why didn't you include those other \"Studies\"?\n\nOP notes that these studies often mis-characterize what qualifies as a false report, which is a legitimate problem in most of these studies. Again the problem is that since what qualifies as \"true\" is never defined, the numbers only serve as a sort of baseline and not a valid number to compare true to false. Many of these studies use different definitions and terminology, which is a legitimate reason not to include them in a particular amalgamation of studies, such as the 2-10% claim. However this does not completely invalidate the study. This OP misrepresents the Kanin study claiming Kanin considered a story false if the victim \"delayed reporting\" or \"was intoxicated\" or \"was determined to be a slut\".The Kanin study qualified an accusation as false ONLY if the accuser admitted to falsifying the report:\n\n>\"the complainant must admit that no rape had occurred. She is the sole agent who can say that the rape charge is false\".\n\nThe low sample size complaint for these reports is legitimate.\n\n# Using Fear as a Weapon\n\nThe conclusions in this section are based on the faulty math from a previous section.The OP uses exceptional cases for sentence length instead of citing average sentencing lengths. For reference the average sentence for convicted rapists is 9.8 years.\n\n# TL;DR\n\n* For both genders you are way more likely to be raped than falsely accused of rape. **Verdict: probable**, but not proven by the data cited in original post\n* The estimated number of false rape accusations are around 2-10% at the highest. **Verdict: False**. This is more accurately the lower bound for fabricated allegations\n* For 216 False Rape Accusations only 39 named suspects, and only 2 got charged. That means that only 18% of False Rape Accusations actually accuse someone and that only 0.9% of false rape accusations ended up on court. **Verdict: False.** this statistic is about how many false accusers are taken to court.\n* Vast majority of false rape accusations are made by Teenagers, Parents of Children, and the Homeless. **Verdict: False** the citation for this claim does not support this statement.\n* 55% of False Rape Accusations are in hopes of getting free medical treatment. Next major category is from teenagers justifying their absences to parents. **Verdict: False** The citation for this claim says 10.9% of accusations happen for free medical treatment. The highest category was garnering attention or sympathy.\n* Serial accusations and people accusing others to get a promotion or to cover for a failed test almost never happens. The individuals who do tend to have a clear cut history of other forms of fraud in their history and are usually legitimate victims of sexual assault as children. **Verdict:** **Unknown** There is no research in the original post about accusations that happen in these contexts. Most of the studies cited in the original post were concerning accusations that were reported to police. Accusations to get promotions or cover for a failed test are not necessarily accusations reported to police.\n* Accusations on decades old sexual assaults, Sexual Promiscuity and Self Denial are not indicative of a false rape accuser. **Verdict: Unknown** There is no information cited in the original post about the link between decades old assaults or sexual promiscuity and false allegations. The citation about self denial does not discuss whether or not this behavior is indicative of a false accusation.\n* Older studies on the issue tend to be unreliable due to the limited knowledge of rape and how victims act. **Verdict: False** Older studies use a different definitions for \"rape\" and \"false accusation\", but that does not necessarily mean that these studies are unreliable. It's important to know which definition a study is using when researching.\n* Police tend to accuse people of false accusations way more then there are false accusers due to use of pseudoscience equipment like the Polygraph or sexist beliefs like \"sluttyness\" **Verdict: False** while polygraphs were used in one single study, the polygraph was not used to judge whether statements made were true or false. Sexist beliefs may influence police categorizations of accusations, but many modern studies control for these influences.\n* Its more likely that police will dismiss a real victim of sexual assault as false then accuse someone falsely of sexual assault. **Verdict: Unknown** The main reason a case is classified as false is if the accuser admits to falsifying the report. A real victim is very unlikely to be classified as a false accuser. The standard for charging someone falsely is \"probable cause\" which is a relatively low standard.\n* The whole issue of False Rape Accusations have been hijacked by reactionaries as a vehicle to push for infringements of women rights. As the data shows the issue of false rape accusations are over hyped and the narrative spread on the internet just doesn't hold up. **Verdict: Mixed.** There are certainly some groups that want to hijack movements for their own means. Generally the issue of False Accusations is used to push for maintaining due process for the accused which is not the same as pushing for infringements of women rights. The data does not show that false accusations are over-hyped necessarily.\n\n# Conclusion\n\nFrankly this post is filled with misinformation. Some of this can be attributed to misreading studies, or misunderstanding certain terminology. However, much of this seems to be purposeful lying by omission or purposeful misrepresentation of data. This post ill-serves this subreddit as a linked resource on the sidebar and should be removed immediately.\n\nEDIT: formatting",
    "title": "Fact Checking \"Fact Checking False Rape Accusations and Why We Shouldn't Fear a False Rape Epidemic.\"",
    "subreddit": "MensRights",
    "timestamp": 1562023482,
    "score": 139,
    "keyword": "mixed race judge"
  },
  {
    "text": "Asian Students lose Harvard Affirmative actions lawsuit--affirmative action is legal and so likely also legal to 'discriminate against men' [Federal Judge Rules Against Asian Students In Harvard Race-Based Admissions Trial](https://www.dailycaller.com/2019/10/01/harvard-affirmative-action-ruling/)\n\naddendum on 2019/10/04:\n[Harvard Affirmative Action Case Will Go to SUPREME COURT](https://www.youtube.com/watch?v=X-oudkDw2SI)",
    "title": "Asian Students lose Harvard Affirmative actions lawsuit--affirmative action is legal and so likely also legal to 'discriminate against men'",
    "subreddit": "MensRights",
    "timestamp": 1570071287,
    "score": 103,
    "keyword": "mixed race judge"
  },
  {
    "text": "Feminism and the Duluth Model. Note: In this post the terms \"IPV/DV/PV\" are used interchangeably.\n\n**1) The Duluth Model: The predominant model of domestic violence.**\n\nIn 1981, the Domestic Abuse Intervention Program created the Duluth Model, which was a more structured approach to batterer treatment and it is usually credited as introducing domestic violence into society's mainstream conscience. \"The program was born from the creative energies of battered women and feminist activists, included members of EMERGE, one of the first batterer intervention programs in the country. 13 battered women from Duluth participated in creating the Duluth Model's Power and Control Wheel based on traits and behaviours specific to their own abusive husbands. Later, scientists tested the program's curriculum with a sample group of nine subjects, including five battered women and four abusive men, who had all participated in the program. Based on the results of the test, the Duluth Model emerged as one of the nation's most utilized models for batterer intervention programs.\"\n\n[https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr](https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr)\n\nBefore we move on, let's get something straight here since I've seen a lot of denial around it generally from people who support feminism: The Duluth Model is entirely based on feminist theory. In [this](https://tspace.library.utoronto.ca/bitstream/1807/10972/1/NQ28298.pdf) thesis written by Ellen Pence herself (she is the woman who is usually credited with creating the Duluth Model) in 1997, she says in pages 1 and 2:\n\n\"I am indebted to the Domestic Abuse Intervention Project (DAIP), where I have worked for 16 years. As a group we have been an important part of a historic social movement. We were the first grassroots group to break through the barrier of institutional resistance to establishing community-monitored interagency policies (including policies mandating arrest, promoting aggressive prosecution, imposing increasingly harsh penalties on repeat offenders, and **requiring a feminist based educational model for abusers**). This speaks to the excellence of our group as well as to that of the leaders in our police and court system. To my co-workers and the many practitioners who have lent to my experience and to this specific endeavour, I am eternally grateful.\"\n\nShe says right here that the model is feminist based. Now that we've got that out of the way, we can move on to the main bulk of this.\n\nThe Duluth Model characterises domestic violence as being a primarily male-perpetrated crime caused by \"patriarchal terrorism\", theorising that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. Supposedly, men who batter are using violence to to maintain their individual and societal patriarchal dominance over women.\n\nDAIP itself says of Duluth:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"We still live in a sexist society where women are devalued, where many men believe they are entitled to be in control in an intimate relationship, and where men who batter believe they have the right to use violence. While it is a goal to change the attitudes of men who batter, the ultimate goal of the Duluth Model has always been to ensure that victims are safer by having the state intervene to stop the violence and address the power imbalance inherent in relationships where one person has been systematically dominated and subjugated by another.\"\n\nIt's described in further detail in a 1993 book that Ellen Pence co-authored; [\"Education Groups For Men Who Batter: The Duluth Model.\"](https://books.google.com.au/books/about/Education_Groups_for_Men_Who_Batter.html?id=tJ189FTdO38C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) The book says:\n\n\"The tactics used by batterers reflect the tactics used by many groups or individuals in positions of power. Each of the tactics depicted on the Power and Control Wheel are typical of behaviors used by groups of people who dominate others. They are the tactics employed to sustain racism, ageism, classism, heterosexism, anti-Semitism, and many other forms of group domination. Men in particular are taught these tactics in both their families of origin and through their experiences in a culture that teaches men to dominate. ...We use gender-specific terms not only because the curriculum is for men who batter, but because battering is not a gender-neutral issue.\"\n\nThe Duluth Model's Power and Control Wheel details the tactics that are used to sustain an abusive partner's control over an abuser.\n\n[https://www.theduluthmodel.org/wheels/](https://www.theduluthmodel.org/wheels/)\n\n* Physical and Sexual Violence (outer ring)\n* Using Intimidation\n* Using Emotional Abuse\n* Using Isolation\n* Minimizing, Denying and Blaming\n* Using Children\n* Using Male Privilege\n* Using Economic Abuse\n* Using Coercion and Threats\n\n[https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf](https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf)\n\nThe Duluth Model currently reigns as the most commonly state-mandated model of intervention. While many approaches to intervention include a mix of the Duluth Model's feminist analysis of DV and cognitive behavioural therapy (which is a more holistically-oriented approach to DV that maintains that DV is associated with cognitive distortions and faulty attitudes and beliefs), most existing intervention programs as well as state laws and guidelines that regulate IPV intervention still espouse key aspects of feminist perspectives on IPV etiology and intervention.\n\n**2) Gender symmetry in DV: The evidence and the denial.**\n\nHowever, more and more studies have come up showing gender symmetry in DV.\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf)\n\n\"More than 200 studies have found that men and women perpetrate partner violence at approximately equal rates and that the most prevalent pattern is mutual violence (Archer, 2002; Fiebert, 2004). Moreover, when it is not mutual, female-only and male\\~only partner violence occur with about equal frequency among married couples (K. L. Anderson, 2002; Capaldi & Owen, 2001; Gelles & Straus, 1988; Kessler, Molnar, Feurer, & Appelbaum, 2001; McCarroll, Ursano, Fan, & Newby, 2004; Medeiros & Straus, 2007; Moffitt, Caspi, Rutter, & Silva, 2001; Straus, Gelles, & Steinmetz, 2006; Williams & Frieze, 2005). Among young couples and dating couples, the percentage of female-only partner violence exceeds the percentage of male- only partner violence (Straus & Ramirez, 2007; Whitaker, Haileyesus, Swahn,& Saltzman, 2007). This pattern of gender symmetry is true even for severe partner violence, such as kicking, attacks with objects, and choking. However, the injury rate is much higher when the perpetrator is male (Gelles & Straus, 1988). Police statistics and crime survey statistics seem to contradict the idea of gender symmetty because 80% to 99% of the perpetrators identified in such surveys are men (Straus, 1999). This is not because of higher numbers of physical attacks by men but because of the greater probability of injury from attacks by men and greater fear for safety by women (Straus, 1999). These are characteristics that lead to police intervention. Such cases are mistakenly taken as representative of partner violence, even though at least 95% of partner violence cases are not known to the police (Kaufman Kantor & Straus, 1990; Statistics Canada, 2005).\"\n\nAnd...\n\n\"Not only do men and women tend to perpetrate physical partner violence at about equal rates, but they tend to do so for similar reasons. The most commonly reported proximate motivations for use of violence among both men and women are coercion, anger, and punishing misbehavior by their partner (Cascardi & Vivian, 1995; Follingstad, Wright, Lloyd, & Sebastian, 1991; Kernsmith, 2005; Stets & Hammons, 2002). For example, Pearson (1997) reported that 90% of the women she studied assaulted their partner because they were furious, jealous, or frustrated. The motive of self-defense, which has often been put forward as an explanation for high rates of female violence, explains only a small proportion of partner violence perpetrated by women (and men; Carrado, George, Loxam, Jones, & Templar, 1996; Felson & Messner, 1998; Pearson, 1997; Sarantakos, 1998; Sommer, 1996). For example, using a college student population, Follingstad ot al. (1991) found that perpetrators reported that their motivation was self-defensive about 18% of the time (17.7% for men, 18.5% for women). As violence becomes more severe, there are greater gender differences in the use of violence in self-defense; however, self-defense is still a motivation for a relatively small proportion of violence. For example, in a sample of couples presenting for marital therapy, Cascardi and Vivian (1995) found that 20% of wives and no husbands attributed their use of severe aggression to self-defense.\"\n\nOne study even showed that half (49.7%) of relationships which had violence were reciprocally violent, and that in nonreciprocally violent relationships, women were the perpetrators in more than 70% of the cases.\n\n[https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020](https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020)\n\nIn 1999, Ellen Pence, in her book [\"Coordinating Community Responses to Domestic Violence: Lessons from Duluth\"](https://books.google.com.au/books/about/Coordinating_Community_Responses_to_Dome.html?id=Vk_qT-apdT4C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) came out herself and admitted that she and the DAIP staff involved in Duluth were driven by ideology. In the chapter \"Some Thoughts On Philosophy\", she wrote:\n\n\"The Power and Control Wheel, which was developed by battered women attending women's groups, was originally a description of typical behaviours accompanying the violence. In effect it said \"When he is violent, he gets power and he gets control.\" Somewhere early in our organizing efforts, however, we changed the message to \"he is violent *in order to* get control or power.\" The difference is not semantic, it is ideological. Somewhere we shifted from understanding the violence as rooted in a sense of entitlement to rooted in a desire for power. By determining that the need or desire for power was the motivating force behind battering, we created a conceptual framework that, in fact, did not fit the lived experience of many of the men and women we were working with. The DAIP staff - like the therapist insisting it was an anger control problem, or the judge wanting to see it as an alcohol problem, or the defense attorney arguing that it was a defective wife problem - remained undaunted by the difference in our theory and the actual experiences of those we were working with. We all engaged in ideological practices and claimed them to be neutral observations.\"\n\n\"Eventually, we began to give into the process that is the heart of the Duluth model: interagency communication based on discussions of real cases. It was the cases themselves that created the chink in each of our theoretical suits of armor. Speaking for myself, I found that many of the men I interviewed did not seem to articulate a desire for power over their partner. Although I relentlessly took every opportunity to point out to men in the groups that they were so motivated and merely in denial, the fact that few men ever articulated such a desire went unnoticed by me and many of my coworkers. Eventually, we realised that we were finding what we had already predetermined to find.\"\n\nSo even Ellen Pence herself outlined the limitations of the Duluth Model and acknowledged that she and her coworkers had created a conceptual framework that was inadequate in describing DV.\n\nHowever, the conception that DV is a primarily male-perpetrated crime which is an outgrowth of normal male behaviour and socialisation still persists, and people who challenge Duluth's characterisation of DV face extreme backlash.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n\"Suzanne Steinmetz made the mistake of publishing a book and articles (Steinmetz, 1977; Steinmetz, 1977-1978) which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware. Twenty years later the same processes resulted in a lecturer at the University of Manitoba whose dissertation found gender symmetry in PV being denied promotion and tenure.\"\n\n\"A PhD student working with Straus was warned at a conference that she will never get a job if she does her PhD research with him. At the University of Massachusetts, Straus was prevented from speaking by shouts and stomping. At two hearings held by the Canadian Commission On Violence Against Women the chairperson stated that nothing Murray Straus publishes can be believed because he is a wife-beater and sexually exploits students (Toronto Magazine article, ??). When Straus was elected President of the Society For the Study Of Social Problems, a group of members occupied the first few rows of the auditorium and, at the start of the presidential address, stood up and walked out.\"\n\n\"As a result of these types of harassment, there is widespread self-censorship by authors who fear that publishing politically incorrect data will undermine their reputation, or in the case of graduate students, their ability to obtain a job.\"\n\nSo despite all the evidence proving that DV is a crime that can be committed by both genders and that men and women who commit DV both share similar motivations, the Duluth Model is still very frequently used and widely accepted.\n\nEDIT: You know what, I'm including more.\n\n**3) The VAWA and a lack of services for abused men.**\n\nAs a result of this erroneous viewpoint that Duluth has created, male victims of domestic violence struggle to obtain services. Most resources are allocated to helping female victims of DV and much less for men.\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\nThe Violence Against Women Act is the centre of controversy, with a lot of complaints being made about sex-based discrimination by VAWA-funded programs. Technically, anti-discrimination provisions apply to the Violence Against Women Act, and the 2005 renewal of VAWA added this requirement:\n\n\"Nothing in this title shall be construed to prohibit male victims of domestic violence, dating violence, sexual assault, and stalking from receiving benefits and services under this title. 16\"\n\nHowever, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature:\n\n* \"In 2002, the OVW instructed the Delaware Domestic Violence coordinating council that, “states must fund only programs that focus on violence against women.”17\"\n* \"Department of Justice (DoJ) research solicitations have explicitly excluded applications that focus on male victims. One Solicitation for Proposals from the DoJ National Institute of Justice specifically prohibited “proposals for research on intimate partner violence against, or stalking of males of any age…”18\"\n\nAnd...\n\n\"Given these federal actions, it is not surprising that state-level governmental programs follow suit\":\n\n\"In Texas, an application for a program serving male victims was turned down because “programs that focus on children and/or men” were deemed ineligible.20 The next year, a grant application kit from the Texas Criminal Justice Division used identical words to reiterate the exclusion: “Programs that focus on children and/or men.”21\"\n\n\"Likewise, the OVW awarded $3 million to Baylor University to establish the Faith and Community Technical Support (FACTS) program designed to reduce domestic violence in rural communities. In 2006 the FACTS program issued a grant solicitation stating, “As with previous VAWA methods, it is assumed that … all victim data reported is about victimized women.”22 One of the questions on the FACTS grant application asks, “Number of years organization has spent working on violence against women issues.\"\n\nIn 2007, a letter was sent to the Office on Violence Against Women under the Freedom of Information Act (FOIA) requesting the OVW provide \"sex-specific utilisation data for each of the following grant programs\":\n\n1. Transitional Housing Program\n2. Rural Domestic Violence and Child Victimization Enforcement Grant Program\n3. Legal Assistance for Victims Program\n4. Stop Violence Against Indian Women\n5. Grants to Encourage Arrest Policies and Enforcement of Protection Orders\n6. Grants to Reduce Violent Crimes Against Women on Campuses\n7. Services, Training, Officers, and Prosecutors (STOP) Violence Against Women Formula Grant Program\n\n\"Overall, only 9.7% of persons receiving help were male victims, the remaining 90.3% being female victims. The percentages of male victims for the Legal Assistance for Victims and Transitional Housing programs were much lower – 3.9% and 0.4% respectively.49\"\n\nIn accordance with this, the experiences of men who attempt to seek help for domestic violence through formal resources have largely been negative. From a study of U.S. men who have sustained domestic violence from their female partners:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\n\"Qualitative research has documented the experiences of men who seek help for female-to-male IPV (Cook 2009; Hines et al. 2007). For example, Cook (2009) performed in depth interviews of 30 men who sustained all types of IPV from their female partners and tried to seek help. This work shows that men often experience barriers when seeking help. When calling domestic violence hotlines, for instance, men who sustained all types of IPV report that the hotline workers say that they only help women, infer or explicitly state that the men must be the actual instigators of the violence, or ridicule them. Male helpseekers also report that hotlines will sometimes refer them to batterers’ programs. Some men have reported that when they call the police during an incident in which their female partners are violent, the police sometimes fail to respond. Other men reported being ridiculed by the police or being incorrectly arrested as the primary aggressor. Within the judicial system, some men who sustained IPV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of IPV and abusing their children. According to some, the burden of proof for male IPV victims may be especially high (Cook 2009).\"\n\nAnd...\n\n\"We found that men who sustain IPV seek help from a variety of resources, most typically from informal resources, such as family, friends, and the Internet, and the formal resource of a mental health professional. Family and friends were overwhelmingly reported as being the most helpful resource, and mental health and medical professionals were rated as being among the most helpful of the formal resources. These professionals were reported to have taken the male victims seriously and to inquire about the origin of the men’s injuries. The resources providing the least support to men seeking help for IPV victimization are those that are the core of the DV service system: DV agencies, DV hotlines, and the police. On the one hand, about 25% of men who sought help from DV hotlines were connected with resources that were helpful. On the other hand, nearly 67% of men reported that these DV agencies and hotline were not at all helpful. Many reported being turned away. The qualitative accounts in our research tell a story of male helpseekers who are often doubted, ridiculed, and given false information. Thus, our hypotheses that men who would have largely negative experiences with formal resources were supported, which is consistent with prior qualitative research (Cook 2009; Hines et al. 2007).\"\n\n\"These findings are in stark contrast to ratings of social services by battered women. For example, in a study of 119 women who sought services for DV-related concerns from a DV shelter, 89% of the clients believed that they were helped by the services that they received and 84% reported that they felt better because of these services (McNamara et al. 2008). These findings are similar to a study which examined women’s impressions of a hospital-based DV support group (Norton and Schauer 1997). Of the 59 women in this study, 95% reported that they were mostly or very satisfied with the services that they received. Their reasons for satisfaction included that the group leaders were supportive, they were able to hear about other women’s experiences with abuse and were supported by them, they received referrals for additional support/services and they were able to learn about DV. These findings are consistent with other literature which states that women are often very satisfied with the services that they have received for IPV (Bowker and Maurer 1985; McNamara et al. 1997; Molina et al. 2009). Similar results with regard to satisfaction among battered women have been found in relation to police assistance. For example, one study of 95 female IPV victims indicated that the female victims found the police to be very helpful and 80% would contact the police again for assistance (Apsler et al. 2003).\"\n\nSo male victims are largely marginalised.\n\n**4) Mandatory Arrest Laws and Predominant Aggressor Policies.**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV. Statutes in numerous states directed police officers to undergo training on domestic violence and victim assistance and limited their discretion.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n\"Under the assumption that intimidated witnesses are reluctant to testify against their abuser, district attorneys began to adopt “no-drop” prosecution that circumvented victim cooperation. The 23 states that call for *mandatory arrest* allow the least amount of discretion, with statute language that ranges from vague, as in Colorado (“probable cause to believe a crime of domestic violence was committed”), to more specific, as in Washington where police can arrest when there is probable cause to believe a person 16 years or older within A, B, C, D, E the previous 4 hours assaulted a family or household member and believes (1) felonious assault occurred, or (2) assault resulting in bodily injury occurred whether injury is visible or not, or (3) any physical action occurred which was intended to cause reasonable fear of imminent serious bodily injury or death. (Hirschel, 2008, pp. 19–20)\".\"\n\nAnd when mandatory arrest laws were instituted, the arrests of women *skyrocketed.*\n\n\"In California, men in 1987 were arrested at a rate of 247 per 100,000, whereas women were arrested at a rate of 74.8 per 100,000. By 1997, the rates had increased only 136% for men, or up to 338 arrests per 100,000, but as much as 500% for women (DeLeon-Granados, Wells, & Binsbacher, 2006). Feminists welcomed the rise in male arrests. However, despite evidence that “political and/or organisational pressure may discourage officers from arresting women as aggressors” (Hirschel & Buzawa, 2009, p. 5), they found the sharper spike in female arrests of concern.\"\n\nSo, in order to counter this, feminists worked with policy makers to institute \"predominant aggressor\" guidelines which allegedly attempted to curb the arrest of victims by taking into account the “relationship behind the assault”.\n\nTo anyone denying that predominant aggressor guidelines have anything to do with Duluth's feminist analysis of DV or feminism, DAIP (remember: birthplace of the Duluth Model) itself states:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"Doing away with **pro-arrest policies targeting the predominant aggressor (a core component of the Duluth Model)** reduces the total number of arrests but increases the proportion of dual arrests. Dual arrests have proven ineffective in stopping violence, and they also have the unfortunate consequence of making victims more reluctant to call the police when further acts of violence occur.\"\n\nSo there you go.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\nCalifornia is one of several states that defines the dominant aggressor not as the first aggressor but rather the most “significant,” a sharp deviation from accepted police practice in responding to other crimes. As specified under state law and found in the domestic violence section of the Peace Officer Standards and Training (POST) manual, here are the factors taken into account when determining the predominant aggressor.\n\n* Age, weight, and height of the parties;\n* Criminal history;\n* Domestic violence history, including convictions and probation;\n* Strength, special skills (e.g., martial arts, boxing);\n* Use of weapons;\n* Offensive and defensive injuries;\n* Seriousness of injuries;\n* Use of alcohol and drugs;\n* Who called 911;\n* Who is in fear;\n* Presence of behaviors of power and control in the relationship;\n* Detail of statement;\n* Demeanor of the parties; and\n* Existence of corroborating evidence (California Commission on POST, 2010, pp. 3–5, 3–6)\n\nNone of these criteria are openly anti-male, but there are some bits that are prejudicial to men as a result of the criteria that was selected in determining the predominant aggressor.\n\n\"Again, many of these factors are vague, not easily interpreted and of dubious value. “Age, weight, and height of the parties,” and martial arts training are only relevant if the individual actually uses these advantages in an aggressive way. Men are usually bigger and stronger than women are, but most men do not abuse their partners, and there is no correlation in the general population between a person’s size and strength and the extent to which they abuse intimate partners, including among same-sex couples (Renzetti, 1992). When men are assaulted, they often refrain from striking back, both out of fear of being arrested and the code of chivalry. ... A man who is larger and stronger than his partner may have the *potential* of causing greater physical damage, but this factor is irrelevant unless he actually uses this to his advantage, just as the smaller woman has the *potential* to obtain a gun and kill him. The reader will notice that for weapons, officers are asked to consider their *use*, but not so with size and strength. In this respect, there is reason to suspect that the choice of criteria may be prejudicial to men (Sacks, 2010).\"\n\nOn the other hand, how police are trained to identify the predominant aggressor is blatantly gender-biased.\n\nIn two official police training manuals, including the POST manual cited earlier (California Commission on POST, 2010):\n\n\"The POST manual contains sections that define domestic violence that discuss its impact on victims and instruct officers in a detailed manner on response and arrest procedures and the protection of victims. Brief case scenarios are presented for the purpose of illustration and to facilitate learning. ... The manual generously offers 50 such examples, in which one party abuses or otherwise acts aggressively toward the other. ... Of the 50 examples, *not a single one* depicts unilateral abuse by a female upon a male (see Table 1). ... The examples send out a clear message to law enforcement in California, the largest state with more than 10% of the U.S. population: Officers should concern themselves only with male-perpetrated violence.\"\n\n\"The Maine training program, *Identifying Predominant Aggressors in Domestic Violence Cases (Train-the-Trainer*), is a 2-to 4-hour presentation consisting of lectures, video scenarios, and group discussions from the Maine Criminal Justice Academy, the organization that conducts trainings for all law enforcement and corrections agencies in the state of Maine (Rogers & Faragher-Houghton, 2008, p. 3). More so than the POST training, the Maine curriculum focuses right from the start, in its definition of domestic violence, on the exclusive needs of female victims. Following an exposition on the evolution of the criminal justice response, trainees are presented eight examples (one involving a public disturbance; the others depicting a domestic violence incident between a man and a woman) and asked to decide which party is the predominant aggressor based on the state’s legal criteria (similar to California’s), and who to arrest. Trainees are then informed that in seven of those cases, it is the man who should be arrested. In the other case, there is no specific recommendation to arrest either the man or the woman, but the clear implication is that the man is the dominant aggressor.\"\n\nAnd...\n\n\"The gender bias found in both the California and Maine trainings is blatant, indeed. However, considering the process by which dominant aggressor laws were put on the books, one should hardly be surprised. Laws protecting victims from domestic abuse were enacted not by abused men or men’s rights groups or disinterested bureaucrats, but through the efforts of battered women’s advocates, some of whom had previously been victimized in their own lives, and by feminists concerned broadly with the oppression of women (Mills, 2003). It was feminists who fought for the creation of dominant aggressor guidelines, and they did so explicitly to stem the rising tide of female arrests, on the grounds that domestic violence is a *gendered* problem. This view, based on a feminist analysis of patriarchy and sometimes referred to as the *gender paradigm* (Dutton & Corvo, 2007; Dutton & Nicholls, 2005), has had a profound influence on policy and intervention.\"\n\n\"The existence of training bias and political activism only suggest—and do not prove—that police officers actually carry out arrests in a gender-biased manner, and clearly much more research is needed. However, there is evidence elsewhere in the criminal justice response to domestic violence of a clear political agenda, as evidenced by the tendency of police to dually arrest significantly more often when the male is the victim, compared to the female (Hirschel & Buzawa, 2009); the preferential granting of restraining orders to women relative to men in response to similar complaints (Muller, Desmarais, & Hamel, 2009); the failure of law enforcement to adequately inform male victims regarding community resources (Buzawa & Hotaling, 2006); and the proliferation of intervention programs based on a patriarchal theory (Dobash & Dobash, 1979; Pence & Paymar, 1993). In addition, telling is the official domestic violence training offered by the U.S. Victims of Crime office, whose training manual gives 11 examples of physical domestic violence and various power and control tactics. Of these 11 examples, 8 involve male-on-female battering, 2 involve female-on-female lesbian abuse, and 1 involves a male perpetrator and a victim whose gender is not specified (Office of Justice Programs, 2010). Once again, trainers are not able to imagine any scenario whatsoever in which the perpetrator is a woman and her victim is a man.\"\n\nSo this has been the unfortunate effect of the Duluth Model and the narrative that feminists have created and tried incredibly hard to maintain that it is primarily men who are the perpetrators of DV/IPV. And that they have successfully maintained, despite there being a massive body of evidence that disproves said narrative.",
    "title": "Feminism and the Duluth Model.",
    "subreddit": "MensRights",
    "timestamp": 1561084678,
    "score": 104,
    "keyword": "mixed race judge"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 45,
    "keyword": "mixed race judge"
  },
  {
    "text": "The role of false accusations during the temperance movement and in the lynching of blacks in the Deep South False accusations get a lot of attention, but much less attention has been given to how false accusations have helped shape history.  For example, false accusations have often been used to push a false victimisation narrative.  And the interaction between false accusations and false victimization narratives can be found throughout history.\n\nThis kind of argument should create more sympathy for the problem given that most people (feminists and SJWs included) already accept the historical narrative around these topics.  In fact, SJWs often go to great lengths to discuss the prison disparity among black people in terms of wrongful convictions.  The fact that many of those convictions were because of false accusations (including false accusations of sexual assault) seems to go over their heads.\n\n###**Temperance (prohibition)**\n\nAround the turn of the 20th century, the issue of temperance was split by gender.  Women usually supported it, and men were against it.  As a result, the early women's movement got involved.  In fact, their later support for suffrage was largely the result of their belief that women would vote in favor of prohibition (and not, for example, [in a belief that women were being oppressed](https://www.reddit.com/r/MensRights/comments/dxtdqd/addressing_a_few_foundational_assumptions_of/)).  Evidence for this comes from the fact that [most women who supported suffrage were against giving blacks the right to vote, including other black women](https://www.npr.org/2011/03/25/134849480/the-root-how-racism-tainted-womens-suffrage).\n\nThe main argument for temperance was that men who drank too much neglected their responsibilities to women.  A husband who drank too much would loose his job, he would neglect his children, and he would beat his wife. The narrative of female victimization was so powerful that some women [took it upon themselves to go around the country and start fights in bars](https://dp.la/primary-source-sets/women-and-the-temperance-movement).  The harm that women faced at the hands of drunk men, both real and imagined, was used to push their political narrative.\n\nOf course women eventually got their way.  Prohibition was established in 1920 and lasted for 13 years (and only ended because [women eventually changed their minds](https://books.google.com/books?id=7mc8QsyUMjAC&printsec=frontcover#v=onepage&q=Women's%20organization%20for%20national%20prohibition&f=false)).\n\nAnd this wouldn't be the last time that women's safety in society was used to outlaw a substance, either.\n\n###**The lynching of blacks in the Deep South**\n\nIf you were a black man living in the South, the last thing you wanted to do was get involved with a white woman.  Simply looking at a white woman could get you hung by a violent mob.  And while the lynching of blacks is usually seen as something that white men did to black men, the role of white women is often overlooked.\n\nSeveral studies reveal that white women were not only complacent in the lynching of blacks, but that they often took an active role in it. They would accuse black men of looking at them, of stalking them, and even of raping them.  Simply pointing their finger at a black man was enough to get him hung.\n\nOne prominent black woman who was alive at the time noticed this and took it upon herself to document and analyze hundreds of cases of lynchings.  What she found was that many lynchings were enabled by white women who spoke \"falsehoods\" about black men, and that most of their claims were dubious at best.  Even the judges who presided over these trials (when there even were trials) were said to know that the claims were false.\n\nHer stories can be found in *[The Red Record](https://archive.org/stream/theredrecord14977gut/14977.txt)*.  Another source on this topic is *The Killing Fields of the Deep South: The Market for Cotton and the Lynching of Blacks, 1882-1930*.  The role of feminists and the early women's movement (who at the time had close ties to the KKK), in enabling this can be found [here](https://docs.lib.purdue.edu/dissertations/AAI1469917/) and [here](https://digitalcommons.iwu.edu/cgi/viewcontent.cgi?article=1014&context=constructing).\n\nIn terms of numbers, *The Red Record* found that 36% of lynchings were motivated by accusations of rape (or attempted rape).  Allegations of rape, and the safety of white women, [definitely dominated the social narrative of the time](https://www.jstor.org/stable/25119509).  And let's not forget that sexual assault is not the only crime where false accusations can be found.\n\nWhile the lynchings eventually stopped, black men are still put in jail because of racially motivated allegations.  Recently the case of the \"[central park 5](https://en.wikipedia.org/wiki/Central_Park_jogger_case)\" made headlines due to the wrongful imprisonment of five young minority boys who were forced to confess to the rape of a white woman.\n\n###**The war on drugs**\n\nIt has been stated that many of our drugs laws were drawn up based on race.  White people drank alcohol and used tobacco, so that's why those substances are legal.  Black people used cocaine, and Hispanics smoked marijuana, so that's why those substances were outlawed (see: *[The New Jim Crow: Mass Incarceration in the Age of Colorblindness](https://en.wikipedia.org/wiki/The_New_Jim_Crow)* by  Michelle Alexander).\n\nOne piece of propaganda that was particularly effective was the claim that [black people would use cocaine and then run around raping white women](http://lh.journals.yorku.ca/index.php/lh/article/download/5410/4605).\n\n###**Most of the social narrative surrounding gender to this day is shaped by a victimization narrative**\n\nEverywhere you look people are trying to manufacture a victimization narrative.  And while some issues may be more legitimate than others, many are simply made up out of convenience.  It could be stated that feminism itself relies on a false victimization narrative.  The idea that women are oppressed through a patriarchal conspiracy follows a well established pattern that doesn't seem all that out of place given the historical context (and the parallels to the neo-Nazi rhetoric of a Jewocracy oppressing white people [hasn't exactly gone unnoticed](https://www.newstatesman.com/politics/feminism/2018/10/dog-rape-and-mein-kampf-feminist-text-why-we-hoaxed-journals-terrible) -- see also: https://www.reddit.com/r/Menkampf).\n\nPeople aren't shy to make false accusations when it benefits them.  While the rate of false accusations of rape is debatable, there are very clear statistics that indicate the extent of this happening in [divorce and child custody cases](https://quillette.com/2019/04/16/divorce-and-the-silver-bullet/).\n\n[False accusations of child abuse](http://ohiofamilyrights.com/Reports/Special-Reports-Page-3/Sexual-Abuse-Allegations-in-Divorce-and-Custody-Disputes.pdf) occur in about 6% of child custody cases, with 33% being provably false, and another 17% being baseless. [Allegations of domestic abuse](http://www.saveservices.org/downloads/False-DV-Allegations-Cost-20-Billion) occur in 25% of cases, with 70% being false. And it's estimated that [85% to 90% of restraining orders are completely without merit](https://www.huffpost.com/entry/order-of-protection-and-j_b_974970).\n\n[Most perpetrators of false accusations are women, and most victims are men](https://leb.fbi.gov/articles/featured-articles/false-allegations-of-adult-crimes) (about 80% of cases), and this contrasts strikingly against the fact that [women are just as abusive against men as the reverse](https://domesticviolenceresearch.org/domestic-violence-facts-and-statistics-at-a-glance/), [women rape men at a similar rate as the reverse](http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf), and [women abuse children at greater rates than men](https://www.ncbi.nlm.nih.gov/pubmed/16165212).\n\n###Why is the victimization narrative so successful?\n\nHumans have a biological imperative to listen to, and help women.  [Study](http://www.ncbi.nlm.nih.gov/pubmed/15491274) after [study](https://journals.sagepub.com/doi/pdf/10.1177/1948550616647448) after [study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5112287/) demonstrates how strong of a bias this is.  When a woman needs something, it is almost always the case that a man will get it for her.\n\nA man can claim a victimization status all he wants, but he will never get the same amount of attention that a woman would.  That's why you don't find as many men making false accusations as you do women.\n\nIn a lot of ways, the use of a victimization narrative to grant privileges to women is just a reflection of society acting this way in aggregate. And again, there are [studies](https://www.sciencedirect.com/science/article/pii/S0022103118304633) and [more studies](https://ideas.repec.org/p/hhs/nhheco/2019_006.html) indicating that this is likely the case.\n\nMany issues that men face in society are caused by this phenomenon. Men receive far less empathy than women do. And men are pushed aside, and are often harmed, to advance the privileges of women.\n\nAs such, the phenomenon of false allegations should be viewed through the wider lense of \"manufactured victimization\".  Its relationship to the empathy gap is also obvious, and that makes it a major force behind the wider persecution of men in society.",
    "title": "The role of false accusations during the temperance movement and in the lynching of blacks in the Deep South",
    "subreddit": "MensRights",
    "timestamp": 1575386071,
    "score": 33,
    "keyword": "mixed race judge"
  },
  {
    "text": "The Pressure on Female Superhero Movies and the Captain Marvel \"Controversy\" Too much pressure can be placed on superhero movies with female leads. This is a topic that I have thought about a lot recently with the “backlash” Brie Larson (star of *Captain Marvel*) received from an angry group of people online. Hopefully, this post can spread a little bit of awareness about the massive pressure and criticism that is placed on female superhero movies and why there have been so few in the past.\n\nIn the past it has been an industry standard to not make female superhero movies, assuming they would not earn enough money from ticket and merchandise sales. The only two major superhero movies that have been released in the 2000s were *Elektra* and *Catwoman.* Both failed miserably at the box office and with critics not because they featured women, because they were poorly made films. 2004’s *Catwoman* was an example of a female superhero movie that was made by men for men as you can see from how they dressed Halley Berry’s Catwoman in what can be described as leather lingerie. This sort of depiction is a perfect example of feminist theorist Laura Mulvey’s concept of the male gaze and represents an aspect of shallow storytelling. After 2005’s *Elektra* also failed, studios decided not to take a chance, resulting in a 12-year span of no female superheroes. All it took was two failed movies.\n\nAs time passed it became clear that female superhero movies are in demand. According to a study of movies in various budget brackets from 2014 to 2017, female led movies bring in greater profits than those with male protagonists ([CNBC](https://www.cnbc.com/2018/12/12/movies-starring-women-make-more-money-than-movies-starring-men.html)). And, considering 51% of moviegoers were women in 2018 according to the MPAA ([Women and Hollywood](https://womenandhollywood.com/mpaa-report-2018-women-represent-51-of-moviegoers-47-of-ticket-buyers/)), there is sufficient evidence to show that it is profitable to make female superhero movies. Some have argued in the past that there is not demand for female superhero movies because women don’t like those kinds of movies. Turns out the demand is there, with 2017’s *Wonder Woman* earnings at $821,847,012 and *Captain Marvel* currently around $1,067,648,08 ([Box Office Mojo](https://www.boxofficemojo.com/)). Bloomberg reported that Wonder Woman merchandise alone had brought in $500 million to $1 billion ([Independent Retailer](https://independentretailer.com/2017/07/04/wonder-woman-breaking-glass-ceilings-conquering-retail/)), a good sign for Captain Marvel merchandise. The problem was a supply of low-quality movies and a lack of merchandise, not a lack of demand.\n\nDespite the high ticket and merchandise sales, some still try to apply unfair pressure to female superhero films. Most recently, Brie Larson’s comments about increasing critic diversity was focally criticized by a group of people online. Here are her exact words:\n\n“About a year ago, I started paying attention to what my press days looked like and the critics reviewing movies, and noticed it appeared to be overwhelmingly white male. So, I spoke to Dr Stacy Smith at the USC Annenberg Inclusion Initiative, who put together a study to confirm that. Moving forward, I decided to make sure my press days were more inclusive” ([Marieclair](https://www.marieclaire.co.uk/entertainment/tv-and-film/brie-larson-641750)).\n\nThe study she is referring to was most likely the one that looked at 2015-2017 and found that critics are 78.7% male and 83.2% white ([USC](http://assets.uscannenberg.org/docs/critics-choice-2.pdf)). What she is saying is that she wants to give diverse press interviewers the opportunity to interview her. But it seems when any norms are challenged, a group of people on the internet will be angered and attempt to create controversy. After these comments, multiple YouTube videos and blog posts popped up accusing her of being sexist by discriminating against men, with some making claims without providing the quote. There was even an effort to sabotage the movie by user review bombing on RottenTomatoes, prompting the site to remove pre-release comments and ratings. This type of controversy is fueled by the fear of change. In the end, it doesn’t matter if you are not a fan of one movie or what the lead actress said. What matters is that movies that break gender and race norms can continue to be made without unfair pressure.\n\nFemale superheroes movies have had a rough time in the past. Pressure and assumptions have been placed on these movies, leading to the entire sub-genre being judged on the performance of two failed films. This kind of structural inequality for women is common in patriarchal societies (system that gives power to men) like our own. Thankfully, filmmakers took a chance *Wonder Woman* and *Captain Marvel.* As a result, we can now prove that female superhero movies are profitable at the box office and through merchandise despite old industry norms saying the contrary.\n\nIt is unfortunate that female superhero movies have been repressed for so long despite rising demand. The sexist ideas that place damaging pressure on these movies (and brought us *Catwoman*) need to be cast out. Female superhero movies don’t need to be universally acclaimed and make $1 billion at the box office to have a place in cinema; the pressure isn’t needed. People that are threatened by more female roles need to recognize that things change. Yelling at the clouds may attract attention, but it won’t stop the weather from changing. What is important is that female led movies will lead to more female led stories told by people with different perspectives that might not have had the opportunity do so in the past. Hopefully the unfair pressure placed on female superhero movies will lessen over time.",
    "title": "The Pressure on Female Superhero Movies and the Captain Marvel \"Controversy\"",
    "subreddit": "Feminism",
    "timestamp": 1555789944,
    "score": 82,
    "keyword": "mixed race judge"
  },
  {
    "text": "Curvy High School Swimmer Disqualified for a Wedgie For those who have exceeded their Washington Post free article limit:\n\n\"The teenage girl clambered out of the pool, ready to accept victory. A champion swimmer for Anchorage’s Dimond High School, she had crushed her competition in the 100-yard freestyle during Friday night’s meet with a rival from across town.\n\nBut as soon as she stepped out of the water, she learned that she had been disqualified.\n\nThe reason? Her swimsuit was exposing too much of her buttocks, an official ruled.\n\nThe referee’s call, which is now under investigation, has generated intense debate among Alaska’s close-knit swim and dive community, and prompted a larger discussion about how female athletes’ bodies are policed and scrutinized. Lauren Langford, who coaches swimming at another high school in the area, told The Washington Post that she believes racism, in addition to sexism, may have been a factor, given that the teen is among the few nonwhite athletes in a predominantly white sport.\n\n'All of these girls are all wearing suits that are cut the same way,' Langford said. 'And the only girl who gets disqualified is a mixed-race girl with rounder, curvier features.'\n\nThe teenager didn’t pick out the swimsuit — her school chose it and issued it to her. But even though all the girls on her team were dressed identically, she was the only one cited for a uniform violation. Annette Rohde, who was working as an official during the meet, told the Anchorage Daily News that another female ref explained that the bottom of the girl’s suit 'was so far up I could see butt cheek touching butt cheek.’\n\nRohde froze in disbelief, she said, and warned the referee, who has not been identified, 'This is going to blow up.' Sure enough, the decision reverberated throughout the community, where the teen is known as a top-ranked swimmer likely to go on to compete at the collegiate level.\n\n'In a world where young girls are told at every turn that the skin they’re in is not good enough for a thousand reasons, the last thing we need to do in youth athletics is add to that unhealthy dialogue,' Langford, a swim coach at Anchorage’s West High School who coached the teenager and her sisters when they were younger, wrote in a widely shared blog post on Medium after Friday’s meet. She added, 'If you do not like the way that swimsuits fit on these girls’ bodies then don’t look; they are minors, children, and no one should be looking at them anyway.'\n\nSpeaking with The Post on Monday night, Langford said she was angered at the treatment of the teenager, whom she described as 'literally the nicest young lady.' It wasn’t the first time the girl had been made to feel that her curvy figure was problematic: Last year, a parent took a photo of her backside and shared it with other parents to demonstrate that girls on the team were wearing inappropriate swimwear. (District officials said Monday that Dimond High School’s assistant principal 'indicated to the parent who took the photographs that it was not permissible for him to take pictures of others’ children and that he should stop immediately.')\n\n'That to me is so inappropriate,' Langford said. She noted that the teen girl has been accused of hiking her suit up on purpose, but anyone who has competed in swimming would know that suits often ride up unintentionally.\n\n'We have a term for it — it’s called a suit wedgie,' she said. 'And wedgies happen. It’s uncomfortable. No one’s going to walk around that way intentionally.'\n\nOver the years, the conservative one-piece swimsuits traditionally worn by competitive female swimmers have been phased out in favor of a higher-cut style that has less fabric and is more hydrodynamic, but also more revealing. The changes in the cut and fit, Langford said, make it 'even more frequent that you’re picking a wedgie.' But a minor, if annoying, wardrobe malfunction is also likely to be the last thing on the mind of a swimmer intently focused on her form as she nears the finish line.\n\n'If you’re in the water, you’re not thinking about it,' Langford said.\n\nRohde and another local swim coach told the Daily News on Monday that they, too, had never seen the teenager deliberately adjust her swimsuit to make it more revealing. There’s some dispute about whether the referee’s call, which Dimond’s coach has protested, would have been correct if the girl had done so, or if swimmers can be penalized for failing to realize that their suit has bunched up. Officials with the Anchorage School District, who announced Monday that they are reviewing the decision, wrote that the disqualification 'appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms.'\n\nThe National Federation of State High School Associations, the governing body for high school athletics in Alaska, simply states that female swimmers must cover their buttocks and breasts. In August, the organization issued a memorandum alerting coaches that 'suits are being worn in such a way as to expose the athlete’s buttocks,' and provided an illustrated example of what constituted appropriate coverage. District officials said Monday that Dimond High School 'made deliberate efforts over the last year' to meet those requirements — in particular, picking out the regulation swimsuit that the teen was wearing when she was stripped of her victory.\n\n'If the suit was a problem, they all should have been disqualified,' Langford said. 'But they weren’t.'\n\nMeagan Kowatch, the teenager’s mother, told KTUU on Monday that the referee who made the call had previously embarrassed one of her other daughters by critiquing the fit of her swimsuit during a meet. She wants to see the results of Friday’s competition overturned, and for that ref to be kept away from her daughters’ races in future, she said.\n\nThough there’s also been some debate about whether racism played a role in the decision, 'no one seems to be arguing about if it’s sexism,' Langford said. The National Federation of High Schools also published guidelines for appropriate male swimwear in August, and she said she’s seen young men competing in lower-riding suits than the organization deems appropriate. But to her knowledge, it’s never become an issue.\n\nBy contrast, Langford said, Kowatch has been told by other parents that her three daughters on the team, who are all talented swimmers, need to cover up for the sake of their sons. The disqualified teenager, though usually 'tough as nails,' turned teary on Friday night over the referee’s decision, and was 'heartbroken' to learn that people were accusing her of purposefully hiking up her swimsuit, the coach said.\n\n'The fact that she’s been told she’s intentionally trying to draw this sexual attention has really crushed her,' Langford said.\"\n \nBy Antonia Noori Farzan\nSeptember 10 at 6:58 AM\nhttps://www.washingtonpost.com/nation/2019/09/10/anchorage-swimmer-disqualified-wedgie",
    "title": "Curvy High School Swimmer Disqualified for a Wedgie",
    "subreddit": "Feminism",
    "timestamp": 1568221201,
    "score": 15,
    "keyword": "mixed race judge"
  },
  {
    "text": "Who is classed as being a woman of colour? Hey guys. Been deliberating over this. I'm mixed race, half Iranian and half English. Is this classed as being a WOC?? I've always thought of myself as one but a friend recently caused me to question this as she sees me as v white (she is white herself) . I know I have extreme privilege for often passing as white but I've also experienced a lot of discrimination, especially as a kid, for being middle eastern. I've been called names, made fun of and been made to feel I'm different. This has impacted my life a lot and really influenced the way I see the world. Some people see me as white and others do not. I definitely think people make judgements about me based on my appearance. I also have an extremely middle Eastern name which makes people assume things about me before they even meet me and I worry it may result in discrimination when I'm applying for jobs. But I also feel that I'm not qualified to call myself a WOC because other women that are not light skinned as me have it so hard. Anyway, didn't really know who to ask and Google ain't helping. Let me know if it's the wrong space..",
    "title": "Who is classed as being a woman of colour?",
    "subreddit": "Feminism",
    "timestamp": 1565803290,
    "score": 2,
    "keyword": "mixed race judge"
  }
]