[
  {
    "text": "Tech Director emailed me asking to set up interview, but never heard back after I replied with availability? Confused Had Interview April 30 which went great. I really seemed to impress the HR recruiter and she said she'd definitely send over my resume to the Tech Director who is the hiring manager for the team.\n\nOn the afternoon of May 1 the Tech Director emailed me (that was quick!), asking for my availability. He got his dates mixed up (day of the week vs numbers thing) and I wrote back confirming what dates he meant. He wanted to know my availability next week Monday (5/6) and Tuesday (5/7). I told him I'm available after 4:30 PM those days.\n\nI haven't heard anything back and I just emailed him again to confirm the time and day he will call. This is a pretty prestigious organization in my industry and will help advance my career moreso than most jobs I've applied to so I would've given up by now if I wasn't extremely interested in working for them.\n\nIf I don't hear back from the tech director today, should I assume I'm not going to be interviewed? Should I expect his call? Should I contact HR and ask them what's going on? This seems very disorganized. I mean I don't think it should take two days for someone to check their calendar, but maybe he's putting out some fires that pushes everything else away at the moment.",
    "title": "Tech Director emailed me asking to set up interview, but never heard back after I replied with availability? Confused",
    "subreddit": "jobs",
    "timestamp": 1556893704,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "Ongoing interview process (large, well known company) starting from Mar27 till today, May 14th... is this normal? I applied to a large and very well known global organization through an online application, and someone from their team contacted me mid-March wanting to set up a telephonic interview on March 27th. Below is a short history of events that has taken place thus far.\n\nEven though the role is a mid-managerial-level one, my reporting would be to a senior manager in another country and hence, they don't have a specific department in-country for this position yet.\n\nI'm confused by the whole ordeal and as mentioned, the organization is quite large / well-known but the experience has overall left me confused. Am I just thinking too much?\n\n\\- March 27th - initial phone call (one hour) with the Senior Manager who reached out to me\n\n\\- Apr 02 - asked to complete an online test (2 hours) along with preparing a PPT based on a case study given to me to review and analyze\n\n\\- April 06 / 08 - completed the online assessment test and submitted my presentation\n\n\\- Apr 12 - got an email mentioning I had another interview scheduled with the Senior Manager's direct reportee, ie: the Manager who works with him - scheduled for Apr 15\n\n\\- April 17 - got an email I was shortlisted for the final round, based on my online test, powerpoint presentation, and conversation with the Junior / Senior managers on call. Invited for an in-person interview with the Senior Manager i have been on calls with, along with two VPs in-country on April 23rd\n\n\\- April 23rd - in-person interview goes reasonably well - expected to head back from then within 10 days\n\n\\- April 24th - mentioned on email they would take one more week to make a decision. Mentioned someone would contact me for a \"final\" phone interview with the Regional Director on May 2nd. Was asked in the meantime to share my references contact details (2 of them) which I did.\n\n\\- May 2nd - had an extremely positive conversation with the Regional Director (or so what I thought) who said towards the end of the call they should be getting back to me within a week.  \n\n\n\\- May 3rd - this is around the same time I came to know both of my referred contacts (reference checks) completed the form which was sent to them for my review.  \n\n\n\\- May 8th - didn't hear back from anyone - sent an email to the Senior Manager asking for an update. Got a reply quickly, telling me I was in the race with one other candidate and they expect to make a final decision within one week.\n\n\\- Today - May 14th - one week ends today...\n\nConfused on if I should follow up again with a polite reminder, or let things play out on their own...?  \n\n\n  \nTLDR: Application process started March 27th - four calls, an online test, a case study, an in-person interview and a reference check later, still no offer or decision. Confused whether to follow up or stay quiet for a bit more time.",
    "title": "Ongoing interview process (large, well known company) starting from Mar27 till today, May 14th... is this normal?",
    "subreddit": "jobs",
    "timestamp": 1557817368,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "Guys I need some help, got suspended from my job for unfair reasons So I have been employed at a restaurant that is corporate for 7 years. Never had any write ups, never had any reprimands, nothing. Always on time, always the one to volunteer to work extra. I serve, bartend and hourly manage. Haven't called out a day in over 2 years and that was when I had the flu. When the gm wants to leave early, I am the one that picks up the slack so they can leave.\nAnyway, we have had alot of complaints lately through email about service in the restaurant, especially how rude the host stand is. The host stand is one of the areas I am in charge of so I have been feeling alot of heat from this. We have nothing but kids on the host stand (I am in my 40s), so I decided it was time to put my foot down and I had to get stern with them. I told them to put away their phones, stop eating at the front, stop going to the back and flirting with the cooks and to do their job. Stuff I have been trying to get them to do all along but they haven't been.\nSo I get called in the office yesterday and told I am suspended until further notice and under investigation because my name came up for saying discriminatory remarks towards certain races. I said that was ridiculous and asked what was supposedly said. The manager wouldn't tell me. Just said they will complete their investigation and let me know. \nI feel like these kids have all ganged up on me and made up things to get me out of there. I have been called \"mean\" by them alot lately. I know things are sensitive in corporate and they have to take allegations seriously but how can they get away with this? \nAn amusing thing about this is I am white, they are basically accusing me of being racist and my husband and children are mixed race. I just don't get it and need some serious opinions and advice please.",
    "title": "Guys I need some help, got suspended from my job for unfair reasons",
    "subreddit": "jobs",
    "timestamp": 1549822933,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Promotion rejected twice. Boss doesn't seem to care anymore. What to do? Hey, Reddit.\n\n\nThis is a long one.\n\nI have been working at a large and respected company for 8 years now, in its IT department (supporting globally). In these 8 years I have progressed very well where it sometimes took me a shorter-than-usual period to get a pay raise or bonus, for I have worked hard and long hours. Not only because I loved my job, but I felt a senese of responsibility to do my best. In my field of work I have been certified a few times, engaged in a lot of projects and was responsible for designing and implementing new systems and applications that proved to be vital to the company's operations later on.\n\nThroughout these 8 years, and due to the many acquisitions or mergers I have had a total of 10 bosses. Some were fair and decent, some were typical assholes, and some were awefully micromanaging and uncaring dipshits. The last describes my current boss who's been managing the department for more than 3 years now. I usually do not mind a bad manager as long as he keeps to himself and lets me do what I do best. But this guy was the worst. He would micromanage to the tiniest teeniest bit. And his direction seems to be against everyone, be it his own department or other departments. He became known for conflicts and in-fightings. He was an abusive tyrant. He more than ocassioanlly lied to people, used his dirty office politics to corrupt relationships even within his own department,  and he obsessively  controlled and manipulated people. For that, a lot of people left the company or transferred out of the department. They just could not take it. Which is totally understandable. Some people tried, but failed because he either sabotaged their plans, lied to them, or someway convinced and/or forced to stay. Out of the many people who came and went in this department I have been there the longest.\n\n2 years ago, we had a mini re-org where 2 deprtments were merged into one and he became a sr. manager (a level above the manager) managing the new department under which we have 5 teams. Some of management positions came to be vacant, and he filled them, but some remained vacant for over a year. Until mid of last year, when they started looking for qualified candidates. I then thought that although I did not see myself managing a team, especially not under that guy, I said what the hell, and showed my interest in one of the management positions under him. I was rejected. When I asked HR I was told this is because I did not have the minimum years of experience required at the time which is 8 years. At the time I was around 7 years with company. Some time went by and I continued doing what I do, until I started thinking about it again. It started bugging me. There were cases where the minimum requirements were discarded or overlooked if the candidate was seen as deserving or qualified by management and their peers. Which I thought I was. So I went to his office and asked him why I did not get the promotion, and he gave me the same excuse for the years of experience. But then I told him of the known cases where others were promoted and it was not against policy to promote a deserving employee even if he/she does not meet the required years of experience. Here it became clear. He did not want me to be a manager. He told me so. Not because I wasn't qualified, but he said I did not have the right \"chemistry\" with him, or we did not mix well. He did not have the right chemistry with anyone and did not mix well with anyone. And he went on about  how he did not like the way I did things, and if I kept that way then I would never be a manager under him.\n\nBy the end of that year, 3 out of the 5 management positions were filled and 2 remained vacant. The next year a colleague who is one year my junior, decided to go for one of the positions. But knowing I am his senior and at that time I met the requirements he approached me about it and we decided to each interview for both, and whatever position we get would be good. For him, it was not about the job or a creer path. He cared about the pay and social status. Unlike me. Which is okay, I had no problem with that. Within that same period, something happened to our boss that somehow changed him. He suddenly started to seem more caring, less micromanaging, and less assholey, and most importantly honest. This wasn't something expected, but of course we welcomed it. He actually recommended us be interviewed for the jobs and assured us he would do his best to get us both promoted, deservingly of course, one to each of the vacant manager positions. We were both interviewed within a week.  My colleague was interviewed a day before I was, and he felt good about how he did in his interview. I was interviewed by sr. managers, including my boss, and their boss the director. I felt I absolutely killed. And my boss thought the same.\n\nMy colleague was promoted. I wasn't.\nHe was to manage the team I was part of. Technically my new boss.\n\nI was devastated, my spirit broken. I could not overcome this for a long time.\n\nMy boss told me he tried his best to convince the others to agree on the promotion but it was him vs everyone else. I did not care why I was rejected. At the time I was angry, fuming.\n\nJust to show you how absurd the reasons give then, I will let out one of the reasons I was rejected for that promotion:\nSome said I may not be able to handle the load, since a few times the year earlier some tried to reach on my company Skype and couldn't because I had set the status to do  not disturb. Are you fucking kidding me? This one was the the weekest of all reasons given.\n\nAfter that, he said he convinced them to agree to assign me an acting manager. Of course after the news of rejection this seemed as sunshine to me so I agreed. He reminded me that an acting manager means doing the manager's work with all its responsibilities without any of the benefits or monetary advantage that a manager has, but that if I did well and proved I can be a manager for 3 months or so they would reconsider.\n\nI took it on and although now I am in a completely different job, I did my best for a while, working to improve the teams and the way we do things continuously even the conflicts and troubles that the job entails.\n\nFast forward to today. It has been 8 months now and I am still acting manager. It seems he does not care anymore. Or may be because it now seems he went back to being his old self: the abusive, lying, controlling boss who in his own words at one time said did not want for me to be a manager under him.\n\nIn the last two months, I have been contemplating the idea of transferring to another department. And the only thing keeping me from doing so is that I am closer to being a manager than I have ever been, if I am to believe my boss. Sometimes I would think he is lying and wanting to use me to do the team's management work without actually promoting me. Cost saving. Sometimes I think if I just suck it up and tolerate for a few more months I would eventually get what I sought. But then when I look at the department where I plan my career to go towards, I see no vacancies for management positions. Now I don't care about being a manager as much as I care about being able advance in my career progression. Now here's my dilemma: If I stay in current department, I may or may not be promoted to the next level but it feels close. If choose to transfer to another level where there are no vacancies equal to or parallel to that next level, then it might rake me the same time or likely longer to do so in that department.\n\nThis has been keeping me awake many a night. I have been quite depressed about it and feel burned out due to the overwhelming work I have to do without any gain in pay or position. Day after day I feel less motivated and everyday getting out of bed in the morning becomes harder. Add to that everyone around me is getting promoted, some deserve it and some don't the way I see it. What also grinds my gears more is people coming up to me and saying how I should've been promoted instead of the others, etc.\n\n\nWhat should I do? Shoud I keep doing what I'm doing? Should I talk to him? Or just ask for a transfer? What would be the best course of action?\n\n I don't know what to do.\n\n**TL;DR** boss is an asshole. I was denied promotion twice for bullshit reasons, and thinking about my options on how to proceed to achieve my career progression goals.\n\nSorry for any fomatting issue or misspellings, typed on mobile.",
    "title": "Promotion rejected twice. Boss doesn't seem to care anymore. What to do?",
    "subreddit": "jobs",
    "timestamp": 1557478688,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Interviewing for a job within the same company/internal transfer position? I have been at my current workplace for 17 months (it's my first job out of graduate school, and even though the duration seems quite short, it's a quite long duration compared to other staff where I work). My workplace consists of never-ending and frequent staff shortages/turnover due to burnout, lack of support from management, low pay, etc. A job posting for the same job I currently have, but in a different department at my current company, was recently posted. I debated applying for it because although my current position is not extremely intolerable, there are many areas I wish could be improved upon also. \n\nI decided to apply last night, and today, I received a call from the department's director there, who invited me to come interview tomorrow with her and the associate director. She clarified that I was a current employee at the company, and asked me if I had told my supervisor I was applying for this position, and why I was considering transferring. I told her that I had not informed my supervisor I had applied for this position (we are also on break from work for the next 2 weeks), and that I applied because I was interested to learn more about the position, overall, and have been seeking to obtain more diverse working experiences for professional growth. Of course, dependent on the interview, and learning more about the position, I am not 100% sure if I will take this position, if it is even offered. The position offered is not located in the same building I work at either. However, I am wondering if HR will inform my supervisor that I applied for this new position, even if I do not accept it? I have also never applied for an internal transfer within a workplace before, and am wondering what the interview process is like, if they will call references/speak to my supervisor, etc? I have a lot of mixed feelings about my supervisor, and she would probably be very annoyed to hear about me potentially looking for other jobs, as she would have to hire another person for her department too; however, I know that I need to do what's best for me, professionally, also. The director mentioned on the phone that hiring me would save training time, since I would be considered an internal transfer. If anyone has ever done an internal transfer at their workplace, I would be interested to hear about it. Internal transfers do occur within my workplace, but I don't know anyone personally who has done them by me.",
    "title": "Interviewing for a job within the same company/internal transfer position?",
    "subreddit": "jobs",
    "timestamp": 1566423666,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Jumping through hoops, is this normal? I've got an opportunity that's just too good to pass up. But the interview process has been extensive\nIt's for product manager in a company but basically they want me to be a subject matter expert on some pretty complex stuff\nInterviews have been mixed but seems like everyone likes me.\nHere's the thing...  I have had to jump through so many hoops for this and I'm not even done yet\nI've met with my future manager, his manager, the director and the VP as well as the hiring manager. I've totaled 6 interviews. And just had to give 5 references (2 had to be managers) and all of those people had to do a 30 question written survey on me and a personality test... after I've had all these interviews! This seems ridiculous, but it is a high paying job and a senior role for something I've not done explicitly but I know my experiences would be perfect fit for it. \nIs this normal? Or are they just looking for a reason to drop me as a candidate? Seems like a lot.",
    "title": "Jumping through hoops, is this normal?",
    "subreddit": "jobs",
    "timestamp": 1555608123,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Someone had my back about gross comment at work This is kind of a two-fold post. I wanted to share a positive response to inappropriate behavior in light of all the stories about entire systems ignoring harassment but I also want to share my story moving forward. \n\nI'm a medical student doing clinical rotations at a small, rural hospital.  \n\nOn Christmas Eve, I was required by my school to go into the hospital despite the fact that almost nothing was happening on my assigned service. Eventually, I went wandering to see if anyone else needed help because I got tired of sitting around twiddling my thumbs.\n\nI ran into the Director of Medical Education who offered to let me see patients with him if I was bored. At one point, he sent me into the room ahead of him while he was texting a colleague.  \n\nThe patient's first comment was about my breasts.  \n\n\nI was kind of gobsmacked. I've gotten my fair share of ignorant comments but usually about race.  None of them were ever malicious, just ignorant. Not a huge deal. I usually respond by politely correcting the misconception and move on. \n\nI wasn't sure how to react and I was super uncomfortable. He called me a \"Christmas treat\" and commented on the length of my skirt. (I was wearing a dress because I had dinner plans for after work.)\n\nThe attending walked into the room and made an excuse for me to leave. \n\nWhen he returned to his office, he told me the patient had been reprimanded for his comments. He also asked if I'd experienced any similar comments in the past.  \n\nI was also advised that if a patient ever made me uncomfortable in the future, I should immediately leave the room and report the behavior to my attending. If my attending didn't take it seriously I should come to one of the two doctors in the medical education department. \n\nHe also made sure I was aware that I would not be penalized for reporting the behavior of any patient (or employee). \n\nIt made me feel a lot better to know that any concerns would be taken seriously and there was at least one person in the hospital who would have my back if needed but I also still feel kind of icky. It was my first time wearing a dress or skirt in the hospital and I very much doubt I will in the near future.\n\nThough I will say I don't understand what the patient thought would happen. Did he think I would be so overcome by a man older than my parents calling me pretty that I would sleep with him?",
    "title": "Someone had my back about gross comment at work",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1577291245,
    "score": 29,
    "keyword": "mixed race director"
  },
  {
    "text": "I think this roommate might be grooming a young girl. I'll do my best to be clear with this information, but honestly my heart is pounding like crazy. I don't want anyone to get hurt and I'm trapped with indecision. So, I've made a throwaway account because I need some place to put all these feelings I have.\n\n&#x200B;\n\nObviously, specific information is hidden for the sake of privacy. The beginning is going to seem to go on for a while, but I want to get all of this information of my chest so that I get the best help to understand what's happening.\n\nSo there's me (28m), my gf (25), our friends Mary (26f) and James (31m), Barry (27m), and Sam (13f)\n\n&#x200B;\n\nI live in a decent neighborhood, economically speaking. It's mostly middle-class with free wifi at the shopping centers, farmer's markets on weekends, and middle school parades through the neighborhood for holidays or the local football team. My block is a mix of town houses and apartments, which is where I and many of my friends live. I have high functioning autism as well as ADHD, so I tend to be a little \"outside the lines\" when it comes making friends and hanging out, which means I know my fair share of who I like to call neurodivergent people. \n\n&#x200B;\n\nOne of my friends, let's call him Barry, I've known for almost 10 years. When I first met him, he had been walking around with a hat with fox ears and a matching tail hanging out of his back pocket. He shares an apartment with three other guys and we're similar in age. We bond over our love of video games and anime, although when it comes to anime all he wants to watch are harem themes, where one boy/young man (the hero) is surrounded by a supporting cast of girls/young women who all want his attention and it just isn't my thing.\n\n&#x200B;\n\nAt some point, Mary moves in as she's dating James, who lives there. Eventually her and James, my gf and I all become pretty good friends. As for me and Barry, over time our relationship has become very strained. When I told him that I couldn't come over to hang out one day, he tried to tell me that I hurt everyone around me by jerking their feelings around and don't respect other people's time. When I started to date my current partner, who is also Barry's and Mary's mutual friend, he held an intervention at his house to tell us that we're spending too much time together and it's destructive to our other relationships.\n\n&#x200B;\n\nOne day, Barry and I were talking about consent and sex positivity. I reveal that one of our friends (who doesn't live in the house) had loudly slapped my gf's butt out in public and that isn't remotely cool at all. Barry's attitude was \"You don't get it. He's just like that. He's always been like that. Why is that a big deal?\" We argue for hours about respect and how women fight an uphill battle for basic shit. He continues to take the stance that I'm misinterpreting the event. He infers that women act like gold-diggers because that's just biology (what). . . and then he says \"If it's the end of the world and she doesn't want it, it doesn't matter. ***The preservation of the human race is way more important, wouldn't you agree?***\" I leave and blow off everything with him, now realizing that he is an actually full-blown nightmare person.\n\n&#x200B;\n\nThat was early last year. Now, the only time I see him at all is when I come over to hang out with Mary or James, since they all share rent together. But lately, Mary has been telling me that Barry has been going to a small, out of the garage dojo ran by an old instructor on the other side of the block (roughly twenty-five minutes away by foot). There's maybe anywhere from 8-12 student there during a lesson and I knew Barry had been attending for all these years. These days, he's essentially the instructor's protige, sometimes leading classes, and will pay special attention to the one and only young girl there who's about to start high school, Sam. Apparently, Barry and Sam text every day, asking what she's doing, how her day was, how her family is doing, how's school. And he's been doing this for years.\n\n&#x200B;\n\nHe's positioned himself as a pillar of support for this young girl over the last 5-7 years, since her parents started taking her to the dojo. He's openly told me that he's depressed and that he \"doesn't want to be a wizard,\" meaning a 30-year old virgin. He's said that \"age is just a number and girls mature faster than boys\" and that he's \"good at playing nice for parents.\" His notification tone for her texts is a loud cat's meow. \n\n&#x200B;\n\nI worry that he may be manipulating her, filing her head with nonsense about the way boys and girls are because of \"biology\" or grooming her to act \"properly\" for his tastes in anime lolis. He's quick to anger, works out, and is a walking Dunning–Kruger effect, interupting people often just to be loudly wrong.\n\n&#x200B;\n\nSo, there you have it. I don't know what to do. I've thought about going to the dojo and speaking to the instructor directly about this. Chances are that he has Sam's and the family's numbers, but I wanted to see if there's other options available OR if I'm way out of bounds here, acting paranoid, and trying to pry into a teenager's private life for my own sense of warped sense of safety or morality. I honestly feel crazy about this and need more feedback.",
    "title": "I think this roommate might be grooming a young girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1546563688,
    "score": 20,
    "keyword": "mixed race director"
  },
  {
    "text": "My first dating experience was a wreck. Throwaway because the person described knows my Reddit username.\n\nIn my third year of college, I met a guy online through a game and became friends with him. He lived many states away from me in the US and I knew he was older than me. We chatted daily and played together.\n\nThis fast friendship continued into my senior year. We had been playing a different game together and voice chatting more often. I think I was actually charmed by his voice. It was deep and rich, and he had a great laugh. I didn't expect him to be incredibly good looking, but he was kind and funny, and his breadth of experience as an older guy (I didn't know then how much older) was very appealing. He was easy to talk to, and I confided in him. I had been seriously struggling with undiagnosed clinical depression and anxiety. I think he thought of me as a side hobby of sorts. Just a problematic girl he met online who he wanted to help. \n\nI confessed to him, and was rejected. He seemed more incredulous that I would want a relationship with him.\n\nI was always open to him about my life. He knew how old I was, what I sounded like, even what school I went to. On the contrary, I knew very little about his appearance or height, or even his race. After I showed him my picture, he was surprised because apparently he expected me to look like Sadako from The Ring. The compliments felt good to receive, even though it hurt that he thought I was so scary/unattractive. I'm a 175 cm (5'9\") Asian girl, and at that time, I was 115 lbs. The next day, his tune changed, and he seemed to be considering the relationship. And then later that week, he said that I should be happy, because he had reconsidered my feelings for him and was willing to give the relationship a go.\n\nMy feelings at this point were already mixed. That day, when I confessed to him, I had asked to see his picture after I showed him mine. But he was evasive and ended up showing me a picture of him from many years back, when he was in college. When I asked for a more recent picture, he showed me one that was incredibly blurry and I couldn't make out any of his features. Then he reluctantly told me that he was 39 years old. I had known he was older, but never in my wildest dreams had I expected him to be so much older than me. There was a 17 year age gap between us. Relationships with such age gaps often do work out, but I was still super concerned and immediately knew that my strict Asian parents would NEVER approve of him. \n\nAll of this was obviously raising flags and I was now regretting confessing to him, but when he said that he liked me back and wanted to progress with the relationship, I hesitated to go back on my word. I had never dated before and was a complete virgin, and honestly, I craved a relationship. I wanted to feel desirable, to feel loved and attractive. We started dating. For us, that meant phone calls lasting 4-6 hours and many texts in between. He encouraged me to seek therapy for the panic attacks and suicidal thoughts I kept having (senior year became very stressful, with all the looming thoughts of the uncertain future ahead). For that, I will always be thankful to him. No one else in my life had ever told me to go into therapy. My parents told me I would get over it and that this was a phase that everyone went through. He was the first person to tell me that it wasn't normal to think about how I would end my own life on a daily, if not hourly, basis.\n\nAnd then, after a few weeks of daily conversation, he showed me his body and face.\n\nTo be honest, I was completely repulsed. I feel bad saying that about anyone but I would have never wanted an intimate relationship with him if I had seen his appearance beforehand. Everything about him was simply not my type. He was very overweight (although he was working hard to lose it) and much shorter than me. 17 years older than me and balding. I started realizing this would never work. I had fallen in love with his personality, but I could not feel even an ounce of attraction to his body.\n\nThis is important, of course, because he also taught me about phone sex and sexting. I became very good at moaning, because I knew it turned him on. However, I could never bring myself to actually imagine his body on top of mine. It scared me a little. But for him, it was all too easy. He would tell me about erotic fantasies he had about me. He seemed to always be thinking about sex, and masturbated to porn frequently. I was happy to think that he found me so attractive, but at the same time, I was pretty scared.\n\nI told him once that I was hesitating, that I liked him, but was not attracted to him. BUT I was willing to still give it a try, that maybe I would get over it. He must have sensed these feelings growing in me after he showed me his picture, because he totally assumed that I was dumping him and had apparently planned to lash out at me. His vengefulness and anger was frightening. I don't remember everything he said then, but one thing stuck: He thought I at least owed him sex.\n\nI think I was too much in shock and too overwhelmed by my mixed feelings to realize how concerning those words were. He was never a bad person. I think now that he was seriously lonely and thought of me like a rice cake dropped into his lap from the sky. At almost 40, his dating opportunities were becoming rather slim. He told me that I was his \"last chance\" to find love and marry, have kids, and live the rest of our lives together.\n\nAnd so... my chance to end the relationship decisively slipped away from me, and we continued dating. He made plans for the future, and I continued worrying and doubting. He booked a flight and planned to come see me, and I continued to dread actually meeting him. I know I should have told him clearly that it would not work between us, but I didn't. I felt bad that he had helped me so much, and that we had spent so many hours talking. I didn't want to have been a waste of his time and care. And most of all, I could not bring myself to destroy his \"last chance.\"\n\nWhen my anxiety about the relationship came to a head, I told him I needed a break. To this day, I regret having not laid things out clearly. But I felt bad about everything, and just wanted to escape from the mess. I knew I was essentially stringing him along this whole time and lying to him, but I honestly never meant to hurt him. I was 22 years old, completely naive, and had no idea how to express my own wishes, how to listen to my body's signals, and how to heed the red flags I had seen along the way.\n\nI offered to recoup the cost of the flight. He rejected that offer at first, but the next day he sent me a very formal text saying he had reconsidered and wanted me to pay $250. At that time, that was a lot of money for me, but I agreed and sent him the check immediately.\n\nI believe I was an asshole in this relationship. I could have avoided all this pain for both of us by listening to my true thoughts and realizing that no amount of worrying is going to suddenly make me feel attracted to a body that isn't my type. He knew, from the very beginning, that I was vulnerable and incredibly naive. I had a lot of fault in this, but he also manipulated my feelings and withheld his appearance and personal details (namely his age) from me until it was too late for me to easily back out. He KNEW that I would find him unattractive, and so he kept me in the dark for a long time.\n\nI wrote all of this to finally process my lingering feelings. It's been 2 years since then and I'm in a loving, non-long-distance relationship with someone else. I'm even getting married soon, but I still have pained thoughts about my first boyfriend sometimes and I realized that I never really got over it. I'm scared to invite criticism, but I know I need to hear it.\n\n(Edited typo about my height!)",
    "title": "My first dating experience was a wreck.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1561470315,
    "score": 19,
    "keyword": "mixed race director"
  },
  {
    "text": "Scrubs or Professional clothes ? I am an attending physician, hospitalist. In my hospital, almost all of the medical specialty docs wear professional clothes and most of the surgical specialty / ER docs wear scrubs. In addition to that, almost anyone else who works in my hospital, is in scrubs. However, all of my colleagues wear professional clothes - you know, pant-shirt, blouse-skirts etc. I do that too, but I like to wear scrubs. Now, my director (leader of the hospitalist program, aka, my boss) is a 40-ish female physician and feels STRONGLY against scrubs. She says that you are not a moonlighter or a resident and shouldn't wear scrubs, and in extreme cases, if you have to, please wear a white coat on top of it. Everytime she sees me wearing scrubs, she shows such genuine surprise and remarks about it. Kind of unnerving.\n\n&#x200B;\n\nNow here is what I think about scrubs :-\n\n\\- they are super comfortable\n\n\\- its a hassle to make sure clothes are clean, ironed and ready, every morning, especially with a 7 am - 7 pm schedule, not to mention the pain to mix and match styles and colors\n\n\\- they are super professional for the type of work I do , FFS, I am not wearing a bikini thong while seeing a patient\n\n\\- they are issued by the hospital, if it was so wrong, the hospital would just stop issuing scrubs to me\n\n\\- I dont see a point walking into an infection with my $100-200 worth of professional clothes\n\n\\- almost ALL other countries, anyone who works in a hospital, is MANDATED to wear scrubs (aka hospital supplied clothes), I dont understand the American obsession of dressing up like a car salesman\n\n\\- my job is 100% clinical ( well 20% clinical and 80% computer typing), I dont have ANY managerial or administrative duties and its 100 % inpatient. I am dressing for the job\n\n\\- I tried to look up my hospital official policies, but so far, no luck. I guess we are just expected to dress up professionally.\n\n&#x200B;\n\nI want to know how to deal with the situation. I have expressed my desire to wear scrubs multiple times, but she just doesnt get it. In the back of my mind, I want to say that unless you tell me I will be fired or disciplined for wearing scrubs, I will continue to wear them, But honestly I would never want it to escalate it to this level.\n\n&#x200B;\n\nSo, what should i do ?\n\nShould i talk to the director ?\n\nShould I just give up and start dressing up like a car salesman ?\n\nIs there a middle ground ?\n\n&#x200B;\n\nEdit : I am a guy, I dont know how a few commenters assumed that i am a woman. \n\n&#x200B;",
    "title": "Scrubs or Professional clothes ?",
    "subreddit": "medicine",
    "timestamp": 1553524591,
    "score": 336,
    "keyword": "mixed race director"
  },
  {
    "text": "Kid quote of the day... (H.S.) “I’m not afraid of my mom, she’s white.”\n~a mixed race sophomore boy with lots of teenage attitude \n\nContext: one of the table groups was discussing how their parents react when teachers call home.",
    "title": "Kid quote of the day... (H.S.)",
    "subreddit": "Teachers",
    "timestamp": 1550194970,
    "score": 16,
    "keyword": "mixed race director"
  },
  {
    "text": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans? **TL;DR/ Daily objective:** I am posting here seeking resources about research or programs about how U.S. public schools can respond to and change a culture of fighting and truancy. The \"goal,\" is not to expel all the students who've ever caused trouble--the goal is to create a school culture where students don't want to cause serious trouble, and former \"troublemakers,\" can receive and flourish form a quality education. I am hoping that we can compile some crowd-sourced resources including: links to online articles and research studies, names or links to programs with high success rates that our school could look into buying or implementing, book suggestions that contain this kind of information, or other concrete data-based evidence or action plans. Anecdotes would be appreciated, but anecdotes are not evidence and our school can implement a school-wide, multi-year improvement plan based on an anecdote. I will post basic details, then more detailed details underneath this TL;DR/objective comment; if you read this intro and have ideas, go ahead and post them without reading it all, but if you have the time or interest, I will give many details. \n**If you read the title of this post, my TL;DR/ objective right here, or my following detailed information and think to yourself, \"This is stupid, why is this person asking for help on reddit/ trying to fix a whole school/ believing that school culture improvement can happen/ working too hard/ not seeing the red pill ~truth~ and just blaming all the Black students,\" and you would like to make a disparaging or simplistic comment, please reconsider doing so and maybe go do something fun like eat some cheese crackers instead.** \n\n\n**Basic details:**\n\n\n-School location: Flyover state, USA \n\n\n-School demographics: 40% white, 20% Hispanic or Latino, 25% Black, 10% choose not to say/identify only as mixed race; 5% Asian/ Pacific Islander, Native American, and other. \n\n\n-80% of students on free and reduced lunch \n\n\n-Advanced Placement Participation Rate: 15%\n\n\n-Standardized test scores: below state averages \n\n\n-Important/ successful departments and programs: art, theatre, speech and debate, fine arts, music, ballet and dance, pre-career EMT, pre-career dental, pre-career welding, pre-career autoshop, pre-career automotive, pre-career fire science\n\n\n-Location part II: in a weird area that covers of dense-population urban areas, suburban areas, and about 20% farm kids \n\n\n-Gang activity in the area: Exists, present in some schools but mostly limited in ours, little to no direct gang affiliations, tags, or threats, but about 5-10% of students have direct gang ties or affiliations; lots of students joke about who is what or call other students members of gangs to call them stupid (\"Yeah well you go ahead and be your dumbass self, gangster disciple motherfucker,\" \"Miss, you know I'm Mexican, you can't fail me or I'll sic the Kings on you.\")\n\n\nProblems: Fighting, retaliatory fighting, people wanting to know about and watch fights, understaffed/ ineffective/ elderly/ moderately racist/ lazy security staff, truancy and loitering within the school/ hallway-wandering, phones, sexist comments and catcalls toward girls from boys, horseplay/joking around that turns serious, boys \"just joking,\" around with touching girls when they've said stop repeatedly and genuinely don't want to be touched, \"playing around,\" by taking another student's phone, parts of the school mysteriously smelling like mint/mango/ creme/ cucumber/ fruit/ Virginia tobacco, mysterious rectangular flash drives plugged in all over the place, students who think they can responsibly and reasonably handle their weed but show up smelling like skunks and unable to answer higher-level questions or complete complex tasks, disrespect to teachers, disrespect from a select few teachers who hate teenagers.\n\n\n-Most students are good or fine, typical high school students who are also fed up with people who walk the hallways, who fight, and who disrupt classes. But also everyone loves watching fight videos. \n\n\n-Students of all races participate in fights, hallway-wandering, and class disruptions/ disrespect toward teachers. However, Black and Hispanic students doing these activities are seen as bigger troublemakers while white students are more likely to get a warning and no true referral. Also, Black students are more likely to be stopped in the hallway by teachers and security guards and asked for a pass, even students who do not habitually wander hallways but are just genuinely trying to go pee, or really did forget their notebook in their 5th hour classroom.\n\n\n**Heckin' details**\n\n\nWe have a current epidemic of fights. One fight happens, then other students get mad because of who attacked whom, yeah, but also because of who tried to hold someone back, who DIDN'T try to hold someone back, who filmed, why they filmed it (it was funny? it was tea? they were supporting their friends? an attempt to create and preserve evidence of what truly happened? evidence of teacher or police mistreatment? who knows), who previously had beef with the person who was fighting and it got re-ignited, who got suspended or who didn't get suspended, etc, etc... So there's groups of students who are on edge, then there's a fight, then other people hear and try to run toward it, problems emerge while breaking up the fight, students get suspended, they miss classes, they get in bad trouble at home OR don't get in any trouble bc of uninvolved or otherwise \"let's get them back,\" parents, they smoke a lot, they return to classes, they're behind on work and annoyed by how students are looking at them (because everyone knows who was in the fight), students get on edge, then there's a fight, then other people hear it and try to run toward it, then...the cycle continues. \n\n\nWe also have a problem of students loitering/ skipping but staying in the building. There is a core group of students who come to near every class late, leave their materials in lockers, get out of class by finagling a pass from an exhausted teacher or a sub or just plain walking out, they walk to their locker and friends' lockers and stop to pee in the juul rooms, they walk by their friends' classes that hour and wave to them from the windows, OR my favorite, a random wandering student walks into another teacher's classroom and insists on talking to their friend (??? I've had students walk in my door if it's propped open, push past me if I open it assuming the student is a pass-runner, or POUND on my doors making me think there's a life-threatening emergency), the students walk slowly and on their phones, or people scream at each other, fights break out... hopefully at some point, hallway-wanderers will be intercepted by a teacher or security guard. Then they're either simply snapped at \"Get to class!\" and the student looks serious, says they're going, and walks away to wander another day, or they're taken down to our dean's office where they get in trouble. \n\n\nAnd that's another problem; what do we do with students who continue these negative behavior patterns? \n\n\nIt's obvious that students fighting and skipping have no place in the classroom setting and need to be suspended, as punishment for their actions AND to keep them from distracting or even harming other students; obviously we need to suspend or expel troublemakers.\n\n\nIt's also obvious that students are skipping or getting in small fights so that they can get suspended and stay home from school, plus the fact that having troublemaking students OUT of school-- where they have order, rules, meals, staff who care, and access to quality public education, which is a right in our country and a way to lift people out of poverty--is undesirable and possible unethical; it's obvious we have to keep students in school and we can't just give students what they want and suspend or expel them. \n\n\nWe have many teachers and administrators who are prepared to try their best to take our school from okay to great, to make our strengths shine and **fix** our problems, rather than covering them up or kicking them further along the road. Not all teachers and admins are spectacular. But there's enough of us to make changes, as long as we know what changes to make, we work in sync, we reflect on progress, we use our resources, and we have a some but not an unreasonable amount of Jimmy John's work-til-8:00PM sessions. There are also students who are WONDERFUl, talented, hardworking, resourceful, curious, growth-oriented, compassionate, and more. We've had successful community outreach programs (food drives, volunteer programs, community elder outreach), and many students are incredibly frustrated about fights, hallways, and disrespect to teachers, and know that those are some stupid ways to go through life and handle problems. \n\n\nPlease, let me know what you know that can help. I cannot thank you enough for giving me any info to look into and report to my team.",
    "title": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans?",
    "subreddit": "Teachers",
    "timestamp": 1549597210,
    "score": 9,
    "keyword": "mixed race director"
  },
  {
    "text": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals) Hi all! I am a first year teacher in the public school system, but I work in a Pre-K/VPK Blended classroom. For those who may be unfamiliar (as I was, since I'm originally from a state who doesn't have VPK), basically I have x amount of gen ed kids on my roster, and my co teacher has x amount of special needs kids on hers. Technically, I'm supposed to teach for the first 3 hours of the day (as VPK is 3 free hours unless you pay extra for wraparound care) and my co teacher is supposed to make accommodations for the special needs kids on her roster. However, she \"doesn't agree with the co teacher model\" and has decided she is the \"teacher\" and I am the \"assistant\". The biggest problem with this being that I actually am a certified teacher and have 10+ years experience working in a preschool setting. Anyway, she decided I could have a 10 minute teaching slot before my 3 hour VPK kids go home. Whatever. \n\nThat isn't even the part I'm here for advice about. This teacher is miserable. In no certain order, these are just some of the things that have occurred since mid August, when the school year started:\n\n-She made a comment that, last year, she recommended that all the \"blacks\" in her class be put in the \"black\" kindergarten teachers' class just because that teacher is also black.\n\n-While commenting on a mixed race student on my roster, she said she would not claim the \"black half\" as it would \"only make life harder\".\n\n-She makes unprofessional comments and holds unprofessional conversations with parents at drop off and pick up.\n\n-She chases my parents out of the classroom if she thinks they've been in talking too long (she has done this multiple times with one of my parents who has deep concerns about her child's behavior and mental well being).\n\n-She constantly berates, belittles and corrects my teaching style, going so far to even suggest I should change how I have always taught to match hers.\n\nJust a few days ago, she was pulled in by our admin and told that there had been a few parent complaints regarding her, and that one of my students refers to her as \"the mean teacher\". Here is where I need advice - do I go to admin over this? I'm told that everyone \"knows how she is\" already, but I don't feel like that makes her behavior okay. But, I'm new and she has been at this school for 14ish years (only in pre-k for 3, though). Has anyone else dealt with a terrible co teacher, as well? I'm kind of at my wits end.",
    "title": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals)",
    "subreddit": "Teachers",
    "timestamp": 1573167874,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "Been loyal to both administrations I’ve worked for. Gotten nothing in return. I’m venting because I used to go to work thinking my loyalty to my boss was going to get me ahead. Don’t get me wrong, I work hard and try my best but one thing I’ve always been proud of is I’ve never been an employee who badmouths or disobeys the boss, even though it’s prevalent in this line of work. \n\nFirst instance of my loyalty getting me nowhere was as where I did my internship/student-teaching. I coached and did all sorts of adjunct duty for that school yet they couldn’t find a job for me, even after I had coached there for three years. The admin said I did a great job teaching, I got along with the department, always did exactly what was asked of me by higher ups and made sure I kept it friendly with the entire staff. Everybody was happy there and it seemed like a great place to teach. I didn’t complain once about not being able to get a job there. \n\nI eventually got a full time teaching job at a school not too far away. Like I did where I student taught, I coached and did every piece of adjunct duty admin asked. This place was unlike where I student taught though. The administration hated the teachers and vice versa. In my first one on one eval, my principal asked me to let her know what my department says about her. Being that she was the boss, I was going to follow that order, unprofessional or not. My evaluations the two years I was there were mixed. But I didn’t complain once. I’ve known teachers who run to the union of demand a re-eval if they don’t hear what they want. Not me. The boss-staff dynamic went even more toxic as administrators would send out emails putting teachers on blast and vice-versa. I could write a whole post on it I think if you’re reading you get the point. As you could imagine, no staff would volunteer for things like participating in rallies, chaperoning band concert trips or even taking tickets for theater productions. Enter me. And I didn’t complain about it once and always had a smile on my face when talking with administrators during this. Well, at the end of two years, I was called into the district office and the director of HR let me know the administration decided not to re-elect my position. They couldn’t even tell me to my face. When I talked to them, they gave me a half-ass letter of rec and I “you seem capable I’m sure you’ll be fine” talk. 🙄. This was the end of last school year. \n\nHere’s where I’m really perplexed - the school I did my internship/student teaching at recently had an opening in my subject area. But they told me they’re hiring another guy that recently did student teacher there because “they want a guy that can coach too”.\n\nHere I am 5 months into the school year without a full time job, wondering what the point of being loyal to your employer is...",
    "title": "Been loyal to both administrations I’ve worked for. Gotten nothing in return.",
    "subreddit": "Teachers",
    "timestamp": 1576651406,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Need help with how to bring up issues about how a class is structured I'm on mobile so I apologize in advance for the formatting. \n\nI teach Spanish in a district in Metro-Atlanta. This is my second year as a teacher and I was given a class that everyone in my department avoids like the plague, Spanish for native speakers.\nIt used to be a fantastic high level world language class until demographics began to change. In the past the school would have a good amount of students with Hispanic/Latino cultures and backgrounds who were also fluent in Spanish. That has changed. We still have a good amount of latino students, but they don't necessarily speak any Spanish. These students operate at a level one or lower fluency, but are placed in the Native Speakers class because of their background and last name.\n\nI have a huge problem with this as not only does it seems discriminatory on the basis of race and national origin, but we are also doing a disservice to the students by placing them in a high level class they are destined to fail. Not only that, there could be students with non-lstino backgrounds who could be fluent in Spanish and they are not placed in the class because their last name doesn't fit the description. \n\nI have brought up my concerns to administration and they were dismissed by telling me I am supposed to differenttiate within the varied language proficiencies. Now I am a relatively new teacher, but as far as I know, differentiation is used to challenge or support students within the same level, not to teach 4 different levels within one 50 minute class period. The school has no real requirements for this class. No proficiency test. As long as your name is Hernández you are placed in this class without a say. I have been tasked to keep the Latino students isolated in this class for the entire year and then make a determination of what level they should go to afterwards.\nAdministration's reasoning for this behavior is that it would be unfair for a fluent Spanish speaker to be at the beginners level, but many of them are truly beginners.\nI have a French last name, by this logic, my kids would be enrolled in a francophone class with complete disadvantage.\nI've decided to bring this up to my World Language director in my district since my school refuses to appropriately place students in the correct level.\nWhat should I say? Has anyone had a similar experience?",
    "title": "Need help with how to bring up issues about how a class is structured",
    "subreddit": "Teachers",
    "timestamp": 1564522018,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Advice Needed: Handling a Negative Lead Teacher I am in my first year of teaching. I teach high school English. There is a mentoring program at the school I work at but for the first three months I have been dealing primarily with the lead English teacher. \n\nNow, I know that I am going to make mistakes. And I have made mistakes....a lot of them. But each time I make a mistake, the leader teacher reminds me that my job is not secure for the first three years. And she is always coming at me with \"I've heard\" \"People have said\" \"I've been hearing\" about things I have said or done in the classroom. I never know where she is hearing this, it makes me feel like I'm on camera all the time, constantly being watched. And I never get a chance to defend myself or try to explain. She acts like she is listening to me, but she's not. \n\nAll of our interactions are negative. She never has anything positive to say about my performance. Ever. For all of October I became convinced that I was going to lose my job because of all the negativity she has said to me. I felt like I wasn't doing anything right. I cried a lot in and out of the classroom. Her negativity was affecting my performance in the classroom with my students. I expected constructive criticism. And she does tell me what I am doing wrong and what to do right, but she never tells me what I am doing right. I've mentioned this to my mentor and the head of the mentoring program. They offered no advice except that her criticism seems to be working because I am improving. So I got the impression I should just knuckle down and smile and nod. \n\nShe humiliated me in front of another teacher. She didn't like my lesson plans and was forcing me to come up with better ones that day before the class started. Since I couldn't do that, she was doing what she wanted me to do. I asked her if I should do another lesson and she looked at another English teacher that happened to be in the room and gave her a \"Can you believe how stupid this girl is\" look. After that I learned not to ask questions and just smile and nod to anything she said.\n\nNow, as I have said, I have made mistakes and some of them have been big. One edged close to but didn't cross the mandated reporter line. She scolded me about that, and several other things, yesterday. Today I was called into a meeting with the academic director, the principal, and a union representative. A student lodged a formal complaint against me. The other English teachers were gossiping about her in the lunchroom and something she did that warranted discipline. Later, that same student, and several others, heard me talking to myself about that same student and the discipline and the student felt called out and uncomfortable. It was made clear to me that student discipline is confidential and never should be discussed. So now the entire English department is in trouble for gossiping and I know they are going to retaliate against me. When the lead teacher isn't there, my colleagues open up more. When she is there, they completely ignore me and don't engage me in conversation or anything. \n\nAfter the meeting, the principal, union rep, and academic director made it clear that mistakes happen in a first year and the important thing is not to repeat them. The academic director fully supported me and everyone said the meeting went well and the academic director even shared his own mistakes with me to make me fully appreciate that I can grow. I felt much better after the meeting with him.\n\nThen the lead teacher decided to talk to me about it and she is convinced that I don't listen to her criticism and that I am not changing or improving and that I need to consider if this is the line of work I should be in. She asked if she would see me Monday, pausing to see if I would say yes or no. It's mixed signals. According to everyone else, I am improving. According to her, I am a failure and should seek other employment. I don't know what to do but something has to change because my mental health cannot take much more constant criticism. \n\nI was thinking of requesting that I only work with the lead teacher on English curriculum and work exclusively with my mentor and the academic director on teaching skills and learning. But I'm worried that the lead teacher will retaliate. I have no one to turn to. Could someone please tell me what to do?",
    "title": "Advice Needed: Handling a Negative Lead Teacher",
    "subreddit": "Teachers",
    "timestamp": 1574475266,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "My husband wants to leave the animation industry. Any ideas or suggestions on career options he could explore? \n\nHello everyone! Long time lurker, first time poster. My husband has been dealing with career struggles for a long time and I was hoping posting here could help generate some ideas on some possible career options and next steps. Any advice or insight would be greatly appreciated! \n\nFor some background info, my husband has been working in the television animation industry for the past 12 years. He started out as an animator, worked his way up to a supervisor position, and then became the director on a few productions (he’s managed teams of 65+ people). He studied animation in college for a few years but got offered a job before finishing, so as of now he only has a high school diploma as far as education goes. \n\nWhile he enjoys animation as a medium and likes the people he works with, the industry has mostly been very volatile and stressful. We’re in Canada, so most projects are service work for big studios in the US, meaning the studios are competing for projects with overseas studios offering bottom dollar. It’s essentially a race to the bottom.\n\nAll this to say, he’s thinking of leaving the industry in favour of something more stable and with better prospects as far as industry outlook and career advancement. We’re thinking of having kids in the next few years, and he doesn’t want to be an absentee dad. \n\nHe’s a great animator and artist, but he’s also very personable, likes managing people and projects, is a great problem solver, is someone who’s more than willing to work very hard and is very used to working in high pressure situations (I think he thrives in it honestly)! His biggest worry about leaving animation is that he’ll miss being creative; I think he needs to continue “making” things, if that make sense? He has a penchant for technology and gadgets, so I’m wondering if something in tech could suit him? We also discussed the idea of transitioning to video games (I work in that industry) but although my job has been blissfully good and stable so far, it’s still a notorious industry as far as stability and “crunch” goes. \n\nAnyways, taking all that into consideration, anyone have any ideas or suggestions on careers we could start researching?",
    "title": "My husband wants to leave the animation industry. Any ideas or suggestions on career options he could explore?",
    "subreddit": "careerguidance",
    "timestamp": 1557711981,
    "score": 18,
    "keyword": "mixed race director"
  },
  {
    "text": "Will leaving my job after two months wreck my career prospects? Two months ago, I took a position as the Director of Software Development at a small agency, and I walked into an unholy mess of a company. It’s basically a sinking ship. I was forewarned by my boss—who I know from a previous company, and we get along great—when I joined, but it’s bad. \n\nI also feel a little bait and switched: I’m stuck doing project management and dealing with clients all day, and unable to do my job, which is supposed to be helping people build great software. In a nutshell, I’m acting as client services and as a project manager. \n\nI just found out about a new opportunity for a young but successful company where I would be pretty hands-on with the tech, which is what I want. And, the pay’s better too. The new company is also doing something that’s good and socially responsible, whereas I’m at a agency now. That means a lot to me—for the last 14 years I’ve worked for companies doing some good in the world.\n\nDirector level jobs like mine are few and far between in my city, and when you mix that with a tech stack I love, getting to be hands on, and working somewhere high-energy, it’s pretty compelling.\n\nThe next closest two metro areas are a hour and a half (or more) commute, and with a young kid, I want to be close so I’m around more.\n\nSo I can’t figure out what to do. How shitty would it be to leave so soon, especially when I was brought in by someone I’m close to? For what it’s worth, he knows I’m not happy in my current job, but doesn’t know quite how close to leaving I am.\n\ntldr: Will taking a new job after two months be career suicide?\n\nEdit: If I was interviewing someone who left a job after two months, I don’t think I’d be bothered if they could explain it. While I think my explanation makes sense, I’m a bit biased towards things working out in my favor and need an objective viewpoint.",
    "title": "Will leaving my job after two months wreck my career prospects?",
    "subreddit": "careerguidance",
    "timestamp": 1558346988,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Need some unbiased opinions on my next career move! **Hey Reddit!**\n\n&#x200B;\n\nI'm currently at a really important pivot in my career with 2 phenomenal choices, however, I'm having a tough time deciding as I'm getting really mixed views on both decision. I would love some unbiased views! Here's some background on me and my situation: \n\n*- I currently work at a Fortune 100 company as a Junior Software Developer contractor (I make $35/hr or 72,800/year) and I recently got recruited for a job at a top 100 Ranked US University. I put in my two weeks as soon as I was notified of a physical offer and then received a counter from my current company (more info to come below).* \n\n*- I don't have any college degree though I have 3.5 years of schooling under my belt and I graduated from a coding bootcamp 2 years ago. I've found that when actively job searching, it's quite hard to acquire actual offers from larger companies without an actual diploma so I've placed getting a completed degree as a top priority with my decision. I love coding and eventually would love to work for a huge company like Google or Amazon and I believe that I can do so but I want to make sure I make the right moves to get there eventually.*\n\n*- Money is something that I can always work for, I'm really just looking for my best long term decision.*\n\n&#x200B;\n\nOf course, with this in mind, the University offer seemed rather clear to me (at first) - free tuition for 10 credits a semester, a title as \"Lead Drupal Developer\", good benefits, paid vacation, and smaller perks like a small pay raise from 72,800 (current) to 80,000 and free public transportation passes. It seemed like a no brainer to me (to get my degree) so of course, I was stoked and instantly accepted! \n\nHere are some other pros:\n\n\\- I would get to work closely with higher education heads (Directors of Marketing, Education, etc)\n\n\\- I would get to run my own team (4-man) \n\n\\- I would get to finish my undergrad (and possibly masters) for free!\n\n\\- I would work strictly in Drupal and gain experience as a Drupal expert. \n\n&#x200B;\n\nBut the next day I received an offer from my current company and here's where the decision making went a little haywire for me: I was given an offer of a raise at $50/hr (or about $108,000/year), and a pending FTE (full time employment) position upon the next available spot (though this was not in writing - but confirmed from 2 directors and the current lead who is getting promoted). At first, I turned down the offer since being secure at a FTE position (with free Tuition) seemed like the safer option. However, I received a SECOND counter offer the next week at $65/hr ($135,000) and got more information on what an FTE entails at this company: Half Tuition Reimbursement, Vest Interested (stock), 401k plan and contributions, Good Benefits & Paid Vacation, etc. I've been assured that I'll have an FTE spot within 2 months (though I'm a little wary of taking people's word for it and the higher ups were not in a comfortable position to \"promise\" FTE or have a written confirmation).\n\nHere are some other pros:\n\n\\- I know I work really well with my current team here.\n\n\\- I have a lot of fun working where I am currently.\n\n\\- I would run my own team (6-man and larger for larger projects)\n\n\\- I get to work with Executive VP's of Design and Technology for a large company\n\n\\- I would get to work with various different tech stacks (and really smart people that worked for places like Nike, Google, EA, Time Warner, etc)\n\n\\- Even if I didn't get FTE, I would still be able to pay for my own tuition (at any school I wanted \\[so possibly a more CS focused uni than I would be going to at the other job\\]) and benefits.\n\n\\- I have some flexibility to take a longer lunch/WFH (at least once a week) which is super helpful because I have a brand new 4 month old puppy. \n\n\\- I feel like a higher base pay helps me get a more competitive rate if I ever decide to leave my current company.\n\n&#x200B;\n\nNow, I've been assured that either move is good for me so I won't be worried once I've made a move. However, I just want to make sure I'm making the right moves to get into tech giant organizations for the future. Here are some of the questions I have:\n\n\\- Does having a University on your resume versus a large company have any impact on job searching/recruiting?\n\n\\- Is it normal for higher ups to deny written word for something like a contractor -> FTE conversion?\n\n\\- Would placing myself as a Lead Drupal Developer vs a Lead Architect Title hold the same weight?\n\n\\- Since I started off as a Junior Software Developer, does it look better to have that transition (to Lead Architect) on my resume rather than leaving to start a new Lead job at a University?\n\n\\- Is it normal to receive more than one counter offer? If so, does that bode well for you as an employee? (to me it seemed like they really wanted to keep me)\n\n\\- My recruiter (the one that got me the university position) told me counters are a typical ploy that companies use to hold you in a spot until they find a replacement (then they nix you) - has anyone had any experience with this type of situation?\n\n\\- Is it unwise to trust and wait patiently for an FTE position (I've been told that 2 months is the longest I'll wait) or should I just take an actual physical FTE offer now? \n\n\\- Is there anything I'd be sacrificing by going one way or the other?\n\n&#x200B;\n\nI would love some real feedback on this as clearly there's a lot of importance behind this decision with my future. I'm actually torn because I love what I do currently but I also have a really great opportunity on the table. Please let me know what you think!",
    "title": "Need some unbiased opinions on my next career move!",
    "subreddit": "cscareerquestions",
    "timestamp": 1554397301,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "Crossroads with IT Audit: 6 Years Experience First, some background on myself:\n\nBachelors of Finance from a great (but not Ivy) undergrad.  Master's Degree in Accounting from a different well known school. \n\nCompleted CPA exams almost 4 years ago.\n\n5 busy seasons of Big 4 IT audit working on a mix of Tech and Manufacturing clients. Performed very well in my time at the Big 4. Left right after completing my second year as a senior associate.\n\nOne year as an IT audit lead (working on SDLC projects specifically) at a major media firm. I've done very well this year and would say I'm the top \"non-manager\" employee in the group.\n\n&#x200B;\n\nThis morning, a VP in a different IT security group pulls me aside and says \"Great education, CPA, strong work experience.... What the fuck are you doing here in our IT audit group?\" He continues to tell me that his background was similar to mine (Accounting/CPA) and he regrets moving to IT Security because without any sort of Computer Science degree, he feels he's hit the ceiling in his career. I started looking at the education of the more senior executives, and he has a point. CTO, GRC SVP, CISO, etc all have computer science degrees from strong schools.\n\n&#x200B;\n\nThis conversation has made me question my own ceiling in the field and has me wondering if I should look into transitioning into a role that will make better use of my CPA (which I barely use now). Due to a recent re-org, our group is now reporting into the chief accounting officer, so I think there may be some opportunity to explore SOX compliance (or similar) roles on the accounting side. At the same time, I do have a pretty good thing going on the IT audit side, but I'm definitely not learning nearly as much as when I was at the Big 4. If I stay my current route, I can see two promotions in my future: SOX Implementations Director followed by SOX Senior Director, running the IT SOX program. After that, I'm not sure what else I would be qualified to do. Long term, I feel like it may be better for me to be an accounting professional with a strong IT Compliance background rather than an IT Compliance professional that also has a CPA.\n\n&#x200B;\n\nHas anyone else found themselves in a similar situation? If you were in my shoes, would you try to make a lateral transition to an accounting role?\n\n&#x200B;\n\n**TL/DR: I'm 6 years into an IT audit career without any formal IT education. I'm worried about my ceiling in this field and am considering a move to an accounting role to make better use of my CPA.**",
    "title": "Crossroads with IT Audit: 6 Years Experience",
    "subreddit": "Accounting",
    "timestamp": 1552948896,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "Managerial Accounting Grad Student Exam Help Hi Everyone. I am a last semester grad student (as long as I pass managerial accounting) hoping to graduate in three weeks. For my final exam, we were given a take home portion that has completely fried my brain. I am working on a non-profit management degree, accounting is way out of my wheel house.\n\nThe set up information for the questions is about four pages long, so I won't include it all here.\n\nBut, the questions are:\n\na- Prepare a monthly master budget for XX, Inc. for the year ended December 31, 2020, including the following schedules: Sales Budget & Schedule of Cash Receipts, Production Budget, Direct Materials Budget & Schedule of Cash Disbursements, Direct Labor Budget, Manufacturing Overhead Budget, Ending Finished Goods Inventory Budget, Selling and Administrative Expense Budget, and Cash Budget. (25 pts)\n\nb- Prepare a budgeted income statement and a budgeted statement of retained earnings for the year ended December 31, 2021, using absorption costing. (25 pts)\n\nc- Prepare a budgeted balance sheet at December 31, 2020. (25 pts)\n\nd- Prepare a budgeted income statement for the year ended December 31, 2020, using variable costing. Assume the per unit variable cost for 2019 was $7.0520. (25 pts)\n\n&#x200B;\n\nI have done all of a and b, but can't make anything balance. I'm tired and desperate.\n\n&#x200B;\n\nCould anyone offer advice as to where I could go for help? I have my answers but can't include them as photos here as it's an 11 sheet excel file. I could copy it into google sheets if anyone wants to see, but didn't want to put that out to the world right away.\n\n&#x200B;\n\nEDIT: Master Budget Case: XX, Inc.  \nXX, Inc. is a company that manufactures and sells a single product, which they call a Smarty. For planning and control purposes they utilize a monthly master budget, which is usually developed at least six months in advance of the budget year. Their fiscal year end is December 31.  \n\n\nDuring the spring of 2019, Jack, the XX, Inc. controllers, spent considerable time with Andrea, the Managers of Marketing, putting together a sales forecast for the next budget years. Unfortunately, they submitted their resignation and a sales forecast to the President Council of XX, Inc. Connor.  \nTheir sales forecast consisted of these few lines:  \n• For the year ended December 31, 2019: 575,000 units at $11.00 each\\*  \n• For the year ended December 31, 2020: 600,000 units at $11.00 each  \n• For the year ended December 31, 2021: 600,000 units at $11.00 each  \n\\*Consider expected sales for the year ended December 31, 2019 are based on actual sales to date and budgeted sales for the duration of the year.  \nThe President, desperately needing the budget completed, has approached you, a graduate management accounting student, for help in preparing the budget for the coming fiscal year. Your conversations with the president and your investigations of the company’s records have revealed the following information:\n\n1. Peak months for sales correspond with gift-giving holidays. History shows that January, March, May and June are the slowest months with only 1% of sales for each month. Sales pick up over the summer with July, August and September each contributing 2% to the total. Valentine’s Day in February boosts sales to 5%, and Easter in April accounts for 10%. As Christmas shopping picks up momentum, winter sales start at 15% in October, move to 20% in November and then peak at 40% in December. This pattern of sales is not expected to change in the next two years.\n\n2. From previous experience, management has determined that an ending inventory equal to 25% of the next month’s sales is required to fit the buyer’s demands.\n\n3. Because sales are seasonal, XX, Inc. must rent an additional storage facility from September to December to house the additional inventory on hand. The only related cost is a flat $20,000 per month, payable at the beginning of the month.\n\n4. There is only one type of raw material used in the production of Smartys. Space-age acrylic (SAA) is a very compact material that is purchased in powder form. Each Smarty requires 5 kilograms of SAA, at a cost of $0.45 per kilogram. The supplier of SAA tends to be somewhat erratic so XX, Inc. finds it necessary to maintain an inventory balance equal to 40% of the following month’s production needs as a precaution against stock-outs. XX, Inc. pays for 20% of a month’s purchases in the month of purchase, 45% in the following month and the remaining 35% two months after the month of purchase. There is no early payment discount.\n\n5. Beginning accounts payable will consist of $208,406.50 arising from the following estimated direct material purchases for November and December of 2019: SAA purchases in November 2019: $223,875.0 SAA purchases in December 2019 $162,563.50\n\n6. XX, Inc. manufacturing process is highly automated, so their direct labor cost is low. Employees are paid on a per unit basis. Their total pay each month is, therefore, dependent on production volumes and averages $9.50 per hour. This rate already includes the employer’s portion of employee benefits. All payroll costs are paid in the period in which they are incurred.  \nEach unit spends a total of 18 minutes in production.\n\n7. Due to the similarity of the equipment in each of the production stages and the company’s concentration on a single product, manufacturing overhead is allocated based on volume (i.e. the units produced). The unit variable overhead manufacturing rate is $1.40, consisting of: Utilities--$0.65; Indirect Materials--$0.25; Plant maintenance--$0.30; environmental fee--$0.14; and Other--$0.06.\n\n8. The fixed manufacturing overhead costs for the entire year are as follows:  \nTraining and development $ 43,200 Property and business taxes 39,000 Supervisor’s salary 149,400 Amortization on equipment 178,800 Insurance 96,000 Other 117,600 $ 624,000  \n• The property and business taxes are paid on June 30 of each year. The expected payment for next year is $39,600.  \n• The annual insurance premium is paid at the beginning of September each year. There should be no change in the premium from last year.  \n• All other “cash-related” fixed manufacturing overhead costs are incurred evenly over the year and paid as incurred.  \n• XX, Inc. uses the straight-line method of amortization.\n\n9. Selling and administrative expenses are known to be a mixed cost; however, there is a lot of uncertainty about the portion that is fixed. Previous years’ experience has provided the following information: Lowest level of sales: 375,000 units Total Operating Expenses: $878,710 Highest level of sales: 750,000 units Total Operating Expenses: $1,122,460 These costs are paid in the month in which they occur. Not included in the above expenses is bad debt expense.\n\n10. Sales are on a cash and credit basis, with 60% collected during the month of the sale, 30% the following month, and 9.5% the month thereafter. ½ of 1% of sales are considered uncollectible (bad debt expense).\n\n11. Sales in November and December 2019 are expected to be $750,000 and $1,600,000 respectively. Based on the above collection pattern this will result in Accounts Receivable of $703,250 at December 31, 2019 which will be collected in January and February 2020.\n\n12. During the fiscal year ended December 31, 2019, XX, Inc. will be required to make monthly income tax installment payments of $5,000. Outstanding income taxes from the year ended December 31, 2019 must be paid in April 2020. Income tax expense is estimated to be 25% of net income. Income taxes for the year ended December 31, 2019, in excess of installment payments, will be paid in April 2020.\n\n13. XX, Inc. is planning to acquire additional manufacturing equipment for $240,000 cash. 45% of this amount is to be paid in November 2020, the rest, in December 2020. The manufacturing overhead costs shown above already include the amortization on this equipment.\n\n14. An arrangement has been made with the local bank that if XX, Inc. maintains a minimum balance of $20,000 in their bank account, they will be given a line of credit at a preferred rate of 6% per annum. All borrowing is considered to happen on the first day of the month, repayments are on the last day of the month. All borrowings and repayments from the bank should be in multiples of $1,000 and interest must be paid at the end of each month. Interest is calculated on the balance at the beginning of the month, which includes any amounts borrowed that month.\n\n15. XX, Inc. has a policy of paying dividends at the end of each quarter. The president tells you that the board of directors is planning on continuing their policy of declaring dividends of $60,000 per quarter.\n\n16. A listing of the estimated balances in the company’s ledger accounts as of December 31, 2019 is given below:  \nAssets  \nCash $ 103,365  \nAccounts receivable 703,250  \nInventory-raw materials 9,000  \nInventory-finished goods 9,125  \nPrepaid Insurance 84,000  \nPrepaid property and business taxes 19,200  \nCapital assets (net) 824,000  \nTotal assets $1,751,940  \nLiabilities and Shareholders’ Equity  \nAccounts payable $ 300,000  \nIncome taxes payable 21,500  \nCapital stock 900,000  \nRetained Earnings 530440  \nTotal liabilities and shareholders’ equity $1,751,940",
    "title": "Managerial Accounting Grad Student Exam Help",
    "subreddit": "Accounting",
    "timestamp": 1557341229,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Any of you feel pressured to attend any after work event (especially in Big 4)? Hey guys,\n\nNot sure if it’s just me but I always feel pressure to attend social events after work all the time especially here at a Big 4. The culture makes it a taboo to not attend an event because it makes you look like a slacker and that’s just not the case. Sometimes people don’t want to attend events because they don’t feel like it or have other things to take care of.\n\nFor example, last month I was at a client and our service line (different industry though) was putting together (an optional) 5K for breast cancer. I happened to be out on a client where the director was the person that organized it and it started at 6:00 pm and lots of things were due since I was going to roll off. I remember she asked me the day before the race if I  doing it and I told her no I wouldn’t be able to. The next day, I came in and she didn’t acknowledge me or say bye before leaving the race (which she usually does). Stuff like that makes me feel so pressured to attend events because then to me it makes me look bad because it will be somehow tied to my performance/character and will affect my promotions/salary/etc. I may also be over analyzing it too. \n\nApologies for the rant but just wanted to see if anyone else felt this way",
    "title": "Any of you feel pressured to attend any after work event (especially in Big 4)?",
    "subreddit": "Accounting",
    "timestamp": 1558045165,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "Am I being screwed over? Apologies for the length, I just needed to get this off my chest. Work at a big 4, and last year made a move from IT audit into risk consulting. I am only being utilised on projects where they need someone to test IT controls. \n\nThings were finally looking up when I got booked onto a different project. Got pulled off at the last minute.  Been on the bench for the last 3 weeks (only person in the department at my grade who was on the bench). During this time, I approached senior managers/directors for work but was told there is not much in the pipeline (which is untrue when it comes to BD work). Others in the team have been approached to help out with the BD work despite being fully utilised. \n\nMy feedback has generally been very positive except for the last one which was mixed and raised points on professionalism. It said that I need to be more visible at client site and to avoid leaving early or to work from home (I wfh 3/4 times during the entirety of the project and if I left early, it was due to medical appts which my manager always knew about well in advance)  That I need to stop using earphones while working. That I shouldn't use Skype to communicate with other team members while in the room (these weren't even project related but just general chit chat). The latter two were not even communicated to me during the project and if it had been, I would have immediately adjusted my work style. \n\nFinal nail in the coffin: loaned out to do FS audit work which I know nothing about but am expected to be a SME because they think there's no difference between FS and IT audit. \n\nI have been thinking of my options: there's a potential opportunity to move to the strategy arm which might take time to materialise or to go back to IT Risk (I still have a good network in my old team who would help me move back).\n\nTL;DR: moved teams from IT audit to Risk Consulting, only being utilized on projects which involve IT controls and not being given opportunities elsewhere. What do I do?",
    "title": "Am I being screwed over?",
    "subreddit": "consulting",
    "timestamp": 1556991752,
    "score": 50,
    "keyword": "mixed race director"
  },
  {
    "text": "Not just Grown-ish: Black-ish has a color problem too Been thinking about this a lot and wanted to speak on it. As someone who is lighskin and frequently mistaken for mixed race I try to be very aware of my privilege within the black community and slight advantage in white spaces. I've never been able to fully appreciate Blackish or partake in the hype surrounding it because the majority of the cast seems to be made up of \"safe\" black people. Palatable for white audiences, that is. Other than the little girl, the rest of the family range from light to medium skinned. Half are biracial. Outside of the main family few of the guest characters are dark skinned, and it's always bothered me and kept me from getting into the show. If it's not representative of all of us then in my opinion it's not representative at all. \n\nContrast this with black entertainment in the 70's and even 80's and 90's when seeing dark skin on black shows, even dark skinned women, wasn't as sparse and uncommon. Even though I feel we have more overall representation today, it is less reflective of our features than before from my vantage point. There was less black representation back then but when there was, the characters were predominantly non-biracial black folk. As far as colorism in black hollywood, we've gone backwards. Name an attractive, popular dark skinned (or non biracial) actress besides Lupita and (sometimes) Gabrielle Union. Now compare that to Yara Shahidi, Amandla Steinberg, Tessa Thompson, Laura Harrier, Zendaya. These are the faces young black women in my age group have. It's not as alienating for me because (to a degree) I look like them. But most black women don't. There are no dark skinned equivalents. It really saddens me and as someone who wants to write and direct movies/tv someday, I hope to amend it with my work. More of us gotta start writing content and casting ourselves. \n\nI do see it getting a little better in the music industry. We have Lizzo, a rise in female rappers with regular black backgrounds and black features, although even that has been overshadowed by Cardi B. The new black female artists who've enjoyed the most success, other than Lizzo, are biracial or lightskin. Jorja Smith, Ella Mai, H.E.R (Black passing but still biracial), in addition to Cardi who has had the most. Beyonce and Rihanna still reign supreme. \n\nStill! There's hope. A few years ago I really couldn't see people like Lizzo (or Noname) getting exposure or a chance to become popular. I think the internet has allowed for a lot of people to get platforms they wouldn't otherwise have, which has indeed resulted in oversaturation and mediocrity, but also for some great talents to emerge and get traction. \n\nWhat do you ladies think about this issue?",
    "title": "Not just Grown-ish: Black-ish has a color problem too",
    "subreddit": "blackladies",
    "timestamp": 1556978071,
    "score": 85,
    "keyword": "mixed race director"
  },
  {
    "text": "Racism and sexualization I experienced at Child Care Job Racism and sexualization I experienced at Child Care Job\n\nI’m a mixed black woman living in a very white Midwestern state. Recently, I was a child care worker at a super white and Trump supporting day care (didn’t know it when first applying for job) and I have never experienced such blatant racism! A lot of the white People were shocked to see I was working there and they reacted by ignoring me, giving me a dirty look to my face, talking about me in front of my face, and watching my every move to make sure I didn’t steal, lie or abuse the kids. They acted like I was the first black person they ever interacted with. They were envious I was in graduate school and ate healthy  also. Everytime a kid would cry, a worker would rush to my room and ask the kid what was happening. I felt like I had to always smile and not show any negative emotion like anger in order to make them comfortable and not fearful. I swear that job added to my ptsd.  One mother of a child saw me, ignored me, then asked another worker who was going to be looking after her baby (definitely implying she didn’t want me to). Also the child care workers told me to make sure I wore conservative clothes and to not flirt. While some of the other workers came in yoga pants and flirty and the managers didn’t say anything. They assumed I would be hypersexual and try to steal husbands or something! Then the child care director tried to figure out my insecurities and make me feel inferior/insecure by bragging about blonde women with blue eyes then watching me to see my reaction. It’s like she didn’t like seeing how I was happy, successful and black at the same time.\n\nThen after working for some time, a lot of the white fathers of the children started sexualizing and had crushes on me which made the white women more mad. What made me quit, though, was when a couple assumed I had abused their kid because she all of the sudden started having accidents (peeing). When his daughter was probably having accidents because of their marital concerns—- the husband cheated on his wife with the other day care workers and was trying his hardest to get with me. The father was also a police officer. And then the white co-workers became envious the police officer liked me because they all wanted him so they got even meaner and tried to sabotage me. I am betting they were telling the police officer lies about me being dangerous or crazy or something which is another reason the girl’s parents assumed the worst—that I was abusing her. \n\nWhat confused me was he was obviously racist (he didn’t acknowledge the other black woman worker) but acted like he was in love with me. but I think he was only nice to me because he thought I was attractive. Or then i wondered if it was a colorism thing but I doubt it because I was like the same skin color as her in the summer. I wonder if they were stereotyping me based on jezebel stereotype or sexualized mullato (although I doubt they knew I was mixed)?\n\nI also had no one to turn because the day care director was the most racist of all and would direct her workers to watch me. She would let her white workers come in late but was hard on me if I did. \n\nI feel hurt and angry Thinking about my experience at this job especially so because it confirmed that white people reject me, see me as other, and as a threat no matter what I do and who I am.\n\nWorst job. Should have made a complaint  for discrimination and reported them. Anyone relate or have similar experiences while working at child care?\n\nEdit: As for the parents assuming I abused their kid.. there was definitely racism and stereotypes going on there. But I also have to say, during that time, I was very emotionally unstable. I had just moved out of my abusive parents’ Home out on my own, financially independent for the first time. I was victim blamed from my family for my dad’s sexual abuse so I didn’t have any support system. Also, I already had trauma reactions from past racial discrimination. So being around all these white People made my ptsd alive and I was super hypervigilant, had major mood swings, was dissociating, and would sometimes be standoffish and other times friendly. It’s important I mention this because this played a factor in my treatment. But I still wouldn’t have been this mistreated if I was white. And I know this because there was a white girl that started right after me who was often angry, yelled at the kids, and was emotional.. but they didn’t care. And they weren’t watching her constantly or checking her kids in the room frequently.\nAlso, I forgot to mention, when I first applied the director almost was warning me about the location. Because she said, “this location is very Lilly white. Maybe you would prefer our other more diverse location since you are going to graduate school for social work.” Basically this woman segregated her child care centers. One was all white and the other was diverse. I was the first black woman to work at her “white” center.",
    "title": "Racism and sexualization I experienced at Child Care Job",
    "subreddit": "blackladies",
    "timestamp": 1548154953,
    "score": 60,
    "keyword": "mixed race director"
  },
  {
    "text": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S. Hey all! I’m a producer for Empowered Health, a new podcast that is aiming to demystify women’s health.\n\nWe just put out the first episode of our two-part series on the maternal mortality crisis. Episode one explores how race plays a role in this crisis– it becomes clear our culture isn't doing enough to protect black mothers. Black women are three to four times more likely than non-Hispanic white women to die during childbirth. That’s even after adjusting for socioeconomic factors, like education and income.\n\nAs more than one researcher said to us, the birthing crisis is the canary in the coal mine of women's health. It is a problem of women not being listened to, not being respected and being disempowered during a time in life when they should feel entitled to good care and a personal feeling of empowerment, feeling full of feminine power and purpose.\n\nDr. Neel Shah, the director of the Delivery Decisions Initiative at Ariadne Labs, breaks down how medical students are trained to be biased and how that contributes to this problem. Fatima Dainkeh of YWCABoston helps us understand actually talking to black mothers is a good place to start and that a day-long workshop on bias isn't going to cut it. Midwife Ebony Marcelle shares how she's shaped her care model to better serve African American mothers. And, Dr. Mary-Ann Etiebet, the executive director of Merck for Mothers, looks at the global initiative she heads working to integrating the voices of black women into maternal mortality and morbidity.  \nFigured this group might be interested in this episode, here's the link:  \n\n[https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392](https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392)\n\n(links to other streaming platforms on our website www.empoweredhealthshow.com)",
    "title": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S.",
    "subreddit": "blackladies",
    "timestamp": 1555987676,
    "score": 29,
    "keyword": "mixed race director"
  },
  {
    "text": "Examples of Midwest racism; How do I not take racism personally? Examples of Midwest racism; How do I not take racism personally?\n\n&#x200B;\n\nI am going to give a some examples of covert and overt racism I have experienced as a 26 y/o half black and half white female living in the midwest this past year:\n\n1. Last fall I started my first new job as a therapist in a very white and wealthy area. I go to the school with my white supervisor to first meet with the staff at the school. During the meeting, the staff at the school start talking to my supervisor because they assume she is the therapist and then get shocked/visibly uncomfortable/anxious when they find out I will be the therapist at the school. Ugh, the worst--i felt embarrassed and anxious!! During my first week at the job, one of my white blonde coworkers is visibly uncomfortable and anxious around me. Every time I come into her classroom, she gets anxious and makes comments to show she is not racist such as \"I am going to watch Black Panther tomorrow!\" or \"I love the show, Dear White People!\" or she says to one of the only black kids in the classroom, \"I love your beautiful brown and and skin!\" So awkward and uncomfortable!!! It makes me think she is actually racist/ignorant for trying to work so hard to prove she is not.  Something else she did was she pitied one of the only black boys and talked about how his mother did not care about him and totally had the whole \"white savior complex\" where she tried to save the black kids. She was extra easy on him and let him get away with things more than the white kids and maybe its because she pitied him but also she might think that if she is super nice to him then she won't seem racist. I almost feel like her and the other coworkers were super nice to him to prove to themselves they were not racist and to wash away all the guilt they may have for being racist in the past. I quit that job in less than two months. I feared she would start watching me closely to make sure I didn't abuse the kids or act aggressive/angry like the black mother of the kid or act like the \"black stereotype.\" Anytime I showed anger, she became visibly tense and scared. I didn't feel safe or comfortable in that environment to say the least.\n2. I go into Target in the self-checkout lane and am putting water into paper bags. I happen to look up at the camera and see this white employee behind me watching my closely as I put the water in the bag while she is pretending to fix up some bags. She sees that I see her in the camera and she walks quickly away. As I leave, she smiles and wishes me a good day. I tell her the same. All that passive aggressive, midwestern nice, and covert racism wrapped up in one. Now I understand that the state I live in has a tremendous class gap between blacks and whites. Where most black people are lower class and most white people are middle class. So often I feel isolated being a black mixed race middle class woman.. but it is ignorant for some of these white people to think every black person is going to steal and is lower class.\n\n&#x200B;\n\nI do not feel safe in majority white areas. Sometimes I will drive further away from my home to shop at a Target where it is more diverse (but also a lower class neighborhood) in order to not feel so hypervigilant in white store areas. I have recently started shopping on line so I don't have to feel so on edge while shopping. These racist experiences are very painful and angering, and hits a tender spot inside of me. Every time a white person is racist to me, it feels like rejection like even though I am half white, I will never be one of them. Also, I hate it when people assume the worst of me like I am lower class and will steal just because of I am mixed black. \n\n&#x200B;\n\nSo first off, I am saving to move to a more diverse state. But in the meantime, I am trying to figure out how to not take racism so personally? Like when I experience racism, it ruins the rest of my day as I feel really down. Any advice? Thanks!",
    "title": "Examples of Midwest racism; How do I not take racism personally?",
    "subreddit": "blackladies",
    "timestamp": 1550425404,
    "score": 32,
    "keyword": "mixed race director"
  },
  {
    "text": "History of feminism the way they don't want us to know! This is the speech the Cambridge feminists did not want anyone to hear. Its Elizabeth Hobson's speech from the Justice 4 Men & Boys event yesterday. Published with her permission.\n\nHello and welcome to The History of Feminism, I want to make two disclosures before I begin: firstly, that this lecture will concentrate on the Western world – particularly the Anglosphere. I am not suggesting that, that’s where feminism’s boundaries reside or denying its existence elsewhere but it does start here and here is where my real expertise lie. And secondly: this may come as a surprise to you but I am not a feminist. I am an ex-feminist but after studying the movement, I struggle to see how any reasonable person could know what I now know and be anything other than opposed to it. I’d like to thank the powers that be at Cambridge University for refusing to bow to pressure from the mob and allowing these talks to go ahead and I’d like to condemn the emotional reasoning of those who would have stopped them. The purpose of further education is not to make people feel comfortable, it’s to challenge preconceived ideas and to build the capacity to meet challenging concepts head on and to grow from those experiences. Universities should be arenas wherein students build resilience, tolerance and dignity but increasingly activists are subverting these spaces to feed anxiety, black and white thinking and hysteria within their communities which is harmful to the search for truth that they should be engaged in – and harmful to the individuals that they claim to want to protect (including themselves). So, finally, thank you to everyone sitting here now: to those who’ve come in support of our work, those here out of curiosity, and especially to anyone who’s expecting to be offended, yet intending to engage because that shows some strength of character!   \n\nBefore I get stuck into the recorded history of feminism, I need to take a moment to illuminate the biological roots of the movement. Human beings are a gynocentric species – this means that we prioritize the needs and well-being of women over men. This is an evolved instinct that came about as a result of women being the limiting factor in reproduction – ie. women have a much lower ceiling on how many offspring they can physically produce – and in small communities that are subsisting this makes them highly important because they potentially hold the key to whether or not the collective will survive at all. This is why we traditionally send only men to war, this is why we have the “women and children first” Birkenhead Drill, this is why people are more likely to put themselves at risk to save a woman in danger than a man – and it’s why we have feminism. Feminism has taken our gynocentrism and weaponized it. \n\nMen’s role in this evolutionary sense is to act as a genetic filter – both to mitigate gene replication errors (ie. Preventing less successful combinations multiplying by barring many men from reproducing) and to produce and retain genetic recombinations that enhance the fitness of offspring. To these ends, male fitness is constantly policed to ensure that women’s standards are met before they gain sexual access – which is why far fewer men than women reproduce.  Because the pay-off of carrying particularly successful genes is so much greater for men (women will likely have the opportunity to reproduce if their fitness is moderate, men may well not), evolution gambles with male genes. This results in very different bell curves for men and women in terms of IQ and physical and psychological health, with men being over-represented at either end of the distribution (particularly intelligent/healthy or unintelligent/unhealthy) and women clustering around the middle. Feminists focus on the apex of male achievement to prove that men enjoy greater success than women (whilst ignoring the biological reasons that catapult a minority of men to the stratosphere) and on the acts of the most malevolent minority of men to generalize their patterns of behavior as emblematic of masculinity (whilst ignoring the fact that the very demographics that preoccupy them show that what is emblematic of masculinity is actually variability).  \n\nSo, human beings have always valued women more than men and been more critical of men than women. These were necessary instincts in tribal communities but they have been manipulated to privilege women to the point of dysfunction – and this began with the development of proto-feminism, which arose in the late Middle Ages. Queen consort of France and England, Eleanor of Acquitaine spearheaded a movement within her court to subvert the chivalric code (which had traditionally governed relations between knights and lords and the general public) to regulate the behavior of men towards women. These women initiated a system of romantic feudalism wherein noble men were under irresistible pressure to identify a lady as midons (my lord) and to submit to her will and delicately accept any scorn that his midons saw fit to extend to him. Eleanor established Courts of Love in which she and her noble women would administer “justice” in romantic disputes. Not only may many men in particular recognize this state of gender relations – but the modus operandi that Eleanor and co used to achieve their supremacy is entirely familiar: they generalised about all men based on the poor behaviour of a minority, asserting that women needed protection from men’s violations, and they pushed forward a narrative of women’s moral superiority, justifying female dictatorship. Within 200 years, Eleanors’ ideas had spread and saturated throughout Europe and throughout the class system. \n\nLa féminisme proper was born in the revolutionary France of the late eighteenth century – the political force first, the term around half a century later. In 1791, Olympe de Gouges published The Declaration of the Rights of Woman and the Female Citizen in response to the Declaration of the Rights of Man and of the Citizen. By publishing this document, de Gouges hoped to expose the limitations of the French Revolution in the recognition of women’s rights and to initiate changes in the Declaration of the Rights of Man to include sex equality. De Gouges opened her Declaration with the quote, \"Man, are you capable of being fair? A woman is asking: at least you will allow her that right. Tell me? What gave you the sovereign right to oppress my sex?\" [close quote]. In the preamble, de Gouges mirrors The Declaration of the Rights of Man, explaining that women, just as men, are guaranteed natural, inalienable, sacred rights - and that political institutions are instituted with the purpose of protecting these natural rights. She closes the preamble by declaring that \"the sex that is superior in beauty as it is in courage during the pains of childbirth recognizes and declares, in the presence and under the auspices of the Supreme Being, the following Rights of Woman and the Female Citizen.\" [close quote]. She was one of a small number of women beheaded for treason during the revolution. \n\nCharles Fourier is credited with having originated the word \"féminisme\" in 1837. A founder of utopian socialism and a slightly later supporter of women's rights, he believed that all jobs should be open on the basis of skill and aptitude rather than sex segregated and that traditional marriage could potentially hurt woman's rights as human beings, he himself never married. Fourier is believed to have influenced Karl Marx who argued as early as 1844, in his Economic and Philosophical Manuscripts, that women’s position in society could be used as a measure of the development of society as a whole. In The Communist Manifesto, Marx and Friedrich Engels celebrated the dissolution of the bourgeois family, with an erosion of the status of the father already taking effect as women entered the workforce. This, they believed, would lead to “a higher form of the family” in which women would be the true equals of men. Several years ago, at a FiLiA debate I heard Sheila Rowbotham explain that nobody could understand feminism without reading this book. International Women’s Day itself, has Bolshevik roots. Clara ‘The Grandmother of German Communism’ Zetkin and Rosa Luxemburg, at the Socialist Internationale in 1910, advocated for a Women’s Day but the date was not set in stone till 1921 when the USSR officially adopted March 8th which was selected to commemorate a specific date that led to the Russian Revolution. Specifically, a 1917 workers strike at a weapons factory in Petrograd. The women workers strike that modern feminists claim was the inspiration for International Women’s Day did not start until March 9th. \n\nMoving to the United States, in the pioneering Declaration of Sentiments from Seneca Falls in 1848 (generally taken as the seminal text of the first wave of feminism - though I would argue that it’s actually the second after de Gouges declaration) the claim was made that “The history of mankind is a history of repeated injuries and usurpations on the part of man toward woman, having in direct object the establishment of an absolute tyranny over her.” This is not justified by the history – of men risking their lives both in work and war to provide for and protect women, their families and their homes. Granted, the text highlights a series of injustices that women were subject to, however such a claim remains myopic and misleading. Under coverture legislation for example, while husbands did become the legal owner of all family assets, in reality, this came with responsibilities, and wives were not left entirely devoid of rights – their rights were simply different. Husbands could be criminalised for failure to keep their families as well as he could reasonably be expected, wives’ permission was required to sell any houses owned by the family – and actually if a member of a man’s household ran up debts, he was legally responsible for their repayment. Yes, women deserved to be granted various rights – but so did men, who did not deserve the derision they received from first wave feminists (including Christabel Pankhurst who notably explained in her 1913 book The Great Scourge, that men were “little more than carriers of venereal disease”). Furthermore, in his 1913 volume ‘The Fraud of Feminism’, Ernest Belfort Bax identified “two distinct sides” to feminism: an “articulate political and economic side embracing demands for so-called rights”, legitimately – and “a sentimental side which insists on an accentuation of privileges and immunities”. There is no mention in The Declaration of Sentiments (or any first wave texts) of the privileges and immunities enjoyed by women, nor any injustices faced by men.  \nThe women’s suffrage movement in the U.S. was tainted by racism. Although an African-American abolitionist, Frederick Douglas, did take to the stage at Seneca Falls – no African-American women are believed to have been present. Furthermore, feminist heroines like Elizabeth Cady Staton who organized the meeting at Seneca Falls and was a co-author of the declaration embraced her racism explicitly, characterising black men as inherently inclined towards rape, throughout her career. She also argued vehemently against the 15thAmendment (that would extend the vote to African-American men), claiming that it would degrade women to follow black men into the franchise.\n\nThe Women’s Social and Political Union – or Suffragettes – in the U.K. were not afflicted by racism. They actually took pride in the strength of support for women’s suffrage throughout the British Empire. The night before the coronation of George V in 1917, a demonstration was held to demand the right for women to vote, which featured an “Empire Pageant” featuring representatives from India, Australia, New Zealand, South Africa and the West Indies – and Indian Princess, Sophia Duleep Singh, was a major donor. They were not, however, devoid of bigotry – and I don’t just mean towards men – British Suffragettes held a special contempt for the working classes. Not only did they fail to rally behind the truly progressive call for universal suffrage, preferring to campaign for women to be able to vote “on the same terms as men” (ie. with property qualifications) but they embarked on a campaign of terrorism that may have hurt some middle and upper-class opponents (or insufficiently active supporters) financially but would put working class lives in both direct and indirect danger. They smashed shop windows and burned or bombed 17 industrial premises, including a lino factory, a laundry, woodyards and freight yards. They also targeted the café at Kew Gardens with an arson attack – destroying a business that was owned and staffed by women and destroying their livelihoods in a pre-Welfare State society. When the proprietor went to the WSPU to complain, she was told that she was taking ‘too personal a view of the matter’ and that the staff would no doubt be glad that they had lent support to the women’s cause.  96 homes were targeted. One was that of the Chancellor of the Exchequer, Lloyd George, which was empty under renovation. The bomb exploded just before his builders were due to start work so narrowly avoided injuring them, it did however destroy tools which were provided by the men themselves – who may well have ended up on the streets or in the workhouse as a result of their loss. Other houses – though the Suffragettes insisted that they only targeted them when empty – actually contained staff who were put at risk. Sulphuric acid and phosphorus in letter bombs caused a number of postmen to suffer severe lung damage and/or burns. A bomb planted outside the Bank of England would, if it had not been defused by a policeman, have gone off in a busy commercial area mid-afternoon. A bomb at Lime Street station, Liverpool, was packed with nuts and bolts to maximise harm. A bomb containing 24 cartridges of gunpowder was placed in the toilets of a theatre to go off during a matinee performance. The congregation at St John’s, Smith Square, had to put out a bomb containing 5½lb of gunpowder. Another bomb was chucked into a full Territorial Army barracks. The jockey whose horse ran over Emily Davison at Epsom in 1913 (Herbert Jones) suffered flashbacks to the event throughout his life until he committed suicide in 1951. The idea of these women as noble heroines is an outrage to any right-thinking person – and the idea that their terrorism led to the extension of the vote is implausible. They dropped their suffrage campaign entirely with the onset of WW1 (and a £20,000 grant from the government) and embarked upon their white feather campaign, for which they have further blood on their hands. Universal suffrage was won by quietly committed lobbying from the suffragist movement – and the sacrifice of so many working-class men in the war.\n\nTo understand the evolution of feminism from first to second wave, we need to look at the birth of critical theory. Critical theory emerged from the intellectual collective known as The Frankfurt School. They began their mission in 1923 with the establishment of the Institute for Social Research at the University of Frankfurt. Initially, founder Felix Weil and director Carl Grunberg, along with fellow orthodox Marxists, tasked themselves with making Marxism a viable alternative economic system to rival capitalism but from 1930 under, new director, Max Horkheimer the focus shifted to an examination of the culture out of which Capitalism flourishes, in order to subvert it to accommodate Marxism. Thus critical theory was established. The group moved its activities to the U.S. in 1933, in response to the rise of Hitler, to become associated with the University of Columbia in New York. Here, Erich Fromm pioneered the marriage of Marxist theory with Freudian theory and characterised the family (which they rightly identified as the building blocks of Capitalism) as repressive and pathological. Herbert Marcuse’s Eros and Civilization was published in 1955 in which a society based on free love and no work that liberated the human natures (that he felt were being repressed by Capitalist society) was proposed. This book was a major channel through which neo-Marxist ideas fed into various liberation movements in the 1960s, including of course feminism. Of feminism, Marcuse claimed that “the Women’s Liberation Movement is perhaps the most important and potentially the most radical political movement that we have.” Marcuse’s sentiments were echoed by Shulamith Firestone, founder of the Redstockings collective, who published The Dialectic of Sex in 1970, another utopian (or dystopian, depending on your perspective) radical classic that argued that the domination of men as a ‘sex-class’ over women as a ‘sex class’ (or “underclass”) was based in biology which needed to be overcome through advances in medical science that would liberate women from the “barbaric” practise of childbirth. She held the nuclear family, which she labelled a tyranny, in contempt and advocated for rationally constructed non-permanent bonding relationships between people who voluntarily undertook their upbringing in which “the dependence of the child on the mother (and vice versa) would give way to a greatly shortened dependence on a small group of others in general”. Kate Millet’s sister recollected a consciousness raising group that she attended with Kate in the New York of 1969 that opened with a back-and-forth recitation:\n\n“Why are we here today?”\n\n“To make revolution”\n\n“What kind of revolution?”\n\n“The Cultural revolution\" \n\n“And how do we make Cultural Revolution?”\n\n“By destroying the American family”\n\n“How do we destroy the family?”\n\n“By destroying the American Patriarch\"\n\n… it goes on, but you get the gist! Feminism became the leading vanguard in the subversion and desecration of a comparatively decent, prosperous civilisation. Their battle in this culture war was the decimation of the family and they would achieve victory in that battle by destroying men – a process they would enact by attrition of the esteem in which men were held, their identities and eventually their rights. \nA host of extreme misandrists poured forth bile during this period, thinkers like:  \n\n• Andrea Dworkin (“Under patriarchy, every woman’s son is her potential betrayer and also the inevitable rapist or exploiter of another woman.”),\n\n• Catherine Mackinnon (“Male sexuality is apparently activated by violence against women and expresses itself in violence against women to a significant extent.”),\n\n• Valerie Solanas (“to call a man an animal is to flatter him”),\n\n• Robin Morgan (“I feel that 'man-hating' is an honourable and viable political act”)\n\n•  Germaine Greer (“Men are the enemy”),\n\n• Shulamith Firestone (“all men are selfish, brutal and inconsiderate”) \n\nMarilyn French (“All men are rapists and that’s all they are”).\nHowever, I think it’s well worth looking at the more apparently benign representatives of the movement and unpicking what they had to say. In 1970, Irina Dunn coined the phrase “A woman needs a man like a fish needs a bicycle”, which was popularised later by Gloria Steinem. Referring to whom, I ask? To the countless generations of men who had endured the dirtiest, most dangerous and thankless labour to support their families? To their relatively recent male ancestors who fought for women’s suffrage (such as Jeremy Bentham and Henry Fawcett) and the elected representatives who would ensure such legislation passed (such as John Stuart Mill, whose male constituents elected him on a platform including female suffrage)? To their fathers who may well have participated in World War Two to protect their societies and families? To their brothers? Friends? Lovers? I believe Gloria Steinem had many of those – and was supported morally and financially by a number of them too. It may sound cute and catchy but it’s both contemptibly narcissistic nonsense and reprehensibly offensive.\n\nSecond wave feminism saw campaigns for equal pay which was realised in 1963 with The Equal Pay Act in the U.S. and in 1970 in the U.K. with our Equal Pay Act. It is, of course, entirely fair to legislate against malicious sex discrimination but, as we can see from the landmark case that led to Barbara Castle implementing the U.K.’s Equal Pay Act, the nature of the acts is far more expansive, responding not to simply the same jobs but to “work of an equal value”. The Ford Dagenham machinists strike in 1968 followed a re-grading exercise by Ford who classified sewing seat covers for cars (predominantly performed by women) as less skilled than jobs on the production line (largely done by men), resulting in a fifteen per cent pay disparity – and the court to which the case was referred found in Ford’s favour. There was no sex discrimination in this famous case, simply fair pay for different roles, but feminist activism continues to force the hands of employers not to make rational economic gradings but to ensure that men and women go home with increasingly similar pay packets regardless of relevant factors, and hey it has almost certainly led to less pay for Patriarchs, weakening their ability to provide for their families and putting stress on their relationships so it’s a win-win for feminism.\n\nSecond wave feminists also fought for access to contraceptive pills and abortions. The pill entered the U.S. market in 1960 but it wasn’t until 1972 there that it was made available to single women and, previously being at the discretion of individual medical practitioners in the U.K., it was incorporated into the National Health Service by Barbara Castle in 1974. This has led to far greater choice for women in terms of life paths, more sexual freedom and better physical health outcomes – and yet some have experienced a historically new pressure to be sexually active and a corresponding ennui in response to their sex lives, whether they believe they’re lacking or they fail to find meaning in casual sex. Abortion was legalized in 1967 in Scotland, England and Wales and found to be a constitutional right in 1973 in the U.S. There has always been a proportion of women who have killed their babies, bodies of new-borns believed to have been suffocated at birth have often been found behind Roman villas and prior to the act women turned to untrained practitioners who would administer folk-medicines or insert knitting needles into the womb through the cervix and obviously medicalised abortion up to a certain point is more humane for both the unborn child and the mother – and far safer for the latter. However, the callousness with which feminist activists typically have and still do approach the subject shows no concern for the sanctity of human life and precious little for the psychological well-being of the women who are told that expelling a “clump of cells” is a liberating act that will have no deleterious impact on her whatsoever (yet alone any sympathy for the men involved).\nA concerted struggle, on the part of radical feminists, began against pornography during the second wave. Feminist campaigners like Andrea Dworkin and Catherine Mackinnon joined forces with the religious right to raise concerns about trafficking and coercion in the industry and claimed that men’s consumption of porn led to increased risk of sexual assault and rape for women in free societies, as well as diminishing their capacity to be viewed as full human beings. In the U.S., several states enacted local ordinances that intended to treat porn as a violation of women’s civil rights and to allow women who believe they have been harmed by porn to seek damages in civil courts. The Dworkin-Mackinnon Ordinances were opposed as a threat to women’s freedoms by sex-positive feminists such as Camille Paglia and Wendy McElroy and were eventually shot down as violations of the First Amendment.\n\n The third wave of feminism emerged in the 1990s. It is characterised by intersectionality. Rebecca Walker, one of the founders, explained that “Feminism, in order to stay relevant, had to become about more than gender equality.” In an effort to be more inclusive, third wavers have embraced the grievances of – well, anyone who will identify straight white men as the problem. With literally no “rights” to be won, feminism became increasingly navel gazing – or more specifically a little lower – and obsessed over the minutiae of female existence in the modern Western world, finding oppression and abuse everywhere – from the make-up aisle to the bedroom. On university campuses posters were going up with the Ms. magazine study statistic that one in four college women was the victim of rape or attempted rape. This feminist lie was concocted by Dr Mary Koss who broadened the definition beyond any reasonable limit and in defiance of the 73% of her apparent “victims” who did not classify their experiences as rape. Take Back the Night Marches were growing, with participants chanting “2, 4, 6, 8, No More Date Rape” and giving emotional monologues about mistreatment at the hands of men. A moral panic was underway that still resonates darkly today. If Paglia, McElroy and their sex positive cohort thought that they had won the war for the hearts and minds of liberated young women in the 1980s, they were to be dramatically disproven just a decade later by an anxious and vulnerable generation of feminists. \nIn 1993, the Duluth Model was created in Duluth, Minnesota, founded by Ellen Pence (not, I believe related to Mike but certainly a good reason for his rule…). Used in all U.S. states (although recently seriously weakened by Donald Trump) as well as 17 other countries (including the U.K.), The Duluth Model is a gendered theory based on feminist beliefs. It contends that men’s violence towards women is based on a sense of entitlement arising from being part of the privileged ‘sex-class’ in a Patriarchy. Moreover, it expands the definition of domestic violence to include all manner of behaviours – from threatening to leave her or commit suicide to displaying weapons to making her feel guilty to making big decisions to giving her an allowance… It’s a mix of both clearly abusive behaviours and behaviours that exist in a very grey area that could conceivably be part of fairly healthy relationships. There is very little room left in Duluth Model theory or indeed the agencies that employ it for male victims of domestic violence, especially where it’s perpetrated by women, and it is a recognised phenomenon to see male victims end up in Duluth-inspired abuser intervention programmes that teach them that their masculinity is problematic. Erin Pizzey (founder of the first U.K. women’s shelter) describes the lead up to such instances using the acronym: DARVO. It stands for ‘Deny, Attack, and Reverse Victim and Offender’, she says that “A particular trait of women abusers when confronted with their behaviour, for example by the police, is to turn the tables on their victim by claiming to be the victim themselves.”… A police force informed by Duluth, of course, is inclined to believe her.\n\nAnd now a new wave of feminism appears to be quickening, with a schism between older third wavers and a new generation. Rene Denfield writes that current feminists “promote a new status for women: that of the victim” while Naomi Wolf laments that a substantial segment of modern feminism is devoted to victimhood. \n\nIn recent decades feminists have successfully promoted the idea of 'Believing the victim,' in cases of alleged violence, harassment or sexual misconduct against women - regardless of available evidence. In the words of Lena Dunham: “Things women don’t lie about: rape.” This subjective reasoning has led to campus rape trials in kangaroo courts across the U.S., Australia and Canada (they’ve been advocated for here in the U.K., but remain to be implemented, although the Varsity student newspaper informs me that they’re under serious consideration here at Cambridge now). They are governed by amateurs with inadequate legal training, who are given licence to assess innocence or guilt with a balance of probabilities standard of adjudication. With this trend we are witnessing a move away from the longstanding legal principle of ‘innocent till proven guilty’ and toward the dangerous principle of ‘guilty till proven innocent’ – paving the way for the systematic ruination of innocent lives. And the current state of affairs is not enough for some feminists who want to see men, not guilty till proven innocent but guilty upon accusation. Julie Lalonde, an “expert” brought into Ottawa University during the hysteria around a rape allegation (that proved false) to tackle the institutions “rape culture” believes that \"Every time we see a high-profile sexual assault trial result in an acquittal, it sends women back 50 years\" [end quote] and Emily Lindin tweeted that “I'm actually not at all concerned about innocent men losing their jobs over false sexual assault/harassment allegations.” \n\nUnder feminist Director of Public Prosecutions, Alison Saunders the U.K.’s Criminal Prosecution Service became embroiled in a scandal wherein targets set for rape and sexual assault prosecutions encouraged police forces to withhold exonerating evidence from courts. Innocent men were incarcerated, that’s a fact – and as a rule, their victimisers have retained anonymity and avoided their own well-deserved sentences for perjury.\n\nThe #MeToo movement has proven itself to be a malevolent witch-hunt, with a body count. A prime example of feminist aggression into the lives of non-feminist men and women who do not need feminism to dictate acceptable behaviour, at best it can only serve to diminish the romance, comedy and beauty (as well as some discomfort and tragedy) – in other words the colour – from our lives. As Camille Paglia pointed out, “Leaving sex to the feminists is like letting your dog vacation at the taxidermist.” At worst it serves to destroy men (professionally, personally, legally, or even totally). In August 2018, Brendan O’Neil counted four suicides as a result of #MeToo allegations – Benny Frederickson, head of a Stockholm arts centre, Carl Sargeant and an unnamed Labour party activist and Jill Messick, a movie producer, who killed herself as a result of harassment she received for defending Harvey Weinstein. Since then I have counted another four: Swaroop Raj, a Noida technician from India, American skating champion John Coughlin, Arghya Basu, filmmaker, and Armando Vega Gil, Mexican rockstar, who committed suicide after an anonymous woman claimed that he told her he would like to teach her to kiss when she was 13 and he was 50. I have no doubt that there are many that we have missed.   \nAnd the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?... We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately... I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying...”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending [pride] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalise the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonise men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.\n\nRegardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance. \n\nMasculinity as a whole is utterly vilified and demonized in our societies. The endeavour can begin at school, intensifies in university – and in the workplace increasingly, and reaches a tragic crescendo in family courts where men are denied access to their children who would bring such critically important meaning to their lives and be the ultimate expression of their masculinity. There is a gender justice gap for those convicted of crimes. Sex discrimination in the U.K. criminal justice system has a long history: e.g. flogging as a punishment for female criminals was banned in 1820 but continued for men until 1967 – that’s 147 years! Presently, men account for around 95% of the total prison population despite only committing 3.4 times more crimes than women. Factors that explain this disparity include: a greater percentage of convicted men being sentenced to prison, men being given longer sentences on average than women, women being paroled earlier than men (despite being more likely to be disciplined for bad behaviour whilst incarcerated) and women being more likely to have mitigating factors (such as age, dependents, lack of previous relevant convictions and the appearance of genuine remorse) applied to their sentences. And yet, feminist activists (such as Women in Prisons, Baroness Corston and Julie Bindel) have committed themselves to widening the gender justice gap – enabled by sentimental authorities. Our Tory government has committed itself to taking a rehabilitative approach when dealing with women offenders, which I think is great, but the voices of our male offenders (as well as the experts on effective justice) are utterly ignored when they raise the question: “What about the men?” \n\nThe cultural obsession with the gender pay gap is being driven by disingenuous authoritarian feminists with no regard for personal choice, meritocracy or human well-being. The focus is exclusively on the mythical glass-ceiling with no interest paid to the fate of those men employed in the glass-cellar dangerous and dirty jobs that women don’t want, who are increasingly at risk of unemployment due to automation, and/or the ever-present risks of workplace injury and death. Quotas are being used by many organisations which discriminate against men, sometimes caucasian men specifically. This is not only immoral in that it unfairly disadvantages individuals but also frankly stupid with the potential to impair the functioning of sectors rejecting meritocracy and therefore the economy and society in general. Moreover, the clunky way in which the government has demanded that businesses publish their “gender pay gap statistics” may ultimately lead to men being chosen over women for the kind of minimum wage jobs that very few do out of choice. “Equal pay” is being acquired for women performing even dissimilar roles to male counterparts, regardless of relevant facts such as: whether they work fewer hours. For example, the BBC’s former China editor Carrie Gracie was awarded £280,000 in back pay to bring her earnings in line with Jon Sopel, the North America editor, despite the fact that his job was more intensive and he was on air significantly more than her. She has donated her pay-out to The Fawcett Society. There are also several battles raging to secure equal pay for (mainly female) supermarket store workers as (mainly male) warehouse workers. An Asda spokesman clarified (in response to coverage consistently suggesting otherwise) that ““At Asda, hourly paid colleagues doing the same job in the same location are paid the same. Men and women doing the same job in our retail stores are paid the same. Men and women doing the same job in our distribution centres are paid the same. Pay rates in stores differ from pay rates in distribution centres for legitimate reasons” [end quote]. Differences in comfort, exertion and safety in the roles have been labelled entirely illegitimate reasons to offer different levels of pay to workers in the coverage of the stories, and the Court of Appeal agreed earlier this year and ruled against Asda.\n\nNow, the U.K. is facing the extension of hate crime legislation to include the charge of misogyny. In line with current hate crime legislation, the charge will require no evidence of hateful motivations but rather be governed by the perception of the victim or any witnesses involved. This shameful waste of police time will offer another avenue for malicious women to use the law to harm innocent men; as well as diverting precious resources from the fight against actual crime. And do not think that these “crimes” will not be acted upon by sensible officers, a perception of indifference from the police in such instances will be treated (as it is with current hate crimes) as “secondary victimisation”, with Greater Manchester Police clarifying that action will be taken against police accused of indifference towards “victims” and “whether or not it is reasonable for them to perceive it that way is immaterial” [end quote]. \n\nIn the interests of nuance, I accept that there have been and are individuals who identify as feminist who don’t fit into the negative description of the movement that I’ve just given. There are feminists who want equal rights for men and women, equal treatment, choices, opportunities. Feminists who have compassion for men and value them. But what impact have they really had on the trajectory and achievements of the movement? They’ve been marginalised heretics pleading intelligently and rationally but essentially ineffectually with their hysterical peers. While their hysterical peers have been lobbying our institutions irresponsibly and illogically but consistently successfully for policies and procedures that are damaging our societies.  \n\nFeminism, though once it was at least partially in practice, is now “progressive” in name only. Feminists don’t look around at our wonderful civilisation with gratitude and awe and want only to extend and protect the liberal values that have brought us here. Feminists look at our civilisation with anger and malice and want to burn it to the ground, rending our liberal values assunder, and to remake it in their own image. And feminists understand that “Power is in tearing human minds to pieces and putting them together again in shapes of your own choosing”, as Orwell explained through O’Brien in 1984, that’s why the epicentre of feminist indoctrination is in the education system where young and malleable minds proliferate to be manipulated by feminist historiography. Thankfully, we non-feminist women and men are studying and expressing our findings and more and more individuals are learning to see through the feminist narrative. I look forward to a post-feminist future.",
    "title": "History of feminism the way they don't want us to know!",
    "subreddit": "MensRights",
    "timestamp": 1558867022,
    "score": 391,
    "keyword": "mixed race director"
  },
  {
    "text": "#MeToo: men close ranks | Well-intentioned steps to advance women in the workplace have sparked resentment. Now for the backlash. From today's Australian newspaper, a sober look at the damage that feminism in general, and #MeToo in particular, are doing to gender equality in the workplace.\n\n>In this week of International Women’s Day ­celebrations, I have troubling news from the front line of gender relations. The conflict between men and women at work is increasing in some sectors. It’s a trend that’s worrying many who hoped our workplaces were becoming more equal for men and women and now fear they may be going backwards. Ironically, many attribute these problems to steps that have been taken to help women stay in work and get promoted. They point to well-intentioned programs designed to promote “diversity and inclusion” through flexible work, coaching and mentoring that have unintentionally sparked resentment among men. Some see it as killing with kindness.  \n>  \n>Last year, I wrote about the “big little lies” we tell about working and parenting (“Working lies”, Sept 1-2). It struck a chord, particularly the reports of some women with big jobs who said in public that Having It All was fantastic, while privately they were falling on the floor with exhaustion. Many working women got in touch with me in response to the article to say that while they found themselves publicly spouting the merits of “lean in” — Sheryl Sandberg’s famous pronouncement that women should be more ambitious — the ­reality is that their lives are highly stressful and sometimes chaotic. When, in December, Michelle Obama broke ranks to declare candidly, “That whole, ‘So you can have it all’ — nope, not at the same time. That’s a lie. And it’s not always enough to lean in, because that shit doesn’t work all the time,” women everywhere breathed a sigh of relief.  \n>  \n>Since then, I’ve been talking to some of these apparently successful women about why they ­pretend it’s working when, privately, they say they’re pushed to breaking point. Some women, depressingly, say it’s getting worse: they fear a future where there are actually fewer women at senior levels in some industries (law, finance, management consultancy, media, advertising).  \n>  \n>At the start of conversations about why top women don’t tell the truth, many give me the ­reasons I expect. Namely, that they want to encourage other women in the hope that having more women at the top will improve things for everyone. They also lie about their lives because they want to be loyal to their employers or, at least, to keep their jobs. Finally, they are reluctant to admit their lives are not working out because ­confessing that you’re finding things hard at work and at home sounds like an admission of failure, and high-flyers are used to being seen as a success.  \n>  \n>One senior woman who reflected on why she used to lie about her working reality, before she burnt out and moved out of corporate life, said: “The first thing we do is we lie to ourselves. We tell ourselves that working at this pace is normal. Then we lie to our families and colleagues — and then we lie to other women. We almost collude with each other to make this OK. Central to it, I think, is shame. And competence. I was used to being able to solve problems and move on in life, then I had kids and I didn’t know how to do it. Children aren’t a problem to be solved, they require a different state of being — one that takes effort but one that is hard to own up to. No woman wants to be thought of as a bad mother.”  \n>  \n>All of this makes sense. But as the conversations go on, more troubling thoughts begin to emerge. A woman who works in finance spoke on the promise of anonymity. “I am really worried that we are already at risk of going backwards on female representation at the senior levels of business, especially in finance. What I’m seeing is that the men are afraid and we’re getting the backlash. They feel the world is changing and their status is under threat. I am watching them gather around each other and close ranks. They already think women get the better deal. I worry it could actually be harder for the next group of women coming through than it was for my generation. I see so many of my friends, peers and colleagues becoming ‘mumpreneurs’ or quitting altogether because of this. It’s extremely depressing. But speaking out more publicly would, I think, create more resentment and might actually make it worse.”  \n>  \n>Looking out through the glass conference room doors to check nobody is watching us talking, she goes on: “I see growing resentment among men of women’s progress. Men I like personally as colleagues openly say that a lot of women get jobs because of tokenism. They don’t think they deserve the jobs. If the women then dare to ask for flexibility, they doubly resent it. We have great policies on paper around flexibility. But I’ve heard the men call working from home ‘TTP’ days, which means Taking The Piss days. Some label the women’s group at work the Burning Your Bra group and joke that it’s held around a cauldron.”  \n>  \n>It’s a view that columnist and former host of Top Gear Jeremy Clarkson tapped into recently when commenting on the BBC’s search for a host for one of its prime-time programs. “Anyone who has got a scrotum, forget it. They just aren’t giving jobs to men at the moment. There is an argument that it’s been all men for a long time, so what’s wrong with it being all women for some time? I get that. That’s fine. We just, as men, have to accept we’ve had it. Let’s just go down the bar.”  \n>  \n>And, increasingly, powerful groups of men are going to the pub or to network on the golf course without the women, excluding them once again from the inner circles where decisions are made.  \n>  \n>Similarly, a group of men at the advertising agency JWT have challenged a decision to let them go, after a new female creative director promised to shake things up. They say they have been discriminated against on the basis of gender, age and race. Others say it’s well overdue that the “pale, stale and male” agency had an overhaul and others were given a chance to shine. Human resources expert Claudia Iton nods knowingly at all this. “I’m reminded of the saying that, for a privileged group, any steps towards equality, however limited, can feel like discrimination,” she says.  \n>  \n>A corporate headhunter I spoke to observes a cycle that he worries is also making the problems worse. “If senior women are recruited and are seen to have been chosen for their gender rather than their skills, they start off in a difficult place,” he says. “However subtle it is, they will feel unsupported and may then struggle to hit their targets. This will confirm the view that women can’t cut it at those levels. In some cases, they are also being paid perhaps over the odds to help ‘reduce’ the reported pay-gap numbers. What I see are many executive boards talking the talk but not walking the walk on diversity. They are box-ticking — and the way they are doing it may make things worse.”  \n>  \n>All this has to be seen in the context of dramatic changes in working patterns over the past 20 years. In that time, we have moved from an expectation that most families will have one, usually male, breadwinner and the other parent in a supporting role, either based at home or working in a more flexible way. House prices and social expectations have changed and dual-income households are now seen as normal. This means that parents have to figure out how to care for their families in spite of longer hours in the office, longer commutes and potentially endless demands online. It’s not easy to do, even if you’re in charge. A chief executive of a business that prides itself on being family-friendly told me recently that, much as she tries to protect her staff from constant ­electronic intrusion, the reality is that she is still online after midnight every night of the week.  \n>  \n>Yet there is great potential for economic rewards from creating working patterns that appeal to those who also have caring roles. The Organisation for Economic Co-operation and Development attributes 10-20 per cent of GDP growth in Nordic countries to the raft of measures they have introduced over the past 50 years to make work and family life more compatible. More companies are experimenting with shorter working days and weeks. German tech firm Digital Enabler has introduced a five-hour day from 8am to 1pm in a bid to attract the best talent and improve productivity by having a really focused working day.  \n>  \n>As yet, this isn’t the way many big businesses are going. In fact, rather the opposite. Someone who made it to the top in corporate finance, but has recently stepped out to run her own business, reflects on the additional impact of the “always on” phenomenon. She describes years of working days that started as she woke and ended when she charged her phone by the bed. So much so that her two kids chose to go to boarding school, partly because both parents worked every evening. “We did a legal deal a few years ago and the lawyers respond to emails at 1am. When do they sleep?”  \n>  \n>Even when she was quite senior, she says she struggled with a boss who held team meetings at 7am. “I did talk to HR, but absolutely nothing was done and I had to move teams.” Another banker reports that her company had to introduce a ­policy to stop conference calls on a Saturday. Which is good, she says, except that Sunday has instead become pretty much like any other work day.  \n>  \n>The problem is that many of the men who run businesses still see the world through the prism of the way it has worked for them. One mum of three says: “Most have no concept of what it means to be a co-working family. I work with men who have wives who literally pack their suitcases for them when they go on work trips. These men have no idea of the planning that their female ­colleagues, male colleagues with working partners and single parents have to do. Not to mention how much we all end up spending on emergency childcare. Because of this, it’s not unusual to find out at the very last minute that an extra day has been added to a work trip. When that happens, it can make me feel physically sick. I say nothing because they would just see it as moaning, but a change like that will have me up half the night, sorting out the arrangements for the family.” This is a woman whose husband also works but, like many I interview, she still shoulders the vast majority of the family organising.  \n>  \n>One lawyer continues on the impact of having a predominance of men at the top of the business: “You get a certain culture,” she says. “There is still a lot of shouting and aggression and a very high-pressured environment. There is an expectation that everything will be done immediately and that people are available pretty much all the time. They have no tolerance for someone who leaves at 4pm to pick up their kids, saying that they can’t edit a document right this moment.”  \n>  \n>Those who do manage to carve out a more ­balanced schedule describe the frustrations that come with it. If they managed, for example, to negotiate a three- or four-day week, they were expected to work more hours than they were paid for. They were also put on the “mummy track”.  \n>  \n>It is also a culture that makes those inclined to speak out hesitate. A board-level woman in banking says: “When someone asks me to speak about diversity and women in finance, my heart sinks. You know someone will be primed to savage you. They force confrontation and use bullying tactics to put you off speaking out. They say that the ‘leaking pipeline’ is just ‘lifestyle choices’. That it’s not a ‘right’, it’s a ‘choice’ to have a baby and you just have to deal with it. It puts me off speaking.”  \n>  \n>It isn’t just hours. A team leader at an investment bank says: “At our firm, there remains an after-work drinking culture that anyone involved in running family life can’t be a part of. It used to be that younger women would join in with that and at least have a chance of being part of the ‘in crowd’. But, since #MeToo, the men are wary. Too many stories are told about pay-offs to young women who say they were groped on a night out. It’s very hard to know the truth about these ­stories, as they usually get settled \\[with a non-disclosure agreement\\]. But the stories that are told are always that the woman exploited the system for money. Whether that’s the case or not, what really worries me is that a lot of other women will suffer professionally as a result. One man I work with went as far as to say, ‘Why would we include them \\[women\\] when they do this to us?’”  \n>  \n>There is evidence to support this view. A ­survey last year by Sheryl Sandberg’s [LeanIn.org](https://LeanIn.org) and ­SurveyMonkey showed that almost half of male managers who participated were uncomfortable ­mentoring, socialising or working alone with female colleagues. Sixteen per cent of male managers now hesitate to mentor a woman — more than triple the number that said this before #MeToo. Surveys suggest that ­senior men are more likely to hesitate to have a work dinner with a junior-level woman than with a junior-level man, and they are five times more likely to hesitate to travel for work with a junior-level woman. This is perhaps why some report noticing an increase in work-related social/client events that are strongly geared towards men: ­racing-car excursions, extreme ­skiing, caving — all held at weekends, of course.  \n>  \n>This cultural backdrop also has a negative impact on many males. One senior man in banking says: “I resent that I can’t open up my schedule to spend a few hours at the kids’ school or leave before 7pm sometimes, even though the women can. I don’t resent the women for it, but I do see it as a failure of management.” He says his executive team wouldn’t even recognise what he is talking about.  \n>  \n>The women I talk with acknowledge this: “I see that younger dads who want to go home at sensible times of the evening and take the parental leave they’re entitled to are afraid of being a laughing stock. People ask them, ‘Don’t you care about your career?’ Or they are accused of being henpecked. Some of these men, who feel emasculated if they ask for what women can access, grow to resent their colleagues who can work flexibly.”  \n>  \n>Some men are also burning with indignation that the focus seems to be on helping their female colleagues to the exclusion of their needs: “\\[Women\\] get mentoring, coaching and a support group — we just have to get on with the work.”  \n>  \n>As I listen to these stories, I despair. I see these bright, talented women who are so tempted to give up in the face of insurmountable challenges, while everyone pretends this is working out just fine. Meanwhile, the men say they too are stressed, tired and frustrated that they can’t ever escape work. The risk here is that we all shrink further back into our shells. What we urgently need are senior people to talk about these issues in public.  \n>  \n>The good news is that some companies are ­trying to make changes. Emma Codd, managing partner for talent at Deloitte UK, says: “When we started a move to more flexible working, I decided to calculate the costs of not addressing this — to look at the people walking out of the door that didn’t need to leave, the recruitment and training costs of replacing them and the office space we could save on — and it was clear that it was in our interests to make it happen. Since then, just in the UK, we have saved about £200 million as a result.”  \n>  \n>Over the past few months, I have been talking to psychologists and therapists about children raised by parents who are both working long hours. Sarah Clarke, a child and adolescent therapist, says: “Much as I want to be a badass feminist supporting working mums everywhere, my therapy room is full of sad children who miss their parents. I am not going to not say this just because it makes people feel guilty.”  \n>  \n>More than good intentions, what we need is action, and that starts with senior men and women speaking out about the reality of their lives.\n\n&#x200B;",
    "title": "#MeToo: men close ranks | Well-intentioned steps to advance women in the workplace have sparked resentment. Now for the backlash.",
    "subreddit": "MensRights",
    "timestamp": 1552098057,
    "score": 55,
    "keyword": "mixed race director"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 42,
    "keyword": "mixed race director"
  },
  {
    "text": "Curvy High School Swimmer Disqualified for a Wedgie For those who have exceeded their Washington Post free article limit:\n\n\"The teenage girl clambered out of the pool, ready to accept victory. A champion swimmer for Anchorage’s Dimond High School, she had crushed her competition in the 100-yard freestyle during Friday night’s meet with a rival from across town.\n\nBut as soon as she stepped out of the water, she learned that she had been disqualified.\n\nThe reason? Her swimsuit was exposing too much of her buttocks, an official ruled.\n\nThe referee’s call, which is now under investigation, has generated intense debate among Alaska’s close-knit swim and dive community, and prompted a larger discussion about how female athletes’ bodies are policed and scrutinized. Lauren Langford, who coaches swimming at another high school in the area, told The Washington Post that she believes racism, in addition to sexism, may have been a factor, given that the teen is among the few nonwhite athletes in a predominantly white sport.\n\n'All of these girls are all wearing suits that are cut the same way,' Langford said. 'And the only girl who gets disqualified is a mixed-race girl with rounder, curvier features.'\n\nThe teenager didn’t pick out the swimsuit — her school chose it and issued it to her. But even though all the girls on her team were dressed identically, she was the only one cited for a uniform violation. Annette Rohde, who was working as an official during the meet, told the Anchorage Daily News that another female ref explained that the bottom of the girl’s suit 'was so far up I could see butt cheek touching butt cheek.’\n\nRohde froze in disbelief, she said, and warned the referee, who has not been identified, 'This is going to blow up.' Sure enough, the decision reverberated throughout the community, where the teen is known as a top-ranked swimmer likely to go on to compete at the collegiate level.\n\n'In a world where young girls are told at every turn that the skin they’re in is not good enough for a thousand reasons, the last thing we need to do in youth athletics is add to that unhealthy dialogue,' Langford, a swim coach at Anchorage’s West High School who coached the teenager and her sisters when they were younger, wrote in a widely shared blog post on Medium after Friday’s meet. She added, 'If you do not like the way that swimsuits fit on these girls’ bodies then don’t look; they are minors, children, and no one should be looking at them anyway.'\n\nSpeaking with The Post on Monday night, Langford said she was angered at the treatment of the teenager, whom she described as 'literally the nicest young lady.' It wasn’t the first time the girl had been made to feel that her curvy figure was problematic: Last year, a parent took a photo of her backside and shared it with other parents to demonstrate that girls on the team were wearing inappropriate swimwear. (District officials said Monday that Dimond High School’s assistant principal 'indicated to the parent who took the photographs that it was not permissible for him to take pictures of others’ children and that he should stop immediately.')\n\n'That to me is so inappropriate,' Langford said. She noted that the teen girl has been accused of hiking her suit up on purpose, but anyone who has competed in swimming would know that suits often ride up unintentionally.\n\n'We have a term for it — it’s called a suit wedgie,' she said. 'And wedgies happen. It’s uncomfortable. No one’s going to walk around that way intentionally.'\n\nOver the years, the conservative one-piece swimsuits traditionally worn by competitive female swimmers have been phased out in favor of a higher-cut style that has less fabric and is more hydrodynamic, but also more revealing. The changes in the cut and fit, Langford said, make it 'even more frequent that you’re picking a wedgie.' But a minor, if annoying, wardrobe malfunction is also likely to be the last thing on the mind of a swimmer intently focused on her form as she nears the finish line.\n\n'If you’re in the water, you’re not thinking about it,' Langford said.\n\nRohde and another local swim coach told the Daily News on Monday that they, too, had never seen the teenager deliberately adjust her swimsuit to make it more revealing. There’s some dispute about whether the referee’s call, which Dimond’s coach has protested, would have been correct if the girl had done so, or if swimmers can be penalized for failing to realize that their suit has bunched up. Officials with the Anchorage School District, who announced Monday that they are reviewing the decision, wrote that the disqualification 'appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms.'\n\nThe National Federation of State High School Associations, the governing body for high school athletics in Alaska, simply states that female swimmers must cover their buttocks and breasts. In August, the organization issued a memorandum alerting coaches that 'suits are being worn in such a way as to expose the athlete’s buttocks,' and provided an illustrated example of what constituted appropriate coverage. District officials said Monday that Dimond High School 'made deliberate efforts over the last year' to meet those requirements — in particular, picking out the regulation swimsuit that the teen was wearing when she was stripped of her victory.\n\n'If the suit was a problem, they all should have been disqualified,' Langford said. 'But they weren’t.'\n\nMeagan Kowatch, the teenager’s mother, told KTUU on Monday that the referee who made the call had previously embarrassed one of her other daughters by critiquing the fit of her swimsuit during a meet. She wants to see the results of Friday’s competition overturned, and for that ref to be kept away from her daughters’ races in future, she said.\n\nThough there’s also been some debate about whether racism played a role in the decision, 'no one seems to be arguing about if it’s sexism,' Langford said. The National Federation of High Schools also published guidelines for appropriate male swimwear in August, and she said she’s seen young men competing in lower-riding suits than the organization deems appropriate. But to her knowledge, it’s never become an issue.\n\nBy contrast, Langford said, Kowatch has been told by other parents that her three daughters on the team, who are all talented swimmers, need to cover up for the sake of their sons. The disqualified teenager, though usually 'tough as nails,' turned teary on Friday night over the referee’s decision, and was 'heartbroken' to learn that people were accusing her of purposefully hiking up her swimsuit, the coach said.\n\n'The fact that she’s been told she’s intentionally trying to draw this sexual attention has really crushed her,' Langford said.\"\n \nBy Antonia Noori Farzan\nSeptember 10 at 6:58 AM\nhttps://www.washingtonpost.com/nation/2019/09/10/anchorage-swimmer-disqualified-wedgie",
    "title": "Curvy High School Swimmer Disqualified for a Wedgie",
    "subreddit": "Feminism",
    "timestamp": 1568221201,
    "score": 13,
    "keyword": "mixed race director"
  },
  {
    "text": "Who is classed as being a woman of colour? Hey guys. Been deliberating over this. I'm mixed race, half Iranian and half English. Is this classed as being a WOC?? I've always thought of myself as one but a friend recently caused me to question this as she sees me as v white (she is white herself) . I know I have extreme privilege for often passing as white but I've also experienced a lot of discrimination, especially as a kid, for being middle eastern. I've been called names, made fun of and been made to feel I'm different. This has impacted my life a lot and really influenced the way I see the world. Some people see me as white and others do not. I definitely think people make judgements about me based on my appearance. I also have an extremely middle Eastern name which makes people assume things about me before they even meet me and I worry it may result in discrimination when I'm applying for jobs. But I also feel that I'm not qualified to call myself a WOC because other women that are not light skinned as me have it so hard. Anyway, didn't really know who to ask and Google ain't helping. Let me know if it's the wrong space..",
    "title": "Who is classed as being a woman of colour?",
    "subreddit": "Feminism",
    "timestamp": 1565803290,
    "score": 3,
    "keyword": "mixed race director"
  }
]