[
  {
    "text": "Struggling to Find Employment After Graduation: Overcoming Challenges and Seeking Advice Hey everyone, I recently graduated from university, and I must admit that the transition from being a student to finding employment has been quite challenging. I wanted to share my experiences and seek advice on this Reddit platform, as I believe there are many others who may be facing similar difficulties. From harassment to the competitive job market, here are the challenges I've encountered and the support I'm seeking.\n\n1. Competitive Job Market: One of the main hurdles I've faced is the highly competitive job market. Despite having a degree, it seems like there are countless graduates vying for limited positions. Companies often require prior experience, which can be frustrating for fresh graduates like me who are eager to start their careers.\n2. Lack of Relevant Experience: As a recent graduate, I find it challenging to meet the job requirements that demand experience. Balancing academics, extracurricular activities, and internships during my studies wasn't easy, and now it feels like my lack of experience is hindering my chances of landing a job in my desired field.\n3. Harassment and Discrimination: Unfortunately, I have also faced instances of harassment and discrimination during my job search. It's disheartening to see that despite our qualifications, some employers judge us based on factors like gender, race, or age. It not only affects our self-esteem but also makes it harder to remain motivated during the job search process.\n4. Limited Networking Opportunities: Networking plays a crucial role in landing job opportunities. However, as a recent graduate, I often find myself lacking a strong professional network. It's challenging to compete against candidates who have established connections or referrals within companies. Finding ways to expand my network and make meaningful connections has proven to be quite difficult.\n5. Financial Stress: The inability to find employment right after graduation can lead to financial stress. Student loans and living expenses continue to pile up, adding to the pressure of finding a job quickly. This stress can negatively impact mental health and hinder the job search process.",
    "title": "Struggling to Find Employment After Graduation: Overcoming Challenges and Seeking Advice",
    "subreddit": "jobs",
    "timestamp": 1683618701,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Resignation Letter in Academic Essay Format I know quitting your job as a cook usually simply comes with two weeks notice or a ragequit walkout, but for eleven months I worked at a new franchise that had such potential which was being squandered by the incompetence of upper management. I present the nearly 6000 word thesis I turned in on my last day. Locations and names have been changed to cartoon references. Brackets represent ambiguous information in place of specific details.\n\nKrusty Krab ~~Careers~~ Jobs\n\nOpening in \\[Month/Year\\], Krusty Krab (KK) Bikini Bottom is on its 4th kitchen manager in less than a year. Krusty Krab O-Town has recently let go its inaugural kitchen manager and sous chef. Almost no member of the Bikini Bottom opening management team remains employed by KK. There is a pattern developing where one must question both the choice of employee and the directive given to new franchises. These lingering issues I brought concerns about in the first weeks of opening but was disregarded at every turn despite my experience with festival traffic. As a result I decided this was not a place I wanted to advance, but with a good-enough paycheck I’d be a lowly grunt in the kitchen four days a week, at five days a week I would have quit or been fired over a public outburst long ago. If Krusty Krab alters course slightly while being true to the brand this could be a successful chain.\n\nMy unique employment history in brick and mortar restaurants, food trucks, pop up culinary concepts, trade shows/conventions, and the film industry make me an ideal candidate to be on the opening team for new KK locations. My outgoing nature and foresight are valuable assets. For example, on training week before opening when I was standing around idly without a task I took it upon myself to organize the disarray that was dry storage. Overhearing Krabs tell another manager where he wanted the cleaning products placed, I had a jumping off point and the organization I created nine months ago is still largely in place. Since returning from my vacation in early February I have made it my mission to keep the storage area organized because it was again starting to resemble a hoarder’s house rather than a commercial kitchen. This is now part of my weekly routines because every time I turn my back there is more product being placed haphazardly just anywhere with little regard. I also recently reorganized the walk-in cooler because of problematic stocking with items being placed on the same shelf or below raw proteins. I also simply put all the like products together such as cheeses or fruits that were scattered amongst several shelves. With recent overordering I cannot keep up with the organization of the walk in cooler. The pattern recognition of food types and even simple shapes appears to be lost on the Bikini Bottom crew. My daily reorganization of containers is proof of this. Most days I’ll take a few minutes to put all cylinders together, all cambros together in descending volume, all deep and shallow pans next to each other rather than intermixed. My decision to be a kitchen manager at age 19 from 2005 thru 2008 and rarely enter restaurant management since is very calculated.\n\nWith my prior knowledge of professional kitchens I was becoming Bikini Bottom’s resident nag to coworkers as I made note of health department violations on a daily basis. I stopped after being largely ignored for two weeks. My regular health department nags include; a battle with jackets and hats being placed only in the designated area (a designated area that did not exist until I created a place for personal items a in January by neatly organizing the dry storage area again), waiting until prepped items are cooled before a cover is placed on top, placement of raw seafood, open containers (very often sugar, flour, and pancake mix bags ripped open and left), and dirty dishes/containers placed back in rotation. The dirty dishes and containers in rotation with the clean ones are at an atrociously high number. I have given up on making the 4th fryer seafood allergy safe too. With the low volume of seafood allergy safe items Bikini Bottom should purchase smaller baskets to visually discourage cross contamination with the other fryers and baskets. My skills to organize the kitchen do not end with simply where to store products to meet minimal health department standards.\n\nHalf of the space in the Bikini Bottom kitchen is completely wasted on an ill-advised walkway to the dishpit. An intelligent design would place a second doorway directly to the dishpit connected to the bar or where the bathrooms reside. Numerous times during the opening week of KK Bikini Bottom I said, yelled, sang, and muttered that we have too many food items for the amount of space we have. Icus stated that there was more space than Bluffington. Is Bluffington intelligently designed? Because Bikini Bottom most certainly isn’t. So Bikini Bottom actually has less space even if there is more square footage. See the attached diagram for an intelligent design that could potentially house a menu of this size. Bikini Bottom forces a line design on this kitchen when an open concept is needed for this menu. It’s as if this floorplan was created by a person who had only ever seen one commercial kitchen previously and couldn’t think 4th dimensionally to understand the needs of the workers to smoothly serve customers.\n\nThere is not enough counter space for pizzas without getting off the line, the microwave is placed completely out of the way, the freezer’s curved design is a waste of potential counter space and a falling hazard for containers stored on top of it, the toaster is an overcomplicated and overexpensive piece of machinery that serves exactly one purpose when a flat top could be used to toast bread and other purposes like a quesadilla special, sautee was designed without an overhang for spices, the pantry station lacks the counter space to have two containers of flour and two containers of batter for seafood allergies, there are no Frialator fryers which I have worked with at every single kitchen job previously instead we got the cheap Vulcan model (is that logical), the cheap low boy in pantry that doesn’t drain excess water anywhere it’s just supposed to evaporate somehow but doesn’t, the grill and fryer should be placed next to each other (with a higher volume of crossover than other stations), the floors are flat instead on having a mild decline towards the drains (just look at the standing water residing behind the oven right now), in the dishpit the spraying area and the filled sinks are backwards of a logical dipshit, the ramp to the back door is on the wrong side, there is no refrigerated place downstairs to stage extra food for busy shifts (the beer cooler is once again used for such food items because of this massive oversight), the prep station is an afterthought and miniscule, the dishes on the line are difficult to grab for anyone under 5’11” and inaccessible for anyone under 5’6” (instead of putting them underneath tables that also give that desperately needed counterspace I spoke of), there is not enough space to store to-go containers or boats behind the line, expo is lacking a low boy for the numerous items that are supposed to be cold but are instead kept at room temperature all day long, no one in management thought about buying shelves until right before Bikini Bottom opened as a result the clean full sheets sat on the floor for days, we had only the exact amount of 1⁄6 pans for an absurd amount of time making it impossible to rotate and clean them when necessary (which is daily), we still struggle with 1/9 pan supply. And just when I thought I documented all the poor design choices possible I stumbled upon a person whose office holiday party was booked at KK Bikini Bottom. The deck space works just fine as a deck. It does not double well as a gathering space. The space is too long and narrow for parties, it promotes little splitoff groups rather than a coming together of a larger gathering. It may be advantageous to contact a social psychologist for help designing a private party space that promotes intermingling rather than enforcing small pockets to form. The reorganization of the physical kitchen isn’t all that screams for an overhaul.\n\nThere are six positions on the line at the Krusty Krab; expo, oven, grill, sautee, fryer, and pantry. But the pantry and fryer positions are forced together like a bad remix. Everyone who mainly works pantry deserves a $6 raise immediately because it is a station and a half. Both Icus and Krumm, while kitchen manager, kind of acknowledged the pantry is too big for one station without outright mentioning the lopsided distribution of work. I imagine in the only location where this works, Bluffington, a second person joins the pantry at noon because of the unreasonable amount of items one person is tasked with. Bikini Bottom only has one person in this position at all times, maybe modify it for one person? The excess of items on the pantry position largely resembles a position I would call “set-up” or “build” at a previous job that made sensible choices. This build position should have tostadas, tacos, butcher’s blocks, toast, salads, lettuce wrap set ups, and preparing plating for whichever station is most bogged down. I have absolutely lost my mind yelling about salads at least once a month, ranting that they do not belong on the fryer position because of how illogical it is that five salads are included on the mountain of other items the pantry has. I have always considered working in a kitchen a kind of dance, and the pantry station demands an unnecessarily convoluted dance to keep up with the demand. Without the salads, tostadas, and tacos the station is already the busiest. Do we really need to combine ballet and swing by including these extra awkward dance steps in this single station? For a kitchen designed this poorly I suppose it is. Again, see attached document for an intelligently designed kitchen that might be able to accommodate this menu. Unless Bikini Bottom is going to close for a month to fix the baffling floor plan design the menu is shouting to be reduced to 30-36 items.\n\nThe menu is too big. Krusty Krab is the jack of all foods, master of none. In general I believe individual locations should be allowed 18% omissions, and 18% unique items to this wildly unwieldy menu sitting around 50 food items including sides. The insistence on keeping menu items that don’t sell at Bikini Bottom because of Bluffington is mind boggling. Chicken tenders do not sell at Bikini Bottom. fried sushi does not sell at Bikini Bottom, not enough to justify their place on the line. I don’t care how well these items work in Bluffinton. They. Do. Not. Work. At. Bikini. Bottom. If the KK location in the middle of the Atlantic Ocean sells an incredible amount of live krill does that mean Bikini Bottom and O-Town must sell live krill too? Take the fried sushi off the menu. I had a complete meltdown about this during a Dimmadome service and my valid point was met with indifference. Replace the kid’s tenders with a kid’s fish sticks. We already have the tilapia fish sticks on the line for tacos. Or make the kid’s fish sticks cod. We cut cod to order for fish tacos in spite of health code violations because it is too rare of an order to make beforehand. Saffron in mashed potatoes? If you must. Why are green tomatoes only on the menu during lunch? Bikini Bottom throws away a sizable amount of spoiled green tomatoes each week. Have green tomatoes on the menu all day long or don’t have them at all. The smoked salmon could go on salads or a special taco to justify its place on the line. The corn pico’s place on the line is unjustified. It only goes on one item, tostadas, which are not particularly popular. If we had a taco salad we could throw the corn pico on there. We also have unreasonable waste from unusable taco shells, smash up those imperfect taco shells and throw them on said taco salad. But before we add salads, let's get rid of the pear and kale salads. The pears' position on the line are unjustified, if we threw them on a taco variation maybe their place on the Bikini Bottom line could be argued but for now they only go on a salad that isn’t particularly popular. The kale salad is an issue of space for a 4th green for salads is too much. The krusty salad is my most hated house salad of all time. And it comes down to the toast with goat cheese. This ancillary step of spreading goat cheese on a cracker is an unnecessary step for an overly complicated dance and should be part of the expo dance if expo wasn’t a shoddily designed afterthought lacking a low boy.\n\nThere are a plethora of squeeze bottles on the pantry station that have no place on the overloaded station. They belong to an expo station with a low boy to keep them cold. Pantry has an overwhelming ten squeeze bottles: chipotle crema, sweet chili vinaigrette, buffalo, korean bbq, ranch, caesar, wine vinaigrette, lemon vinaigrette, honey mustard, and lemon aioli. Only the first four are justified on an intelligently designed fryer section, the second four belong on the build station, the last two have no place anywhere but expo. With this extra space sautee could keep their bottles and two purees cold in the fryer's lowboy instead of leaving them at room temperature all day inviting a pathogen party. This theorized intelligently designed expo would have room to keep these four squeeze bottles and a double of every sauce chilled to pour them into ramekins, a move that is highly common in the expo dance. The fact that expo doesn’t have a double of all squeeze bottles is foolish. Expo has to bother an overloaded station to pour these side sauces instead.\n\nHow many gallons of basil aioli has Bikini Bottom thrown away in 11 months? Four aiolis in general is way too many and most go on a single item; basil aioli on the incredibly unpopular veggie burger, lemon aioli for calamari, sweet chili aioli for the BLT that is only served half of the day, and garlic aioli actually goes on two items…I believe. What a colossal waste of precious little space, lose two aiolis and then you can sing the logical song with me. Perhaps we can put garlic aioli and sweet chili vinaigrette on the BLT separately and accomplish the exact same thing the sweet chili aioli does. The wings too have unneeded complications. Having worked at a sports bar specializing in wings for the better part of a decade I find KK’s plating of wings to be overly pretentious. The carrots, celery, and blue cheese have lost function. Heffer Wolf always said no one eats the carrot/celery julienne with blue cheese. It’s a complete waste of all the ingredients because you’ve gone too far with the presentation. Wings aren’t fancy. Wings are supposed to have a small pool of sauce and be sloppy. It’s like a sloppy joe that’s not sloppy, an unsloppy joe is a failure to sloppy joes just as the KK presentation of wings is a disparagement to the dish. Ever since training week back in 2022 I have used a scale to give Bikini Bottom a passing or failing grade.\n\nChokey Chicken to Chum Bucket is the scale I use to judge efficiency and sanity at Bikini Bottom. Both establishments are upscale casual dining experiences in Capitol City in the same vein as KK. Chokey had high employee retention and relatively smooth openings for new locations. Chum Bucket’s employee turnover was high and every location opening was chaotic. Which one sounds closer to KK? Chokey Chicken was filled with chefs I respect including Chef Ren Hoek who remains a close friend to this day. Ren lost his lifelong passion for kitchen work after working management at Chum Bucket. He’s actually seeking work in Bikini Bottom. Call him up at \\[phone number\\], but KK will give him Nam’ flashbacks of why he chose driving for a living rather than cooking for five years. The pair of us together helming Bikini Bottom with the ability to omit and create 18% of the overloaded menu can bring success to this franchise. We have worked well numerous times in the past on various concepts in the past including creating The Attack of the Pickled Tomatoes Burger for \\[Promotional live performance of a TV show\\] at the Capitol City Theater. We served 100 people in 60 at the \\[sitcom filming\\] lunch. That’s physically impossible but somehow we did it quite a few times.\n\nA fun anecdote about Ren Hoek’s KK experience from the soft launch; on training week numerous times I brought concerns about being seafood allergy safe that were dismissed. As mentioned earlier the pantry station lacks the counter space to have two containers of flour and two containers of batter, one each of which seafood never touches. Before the soft launch Chef Stimpy from Bluffington insisted all customers just kind of know everything is prone to be seafood contaminated. Well, chef Ren was a customer that night and this absolutely was not communicated to customers. He claimed to have a slight seafood allergy and was not informed of what the crab soup was. In reality he does not have a seafood allergy. I didn’t discuss the seafood issue with Ren, separately we noticed egregious violations of food safety standards and we each responded in our own way. The soft launch service was so awful that night Chef Ren walked out of a free meal to pay for some ramen, never to return to Bikini Bottom. I attribute this oversight, and many of Bikini Bottom’s (and probably O-Town’s) problems to hubris over the Bluffington location.\n\nChef Chokey would also be hesitant to join the KK team. It will cost a finder’s fee just for me to reveal Chef Chokey’s name. Chef Chokey was a lead in the rapid expansion of Chokey Chicken restaurants. He opened numerous restaurants and was big on the philosophy that each restaurant must have its own personality in order to fit the unique local culture and the variety of working spaces. This is in direct conflict with the KK way that everything must be exactly like the Bluffington location no matter what. There was only one Chokey Chicken location that had the full menu, Chokey Springfield. Chokey Springfield had a large space which was intelligently designed to accommodate such a large menu. The KK menu is all over the place, closing in on 50 menu items which comes up as a failure on the Chokey Chicken/Chum Bucket scale. This is not the only area KK comes up as a major failure on the Chokey Chicken/Chum Bucket scale.\n\nHas anyone in this company ever worked festival traffic before? Does anyone have the experience of working next to a major venue with 8000 seats before this one? The way Bikini Bottom handles Dimmadome services it certainly appears that the decision-makers fall on the wrong side of the Dunning-Kruger effect. Having all 50 items available during such massive traffic is completely asinine. An unwillingness to serve a partial menu is hindering the Bikini Bottom kitchen staff. I have worked festival traffic before, and Dimmadome events bring in festival traffic. I’ve worked inside a festival whose line never ended but every customer got their order in 5 minutes or less because the line kept flowing with only four items on the menu as that’s what was warranted at the B-Sharps Music Festival. I refuse to be set up for failure the way Bikini Bottom sets up Dimmadome services for failure. The entire week of concerts in \\[summer\\] 2022 I was set up for failure every day (it was after this I modified my availability to keep my sanity and my paycheck). When I brought my concerns about running efficiently during Dimmadome services I was labeled a B-worker for the first time in my employment history by Icus and Krabs. It is that moment which I was either going to holler at them both for being 2-dimensional thinkers who were obviously unqualified for the positions they accepted in this company, or just put my head down. If Bikini Bottom has a successful concert day service, hail your team because they snatched victory from the jaws of defeat. They swam with concrete shoes. I often wonder how many customers had bad experiences and never returned after concert days. A Dimmadome service should have no more than 25 items and have one or two specials to divert traffic towards an area the kitchen can keep moving. An Open Cup Open Plate (OCOP) special for foot traffic is absolutely needed. When I suggested OCOP special, Heffer was intrigued by this idea and immediately named burgers as the special to keep foot traffic flowing. Smithers wouldn’t hear this idea, babbling on about what’s advertised instead of hearing out a sound idea. This prattle despite radio commercials having inaccurate hours and social media promoting Bikini Bottom’s steak tacos to this day. I always found Smithers to be a better fit as a middle management office pencil pusher than as a hands-on restaurant manager. Overall I find KK managers are selected to be automatons not to question their orders rather than critical thinkers who could take the restaurant to the next level. During brunch service is another period of time that must be modified to lessen the heft of items. Having a full menu that barely works plus brunch is so deep into Chum Bucket territory, in my opinion we now have to use the Tropic Thunder scale of full \\[R-word censored by r/jobs\\] to describe a 60-plus-item brunch. Chef Ren hired back a Chum Bucket cook who had a mental breakdown and stormed out during brunch (plus full menu) service because Ren knew the employee was justified and upper management was completely unreasonable in their brunch requests. It’s not just questionable decisions that hinder KK staff but improper equipment as well.\n\nThis is the first restaurant I have worked at which uses a touch screen on the line rather than tickets. From day one I found this to be technology for technology’s sake inferior to tickets. Chef Ren forced a new Chum Bucket location to rip out touch screens from the line and bring in ticket printers because of the higher efficiency. The touch screen is a great idea for expo, not the entire line. My biggest gripe is that each station does not get all the information. Early on I was regularly yelled at for not staggering my items, well I can’t see the rest of the order; a problem I have never had with a ticket system. Touchscreen software is also much more prone to errors and glitches. When I reported an error during a heavy service Icus and Krabs blamed my skills on the line without looking into the malfunctioning screen further. It was glitchy for weeks before the two finally investigated and corrected the issue I brought to their attention long before. Those two gave me an immense amount of ammunition to dislike them in the opening weeks until I stopped caring. The issue I had with being unable to scroll beyond the bottom of a completely filled screen has returned and is still there as of \\[my last day\\]. There are also important details that get buried. A frequent meltdown I have is that sauce on side requests and other important modifications are not capitalized or in red to catch the eye as they have been at jobs with tickets. These details get lost on Bikini Bottom’s touchscreens. A sauce on side salad made by me will be wrong 50% of the time because of the instructions being camouflaged in a word salad. This goes for coleslaw on the side and drizzle on the side too. Drizzle in general I dislike because of the pretentiousness, but whatever, drizzle it on top rather than putting it in a ramekin if you must. There are numerous places where Bikini Bottom overcomplicates matters for reasons I cannot ascertain.\n\nWhy is there such a large variety of plates? Why do we have a medium circular plate for salads and a large bowl for salads with protein? This just confuses the simplest of matters. I was told this is done because of the high price hike with protein, a larger presentation was desired. But that price hike is the price of protein in 2023. Bikini Bottom should put all salads in the large bowls and use all the circular salad plates in a skeet shooting promotion. I understand why we have both a circular platter plate and a pizza plate but in my restaurant the circular platter plates must go...or maybe the large platter plate instead. Is the large platter used for anything besides fish and chips? That extra space on fish and chips plates are only used for side sauces which can easily be delivered to customers on small circular plates. What is the medium oval plate doing that the medium rectangular plate isn’t? And vice versa. Why do they both exist when they are approximately the same size? Let me write an internet commercial where we break a lot of plates so we can get some logical use out of the superfluous plates. I don’t care which one is destroyed, the ovals or the rectangles but one of them is an unnecessary redundancy in excess done again. Speaking of commercials, the unimaginative radio advertisements for Bikini Bottom are doing little to lure new customers to the restaurant.\n\nThe three radio spots I have heard on KBBL all sound like they were produced by a marketing 101 student who wasn’t a natural in the field. The voiceover actor was so uncharismatic I was certain someone from the office was chosen at random to read the copy. Then I heard that same voiceover actor selling pool supplies on another radio station so I concluded that Bikini Bottom must have hired the cheapest guy in town to produce the most basic of commercials. Perhaps there is someone else you could hire more qualified to voiceover these commercials, an actor with experience on an Emmy award winning cable program whose unique place in the film industry was written about on \\[website\\] would be a much wiser choice to be the voice of the KK? (See external link). In the ad there was no catchphrase, no jingle, no music whatsoever. This simple approach to commercials lacks the pizazz to catch the attention of radio listeners. The first two commercials I heard would get a C in marketing 101 as they were nearly the exact same and accomplished the bare minimum to sell wares, the third one would maybe get a B- because there was some sort of attempted gimmick with the voiceover whispering to represent thinking inside his head about what he was going to eat later at KK. Not only does this commercial give no reason for the man to think inside his head, the outside world still and unpopulated. To see what a creative person would do with this concept see the attached script. There is an attempted slogan that could become part of an ad campaign. Commercials aren’t the only lost opportunities in promotions.\n\nThere are numerous promotional celebrity tie-ins at Bikini Bottom’s fingertips with Dimmadome performers. The restaurant could have a Phish sandwich as a OCOP special on \\[Phish performance dates\\], or a pretentious Jelly Roll on \\[Jelly Roll performance date\\]. Has anyone reached out to the Dimmadome theater or talent management for approved special menu items to be promoted inside the dome? Perhaps a special 20% discount to ticket holders? Is Bikini Bottom capable of getting permits to extend Open Container hours beyond \\[cutoff time\\] for an afterparty or block party throughout a Dimmadome concert? I see additional marketing opportunities left on the table for all new locations.\n\nI believe new KK locations are missing out on a marketing campaign by opening with the entire cumbersome 50 item menu. This is a staggering amount of menu items which is too much to ask new staffers to perfect all at once. After a few months expanding the menu by approximately ten items is catching to customers who haven’t returned after a single visit or infrequently stop into KK. There are ten new food items that might appeal to them. Just like it appears KK doesn’t know what it’s looking for in a good commercial spot, this company doesn’t appear to recognize a talented from an untalented worker until it’s too late.\n\nIt is my understanding that KK had a headhunter to find Icus, the first Bikini Bottom kitchen manager. If it were up to me I’d hire someone to break the legs of that headhunter for bringing in a subpar kitchen lead. We are still attempting to recover from the lousy choices she made in the floor plan. If anybody responsible for Bikini Bottom’s floor plan is still giving input, stop them immediately. Once the doors were open to the public Icus had his head in the clouds to a point where I questioned if he saw the writing on the walls of an imminent demotion and stopped trying as a result. I had a full deck of 3x5 cards in an archaic powerpoint presentation bringing numerous concerns to light that he kept putting off listening to until he was fired. Those same cards were broken out for this essay. The second kitchen manager, Krumm, is a good lesson in honesty. According to Heffer, Krumm was given a bill of goods about how smoothly KK Bikini Bottom was running. Since Krumm stepped into a latrine pit which he was led to believe was a heated pool, he left in short time. Krumm also had plans to modify the menu but when his bosses told him to be a rodeo clown rather than a cowboy Krumm didn’t take too kindly to that. Meanwhile Heffer was the savior of the Bikini Bottom kitchen. I didn’t agree with every single decision he made, but I did with a majority of them. Heffer’s overhaul was such a blessing so I didn’t have to fiddle with the organization of 60% of the equipment anymore, only about 20% now. Too bad Heffer’s crippling depression came back after bashing his head into the wall out of frustration with the shackles KK restrained him with.\n\nThe current management team is enthusiastic but inexperienced. I see an accumulation of small infractions that might bring down Bikini Bottom’s health department rating significantly. I see the entire management team being inattentive or unaware about organizational issues. Whatever bureaucratic nonsense corporate tasks everyone with from the original sous chef Skeeter to Patty Mayonnaise that makes them walk away from the line between 11am and 1pm especially is infuriating. I have never been left alone on a multi-person line during peak hours so regularly, and I won’t tolerate it anymore. As much as I believe in his drive, I imagine our current kitchen manager SpongeBob will be let go after a disastrous service during the Dimmadome concert season that someone has to take the fall for. Chef Ren and I could help bring experience in management and dealing with festival traffic...if corporate does not force us to follow a failing strategy.\n\nAfter working nearly a year at KK you may ask why I’m not proficient on more than one station. Excellent question. First, when I move over to another station the squeeze bottles are never labeled (until Stu Pickles was hired, now they’re sometimes labeled), so I always looked at the glut of unlabeled sauces and I’d go back to my station because the basic information is missing (also a health department violation for having numerous unlabeled, unchilled bottles). In his first week the new general manager Stu Pickles pulled out 90% of the containers under the grill station because they were lacking labels despite an expected health department visit. The second reason for my menu ignorance is the mountain of prep for my own and upcoming shifts I have piled up on my station throughout service. My attention to detail appears to be next level with my ability to anticipate stocking all items for all shifts including the weeknd. The third reason I wouldn’t learn multiple stations is a defense against the afternoon conference calls. In \\[month\\] the Bikini Bottom line was unprepared for a busy post lunch because one cook was cut and our expo person was busy with a conference call. The two of us remaining on the line had a miserable slog through an unexpectedly busy afternoon. When I brought this up to Krabs he disregarded me, being a good bean counter he quoted the cost percentage. What he didn’t take into account was the missing expo person who could have jumped on the line and expo to help the understaffed two man team. That person was stuck on a conference call. Just recently I saw the company actively lose money because of this poorly thought-out meeting during business hours. A customer wanted to order a dessert that was 86ed but had been restocked by our prep cook an hour before. The server was unable to sell them their dessert because the only person in the building who could help un-86 an item was on a conference call. This conference call calamity is another bone-headed choice that speaks to a larger decision-making problem within the corporate structure. Finish the conference calls by 10:45 am eastern.\n\nIn conclusion, I quit my position as a lowly grunt for this company because of its unwarranted perplexing dance steps and below average management. I don’t care how much varnish and lacquer is supplied, I refuse to polish this Bikini Bottom turd as a manager or full-time employee under the current circumstances. You would have to take a pickaxe to the floor, possibly relocate the bathrooms to add a door to the dishpit, get rid of the cheap low boy that doesn’t properly drain excess water, and Mr Gorbachov knock down that wall in the middle of the kitchen to give the proper amount of space to work. Or simply reduce the menu to 36 items (including sides) because that’s the amount of space this dreadful design can comfortably output. Would Gordon Ramsay compliment KK for all the unnecessary convoluted complications abound, or would Chef Ramsay yell about keeping it simple and demand KK chuck it in the flip? Thanks to the numerous pop up restaurants I have been a part of and the hectic world of trade shows/conventions, I may have more experience than anyone else employed by KK in smoothly opening a new location. I would enjoy being part of the opening team to ensure new locations have an efficiency Bikini Bottom lacks, and to keep upper management away from their worst instincts. Work with me and Chef Ren and we will help you become a well oiled machine like Chokey Chicken instead of the Chum Bucket cesspit Bikini Bottom currently embodies.",
    "title": "Resignation Letter in Academic Essay Format",
    "subreddit": "jobs",
    "timestamp": 1685633924,
    "score": 0,
    "keyword": "mixed race judge"
  },
  {
    "text": "WOMEN OF WISCONSIN: Get ready to vote tomorrow in one of the biggest elections in modern U.S. history that no one's ever heard of. The swing vote on the State Supreme Court is up for grabs, where a victory for liberal JANET PROTASIEWICZ will almost certainly overturn the state's total abortion ban Here's an article going into more about what's at stake:\n\n* https://apnews.com/article/wisconsin-supreme-court-abortion-redistricting-trump-df0a7e5cfec1cd3bf08f14270a1c9615\n\nAfter Roe v. Wade fell last year, a trigger law from the year 1849 - over a decade before the start of the American Civil War that ended Chattel Slavery - banned abortion in the state. Despite a Democratic Governor ready to sign a repeal, the Republican controlled state legislature has opposed it, and a 4-3 conservative State Supreme Court slow walked the legal challenge. \n\nHowever, one of the 4 conservative justices, Patience D. Roggensack, is term limited, and the state elects SCOTUS judges by a vote so the race tomorrow will effectively determine control of the now deadlocked 3-3 court. A win for Judge Janet will give liberals a majority for the first time in 15 years, ensuring a liberal majority court will now have the final say on the legal challenge to the 1849 abortion ban, and in almost 100% likelihood, throw it in the trash.\n\nAND THAT'S NOT ALL \n\nWisconsin is victim to the worst Republican gerrymander in the country, where the maps are so rigged that Republicans only need 40% of the vote to control a majority of the state legislature, while Democrats need a 60% supermajority! Watchdogs have called it one of the most dangerous affronts to democracy in the Developed World. The conservative State Supreme Court has done nothing to address this, but a new liberal court majority is very likely to lead to a legal challenge against the maps. If overturned, Democrats would go to having a fair chance of winning a majority in the state legislature and turning the state fully blue like Michigan and Minnesota recently did. It would ensure that not only the monstrous 1849 abortion ban would be overturned, but Republicans would struggle to get back the legislature to ban it all over again. Right now all they need is the Governor's Mansion. \n\nJanet's opponent, Dan Kelly, is a hardline conservative backed by the three biggest anti-abortion groups in the state. He was part of a scheme to throw out Joe Biden's victory in Wisconsin in 2020 by sending an alternative slate of electors to vote for Donald Trump instead. He is a mad man, and is very likely to uphold the 1849 ban as well as the maps.\n\nLadies, however you can, GET OUT AND VOTE FOR JANET!!!",
    "title": "WOMEN OF WISCONSIN: Get ready to vote tomorrow in one of the biggest elections in modern U.S. history that no one's ever heard of. The swing vote on the State Supreme Court is up for grabs, where a victory for liberal JANET PROTASIEWICZ will almost certainly overturn the state's total abortion ban",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1680540588,
    "score": 33519,
    "keyword": "mixed race judge"
  },
  {
    "text": "Do you think that women are held to a different weight standard than men? For example of a man and a woman were of the same BMI or more specifically if the only difference between the two are their genders and they were both of the same height, the same race, the same weight, do you think that those men and women would be judged differently or the same?",
    "title": "Do you think that women are held to a different weight standard than men?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1699836997,
    "score": 826,
    "keyword": "mixed race judge"
  },
  {
    "text": "Donating eggs - my perspective. TLDR: I anonymously donated eggs in 2021. Yesterday I met my donor daughter for the first time. She will be 1yo this month. She is beautiful. She looks like me and my youngest child. Her parents are wonderful. I am incredibly happy for them. My donor recipient had a hard time and went through a lot to get her daughter. My youngest child has been begging me for a sister so he sort of got his wish haha.  \n\n\nLong version:   \nI live in Australia so you can't sell your blood, plasma, sperm or eggs. If you donate, you do it altruistically. I've always donated blood and plasma - I hit 75 donations before my doctor told me to give it a rest for a year. In 2021, I watched a doco on Netflix called One More Shot about infertility. I've always wanted to be a mum. I met my husband at uni. After three and a half years, we got married the day after I turned 23yo (husband was 24yo). I had my first son a year anda bit later when I was 24yo and had my second son when I was 27yo. I'm 32yo now. I fell pregnant easily - especially with my second. I fell pregnant the week my Implanon (contraceptive) was taken out. My GP didn't believe it until he checked the dates - he was the one who took the Implanon out. My point is that I am very fertile, I am done having kids and I have plenty of eggs that I don't plan on using so why not donate?  \n\n\nDonating in Australia had a lot of prerequisites: you had to be of a certain age, be relatively healthy, had finished your own family or sign a waiver saying you wouldn't blame the clinic if your fertility was affected by your egg donation(s), etc. You also had to go through a few other hoops like sessions a few months apart with a psychologist. If you were married like me, you need permission from your partner and they too would have to do some psych sessions. Then came the blood work. The forms. Vaginal scans. Medication. Lots of needles. Lots and lots of appointments. As an egg donor, you basically went through the IVF process and stop short of the implantation part. That was all fine with me. Inconvenient but I'm a SAHP so I had a lot of free time. The clinic paid for everything for my donation - apparently some clinics in Australia want you to donate (for free) but also expect you to pay for it too (medications, hospital stay, doctor fees, psych fees, etc.) so I'm guessing that's when you know who your donor will be and the recipient parents would cover that. I'm an anonymous donor so I didn't know who would get my eggs. I could put stipulations and pick recipients who were of a certain age, race, religion, nationality, etc. but I didn't. When I woke up from the egg retrieval surgery, I was handed a gift bag with a note basically saying thank you and that even if my donation did not result in a baby, that at least I gave them a little more hope anyway. I've kept that note and filed it away.  \n\n\nA year later I heard there wasn't many donors, even less than the exisiting dwindling pool of donors, due to covid. So I made another egg donation in 2022 at the same clinic. My ovaries were overstimulated again but this time was much worse than last time. I was sick for longer and had gained a lot of weight and decided not to continue - legally you could donate up to five families. During this second donation, the clinic let slip that my first donation recipient was pregnant. I was glad for them but didn't seek out anymore information at the time.  \n\n\nOne day I got an email telling me our donor database was being moved over to a government one and I had to fill out new forms. During this process I found out I had a match, that one of my egg recipients were successful and had a baby girl in 2022 (clinic can release the gender and year of birth of donor children to egg donors). I was so glad for them and didn't want to pry so didn't send that email to the clinic. So I filled out the new forms. I had the choice to not put down any identifying or contact information until the child was 16yo but I put down all my details incase they needed it for whatever reason. Maybe they didn't need my details today but might need it in the future before the kid turns 16yo. When the kid turns 16yo, they could find me whether I liked it or not. I was also fine with never hearing from them ever as well.\n\nWithin a week of filling out those new forms, I got an email from my donor recipient. The first embryo implanted worked and she had given birth to a beautiful baby girl. The mum sent me a photo of her and her daughter that day (10mo), plus another photo of her daughter as a newborn. I literally screamed that my kids ran to me. I was so excited and happy for her! I quickly showed my sons and my husband the photos. My youngest who is 4yo has been bugging my husband and I for a sister. My 4yo celebrated and screamed \"yay, I have a sister!\"\n\nThe next few weeks were a mixed bag of feelings. My kids who were extremely happy and excited came home one day saying they don't want to talk about their donor sister and wanted to keep it all a secret. It turned out no one believed them at school and had called them liars. I talked to the teachers and we sorted everything - my kids are fine now. My husband and I had years to talk and process different outcomes of my donations but I forgot that my kids are so young that they would need much more time to sort it all out for themselves. My mum and siblings were excited and a little heart broken but mostly happy. It took almost a year to donated eggs from when I first made an inquiry to the egg retrieval and last blood test. My dad passed away a couple of months before the egg retrieval surgery. He was proud of me, excited, and fascinated by the egg donation. I'm sure my mum would've wanted to talk to him about it.\n\nThe day came when I would meet my donor recipient, her partner and her daughter. I was very, very nervous. Mostly thinking that they wouldn't like me. I was worried that my skin would be darker than they expected it to be or that my personality wasn't what they'd imagined. I didn't want to be a disappointment. When we got to their driveway, we saw their amazing vegetable garden - much like ours. I was so, so nervous but I had my two kids, who are also very keen gardeners, running around the garden finding veggies they could identify. We never even got to knock on the door because my husband and I were chasing after our boys. I looked up and there they were -  they just appeared out of thin air haha. My donor recipient was holding her daughter who looked very much like my youngest. Her daughter had just woken from a nap and was a little groggy but was excited to see my boys playing in her garden. My boys wanted to give her a hug immediately but my eldest changed his mind said that they both should wait and not scare the baby so they crouched on over and said hello. I noticed that she has my eyes, my eyebrows and the same hair as my boys. She definitely has her father's nose and a few of his features too. Time will tell how much more she will take after me or her father (also biological father) through our shared DNA. I'm sure she'll take after her mother's mannerisms and such too. I'm happy that my donor recipient could carry her child through pregnancy, labour and delivery - I know how much she wanted that. I know my pregnancies made me a little closer to my boys and is genuinely a unique experience.\n\nWe eventually went inside. I found out my donor recipient's husband/donor child's biological father is also a long distance runner like myself. My recipient loves gardening like I do. It turns out they are very much my sort of people and I was just so happy for them. I was also relieved that they liked us too. My donor child is so very loved. Her parents had gone through so much. Again, I had my children so easily and young that I never thought about miscarriages, IVF or anything to do with infertility at all. It just never came up in conversations. It was only after I donated that a lot of my friends and family told me about their stories of loss and infertility. My donor recipient had a few miscarriages with some after IVF. I can't imagine the heart break she and her husband endured throughout the years.\n\nI feel a bit goofy typing this but there was this weird amazing feeling when I held my donor child. It was sort of a \"hey there you, did you know that your mum went to the moon and back to get you? You magical little thing. I'm so happy you're here\" She is the sweetest baby girl. She didn't cry at all throughout our visit. Loved being held by my husband but more so me - I kept bouncing her to make her laugh so that's probably why. Her parents said that she doesn't usually like being held by men at all and that she usually takes a little to warm up to people in general but she came right along with my husband and I. She followed my boys everywhere with her tiny legs - she only learnt how to walk a couple of weeks ago. We talked for a couple hours until my children got overtired and probably overwhelmed. We took some photos to show our both our families (hers overseas and mine out of state). They kept mentioning how grateful they are but I don't really know what to say to that. I'm just really, really happy for them. \n\n&#x200B;\n\nJust a couple of notes I want to add in:\n\n1. There hasn't been enough time for my second donation (2022) to result in a child but I've been told the (19 successfully frozen) eggs have been allocated to a family so I hope they get their little one(s) too even if I don't get to meet them ever.\n2. My husband probably would've donated sperm but because we didn't want to have anymore children, he had a vasectomy in 2019. I watched that documentary in 2021 so it was just too late for him to donate sperm in the typical and inexpensive way.",
    "title": "Donating eggs - my perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1688997426,
    "score": 94,
    "keyword": "mixed race judge"
  },
  {
    "text": "I work with all women in science and it’s awesome There’s only 6 of us, but my department is 100% women, more than half are women of color, and we do science at a biotech company. I’m currently in an email thread with two of my managers (both women) and it made me start thinking about how great and easy it is to work with other women. We work closely with other departments, too, so I do work with a good mix of genders/races/ages but it is so refreshing to not have to be constantly explaining myself or proving my worth. My bosses back me up on decisions. They have stopped other departments from assigning me more work that shouldn’t be assigned to anyone in my department in the first place (reports, small projects). They come to me for advice on issues they haven’t encountered before but I have cause I’ve been here a long time. They let me present data at meetings with clients and higher-ups. \n\nI know in my heart that if I had more man bosses, or any gender but misogynistic, I would not be in the same position and salary. \n\nI am so grateful for accidentally ending up here and I’m excited for future young STEM women to be more likely to have this experience, rather than constantly having to prove yourself. I know we are going backwards in a lot of aspects society-wise but this is a little win for me.",
    "title": "I work with all women in science and it’s awesome",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678214336,
    "score": 74,
    "keyword": "mixed race judge"
  },
  {
    "text": "On dealing with my boyfriend’s sexist friends in a second language I’m not sure what I’m looking to achieve by writing this post, perhaps I just need to get this off my chest. However I’m open to advice or encouragement. Tell me to chill, I don’t know.\n\nSorry for the length, I hope this isn’t boring.\n\n\nBackground:\n\nI (32F) am an American in Europe. I’ve been living here, in the same country, for about a decade so the language barrier isn’t such an issue. When I encounter situations where cultural differences are evident, I try my best to reserve judgement and just listen until I’m sure I understand what’s going on.\n\nSo our country’s lockdown was pretty strict. After the first wave, I moved across the country then got stuck in lockdown again in a brand new city. Fortunately, I met a fantastic guy around that time and we spent a lot of our quarantine together.\n\nHe’s not the kind of guy I wouldn’t normally go for: he’s in finance and is a semi-pro sports player. I’m an artist, I’m bi, I’m mixed race, and clearly a foreigner- it’s cool, I’m happy with who I am, but it’s obviously easier running in social circles where we have at least a few of these things in common.\n\nI figured I was changing a lot in my life at that time so why not try to get to know someone who I normally wouldn’t have reached out to before. It turns out it was a great decision. My partner is a fantastic human, his family is also super open to our relationship which isn’t necessarily a given in this region. Thus far, we’ve been together for nearly 3 years.\n\n\nThe issue:\n\nAs we began to settle into our normal lives after COVID, we started hanging out with my partners friends more (most of them are from his sport). Eventually they could resume playing, so a lot of my Partner’s time was spent with the team. Many nights were dedicated to after practice/game hangouts, which was mostly a lot of fun…. except… the rampant misogyny. Honestly I was floored at some of the shit I heard.\n\n\nHere are some classics:\n\n-Just the free usage of the our language’s equivalent of bitch, slut, whore and f**. Sometimes even racial slurs\n\n-A dude at a wedding yelling out “so guys what bitches/sluts are you trying to find tonight” while his wife and baby were at the other end of the courtyard\n\n-Another referring to his wife and mother of his child a crazy, emotional *girl*\n\n-Yet a different wedding one of the groomsmen didn’t understand why Pride needed to be a thing. The irony, gay marriage is not legal here\n\n-Many of the team players have a tattoo for a famous player of their sport, who raped a 19yo. I’ve asked, they still insist “she was lying” or “even if it was true he was really good at said sport”\n\nAnd finally the one that tipped me over the edge:\n\n-I found out a couple months ago, one of their ex teammates stealthed a friend of mine. I can’t say I’m surprised but I would be shocked if this sort of behavior was an isolated incident \n\nFor the first several months of getting to know some of these guys I was pretty reserved. just absorbing context. Getting to know new friend dynamics is difficult on its own, in a different language it’s even harder. However, after a while it was clear that I wasn’t misunderstanding much.\n\nI don’t know if it’s me being a woman or a foreigner, but any time I interjected, no matter how calm or rational it was packaged, I was met with opposition. Most of them would just double down. It’s not really a surprising result. After a while I felt myself becoming hostile to my partner’s friend group as a whole (even though some of his friends are actually chill people). It was not a good look.\n\nMostly I was upset my partner never said anything. Like his discomfort was palpable in some of these situations, but didn’t see the point in being confrontational if the guys weren’t in his close friend circle.\n\nAs for some of the guys in his close friend circle- fucking yikes. To be fair he has been trying to be more proactive when derogatory things are said.\n\n\nThe solution so far:\n\nAs I started making my own friends it has been easier to avoid situations around my partner’s sports friends. I even thought at one point that I was blowing things out of proportion. But now that our interactions are usually for specific events, their disrespect is just more evident.\n\nSo, that’s it. Distance is my solution.\n\n\nThe question:\n\nI don’t even know what advice I need. My partner just finished his last season, but this topic is still thorn in our otherwise great relationship. \n\nIt sucks that I cannot spend an extended amount of time with some of his best friends. And I feel very uncomfortable knowing my partner’s good friends have such little respect for women- but of course I’m never going to say “it’s me or them”.\n\nLike I said, he’s being more assertive on this topic, he has major golden retriever energy and does not like to disappoint people. I applaud his efforts and don’t think I can fairly ask for anything more. \n\nWhen I do see his bros, I’ll just have to keep it superficial until further notice.\n\nThanks for reading and letting me vent.\n\nTDLR\nMy partner and I are an odd pairing. During COVID we made it work then I realized a lot of his friends are pretty sexist. I thought something was lost in translation or there was some cultural thing I didn’t get, but that wasn’t it. My SO makes an effort to speak up when they say fucked up shit but some of his friendships still make me uncomfortable. As a solution I avoid most interactions with his buds. It feels bad.",
    "title": "On dealing with my boyfriend’s sexist friends in a second language",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690741434,
    "score": 26,
    "keyword": "mixed race judge"
  },
  {
    "text": "Putting in effort for patients who aren't fully invested in their own well-being or don't respect my time I thought I could do it, you guys, but it's kind of wearing me down. Recently got a string of frustrating patient encounters. I'm an outpatient psychiatrist (2 years out of residency) and I do a mix of medication management and therapy. \n\nI feel ashamed about it because I feel I shouldn't let these things bother me, but it's been tough. I'm pretty worried I might be getting burned out because of these things and that makes me feel resentful because I have a full panel of other patients. \n\nI try to set boundaries but each time I'm putting in effort and thought into it because I want to be professional and healing and this is extra draining. It'd be easier in the moment if I can just say what I think without all the empathy and the compassion but I also know it's not helpful and obviously unprofessional. \n\nI think maybe I feel resentful for all the effort I put into patients who aren't fully invested in their own well-being or don't respect my time. \n\nExamples:\n\n1. A young woman who decided she wanted to go \"natural\" and stop her mood stabilizer, but then later emails me and asks about getting a prescription for Adderall because she took one of her boyfriend's and felt better. And when I tell her we need to meet and discuss, she says, \"why? We just met. What else do you need to know?\"\n\n2. A young tech guy who literally told me \"I haven't had vacation in like 6 months and it's really hard for me to ask for it because I'm so junior on the team. Can I get a medical leave? I've called out of work and I feel less anxious when I do that.\" We ended up negotiating starting a medication and he'll consider therapy while he gets on leave but this also makes me feel frustrated because on the one hand I feel I should meet patients where they are and I do believe this will net help him, but on the other hand I feel my goodwill is being taken advantage of.\n\n3. An elderly guy who keeps making sexist comments and downplays his drug use. He is a recent transfer from a colleague moving away and he's only on Vyvanse (low dose). I feel maybe it's worth the not ideal stimulant use to work on the therapeutic rapport and explore his substance use without alienating him now, but I also feel he's not that invested in getting better and I don't feel good about this.\n\n4. A young man (very wealthy) who recently got into a fight with a server because they had a bad attitude. This led to verbal confrontations and ultimately a physical fight. The one that made first physical contact, according to patient, is the server; police were called. This patient expresses a lot of frustration over being disrespected, and uses his usual coping mechanisms of buying things, but tells me he went and bought a luxury car but still feels way too angry. He's decided the only way to feel better is to hire the best lawyer and \"ruin them financially\". He says he doesn't care about the money but he bets this server and this restaurant would because apparently it's a small business. I'm trying to talk him down / see this as an opportunity to work on emotional regulation in ways that will benefit him, but like, it's so gross and sad. I'm trying to remember I'm this guy's psychiatrist and not like a judge, and life is unfair, but it's hard for me to keep the empathy. \n\nI think about taking some personal time off but there's so many patients and needs... and I also feel I shouldn't be struggling with this because I should be better somehow.\n\nOh, and in addition I feel like 150% Mom guilt so in addition to all of this I feel I'm abandoning my own family for this job.",
    "title": "Putting in effort for patients who aren't fully invested in their own well-being or don't respect my time",
    "subreddit": "medicine",
    "timestamp": 1682448694,
    "score": 384,
    "keyword": "mixed race judge"
  },
  {
    "text": "How to counter act appearing “dumb” in front of others? I made a mistake last night and Ik sometimes I can be air headed. I work night shift and that affects my brain and I barely eat. Idk I get woozy sometimes or have a brain fog. So it can be difficult for me to focus. \n\nAnyway my pt had a neck brace on and my and my other coworkers put it on backwards 😭she was confused and took it off during the night. Idk the way I found it it was were the back part was in the front and the front was in the back. But I didn’t remember how it originally looked. \n\nSo I assumed the position it was in was right and tried to fit it back on. Then I was like it’s not fitting right and wanted a second opinion. My other coworker also didn’t really have experience with the brace and even another one after her didn’t really notice it was backwards. It was also dark in the room but I’m not sure if light would’ve helped. \n\nSo I get the charge nurse which I hated because she is super gossipy and judgmental. Like she pretends to be nice so much idk when she’s actually being nice and when she’ll talk shit behind your back. Anyway, she comes in and figures out it’s backwards and she gasps dramatically telling the patients son it’s backwards like it’s the most horrific thing in the world. \n\nIdk I just feel like if it was a different person it would be a teaching moment and not a chance to ridicule me. My old day shift preceptor would’ve just explained how it’s supposed to fit and let me know accidents happen. \n\nNot make me feel inferior and go off to tell her other coworkers she’s sitting with to demean me. Idk then she makes a comment when talking to me and my coworker about how she’s oriented and I’m not. \n\nI swear she’s making SAEs which are subtle acts of exclusion or something idk like she makes jabs at me like that. I don’t like bringing race into things but I’m one of two black people on the floor. Maybe that doesn’t change much because the other black guy is treated way better than me since he’s viewed as “smart” and I’m “dumb.”\n\nIt’s probably just my personality because I can be like this when I’m off just very uh not dumb but I say and do things based off the first thought that comes to my mind. So sometimes what I say or do doesn’t make sense. The reason why I feel like I didn’t switch the brace around is because I give up too fast and find direction from others when I feel like I can’t figure it out on my own.\n\nSo idk what to do my coworkers think I’m not smart and it’s difficult to work with them when ik every mistake is another chance for them to use as ammo and look down on me. It’s like there’s the new grads who I’m friends with and the older people who are judge mental asf. My other new grad coworkers just reassured me it was ok and that they also didn’t know it was backwards. So they don’t judge quickly and are actually forgiving.",
    "title": "How to counter act appearing “dumb” in front of others?",
    "subreddit": "nursing",
    "timestamp": 1693167849,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Shut your CRT ass up! My husband last night wanted to have dinner with his parents and I was down. Then he mentioned some of his parent’s friends would be there, and I was still willing to go because the in-laws are my in-laws. \n\nLet’s call the new friends Marti and Barty. Marti seemed like a nice and sweet lady, but Barty on the other hand was a real asshole. \n\nWhen we first got there my in-laws and their friends were in the dining room eating, and my husband and I are were in the living room. While we were eating I thought I overheard Barty saying some real off-putting shit about Mexicans and Cuban, but whatever I let it slide because I wasn’t sure. \n\nAfter they got done I heard my MIL say let’s go to the living room to join us, and oh my I wish I would have left then because they brought up that I was a school teacher. \n\nIt was the usual I wIsH I hAD tW0 moNthz oFf or I CoUlD dO tHaT jOB iF iT wAsNt fOr thE kiDs teeHEE and blah blah blah blah. Nothing that really bothers me because I, my husband, and in-laws know how hard I work, so whatevs. \n\nThen Barty says, “I hear they’re teaching kids to be racist in schools.”\nFIL replies, “No, they are starting to teach Critical Race Theory.”\nBarty, “Yes thats the thing” and then they both look at me.”\nSo I say, “No, no one is teaching CRT, and it’s not even in most state standards.” Barty says, “No they are teaching it at schools because I heard it from Dr. Phil.”\nThen I politely say, “No, actually they are not because K-12 students cannot grasp CRT. CRT is usually taught in grad school or upper level college, teaching CRT would be unable to be taught to K-12 students because they do not have a firm understanding of Law, History, or theory to properly apply CRT”. \nBarty stares at me and says, “We’ll it’s being taught.” \n\nI cannot fathom how people still take the word of Dr. Phil these days lol and this man knows no teachers and ain’t even from here. \nSo what I really wanted to say is “SHUT YOUR CRT ASS UP. Motherfucker, YOU don’t even know what CRT is! Students aren’t even on grade-level and you think they can learn CRT??” \n\nBest part of last night was the official start of summer! It was also my birthday! And FIL said we ALL would have dinner again next week! Yaaaaaay!\n\nEdit: wow I did not think this would blow up like it did lol thanks for the coins, idk how to use them but I’ll figure it out 😆 and thank you for the responses as well some of them were hilarious too. \n\nSomeone commented I should make videos or posts about this subject matter and honestly it’s worth it. Even if I wasn’t teacher, you all out there are amazing individuals, and yes the compliment even extends to those who judged me based on this post or my Reddit account. \n\nFinally, I just wanna say that I was raised and believe that everyone does deserve respect and kindness, especially if you are a guest in someone’s home, and if anyone ever were to cross a line or boundary l was also taught to stand up for myself too.",
    "title": "Shut your CRT ass up!",
    "subreddit": "Teachers",
    "timestamp": 1685809259,
    "score": 6057,
    "keyword": "mixed race judge"
  },
  {
    "text": "Saying \"Catch a Bubble\" is now racist... At least according to my school's admin. A bunch of Kindergarten and first grade teachers were told that in a meeting. The teachers were completely confused because they've been saying it for years and asked for an explanation, but of course admin was not able to explain any of their reasoning behind it. One teacher (white woman) was specifically told that she \"doesn't understand the culture of the children (title one school, mostly African American)\" to which she reminded them that she is engaged to a black man and has a mixed race child. They didn't respond to that either and basically the teachers were told if they are ever heard saying it again, they would be fired. \n\nI tried searching this claim and found something about how it's equivalent to telling kids to \"shut up\", but even that seems like a stretch. Nothing about how it's racist. \n\nAnyone else ever heard this?\n\nEDIT:\nTo clarify: I don't think it's racist. I'm just curious if anyone has dealt with something similar with that phrase or another management skill with their admins trying to be \"white saviors\". Also can't believe that of all the issues my school should be dealing with, this seems to be the focus right now. We literally had a child bring bullets into the building last week and that's being completely covered up.",
    "title": "Saying \"Catch a Bubble\" is now racist...",
    "subreddit": "Teachers",
    "timestamp": 1697473897,
    "score": 3981,
    "keyword": "mixed race judge"
  },
  {
    "text": "I was dress coded. Please advise. I, 19f, am a first year student teacher at a middle school. I was wearing a black high-neck body suit with black slacks from old navy. During planning, my mentor teacher told me that a male AP said that I was dressed “inappropriately” and that I need to wear looser clothes. My mentor teacher pointed out that she didn’t find anything wrong with my outfit but she just wanted to let me know. I immediately felt so embarrassed and uncomfortable because I put effort into dressing professionally and I felt like I was being singled out because many of the female teachers wear the same outfit and even more form fitting clothes than what I wore. My personal thought is the AP said something because my butt is big. I cannot control that. Even when I wear my baggy cargos to this school, my butt still pokes out. I just feel weird & targeted honestly. Please tell me if I’m wrong. Thanks.\n\nEdits for clarification:\n\n1. The high-neck bodysuit also has sleeves so no shoulders were out. The bodysuit just looks like a tucked in shirt, honestly. The reason I stated that I believe the AP made the comment specifically about my booty was bc I have a very small chest & my chest has never been a point of attention for me. However, my small waist & large butt combo has always been a point of attention no matter what I wear. \n\n2. I am able to student teach at 19 bc I earned high school credits in middle school due to being on the accelerated track + I dual enrolled during the pandemic, earning most of my freshman & sophomore credits for college before I even graduated hs. Lastly, I graduated hs a semester early. \n\n3. Yes I am in the USA.\n\n4. I am mixed race: Black, White, & Native American.",
    "title": "I was dress coded. Please advise.",
    "subreddit": "Teachers",
    "timestamp": 1695665653,
    "score": 2670,
    "keyword": "mixed race judge"
  },
  {
    "text": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation I thought Matt Yglesias' post today about the failure of teacher evaluation/pay as a policy over the past 15 years, would interest some here. It's from his substack which has a paywall for most posts, but I thought it would be reasonable to put the text in here, maybe he'll get a new subscriber or two. If you want to see the whole thing with the charts/graphs and hypertext links, check it out over there.\n\n&#x200B;\n\n[https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped](https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped)\n\n&#x200B;\n\n**Why teacher evaluation reforms flopped:The strange death of education reform, Part V**\n\nBy Matt Yglesias\n\n&#x200B;\n\n\\[This is part five of an ongoing series. Check out part one on the nature of the education reform movement, part two on the rise and fall of the achievement gap, part three on the successes and failures of charter schools, and part four on the right’s embrace of unregulated privatization.\\]\n\nI can’t believe I’ve gone this far in the series without discussing what was probably the single most important component of Obama-era Education Reform: the large-scale effort to shift teacher compensation and teacher evaluation from a system that was very focused on seniority and credentials to one focused on teachers’ measured ability to generate learning gains for students.\n\nObama was not only convinced by this strategy on the merits, but his administration was also empowered in a very unusual way to implement this change.\n\nThis was in part thanks to the Great Recession, which left state and local governments short on money and the macroeconomy in need of fiscal stimulus. The American Recovery and Reinvestment Act allocated money for a grant program called “Race to the Top” that, instead of giving federal money to school systems based on some formula, granted funds based on the extent to which schools implemented Department of Education-approved reforms. It was also in part a somewhat peculiar legacy of the original No Child Left Behind law, which deliberately gave states unrealistic proficiency targets and required non-compliant states to obtain “waivers” from the federal Department of Education.\n\nThe nexus of RTTT and the NCLB waivers gave Arne Duncan unusual influence over K-12 policy (which is typically more of a state and local matter), and Obama empowered Duncan to wield that influence fairly aggressively — especially to push states to adopt quantitative teacher evaluation systems.\n\nThis was politically dicey. Teachers unions hated it, and while rank-and-file Democrats never turned on Obama over his advocacy for this idea, the dispute drove a lot of intra-party tension and organizing. A lot of people who are today firmly anchored in the progressive wing of the Democratic Party don’t realize (or don’t remember) that downstream disputes about teacher evaluation 10 to 15 years ago were the genesis of so much factionalism, but they were. At the same time, while this cause had a degree of bipartisan support, it wasn’t really something Republicans or the conservative movement leapt to give Obama credit for. Rather than right-of-center people praising Obama for taking on the unions, conservatives generally negative-polarized away from their belief in the reform project, leading to today’s revived interest in vouchers.\n\nIf it had all worked out as intended, we would today see this as a major pillar of the Obama legacy — ARRA might not have been large enough to fully close the output gap, but it was large enough to drive systematic and beneficial change in American education.\n\nThe unfortunate reality though is that while there are some teacher evaluation success stories, these reforms did not on the whole generate great results. The upshot is that a ton of political capital was poured into something that didn’t work, the energy for reform dissipated, and a tremendous opportunity was lost.\n\n**The 10,000-foot case for evaluation reform**\n\nAs I’ve argued before, in politics it’s really helpful to be right about everything all the time. Unfortunately, Obama and his allies were wrong about this, and I was, too. The upside, though, is that I feel like I can describe pretty clearly what the reformers were thinking.\n\nThe basic point is that when it comes to setting teachers’ salaries (or deciding who gets laid off during a budget crisis), you have to pick some system. You could pay everyone the exact same amount (or do layoffs randomly), but that would still be a choice. And I think paying every teacher the exact same amount would probably be a mistake. Instead, districts typically pay teachers based on seniority, with extra pay based on their possession of graduate degrees. Because of the way pension and health benefits work, a veteran teacher is more expensive to have on the payroll than a rookie, even if their salaries are identical. So in practice, the system is even more weighted toward seniority than the salary schedule alone would suggest. Meanwhile, many systems operate on a “last in, first out” system for layoffs, meaning the most junior teachers are the ones who have to go in the event of a budget crisis.\n\nYou can model this as just union clout, but I think many who support this system have a good-faith belief that seniority serves as a rough proxy for teacher skill. That’s even clearer for the graduate degrees — giving people extra comp for extra credentials makes no sense unless you think the credentials are a good proxy for quality.\n\nIn reality, though, seniority is a pretty weak proxy for quality. In a very influential paper published in 2006 by the Hamilton Project at Brookings, Robert Gordon, Thomas Kane, and Douglas Staiger argued that the positive impact of experience on performance plateaus fairly rapidly.\n\nThe research on paying teachers extra for getting Master of Education degrees is, if anything, much clearer — these degrees do not help teachers become more effective, in part because the incentives are obviously screwy. Teachers are strongly incentivized to get the degrees whether or not the degrees are valuable, so universities compete in the marketplace to make the degrees as easy to obtain as possible. And as any teacher could tell you, that is not a good way to teach anything useful to anyone.\n\nThat’s what made the idea of switching to a system that emphasizes measured effectiveness so compelling.\n\nIs it straightforward to measure what makes a great teacher? Of course not. Are there problems and shortcomings with value-added measures based on test scores? Sure. At the same time, a highly imperfect proxy still seems much better than a proxy that definitely doesn’t work well, like seniority. And the master’s degree thing is worse than useless — the teacher ends up with less than 100 percent of the raise because some of the money goes to pay off the student loans that financed the useless degree.\n\nSurely we can do better than this.\n\n**It’s hard to do better**\n\nI think that we can, in fact, do better, and the teacher pay reforms that Washington, D.C. enacted during this era have had some clear benefits.\n\nBut in terms of the big national push for compensation reforms, the news is bad. That’s the conclusion of a recent and convincing paper co-authored by Joshua Bleiberg, Eric Brunner, Erica Harbatkin, Matthew Kraft, and Matthew Springer:\n\n\"Federal incentives and requirements under the Obama administration spurred states to adopt major reforms to their teacher evaluation systems. We examine the effects of these reforms on student achievement and attainment at a national scale by exploiting the staggered timing of implementation across states. We find precisely estimated null effects, on average, that rule out impacts as small as 0.015 standard deviation for achievement and 1 percentage point for high school graduation and college enrollment. We also find little evidence that the effect of teacher evaluation reforms varied by system design rigor, specific design features or student and district characteristics. We highlight five factors that may have undercut the efficacy of teacher evaluation reforms at scale: political opposition, the decentralized structure of U.S. public education, capacity constraints, limited generalizability, and the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security.\"\n\nI really like this paper because it not only presents a provocative result but offers a good explanation for what went wrong. Federal officials saw local reforms that seemed to be producing good results and decided to create a financial structure whereby the federal government would try, via the states, to make localities adopt similar reforms.\n\nBut not only do education interventions in general have an annoying habit of failing to work at a large scale, but this particular effort was beset by huge problems of political implementation.\n\nLots of the state-level politicians thought these evaluation systems were a good idea, of course. But the marginal elected official in these jurisdictions often didn’t think this was a particularly good idea, and only went along with it because they wanted the RTTT money. That meant there wasn’t a strong state-level political coalition that really wanted to overhaul the teacher personnel system. And this was atop another implementation layer of school boards (or occasionally mayors) who almost certainly didn’t want to change things. This then filtered down to another layer of implementation where principals were suddenly dealing with teachers who didn’t like being subjected to a new evaluation framework. Meanwhile, a range of actual practitioners (including some fervent reformers) has emphasized to me that reformers at the time tended to ignore the fact that most principals in schools with challenges really, really hate needing to fill vacancies. There isn’t some huge line of skilled teachers looking to take jobs in high-poverty schools.\n\nThe last line in the quote above about “the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security” is really important in my opinion.\n\nA key linchpin of the D.C. merit pay efforts is that average compensation went up by a large amount — and is only partially undermined by the high cost of D.C. housing. Every teacher, every year, needs to make a choice between “keep teaching” and “change careers.” The goal of compensation reform is to make the above-average teachers marginally more likely to keep teaching and the below-average teachers marginally more likely to change careers. But if teachers on average find the assessment process annoying and the reduction of job security troubling, then you’re making retention of average teachers harder and undermining the whole process.\n\n**Revisiting the original recommendations**\n\nThe Gordon/Kane/Staiger paper I mentioned earlier was very influential on my thinking. And it’s not just me. The Hamilton Project, in the late Bush years, played a major role in developing the policy agenda of what would turn out to be the Obama administration. Then-Senator Obama was even a featured speaker at Hamilton’s launch.\n\nI think it’s fair to say that the paper wasn’t just one of the research documents that supported the Obama administration’s approach; it was, in a sense, the intellectual blueprint for the whole thing.\n\nStill, it’s worth saying that this policy agenda was conceived during a different set of circumstances than those under which Obama became president. He says in the talk above that “when you keep the deficit low and our debt out of the hands of foreign nations, then we can all win,” and the policy panel that followed really focused on deficit reduction. Democrats in the mid-Bush era were not expecting the Great Recession, a huge collapse in aggregate demand, soaring unemployment, and ultra-low interest rates. They believed the Bush policy mix of tax cuts, wars, and Medicare expansion was unsustainable and that it would fall on them to replace it with something more responsible. By the same token, Obama name-checks Gordon as one of the Hamilton people “I have stolen ideas from liberally.” But Gordon’s paper does not propose using federal stimulus funds to try to strong-arm states into changing teacher evaluation policies, in part because the whole idea of doing a big federal stimulus wasn’t on the radar.\n\nWhat they wanted the federal government to do instead was pick up the tab for “up to ten states” to create a system that would offer bonus pay to highly effective teachers who were willing to work in high-poverty schools while denying tenure to highly ineffective teachers.\n\nThat’s similar enough to RTTT that you can see how one idea became the other. But it’s also genuinely different — Gordon proposed, essentially, a subsidy to a handful of states whose political leaders were genuinely enthusiastic about reform, with the reform in question designed to take nothing away from veteran teachers. It’s a policy change that is designed to generate a much higher level of top-to-bottom alignment, from teachers to principals to district leaders to state-level politicians. The hope, obviously, was that the reforms would prove to be a huge success, which would generate pressure for further adoption.\n\nThe other important plank of Gordon/Kane/Staiger was reducing barriers to entry in teaching. They cite data indicating that while traditionally certified teachers are better on average than uncertified ones, the difference is small with plenty of overlap. The idea was that by pairing certification reform with tenure reform, you’d cycle through more cohorts of rookie teachers faster, weed out the least-effective ones, and over time raise average teacher quality. And you could achieve that without doing anything negative from the standpoint of veteran teachers.\n\nBecause of the Great Recession, we ended up in a situation where districts weren’t hiring new teachers or creating new bonus programs. There was instead a lot of emphasis on using effectiveness evaluations to structure layoffs, which makes sense conceptually but is a clear and present danger to veteran teachers, and the point of RTTP was to tempt jurisdictions that didn’t particularly want to do compensation reform to do it anyway.\n\nI think the hope was that this would bring reform to scale much faster.\n\nInstead, it generated tons of ill will while creating a very strong socio-psychological connection between the evaluation movement and a period of severe education austerity in which budgets were slashed, jobs were lost, and inflation-adjusted salaries fell. And it was from within the union backlash milieu that we first started hearing from Ibram X. Kendi that the idea that an achievement gap exists is racist and that we can’t try to evaluate teachers based on student test performance because standardized testing is also racist.\n\n**Pitfalls of change**\n\nAs I mentioned above, I was a true believer in this particular reform idea.\n\nAnd I still believe that the 10,000-foot version of it is correct. If anything, I’m more focused than ever on the role that screwy compensation practices play in supporting rent-seeking graduate schools of education and in incentivizing them to operate as highly ideological enemies of sound social science and pedagogy. One potentially promising compensation reform proposal is to simply eliminate all new graduate degree bumps on a forward-looking basis and plow the savings into higher base pay across the board. This would have only minor educational benefits, but down the road it would have good political economy benefits.\n\nMore broadly, though, my thinking about the other great municipal workforce — cops — is greatly shaped by my understanding of what did and didn’t work here.\n\nMy points about the spatial misallocation of police officers are directly parallel to the Gordon/Kane/Staiger points about the utility of paying bonuses for highly effective teachers who are willing to take on the most difficult assignments. The discourse about “merit pay” flew off in a different direction, but the basic idea was never intended to be anti-teacher — it’s simply harder to teach classrooms full of kids who are dealing with a lot in their lives and whose parents are less likely to have the bandwidth or the financial resources to participate actively in their education. But the system as a whole does not serve its intended goals if valued teachers all self-select out of those assignments, leaving the toughest jobs to a mix of rookies, idealists, and people who’ve washed out of other schools.\n\nSimilarly, whether you’re talking about cops or teachers, if you want to hold people to a higher standard you need to be willing to spend money on higher pay and to think hard about recruiting pipelines.\n\nThe next, and probably final, entry in this series will focus on something that, based on the arc of ed reform, I am both hopeful and concerned about: I’m inclined to support the new wave of enthusiasm for phonics and “the science of reading,” but I also worry it will turn out to be another example of something that’s hard to bring to scale in a decentralized system.",
    "title": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation",
    "subreddit": "Teachers",
    "timestamp": 1684956059,
    "score": 5,
    "keyword": "mixed race judge"
  },
  {
    "text": "Book recommendations on equity? (US-based, ESL teacher) I'm planning to work as an ESL teacher in the US in 2024 after having taught abroad for many years.\n\nI'm planning to apply to a Transition to Teaching fellowship.  A major theme of the fellowship is equity and diversity.\n\nFull disclosure, I'm a white male living in an Asian country in a city where over 99.9% of people are of the local ethnicity.  There essentially is no ethnic diversity.  Virtually everyone I would come into contact with is also roughly middle class (there are nearly no truly rich people here and the government takes pretty good care of poorer families).\n\nSo I am not exactly the expert on equity in education or diversity, unless you can count the fact that I have been a racial minority for nearly half my life here and have a mixed-race family.\n\nI'd like to broaden my understanding of the situation in the States.  I also believe that being an ESL teacher puts me in a unique position because I will not be working with the general student population.  My students will not necessarily represent the ethnic/income situation of the school/population at large.\n\nDo you have any book recommendations for someone in my position?  I feel this is one area that I should really learn more about.\n\nThank you!",
    "title": "Book recommendations on equity? (US-based, ESL teacher)",
    "subreddit": "Teachers",
    "timestamp": 1693536505,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Any advice? Advice for my husband\n\nThis is ADVICE! I’m not asking for money, helping hand or anything just simple advice to help my husband support our family. Wondering what advice to give my husband who is trying to get into trucking, but has a felony charge that was dropped to a misdemeanor and 2 points on his driving record… \n\nDon’t judge him based on the felony. While it may not be the best thing to have, I can assure you he is a man with great work ethic, who has been discouraged. A lot of jobs he wants to work, he can’t because of the court ordered work release he received in lieu of jail time. Many trucking jobs have told him he cannot be hired because of his work release requirements, and the fact that they can’t offer him Monday’s off to attend. He has been out of work for some time now. With the increase in almost everything now, taking care of our family on my own even with my income, is not working… he truly wants to give our boys better. He got in contact with Swift, New England and Robertsons ready mix but was turned away because of the requirements please let me know if there are any places who may possibly work around or with him on this.",
    "title": "Any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1690858955,
    "score": 2,
    "keyword": "mixed race judge"
  },
  {
    "text": "RN looking to transition to something creative and lucrative - is mechanical engineering right for me? I've been an RN for 7+ years in multiple areas. I knew in my first semester of school I'd made a mistake, but due to my conservative, religious upbringing I stuck with it (intense feelings of responsibility to serve others, satisfy parents, limited exposure to routes outside of teacher/RN/\"MRS\" degree as a female, yada yada). I'm a violinist and had natural talent when younger, winning solo competitions, concertmistress of university orchestra, etc. My dream was to do studio work for movies and theater. It's a highly competitive field and once nursing took over my life my skills atrophied to a large degree, so it's not an option anymore. I grieve daily for the life I wish I'd gone for, and I need to move forward to something I CAN do.\n\nThe things I excel in sadly don't make money or have endless job openings. I'm a pretty even mix of right and left-brained attributes, having done well academically in science and math, but my interests lie in creativity, working with my hands, using my imagination. I minored in film, I enjoy DIY projects from laying tile to making my own furniture hardware, and my nerdiest hobby is SFX makeup - I geek out on SFX production, my love being prosthetics and animatronics - think the transformation scene in An American Werewolf in London. I'm an introvert, have ADHD combined type, loathe customer service, and need a work environment in which I'm not judged on my process, but in my outcome.\n\nI feel engineering could be a decent fit that would open doors to a better salary/benefits, challenge me, and involve creativity and problem-solving. I'd absolutely love to work in entertainment for companies like Weta FX or TAIT, or anything in a related area. With all this in mind -\n\n\\- does engineering sound realistic for me (both in entertainment and in general)?\n\n\\- is mechanical engineering a good route to the specific areas I'd love to work in? If likelihood of such niche careers is minimal, can I find a job as a ME that still utilizes high amounts of creativity?\n\n\\- I'm thinking of going the route of 2-year associate's via community college to then transfer to 4-year school for degree. Thoughts? Alternatives?\n\n\\- are there any career possibilities I'm not aware of that may be a better/equivalent fit? (Compensation is important - I need $70k+ for Seattle, WA, as I'm single and unwilling to make a lateral financial move for the sake of my retirement goals.\n\nThank you!!",
    "title": "RN looking to transition to something creative and lucrative - is mechanical engineering right for me?",
    "subreddit": "careerguidance",
    "timestamp": 1693553478,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Theory of Accounting How come every time I start getting high, I want to write?\n\n\nYou know the reason I think I like accounting or auditing is because at the end of the day when it works, you know that everyone has gotten what they are agreeing to, and they know that what they have is right. \n\nI feel there is this angst in auditing/accounting… a fear that maybe you’re wrong and maybe these financials or bank reconciliations are actually wrong… and you’re to blame because you were responsible \n\nIt really is a thankless job… at the end of the day, what is, is. It’s an accountant’s responsibility to know what is and make sure what is is accurately represented in our units of value and to report it on time.\n\nIn a way, our reward for doing well is not to be blamed for could have potentially gone wrong. Now, that assumes that what is actually attempting to be reported is correct. If your goal is to know how much you truly have, no man should be happy with his accountant showing him as having more than he has. This is perverse. We aren’t showing reality, we are destroying it. \n\nNow this can be avoided by all who would like to avoid it. But I think the real fear of a man is failing to be understood. An accountant that, doing their best to keep track and accurately represent and record the best representation of reality, fails to produce an accurate record of reality is a failed accountant. That fear crushed the thought of having any other dreams. The fear is that you can’t prevent the knowledge of the fact that you really just don’t know what’s going on. If you can do something to shield yourself from the idea that maybe you aren’t going to be the one who is able to keep track of reality and know how we measure it, you may do it. This may show you that you did know as much as you thought you knew or you will show that you are truly not who you thought you were. \n\nMany are in this field for job security… why is that the case? This isn’t a job of hopes and dreams because all it is, is. Why will you “always have a job with a CPA?” What are you selling that others aren’t? Because you have to be selling something to an employer. If it’s not a talent or some intelligence to innovate and create, perhaps you are selling your life in exchange to sit on the bench, keeping score. We don’t create anything, we don’t risk anything. Wait, maybe we do. Hold that thought. — Why do we deserve to do better than most? We can address why we should always have a job? But let’s do that later. Why do the partners at these big public accounting firms deserve to be making the big bucks? Well, they grease the wheel. They keep it spinning. And I’m not to say they aren’t doing their jobs and fulfilling their fiduciary duties, but what I will say is that they are making judgements. And those judgement are either in favor of the opinion of those who are enlisting them for their opinion or they are to make a judgement to disagree. To say, I reject your view of this reality. Either you kept track of it wrong, you displayed it wrong, or you know it’s wrong. Either way, the judge of reality is creating value— not without risk. An improper judgement leaves you responsible. Putting yourself in that position takes a mix of confidence, integrity, and vulnerability. Are you willing to take on that risk? Do you know what you are talking about? Can you communicate it? When challenged on it, can you state your case and maintain your composure? Do you know? Without a doubt?.\n\nNo you don’t, but that’s why there is reasonable assurance. Not absolute assurance. There is a diffusion of responsibility because if there wasn’t then no one would or could do it. Well perhaps some would do it, but could they always land on the right answer that everyone would agree with? When everyone can’t agree, you will be the one to suffer the consequences. So why would anyone do this job? To be employed, because,  yes, they will always need accountants. They will always need someone to hold accountable. With more of us, there are more eyes to judge whether that reflects reality, but, also, more of us to blame when those who are making decisions make incorrect judgements. \n\nWhy do we deserve to always be employed? I don’t know, but I hope we do.",
    "title": "Theory of Accounting",
    "subreddit": "Accounting",
    "timestamp": 1682057075,
    "score": 4,
    "keyword": "mixed race judge"
  },
  {
    "text": "y’all somebody talk me outta getting this dog 🤣🤣🤣 ugh i was at a mall yesterday and i saw this little fair for kids and the local shelter was debuting this adorable angel baby!!! he absolutely was so adorable i almost teared up 🥹 (don’t judge me lol i was ovulating and a lil high 💀) \n\nhis name is nash. he’s 9 months and a great dane mix. my friend and i concluded he must be the goodest boy all the time if they were willing to take him out in public with the kids like this. but i have a cat and i live in an 900 square feet apt and even though they are gentle giants they are still giants so idk… he seemed to love me but i’ve never had my own dog before\n\npeople often comment how my cat is spoiled and most people i’ve asked think i would be a good dog mom but i don’t have a car and his poop would be the size of a grown ass man’s!! 😂😂 what should i do?? the shelter opens in 3 hours",
    "title": "y’all somebody talk me outta getting this dog 🤣🤣🤣",
    "subreddit": "blackladies",
    "timestamp": 1699098711,
    "score": 365,
    "keyword": "mixed race judge"
  },
  {
    "text": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me. Hey everyone, this happened at my daughter’s school this week and I’m kind of uncomfortable with how it went down. Would love to have some insight on this situation.\n\nMy daughter goes to a small school in our town where I volunteer in the library weekly. It’s my favourite day of the week, and I had a great time this week as always reading with and telling stories to the kids, plus getting to spend the day with my daughter. I got there a little early and since no one was in the library, I decided to go and paint with one of the teachers and some of the younger kids.\n\nAs we were painting, one of the little boys, let’s call him Miles, came up to us, pointed at the little bit of lace visible at the front of my wig and loudly said “Fake!” before he and his little brother sat down next to me and started to paint. I rolled my eyes, because kids are gonna be kids, and went back to what I was doing, but the teacher was clearly upset. She told him what he said wasn’t okay and made him apologize, I said it was fine he does that sometimes. She continued to tell me that didn’t make it alright, and started telling me about her experiences with racism growing up as an Indian woman.\n\nFor additional context I know this kid relatively well. I’m friendly with his parents, he’s friends with my daughter, frequently borrows her manga, and will generally come into the library to chat with me on the days I volunteer (translation: to show me his new Pokemon), read with the other kids and flip through whatever book I’m reading (he’s a very advanced reader). A few weeks ago at one of the school’s many events, a bunch of the kids and their parents were eating together and he said that he liked my hair. My daughter’s best friend said that it was fake. The school is very diverse and since a few of the black kids are either from mixed race families or have been adopted into white ones, conversations about my hair are frequent and sometimes the non-black kids join in. He asked what my real hair looked like and I told him that he'd already seen it several times.\n\nBack to the present, one of the other teachers (who was white) came up to me after lunch time and said that he and the other teacher were going to sit down and have a conversation with Miles about what he said and that it was important to talk to kids about racism. I said I didn't think it was necessary, but he continued to talk over me. If you recall my previous post about this school this is the same teacher who had been hitting on me, so I was way too uncomfortable to say as much as I probably should have.\n\nMy perspective on the situation is this. This kid wasn't racially stereotyping me, he has been present for multiple conversations about my hair, so he knew it was fake. He is a kid and is curious about cultural differences which is normal. I think non-black people have a different perspective than black people on what is considered unruly behaviour in a child. I also think non-black people think black hair is some kind of secret and are extremely uncomfortable talking about it or hearing it mentioned. I'm not.\n\nThe little boy is 7 years old. He's not white and comes from Middle Eastern/East Asian background, so there may have been an element of racism to the way the situation was handled towards him. He also made a comment about the first teacher's weight a few minutes after the one about my hair, so I also suspect that she just doesn't like him very much.\n\nAnyway, I'm curious about everyone else's perspective.",
    "title": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me.",
    "subreddit": "blackladies",
    "timestamp": 1688343941,
    "score": 68,
    "keyword": "mixed race judge"
  },
  {
    "text": "Why do ''alt'' black women mostly white guys? Edit: title was meant to say date!\n\nThis might be controversial.\n\nBut from being an alt black woman myself from Britain (I kinda detest the alt term but that's another discussion, I'm using it for ease of understanding) and dating white guys in the past, I've noticed that I used to slide more towards white guys. \n\nI've also observed this in other black women who have 'alternative interests' or less 'stereotypical' interests. 9/10 times I'm right when I assume they're dating a white guy.\n\nImportant: there's nothing wrong with dating out. After all, I want black women to go where they're admired and loved. And there is more to love than the colour of your skin. \n\nComing from a personal standpoint, I think I've slid towards white guys because I felt that they wouldn't judge me about my interests and seem to have an open mind (this is only because white people are not put in rigid boxes and stereotypes that they feel they need to be in order to feel included by their race) and my alternative interests aligned more with them. \n\nI was also judged quite harshly by a handful of black people around me for being different, which I think made me uncomfortable sharing myself intimately and being myself in a romantic relationship with a black guy. The thought scared me in fear of judgement and rejection but now I'm working on that trauma.\n\nA theory: I think this creates a weird cycle that we can't break. Because we unconsciously assume black partners won't accept us, Black men who are 'alt' date white women and black women who consider themselves 'alt' date white men (I don't know how it is in LGBT+ communities). So we never find and date each other, which makes me sad. \n\nWhy do we think this is? I hope that the newer generations will have an open mind and be more flexible in the boxes they put themselves in to help with this. \n\nHave you observed this? Am I just insane? If you consider yourself 'alt' have you observed this in yourself and why do you think this is?",
    "title": "Why do ''alt'' black women mostly white guys?",
    "subreddit": "blackladies",
    "timestamp": 1672768283,
    "score": 61,
    "keyword": "mixed race judge"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 71,
    "keyword": "mixed race judge"
  },
  {
    "text": "Dealing with with racial insecurity / hypervigilance 31M gay desi guy living in a progressive/liberal US city here. I have faced a lot of racism (ranging from overt to casual/microaggressions) in my life and it has caused me a lot of CPTSD and stress. This has lead me to being very hypervigilant and insecure about my race.\nI’m already doing therapy but thought might wanna ask here.\n\nMy insecurity is less about “I am ashamed to be brown” but more about “I wish I didn’t have to go deal with all the cultural stereotype baggage”. More examples of triggers include:\n\n- Everytime I am in diverse group of people, I automatically put myself in some sort of social hierarchy. E.g. if I meet a hot white guy, I’ll automatically assume they won’t be into me or that I’d be judged for my skin color\n\n- I watch a movie/TV show set in Europe or hear friends talking about how London/Barcelona is so beautiful and fun and instantly wonder why can’t people talk the same about India (versus the usual stereotypes of poverty, pollution, casteism. India is beautiful, it has some of the most stunning landscapes and historical sites in the world)\n\n- I meet a non-Indian person and they instantly tell me about how they have an Indian coworker who got an arranged marriage or an gay Indian friend who is married but closeted (I don’t make any assumptions when I meet a white person, for e.g. that they have 4 step parents or that their parents are racists)",
    "title": "Dealing with with racial insecurity / hypervigilance",
    "subreddit": "asianamerican",
    "timestamp": 1684296201,
    "score": 13,
    "keyword": "mixed race judge"
  },
  {
    "text": "Trans men reveal how toxic society is towards men--MANY sources included &#x200B;\n\nhttps://preview.redd.it/luajuj8w4e6b1.png?width=790&format=png&auto=webp&s=3ef59a9188afe3a26d6caaeb18858427c4666be6\n\nRecently I've been looking at the FtM trans community online, and it's just sad how accurate this meme is.\n\nThe FtM trans community is much smaller than the MtF community, but FtM experiences post-transition are very revealing.\n\nThis community is interesting because their complaints are not only about failing to pass as male, but also about trying to cope with passing as male. From what I've seen, this problem is especially common with those who have completed transitioning and are attracted to women.\n\nAnd once they start getting treated like men, they get a brutal reality check.\n\nMany times, they are people who believed in concepts such as unilateral patriarchy, oppression of women, and male privilege. In their minds, they were gonna lead privileged lives once they became men, but when they transitioned, they were like rabbits caught in headlights as reality hit them like a train. Real life was a 180 degree difference.\n\nThese people have been treated like women their entire lives, and had been led to believe the game was fully rigged against women.\n\nImagine you're playing a game against bots, but you don't realize it and think you're good at the game. Suddenly, you get thrown into a professional match.  \nFucking brutal man.\n\n&#x200B;\n\nhttps://preview.redd.it/i07fp8hx4e6b1.png?width=735&format=png&auto=webp&s=36369715accef2d9714fc6177e1d0e852f6f5ba9\n\nHe said \"like I died and came back as a ghost.\" It's like that movie where Bruce Willis is dead but doesn't realize he's a ghost, and no one can see him. It really nails the reality of being a sub5 male in the West. If you're not [talented](https://journals.sagepub.com/doi/abs/10.1177/0305735613482025), [rich](https://www.sciencedirect.com/science/article/abs/pii/S1090513808001177?via%3Dihub), or a [chad](https://faculty.wcas.northwestern.edu/eli-finkel/documents/EastwickFinkel2008_JPSP.pdf), [that is literally how life can be](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373).  \nTough scenes man, truly.\n\n\"...her reaction was something like disgust mixed with pity.\"\n\nWelcome to the fucking club brother. \"[Disgust mixed with pity](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\" Believe me, I know what it feels like. And now bro, you do too.\n\n\"I used to look in the mirror and envision myself as this confident, strong man...\"\n\nIn his mind, he was gonna transition and drink beer and watch football. He was gonna be like \"yo, bitches, yo, yo\" and life was gonna work out just like that.\n\nThat is how disconnected from reality some people are. They have to find the truth out the hard way.  \nJust because you'd been told about how the system was rigged against women, you thought you knew the ugly side of life.\n\nBut you don't man. You ain't about that life.\n\nThese people are so naive. They look at celebs like Elliot Page.\n\n\"Oh look, Elliot Page has a hot girlfriend.\"\n\nYou ain't Elliot Page. He rode his Stacy look in Hollywood for fucking two decades. And only after his looks faded, he decided to come out. In a sense, he played his cards right.\n\nHe could transition into whatever he wants. He has the status, fame, and money. He could transition into a frog tomorrow with some experimental DNA injection, and [he would still date whomever he wanted.](https://www.youtube.com/watch?v=ol3nAWRLIDA)\n\nYou cannot.\n\nYou literally turned yourself into an inkwell.\n\n&#x200B;\n\nhttps://preview.redd.it/4nxe5z7z4e6b1.png?width=707&format=png&auto=webp&s=4943719e08227f88f88bd92175d6352b9d3530c8\n\nRight off the bat: 5'3. At 5'3 [it's pretty much](https://www.researchgate.net/publication/236670565_The_height_of_choosiness_Mutual_mate_choice_for_stature_results_in_suboptimal_pair_formation_for_both_sexes) [over](https://incels.wiki/images/thumb/e/ea/Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png/800px-Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png?20190704023738), man.\n\n\"People who I barely just met will make rude comments or jokes about my size.\"\n\nThis is true. Happens all the time. Other men sometimes will try to throw you under the bus to make themselves look like an alpha, and then they'll play it off as a joke if you say anything back. [Social dominance games happen all the time](https://www.sciencedirect.com/science/article/abs/pii/S0191886913012245).\n\n\"...plenty of women will reject me just for my height...before I even get a chance to tell them I'm trans.\"\n\nPay attention to the word choice here. So it's okay if it happens to XY men because they're just g[enetic trash if they're 5'3](https://www.salon.com/2011/09/25/sex_cells_interview/), but because he's an XX man, he should get a pass for being 5'3?\n\nAre you really gonna feel any better if you get fake sympathy because you're trans? Personally, I'd rather get rejected for genuine reasons than get a pity pass.\n\n\"...when I try to be confident some people hate short guys with confidence...they see it as a person who doesn't know their rightful place.\"\n\nThis is so true. I love this part. [If you don't have the looks but have the confidence, it annoys people](https://gwern.net/doc/psychology/okcupid/weexperimentonhumanbeings.html). [They think you don't know their place](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116).\n\n\"You gotta be acting because there's no way someone with your looks can be confident.\"  \nIt just doesn't look natural. You'll be seen as someone who crosses the borders of natural hierarchy. [They will feel a subconscious hostility against you](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\n\n\"I don't even benefit from the privileges the average man gets.\"\n\nWait until he learns that [the only privilege average men have is that which they have over sub5 men](https://arxiv.org/pdf/1607.01952.pdf).  \nI love how he thinks that if he was 5'8, his aforementioned problems would just go away. In reality, he would likely end up just like the first poster, getting reactions of disgust mixed with pity.\n\n\"Even studies will show you how height really affects men, [they get paid less](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2709415/), [suicide rate goes up](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373), [more likely victims of crimes](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC32258/pdf/612.pdf), [seen as less attractive](https://www.independent.co.uk/life-style/love-sex/dating-app-tinder-bio-words-most-right-swipes-music-gym-6-foot-badoo-a8512541.html), and so on.\"\n\nWelcome to the ugly fucking reality.\n\n[As a woman, if you're tall, many men will see you as better genetic material for their offspring. If you're short, you'll be seen as more attractive.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9454610/) You really can't lose.\n\n[These days, even obese women are celebrated](https://www.instagram.com/plussizecafe/?hl=en). Meanwhile, being [just overweight as a man](https://royalsocietypublishing.org/doi/full/10.1098/rspb.2017.1819#d3e552) is a virtual death sentence for your dating life.\n\nAnd this isn't only about dating. It goes way beyond dating to life itself. That's the real privilege, [how you're treated by people](https://www.sciencedaily.com/releases/2005/04/050412213412.htm), [the connections you make](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116). It's about everything, man.\n\n&#x200B;\n\nhttps://preview.redd.it/geedhfu05e6b1.png?width=605&format=png&auto=webp&s=5d3562ddf94d42a605a6fcc8bff0f35d1fd27aac\n\n\"I'm a very quiet, thoughtful, and sort of emotionally sensitive trans guy...\"\n\nRight off the bat, if you're like that as a man, you will be seen as a meek bitchboy by even the most socially progressive women.\n\nBut never pay attention to what people say. Progressive women will say \"oh yeah man, crying and showing emotions doesn't make you less of a man, it doesn't make you weak, it actually makes you more of a man bro.\"\n\nBut trust and believe when I, a progressive myself in many regards, say this. [If you are emotionally vulnerable in their presence, their pussies will dry up harder than the fucking Serengeti](https://journals.sagepub.com/doi/abs/10.1177/0146167214543879). And once again, this person had to find it out the hard way.\n\n\"...if I stayed as a girl I wouldn't have to worry whether I did nothing because I would still be liked and appreciated.\"\n\nExactly. I like this one because it includes the social aspects of the difficulties that come with manhood rather than just difficulties in dating. The middle paragraphs are underrated, really. He's spot on.  \n[As a guy, if you're not talented or have a respectable career at a certain age, you're looked down upon by society](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10206369/).\n\nMeanwhile, if you're a woman, if you don't have career ambitions or aren't talented in some field, you won't get dissed by society. [If anything, men will see you as better wife material](https://link.springer.com/article/10.1007/s10645-022-09412-w).\n\nThis is what we mean by \"tutorial mode.\" Men these days are expected to have the full package: [looks](https://link.springer.com/article/10.1007/s40806-017-0092-x), [race](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4631383/), [height](https://www.sciencedirect.com/science/article/abs/pii/S0191886913000020), [money](https://www.sciencedirect.com/science/article/abs/pii/S109051381730315X), etc.\n\nThis is why many men are struggling today. Many women, on the other hand, have none of these expectations placed on them by society.\n\nAnd these FtM men were not aware of the biggest JBW they had: [just be a woman](https://www.tandfonline.com/doi/abs/10.1080/14792779543000002). They fell for the line that men have it easier.\n\nAnd when they transition, the reality hits them like a fucking train. All the social privileges they took for granted have suddenly vanished like smoke in the air. But since they've grown up as female-presenting, they haven't developed the necessary coping skills to deal with the difficulties that come with being a man.\n\nBeing a man in the West is a constant battlefield where you're competing with other men for resources and women.\n\nThis is why I always say obsession with self-improvement for the sake of getting puss is a form of female supremacy. All the redpill gurus and PUAs are telling you to have money, interesting hobbies, ambitious goals in life, a gymmaxxed body, turn yourself into Thanos and travel to Vormir to get the Soul Stone, but for what?\n\nThe average woman, [who is overweight](https://www.medicalnewstoday.com/articles/321003#:~:text=One%20of%20the%20commonly%20used,the%20category%20of%20%E2%80%9C%20overweight%20.%E2%80%9D) and [much more prone to crying than the average man](https://journals.sagepub.com/doi/10.1177/1069397111404519).\n\n\"I want my man to be accomplished and have ambitious life goals?\"\n\nBut what have you accomplished? Do you own a startup and employ people? [You got a liberal arts degree](https://www.amacad.org/humanities-indicators/higher-education/gender-distribution-bachelors-degrees-humanities), and [now you work in retail](https://www.census.gov/content/dam/Census/library/publications/2020/demo/acs-44.pdf).\n\nRedpill dating coaches telling you to improve to get women are the real simps.\n\nAnd the people in this post have not yet realized this. They're in for a wild ride, I can tell you that much.\n\nDon't be a free agent in life. Let the truth guide you.",
    "title": "Trans men reveal how toxic society is towards men--MANY sources included",
    "subreddit": "MensRights",
    "timestamp": 1686926079,
    "score": 1027,
    "keyword": "mixed race judge"
  },
  {
    "text": "I was falsely accused of SA and Assault a year ago. Last week I had my trial and walked out a free man. Posting from my main account because I don't care. I need to get this off my chest to atleast somebody.\n\nIn 2021 I began seeing a girl we will call Stacy. Everything was fine in our relationship, almost too good until an ex i had a bad break up with because I was an alcoholic at the time got involved and told her things I allegedly did to her. Stacy and i  talked it out and everything seemed fine. Fast forward to the next week, we just finished having sex and we begin play fighting. It devolved into us just slapping each other in the legs but what I didn't know at the time is that Elhers Danlos (sp?) would cause her to have a severe reaction days later In the form of bruises. Stacy told a few people including my ex that I \"did that\" to her even though it was 200 percent consensual and no ill will was intended. I even have a Screen cap of her saying \"it's okay babe we were just play fighting!\" After she sent me photos of her legs and insisted \"I like olay fighting with you\"  obviously her spelling mistake was meant to say \"play\".\n\nFast forward a few more weeks shes decides to go to bed early but says \"wake me up with your cock if you feel like it\" so after a few hours and a \"hell yeah brother\" had passed and i was ready to hit the hay i did exactly that. She was into it. I was into it. Once done we fell back asleep. She commemted it was exactly how she wanted to be woken up. She sent me several texts in the past too saying similar things. Thank god i saved them all. \n\nNow a few more weeks later, I pick her up from work and she straight up asked me if she could fuck her same sex friend. I was appalled and disgusted and felt like our relationship meant nothing  to her anymore. This is where our relationship became toxic and she turned me into an angry jealous monster and for some reason wondered why I didn't like her friend very much. \n\nNow for the juice. \nIn early 2022 we were off and on again every other week it seemed and the thought of her with someone else drove me crazy. I went off my meds (gabapentin, clonzepham, latuda, mitazipine, Vyvanse) and spent days wide awake, got fired from my job and was at my wits end. I then tried to end my own life after Stacy said in text she was gonna go \"spend the night with someone else\" while i was in the middle of a emotional meltdown. That someone else was her ex. I woke up in the hospital the next day hooked up to several machines and one hell of a sore throat from getting my stomach pumped. I spent a few days in the hospital while I'm sure she was having a great time with her ex.\n\nWe tried talking it out over the next few weeks but one morning I caught Stacy red handed talking to my ex about me. I immediately asked her what she was talking about and to show me. She said no and I told her to leave. She initially refused until i threatened to start tossing her property off my one story deck. She didnt take me seriously until i grabbed her bag and tossed into the snowbank below. I then grabbed several items incluiding a coffee cup, clothing and amything else that is hers including and unfortunately food. I was completely manic at the time and didn't have a single brain cell left. One of the items i tossed down was a container of yogurt which didnt directly hit her however the weak little plastic container immediately busted open on impact like a baby yogurt bomb and she got some on her jacket allegedly. \n\nFast forward a few days later and Stacy is STILL sending me mixed signals about our relationship and really playing with my love. Stacy  then filed a restraining order against me without notice. She continued the conversation with me 5 days after she got the order. It was valentines day so I gave her the ultimatum finally,  be with me or I'll be with someone else tonight. She called me briefly and she asked what i meant and i said exactly what i said. She told me to \"work on myself more and maybe\". I wasnt having any of that so i went out with a girl I had matched with on Tinder earlier that day to begin the getting over it part.\n\nTwo days later i hear a knock at my door.l I had 8 cops knock on my door and place me under arrest for assault causing bodily harm (the leg photos), harassment (calling and texting repeatedly), violating the restraining order that was in place(that I had no idea existed) I was brought to the police station first, I tried explaining my side of the story and even offered evidence in the form of the texts about the \"assault\" and give full detail, the police officer told me to \"shut the fuck up woman beater\" the cop and I then got into a childish back and forth before finally I was brought to the station. I maintained my right to remain silent once at the station, called a lawyer from the telephone book then transported to another area. As it was winter I wearing a winter jacket. I took my jacket off and stuck the sleeve through the top of door then then around the corner of the door, tied both arms together to make as effective of as noose as possible because I was tapping out. I didn't belong there. Obviously this got caught on camera and my cell got rushed by officers who used what I believe to be excessive force by slamming neck first into the bench behind me not only causing me to hit my head really hard but also could've obliterated my neck. Luckily for me I guess I've drank my milk.\n\nI get held overnight for my court appearance in the AM and get 1000 no cash bond (meaning I don't pay it unless I fuck up again). I'm then under the impression I'll be good to go home soon. Nope. Apparently after I left the judge didn't realize I violated a restraining order and sent me to jail for 4 of the longest days of my life. In a suicide blanket. Locked up. Did nothing wrong. My 4 days in jail could be a whole other post but anyway, I got out.\n\nI go down the straight and narrow and keep my nose clean and that's when Stacy contacts me. St Paddy's day. She got drunk, called me, offered to uber to see me and she did. It was a dumb call on my end but i just missed her and loved her so much at the time. She comes over at like 5am and she immediately \"lets just pretend its like old times\" and we did for 2 days when she stayed with me. She told me she told police what she did because she just wanted a break and \"didnt think theyd take it this seriously\" . When it was time for her to go she said \"call me later, love you\" and I left back home. Couple hours later I get a knock on my door from police again. Apparently she ratted herself out to police prompting a warning. It was clear to me she was as good for me as Flint water and that was the last time we spoke. \n\nAt my first court appearance a week or two later I was tapped on the shoulder by a detective and asked to speak with me outside. He identified himself and told me he's working with Stacy and that I should be \"hearing from him soon\", knows we've seen/spoken with each other and he expects \"more charges\".\nHe calls me a couple days later and schedules a day for an \"intervirew\". My lawyer told me he would likely be arresting me for something else but i had no fucking clue what. But he told me to keep my composure and most importantly, Shut. Up. I go for the interview and you guessed it. I'm immediately placed under arrest. I wasnt handcuffed or anything but thats when he told me im being placed under arrest for SA and another assault. Contrary to my lawyers advice I fucking lose it on the cop and tell him the story and facts, again offer to show him texts, screenshots etc. He doesnt care. When he alluded to the second assault charge I kept my mouth shut as I had no idea what he was talking about. He kept trying to pry at me and finally he asked \"did you throw yogurt at her?\". I laughed and said \"ok I think I'm done answering questions and I will wait for disclosure from my lawyer\". The cop got curt and ended the interview and I was free to go. \n\nI then had to sit and wait for a year and a half for my court date. In that time Stacy took to social media to \"cancel me\", claiming I'm a \"violent person with violent tendencies\" or something to that effect, posting photos of me along with my full name and left me a loner for the last 8 months because everyone I know hates me over her social media post which garnered alot of attention because I had ALOT of friends, especially in the local music scene and hospitality industry. I became withdrawn from society, I thankfully acquired a girlfriend prior to the grand cancelation whom I'm still with and supported me through it all as best she could. Unfortunately the idea of hitting Stacy with a cease and desist didn't happen until the post was already screen capped and shared among other people. She complied but it had gotten out of control by the time i got my lawyer on it. I was being publically shamed because someone got yogurt on their jacket In an unideal situation for both parties. I almost died and she got to go fuck her ex over it. \n\nSeems fair. \n\nAbout a month ago my lawyer gave me two options go to trial (20K  including the fees I've already paid him) or B) I plead guilty to one count of assault (the fucking yogurt) It took me a few days but I decided to opt for the latter only because I know our justice system is fucked and fighting ALL charges VS Taking the hit on one and getting discharged from my record after 2 years would is a MUCH safer bet. So I did exactly that. Unfortunately I have to report to a probation officer once a month now but other than that I am finally free of her and the pain she has caused me. \n\nThis week I've decided I'm going to be happy. I bought lots of music recording equipment. Some games I've been dying to play. I don't know if I should publically address my friends on my currently deactivated social media accounts explaining my side of the story. I went to the grocery store without a facemask, tattoos out and hatless and it felt liberating. Like I was finally back in control of my life. \n\nAnd this my friends is why you never stick your dick in crazy. Thanks for reading if you did.",
    "title": "I was falsely accused of SA and Assault a year ago. Last week I had my trial and walked out a free man.",
    "subreddit": "MensRights",
    "timestamp": 1687223459,
    "score": 888,
    "keyword": "mixed race judge"
  },
  {
    "text": "Older women dating younger men is not as stigmatized as men dating younger women, study shows [https://link.springer.com/content/pdf/10.1007/s12144-018-9895-6.pdf](https://link.springer.com/content/pdf/10.1007/s12144-018-9895-6.pdf)\n\nAge-gap relationships were harshly judged by people and seen as inequitable. They believed that the older person would receive more benefits at the expense of the younger person. Nonetheless, the participants rated the older man dating the younger woman more harshly than the older woman and younger man. Both however, were rated much more harshly compared to age similar couples. There were 99 participants ages 19 to 63 years old (mean age=29.49, SD=7.23) (62 men, 35 women, and 2 people who did not pick a gender) recruited from Amazon's MTurk.\n\n>As seen in Fig. 1, people expressed greater prejudice towards young men’s relationships when they partnered with older (M = 55.45, SD = 32.60), rather than younger women (M = 81.95, SD = 20.17), t(97) = −7.45, p < .001, d = .97.1 Similarly, people expressed greater prejudice towards older men’s relationships when they partnered with younger (M = 50.70, SD = 33.04), rather than older women (M = 80.08, SD = 22.45), t(97) = −8.34, p < .001, d = 1.04. Planned contrasts revealed that, in general, age-gap couples (M = 52.84, SD = 31.36) were liked significantly less than age-matched couples (M = 80.70, SD = 19.19), t(97) = −8.61, p < .001, d = 1.07.\n\nOlder men dating younger women were rated 50.7 (SD=33.04) but older women dating younger men were rated 55.45 (SD=32.6).\n\nhttps://preview.redd.it/ac0s5osnk6ha1.png?width=1176&format=png&auto=webp&s=29cbd9bfedb49f963d521be74be88f42b9562b4e\n\nThen participants rated how they perceived inequity in relationships based on age-gender dynamics. \"Participants inferred the extent to which each relationship was inequitable using a 7- point scale, ranging from 1 (He is getting a much better deal than she is) to 7 (She is getting a much better deal than he is). The midpoint of the scale was labeled 4 (They are both getting the same, equal deal).\" They found that the more a person perceived inequity in an age gap relationship, the more harshly they judged an age gap relationship, but the more they perceived inequity in an age-match relationship did *not* increase their negative perception of an age-match relationship. Still though they perceived more inequity with men dating younger women rather than older women dating younger men.\n\nhttps://preview.redd.it/f6vwh0zbl6ha1.png?width=1124&format=png&auto=webp&s=f72433805bb754afbd0c5d7e6509eb96fd4ce67d\n\nAnd age gap couples were judged much more harshly than mixed-socioeconomic status couples (i.e.: rich dates poor), mixed-weight (i.e.: fat person and thin person together) couples and interracial couples.  \n\n\nhttps://preview.redd.it/9wj1pm5al6ha1.png?width=1087&format=png&auto=webp&s=e0ae404f49bee024d2ff399b8f3202a1c5ff014f\n\nSome older studies do show that women dating younger men is judged more harshly, but those were studies back in the day. It seems the double standard has switched. Men dating younger women is more taboo now, and cougars are more normalized now, probably due to the MILF porn category, which was set off by *American Pie*.",
    "title": "Older women dating younger men is not as stigmatized as men dating younger women, study shows",
    "subreddit": "MensRights",
    "timestamp": 1675956472,
    "score": 371,
    "keyword": "mixed race judge"
  },
  {
    "text": "Many studies show black men face more discrimination than black women. Here is the evidence: Intersectional feminists often argue that black women have it the worst, and they suffer worse than black men because they're black and a woman. Well guess what? There's lots of evidence that shows black men face more discrimination than black women.\n\nThis [article](https://theconversation.com/black-men-face-high-discrimination-and-depression-even-as-their-education-and-incomes-rise-141027) by *The Conversation* elaborates on what black men deal with. According to study 1, black boys from the wealthiest families were the most depressed. Study 2 found that for black men, the highest education credentials were associated with an increase, not decrease, in depressive symptoms. Study 3 found that in a nationally representative sample of American adults, black men with the highest income had the highest risk of depression, specifically major depressive disorder. Interpersonal or one-on-one discrimination was not found to be a factor. Study 4 found that 700 black teenagers were followed for two decades in Flint, Michigan. Perceived racial discrimination was measured in 1999 and 2002. Discrimination as teens was a predictor of depressive symptoms in people transitioned to young adulthood a decade later. Nonetheless, this was only true for black men, but not black women. In that same study in Flint, an increase in perceived neighborhood fear, defined as being scared of the crime and violence in the neighborhood, was linked with an increase in depressive symptoms for black men, but not black women. Study 6 found on IAT tests that white men had higher racist attitudes towards black people than white women, but the difference wasn't particularly extreme, but statistically significant. Nonetheless, white women also can be really racist towards black people, too.\n\nBlack men also get arrested, incarcerated and stopped or profiled far more than black women. Even white men experience being arrested and incarcerated far more than black women. And the reason why most prisoners are men isn't simply because men commit crime more. [A significant minority of criminals are women](https://www.reddit.com/r/MensRights/comments/xyl5wb/statistics_cited_women_are_more_likely_to_commit/), but female criminals are severely underreported, get arrested less when reported, are less likely to be incarcerated when convicted, are paroled earlier, and given more lenient sentences compared to men. Additionally, black men are far more likely than anyone else to be killed by police. [In fact](https://www.bloomberg.com/news/articles/2019-08-06/race-and-police-shootings-what-new-research-says), white and Asian men were much more likely than even black or Native American women to be killed by police. Almost all police homicide victims were men! [Black men were also much more likely than anyone, even black women, to be murdered in general](https://www.niussp.org/health-and-mortality/americas-high-homicide-rate/?print=print). [Black men are also more likely than black women to be victims of crime in general](https://bjs.ojp.gov/content/pub/pdf/bvvc.pdf). [Black men also were](https://www.pewresearch.org/short-reads/2019/05/02/for-black-americans-experiences-of-racial-discrimination-vary-by-education-level-gender/) more likely to be subject to racial slurs/jokes, be unfairly stopped by a police officer, have people act suspicious towards them, been assumed to be prejudiced, or to have feared for their personal safety. In fact, 59% of black men had been unfairly stopped by police, compared to just 31% of black women.\n\nAnother study called \"[Gender Matters Too](https://psycnet.apa.org/buy/2008-05171-002)\" found black men and women in 11th grade classrooms differed in their perception of peer and classroom discrimination. For boys, discrimination harmed their grades, attitudes and their regard for the importance of school. For girls, however, the effects generally had a positive impact. Another [study](https://psycnet.apa.org/doiLanding?doi=10.1037%2Fpspa0000288) found that the real root of racism towards blacks was perceived threat, not dislike, and that people were racist toward black people not due to negativity towards them but feeling threatened by them, especially black men. When isolating negativity from threat, they found no automatic black-negativity link. Negativity towards blacks was associated with viewing them as a threat. [In fact](https://polisci.osu.edu/sites/polisci.osu.edu/files/mcconnaughy_white.pdf), another study found that people viewed black men as particularly violent, and viewed white men as more violent than black women. They ascribed a low amount of violent personalities to black women and an especially low amount of it to white women. They viewed black men as more promiscuous than white men, white men as more promiscuous than black women, white women slightly more promiscuous than black women! They viewed black men as less intelligent than black women, and viewed black men as less ambitious than black women. Fast responders gave unpleasant responses to black men far more than to black women. All responders gave black men the most unpleasant responses compared to black women and white men and women, and black women slightly less unpleasant responses compared to both white men and white women! Another [study](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.848.1523&rep=rep1&type=pdf) found that even both male and female participants were equally likely as each other to be more willing to shoot a black unarmed suspect than a white female armed suspect or black female armed suspect. Men and women equally were likely (when not even looking at race) to prefer shooting unarmed male suspects over armed female suspects. An implicit racial bias [study](https://journals.sagepub.com/doi/epub/10.1177/0146167219829182) found that black women were seen as more dangerous than white women by participants of all races, but they still viewed black men as more dangerous than black women. Even when looking at black children, they viewed black boys as more dangerous than black girls.\n\n**Black men had it worse during slavery**\n\nThis thread I made a year ago talks about how there were more male than female black people enslaved in the United States, and the black women were more likely to be free. In 19th century United States, [more men than women were slaves and more women than men were freed slaves](https://www.statista.com/statistics/1010277/black-and-slave-population-us-by-gender/). Although there was always a difference, the difference increased in the Civil War because of all the black male soldiers who died, and women weren't sent off to war as soldiers.\n\nThis only looks at the ones in the US. Believe it or not, the vast majority of enslaved black people were sent to places like South America or the Caribbeans, and a minuscule percentage were in the US. [When looking at all the enslaved black people from the 17th to 19th century](https://www.statista.com/statistics/1183869/ratio-male-female-slaves-by-route-1636-1867/), they found that in any region, men outnumbered women, with the gap being quite large in most regions. Many historians think all slave owners were white men, but evidence found that 40% were white women. They were often cruel and violent just like male slave owners. In fact, George Washington's wife owned way more enslaved people than him. White women were trained to enslave black people from a very young age, and they even were often given slaves as early as 9 months old! [According to](https://www.history.com/news/white-women-slaveowners-they-were-her-property) History.com:\n\n>White women were active and violent participants in the slave market. They bought, sold, managed and sought the return of enslaved people, in whom they had a vested economic interest. Owning a large number of enslaved people made a woman a better marriage prospect. Once married, white women fought in courts to preserve their legal ownership over enslaved people (as opposed to their husband’s ownership), and often won. “For them, slavery was their freedom,” Jones-Rogers observes in her book.\n\n**Black men were raped, too.**\n\nWe often hear about female slaves being raped, and how it was legal to rape black women. [What we don't hear about is how often black men were raped by slave owners](https://muse.jhu.edu/article/448992/pdf). [They often were](https://shareok.org/handle/11244.46/1279). They also were stripped naked and white people laughed at their genitals (i.e.: body shaming of men for their penis size even though they have no control or choice of their penis size). According to the [AAIHS](https://www.aaihs.org/sexual-violence-against-enslaved-men/),\n\n>Foster begins *Rethinking Rufus* by examining how enslaved men’s bodies were depicted in Western art and sculptures that were widespread in the visual culture of slavery. Foster argues that enslaved men’s bodies were “symbols of enslaved manhood and sites of violation” that were objectified through a number of cultural forms including art and literature (12). The objectification of enslaved men depicted in paintings often resembled everyday acts of terror including the public inspection of Black men’s genitals, whippings and lashings, and bodily exposure due to lack of adequate clothing. Visual depictions of enslaved men that emphasized their genitalia and sexual prowess gave way to the prevailing myths of Black hypersexuality and the Black male rapist, an archetype that ensured the extralegal protection of white women from Black men who purportedly lacked control over their sexual urges. Foster also argues that while visual depictions of enslaved men’s bodies often highlighted their athleticism, strength, and muscularity, this same imagery eroticized enslaved men’s bodies in ways that fueled the physical abuses and sexual exploitation of enslaved men. Foster notes that these stereotypes found in eighteenth-century visual art contributed to the eventual punishment and national disenfranchisement of Black men.\n\n**White women also raped or sexually preyed on black men, too.**\n\n[White women also had sexually abused black men, too](http://www.inquiriesjournal.com/articles/1674/sexual-relations-between-elite-white-women-and-enslaved-men-in-the-antebellum-south-a-socio-historical-analysis). White women were authority figures or in a position of power over these black men, and white women had sex with black men, often even raping them forcibly. White women also threatened to falsely accuse black men of rape if black men didn't have sex with them. Because abortion was unregulated, and any woman was able to get an abortion back then, many white women used this advantage to sexually abuse black men without people knowing she fornicated out of wedlock, and was able to abortion \"illegitimate\" children, hiding the evidence that she sexually abused black men. As a result of this and the fact that men could not speak about being raped because people believe men cannot be raped, historical records of white women raping black men are often overlooked, and it could've been more common than we think, perhaps as common as white men raping enslaved black women.\n\n**Almost all lynching victims were men whereas a significant minority of victims were white.**\n\n[Another interesting fact](https://www.newspapers.com/clip/5803482/lynching-nj-1901/): virtually all lynching victims were men. Of all the 2,516 lynchings that happened from 1885 to 1901 in the US, 82.67% happened in the South and 13.75% happened in the North. 66.69% were black and 31.84% were white. 97.97% were men and 2.03% were women. Just 51 women lynched compared to 2,465 men. We always hear about how most victims were black, but no information about how virtually all were men. White men got lynched far more than black women. Black women rarely were lynched, and almost no white women got lynched.\n\n**Black people also face discrimination when it comes to rape.**\n\nIt is true that people are less responsive to black women who got raped than white female rape victims, but if people knew how common it was for men to be raped, and women rape men as just as much as men rape women (cited in a thread I cited above about women being more likely to commit crime than people think), then I'm sure they'd respond less to black male rape victims than white male or black female rape victims. In fact, they'd probably care for black women who are raped than white men who raped. Black men also are viewed as hypersexual, promiscuous, unable to control sexual urges, and always wanting sexual intercourse.\n\nAlso, false accusations happen a lot more than feminists admit, and I cite evidence for it in this [thread](https://www.reddit.com/r/MensRights/comments/xzb7d8/statistics_show_that_false_accusations_are_quite/) of mine, and black men especially are affected. Black prisoners incarcerated for rape are especially likely to be innocent, especially when their accuser is a white woman. White women historically falsely accused black men of rape to get them lynched, and they still falsely accuse them, and while most rapists get away with it, black men who are accused by white women are more likely to be incarcerated even if they're innocent. It was considered rape historically for black men to have consensual sexual intercourse with white women, and there was a double standard for a while where people judged black men marrying white women more harshly than white men marrying black women because black men were viewed as predatory.\n\n**Education/life expectancy**\n\nBlack women also have a higher life expectancy than white men and especially black men, and are less likely to go to college than white men but [go more than black men](https://www.brookings.edu/articles/black-women-are-earning-more-college-degrees-but-that-alone-wont-close-race-gaps/).\n\n**Feminists don't care about black people, not even black women.**\n\nFeminists often don't pay attention much to black women's struggles. Even first wave feminists disregarded them and didn't want them to vote, let alone allow black men to vote, and that motivated them and was a reason why they wanted to vote, because they worried black men were technically allowed to vote despite Jim Crow laws and didn't want them to have the complete ability to vote before white women.\n\nNonetheless, many stereotypes feminists make about men are especially applied to black men due to society historically portraying them as hypermasculine, hypersexual and prone to violence or crime. Feminists' portrayal of men harms black men especially. They also ignore false rape accusations despite that white women still, to this day, falsely accuse black men of rape which is why so many black prisoners are falsely incarcerated for rape, and yet feminists expect every reported person for rape to be imprisoned. They also widely ignore how black women are associated more with the term black than with women, and aren't viewed as normal women.\n\nThis is why womanism (black feminism) was started.\n\n**Conclusion**\n\nDoes anyone notice how people hate black men more than black women? Yeah black women face pregnancy discrimination with prenatal care and dealing with more abortions and unwanted pregnancies, but black men usually don't ever get to see their kids, and often cannot afford to pay child support. Many black children are raised by single moms and barely knew their dad, if at all.\n\nThe reason black men face more discrimination than black women is due to people's racism towards black people being associated with seeing them as a threat, not dislike, and being a woman prevents black women from being seen as a threat as much as black men. Nonetheless, people might see black women as more dangerous than white women and be racist towards them due to a guilt by association mindset. In spite of that, people still are more racist towards black men because when racial attitudes are mostly about feeling threatened, people tend to view women in general as harmless, which is different from how they view men in general.",
    "title": "Many studies show black men face more discrimination than black women. Here is the evidence:",
    "subreddit": "MensRights",
    "timestamp": 1699982481,
    "score": 198,
    "keyword": "mixed race judge"
  },
  {
    "text": "What's going on with the recent rise in \"The Future is female\"/\"Men are obselete\" rhetoric? Note: TLDR included at end.\n\n\"The future is female\" is a quote that is most often attributed to – or at least known to be popularized by – Sally Miller Gearhart, who wrote a 1970's essay entitled: \"The Future – If There Is One – is Female\". In it, she mandated that: \"The proportion of men must be reduced to and maintained at approximately 10% of the human race.\" To understand all the recent activity around this man-hating quote, I will first argue that this saying's obviously immoral and genocidal origins are actually why it has continued to be so popular, and why it – and the hateful message it spread – is resurfacing with such a vengeance in recent times.\n\nGazing for a moment into the world of online dating, [studies](https://www.reddit.com/r/MensRights/comments/81d22x/men_youre_ugly_women_80_percent_of_men_are_below/) have shown that 80+% of male profiles are judged to be \"below average\", and only around 10% or fewer of men are considered worth actively pursuing by the opposite sex. Now, I've always found this particular numeric parallel with Gearhart's \"only 10% of men can live\" decree to be fascinating. When you really stop to think about it, these amount to exactly the same thing. The idea that only the top 10% of men are worthy of access to reproduction through dating and sexual engagement is basically just a different formulation of Gearhart's genocidal ramblings. It's less overt of course, and seemingly more natural in its \"women just have high mating standards\" foundation, but the end result is the same. If reality ever reflects this morbid vision of sexual selection, only 10% of men will indeed survive to have their genes move into the future. \"The future is female\" ultimately is just the popular apex fallacy writ large, albeit in a much more bloody and glaring fashion, which I think is why it has continued to hold such sway in the discourse. It really does encapsulate the twisted, dystopian setting that far too many hold as our species' ideal future.\n\nWith that established, let's take a step back for a moment and consider the very uncertain future that we all do face. Because there certainly is a lot to be worried about across the board: a growing population combined with finite essential resources like fresh water, the threat of viral pandemics, climate change, the energy crisis, AI and other dangerous technological advances, hyperinflation and the threat of an extended economic depression, rising tensions leading to world wars (nuclear) and/or civil wars, the opioid crisis, etc. We are all remarkably aware of the many exigent threats to our survival as a civilization, or even as a species, and so I would argue that it's become easy for narratives like \"Men are obsolete!\" to feed on that invisible fear. Despite their false premise, we still feel that growing uncertainty around us, though we don't always recognize the true source of it. Thus it becomes possible to manipulate people's emotions to inflate the importance of what is a relatively minor concern about men becoming useless. And I say \"minor\" in the most kind manner, because there is a single future change that will be disruptive unlike anything else we have seen previously. This is a development that has the potential to cause massive upheaval, with secondary and tertiary effects that are impossible to predict.\n\nThat looming technological disruption? The artificial womb.\n\nAnd this will be the one case where \"Women most affected\" absolutely applies.\n\nNow to be fair, technological and social changes have had a fairly large impact on men, with automation and mechanization lowering the value of physical work, policing and the invention of small firearms allowing everyone to offload the job of protection and safety to a specialized few, taxation and distribution of wealth creating incentives for women to form single-parent families, and more. Stardusk (Thinking Ape) has a [great video talking about his \"Theory of Inverse Utility\"](https://youtu.be/FaWQ01B-ztg), which dives into these ideas, and explores some of the unforeseen consequences of what – on the surface – appear to be fairly simple changes in society, but turn out to be much more impactful. Seriously, I can't recommend his video strongly enough. It's that good.\n\nThe interesting observation about many of the automation and mechanization changes is that it is **almost entirely men** who are making this advancement possible, because they are the ones who design, build, repair, operate, etc, all the equipment that does the work of hundreds of manual labourers. So opportunities have arisen to replace what is lost in many cases. It is not all roses and unicorns, of course, because efficiency increases also create a much more competitive environment, so many are left without a clear path to cultural \"success\" in the wake of our progress. Still, it's important to realize that oftentimes we are not given a \"solution\", just a \"tradeoff\", and men simply have to learn new skills to take advantage of a different world.\n\nHowever, given the advent of the artificial womb, those that it replaces will *not* be the ones who gain opportunities from its creation. For the most part, the ones who create, maintain, and use it to gain uncontrolled access to the means to reproduction, will be men. I don't think it can be understated how much of a sea change this will be to the entire fabric of society. Honestly, if I were the one staring down this kind of redundancy/obsolescence, loss of control, and complete destruction of my identity, I'd be panicking too.\n\nUltimately, when considering our unclear future as a society, I would argue that it is **men** who are much better situated to navigate, adapt to, and even embrace the forthcoming technological and social changes in the modern era, as opposed to the opposite sex, who are facing *major* headwinds as artificial reproduction takes over from biological procreation in the near future. So my advice to any guy reading this is: don't mistake your worry over general threats that society is facing as anything more than that. No matter how things turn out, men as a group are going to have a much easier path to tread in the years to come, at least compared to our counterparts.\n\nTLDR - the \"future is female\" rhetoric is becoming louder right now because the invisible 90% of men who are beneath society's notice are slowly becoming a potential threat in the minds of many. That imagined danger, combined with a looming disruptive technology in the form of the artificial womb, is leading many \"birthing persons\" (LOL) to question whether their own obsolescence is fast approaching. This recent focus on the perceived uselessness of men is just a distraction to forget about their own sense of existential dread/loss of purpose, and nothing more. It's a bit like a car racing towards a cliff. There's certainly a lot of yelling as the precipice appears on the horizon, but the screaming always gets the loudest right when the edge is crested and the plummet is certain. After that it's just a question of how far it is to the bottom.",
    "title": "What's going on with the recent rise in \"The Future is female\"/\"Men are obselete\" rhetoric?",
    "subreddit": "MensRights",
    "timestamp": 1678111463,
    "score": 107,
    "keyword": "mixed race judge"
  },
  {
    "text": "Sentencing gender gap in France - men receive harsher punishments for equal crimes, but female judges are less biased than male judges Philippe, A. (2020). Gender disparities in sentencing.\n\n[https://research-information.bris.ac.uk/ws/portalfiles/portal/209890205/Gender\\_gap.pdf](https://research-information.bris.ac.uk/ws/portalfiles/portal/209890205/Gender_gap.pdf)\n\n&#x200B;\n\n>women represented 18% of defendants, but only 10.5% were taken to court, where they were more frequently discharged (6% vs. 4%, Büsch, Timbart, 2017). In that year, 8.5% of convicted women were sentenced to prison, compared to 19.9% of convicted men.\n\n&#x200B;\n\n>after controlling for very precise descriptions of the offenses as well as other observable characteristics, women received prison sentences that were 15 days shorter, on average, than those of men who committed comparable offenses. This represents a 33% decrease relative to the average prison length in the sample (45 days in the entire sample). Second, this gender gap is also observed for mixed-gender pairs of criminals (one man and one woman) who are convicted together, on the same day, by the same person and for the same crime.\n\n&#x200B;\n\n>From a procedural point of view, women are judged after longer investigations, and are rarely sentenced after an accelerated procedure \\[...\\] Taking crime types into account reduces the difference in investigation length from 120 days to 30 (not shown). By contrast, the difference in accelerated procedure rates between men and women remains high after controlling for crime (-3.4% reduced to -2.5%).\n\n&#x200B;\n\n>**The gender gap decreases with the share of female judges** in the court: prison and probation sentences are harsher for women, while suspended prison sentences are shorter (Table 4). Fines are unaffected. An increase of one standard deviation in the share of female judges decreases the gender gap by 1.5 prison days (around 10% of the gender gap). This is because women, while not inherently harsher, tend to be harsher on other women. The gender of the prosecutors does not seem to affect differences in either sentences or pre-trial decisions\n\n&#x200B;",
    "title": "Sentencing gender gap in France - men receive harsher punishments for equal crimes, but female judges are less biased than male judges",
    "subreddit": "MensRights",
    "timestamp": 1692783096,
    "score": 105,
    "keyword": "mixed race judge"
  },
  {
    "text": "In Canada, a dad wrote about having evidence of being a victim of domestic violence and his girlfriend being abusive towards their baby, yet he is being criminalized as an abuser based on her false claims In Canada, a dad wrote about having evidence of being a victim of domestic violence and his girlfriend being abusive towards their baby, yet he is being criminalized as an abuser based on her false claims\n\nHere is my reply in the hopes that it helps to protect child abuse victims and helps to assist domestic violence victims who face discrimination and who wish to seek justice:\n\nI'm not an attorney and this is not legal advice.\n\nIn Canada, you wrote about having evidence of being a victim of domestic violence and your girlfriend being abusive towards your baby, yet being criminalized as an abuser based on her false claims.\n\nFalse allegations of this nature are:\n\n> Misleading Justice\n> Marginal note:Perjury\n\n> 131 (1) Subject to subsection (3), every one commits perjury who, with intent to mislead, makes before a person who is authorized by law to permit it to be made before him a false statement under oath or solemn affirmation, by affidavit, solemn declaration or deposition or orally, knowing that the statement is false.\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/page-32.html\n\nGovernment officials who knowingly participate or who are willfully ignorant of these crimes may be defrauding victims:\n\n> 380 (1) Every one who, by deceit, falsehood or other fraudulent means, whether or not it is a false pretence within the meaning of this Act, defrauds the public or any person, whether ascertained or not, of any property, money or valuable security or any service,\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/section-380.html\n\nEvery person is equal and deserves justice:\n\n> 15. (1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. (2) Subsection (1) does not preclude any law, program or activity that has as its object the amelioration of conditions of disadvantaged individuals or groups including those that are disadvantaged because of race, national or ethnic origin, colour, religion, sex, age or mental or physical disability.\n\n> https://en.wikipedia.org/wiki/Section_15_of_the_Canadian_Charter_of_Rights_and_Freedoms\n\nI would consider if mom's actions create a need to petition the court to change the child custody arrangement:\n\n> 1. Figure out if there has been a significant change\nLook to see if you or your partner's situation has changed.\n\n> If you have to go to court, the court will only make an order changing your decision-making responsibility and parenting time arrangement if there has been a significant change.\n\n> Decision-making responsibility and parenting time used to be called custody and access.\n\n> The conflict between the parents has got worse over time.\nThe parent with decision-making responsibility is always making it difficult for the parent with parenting time to spend time with the child.\n\n> https://stepstojustice.ca/steps/family-law/1-figure-out-if-there-has-been-significant-change-5\n\nConsider a CCLA complaint about police misconduct towards you as a domestic violence victim as well as your child as a victim of child abuse:\n\n> Fighting for reasonable limits to police powers, and accountability for abuse.\n\n> https://ccla.org/our-work/criminal-justice/police-powers-accountability/\n\n> In addition, in Canada – as in the United States and the United Kingdom – a judge is subject to disqualification for an “appearance of bias.” However, in a 2003 case, Wewaykum Indian Band v. Canada, 2 S.C.R. 259, 2003 SCC 45, Canada’s Supreme Court articulated the proper test for disqualification for appearances somewhat differently than any American court ever has when it asked: “What would an informed person, viewing the matter realistically and practically – and having thought the matter through – conclude? Would this person think it more likely than not that the judge, whether consciously or unconsciously, would not decide fairly?” The Court added that “[w]hether there is a reasonable apprehension of bias is to be assessed from the point of view of a reasonable, fair minded and informed person.” Id. At 74.\n\n> https://www.judicialrecusal.com/recusal-disqualification-canada/\n\nIf the judge in my case is signing orders harming my child and is intentionally refusing to examine evidence of my child's abuse, mom's domestic violence, and is through their refusal to respect my and my child's charter rights to equal treatment, and is therefore endangering the welfare of my child as well as myself, I would consider a judicial complaint. Each province is different. Here is information for Ontario:\n\n> Making a Complaint\n\n> If you have a complaint of misconduct about a provincial judge or a justice of the peace, you must state your complaint in a signed letter. The letter of complaint should include the date, time and place of the court hearing and as much detail as possible about why you feel there was misconduct. If your complaint involves an incident outside the courtroom, please provide as much information as you can, in writing, about what you feel was misconduct on the part of the judge or justice of the peace.\n\n> You do not need a lawyer to make a complaint and there is no fee. Please indicate in your letter if there is a specific title, pronoun or form of address you would like Council staff to use when communicating with you.\n\n> https://www.ontariocourts.ca/ocj/conduct/do-you-have-a-complaint/\n\nIf the prosecuting attorney is doing this same, or is using orders as a weapon to protect mom as a child abuser and as a domestic violence perp, including harassing me as a victim and tampering with evidence by purposefully refusing to review it:\n\nI would consider making a complaint about the attorney. Each province is different. Here is information for Ontario:\n\n> Steps to Make a Complaint about a Lawyer or Paralegal\n\n> https://lso.ca/protecting-the-public/complaints/how-to-make-a-complaint\n\nIf I felt the police were not protecting me, especially because of discrimination, I would consider contacting an attorney and contacting Canada Justice:\n\nContact the Minister\nEmail\nmcu@justice.gc.ca\n\nMailing address\nThe Honourable David Lametti\nMinister of Justice and Attorney General of Canada\n284 Wellington Street\nOttawa, Ontario K1A 0H8\n\nFax\n1-613-957-3559\n\nGiven that this seems to be a pattern or practice of potentially illegal discrimination based on sex, it may be the basis for a civil rights class action.\n\nClass action in Canada:\n\n> In Canada, a class action is a form of procedural collective relief brought under specialised class proceedings legislation whereby one or more claimants can seek collective relief for themselves and on behalf of individuals who have similar claims. In a certified class proceeding, a court can adjudicate \"common issues\" relating to class members in a single proceeding, whereby \"success for one is success for all\".\n\n> https://content.next.westlaw.com/practical-law/document/I99a83254410011e598dc8b09b4f043e0/Class-collective-actions-in-Canada-overview\n\nI wish you the best of luck in your search for justice.",
    "title": "In Canada, a dad wrote about having evidence of being a victim of domestic violence and his girlfriend being abusive towards their baby, yet he is being criminalized as an abuser based on her false claims",
    "subreddit": "MensRights",
    "timestamp": 1689529581,
    "score": 99,
    "keyword": "mixed race judge"
  },
  {
    "text": "Your Anatomy is Your Destiny When I say \"a man's looks dictate every aspect of his life,\" people say \"oh, insecure people who worry about that stuff are so unhinged.\"\n\nI want to draw your attention to an [article](https://www.econjobrumors.com/topic/effects-of-beauty-found-to-run-surprisingly-deep-nyt) in the New York Times written all the way back in 1981.\n\nThis is interesting because it's an old article from 40 years ago that has a lot of insight into the problems men face today. This was written by a female university professor.\n\nWhen I hear people say \"oh, you're just an inkwell dude,\" I have to ask: is she an inkwell as well? Are you gonna call her one too?\n\nThe article reads:\n\n\"Minneapolis studies of physical attractiveness show that people do, in fact, judge a book by its cover, often with dramatic effects on those being judged. The findings suggest that expectations based on physical attractiveness can become self-fulfilling prophecies that may strongly influence the course of a person's life.\"\n\nPrecisely. You might even say \"[determine](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0063975) the course of a person's life.\"\n\nMost people are usually only concerned about how they're perceived by the opposite sex, but your [looks dictate other aspects of your life as well](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4757567/).\n\nWhen you say this out loud, [people don't like it](https://www.thestudentroom.co.uk/showthread.php?t=7290948) because it goes against their core belief that [people are in charge of their futures](https://plato.stanford.edu/entries/freewill/).\n\nBut looks indeed do strongly influence the course of a person's life. [Looks often trigger a chain reaction.](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116) [One thing triggers another and leads to the ne](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4631383/)xt.\n\nLooks are really such a major determining factor of [every avenue of life.](https://link.springer.com/article/10.1007/s002650100370)\n\nI'm not saying you can't accomplish something great otherwise, but you'll have to be exceptionally talented and hardworking. [You'll have to work twice as hard to get the same chances and opportunities](https://humboldt-dspace.calstate.edu/bitstream/handle/2148/624/ThesisFinal.pdf).\n\n\"Dr. Berscheid said the importance of physical attractiveness is growing and will continue to grow as increases in geographic mobility, frequent job changes and divorce subject more people to 'onetime' or 'few-time' interactions with others, in which they are judged on the basis of first impressions.\"\n\n[What she said indeed came to pass](https://www.pnas.org/doi/abs/10.1073/pnas.1908630116), but I'm sure even she was surprised at the [magnitude of it](https://gwern.net/doc/psychology/okcupid/raceandattraction20092014.html).\n\n\"The psychologist, who has been studying the effects of physical attractiveness for the last 15 years, said the findings 'give new dimensions to Freud's statement that \"Anatomy is destiny.\"'\"\n\nThis was really insightful coming from her, considering that it's an article from 1981. She talked about these issues in the 60s, about the importance of looks, how it shapes other aspects of your life, how it'll be even more important in the future.\n\n[And she was proven right.](https://jeatdisord.biomedcentral.com/articles/10.1186/s40337-019-0244-4#Sec10)\n\n\"'Genetic determinism is anathema to Americans, who want to believe everyone is born equal, with an equal chance for a happy life,' Dr. Berscheid remarked in an interview here. 'It's simply not so. The most important factors governing success in life are genetically determined: appearance, intelligence, sex and height.' She cited a continuing study at the University of Minnesota of identical twins who had been reared apart. The study, she says, is showing that 'genetically identical children turn out to be very similar even though they grow up in very different environments.'\"\n\nShe almost nailed it. The idea of genetic determinism is indeed anathema to most people on earth, not only Americans. It's an uncomfortable idea. It challenges the validity of a lot of moral values and beliefs in society that comtemporary laws stand up on: [free will](https://plato.stanford.edu/entries/freewill/), [justice](https://www.ushistory.org/documents/pledge.htm#), [the belief that we're in charge of our lives and decisions](https://www.cambridge.org/core/journals/journal-of-the-american-philosophical-association/article/abs/kants-demonstration-of-free-will-or-how-to-do-things-with-concepts/31C9C11F6C0414B9C817A0580A416A05), [the idea that we are responsible for our fates](https://www.edcor.com/newsletter/jack-welch-on-pursuing-your-passion/), [the notion of objective right and wrong](https://www.cambridge.org/core/journals/journal-of-the-american-philosophical-association/article/abs/kants-demonstration-of-free-will-or-how-to-do-things-with-concepts/31C9C11F6C0414B9C817A0580A416A05), etc.\n\nThe idea of genetic determinism brings a lot of these ideas into question.\n\n[The most important factor is indeed looks](https://www.nytimes.com/2005/05/03/health/ugly-children-may-get-parental-short-shrift.html), first and foremost, which is genetics.\n\nThen, I'd say opportunities and environment, rather than sheer intelligence, are the next most important. I slightly disagree with her here. [Which country you were born in](https://data.who.int/countries/426), [your race](https://www.icpsr.umich.edu/web/ICPSR/studies/36347), [which family you were born into](https://bloustein.rutgers.edu/research-generational-wealth), all of which are determined by luck.\n\nNext in order, according to Berschied, is a person's sex. That is true, but it's the other way around. [It's girls who have a head start over boys](https://www.sciencedirect.com/science/article/abs/pii/S0191491X17302584).\n\nThen again, she was born in 1936, and she grew up in the 1940s and 1950s when [women didn't have de facto equality](https://apnews.com/article/50fb651b7fb84221887f8a7534a87fff), so I'm gonna give her a pass here.\n\n\"The preferential treatment of physically attractive people starts right after birth, Dr. Berscheid noted, and continues throughout childhood, adolescence and into adulthood. These are among the more telling research findings, all of which involved normal-looking people of varying degrees of attractiveness:\"\n\nKeep in mind that scientifically more airtight studies that came out in the last 40 years [not only confirm the aforementioned evidence](https://www.cell.com/current-biology/fulltext/S0960-9822(18)30766-8?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0960982218307668%3Fshowall%3Dtrue), but also show that looks are [even more important than previously thought](https://linkinghub.elsevier.com/retrieve/pii/S0092656621000131).\n\n[The rabbit hole goes even deeper](https://linkinghub.elsevier.com/retrieve/pii/S016363839890011X). A baby born yesterday knows it's over for you.\n\nThis is beyond brutal, man.\n\n\"As women become more independent socially and economically, Dr. Berscheid sees them placing a greater emphasis on the attractiveness of men, 'who are now in the \"meat market\" just like women have always been.' She cited the recent advent of male centerfolds and male nude dancers as examples of women's interests in how men look.\n\nAnother factor has been the importance women today place on love as a criterion for choosing a mate. In 1967 only 24 percent of women questioned said they would marry only if they were in love, but a decade later, 80 percent said 'being in love' was a necessary condition for marriage.\"\n\nShe really saw it coming considering that she was born in 1936 and grew up in the 1950s. But even she likely underestimated the [effects of looks](https://home.uchicago.edu/~hortacsu/onlinedating.pdf), [the invention of dating apps](https://onlinelibrary.wiley.com/doi/abs/10.1002/per.2087), and [more](https://www.pewresearch.org/wp-content/uploads/sites/3/2012/02/SDT-Intermarriage-II.pdf) in the new millennium.\n\n\"'When romantic love becomes an important factor in social choice, physical attractiveness becomes important also,' Dr. Berscheid told a symposium on the psychological aspects of facial form last year. The symposium brought together plastic surgeons, dentists and others who produce facial changes that often affect patients more powerfully than the functional defects they correct.\n\nSometimes patients react badly -'with pain and bewilderment' - to significant improvements in their appearance, Dr. Berscheid told the meeting at the University of Michigan. This reaction could result from the realization that **we are not just loved for ourselves but for what we look like**, she suggested.\"\n\nThis is a tough pill to swallow for a lot of people.\n\n\"Dr. Berscheid believes there is a hazard inherent in denying the impact of physical attractiveness: 'Unattractive children who are unpopular may wrongly attribute their lack of popularity to some flaw in their character or personality,' she says. Such an error, she believes, could result in lasting and painful scars.\"\n\n[Again, she nails it](https://ajp.psychiatryonline.org/doi/full/10.1176/appi.ajp.162.7.1373). It happens all the time. [Which is why a lot of naive men fall victim to PUAs and redpill scammers](https://jacobin.com/2023/03/andrew-tate-capitalism-scam-misogyny-alienation-hustle). Those guys blame themselves: \"oh, I must be doing something wrong,\" when [it's usually about their looks](https://gwern.net/doc/psychology/okcupid/howyourraceaffectsthemessagesyouget.html).\n\nThe main takeaway is this:\n\n**Anatomy is destiny, and you can't really fight destiny.**\n\nSo don't be a free agent in life. Let the blackpill guide you.",
    "title": "Your Anatomy is Your Destiny",
    "subreddit": "MensRights",
    "timestamp": 1694132990,
    "score": 69,
    "keyword": "mixed race judge"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 64,
    "keyword": "mixed race judge"
  },
  {
    "text": "A male litigant in Canada complained he has been given less than 48 hours notice for a court appearance, that this has happened repeatedly, his complaints about this have been ignored, and he is facing serous emotional distress as a consequence A male litigant in Canada complained he has been given less than 48 hours notice for a court appearance, that this has happened repeatedly, his complaints about this have been ignored, and he is facing serous emotional distress as a consequence \n\nI'm not an attorney and this is not legal advice.\n \nYou wrote: (above)\n\nI understand you're in Canada.  I may reference various Provinces. Please consult your local Province for various details.\n\nAn intentional and repeated pattern or practice of denying you or fathers in general adequate notice may be part of a conspiracy to deny you adequate time to prepare. If court administrators are knowingly violating court rules, laws, and the charter rights of litigants, they may be committing:\n\nFraud\n\n> Fraud\n\n> 380 (1) Every one who, by deceit, falsehood or other fraudulent means, whether or not it is a false pretence within the meaning of this Act, defrauds the public or any person, whether ascertained or not, of any property, money or valuable security or any service,\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/section-380.html\n\nYou describe severe emotional distress as a consequence. To the extent that such officials are committing these acts in a domestic relations matter, with or on behalf of the other relationships partner, they may be acting as willing agents of domestic violence. In such acts, they may be discriminating against male victims of domestic violence. Any related discrimination may be a violation of charter rights:\n\nDiscrimination against domestic violence victims and child abuse victims on the basis of sex is illegal:\n\n> Canadian Charter of Rights and Freedoms\n\n> 15. (1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. (2) Subsection (1) does not preclude any law, program or activity that has as its object the amelioration of conditions of disadvantaged individuals or groups including those that are disadvantaged because of race, national or ethnic origin, colour, religion, sex, age or mental or physical disability.\n\n> https://en.wikipedia.org/wiki/Section_15_of_the_Canadian_Charter_of_Rights_and_Freedoms\n\nSuch acts may be emotional abuse:\n\n> There are different kinds of abuse\n> Abuse is harm that can be physical, sexual or emotional. Neglect is also a form of abuse.\n\n> Emotional Abuse\n> Saying mean things to another person to hurt them is a way of bullying, scaring, or putting them down. So is threatening to hurt someone or to do something mean to them, like destroying their toys or other possessions or harming their pets.\n\n> https://www.justice.gc.ca/eng/cj-jp/fv-vf/ca-me.html\n\nIf they falsify or destroy records of their acts which undermine the charter rights of their victims, or misrepresent their actions, they may be:\n\n> Misleading Justice\n> Marginal note:Perjury\n\n> 131 (1) Subject to subsection (3), every one commits perjury who, with intent to mislead, makes before a person who is authorized by law to permit it to be made before him a false statement under oath or solemn affirmation, by affidavit, solemn declaration or deposition or orally, knowing that the statement is false.\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/page-32.html\n\nBy giving only male litigants very limited notice, they may be willfully attempting to pervert the course of justice, a crime:\n\n> Obstructing justice\n\n> 139 (1) Every one who wilfully attempts in any manner to obstruct, pervert or defeat the course of justice in a judicial proceeding,\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/page-32.html\n\nThe blatant display of shameless and plainly unfair acts including denying adequate notice may be part of a pattern or practice of intimidating male litigants. That is a display that they will not be treated fairly, and a form of intimidation of male justice system participants, possibly a crime:\n\n> Intimidation of a justice system participant or a journalist\n\n> 423.1 (1) No person shall, without lawful authority, engage in conduct referred to in subsection (2) with the intent to provoke a state of fear in\n\n> (b) a justice system participant in order to impede him or her in the performance of his or her duties; or\n\n> “justice system participant” means\n\n> (b) a person who plays a role in the administration of criminal justice, including\n> (v) an informant, a prospective witness, a witness under subpoena and a witness who has testified,\n\n> Canadian Criminal Law/Offences/Intimidation of a Justice System Participant\n\n> https://en.wikibooks.org/wiki/Canadian_Criminal_Law/Offences/Intimidation_of_a_Justice_System_Participant\n\nThe individuals involved in these acts may feel comfortable with these acts, possibly as a standard pattern or practice, because they have entered into an agreement together to knowingly violate the rights of male litigants. That may be a crime:\n\n> Conspiracy\n\n> 465. (1) Except where otherwise expressly provided by law, the following provisions apply in respect of conspiracy:\n\n> (b) every one who conspires with any one to prosecute a person for an alleged offence, knowing that he did not commit that offence, is guilty of an indictable offence and liable\n\nI would consider a motion to recuse a judge if they failed to ensure I was given proper notice.\n\n> In addition, in Canada – as in the United States and the United Kingdom – a judge is subject to disqualification for an “appearance of bias.” However, in a 2003 case, Wewaykum Indian Band v. Canada, 2 S.C.R. 259, 2003 SCC 45, Canada’s Supreme Court articulated the proper test for disqualification for appearances somewhat differently than any American court ever has when it asked: “What would an informed person, viewing the matter realistically and practically – and having thought the matter through – conclude? Would this person think it more likely than not that the judge, whether consciously or unconsciously, would not decide fairly?” The Court added that “[w]hether there is a reasonable apprehension of bias is to be assessed from the point of view of a reasonable, fair minded and informed person.” Id. At 74.\n\n> https://www.judicialrecusal.com/recusal-disqualification-canada/\n\nIt seems like the judge involved may have knowingly declined to follow the law. If I felt this were true, I would consider a judicial complaint. Each province is different. Here is information for Ontario:\n\n> Making a Complaint\n\n> If you have a complaint of misconduct about a provincial judge or a justice of the peace, you must state your complaint in a signed letter. The letter of complaint should include the date, time and place of the court hearing and as much detail as possible about why you feel there was misconduct. If your complaint involves an incident outside the courtroom, please provide as much information as you can, in writing, about what you feel was misconduct on the part of the judge or justice of the peace.\n\n> You do not need a lawyer to make a complaint and there is no fee. Please indicate in your letter if there is a specific title, pronoun or form of address you would like Council staff to use when communicating with you.\n\n> https://www.ontariocourts.ca/ocj/conduct/do-you-have-a-complaint/\n\nI would consider making a complaint about any attorneys involved. Each province is different. Here is information for Ontario:\n\n> Steps to Make a Complaint about a Lawyer or Paralegal\n\n> https://lso.ca/protecting-the-public/complaints/how-to-make-a-complaint\n\nI might consider these acts a fraud or scam, and report them as such:\n\n> How to report fraud and scams in Canada\n> https://www.competitionbureau.gc.ca/eic/site/cb-bc.nsf/eng/04339.html\n\n> Canadian Anti-Fraud Centre\n> Report fraud and cybercrime\n> https://www.antifraudcentre-centreantifraude.ca/report-signalez-eng.htm\n\nIf I felt the police were not protecting me, especially because of discrimination, I would consider contacting an attorney and contacting Canada Justice:\n\nContact the Minister\nEmail\nmcu@justice.gc.ca\n\nMailing address\nThe Honourable David Lametti\nMinister of Justice and Attorney General of Canada\n284 Wellington Street\nOttawa, Ontario K1A 0H8\n\nFax\n1-613-957-3559\n\nIf I felt that this were part of a pattern or practice and other parents and their children were being harmed, I would consider organizing a class action:\n\nClass action in Canada:\n\n> In Canada, a class action is a form of procedural collective relief brought under specialised class proceedings legislation whereby one or more claimants can seek collective relief for themselves and on behalf of individuals who have similar claims. In a certified class proceeding, a court can adjudicate \"common issues\" relating to class members in a single proceeding, whereby \"success for one is success for all\".\n\n> https://content.next.westlaw.com/practical-law/document/I99a83254410011e598dc8b09b4f043e0/Class-collective-actions-in-Canada-overview\n\nI wish you the best of luck in your search for justice.",
    "title": "A male litigant in Canada complained he has been given less than 48 hours notice for a court appearance, that this has happened repeatedly, his complaints about this have been ignored, and he is facing serous emotional distress as a consequence",
    "subreddit": "MensRights",
    "timestamp": 1695176054,
    "score": 61,
    "keyword": "mixed race judge"
  },
  {
    "text": "When men have casual sex a lot, or even desire casual sex, people see him as a womanizer who objectifies women, not a stud. In fact, most things men do that get called \"objectification\" is just him desiring casual sex. Feminists always like to complain that people glorify a man who has sex with a huge number of people as a stud, but in reality, this is mostly a myth. Empirical evidence has found mixed results about whether this double standard about promiscuity and casual sex exists, and the general consensus is: some men hold a double standard, but many men hold a single standard and judge both promiscuous men and women. Not many women like promiscuous men, and they often judge them and promiscuous women, but some hold a reverse double standard. All of the statistics can be found in this [thread](https://www.reddit.com/r/MensRights/comments/yknuw7/the_myth_that_society_restricted_womens_sexuality/) of mine. Here are some key points the thread makes:\n\n* Women were just as strict, if not slightly stricter than men about how many partners is too many. In fact, it was not uncommon for men to give a promiscuous woman a chance for short-term relationships.\n* Even when using IATs and other methods to control for social desirability bias, they found that people didn't generally hold a double standard and were gender-neutral about their views of promiscuity. If anything, it was more common for women to hold a reverse double standard than for men to hold the pro-male double standard.\n* People don't care if a woman has premarital sex, contrary to what feminists think, and people actually view premarital sex as normal for everyone. In fact, nowadays, virgin women often are seen as prudes rather than pure, but virgin men are more stigmatized. In the late 20th century, after the sexual revolution appeared due to the invention of the pill, people didn't care if people had premarital sex as long as it was in a relationship. Casual sex was stigmatized though. According to new Pew Research surveys, most Americans now think casual sex is acceptable, especially Americans under 50 and even many Americans over 50. Sometimes casual sex in particular might be stigmatized, but now, most people moved on.\n* Men usually don't value virginity anymore, and many men and women both call it a dealbreaker. In fact, men who only want virgins are rare, even for those who merely value it.\n* Back just 10 years ago (2013), when men and women were asked about sex. They didn't view premarital sex in a relationship as bad at all. Men had neutral to somewhat positive views on a man who had sex with someone they weren't in a relationship with and neutral to somewhat negative views on a woman who did, whereas women had neutral to somewhat negative views on both men and women who did such a thing. In the late 2010s though, surveys show a much more positive acceptance of casual sex. Nowadays, hooking up frequently in particular appears to be what is frowned upon, but many people are defending that nowadays, especially socially liberal people.\n* People never cared historically if a woman had non-reproductive sex or enjoyed it, as long as it was with her spouse. Men are allowed to have sex before marriage, but it could only be with hookers. A man who had sex with a non-hooker was viewed as evil or predatory, and was called a rake. Although women today view promiscuous men as unattractive, women back long ago in the 1800s used to say \"reformed rakes make the best husbands\". They viewed promiscuous men as desirable for a marital partner as long as he gave up his promiscuity for commitment because they considered them manly, but people warned women about these men and told them that virgin husbands were preferable and that rakes would abuse, cheat or have STDs. People viewed them as objectifying even back then.\n* It's usually just hypermasculine men who view promiscuous men as a stud. Even historically, if a man had sex with an unmarried woman, only some of his male peers would give him a pat on the back, not people in general.\n\nSo as you can see, men generally hold a single standard, and only some, particularly hypermasculine men, will hold a double standard. Although women often hold a single standard, some hold a reverse double standard. It's more nuanced than people think.\n\nAnd people historically called these men rakes or philanderers. Now, they're called womanizers. It was suggested that these men were predatory and viewed women as objects, and women who had casual sex back in the day were called a slut because it means she's dirty or will be impregnated with a bastard child who doesn't belong to the man she marries. **Nowadays, although people have become accepting of casual sex, people, especially feminists, still call a man \"objectifying\" just for merely desiring casual sex with a woman or thinking she's hot**.\n\nPeople historically expected women to wait until marriage. In the past few decades ago, they expected her to be having premarital sex, but generally in relationships. Now, they think her hooking up is normal, as long as she doesn't engage in promiscuity. Historically, men were expected to only have sex with hookers, then when prostitution got banned entirely, they were expected to wait until marriage (but his male peers may have expected him to try \"scoring\" with women). Then after the sexual revolution, him having premarital sex in relationship was normal, and now even him hooking up is normal, but promiscuity is still taboo.\n\nNonetheless, when he desires casual sex with women, some women, especially when they have a reverse double standard, call him \"objectifying\". People criticize a woman who writes overly sexual lyrics, but men who write lyrics like that are called \"misogynistic\", especially rappers and even rock bands who wrote songs about it just for writing songs about sex. Just look at this \"objectification scale\":\n\nhttps://preview.redd.it/29qhlaz6dnpb1.png?width=467&format=png&auto=webp&s=d16908bf04b20c59a5e684a93b3d24f88d4bca8d\n\nhttps://preview.redd.it/n68ipno7dnpb1.png?width=434&format=png&auto=webp&s=70e8601fa7ff7c91aaa5fbb43394f4b86e0647f7\n\nApparently enjoying porn is objectifying, and even appreciating a woman's body or even just imagining what it's like to see a woman you know naked or have sex with her is objectifying. Meanwhile, a woman who does this and appreciates a man's shirtless body or thinking about having sex with him is seen as normal. Real objectification would be viewing someone as an actual object, where you don't have to rely on their consent, can do whatever you'd like with them and where their feelings don't matter, but just because you think a woman's body looks nice or imagine sex with them doesn't mean you devalue consent, her emotions and would sexually harass her. So why do we not accuse women of doing these same things of being objectifying? Because men are expected to be flattered if a woman does a such a thing, and people think women cannot be predatory or malicious. She can't be considered a rake or a manizer. This is because men were the initiators of sex and women were the gatekeepers. Apparently a thought crime is now objectifying.\n\nSo why do men \"objectify\" women more than vice versa? [It's because men, regardless of sexual orientation and how egalitarian their country is, desire casual sex more than women do](https://www.psychologytoday.com/us/blog/sexual-personalities/201706/what-type-of-person-would-agree-to-have-sex-with-a-stranger). [Even gay men \"objectify\" men](https://journals.sagepub.com/doi/10.1177/0265407519832669). Women might \"objectify\" men too when she's ovulating and when she meets a masculine, muscular, chiseled, heavily tattooed hunk. \n\n**So it is time to stop acting like society has never demonized men for enjoying casual sex, because people obviously see him as objectifying and while actual objectification exists, 90% of what is called objectification is just a man appreciating a woman's appearance and wanting to hook up, even though people value looks all the time with casual sex. We don't accuse women of objectifying men when they do the same thing because we don't view women as predatory or act protective of men. It's sexist to act super protective of women to the point where a man simply thinking her body is hot and wanting to hook up with her is \"objectifying\".**",
    "title": "When men have casual sex a lot, or even desire casual sex, people see him as a womanizer who objectifies women, not a stud. In fact, most things men do that get called \"objectification\" is just him desiring casual sex.",
    "subreddit": "MensRights",
    "timestamp": 1695319660,
    "score": 56,
    "keyword": "mixed race judge"
  },
  {
    "text": "A father lamented that he was \"strong armed\" by the judge and the other parent's attorney to drop a year long contempt action for parenting time violations. He has not seen his child in five years. A father lamented that he was \"strong armed\" by the judge and the other parent's attorney to drop a year long contempt action for parenting time violations. He has not seen his child in five years.\n\nI'm not an attorney and this is not legal advice.\n \nYou wrote:\n\n(Above)\n\nI would consider a motion to recuse the judge.\n\n> Liteky v. United States, 510 U.S. 540 (1994)\n\n> 28 U.S.C. §455(a) requires recusal of a judge in any proceeding in which his impartiality may be questioned.\n\n> https://casetext.com/analysis/judges-motion-to-recuse-removal-on-remand\n\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nIf any judge or person exercising judicial decision making authority and subject to the judicial code of conduct (e.g. some Title IV-D child support etc. employees or Title IV-E child welfare employees who make judicial recommendations such as child placement, child custody, parenting time, or child support calculations), they may also be subject to complaints under this process, even if they are not attorneys. \n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nThe United States pays your state's Title IV-D agency to enforce parenting time through federal grants.\n\nFailure of your state's Title IV-D agency to provide parenting time enforcement for five years:\n\nPossible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.efdu/wex/fraud\n\nPossible:\n\n> 18 U.S. Code § 242 - Deprivation of rights under color of law\n\n> https://www.law.cornell.edu/uscode/text/18/242\n\nPressure by agency employees to prevent you from using parenting time services may be:\n\n> Extortion\n\n> Forcing action or obtaining something by illegal means.  Anyone may commit extortion through force or coercion.  A public or private official may also commit extortion under the color of office.\n\n> https://www.law.cornell.edu/wex/extortion\n\nPossibly defrauding the United States:\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nPossible cause for a federal civil rights action or lawsuit under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nAs  a consumer of services by the court or the agency:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nIf the agency or court is discriminating against employees on the basis of sex or association with parents of a sex which it may be systematically defrauding:\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nGeneral civil rights:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A father lamented that he was \"strong armed\" by the judge and the other parent's attorney to drop a year long contempt action for parenting time violations. He has not seen his child in five years.",
    "subreddit": "MensRights",
    "timestamp": 1698406068,
    "score": 44,
    "keyword": "mixed race judge"
  },
  {
    "text": "A dad wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing dad and attempting to force dad to agree to an arrangement which he feels is not fair to him and his child. A dad wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing dad and attempting to force dad to agree to an arrangement which he feels is not fair to him and his child.\n\nHere is my response in the hopes that it helps other parents and their children to better advocate for faithful mediation, and that it may protect children from child abuse to which they are at greater risk when they don't have a relationship with both loving parents.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing you and attempting to force you to agree to an arrangement which you feel is not fair to you and your child.\n\nPlease consider:\n\n> What Is a Court Ordered Mediation?\n\n> In legal terms, ‘mediation’ is a type of alternative dispute resolution that can help resolve conflicts and avoid litigation. Parties to a lawsuit or domestic matter (such as a divorce or a child custody case) can choose to go to mediation to work out an agreement. In some cases, however, a court may direct the litigants to attend one or more sessions with an approved mediator. This is called court-ordered mediation.\n\n> Is Court-Ordered Mediation Mandatory and Binding?\n\n> If a judge orders the parties to a lawsuit to attend mediation, they must obey and attempt the process in ‘good faith.’ As with any other judicial order, a party that fails to comply with a court order directing mediation can be held in ‘contempt of court.’ Penalties for contempt can include fines and jail time.\n\n> The Law Dictionary\n\n> https://thelawdictionary.org/article/court-ordered-mediation/\n\nAnd:\n\n> Nature of the Process\n\n> Mediation is a process wherein the parties meet with a mutually selected impartial and neutral person who assists them in the negotiation of their differences.\n\n> Role of the Mediator: What does a Mediator do?\n\n> Mediation leaves the decision power totally and strictly with the parties. The mediator does not decide what is \"fair\" or \"right,\" does not assess blame nor render an opinion on the merits or chances of success if the case were litigated. Rather, the mediator acts as a catalyst between opposing interests attempting to bring them together by defining issues and eliminating obstacles to communication, while moderating and guiding the process to avoid confrontation and ill will. The mediator will, however, seek concessions from each side during the mediation process.\n\n> https://www.jamsadr.com/mediation-defined/\n\nI would gather as much evidence as possible. I would explain my view that neither the mediator nor the other person are acting in good faith. \n\nI would consider communicating all of my concerns in writing. I might ask the court to replace this mediator with a different mediator whose actions I would believe are more consistent with their legal duties.\n\nThe mediator's actions may be:\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nMom and the mediator may be secretly working together against you and your child, and deceptively mispresenting the situation as legitimate mediation to the courts. This is:\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nI would consider filing a subpoena so that I can understand any or all of the ex-parte communications between the mediator and the other person.\n\nThe mediator's alleged attempts to force you to accept an agreement may not be in your child's interests. Also their attempts to prevent you from discussing relevant issues could be construed by you as attempt to create a false report to the court and in so doing, achieve a corrupt goal. Forcing you to go along under those conditions may be:\n\n> Extortion\n\n> Forcing action or obtaining something by illegal means.  Anyone may commit extortion through force or coercion.  A public or private official may also commit extortion under the color of office.\n\n> https://www.law.cornell.edu/wex/extortion\n\nIf this person is a social worker:\n\nThe National Association of Social Workers has a Code of Ethics:\n\n> https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English\n\nPossible misconduct by a social worker:\n\n> Social Workers:\n\n> How To File a Complaint\n\n> Steps for filing a request for professional review\n\n> NASW is very interested in reviewing situations that affect the integrity of our profession.\n\n> https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint\n\nIf the mediator knowingly files a false report to the court:\n\nPossible perjury:\n\n> 18 U.S. Code § 1621.Perjury generally\n\n> https://www.law.cornell.edu/uscode/text/18/1621\n\nAnyone may report the crime of perjury to the police.\n\nAnyone encouraging or instructing the mediator to not act honestly, and to then make false claims in court that their work is honest, may be guilty of:\n\n> 18 U.S. Code § 1622 - Subornation of perjury\n\n> Whoever procures another to commit any perjury is guilty of subornation of perjury, and shall be fined under this title or imprisoned not more than five years, or both.\n\n> https://www.law.cornell.edu/uscode/text/18/1622\n\nI would  be aware of the possibility that other parties may approve of or support these actions. If I had evidence that the judge in my case did so, I would consider a motion to recuse the judge.\n\n> Liteky v. United States, 510 U.S. 540 (1994)\n\n> 28 U.S.C. §455(a) requires recusal of a judge in any proceeding in which his impartiality may be questioned.\n\n> https://casetext.com/analysis/judges-motion-to-recuse-removal-on-remand\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nMisuse of the mediation process for illicit purposes is a possible cause for a federal civil rights action or lawsuit under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nAs a consumer of mediation and legal services:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nGeneral civil rights.\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A dad wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing dad and attempting to force dad to agree to an arrangement which he feels is not fair to him and his child.",
    "subreddit": "MensRights",
    "timestamp": 1694364900,
    "score": 40,
    "keyword": "mixed race judge"
  },
  {
    "text": "A father petitioned for custody of his child. The child was in danger in mom's custody, the authorities were aware of this danger, but they denied dad's petition for custody. The child later died in mom's custody. A father petitioned for custody of his child. The child was in danger in mom's custody, the authorities were aware of this danger, but they denied dad's petition for custody. The child later died in mom's custody.\n\nHere is my response in the hopes that it will help families who face injustices, and in the hopes that it will help parents to protect their children from child abuse.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote about a father who wanted custody of his child, the child was in danger in mom's custody, the authorities were aware of this danger, and denied dad custody. The child later died in mom's custody. (Anonymized)\n\nJudges often have judicial immunity for their decisions.\n\n> JUDICIAL IMMUNITY HAS BEEN EXPANDED TO INCLUDE JUDGES, TRADITIONAL QUASI-JUDICIAL INDIVIDUALS, AND SOME COURT-RELATED PERSONNEL, SUCH AS COURT CLERKS AND COURT REPORTERS\n\n> VARIOUS TYPES OF ACTS ARE NO LONGER RECOGNIZED AS JUDICIAL CONDUCT WITHIN THE PROTECTION OF IMMUNITY: (1) ACTS SHOWING LACK OF GOOD FAITH; (2) ACTS CRIMINAL IN NATURE; (3) ACTS IN ABSENCE OF AUTHORITY OR IN EXCESS OF JURISDICTION; AND (4) ACTS OF AN ADMINISTRATIVE OR MINISTERIAL NATURE. \n\n> OVERVIEW OF JUDICIAL IMMUNITY\n> US Department of Justice\n> Office of Justice Programs\n> https://www.ojp.gov/ncjrs/virtual-library/abstracts/overview-judicial-immunity\n\nIt is often the case that judges rely on Title IV-D funded child support agency to exercise judicial authority to make custody recommendations. (They sometimes literally give the agencies rubber stamps and allow them to make orders).\n\nSometimes these agencies focus on their own financial interests or have sexist biases which can impact their recommendations and decisions.\n\nCarol Rhodes is a whistleblower to described such wrongdoings:\n\n> Carol Rhodes Former FOC Enforcement Officer\n> Former Enforcement Officer and Investigator \n> https://www.youtube.com/watch?v=8M7cEi61W24\n\nIf dad was denied custody because of financial conflicts of interests or sexism:\n\nPossible failure to respect:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\n> Troxel v. Granville, 530 U.S. 57 (2000)\n\n> https://supreme.justia.com/cases/federal/us/530/57/\n\n> \"protection of civil rights\".\n\n> \"use of the reasonable and prudent parenting standard\"\n\n> 42 U.S. Code § 671\n\n> https://www.law.cornell.edu/uscode/text/42/671\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nMaking child custody recommendations using these biases rather than the factors mandated by law knowingly or through negligence may be possible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.edu/wex/fraud\n\nIntentionally endangering the life of a child through fraud may be depraved indifference.\n\n> To constitute depraved indifference, the defendant's conduct must be 'so wanton, so deficient in a moral sense of concern, so lacking in regard for the life or lives of others, and so blameworthy as to warrant the same criminal liability as that which the law imposes upon a person who intentionally causes a crime.\n\n> https://definitions.uslegal.com/d/depraved-indifference/\n\nFraud or other felonies which cause the death of victim may be:\n\n> As of August 2008, 46 states in the United States had a felony murder rule,[18] under which felony murder is generally first-degree murder. In 24 of those states, it is a capital offense.[19] When the government seeks to impose the death penalty on someone convicted of felony murder, the Eighth Amendment has been interpreted so as to impose additional limitations on the state power. The death penalty may not be imposed if the defendant is merely a minor participant and did not actually kill or intend to kill. However, the death penalty may be imposed if the defendant is a major participant in the underlying felony and exhibits extreme indifference to human life.[20]\n\n> https://en.wikipedia.org/wiki/Felony_murder_rule#United_States\n\nPlease note there is no statue of limitations on the crime of felony murder.\n\nA social worker worker who may have knowingly or negligently manufactured a false child custody recommendation may be abusing that child. In so doing they are failing to report their own abuse, or if they are aware of it, the abuse of their coworkers, a crime.\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n> 18 U.S. Code § 2258.Failure to report child abuse\n\n> https://www.law.cornell.edu/uscode/text/18/2258\n\nThe United States pays for the child support agencies under Title IV-D and that law requires protection of civil rights, including the rights of parents. Denying them those rights to get more federal funds is possibly defrauding the United States:\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\nIf they are knowingly or negligently defrauding the public and the United States, it is also possible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nAll parents who pary for any services, including recommendation services, parenting classes, etc which are offered under the deceptive pretext of allowing a parent worried about their abused child to enable them to have more time or custody with them in order to protect them, could form a class action lawsuit.\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nAll individuals denied employment, promotion, or who simply quits in disgust because their moral beliefs prevent them from participating in any deceptive acts or crimes could form a class action lawsuit.\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nAll parents and children who suffer as a consequence of deceptive acts or crimes could form a class action lawsuit:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A father petitioned for custody of his child. The child was in danger in mom's custody, the authorities were aware of this danger, but they denied dad's petition for custody. The child later died in mom's custody.",
    "subreddit": "MensRights",
    "timestamp": 1685898190,
    "score": 41,
    "keyword": "mixed race judge"
  },
  {
    "text": "A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers. A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.\n\nHere is my response in the hopes that it helps victims of corruption  and coercion who wish to seek justice, and helps to prevent injustices which can promote child abuse.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote:\n\nA lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers. (Anonymized)\n\nFathers have a right to legal representation free from coercion.\n\nPossible:\n\n>18 U.S. Code § 242 - Deprivation of rights under color of law [https://www.law.cornell.edu/uscode/text/18/242](https://www.law.cornell.edu/uscode/text/18/242)\n\nA pattern or practice of harassing lawyers who successfully argue for fathers may be an attempt to extort ineffective legal services for fathers from all lawyers:\n\n>Extortion Forcing action or obtaining something by illegal means.  Anyone may commit extortion through force or coercion.  A public or private official may also commit extortion under the color of office. [https://www.law.cornell.edu/wex/extortion](https://www.law.cornell.edu/wex/extortion)\n\nThe US funds the child support and parenting time systems which depend on protection for civil rights. Undermining those civil rights for fathers creates more work and billable hours for agencies which means any illegal act to extract more money from the federal government may be:\n\nPossibly defrauding the United States:\n\n>If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both. 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States [https://www.law.cornell.edu/uscode/text/18/371](https://www.law.cornell.edu/uscode/text/18/371)\n\nPossible criminal conspiracy against rights:\n\nAttorneys have a right to practice free from coercion. Clients have a right to legal services not hindered by coercion:\n\n>\"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\" 18 U.S. Code § 241.Conspiracy against rights [https://www.law.cornell.edu/uscode/text/18/241](https://www.law.cornell.edu/uscode/text/18/241)\n\nUse of intimidation, threats, and corrupt persuasion against lawyers and their clients may be witness tampering:\n\n>(b)Whoever knowingly uses intimidation, threatens, or corruptly persuades another person, or attempts to do so, or engages in misleading conduct toward another person, with intent to— (1)influence delay, or prevent the testimony of any person in an official proceeding; 18 U.S. Code § 1512.Tampering with a witness, victim, or an informant [https://www.law.cornell.edu/uscode/text/18/1512](https://www.law.cornell.edu/uscode/text/18/1512)\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n>HHS Office of Inspector General Phone. 1-800-HHS-TIPS (1-800-447-8477) [https://oig.hhs.gov/fraud/report-fraud/contact.asp](https://oig.hhs.gov/fraud/report-fraud/contact.asp)  \n>  \n>HHS Office of Civil Rights [https://www.hhs.gov/civil.../filing-a-complaint/index.html](https://www.hhs.gov/civil.../filing-a-complaint/index.html)\n\nDepartment of Justice Civil Rights\n\n>The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin. [https://www.justice.gov/crt](https://www.justice.gov/crt)\n\nAnyone may report federal crimes to the FBI.\n\n>(202)324-3000 [http://tips.fbi.gov/](http://tips.fbi.gov/)\n\nIf any attorney misused the bar association rules and complaint procedures not as a way to ensure the integrity of the courts, but rather used detestable selective weights and measures such as combing through a targeted attorney's case history to find technical violations of the rules as retaliation for their vigorous defense of their client's interests, that act itself could be a violation of bar rules subject to complaint:\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n>Complaints Against Lawyers  \n>  \n>The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.  \n>  \n>[https://www.americanbar.org/groups/professional\\_responsibility/resources/resources\\_for\\_the\\_public/](https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/)\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n>Model Rules of Professional Conduct  \n>  \n>[https://www.americanbar.org/groups/professional\\_responsibility/publications/model\\_rules\\_of\\_professional\\_conduct/model\\_rules\\_of\\_professional\\_conduct\\_table\\_of\\_contents/](https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/)\n\nIf any judge or person exercising judicial decision making authority and subject to the judicial code of conduct (e.g. some Title IV-D child support etc. employees or Title IV-E child welfare employees who make judicial recommendations such as child placement, child custody, parenting time, or child support calculations), they may also be subject to complaints under this process, even if they are not attorneys.\n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n>Model Code of Judicial Conduct  \n>  \n>[https://www.americanbar.org/groups/professional\\_responsibility/publications/model\\_code\\_of\\_judicial\\_conduct/](https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/)\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>How to File a Grievance [http://jtc.courts.mi.gov/file\\_a\\_grievance/index.php](http://jtc.courts.mi.gov/file_a_grievance/index.php)\n\nAny social worker who purposefully abuses the bar association complaint system as a weapon of retaliation against an attorney who vigorously defends the interests of their client may be acting in an unethical manner, and is also subject to complaint:\n\nThe National Association of Social Workers has a Code of Ethics:\n\n>[https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English](https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English)\n\nPossible misconduct by a social worker:\n\n>Social Workers:  \n>  \n>How To File a Complaint  \n>  \n>Steps for filing a request for professional review  \n>  \n>NASW is very interested in reviewing situations that affect the integrity of our profession.  \n>  \n>[https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint](https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint)\n\nPossible cause for a federal civil rights action under:\n\n>42 U.S. Code § 1983 - Civil action for deprivation of rights [https://www.law.cornell.edu/uscode/text/42/1983](https://www.law.cornell.edu/uscode/text/42/1983)\n\nUS courts provide forms:\n\n>Complaint for Violation of Civil Rights (Non-Prisoner) [https://www.uscourts.gov/.../complaint-violation-civil](https://www.uscourts.gov/.../complaint-violation-civil)...\n\nPossible basis of a class action lawsuit for similar situated people:\n\n>WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS? There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories: ... Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes. Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers. [https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit](https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit) CIVIL RIGHTS CLASS ACTIONS: A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION For over 50 years, class actions have been among the most powerful tools to secure civil rights in America. Brown v. Board of Education, 1 which outlawed school segregation and set the stage for the entire civil rights movement, was a class action lawsuit. More recent examples include the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth Mines and considered to be the first sexual harassment class action lawsuit. CENTER FOR JUSTICE & DEMOCRACY [https://centerjd.org/.../files/CivilRightsClassActionsF.pdf](https://centerjd.org/.../files/CivilRightsClassActionsF.pdf)\n\nI wish you the best of luck in your search for justice.\n\nTweet and gettr with me to seek justice:\n\nA lawyer helped father to stop paying child support for a child which was not his. She was disbarred.  \\[Alleges that\\] she was targeted & lawyers fear retaliation for helping their clients. Look @OIGatHHS @HHSOCR @CivilRights @ABAesq @JudiciaryGOP @POTUS [https://www.reddit.com/r/MensRights/comments/13uzqrp/a\\_lawyer\\_helped\\_a\\_father\\_to\\_stop\\_paying\\_child/](https://www.reddit.com/r/MensRights/comments/13uzqrp/a_lawyer_helped_a_father_to_stop_paying_child/)",
    "title": "A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.",
    "subreddit": "MensRights",
    "timestamp": 1685378189,
    "score": 37,
    "keyword": "mixed race judge"
  },
  {
    "text": "A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney. A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney.\n\nHere is my reply in the hopes that it helps other parents who are seeking justice, and it helps to protect children who are vulnerable to child abuse when their parents cannot effectively represent themselves in an effort to protect their children.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote: (above)\n\nThe Supreme Court said that people in court have a right to self representation except for people who have a mental illness. If denied the right to self represent, I might ask the judge what mental illness they believe I have and if they have any evidence that I have not seen or sworn testimony from any medical professional I have not yet met.\n\n> Indiana v. Edwards - 554 U.S. 164, 128 S. Ct. 2379 (2008)\n\n> RULE:\n\n> The United States Constitution permits judges to take realistic account of the particular defendant's mental capacities by asking whether a defendant who seeks to conduct his own defense at trial is mentally competent to do so. That is to say, the United States Constitution permits States to insist upon representation by counsel for those competent enough to stand trial under Dusky but who still suffer from severe mental illness to the point where they are not competent to conduct trial proceedings by themselves.\n\n> https://www.lexisnexis.com/community/casebrief/p/casebrief-indiana-v-edwards\n\nIf anyone intentionally creates a web site which deceptively gives the false impression that they are providing public services such as forms, but in reality has broken the links, that may be wire fraud:\n\n> Whoever, having devised or intending to devise any scheme or artifice to defraud, or for obtaining money or property by means of false or fraudulent pretenses, representations, or promises, transmits or causes to be transmitted by means of wire, radio, or television communication in interstate or foreign commerce, any writings, signs, signals, pictures, or sounds for the purpose of executing such scheme or artifice, shall be fined under this title or imprisoned not more than 20 years, or both.\n\n> 18 U.S. Code § 1343.Fraud by wire, radio, or television\n\n> https://www.law.cornell.edu/uscode/text/18/1343\n\nIt is possible that the court officials to whom you spoke insist on you using an attorney, because they believe the attorneys you will hire have been coerced into providing inadequate legal representation.\n\nI previously wrote about a coercive environment for attorneys:\n\n> A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.\n\n> https://www.reddit.com/r/MensRights/comments/13uzqrp/a_lawyer_helped_a_father_to_stop_paying_child/\n\nIf this web site is cited in any document as example of how the courts comply with state or federal laws which enable the court to obtain federal funds it may also be:\n\n> (a)Whoever, if the circumstance described in subsection (b) of this section exists— (1)being an agent of an organization, or of a State, local, or Indian tribal government, or any agency thereof— (A)embezzles, steals, obtains by fraud, or otherwise without authority knowingly converts to the use of any person other than the rightful owner or intentionally misapplies, property that— (i)is valued at $5,000 or more, and\n\n> 18 U.S. Code § 666.Theft or bribery concerning programs receiving Federal funds\n\n> https://www.law.cornell.edu/uscode/text/18/666\n\nPossible failure to respect:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\n> Troxel v. Granville, 530 U.S. 57 (2000)\n\n> https://supreme.justia.com/cases/federal/us/530/57/\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney.",
    "subreddit": "MensRights",
    "timestamp": 1689252434,
    "score": 35,
    "keyword": "mixed race judge"
  },
  {
    "text": "\"Misogynist Clubs: Because Nothing Screams 'I'm Secure in My Masculinity' Like Hating Women\" (or \"Why Men join Misogynist Cults?\") When I see the behavior of Andrew Tate and his ilk, I think, 'Different clowns, same circus.' What I mean is that this is a plain old cult with a boring and unoriginal ideology.\n\n&#x200B;\n\nMisogynist idiots have existed for as long as there have been women. It is only now that they are speaking out so harshly against us. We women spend so much of our time hating such twits and worrying about how far-reaching the consequences of their actions on today's young boys can be. I want to stop to think about why such groups are seeing such a rising following?\n\n&#x200B;\n\nMy primary reason: Men thinking they are entitled to female attention are losing. These are usually \"low-quality\" men who are underachieving and unsuccessful. I mean this primarily from a financial and social standpoint. Look at the past hundred years. In Western society, women were socially subjugated and relied almost entirely on men for financial support. However, upon the advent of the First World War, women had their first taste of freedom where their destinies were not in the hands of a man. When most of the men were away fighting a war, women independently earned wages and did all the work that men could. And as the saying goes, once people taste freedom, it is impossible to take it away from them.\n\n&#x200B;\n\nOver the 20th century, women learned that it is a harsh and cruel world, and what men have due to nature's lottery, the former must earn through toil and hard work. Women had to acknowledge that hurdles placed in their way, such as sexual harassment in the workplace and inequality in pay. They had to juggle between a thankless job and their children. Despite all the blood and sweat and tears (often quite literally), we women persevered. There is a long way for us to go. But look at us now. Since the 1990s, women have earned college degrees at higher rates than men. In recent years, the gender gap in college completion has only widened. Men are more likely to drop out and avoid enrollment altogether. College degrees, of course, mean more opportunities for better jobs and earning more than men in the business world. It does not mean it's all sunshine and rainbows. Despite all our struggles, women are still underrepresented in high-paying jobs. But this is changing, albeit slowly.\n\n&#x200B;\n\nI like to believe most women support each other. We have large support groups of female friends with whom we gossip about our problems. We don't consider it a weakness to seek therapy and mental help should we need it. We don't see it as a weakness to cry when we need to and talk about our feelings and help ourselves in a healthy way.\n\n&#x200B;\n\nWhat does our financial independence mean for us socially? We no longer \"need\" men, only \"want\" them. Like me strutting into Sephora and checking out every beige pink lipstick before finding one I liked, women no longer have to \"settle\" for just anyone. They can be demanding. They can be, as these men call us, \"shallow.\" We can demand a partner who earns as much as us, is as well-educated as we are, takes as good care of physical appearance as we do, and is as kind and respectful as we are. We want men who view their partners as equals and are confident enough in themselves that they don’t need someone to stroke their ego and make them feel like they’re in charge. And like my lipstick, there is a return policy for any idiotic husbands we might get ourselves. The return receipt often comes with a lovely policy of half our ex's money. (Sephora never offered such a great deal on my lipstick.)\n\nConsider Andrew Tate and many, many others like him. Why do they do what they do? Remember, it takes a lot of emotional effort to hate someone. It takes time and energy to go to online forums bashing women and feminism and making a pariah out of yourself due to your attitude against half the human race. So I ask again, WHY?\n\nMy answer: They are scared. Most of these men are bums who live their lives without moving the dirt it takes to bury them under. They have nothing to offer in a romantic relationship, which is, after all, always initially a transaction i.e. What can I offer you and what will you give me? These men want a submissive wife and want to feel dominant and have their ego stroked because deep down, they are insecure. Socially and financially, they are losers and want power in a world where they have none.\n\nMisogynistic men often join these groups because they feel threatened by the changing gender dynamics in society. With the rise of feminism and women's empowerment, they feel like their traditional role as the dominant gender is being challenged, which makes them uncomfortable and defensive. They may also feel that they are losing out on opportunities because of affirmative action programs that promote diversity and equality, which they see as unfair and unjust.\n\nAdditionally, some men may feel that they are entitled to women's attention and affection, and when they don't receive it, they become resentful and angry. They may blame women for their lack of success and blame them for their own shortcomings, instead of taking responsibility for their actions and working to improve themselves.\n\nMisogynistic men may also feel like they are losing control over their lives and their environment. They may see women as a threat to their power and privilege and join these groups as a way to assert their dominance and reclaim control over their lives.\n\nBasically, these groups are filled with dudes who feel like they're losing control and want to take it back. They're just not going to win because the world is moving forward, and they're stuck in the past\n\nAnd the most surprising and ironic part of these misogynist hate groups? They show that we ,women are succeeding .We are a rising threat that challenges such ideology .  Yeah, these groups can cause damage, but the effects won't last because hate never wins in the end. History always negatively judges unjustified prejudice.",
    "title": "\"Misogynist Clubs: Because Nothing Screams 'I'm Secure in My Masculinity' Like Hating Women\" (or \"Why Men join Misogynist Cults?\")",
    "subreddit": "Feminism",
    "timestamp": 1676920120,
    "score": 38,
    "keyword": "mixed race judge"
  }
]