[
  {
    "text": "Help - Being \"Professionally\" Bullied at Work **Background:** I currently work in the advertising industry, specifically Digital Ad Operations, for a big-name company. My job is to work on the technical side of things, generating (not by hand) the code necessary to make ads display on websites (among other things) and then deliver them to contacts at websites such as Facebook, YouTube, etc. I've work in an office setting before, but this is my first job out of college. In my experience, and also in what I've read and seen, it's general a job that is \"tailored\" to straight-out-of-college employees. You are not expected to have any prior knowledge of the job, but you *are* expected to be competent enough to pick it up quickly. In other words, it's not something you study for in college. The job is request-based by nature, meaning you get an email with the task, confirm receipt, do it, and then confirm that it's finished. I've worked here for a little over 2 years now. \n\n-----------------------\n\n**The Issues:** Since I've been here, I haven't been promoted. I understand that this is something earned. However, going from entry level to Senior is not something particularly difficult. Half of it is about doing a good job, while the other half of it is just...a participation award, really. Meaning, just do your work and eventually you will/should get promoted. Since I've been here, I noticed that performance reviews are not a thing; in my over 2 years here, I have not had one. I've asked for one several times, and I've gotten mixed responses ranging from, **Director:** *\"Well, I've reached out to upper management about a formal process, but haven't heard back\"*, to *\"Eventually, we will get to that.\"* The problem with this is that since I've been here, I've barely gotten any positive feedback. I've seen waves of coworkers promoted (which is a $13,000 increase in pay), while I remain a entry level, despite overwhelmingly-positive feedback from other director and managers that I work with. Even those I've never met in person, and who I've only spoken with on the phone. I have a reputation for going above and beyond to resolve issues when I can help it. I won't lie and pretend that I haven't made any mistakes, but I would say that the majority of my work is objectively very good. I've lost track of how many times I've ended up in meeting rooms with my director and new manager (who was previously my supervisor and was promoted). The topics have ranged from:\n\n\n\n* **Lateness:** It is true that I had issues arriving on time way back when I started, but I've made great strides to arrive on time or even early. For reference, I work in NYC, and there are train issues almost every day. I've come to realize that this is my problem and mine alone, and that I need to work around this. However, what really bothers me is that I broke my wrist in February and notified my manager that I needed extra time to get ready in the morning. She said this was okay. I arrived in the office one morning sometime between 9:45 AM and 10 AM, and my director immediately called me into a meeting room. She opened with a rude and sarcastic remark, and then told me that she was reporting me to HR for arriving late so often. I showed her my broken wrist and she acted like she didn't know, which is impossible considering she and my manager speak often, even if she's never actually in the office. She asked me if I needed disability leave, and I said no. Eventually the meeting ended, and she still reported me to HR. I visited HR to explain my situation, and the woman understood.\n\n* **Unexplained absences from my desk:** This one has never really been elaborated on; it's just kind of tacked on with no examples. I get up to go to the bathroom, get a coffee or water, or just stretch my legs. I might go across he street to Starbucks or something, but it's not as if I'm gone for more than 15 minutes. My job is a desk job, and in the words of my previous manager, sometimes you need a break from the screen as the work can become a blur. My work still gets done in a timely manner. Additionally, we don't get paid during our lunch breaks, yet my manager told me that the director said *\"If you have time to take a lunch break, you're not busy.\"*\n\n* **\"Sitting\" on requests:** My director claims I sit on work before starting it, but that isn't true. My team and I CC each other on emails/work that involves us all, but not work that is specific to one person. When I have been busy with such work, I notify my team so they know that I'm working on something and can't assist them with anything else. \n\n* **\"Unnecessary pushback on work\":** Absolutely no idea where this is coming from. If we receive a request that isn't sent in the correct format, we kindly ask the person(s) sending it to resubmit it correctly. Again, not really sure where this is coming from. \n\n----------------------\n\n**Other Concerns:**\n\n* The environment is very much upper management looking after themselves. My director hires people who do little to no work to work with her/under her. She promoted a manager who is almost never in the office to an Associate Director position, a position which never existed until then. This Associate Director told us that her \"role is undefined\" when my manager asked her why she doesn't help us out\n\n* My director is a people-pleaser. She doesn't defend us at all; she lets our team take the fall for everything\n\n* My manager quit because she was thrown under the bus by my director and her name and reputation became tarnished in the company; another company that we pay to QA our ads let something pass QA that shouldn't have, and my manager got in trouble instead of representatives from that company. \n\n* My director hired *another* Associate Director rather than promote my manager, which roadblocked her career, which was the final straw for her and ultimately the reason she left. This new AD doesn't know how to do the work.\n\n* I've witnessed my director fire an employee of 10 years, who had an 8-month pregnant girlfriend, semi-publicly; he came out of a meeting room crying and was told to grab and his stuff and leave. The company hired him back the same day in another department. She did the same to another coworker, no bag or box provided.\n\n* We have lost 12 people in a year, on a team of about 20. I think we're about 8-10 people now. For every 3 or so people who leave, we get 1 new person. The team has been understaffed for a while, and it's a universal concern among my coworkers. We get the usual, \"We're interviewing\" from upper management, but it seems like they don't care about retention. This is a concern because training people to be able to do this job autonomously takes a lot of time and babysitting, for lack of a better term. Additionally the work becomes stressed and strained with the additional workload, due to the nature of the job\n\n* Previously, I had a senior (one who started 7 months after me, and who I had trained...), a supervisor, and a manager. All 3 of them have left the company for pretty much the same reasons. My team (meaning my immediate team) is just me and a new employee who started about 2 months ago, who I have been managing and training. I currently work on/own the biggest account that the company has (a huge consumer products company I cannot mention), as well as a second account, and my new AD has been trying to get me to help out on a third against my insistence that I cannot handle that workload\n\n-------------- \n\n**Current Situation/Why I'm Posting:** My director called a meeting between HR, the new AD (who has been there for about a month), and myself last week. She never told me HR would be there, but when I saw the woman come into the office I packed my things in anticipation of being fired (NY is an At-Will Employment State). While I was nervous, I thought that this would be the end of my sleepless nights, stomach issues from nervousness, and fear/hatred of coming to work. I had started looking for new jobs recently because I had given up hope of getting Senior and being able to apply with that on my resume.  I get into the meeting room, and I notice everyone has a 3-page paper in front of them. My director puts on the good cop impression and starts talking to me about the things I outlined above. I countered them and even provided printed emails from recently, going back two years of the contrary (especially about my quality of work and my reputation within the company). I even showed how she was on these email chains. She didn't care and said something to the effect of, \"While others outside of this department may think you do a great job, I don't.\" I also explained how I am carrying the workload of at least 3 other people/former employees. She still didn't care. The HR woman just sat there taking notes. Eventually she tried to shut me up by saying it was pointless arguing the past, and gave me this Performance Warning/Improvement Plan to look over and sign. It basically details the issues and how we're going to fix them (which are things I have already been doing). I was completely shocked, but took the paper without signing it. At the bottom is a blurb about how NY is an At-Will Employment state and how they can let me go at any time (I knew this already). \n\nOne of my coworkers who left to a competitor referred me at his new place, and I've completed the final round of interviews last week. I feel like I have a very good chance of getting it. I also have a lot of job opportunities/offers from friends and previous coworkers, totally unrelated to this situation. I'm afraid of being fired, but I **do not** want to sign this paper because I don't agree with what I'm being accused of. I've drafted counter-points to send back to the HR woman rather than the signed document, but I fully expect this to be a one-way street. \n\n**What is the correct thing to do in this situation?** I've felt bullied throughout my entire career here, and I feel like the negative feedback has really damaged me over time. It hurt my self-worth and made me feel drained of energy and on-edge/nervous all the time. That's why it took me so long to find the will to leave to another job. I know not to sign this document, but I'm afraid that I'm going to fired immediately. I also know that because I have more experience than most people here, and because I \"own\" the largest account the company has, they will be screwed if I leave on a whim (or even 2 weeks). So I'm kind of in this limbo, where I think they're trying scare tactics on me, but I'm not sure. Thus far, it's been a domino effect of people leaving, and a lot of people who left have shared similar sentiments.",
    "title": "Help - Being \"Professionally\" Bullied at Work",
    "subreddit": "jobs",
    "timestamp": 1494797605,
    "score": 22,
    "keyword": "mixed race director"
  },
  {
    "text": "Company extended my probation for reasons (I feel) are invalid. Should I start my job search now? I live in California. So, I know the law here isn't the same as everywhere else, but I hope to gain some input regarding the following. I apologize in advance if I am all over the place, as this happened about an hour ago, and I am still in shock.\n\nI got \"hired\" on to this company via a temp agency with the promise that after 90 days, I would become full time (Raise, benefits, healthcare, etc). I was trained by the person I was replacing. Let's call her Jane. Jane was leaving because she was moving away. I later found out she was on the verge of being fired for spreading rumors, but ended up moving before proceedings to do so occurred. \n\nWell, Jane trained me for over a month, and during this month, I grew to really like her. Added her as a friend on the bookface and whatnot. \n\nDuring these past 3 months, I have been, I feel, an exemplary worker, and get everything done on time (and then some). I am constantly praised for my speed, accuracy, and attitude. I feel like I am doing great, and I can see myself working here for many years to come.\n\nFast-forward to today. My 90 day meeting. My director starts off with asking me If I like it here, and blah blah blah. I tell him how much I love it, and how I'm so happy to have been chosen for the position. Out of nowhere, he asks me if I have had any contact with Jane. \"Odd question\", I thought.. \"Uh, yeah, I mean she asked how I was doing like a month ago.\" \n\nThis was followed by a smile.. and him saying \"We can't demand respect, but we can demand loyalty.\" and sneaking \"We are extending your probation by 30 days\" at the very end.. \n\nI asked for further explanation, and he stated \"I just feel like you're taking direction from Jane, rather than us\"... Ummm SHE TRAINED ME! \n\nI was 100% Fully in shock. I still don't know how to react... I felt tears swelling my eyes, so I just said \"thank you\" and left.  \n\nNow, I am just sitting here confused. Can an employer force you not to talk to someone?? My mind is totally racing right now, and I'm so angry.. Reddit, please offer advice?\n\nTL;DR - Employer decided to extend probation another 30 days, seemingly for speaking to an ex-employee",
    "title": "Company extended my probation for reasons (I feel) are invalid. Should I start my job search now?",
    "subreddit": "jobs",
    "timestamp": 1502839348,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "May have bombed my second interview... So i managed to land an interview with a major sports organization, the first interview went great.\n\nMet with the department manager, said my resume was impressive and seemed to be an exact fit for the position. I was scheduled to meet with only the manager, but he asked the Department Director to join.\nI had a 45 minutes interview with the Director, until a meeting was about to take place in the conference room we were in. We both lost track of time, he mentioned future projects, told me upfront that my answers and questions were impressive and he was glad that i brought up the questions and ideas that i did.\nHe told me what the next steps were, which were meeting with someone from the staff and the VP of the department.\n\nExactly one week later i was asked to come in for the second interview the following day.\nWent in confident, was to meet with two people i just mentioned. First meeting with staff member was good, purely technical and methodical questions based on scenerios.\n\nSecond person i met was the VP, first we spoke in a personal level about ourselves, sports teams, private life, etc. THEN some more technical questions came in, some of which i answered correctly (i think), but i did incorrectly answer one. The questions from the VP seemed to be out of the job descriptions context or requirements.\nDuring this meeting, another Director was brought in who i was not expecting. This person did not show the best body language. For many of my answers he kept looking at the VP sort of wondering if he approved or not. He asked many questions that also seemed out of scope for the position i applied for.\n\nAfter they asked their questions, they did not ask if i had any questions for them, they did not mention any further steps, and the person who i was not expecting to meet with said \"good luck to you\" at the end, i'm not one to take these too seriously, but his tone was not reassuring.\nupon exiting, the VP walked me towards the exit and said many of the staff were off this week due to a major event, shook my hand and thanked me for coming in.\n\nI'm just completely confused at this point...\n\nThe VP did in fact ask me if i prefer salary or hourly pay, and also asked how my commute into the office is, also asked if i was willing to work nights and occasionally cover for other employees.\nso many mixed signs.....",
    "title": "May have bombed my second interview...",
    "subreddit": "jobs",
    "timestamp": 1485539564,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "I didn't tell my future employer about my second job. Need advice. UK Hi there all! \n\nFirst I would like to thank this amazing community for all the tips and tricks about job hunting and interview process - it helped A LOT, you are THE BEST!\n\nI am looking for a job in marketing and just had two good interviews with two different companies. \n\nIt will be one of these long posts.\n\n\nBackstory:\n\nI have a uni degree in business related field. Graduated almost 4years ago, but I have started any degree related work in marketing only over a year ago. \n\nWhen I was out of uni I didnt have a clue what to do next, so I wasted a couple of years and made some strange decisions, tried to get to film school, didnt succeed.. oh well it happens.\n\nI found myself on the edge in Summer 2014, I had no money and nowhere to go apart from my parents' house. I was lucky my girlfriend was there for me (we are still together, I love her to bits).\n\nSo my gf offered we can move to her mums place and her step dad will sort us jobs as security guards until we get on our feet financially. (He also lended me money so I could do the course for security guard licence). It was a strange job for a geek like me, it was also long hours and days/nights. Obviously not much professional/personal development involved in any duties.\n\nAfter 8months of working hard, a lot of hours etc. we managed to save a nice sum of money for our new start, we also bought our fìrst car with a portion of that money. It was amazing to get my own car, I still drive it.  So we have moved together to a major city. My gf quickly found herself an ok job in an office. I decided to carry on with my security job part time and really wanted to make the best out of this new start. I went through some deep analysis of myself and decided I will make a great marketing guy, I felt this is something I can be really good at and something that will fullfil me. \n\nI started heavily educating myself on the subject, learning about copywriting, digital tools, strategies, tactics and different concepts on my own. I got some essential knowledge and skills and wanted to find an entry level job in marketing and leave this security job. \n\nI have managed to find a job as admin/marketing guy, for this small office dealing with finances. Working desk to desk with the director of the company. He also was the guy who interviewed. At an interview he said that he can offer me around 3 days a week at minimal wage for start, but promised there will be bonuses and more days of work in a few months. I took this job and was happy I made any step towards my goal, proper career. I thought it will look good on my CV in the future, when I wilk want to get this real job in marketing.\n\nHERE'S WHERE THE PROBLEM STARTS\n\nI have been working in this office as marketing guy 3days a week for minimal wage and then work 2-3days in my security job as cover guard (part-time) it was the only way to support myself financially at the time. \n\nI have been working these two jobs simultaneously for over a year now. \n\nMy office boss made some promises to me at an interview, but never bothered to actually make my job  full time or increase my pay. I didnt care, I was getting some hands on experience on how to run a business and how to talk to clients. My security job was paying my bills. From many things I have learned myself was Wordpress so I started also freelancing making websites and doing photography gigs. So I have 2 part time jobs + freelancing gigs. I often work 6days a week and there's always some project going on. \n\nIt got to the point now that my security licence expires in a few months and my office job taught me a lot but there's no more room for any development and financially it sucks and my boss doesnt care. \n\nI decided I dont want to renew my security licence and I should finally try getting a real job in marketing, full time with a decent pay and normal management.\nAs this mixed lifestyle of being a jack of all trades doesn't really make me feel fulfilled or happy. I feel like I am slipping through life.\n\nI put my CV together and made it look that my only job is the one in marketing as the rest was really irrelevant. I wanted to look more credible, avoid questions about my second job etc.\n\nTHE ACTUAL PROBLEM:\n\nSo I had two interviews that I feel went great. Especially the second one I had, I liked the company, its ethics and the environment. \n\nBefore the interview they asked me to make a presentation about my marketing process in my current job and gave me a task to draft a marketing plan for their company, it was on a very short notice, I had to literally put it together overnight. \n\nI went to the interview in a suit feeling confident (fake it till you make it) and I gave the presentstion that was recieved with a very positive feedback, I was also able to answer all their questions without any bigger problems. It was a looong interview and they asked me a lot of questions regarding my skills, knowledge, aspirations and life in general. Real X Ray scan.\n\nOne of the questions by the end of this interview was about my current salary, I avoided it by telling them that if they want to talk about the money now, all I have to say is that the salary range they are offering suits me and I am sure we will work something out.\n\nI felt I totally nailed this interview, so proud of myself, regardless of the fact they hire me or not. I really kept my shit together and was confident. They also gave me some positive feedback about my presentation and were impressed that I have managed to put it well together on such short notice.\n\n\nAt the very end the HR manager asked everybody to leave and started telling me in detail about their package, benefits etc. and he asked me again about my current salary, as he wanted to see if they match it with their package. I told him how much I made in total last year (didnt mention the fact that my total income includes other job and freelancing). \nAnd that was it.\n\nI am waiting for a call back from them.\n\n\nI started thinking if they decide to hire me (or any other company really) I will have to give them the tax documents from my previous employer, here in the UK it is P45. But if I give them the P45 from my marketing role it will only show them a little fraction of total sum I have earned in my office job and will exclude other sources of my income. This will obviously be a kind of red flag for them and they might get suspicious why is it so low.\n\nI am thinking what are my options here. \nNobody really asked if I have any other jobs at the moment and I never thought to tell them. \n\nI am thinking how can I hide my previous income from my future employer or solve it in any other way. \n\nShould I talk directly to the Tax Man (HMRC)?\n\nI had no bad intentions not telling them about my other job and freelancing, just wanted to look more credible and focused on marketing, as this is my ultimate field of interest. The moment they decide to hire me I will resign from both previous jobs and cut down freelancing.\n\nI am really fighting here for my dreams and manouver throughout my life so I can reach them.\n\n\nWhat do you think Reddit?\n\nI know it's a looong post, but appreciate if anybody made it all the way here :)\n\nMuch Love!",
    "title": "I didn't tell my future employer about my second job. Need advice. UK",
    "subreddit": "jobs",
    "timestamp": 1503674912,
    "score": 0,
    "keyword": "mixed race director"
  },
  {
    "text": "My late term abortion experience Warning this is super long, but thank you in advance if you actually get through it.\n\nHello there. I'm new to the site and thought I'd introduce myself. For now, I'll just go by Siola. That's not my real name. I actually have a pretty uncommon name, and I'd like to keep my abortion pretty much a secret. My husband and I only told my parents, my brother and his wife, and a few close friends. His side of the family does not believe abortion is the right thing to do, so we just thought it would be for the better to say we had a miscarriage. That part hurts. I hate lying to his mom and dad, and other friends. I want to openly support others via Facebook and other social media outlets, but I can't. But, I guess I can here, so that's really nice.\n\nWell a bit more about me. I turn 30 in a couple weeks. I've been with my husband eight years, married almost four years. We have a three year old son, a dog, and two cats. I'm a stay at home mom for now. One day I'd like to go back and finish my bachelors degree in child psychology. Unfortunately during college I had a set back from PTSD, but that's for another place and time I suppose. Well I've struggled with major depressive disorder, anxiety and panic disorder, and like I said before, PTSD for most of my life. Ever since having my son, therapy, and a slew of medications life's been looking up. Until the past year.\n\nLast year (2016) this month (April) I found out I was pregnant with my second child. We were excited, scared, and very happy. Every emotion you could probably feel, my husband and I both felt it. Unfortunately, pregnancies are very rough on me. My last pregnancy I suffered severe Hyperemesis, and this second pregnancy was no different. It felt harder this time, struggling with a crazy toddler. Some amazing timing happened. One of my great friends was far along in her first pregnancy, my best friend in the whole world was expecting her first baby as well, and wouldn't you know it, my sister-in-law was expecting her first baby as well. Our due date was only a month apart. We were excited to have cousins so close in age. Time passed like normal. I remained healthy, baby remained healthy. \n\nDue to my hyperemesis, I always had extra tests done, extra pokes and fluids. To me, that felt normal because of my last pregnancy. The routine fetus ultrasound exam was done a couple weeks ahead at 18 weeks instead of the typical 20 weeks. In retrospect, I'm glad it was. We found out we were going to have a girl. We were beyond thrilled. A boy and a girl. It felt almost like a dream come true. But I noticed the ultrasound technician was spending a lot of time around the head and neck of the fetus. When I asked the doctor when he came in, he said there were some concerns with the nuchal fold aka the neck fat. The neck was measuring larger than normal, sometimes an indication of T21 or Down's syndrome. That was the only indication of anything wrong. At that point, we opted for the Amnio test that checks for chromosomal defects. There was less than 1% indication for anything to go wrong.\n\nTwo weeks past before we heard back from the geneticist. When we did, they wanted us to come in. I immediately knew something was wrong. My husband and I talked beforehand and decided that if the baby did in fact have T21, we would have an abortion. We waited in a large room for what seemed like hours. The geneticist came in with a few pieces of paper in her hand. She sat down and told us our baby had a partial duplication of the 3rd chromosome's right arm. The piece of paper had the exact numbers. I still have them written around somewhere. She told us some basics about children born with T3, a very, very rare disorder, ranging in difficulties for children. But the way she spoke, almost made it seem like no big deal.\n\nThat was until the doctor came in. He two articles on the disorder. The only two he could find about the fetus' certain duplication. In fact, there was only one other case out there all the way in Italy, and only four others since 1978. He was more honest in the rarity of the T3. He encouraged us to do our own research at home. He made appointments upon appointments for the future. An ultrasound every two weeks or so until birth, a referral to major geneticists in the big city. It was all so overwhelming. At that point, we hadn't made any kind of decision on an abortion. All I knew was I was scared and felt so hopeless.\n\nI did a lot of research. Too much research. Here are some examples of the deformities a person with T3 can be born with. Excessive hair on the face, arms, and back. Stunted growth of arms and legs. Sometimes the inability to ever walk or even hold a cup. The average IQ of 65. Heart defects. Genital deformities. Very short lifespan, as early as two years of age. The list really keeps going and going. With the help of my husband, my mother (who had an abortion many years before I was even born), and my best friend, I decided to have an abortion. I felt like I was making this decision for me, my family, and the baby. I didn't feel like that was a life. She wasn't going to be a constant experiment for doctors.\n\nNow it's October. I'm almost 21 weeks along. I need my doctor's support and advice. This place I was going to was a different OB than where I had my son because we had moved to a different city. This OB is part of a major city hospital. They have many receptionists and it's always super busy. I call my OB and ask to make an appointment as soon as possible. The woman on the phone asked me why and I just said, \"I've been working with Dr. so-and-so about my baby's screenings, and I'd like some support on the matter of having an abortion.\" She then very loudly and rudely says back to me, \"Why do you need to see a doctor if you're just going to have an abortion?!\" I then burst into tears, called her the B-word, and hung up. I'll never forget what she said to me, and how it felt. I filed a complaint to the director of that program as soon as possible.\n\nI never went back. For all they know, I had the baby. I missed probably four appointments. I still get calls from my insurance being told I had a baby months after my due date. I'll never go back there.\n\nAfter getting the proper information from my geneticist, I had to make many phone calls. In my state, the legal limit for an abortion is up to 24 weeks. The Planned Prenthood in my large city only went to 19 weeks. I then found a clinic in another even larger city that went only to 22 weeks. My only other hope would be the largest city in my state all the way on the other side. I was coming up on 22 weeks in only a few short days. They were full and I felt devastated. Thankfully, they called me back in a couple days, and said the doctor would squeeze me in.\n\nThe preparation on the sheet seemed so scary. But the scariest part of all was the cost. My abortion was going to cost $2,500. My husband and I are so broke, we don't even have a savings account. Thankfully, I have wonderful parents. We were told the abortion process would take up to three days, so we also got a hotel. $3,000. I almost couldn't believe it! Zero help or funding for someone in my situation.\n\nNow I'll start my experience in the days it took for the abortion process.\n\nDay 1: I'm scared. I have my husband and my mom there with me for support. We drive up, past protesters with unkind remarks on posters, and their gruesome photographs. I honestly peed myself a little as my husband parked the car. Before opening the door, I see more protesters on the side properties with more signs and flyers. I'm 22 weeks pregnant today. Very, very visibly pregnant. I carried much larger this time around. I won't get into politics/religion on this page, but I'll just say, I believe every woman has the right to choose what they do with their own body and no person or diety can say otherwise. I am a believer in God, and I believe he was with me that day and the next. He helped me raise my head up high, and ignore the people screaming their pleas at me. Mom on one arm, and hubby on the other, we walked right through the doors to the clinic, which are thankfully connected to the back parking lot. \n\nInside, it's very packed. There are people of all ages, race, and sex. Many people have supporters with them, but some don't. I'm one of the lucky ones to have my two allowed with me. I get a whole packet with my schedule for the day. Day one was about 8 hours long. First, I had an ultrasound, so they can take pictures, and so the doctor can see everything. You have the option to see the baby or not. I chose not to. When I got to see her, she was perfect. She was healthy. I didn't want to see her again and think of a sick baby. The ultrasound tech had to of been my age. She was awesome. She made me feel confident.\n\nLater on I had some blood work done, no big deal. I also met with a therapist. She explained the process of what they were going to insert into my cervix to naturally dilate my cervix enough to perform the abortion. She explained that it may take up to two nights, but the doctor would check tomorrow. She explained a bit about the after affects of abortion, the risks, the emotional toll. That last part I really hadn't prepared for. She also sent me with a lot of information on counseling, and some grieving information on having an abortion with a wanted pregnancy, and also information for my grieving husband as well.\n\nEven more later on, I met the doctor and he inserted the little wooden rod. He was very gentle, and very supportive. Everyone was supportive there. It was as if everyone read my file and sympathized with me. There were so many patients, yet I felt like the center of attention. I felt blessed. Then I went back to the hotel, and got prepared to be back at 8am.\n\nDay 2: When I arrived there were no protesters. Seems they only come on the day women seek medical advice. Waited a short period and the doctor checked my cervix. Because I had a previous vaginal birth, my cervix responded well, and the abortion could be performed that day instead of the next. I went down alone to the basement where the abortions were performed. One other woman was having a procedure at the same time as me, and two others were in recovery. I slipped into a gown, had on my special fuzzy socks from my mom, and had a special chair to sit in. While waiting, a really awesome nurse was there for me. She injected me with the local anesthetic, that helps calm nerves and ease a bit of pain. While that worked its thing, I waited.\n\nThen, I went into a room, where the nurse talked with me a while. Gave me a great hug, and helped reassure me that I was doing the right thing. I was asked if a medical student could watch and assist the doctor perform the medical abortion. I said yes. Students have to learn some how, right? While waiting for the doctor, I got another injection that basically put me out. I can only explain it like I was awake, but wasn't too aware. The abortion was quick. I felt a quick release of pressure and it was done. I cried. Of course I cried. I just lost my child. In my haze, I sincerely thanked both the men that performed my abortion. For the next hour I sat in my chair, day dreaming and sipping on a Sprite. Afterwords I headed back to my hotel room.\n\nIt was over. My husband and I cried together, our young son confused, but none the less supportive of his mom and dad. We stayed the last night in the hotel because it was already paid for, and the boys were really enjoying the pool. Honestly, that was a nice distraction. \n\nThis next part may seem graphic for some... For the next two weeks, I bled and bled. I bled as much as I did giving birth to my son. There were large clots and cramping. All normal. The hardest part was the phantom kicks. For four or five days I felt her kick. I knew she wasn't there, but psychologically something stuck. Then my milk came in. I was still nursing my toddler, until being pregnant dried me up. He still liked to suckle, as we were weaning. He still nurses past age three now that my milk is in again. I haven't even had a period yet still.\n\nBut anyways, at two weeks post I had an appointment with the doctor again. I had my blood and urine taken, and an ultrasound to make sure everything looked good on the inside. I was still bleeding at this point, but he reassured me that for how far along I was, it was normal and would stop in another week or less. After that appointment, the whole process was officially over. But not emotionally.\n\nMy husband wanted to name the baby. I didn't. But I let him because he's greiving too. Makayla Rose. Her due date was January 20, 2017. My friends and sister-in-law all had their children. My friends had boys and my sister had a girl. She was born very healthy about a month before I was due. I'm still shook up from that whole part of it. But I prayed. Well I yell-prayed. I told God that he make all those babies healthy, or I was done. My faith would completely run out. But here they are. They are wonderful babies, and that makes me so happy. Jealous? Yes. But I'm only human. I'm just thankful I have my beautiful son.\n\nAnd now it's April again. I was just finding out I was pregnant this time last year. I cry almost daily for the child I will never hold in my arms. The sibling my son will never know. I talked about my pregnancies being hard before. Well, while pregnant this last time, my husband and I seriously talked and decided that this would be our last child because of how seriously sick I get. Now that she's not here, we are unsure of the future and having more children. Personally, I'd like to try to get pregnant again, but I can tell my husband isn't emotionally ready.\n\nA part of me wants to get pregnant again in hopes that her little soul finds her way back to us. I know that's not how the world works, but I can't help feeling that way. My depression is so bad, I'm feeling like I did back when I had to be hospitalized for it. Back when my PTSD was in full swing. I don't regret my abortion. I do feel that was the right decision. But, I still feel remorse. I still have those feelings of \"what if?\"\n\nWe told others that the baby simply had a heart defect and passed. Something so complicated turned so simple.\n\nThanks for reading. I've been wanting to write this all down for a while, and I think I found the perfect place to share.",
    "title": "My late term abortion experience",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1491816645,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "Got a strane email from an older male student but given the context I'm not sure if it's a red flag or not... Backstory for context:\nI am a University student getting my degree and certification in TESOL – Teaching English to speakers of other languages.  I volunteer three-four times a week, two hours each time in a local community college’s ESL classroom.  Each quarter we get old students graduating out of our class (it’s beginning elementary English) and get new students signing up for class.  I speak Spanish and Chinese, as well as English.\n\n\nI always take a special shine (even though I’m not supposed to) to specific students, and certain students really take a shine to me over some of the other classroom assistants.  I like to learn a lot about my students, and usually make an effort to get to class early and stay a little late to get to talk to the students outside of class.  \n\n\nBeginning of my problem:\nLast quarter I had a student, let’s call him Jeng.  He is a late-middle-aged Chinese immigrant, and his wife who I’ll call Xue is also in the class.  He was in our beginning level class, but he’s quite obviously NOT a beginning level English speaker.  He’s damn near fluent, but he just has trouble writing, so needed a quarter in a low level class to catch his writing up with his speaking.  Jeng was always so jovial.  He was very chatty with us, the teachers and the other students.  He always had the most to say, and sometimes could go off on random but entertaining conversation tangents.\n\n\nJeng was VERY complimentary.  To everyone, but I felt like he ‘picked’ on me a lot.  (I say picked but it wasn’t a bad thing, though it was sometimes awkward).  He started out just saying the usual, that I was smart, that I was a good teacher, that I was very helpful.  Then he found out that I speak Chinese, and he would compliment me on my accent, my pronunciation, my vocabulary choice if he ever heard me speaking it.  I’m not a very verbose Chinese speaker though, my vocab is pretty limited, so he would always offer to give me Chinese lessons after class.  \n\n\nThen the compliments got…strange.  He would compliment me on my ‘fair’ skin.  He found out I’m mixed race and then kept telling me I was beautiful and fair for my race (I am very light skinned for my mix but….it’s just a weird compliment to receive, it’s not something I usually take as a compliment but I knew he was just trying to be nice.)  Then he asked me about my ‘white’ side, and I said my ‘white’ side is Dutch, because I tell everyone this, it’s not a secret and I’m not bashful about it.  Then, the next class, he told me ‘You have a very regal air about you, like you could be a fair Dutch queen.’  \n\n\nHonestly I felt like this compliment was way over the top, but what was I supposed to do?  I just tried to deflect in my usual self deprecating way, but he kept insisting for days that I looked like a European queen, or European Princess, or ‘Aristocrat.’  But the thing is, his wife was with him every time he would compliment me, and she would smile and nod, though she wasn’t big on talking (her speaking level was lower than his.)  So, I always got the feeling that these kinds of compliments were somewhat normal to them, and not anything weird.  So I let it go, and chalked it up to a clash of cultures, which happens A LOT in ESL classrooms.  \n\n\nMy current problem:\nI always give out an email address to my students so that they can email me when I’m not in class for homework help, since I assign a lot of them specific homeworks.  But today I got an email from Jeng, who isn’t even in my classroom this quarter, and said he and his wife ‘really like me’.  He wrote ‘My son is coming from China and I think it is good that you meet him!  Then, maybe I can give you Chinese lessons!’ \n\n\nAm I overthinking this?  Is this weird?  Or is this just a little bit overzealously friendly?  I’ve never been to China myself, and so I don’t know if this is a common sort of practice?  My friend joked that maybe he’s trying to set his son up with an American girl but I don’t think that’s the case, I’m pretty sure Jeng told me once his son had a wife or girlfriend or something.  The thing is, if this were a white guy in his early 50s?  I’d probably report him to someone.  But it’s this sweet friendly old Chinese man and his wife, so I feel like there might be a cultural disconnect happening here.\n\n\nI just need someone to tell me ‘no you’re not crazy for feeling weird’ or ‘oh you’re crazy this is a totally normal type of interaction in the context of Northern Chinese culture’ I guess.  What do you ladies think?  I feel like my ‘lady defense’ shield is always up but maybe it shouldn’t be?",
    "title": "Got a strane email from an older male student but given the context I'm not sure if it's a red flag or not...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485592009,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "How to navigate this situation at work before I leave on good terms? I am currently a female in a male dominated industry and could use some women advice on this situation.  My mentor I used to date for a month along time ago but we’re fine now.  My director I’ve had on and off issues with but we worked through them with flying colors in the past.  And my current manager did or does have a crush on me as was married but I don’t interact with him much as he is in another country. \n\n\nThere was a mix up in my bonus when I first started and I never received it.  I talked to HR about it and my boss and he came back with they could probably give me vacation.  This was about nine months ago.  In the mist of this, I also talked about my salary and it being too low.  He said we would relook at it in Jul.  \n\n\nCome Jul one of my peers is now my boss and lives in another country and was not part of these conversations and my old boss is now our director.  We have a hard time meeting up so we don’t until Oct.  I ask for a promotion in Oct and our director is on board after a trial period but my current boss has some concerns which I have no idea what they are.  About this time I am planning on leaving but my mentor, who is a contractor but also knows these guys, advises me to stay on since I am so close to the promotion. I, however, want at least the pay raise or SOMETHING to show they can keep their word.  I ask for an decision my missed out bonus, a revaluations of my compensation, and lastly a date on when we can see how I do in my trial for a proportion in writing because they kept on leading me on.\n\n\nIn the meeting I get completely side lined.  It was like the minute I put my foot down, I got thrown up the wall.  Our director, comes back with a letter from HR saying I was not qualified for a bonus because of my hiring period.  This was completely different line of events than from when I heard feedback in Feb.  My director told me “the HR guy messed up on my paperwork” and that “they could give me vacation”.  Meanwhile my current manager is on the line and honestly doesn’t seem to be supportive in anyway.  The letter I get from HR says they are working on increasing my pay and it has been adjusted properly.  I am looking at this and I am in a profession which requires a good math brain, this is bad math made to look like I got some big percentage bump.\n\n\nI then talked to my mentor on the phone about it and I was pissed at my director.  I felt betrayed by my director.  He in the past had been there for me and came through.  I feel ashamed like I did something wrong and fear this will come back on me like I AM the one in the wrong.\n\n\nMy company is going through some financial issues and others have had issues with being pushed around.  I think at least 50% of the office has left, been fired or laid off.  I get the environment but I just never thought it would happen in our group. I thought my director had my back and now I fear my current manager thinks I am a liar.   \nI’m leaving now obviously but am waiting for the right opportunity to come along so I still work there.  I’ve read online, even with a bad employer, you should leave on good terms which I plan to.  I do want to maintain my pride, my confidence, my legacy, and my reputation.  I’ve worked hard at this job and I’ve done a good job.  I’m might work with either of these people again in my career, what advise can you give me?",
    "title": "How to navigate this situation at work before I leave on good terms?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1483298635,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "If the ACGME Were Like the NCAA... Headlines might read:\n\n[Southern California medical school and teaching hospital caught up in a massive scandal](http://www.espn.com/mens-college-basketball/story/_/id/20824193/ncaa-basketball-coaches-10-charged-fraud-corruption).   \n\nResidency directors were arrested by the FBI for bribery and wire fraud related to bringing in the \"most sought after\" medical students and residents, and attempting to offer kickbacks to several major medical supply companies for their endorsements.  Incoming residents were offered tens of thousands of dollars to secure their Letter of Intent to the institution.  A school official was quoted as saying \"We were just about to land some really huge endorsements of 'blue chip' students and first-year residents\".    \n\n[Texas medical school and teaching hospital locker room for residents now a palace of medicine](http://www.expressnews.com/sports/college_sports/longhorns/article/Longhorns-locker-room-now-a-football-palace-11738209.php)  \n\nThere are 126 of them, each constructed of stainless steel, adorned with milky white doors and Bevo insignias. A 43-inch television hangs atop every newly installed locker like a hi-tech crown. On Aug. 2, the Residency Director finally welcomed his new residents to the swanky new digs. Residents flooded through the entrance and gasped. Or roared. Or stared in stunned silence. The chief of Medicine was quoted as saying \"It’s about luring the best students and residents in the nation to Austin. It’s about wowing colleges. It’s about winning the arms race.\"  \n\nThis coming after [Oregon spent almost $68 million on their new medical facility, complete with a cafeteria and barber shop for residents](https://www.sbnation.com/college-football/2013/7/31/4574556/oregon-football-building-new), the faculty there vowed to \"tear it all down and go even bigger just because we can\".  A letter has already been drafted to Medical School boosters asking to help raise almost another $100 million to \"stick it to those dirty Longhorns\".  \n\n[In other recent news, the ACGME settled with EA sports for featuring likenesses of residents](https://www.cbssports.com/college-football/news/college-athletes-react-on-twitter-after-receiving-ea-sports-lawsuit-checks/) in popular video games such as \"Operation\", and \"Emergency Room 2015\".  \n\n[Another scandal at a Southern California medical school](http://www.live5news.com/story/17857928/ncaa-to-announce-penalties-against-south-carolina) and teaching hospital unfolded a few years ago, related to \"improper benefits\" and overworking of the Residents.  Facing potential massive sanctions from the ACGME, USC self imposed penalties of:  \n\n* A 10% reduction of attending salaries to be transferred to the Residents \n* A 5% reduction in Resident work hours with no pay cut  \n* Public reprimand and censure of the school and hospital\n* An increase of 10 residency slots  \n* A Match process time reduced by 15%",
    "title": "If the ACGME Were Like the NCAA...",
    "subreddit": "medicine",
    "timestamp": 1506607885,
    "score": 42,
    "keyword": "mixed race director"
  },
  {
    "text": "[Inner city] [US History/8th grade] - Black vs African-American? I'm white. For the past four years, I've been teaching 8th grade in a school where 90% of the students are black. I've only taught ELA, but when something comes up regarding race and I say \"black\", someone will cheekily say \"it's AFRICAN-AMERICAN!\", or when I say \"African-American,\" someone will cheekily say \"Just say BLACK, I'm not from Africa!\"\n\nIn reality, I just mix it up based on what sounds better in the given sentence. I probably say \"black\" more because African-American is hard to say with a lot of syllables. But I have some sensitive students that take themselves pretty seriously, so I'm trying to avoid angry parent phone calls this year.\n\nThis is my first time teaching U.S. history so race is going to come up a lot. I want to explain from the start what I just said here, but I really have no right to tell them \"You shouldn't be offended by black!\" or \"Most of you aren't even from Africa, so I'm not using African-American!\"\n\nAny advice? Should I just accept there will be complaints either way and ignore them like I do with most petty complaints?\n\nOther info if it matters:\n\n* In a major northeast city\n\n* Most teachers are white\n\n* Right on the border of a very white neighborhood, so most kids are pretty racially desensitized\n\n* About two kids a year will angrily call me a cracker, so racism is still there a bit",
    "title": "[Inner city] [US History/8th grade] - Black vs African-American?",
    "subreddit": "Teachers",
    "timestamp": 1502968943,
    "score": 12,
    "keyword": "mixed race director"
  },
  {
    "text": "update on getting the director of engineering position instead of DBA one edit: thank you for all your kind responses. i am as disappointed as youare.\n\ni am making an edit to notify you with an additional update.\n\nearly this morning i had a voicemail from the manager himself.\nhe was apologizeing and saying that therecruiter had mixed up the dba and\ndirector salary profiles and mistakenly told me the salary range for the dba\nposition because he was under the impression that was what i was applying and\ninterviewing for. (yeah right.)\n\nunfortunately, the 180k-200k was still a 'clerical error' on oneof their\nhr people's part (interestingly a 'clerical error' that\npersisted until yesterday) and that the real range in the budget for the director\nrole was 80k - 95k, but hes going to work with hr and try to get me the\nmaximum possible. he said they usually never pay that high and even the \ncto there isn't making that much. \n\nhe told me that i sould get back to him ASAP.\n\nwhen i opened my email just a few minutes ago here's what i found:\n\nhttps://i.imgur.com/WLfOf03.png\n\nive emailed him back tell him im not interested any longer and gently hinted that\ni prefer to work with people that a little bit more mature,\nand hes yet to respond.\n\n(ive redacted it to preserve anonymity.)\n\ni really am holding my tongue back on this one and there\nare some choice words i want to say but i dont want to get blackballed\nor banned from anywhere so thank you all for the very helpful advice,\nsadly it didnt work out but i guess it is what it is\n\n------------------------------------------------------------------\nhere is the link to the old post: https://www.reddit.com/r/cscareerquestions/comments/7kt7mu/was_given_incorrect_assessment_but_did_it_anyways/\n\nI bring some good and bad news:\n\nthe good: they said they'll be very interested and gave me tickets to fly me out to nyc from des moines plus 1 night at the westin in times square and a $150 allowance to travel around manhattan and see some things during the day on saturday.\n\nthen I came in at 6 pm, interviewed and they asked me several round of various technical and math questions -- but nothing like the leetcode challeng e. then that transitioned in to some management and people skills questions, but turned in mainly things about my experience and my stories over the 47 years ive worked.\n\nthat went on for a total of 2 hours, then we went to a fancy restaurant for a late dinner and then the manager and a lead engineer and i talked even more.\n\nthat was on friday. we wished each happy christmas and new years and i left feeling very good. i flew back on saturday.\n\nthe bad news: the recruiter called me today and told me that i got the job but unfortunately the salary range was 'mistated' and it is really 60k to 75k, instead of the 180k-200k base salary they said before, and they will be more than happy to give me 75k.\n\ni said whatwas the $180-200k range that was communicated by both him and the manager during the interview and discussionsprior?\n\nhe said, \"Soo, sorry, Mr. SG, that was a clerical error. Heh. My deepest apologies, Mr. SG. Sorry for the inconvenience. Heh. I'm going to email you the docusign-\"\n\ni said no thanks and then he said, \"I can ask mymanager if he can do eigh-\" to which I said, \"no thank you, im not interested\", wished them the best of luck, said goodbye and hung up.\n\nhe called back 15 minutes later but i didn't pick up. \n\ni dont know what to think :(\n\nthanks for listening and the great advice anyways. i appreciatei t.\n\nalso i want to give thanks to the very nice person who gilded me. Thank you",
    "title": "update on getting the director of engineering position instead of DBA one",
    "subreddit": "cscareerquestions",
    "timestamp": 1514431430,
    "score": 118,
    "keyword": "mixed race director"
  },
  {
    "text": "Did I fuck up in this strange situation when applying for a job? A few months ago I applied for a job at a large Telecom company in the US for a software engineering position. A good friend of mine also applied for the same team but for a senior position, since he was also interested in this particular group. After two phone interviews and two on-site interviews over a few months things were looking great. The hiring manager liked me and so did the director. This is where things got weird.\n\nLast week I got an email from the HR rep and he told me to send him some information that he needed. I called him the next morning to ask him some questions about the information he needed and as soon as I greeted him he told me that I have an offer with the company. He told me about the compensation which was about double what I currently make in total compensation. Obviously I was ecstatic! However two weird things happened: the first was that he got my email wrong. I corrected him with the right email. The second was that he told me my hiring manager was the boss of the one it was supposed to be, who is the director of the department. I had an interview with her as well and I thought he just made a small mistake and brushed it off. He asked if I wanted to accept and I said I'd need to see the formal offer first so he said he would send it in the coming days but that he would send an email with some basic information about the compensation in the meantime.\n\nThe following morning I realized what had happened. They accidentally gave me the wrong offer. For some reason the HR rep mistook me for my friend who also applied there and he gave me his email by accident, which I didn't realize until the following morning because I was so excited to get the offer. I called the HR rep back to tell him of the mistake and he said he was very sorry and that they gave me the offer of a member of the senior management by mistake and that they were still working on my offer.\n\nSince the HR rep gave me my friends email I called him to let him know about the mix-up. I also emailed my hiring manager's boss (who the HR rep said would be my manager) and explained that I think there was a mixup and that I potentially received the offer of my friend since the HR rep gave me his email.\n\nThe director of the department, who is my actual hiring managers boss, emailed me back and acknowledged the HR reps mistake but also said it was extremely inappropriate of me to assume that they sent me another potential candidates offer... It seemed like they were trying to pin the blame on me.\n\nAt this point I emailed her back apologizing that I named the candidate by name... But I also mentioned that I received my friends email from the HR rep over the phone.\n\nIt's been 3 days now and the HR rep will no longer answer my phone calls and the director did not answer my email.\n\nI'm wondering, did I fuck up here? I don't feel like I did anything wrong but both my parents and my friend think I fucked up... I was really excited to work here as well and I feel like my chances are now ruined...\n\nEdit: Typos",
    "title": "Did I fuck up in this strange situation when applying for a job?",
    "subreddit": "cscareerquestions",
    "timestamp": 1500780262,
    "score": 8,
    "keyword": "mixed race director"
  },
  {
    "text": "MTax or JD - career advice Hi Reddit,\n\nI'm hoping to get a bit of career advice. I've been with PwC in Canada for about 3.5 years in their US/Canadian corporate group. I will be moving to a major city in US and joining another Big 4 in the corporate/partnership tax group (compliance, consulting, provisions) at the end of May. I will be completing my CPA shortly. \n\nI have been looking at a few education options after I complete my CPA. In particular, I've looked at the following:\n\n1. Master of Tax at Golden Gate University (online) - generally well regarded/known by employers in the area, part-time program that can be finished in 4-5 years. I'm unsure of the time commitment, but I imagine I should be able to manage 2 courses a year (taking the semester during busy season off). I get the feeling that this program is geared toward people doing compliance and maybe a bit of consulting?\n\n2. JD at Concord Law School - online JD program that would allow me to practice law in California. Time commitment is estimated at 25-30 hours per week, which seems like it would be almost impossible to manage with work. I do like the idea of getting a JD, but it's hard to see why taking courses on criminal law would be applicable to tax. Would it be better for my tax career to do something more focused? It's unlikely that I would want to practice law in the future.\n\n3. Master of Studies in Law (MSL) in Taxation at NYU (online) - I have an interest in both tax and law, so this seems to me like it would be a mix between options 1 and 2. However, looking at the course descriptions, they seem similar to the Master of Tax program at Golden Gate. Would there be any difference in employers eyes between a MTax and the MSL in Taxation? Being from NYU, I imagine that it would be more highly regarded?\n\nMy career goals are a bit undecided at the moment, as I have interest in doing M&A type work (structuring deals, etc.), or international/cross-border given my background in Canadian and US work. I would also be interested in industry work, in a senior manager or director of tax role. \n\nI'm interested in thoughts as to what would be the best program to take to advance my career in tax, as well as any other general advice. Any program would have to be online as I would like to keep working during my studies, and so that my employer can pay for it. :)",
    "title": "MTax or JD - career advice",
    "subreddit": "Accounting",
    "timestamp": 1494978057,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Does anybody here have a sibling who contributes to the Black dating issues? I mean the typical issues like the idea that non Black women/men are better than Black people. My brother is this way. He's 32 years old and single and has really low self esteem so I feel bad for him in that way and race issues towards black men bother him a lot. But when I'm with him, he stares at non Black women *nonstop* like his entire body and head will turn so he can check out a woman walking by but a Black female walks by and it's almost like he tries to look away. He proudly tells his friends (none of them are Black) that he's \"pickier with Black girls\" and that she'd have to be a perfect 10 for him to notice... but he's not exactly the perfect 10 type of guy, and his standards for other races are so low. He will date very homely, overweight or just bland looking White, Latina and Asian women. Even then, he doesn't attract many women because he doesn't take care of himself much, physically & that adds to his low self esteem. He also stares at couples who are interracial with a Black man a lot. I tried to hook him up with my friend but I felt bad because she was the one who asked and she's black/brown skinned and I knew he'd not like that.  I'm a Black female, it just feels disrespectful in a way, like his mind is so twisted when it comes to race and I don't understand it other than deep insecurity. \n\n&nbsp;\n\nHe also says the \"I think she's mixed\" thing when he finds a Black girl he finds attractive, which makes me cringe. Our mother is dark skinned, our dad is multiracial and very light but loves dark skinned women like my mom. My brother is darker like my mom but myself and my other siblings are all lighter tones. He seems the most affected by his race in a negative way. We also grew up in a majority white city but this issue seems beyond that. Should I just continue to ignore this? A part of me just wants to pick his brain and ask him *why* he seems to hate Black women so much... I've been reading up more on Black female issues, especially colorism and they're annoying me, so to have a brother who so openly adds to them is driving me insane. But then I feel like I can't change him, he's allowed to have his thoughts... idk. Anybody experience similar? Any suggestions?",
    "title": "Does anybody here have a sibling who contributes to the Black dating issues?",
    "subreddit": "blackladies",
    "timestamp": 1501346838,
    "score": 43,
    "keyword": "mixed race director"
  },
  {
    "text": "Telling our own stories, and our short film 'Ella\" Hi there,\n\nMy name is Dan Chen, and I'm a director and cinematographer. You may have seen a post about our film \"Ella\" a few weeks ago, when we had just launched our Kickstarter. I'm happy to announce that we've reached our funding goal, and we're going full steam ahead!\n\nIn recent years, I recall a conversation I had with several other friends who work in film. We came to the conclusion that any American movie with an Asian protagonist would most likely be categorized as an \"Asian\" movie, or a special interest film.\n\n\"What if I wanted to make something like Dazed and Confused, but the main characters just so happen to be Asian American?\"\n\n\"It's still going to be an Asian movie.\"\n\nThe question stayed with me. Maybe I hadn't fully embraced my own race and identity yet. But I didn't want to make a special interest movie. I just wanted to make a movie.\n\nIt took a lot of inspiration to get to making \"Ella.\" Part of it was seeing artistic, successful minority representation in media, with projects like Master of None and Moonlight paving the way. Another factor was my friend Doug Kim, a producer on our short, writing and starring in a pilot we worked on together, which dealt with his real struggles as an Asian American actor in a courageous and comedic way. Finally, I realized that any character driven story needs to take race into consideration, just as it should explore sex, class, age, and other very real factors that affect who we are and who we become.\n\nIn my view, we can't wait for Hollywood to cast Asian Americans in an interesting, complex way, although putting pressure on them can certainly make them reconsider their actions. We need more Asian creators, just as we need more black creators, more Hispanic creators, and most obviously, more women of all kinds in Hollywood. Because these creators will understand the importance and significance of representation.\n\nPlus they'd have experiences and perspectives that we haven't seen yet. That's not just good social justice... that's good entertainment.\n\nSo this short film is my humble contribution (and if all goes well, the first of many contributions). I'd love support, critique, or sharing if you dig the project. We're currently going for our first stretch goal which would afford us the opportunity to hire a great casting director to help us find our second lead, who'd play a fourteen year old Chinese boy who's seeking acceptance in his small Midwestern town.\n\n[Ella, a new coming of age story in the Midwest](https://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid)\n\nI'm glad to be a subscriber to the community, and look forward to sharing more dialogues and upvotes with ya'll.\n\ncheers,\nDan",
    "title": "Telling our own stories, and our short film 'Ella\"",
    "subreddit": "asianamerican",
    "timestamp": 1490220529,
    "score": 23,
    "keyword": "mixed race director"
  },
  {
    "text": "Enrollments, budgets fall short at universities known for ‘social justice warfare’  more people are getting the message. not attending these indoctrination centres is more effective. less students less revenue.\n............................................\n\nhttp://www.washingtontimes.com/news/2017/sep/14/enrollment-drops-at-schools-known-for-social-justi/\n\nUniversities known for being hotbeds of campus protest and liberal activism are struggling with declining enrollments and budget shortfalls, and higher education analysts say that’s no coincidence.\nTake Oberlin College. According to a document leaked to The Oberlin Review, the school’s student newspaper, the small liberal arts college famous for social justice hoaxes has had trouble attracting and retaining students, missing this year’s enrollment mark by 80 and racking up a $5 million budget deficit in the process.\nWilliam A. Jacobson, a professor at Cornell Law School who runs the Legal Insurrection blog, said the “most obvious culprit” in Oberlin’s dwindling admissions is “relentless social justice warfare.”\n\n“Social justice warfare at Oberlin has been more intense and sustained over a longer period of time than at most schools, and has come to define Oberlin in the media,” Mr. Jacobson said. “The resulting mockery and derision, even in liberal publications, has damaged the Oberlin brand.”\nSurveys support the notion that, in the era of Trump, conservatives have become more skeptical about the value of a college degree.\nThe polarizing presidential election was felt in the dip in applicants at some top-tier colleges such as Ohio’s Kenyon College.\n\n“This is a year in which you were vulnerable if you were a small liberal arts college in a rural red state and you attract a significant portion of your student body from the East Coast or West Coast, which would certainly be the case with Kenyon,” Diane Anci, Kenyon’s vice president of enrollment and dean of admissions and financial aid, told the Ohio school’s Kenyon Collegian newspaper.\nA study published by the Washington-based Pew Research Center in July found that just 36 percent of Republicans believe colleges and universities have a positive effect on the country, down from 54 percent two years ago.\nGallup released a poll in August that found just 33 percent of Republican and Republican-leaning respondents had a “great deal or quite a lot of confidence in higher education.” Sixty-seven percent said they have “some or very little” confidence in academia.\nHigh school counselors report that, in the past few years, parents have been more likely to express concern about sending their children to schools with progressive reputations.\n“Many won’t consider Oberlin or Wesleyan, and Brown is completely off the table,” one counselor told Inside Higher Education in June.\n\nThe problem may be especially pronounced among the nation’s heartland. Inside Higher Education reports that several prestigious, small liberal arts colleges in the Midwest have missed their enrollment marks this year.\nSome college administrators have taken notice. According to Inside Higher Education’s annual survey, 52 percent of admissions directors from public colleges and 28 percent from private ones said they were stepping up their recruitment of students from rural areas in the wake of the presidential race.\nDeclining enrollments have previously been observed at colleges and universities that became notorious for chaotic campus activism, including the University of Missouri and Evergreen State College.\nBy some estimates, enrollment at the former is down 35 percent since fall 2015, when student protests helped launch the Black Lives Matter movement.\nMeanwhile, Evergreen faces a $2.1 million budget shortfall this year since students took over the campus last spring, barricading themselves in the library, berating administrators on a regular basis and forcing one dissenting professor to teach off campus out of fear for his safety.\nA spokesperson for Oberlin College did not respond to a request for comment from The Washington Times.\nThe school’s problems cannot be traced to a single incident but to several.\nIn February 2013, mass hysteria ensued after racist and anti-Semitic flyers and graffiti began to appear all over campus. Classes were canceled, meetings were held and students began to see racism around every corner, including when someone reported seeing a member of the Ku Klux Klan on campus. It turned out to be a woman walking around wrapped in a blanket to keep warm.\nNot only that, the perpetrators behind the racist paraphernalia turned out to be two progressive students, one of whom was confirmed to be an Obama supporter, trying to get a reaction out of their classmates and the administration.\nRather than admit the whole thing was a hoax and move on, the Oberlin administration doubled down on a social justice agenda, including the implementation of a privilege and oppression “reorientation” for first-year students.\nIn the ensuing years, Oberlin students would go on to make frequent demands of the university, ranging from the end of culturally appropriated meals at the dining hall, such as General Tso’s chicken and sushi, to the elimination of grades below a C.\nIn 2015, after the University of Missouri protests, the Oberlin Black Student Union issued a 14-page letter making 50 demands of the administration. They included exclusive “safe spaces” for black students and the elimination of graduation requirements for classes in Western civilization.\nLast November, Oberlin students targeted Gibson’s Bakery, a beloved store in Oberlin, Ohio, after an employee called police when he saw someone attempting to shoplift by concealing two bottles of wine under his jacket. The accused shoplifter turned out to be a black Oberlin student.\nThe Black Student Union, Oberlin Student Senate and College Democrats spearheaded a boycott of the bakery and organized protests outside of the store. Even the Oberlin administration, responding to calls from Black Lives Matter supporters on campus, stopped purchasing goods from the bakery.\nThree students involved in the incident ended up pleading guilty to attempted theft and aggravated trespassing. As part of a plea deal, the students acknowledged that the bakery’s actions were “not racially motivated” and that the store was “merely trying to prevent an underage sale.”\nMost of the enrollment deficit at Oberlin came from a smaller-than-expected freshman class, which totaled 742 instead of a projected 805.\nPeter Wood, president of the National Association of Scholars, said that drop-off is more serious than it may appear.\n“That doesn’t sound like an astonishing number of people not coming, but weighed on a percentage basis, that’s a huge drop in just one year,” Mr. Wood said. “And Oberlin has for some time been struggling to make its classes. This wasn’t just some negligence: ‘Oh, we didn’t realize that we had to try harder to get students.’ They’ve been trying really hard to get students, and students just aren’t coming.”\nHe said Oberlin can easily recoup the $5 million deficit by cutting the “apparatus of political correctness” that has swelled in the past several years. When that happens, he said, it will be a sign that the school is serious about reform.\n“The signal that I would look for is when they begin to divest from the large number of personnel who are employed wholly because of their political orientations,” he said. “When that happens, I think we will have seen a college that has decided to reposition itself in the market. Until then, it’s all just show.”",
    "title": "Enrollments, budgets fall short at universities known for ‘social justice warfare’",
    "subreddit": "MensRights",
    "timestamp": 1505503566,
    "score": 89,
    "keyword": "mixed race director"
  },
  {
    "text": "A Socialist Defense of Gender Roles Edit: wow.  I've never seen such quick downvotes.   Remember that this is supposed to be a discussion forum not an ideological purity contest.   Only downvote if you think this post has contributed nothing to the debate.   \n\nEdit 2: I give up.   Enjoy the decline.   \n\nUnusual and long post here.    The non-socialist majority may enjoy it for the stats and the un-pc quotes by figures like George Orwell, Nicola Tesla and Christopher Hitchens.  \n\nMRA's are right to suggest that men got a raw deal under traditionalism.    I'm not suggesting we go back to a situation where e.g. a man be forced to pay his wives' debts.   Or that people be forced into certain roles.   I'm suggesting that the majority of men and women would be happier in a traditionalist arrangement: the woman takes care of the kids and home and the man is respected and honored for his contributions in turn.   Nor would this prevent women from achieving status in the male sphere.   It would just be more unusual since women would be doing the more important work of raising children.\n\nA return to a traditional conservative lifestyle is impossible absent collapse.   Female liberation has [never](https://archive.org/details/b20442580) been internally reversed.   Unfortunately it is also incompatible with large inequalities due to female hypergamy.    The majority of men are left out in the cold, so have no impetus to work.  Therefore a combination of men's rights and socialism are required if civilization is to continue.   This will naturally lead to men and women embracing traditional gender roles.    The only other alternative is a return to patriarchy, however that is exceedingly unlikely for reasons JD Unwin explains in the above link.   \n\nI was recently watching a documentary about a financial depression in the late 19th century.   A (female) professor noted that \"many women were forced\" into the workplace.   It struck me as an odd turn of phrase, since feminists claim that women weren't \"allowed\" to work back then.   Turns out this is false.   Karen Straughan notes that there are records e.g. of female blacksmiths going back to the middle ages.   Women could work, they just didn't want to.   Why would they?   For 90 percent of the population working sucked.   It still does.  Also, it's hard to work when you're pregnant.   \n\nThe only way feminists can get away with characterizing the traditional female sphere as a prison is by lying about it.   In truth, women could own [property](https://www.cambridge.org/core/journals/continuity-and-change/article/favoured-or-oppressed-married-women-property-and-coverture-in-england-16601800/617F23DD2D64A036C58E0BF7D56F89BE), wife-beating was severely [punished](https://www.debunker.com/texts/ruleofthumb.html), and women were respected for their role in society.    Alexis de Tocqueville commented on the essential equality of the male and female spheres in Democracy in America (1840) :\n\n“Americans,” he said, did not think that men and women should perform the same tasks, “but they show an equal regard for both their perspective parts; and though their lot is different, they consider both of them as being of equal value.”\n\nWomen have ALWAYS been greatly respected by men for being mothers and nurturers.   What is a more important job than raising a child?   It was only a small number of envious man-haters that decided otherwise.   \n\nThe feminist movement appears to have arisen not do to \"oppression\" but boredom.   Rich women lived lives of luxury most men could only dream of, but they were envious of the social status of their doctor and lawyer male relatives.   They wanted the privileges of both the female and male spheres.  They wanted to \"have it all\".\n\nA number of intellectuals expressed concern, though not as many as you'd expect considering the enormity of what feminists were proposing.   The socialist Earnest Belford Bax claimed that women were already the [privileged sex](https://archive.org/details/fraudoffeminism00baxerich).    The socialist Mother Jones, who spent most of her time organizing male coal miners and fighting child labor, considered it absurd that women could be \"liberated\" by work.   And Nicola Tesla, one of the most brilliant men who ever lived, predicted that \"equality\" between men and women would quickly lead to female superiority and massive social dysfunction: \n\n\"This struggle of the human female toward sex equality will end in a new sex order, with the female as superior. The modern woman, who anticipates in merely superficial phenomena the advancement of her sex, is but a surface symptom of something deeper and more potent fermenting in the bosom of the race.\"\n\nThe Catholic GK Chesterton, who embraced socialist ideas about land reform, suggested that mixing the traditional male and female spheres would be a disaster for society.   \n\nThis [article](http://gkcdaily.blogspot.com/2015/03/chesterton-notorious-anti-feminist.html) provides a decent summary.   \n\n>Woman is wrong, he considers, to try to adapt herself to society by making a man of herself. The contrary should come about—Society should adapt itself to womanhood by becoming gentler. To Feminists, he acknowledges that women undergo a revolting tyranny in factories; but he wanted to destroy the factories, while they, he felt, were content with destroying womanhood.\n\n\"The virtues of the Family and Home, due to free choice and limitation, form the basic cell of the social organism. Banish the spirit of Home, and you suppress the very possibility of a sanely constituted society.\"\n\nChesterton advocated wealth redistribution to the poor so that women wouldn't have to work.   George Orwell, who despite popular belief was a socialist, recommended the same: \n\n\"Far more drastically than anyone has proposed hitherto, taxation will have to be graded so as to encourage child-bearing and to save women with young children from being obliged to work outside the home (CW 16, 223).\"\n\n\"This, of course, is a subject of great interest in India, and roughly what we want discussed is how far women benefit by escaping from home and whether in the long run it is desirable for them to undertake the same work as men” (CW 13, 474).\n\nFeminists set about to destroy the \"patriarchal\" family, but they had nothing to replace it with.   We are not living in hunter-gatherer societies; the idea that the \"whole tribe\" would raise children has amounted instead to children being stuck all day in daycares and classrooms.   Women aren't able to spend as much time with their children as they'd like: they're too busy working.   They have replaced loving husbands with asshole bosses.   In a tragic irony, the \"new American dream\" for women is to become a [housewife](https://www.forbes.com/sites/meghancasserly/2012/09/12/is-opting-out-the-new-american-dream-for-working-women/#3c1b00ad623a).     \n\nThe single mother experiment has been a disaster.    Feminists assumed that men were only needed for their wallets, whereas it turns out that that males are [crucial](http://www.reviewjournal.com/life/family/experts-say-father-s-involvement-pivotal-proper-child-rearing) at every stage of child rearing.   The statistics for children raised by single mothers are nothing short of horrific.  \n\nWhat about men?   Men no longer feel like they have a role to fulfill, so are increasingly dropping out of society.   Suicides are at all time high.   Drug and alcohol addiction is rampant.    \n\nBy privileging girls in school and women in work, young women are now out-earning young men.   This leads to women being unable to find what they consider suitable partners due to hypergamy.  \n\nWomen have become ever more hateful and spiteful toward men.   Part of this is due to feminist lies, part of this is due to being forced to compete with the opposite sex.   The sexes aren't supposed to compete with one another; that's not how we were designed.   We're supposed to be complementary.  Since male leaders don't want to compete with women, they gave them ever more privileges at the expense of men.    So much for patriarchy theory.  \n\nAnd now we find the reason why being a housewife is the new American dream: Research has found that stay-at-home mothers are [happier](http://www.dailymail.co.uk/news/article-3634473/The-job-makes-happiest-Housewife-Survey-finds-stay-home-mothers-satisfied-profession.html) than those who work (female unhappiness is actually at an all time high).   So the whole feminist experiment was a gigantic waste of time.   More than that, it was a potentially fatal social experiment.    \n\nWomen who don't have children are more likely to get [cancer](http://www.everydayhealth.com/womens-health-specialist/childless-women-and-cancer.aspx).   The same applies to women who wait until their thirties to have children (the current trend).    Fewer and fewer women are giving birth.   Since population levels are unsustainable, more and more immigration is required.   This, in turn, leads to increased mistrust in communities.    The ruling class is able to play off workers against one another with ease, preventing solidarity.  \n\nMale creative genius is ignored and suppressed instead of being nurtured.    And for what?   So women can become unhappier?  \n\nIn The Red Pill, Warren Farrell emphasizes flexibility of roles.   But women don't seem to want flexibility for men.   They become resentful of stay at home dads.   They recoil at men expressing emotions.   They refuse to \"date down.\"   They demand all of their traditional privileges.  \n\nThe association between communism and feminism arose mostly from Marx's benefactor Friedrich Engels.   However it is interesting that many of the early socialists rejected his views on the subject and had no problem with traditional gender roles.    They didn't think women should be *forced* to be housewives, but as mentioned, only rich women were privileged enough to conceive of work as liberation.   \n\nFeminists have re-engineered society but it has not helped either men or women.   In the Israeli Kibbutz, which embraces an anarchic form of social organization, people were not given any gender roles but naturally became the most traditionalist society in the world.   This leads me to believe that the vast majority of both men and women prefer behaving like men and women.   We have created a society that ignores the happiness of the 99% and caters to outliers among both sexes -- in particular lesbians.    These outliers should not be oppressed, but they shouldn't dictate how the rest of us behave either.  \n\nIf it is respect and independence women are after, men's rights combined with traditional gender roles would allow them to have both.   They would be respected as mothers, would still be allowed to enter the male sphere if they wished (though only on equal terms -- no feminist bullshit), and wouldn't have to suffer being wage slaves.   They would not be able to simply divorce the man and take the kids and his money, so marriages would remain intact.   Men would likewise be able to act as men again, without being demonized; they would be respected and honored for the work they do to maintain civilization, and would have all the rights that women currently have.   \n\nEgalitarian economics would ensure that the majority of men not be excluded from romance due to hypergamy.   \n\nBonus: Christopher Hitchens: Women shouldn't have to work.  \n\nhttps://www.youtube.com/watch?v=TQas34criFo",
    "title": "A Socialist Defense of Gender Roles",
    "subreddit": "MensRights",
    "timestamp": 1489258273,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n\"**Consciousness-raising: A Constant Change of Heart**\n\nFeminists are made, not born. One does not become an advocate of feminist politics simply by having the privilege of having been born female. Like all political positions one becomes a believer in feminist politics through choice and action. When women first organized in groups to talk together about the issue of sexism and male domination, they were clear that females were as socialized to believe sexist thinking and values as males, the difference being simply that males benefited from sexism more than females and were as a consequence less likely to want to surrender patriarchal privilege. Before women could change patriarchy we had to change ourselves; we had to raise our consciousness.\n\nRevolutionary feminist consciousness-raising emphasized the importance of learning about patriarchy as a system of domination, how it became institutionalized and how it is perpetuated and maintained. Understanding the way male domination and sexism was expressed in everyday life created awareness in women of the ways we were victimized, exploited, and, in worse case scenarios, oppressed. Early on in contemporary feminist movement, consciousness-raising groups often became settings where women simply unleashed pent-up hostility and rage about being victimized, with little or no focus on strategies of intervention and transformation. On a basic level many hurt and exploited women used the consciousness-raising group therapeutically. It was the site where they uncovered and openly revealed the depths of their intimate wounds. This confessional aspect served as a healing ritual. Through consciousness-raising women gained the strength to challenge patriarchal forces at work and at home.\n\nImportantly though, the foundation of this work began with women examining sexist thinking and creating strategies where we would change our attitudes and belief via a conversion to feminist thinking and a commitment to feminist politics. Fundamentally, the consciousness-raising (CR) group was a site for conversion. To build a mass-based feminist movement women needed to organize. The consciousness-raising session, which usually took place in someone’s home (rather than public space that had to be rented or donated), was the meeting place. It was the place where seasoned feminist thinkers and activists could recruit new converts. Importantly, communication and dialogue was a central agenda at the consciousness-raising sessions. In many groups a policy was in place which honored everyone’s voice. Women took turns speaking to make sure everyone would be heard. This attempt to create a non-hierarchal model for discussion positively gave every woman a chance to speak but often did not create a context for engaged dialogue. However, in most instances discussion and debate occurred, usually after everyone had spoken at least once.\n\nArgumentative discussion was common in CR groups as it was the way we sought to clarify our collective understanding of the nature of male domination. Only through discussion and disagreement could we begin to find a realistic standpoint on gender exploitation and oppression.\n\nAs feminist thinking, which emerged first in the context of small groups where individuals often knew each other (they may have worked together and/ or were friends), began to be theorized in printed matter so as to reach a wider audience, groups dismantled. The creation of women’s studies as an academic discipline provided another setting where women could be informed about feminist thinking and feminist theory. Many of the women who spearheaded the introduction of women’s studies classes into colleges and universities had been radical activists in civil rights struggles, gay rights, and early feminist movement. Many of them did not have doctorates, which meant that they entered academic institutions receiving lower pay and working longer hours than their colleagues in other disciplines. By the time younger graduate students joined the effort to legitimize feminist scholarship in the academy we knew that it was important to gain higher degrees. Most of us saw our commitment to women’s studies as political action; we were prepared to sacrifice in order to create an academic base for feminist movement.\n\nBy the late ‘70s women’s studies was on its way to becoming an accepted academic discipline. This triumph overshadowed the fact that many of the women who had paved the way for the institutionalization of women’s studies were fired because they had master’s degrees and not doctorates. While some of us returned to graduate school to get PhDs, some of the best and brightest among us did not because they were utterly disillusioned with the university and burnt out from overwork as well as disappointed and enraged that the radical politics undergirding women’s studies was being replaced by liberal reformism. Before too long the women’s studies classroom had replaced the free-for-all consciousness-raising group.\n\nWhereas women from various backgrounds, those who worked solely as housewives or in service jobs, and big-time professional women, could be found in diverse consciousness-raising groups, the academy was and remains a site of class privilege. Privileged white middle-class women who were a numeric majority though not necessarily the radical leaders of contemporary feminist movement often gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential.\n\nSuddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing. These careerbased changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate.\n\nWithout the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make CONSCIOUSNESS-RAISING 11ten gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential. Suddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing.\n\nThese career-based changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate. Without the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make one a “feminist.” Without confronting internalized sexism women who picked up the feminist banner often betrayed the cause in their interactions with other women.\n\nBy the early ‘80s the evocation of a politicized sisterhood, so crucial at the onset of the feminist movement, lost meaning as the terrain of radical feminist politics was overshadowed by a lifestyle based feminism which suggested any woman could be a feminist no matter what her political beliefs. Needless to say such thinking has undermined feminist theory and practice, feminist politics. When feminist movement renews itself, reinforcing again and again the strategies that will enable a mass movement to end sexism and sexist exploitation and oppression for everyone, consciousness-raising will once again attain its original importance. Effectively imitating the model of AA meetings, feminist consciousness-raising groups will take place in communities, offering the message of feminist thinking to everyone irrespective of class, race, or gender. While specific groups based on shared identities might emerge, at the end of every month individuals would be in mixed groups.\n\nFeminist consciousness-raising for males is as essential to revolutionary movement as female groups. Had there been an emphasis on groups for males that taught boys and men about what sexism is and how it can be transformed, it would have been impossible for mass media to portray the movement as anti-male. It would also have preempted the formation of an anti-feminist men’s movement. Often men’s groups were formed in the wake of contemporary feminism that in no way addressed the issues of sexism and male domination. Like the lifestyle-based feminism aimed at women these groups often became therapeutic settings for men to confront their wounds without a critique of patriarchy or a platform of resistance to male domination. Future feminist movement will not make this mistake. Males of all ages need settings where their resistance to sexism is affirmed and valued. Without males as allies in struggle feminist movement will not progress. As it is we have to do so much work to correct the assumption deeply embedded in the cultural psyche that feminism is anti-male. Feminism is anti-sexism. A male who has divested of male privilege, who has embraced feminist politics, is a worthy comrade in struggle, in no way a threat to feminism, whereas a female who remains wedded to sexist thinking and behavior infiltrating feminist movement is a dangerous threat. Significantly, the most powerful intervention made by consciousness-raising groups was the demand that all females confront their internalized sexism, their allegiance to patriarchal thinking and action, and their commitment to feminist conversion. That intervention is still needed. It remains the necessary step for anyone choosing feminist politics. The enemy within must be transformed before we can confront the enemy outside. The threat, the enemy, is sexist thought and behavior. **As long as females take up the banner of feminist politics without addressing and transforming their own sexism, ultimately the movement will be undermined**.\"",
    "title": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1507273110,
    "score": 8,
    "keyword": "mixed race director"
  }
]