[
  {
    "text": "Guys I need some help, got suspended from my job for unfair reasons So I have been employed at a restaurant that is corporate for 7 years. Never had any write ups, never had any reprimands, nothing. Always on time, always the one to volunteer to work extra. I serve, bartend and hourly manage. Haven't called out a day in over 2 years and that was when I had the flu. When the gm wants to leave early, I am the one that picks up the slack so they can leave.\nAnyway, we have had alot of complaints lately through email about service in the restaurant, especially how rude the host stand is. The host stand is one of the areas I am in charge of so I have been feeling alot of heat from this. We have nothing but kids on the host stand (I am in my 40s), so I decided it was time to put my foot down and I had to get stern with them. I told them to put away their phones, stop eating at the front, stop going to the back and flirting with the cooks and to do their job. Stuff I have been trying to get them to do all along but they haven't been.\nSo I get called in the office yesterday and told I am suspended until further notice and under investigation because my name came up for saying discriminatory remarks towards certain races. I said that was ridiculous and asked what was supposedly said. The manager wouldn't tell me. Just said they will complete their investigation and let me know. \nI feel like these kids have all ganged up on me and made up things to get me out of there. I have been called \"mean\" by them alot lately. I know things are sensitive in corporate and they have to take allegations seriously but how can they get away with this? \nAn amusing thing about this is I am white, they are basically accusing me of being racist and my husband and children are mixed race. I just don't get it and need some serious opinions and advice please.",
    "title": "Guys I need some help, got suspended from my job for unfair reasons",
    "subreddit": "jobs",
    "timestamp": 1549822933,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Red Flags with new employer Hey guys, I'm a new poster, using a throw away account because, reasons.\n\n&#x200B;\n\nI'm struggling with this human existence and I feel like I can't catch a break.  I have nobody to talk to so that's why I'm coming to the good world of reddit.\n\n&#x200B;\n\nThere have been several red flags with this new job.  First flag was being offered less than what the job posting stated.  It is an entry-level job where they like to hire new college grads.  I have over 10 years of real world, corporate management and operations experience, but no degree.  However, much of my previous experience will directly benefit me in the new job.  I attempted to negotiate salary, but it seemed like there was just a wall there.  I'm also planning to transition into a developer role, as I'm in school for that right now.  I brought this up in the interview, and decided to accept the lower-than-expected-salary offer solely because I needed a job, and this one seemed to be a good mix to let me get some hands on programming experience, with a possibility to move into a programmer role in the future, assuming it was the right fit.\n\n&#x200B;\n\nBefore accepting the job, I interviewed with 2 of their managers, and met with one of their HR managers that same day.  Prior to the in-person interview, I had a 1+ hour long Skype interview with their recruiter.  When I interviewed (Skype and in person), I kept my small hoop nose ring in.  (I'm aware this was a risk, but it was one I was willing to take, being confident in my work ethic and abilities.. )  Nobody at any point raised any issue, comment, or concern regarding my nose ring.    I'm now in my first week of the job, and things have been going fairly well.  On Day 1 of the new job, they covered their company policies which included dress code, and included mention of no facial piercings allowed.  I fully assumed that someone would point out my nose ring at that point, but still, nobody did.  I guess I should mention this place is business casual attire.  Anyway, today an HR mgr pulled me aside to tell me it's against policy to have a nose ring.  This really didn't sit well with me, as it's another seemingly-blatant display of bait and switch tactics.  I told the HR person that I wasn't willing to take it out, since I wore it during all of my interviews, and felt like they should have brought it up as an issue well before now. ..... I also segued into reiterating my goals to move into developer role, and maybe since that wasn't customer facing, that the nose ring wouldn't be an issue...\n\n&#x200B;\n\nAnother red flag was on the first day, the two HR people that were going over policies made a point to tell the new hire group that it is not allowed to discuss salaries with other internal employees.  One of the new guys spoke up to say it's legal to discuss salaries, and they can't tell him he can't.  The HR person explained we live in an at-will state and that discussing salaries internally is a fireable offense for this company. Is that even legal?\n\n&#x200B;\n\nThere's some other big red flags, from the CEO himself, but I'll save the remaining details for now....\n\n&#x200B;\n\nI turned down other jobs for this one.  I have no idea if my nose ring would have been a problem at those other places, but I can say it hasn't been a problem for 4 other jobs I've had since getting the piercing.\n\n&#x200B;\n\nTLDR; red flags, feeling baited and switched over salary and policies - straw on the camel's back was being told my nose ring is against policy on day 3 of new job, even though I met with 4 people during interviews and my nose ring never came up.  Also, is it legal to fire someone for discussing salaries in an at-will state?  Is this company one I should give a shot, or should I be hunting like hell for other work?\n\n&#x200B;\n\nI'm tired and stressed -- sorry for this post being super all over the place......  TIA for any replies!",
    "title": "Red Flags with new employer",
    "subreddit": "jobs",
    "timestamp": 1547097036,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I think this roommate might be grooming a young girl. I'll do my best to be clear with this information, but honestly my heart is pounding like crazy. I don't want anyone to get hurt and I'm trapped with indecision. So, I've made a throwaway account because I need some place to put all these feelings I have.\n\n&#x200B;\n\nObviously, specific information is hidden for the sake of privacy. The beginning is going to seem to go on for a while, but I want to get all of this information of my chest so that I get the best help to understand what's happening.\n\nSo there's me (28m), my gf (25), our friends Mary (26f) and James (31m), Barry (27m), and Sam (13f)\n\n&#x200B;\n\nI live in a decent neighborhood, economically speaking. It's mostly middle-class with free wifi at the shopping centers, farmer's markets on weekends, and middle school parades through the neighborhood for holidays or the local football team. My block is a mix of town houses and apartments, which is where I and many of my friends live. I have high functioning autism as well as ADHD, so I tend to be a little \"outside the lines\" when it comes making friends and hanging out, which means I know my fair share of who I like to call neurodivergent people. \n\n&#x200B;\n\nOne of my friends, let's call him Barry, I've known for almost 10 years. When I first met him, he had been walking around with a hat with fox ears and a matching tail hanging out of his back pocket. He shares an apartment with three other guys and we're similar in age. We bond over our love of video games and anime, although when it comes to anime all he wants to watch are harem themes, where one boy/young man (the hero) is surrounded by a supporting cast of girls/young women who all want his attention and it just isn't my thing.\n\n&#x200B;\n\nAt some point, Mary moves in as she's dating James, who lives there. Eventually her and James, my gf and I all become pretty good friends. As for me and Barry, over time our relationship has become very strained. When I told him that I couldn't come over to hang out one day, he tried to tell me that I hurt everyone around me by jerking their feelings around and don't respect other people's time. When I started to date my current partner, who is also Barry's and Mary's mutual friend, he held an intervention at his house to tell us that we're spending too much time together and it's destructive to our other relationships.\n\n&#x200B;\n\nOne day, Barry and I were talking about consent and sex positivity. I reveal that one of our friends (who doesn't live in the house) had loudly slapped my gf's butt out in public and that isn't remotely cool at all. Barry's attitude was \"You don't get it. He's just like that. He's always been like that. Why is that a big deal?\" We argue for hours about respect and how women fight an uphill battle for basic shit. He continues to take the stance that I'm misinterpreting the event. He infers that women act like gold-diggers because that's just biology (what). . . and then he says \"If it's the end of the world and she doesn't want it, it doesn't matter. ***The preservation of the human race is way more important, wouldn't you agree?***\" I leave and blow off everything with him, now realizing that he is an actually full-blown nightmare person.\n\n&#x200B;\n\nThat was early last year. Now, the only time I see him at all is when I come over to hang out with Mary or James, since they all share rent together. But lately, Mary has been telling me that Barry has been going to a small, out of the garage dojo ran by an old instructor on the other side of the block (roughly twenty-five minutes away by foot). There's maybe anywhere from 8-12 student there during a lesson and I knew Barry had been attending for all these years. These days, he's essentially the instructor's protige, sometimes leading classes, and will pay special attention to the one and only young girl there who's about to start high school, Sam. Apparently, Barry and Sam text every day, asking what she's doing, how her day was, how her family is doing, how's school. And he's been doing this for years.\n\n&#x200B;\n\nHe's positioned himself as a pillar of support for this young girl over the last 5-7 years, since her parents started taking her to the dojo. He's openly told me that he's depressed and that he \"doesn't want to be a wizard,\" meaning a 30-year old virgin. He's said that \"age is just a number and girls mature faster than boys\" and that he's \"good at playing nice for parents.\" His notification tone for her texts is a loud cat's meow. \n\n&#x200B;\n\nI worry that he may be manipulating her, filing her head with nonsense about the way boys and girls are because of \"biology\" or grooming her to act \"properly\" for his tastes in anime lolis. He's quick to anger, works out, and is a walking Dunning–Kruger effect, interupting people often just to be loudly wrong.\n\n&#x200B;\n\nSo, there you have it. I don't know what to do. I've thought about going to the dojo and speaking to the instructor directly about this. Chances are that he has Sam's and the family's numbers, but I wanted to see if there's other options available OR if I'm way out of bounds here, acting paranoid, and trying to pry into a teenager's private life for my own sense of warped sense of safety or morality. I honestly feel crazy about this and need more feedback.",
    "title": "I think this roommate might be grooming a young girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1546563688,
    "score": 21,
    "keyword": "mixed race ceo"
  },
  {
    "text": "My first dating experience was a wreck. Throwaway because the person described knows my Reddit username.\n\nIn my third year of college, I met a guy online through a game and became friends with him. He lived many states away from me in the US and I knew he was older than me. We chatted daily and played together.\n\nThis fast friendship continued into my senior year. We had been playing a different game together and voice chatting more often. I think I was actually charmed by his voice. It was deep and rich, and he had a great laugh. I didn't expect him to be incredibly good looking, but he was kind and funny, and his breadth of experience as an older guy (I didn't know then how much older) was very appealing. He was easy to talk to, and I confided in him. I had been seriously struggling with undiagnosed clinical depression and anxiety. I think he thought of me as a side hobby of sorts. Just a problematic girl he met online who he wanted to help. \n\nI confessed to him, and was rejected. He seemed more incredulous that I would want a relationship with him.\n\nI was always open to him about my life. He knew how old I was, what I sounded like, even what school I went to. On the contrary, I knew very little about his appearance or height, or even his race. After I showed him my picture, he was surprised because apparently he expected me to look like Sadako from The Ring. The compliments felt good to receive, even though it hurt that he thought I was so scary/unattractive. I'm a 175 cm (5'9\") Asian girl, and at that time, I was 115 lbs. The next day, his tune changed, and he seemed to be considering the relationship. And then later that week, he said that I should be happy, because he had reconsidered my feelings for him and was willing to give the relationship a go.\n\nMy feelings at this point were already mixed. That day, when I confessed to him, I had asked to see his picture after I showed him mine. But he was evasive and ended up showing me a picture of him from many years back, when he was in college. When I asked for a more recent picture, he showed me one that was incredibly blurry and I couldn't make out any of his features. Then he reluctantly told me that he was 39 years old. I had known he was older, but never in my wildest dreams had I expected him to be so much older than me. There was a 17 year age gap between us. Relationships with such age gaps often do work out, but I was still super concerned and immediately knew that my strict Asian parents would NEVER approve of him. \n\nAll of this was obviously raising flags and I was now regretting confessing to him, but when he said that he liked me back and wanted to progress with the relationship, I hesitated to go back on my word. I had never dated before and was a complete virgin, and honestly, I craved a relationship. I wanted to feel desirable, to feel loved and attractive. We started dating. For us, that meant phone calls lasting 4-6 hours and many texts in between. He encouraged me to seek therapy for the panic attacks and suicidal thoughts I kept having (senior year became very stressful, with all the looming thoughts of the uncertain future ahead). For that, I will always be thankful to him. No one else in my life had ever told me to go into therapy. My parents told me I would get over it and that this was a phase that everyone went through. He was the first person to tell me that it wasn't normal to think about how I would end my own life on a daily, if not hourly, basis.\n\nAnd then, after a few weeks of daily conversation, he showed me his body and face.\n\nTo be honest, I was completely repulsed. I feel bad saying that about anyone but I would have never wanted an intimate relationship with him if I had seen his appearance beforehand. Everything about him was simply not my type. He was very overweight (although he was working hard to lose it) and much shorter than me. 17 years older than me and balding. I started realizing this would never work. I had fallen in love with his personality, but I could not feel even an ounce of attraction to his body.\n\nThis is important, of course, because he also taught me about phone sex and sexting. I became very good at moaning, because I knew it turned him on. However, I could never bring myself to actually imagine his body on top of mine. It scared me a little. But for him, it was all too easy. He would tell me about erotic fantasies he had about me. He seemed to always be thinking about sex, and masturbated to porn frequently. I was happy to think that he found me so attractive, but at the same time, I was pretty scared.\n\nI told him once that I was hesitating, that I liked him, but was not attracted to him. BUT I was willing to still give it a try, that maybe I would get over it. He must have sensed these feelings growing in me after he showed me his picture, because he totally assumed that I was dumping him and had apparently planned to lash out at me. His vengefulness and anger was frightening. I don't remember everything he said then, but one thing stuck: He thought I at least owed him sex.\n\nI think I was too much in shock and too overwhelmed by my mixed feelings to realize how concerning those words were. He was never a bad person. I think now that he was seriously lonely and thought of me like a rice cake dropped into his lap from the sky. At almost 40, his dating opportunities were becoming rather slim. He told me that I was his \"last chance\" to find love and marry, have kids, and live the rest of our lives together.\n\nAnd so... my chance to end the relationship decisively slipped away from me, and we continued dating. He made plans for the future, and I continued worrying and doubting. He booked a flight and planned to come see me, and I continued to dread actually meeting him. I know I should have told him clearly that it would not work between us, but I didn't. I felt bad that he had helped me so much, and that we had spent so many hours talking. I didn't want to have been a waste of his time and care. And most of all, I could not bring myself to destroy his \"last chance.\"\n\nWhen my anxiety about the relationship came to a head, I told him I needed a break. To this day, I regret having not laid things out clearly. But I felt bad about everything, and just wanted to escape from the mess. I knew I was essentially stringing him along this whole time and lying to him, but I honestly never meant to hurt him. I was 22 years old, completely naive, and had no idea how to express my own wishes, how to listen to my body's signals, and how to heed the red flags I had seen along the way.\n\nI offered to recoup the cost of the flight. He rejected that offer at first, but the next day he sent me a very formal text saying he had reconsidered and wanted me to pay $250. At that time, that was a lot of money for me, but I agreed and sent him the check immediately.\n\nI believe I was an asshole in this relationship. I could have avoided all this pain for both of us by listening to my true thoughts and realizing that no amount of worrying is going to suddenly make me feel attracted to a body that isn't my type. He knew, from the very beginning, that I was vulnerable and incredibly naive. I had a lot of fault in this, but he also manipulated my feelings and withheld his appearance and personal details (namely his age) from me until it was too late for me to easily back out. He KNEW that I would find him unattractive, and so he kept me in the dark for a long time.\n\nI wrote all of this to finally process my lingering feelings. It's been 2 years since then and I'm in a loving, non-long-distance relationship with someone else. I'm even getting married soon, but I still have pained thoughts about my first boyfriend sometimes and I realized that I never really got over it. I'm scared to invite criticism, but I know I need to hear it.\n\n(Edited typo about my height!)",
    "title": "My first dating experience was a wreck.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1561470315,
    "score": 17,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Am I being sexually harassed at work? And what can I do about it? I am a 27y/o woman in Ohio and have been with an industrial equipment company for almost 5 years. My current role is in sales, but I came in at an entry level admin position and have been promoted several times. I love what I do now (been in this role about a year) and want to stay with the company for the rest of my career, but some things have happened lately and I need to get it off my chest. \n\nI am 1 of 3 women sales reps (out of a group of about 15) for a medium sized company (~175 employees). My industry is certainly male-dominated, that’s no secret, and I knew that coming in. It isn’t something that makes me shy away from what I do. In fact, I like having the advantage of being one of few women doing what I do. \n\nLast week, I accompanied a male coworker (50y/o) and a female coworker (28y/o) to a conference out of town. He was in charge of booking accommodations. First red flag was when he sent a text to us saying “got our room booked, only 1 bed I hope that’s ok”. Gross. But whatever, I’m not “that sensitive” (I hate that I even have to say that, because it shouldn’t matter!).  Obviously, he was joking. \n\nWe get to the conference and set up our booth the night before. Afterward, we all 3 go to dinner and to get a couple drinks. Almost immediately, he asks us if we’ve ever had a threesome. We both say no. He proceeds to tell us all about his experience with his wife and a mutual friend and encouraged us that “you never know until you’re in that situation”. Again, gross, but whatever. This guy is known for being obnoxious, and my female coworker and I have worked with him for a few years at this point, so it’s not really taking us by surprise that he’s talking like that. It just felt a little extra “yucky” to me because he wasn’t even drunk, asking about threesomes, while he’s with us 2, and we’re out of town for a few days with him. \n\nThe next night, we go out for more drinks, and are with a lot more people (potential customers included). Some companies have happy hours set up at different bars in the city and we bounce around to a few of them. At every one, he’s pounding beers and trying to get us to take shots. Eventually, we do take one (maybe 2, throughout the night). He’s obviously trying to get us really drunk (which again, isn’t out of the norm for this guy. He likes to party. And to be fair, everyone was drinking. ). \n\nEventually, the conversations just start to get out of hand. Every man we run into, he asks if they “like to eat p****”, and “oh man, have you ever ate so much p**** that it gave you swimmers ear?!” And so on and so forth. Seriously, gross. No one wants to hear that from a coworker, especially one old enough to be your dad. And this guy is SO. LOUD. And we are talking to people who know is, or people that we WANT to know us [face palm]. \n\nDay 2 of the conference: We took an Uber there that morning (we knew we’d be drinking the night before, so we left our vehicle at the convention center).  It is SEVEN AM and this man is asking our Uber driver if he prefers eating p***** in the morning or the evening. My female coworker and I are in the back seat, mortified. He says “hey do you guys prefer morning or evening?” (referring to us in the back seat). We are just looking at each other shaking our heads and don’t answer him. He says “Oh any other time they are flapping their jaws but now they want to be all quiet!”  . Again, we just keep our mouths shut. We are over it at this point. \n\nLater on that day, we are all 3 manning our booth, and it got a little slow so I open up a bag of trail mix. Loud enough that anyone within a quarter mile radius could hear, he says “Oh, she (using my name) LOVES my salty nuts in her mouth!” And “hey how do my nuts taste?” And on and on - you get the picture. Very funny, if you’re a 14 year old boy in a locker room. Not funny when you are at a professional event with coworkers half your age. \n\nSo, now we are back to work (conference ended Thursday afternoon), and my coworker and I feel so gross and want to say something. My husband even tried to get intimate with me over the weekend, and I felt so gross and awkward that I couldn’t even do it. That’s when I started to think that this is a big deal.  I shouldn’t have to feel uncomfortable with my  own husband because of this d-bag at work. \n\nHere’s the problem: 2 owners, 1 of them is the Pres/CEO. The other is the father of my direct supervisor and also father of the HR Manager. HR Manager is also buddy-buddy (possibly, more than??) with Obnoxious Man.  Also, my female coworker is family friends with the Pres/CEO, and doesn’t want to ruffle feathers. Who do we go to??\n\nI will also mention that I had a similar (not sexual) complaint about a male coworker a couple years ago that was written off as me being “too sensitive”, essentially. There was never an apology made, but I did formally document it with HR and was not directly asked to work with the person I had the issue with after that (kind of). So, I already have a “reputation” if you will, and I just have this feeling that it won’t be taken seriously. \n\nI need an outside perspective - is this bad enough to take to management? Should I bother? And should I start with HR, or go straight to the top? Part of me thinks I should just peace out and go work for a company that I can grow with and not have to worry about this, but I also really like my job and am getting really good at it, and I don’t think it’s fair that I should have to leave. But, if I report this, I need to do it ASAP - right? Am I overthinking this?? HELP!",
    "title": "Am I being sexually harassed at work? And what can I do about it?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1552327399,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Rant: Men Commenting on My Smile Background: I'm a 20-something female, mixed race (but White passing), and I've never really been one to smile. I just don't. This has led to multiple comments throughout my life of looking \"angry/RBF\" but whatever. I smile when I want to, when I'm happy and it's appropriate. Not all the time. Also I currently work for a school photo company doing portraits and have a Disney pass.\n\nRant:\n\nThis week at work we were training for the season. We practiced taking photos but I also volunteered to model since free semi-pro photos, why not? Boss is male in his mid 50s and Hispanic. Coworkers are almost completely non-White. Handful of blacks, mostly Hispanic. 50/50 male female.\n\nWe were there for 4 days. Between days 2-4 my boss felt the need to comment on my smile in front of other people. Started with me modeling. I gave what I think of as my best smile. It's a big smile. Photo taken, I relaxed and the photographer got feedback. Boss commented, \"I don't know if you're clowning around.\" Next photo taken, same smile, same comment. I laughed at something afterward, almost like I was embarrassed. Boss, \"*That's* the smile I want to see.\" I even told him, \"This is my natural smile,\" when I gave my best smile after he made the same comment the second time. Just ugh.\n\nDay 3 he made another comment. I can't remember specifically what but he said it after I was modeling again. Over lunch I had been telling a more experienced coworker who was just there for that day that boss had made these comments. She was sympathetic. While I was modeling she was watching and giving feedback. After boss commented I went up to her and whispered that he said something again. Just ugh.\n\nDay 4. This time I wasn't even modeling. Last day of training so boss was going over key details one last time and answering questions. We had been critiquing photos taken in the field by experienced coworkers that week and I think talking about forced vs natural smiles in these shots. Something of this context I think. Boss, \"I had even teased (OP) about her smile.\" Me in my head, \"That was an unnecessary comment, especially in front of everyone, and also that wasn't teasing to me.\" Made me mad. Just ugh.\n\nHe's generally a nice boss and I've never taken issue with him. I've trained with him every time. Great personality, knows how to engage people who are there because it's a job, he can make people laugh but bring them back down when it's time to be serious. Never had an issue with him before this week. I like him but those comments were just ugh.\n\nThen there was Disneyland. DISNEYLAND.\n\nLast night I went. I go a lot and I know how to get through security as fast as possible because f*ck that line. Bf and I bring only what's necessary (phone, wallet, keys, jacket) so we don't get a bag check. Last night I had my passport because I needed photo ID but my current license has a hole punched through it while I wait for a new one in the mail.\n\nDumped my phone, wallet, and passport in the tray and got the ok to walk through the metal detector. Turned to grab my stuff and wait for bf to pass. I had my things in hand when a guard turned to me. \"Excuse me, miss.\" We made eye contact. I hadn't set anything off or otherwise caused necessary attention to myself but thought he might be telling me to be cautious because he'd seen my passport in my hand. How I wish.\n\n\"You're gonna need to find your smile before you get to the park. They're not gonna let you in without it.\"\n\nWHAT THE ACTUAL FFFFFFFFFFFF. I'm fuming reliving this to put it into text. Forgive.\n\nI didn't know what to say. Couldn't come up with some snappy comeback fast enough but my eyes were dead set on his. I thought about telling him off, telling him that's inappropriate or asking him why my smile is any of his business.\n\nNope. With my stuff in hand and without losing eye contact I decided it best to just put my phone and wallet in my back pocket and walk away a second or two later. Dumbfounded. This guy was security.\n\nTold my bf what he said. Bf said, \"If it's the guy I'm thinking of then he was checking you out.\" I described him. Yes, that was the guy. 6', White, full beard, glasses, about 40yo. I only wish I looked at his nametag.\n\nThinking about reporting him. I know the time I was there, where I was in security, a description of someone else from security nearby, and this guy's physical description. Only thing is I don't have his name and he looks like *several* other guards employed by Disney.\n\nI don't get why men feel the need to say something about my smile. Does it matter that what I think is my best smile doesn't look like that to other people? No. If I had been a customer my mom would've bought the picture. Does it matter that I don't smile going through a metal detector? No. The fun is in the park, not being waved down with a metal detector wand by a guy who needs a boner to kill time at his job. Hell that guy was a mood killer and I was going to Star Wars Land the second day it was open.\n\nOnly regret is not speaking up. I thought about privately telling my boss that what he said hurt. I even said the first day when he commented that it was my best smile. End of story. No more comments should've followed. What I wish I'd told the guard was, \"You see this smile? I'm gonna take it to City Hall and report you for that unnecessary comment. What's your name, sweetheart?\" Wish I could've watched his face go pale, too.\n\nRant over. I think I'm gonna go get a hot drink and a donut and appreciate the fact that my bf, the only male in this world whose opinion matters to me when it comes to my appearance, tells me daily I'm sexy and beautiful and that he wants me.",
    "title": "Rant: Men Commenting on My Smile",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1559491272,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Kid quote of the day... (H.S.) “I’m not afraid of my mom, she’s white.”\n~a mixed race sophomore boy with lots of teenage attitude \n\nContext: one of the table groups was discussing how their parents react when teachers call home.",
    "title": "Kid quote of the day... (H.S.)",
    "subreddit": "Teachers",
    "timestamp": 1550194970,
    "score": 16,
    "keyword": "mixed race ceo"
  },
  {
    "text": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans? **TL;DR/ Daily objective:** I am posting here seeking resources about research or programs about how U.S. public schools can respond to and change a culture of fighting and truancy. The \"goal,\" is not to expel all the students who've ever caused trouble--the goal is to create a school culture where students don't want to cause serious trouble, and former \"troublemakers,\" can receive and flourish form a quality education. I am hoping that we can compile some crowd-sourced resources including: links to online articles and research studies, names or links to programs with high success rates that our school could look into buying or implementing, book suggestions that contain this kind of information, or other concrete data-based evidence or action plans. Anecdotes would be appreciated, but anecdotes are not evidence and our school can implement a school-wide, multi-year improvement plan based on an anecdote. I will post basic details, then more detailed details underneath this TL;DR/objective comment; if you read this intro and have ideas, go ahead and post them without reading it all, but if you have the time or interest, I will give many details. \n**If you read the title of this post, my TL;DR/ objective right here, or my following detailed information and think to yourself, \"This is stupid, why is this person asking for help on reddit/ trying to fix a whole school/ believing that school culture improvement can happen/ working too hard/ not seeing the red pill ~truth~ and just blaming all the Black students,\" and you would like to make a disparaging or simplistic comment, please reconsider doing so and maybe go do something fun like eat some cheese crackers instead.** \n\n\n**Basic details:**\n\n\n-School location: Flyover state, USA \n\n\n-School demographics: 40% white, 20% Hispanic or Latino, 25% Black, 10% choose not to say/identify only as mixed race; 5% Asian/ Pacific Islander, Native American, and other. \n\n\n-80% of students on free and reduced lunch \n\n\n-Advanced Placement Participation Rate: 15%\n\n\n-Standardized test scores: below state averages \n\n\n-Important/ successful departments and programs: art, theatre, speech and debate, fine arts, music, ballet and dance, pre-career EMT, pre-career dental, pre-career welding, pre-career autoshop, pre-career automotive, pre-career fire science\n\n\n-Location part II: in a weird area that covers of dense-population urban areas, suburban areas, and about 20% farm kids \n\n\n-Gang activity in the area: Exists, present in some schools but mostly limited in ours, little to no direct gang affiliations, tags, or threats, but about 5-10% of students have direct gang ties or affiliations; lots of students joke about who is what or call other students members of gangs to call them stupid (\"Yeah well you go ahead and be your dumbass self, gangster disciple motherfucker,\" \"Miss, you know I'm Mexican, you can't fail me or I'll sic the Kings on you.\")\n\n\nProblems: Fighting, retaliatory fighting, people wanting to know about and watch fights, understaffed/ ineffective/ elderly/ moderately racist/ lazy security staff, truancy and loitering within the school/ hallway-wandering, phones, sexist comments and catcalls toward girls from boys, horseplay/joking around that turns serious, boys \"just joking,\" around with touching girls when they've said stop repeatedly and genuinely don't want to be touched, \"playing around,\" by taking another student's phone, parts of the school mysteriously smelling like mint/mango/ creme/ cucumber/ fruit/ Virginia tobacco, mysterious rectangular flash drives plugged in all over the place, students who think they can responsibly and reasonably handle their weed but show up smelling like skunks and unable to answer higher-level questions or complete complex tasks, disrespect to teachers, disrespect from a select few teachers who hate teenagers.\n\n\n-Most students are good or fine, typical high school students who are also fed up with people who walk the hallways, who fight, and who disrupt classes. But also everyone loves watching fight videos. \n\n\n-Students of all races participate in fights, hallway-wandering, and class disruptions/ disrespect toward teachers. However, Black and Hispanic students doing these activities are seen as bigger troublemakers while white students are more likely to get a warning and no true referral. Also, Black students are more likely to be stopped in the hallway by teachers and security guards and asked for a pass, even students who do not habitually wander hallways but are just genuinely trying to go pee, or really did forget their notebook in their 5th hour classroom.\n\n\n**Heckin' details**\n\n\nWe have a current epidemic of fights. One fight happens, then other students get mad because of who attacked whom, yeah, but also because of who tried to hold someone back, who DIDN'T try to hold someone back, who filmed, why they filmed it (it was funny? it was tea? they were supporting their friends? an attempt to create and preserve evidence of what truly happened? evidence of teacher or police mistreatment? who knows), who previously had beef with the person who was fighting and it got re-ignited, who got suspended or who didn't get suspended, etc, etc... So there's groups of students who are on edge, then there's a fight, then other people hear and try to run toward it, problems emerge while breaking up the fight, students get suspended, they miss classes, they get in bad trouble at home OR don't get in any trouble bc of uninvolved or otherwise \"let's get them back,\" parents, they smoke a lot, they return to classes, they're behind on work and annoyed by how students are looking at them (because everyone knows who was in the fight), students get on edge, then there's a fight, then other people hear it and try to run toward it, then...the cycle continues. \n\n\nWe also have a problem of students loitering/ skipping but staying in the building. There is a core group of students who come to near every class late, leave their materials in lockers, get out of class by finagling a pass from an exhausted teacher or a sub or just plain walking out, they walk to their locker and friends' lockers and stop to pee in the juul rooms, they walk by their friends' classes that hour and wave to them from the windows, OR my favorite, a random wandering student walks into another teacher's classroom and insists on talking to their friend (??? I've had students walk in my door if it's propped open, push past me if I open it assuming the student is a pass-runner, or POUND on my doors making me think there's a life-threatening emergency), the students walk slowly and on their phones, or people scream at each other, fights break out... hopefully at some point, hallway-wanderers will be intercepted by a teacher or security guard. Then they're either simply snapped at \"Get to class!\" and the student looks serious, says they're going, and walks away to wander another day, or they're taken down to our dean's office where they get in trouble. \n\n\nAnd that's another problem; what do we do with students who continue these negative behavior patterns? \n\n\nIt's obvious that students fighting and skipping have no place in the classroom setting and need to be suspended, as punishment for their actions AND to keep them from distracting or even harming other students; obviously we need to suspend or expel troublemakers.\n\n\nIt's also obvious that students are skipping or getting in small fights so that they can get suspended and stay home from school, plus the fact that having troublemaking students OUT of school-- where they have order, rules, meals, staff who care, and access to quality public education, which is a right in our country and a way to lift people out of poverty--is undesirable and possible unethical; it's obvious we have to keep students in school and we can't just give students what they want and suspend or expel them. \n\n\nWe have many teachers and administrators who are prepared to try their best to take our school from okay to great, to make our strengths shine and **fix** our problems, rather than covering them up or kicking them further along the road. Not all teachers and admins are spectacular. But there's enough of us to make changes, as long as we know what changes to make, we work in sync, we reflect on progress, we use our resources, and we have a some but not an unreasonable amount of Jimmy John's work-til-8:00PM sessions. There are also students who are WONDERFUl, talented, hardworking, resourceful, curious, growth-oriented, compassionate, and more. We've had successful community outreach programs (food drives, volunteer programs, community elder outreach), and many students are incredibly frustrated about fights, hallways, and disrespect to teachers, and know that those are some stupid ways to go through life and handle problems. \n\n\nPlease, let me know what you know that can help. I cannot thank you enough for giving me any info to look into and report to my team.",
    "title": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans?",
    "subreddit": "Teachers",
    "timestamp": 1549597210,
    "score": 8,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals) Hi all! I am a first year teacher in the public school system, but I work in a Pre-K/VPK Blended classroom. For those who may be unfamiliar (as I was, since I'm originally from a state who doesn't have VPK), basically I have x amount of gen ed kids on my roster, and my co teacher has x amount of special needs kids on hers. Technically, I'm supposed to teach for the first 3 hours of the day (as VPK is 3 free hours unless you pay extra for wraparound care) and my co teacher is supposed to make accommodations for the special needs kids on her roster. However, she \"doesn't agree with the co teacher model\" and has decided she is the \"teacher\" and I am the \"assistant\". The biggest problem with this being that I actually am a certified teacher and have 10+ years experience working in a preschool setting. Anyway, she decided I could have a 10 minute teaching slot before my 3 hour VPK kids go home. Whatever. \n\nThat isn't even the part I'm here for advice about. This teacher is miserable. In no certain order, these are just some of the things that have occurred since mid August, when the school year started:\n\n-She made a comment that, last year, she recommended that all the \"blacks\" in her class be put in the \"black\" kindergarten teachers' class just because that teacher is also black.\n\n-While commenting on a mixed race student on my roster, she said she would not claim the \"black half\" as it would \"only make life harder\".\n\n-She makes unprofessional comments and holds unprofessional conversations with parents at drop off and pick up.\n\n-She chases my parents out of the classroom if she thinks they've been in talking too long (she has done this multiple times with one of my parents who has deep concerns about her child's behavior and mental well being).\n\n-She constantly berates, belittles and corrects my teaching style, going so far to even suggest I should change how I have always taught to match hers.\n\nJust a few days ago, she was pulled in by our admin and told that there had been a few parent complaints regarding her, and that one of my students refers to her as \"the mean teacher\". Here is where I need advice - do I go to admin over this? I'm told that everyone \"knows how she is\" already, but I don't feel like that makes her behavior okay. But, I'm new and she has been at this school for 14ish years (only in pre-k for 3, though). Has anyone else dealt with a terrible co teacher, as well? I'm kind of at my wits end.",
    "title": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals)",
    "subreddit": "Teachers",
    "timestamp": 1573167874,
    "score": 8,
    "keyword": "mixed race ceo"
  },
  {
    "text": "What makes a good Product Manager? Last year I somehow landed a job as a PM in a really small company. However my responsibilities are a crazy mix of things that needs to be done, and just a small portion of my time is doing Product Development or Market analisys. I didn't have too much guidance nor I have other PM so I can learn from them (my direct boss is the CEO/owner and is usually busy with other company that he owns).\n\nI'd like to apply for a new job in another city the next year and I can't help but wonder if I can apply to product manager openings and be able to do a good job in a new place or what do I need to focus the next few months in learning so the transition to a new company run as smoothly as possible.\n\nIn your opinion what is necessary from a successful PM? How is the initial training in a new company and what should I bring as skills and experience?\n\nThank you! :)",
    "title": "What makes a good Product Manager?",
    "subreddit": "careerguidance",
    "timestamp": 1563106683,
    "score": 3,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Not just Grown-ish: Black-ish has a color problem too Been thinking about this a lot and wanted to speak on it. As someone who is lighskin and frequently mistaken for mixed race I try to be very aware of my privilege within the black community and slight advantage in white spaces. I've never been able to fully appreciate Blackish or partake in the hype surrounding it because the majority of the cast seems to be made up of \"safe\" black people. Palatable for white audiences, that is. Other than the little girl, the rest of the family range from light to medium skinned. Half are biracial. Outside of the main family few of the guest characters are dark skinned, and it's always bothered me and kept me from getting into the show. If it's not representative of all of us then in my opinion it's not representative at all. \n\nContrast this with black entertainment in the 70's and even 80's and 90's when seeing dark skin on black shows, even dark skinned women, wasn't as sparse and uncommon. Even though I feel we have more overall representation today, it is less reflective of our features than before from my vantage point. There was less black representation back then but when there was, the characters were predominantly non-biracial black folk. As far as colorism in black hollywood, we've gone backwards. Name an attractive, popular dark skinned (or non biracial) actress besides Lupita and (sometimes) Gabrielle Union. Now compare that to Yara Shahidi, Amandla Steinberg, Tessa Thompson, Laura Harrier, Zendaya. These are the faces young black women in my age group have. It's not as alienating for me because (to a degree) I look like them. But most black women don't. There are no dark skinned equivalents. It really saddens me and as someone who wants to write and direct movies/tv someday, I hope to amend it with my work. More of us gotta start writing content and casting ourselves. \n\nI do see it getting a little better in the music industry. We have Lizzo, a rise in female rappers with regular black backgrounds and black features, although even that has been overshadowed by Cardi B. The new black female artists who've enjoyed the most success, other than Lizzo, are biracial or lightskin. Jorja Smith, Ella Mai, H.E.R (Black passing but still biracial), in addition to Cardi who has had the most. Beyonce and Rihanna still reign supreme. \n\nStill! There's hope. A few years ago I really couldn't see people like Lizzo (or Noname) getting exposure or a chance to become popular. I think the internet has allowed for a lot of people to get platforms they wouldn't otherwise have, which has indeed resulted in oversaturation and mediocrity, but also for some great talents to emerge and get traction. \n\nWhat do you ladies think about this issue?",
    "title": "Not just Grown-ish: Black-ish has a color problem too",
    "subreddit": "blackladies",
    "timestamp": 1556978071,
    "score": 86,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Examples of Midwest racism; How do I not take racism personally? Examples of Midwest racism; How do I not take racism personally?\n\n&#x200B;\n\nI am going to give a some examples of covert and overt racism I have experienced as a 26 y/o half black and half white female living in the midwest this past year:\n\n1. Last fall I started my first new job as a therapist in a very white and wealthy area. I go to the school with my white supervisor to first meet with the staff at the school. During the meeting, the staff at the school start talking to my supervisor because they assume she is the therapist and then get shocked/visibly uncomfortable/anxious when they find out I will be the therapist at the school. Ugh, the worst--i felt embarrassed and anxious!! During my first week at the job, one of my white blonde coworkers is visibly uncomfortable and anxious around me. Every time I come into her classroom, she gets anxious and makes comments to show she is not racist such as \"I am going to watch Black Panther tomorrow!\" or \"I love the show, Dear White People!\" or she says to one of the only black kids in the classroom, \"I love your beautiful brown and and skin!\" So awkward and uncomfortable!!! It makes me think she is actually racist/ignorant for trying to work so hard to prove she is not.  Something else she did was she pitied one of the only black boys and talked about how his mother did not care about him and totally had the whole \"white savior complex\" where she tried to save the black kids. She was extra easy on him and let him get away with things more than the white kids and maybe its because she pitied him but also she might think that if she is super nice to him then she won't seem racist. I almost feel like her and the other coworkers were super nice to him to prove to themselves they were not racist and to wash away all the guilt they may have for being racist in the past. I quit that job in less than two months. I feared she would start watching me closely to make sure I didn't abuse the kids or act aggressive/angry like the black mother of the kid or act like the \"black stereotype.\" Anytime I showed anger, she became visibly tense and scared. I didn't feel safe or comfortable in that environment to say the least.\n2. I go into Target in the self-checkout lane and am putting water into paper bags. I happen to look up at the camera and see this white employee behind me watching my closely as I put the water in the bag while she is pretending to fix up some bags. She sees that I see her in the camera and she walks quickly away. As I leave, she smiles and wishes me a good day. I tell her the same. All that passive aggressive, midwestern nice, and covert racism wrapped up in one. Now I understand that the state I live in has a tremendous class gap between blacks and whites. Where most black people are lower class and most white people are middle class. So often I feel isolated being a black mixed race middle class woman.. but it is ignorant for some of these white people to think every black person is going to steal and is lower class.\n\n&#x200B;\n\nI do not feel safe in majority white areas. Sometimes I will drive further away from my home to shop at a Target where it is more diverse (but also a lower class neighborhood) in order to not feel so hypervigilant in white store areas. I have recently started shopping on line so I don't have to feel so on edge while shopping. These racist experiences are very painful and angering, and hits a tender spot inside of me. Every time a white person is racist to me, it feels like rejection like even though I am half white, I will never be one of them. Also, I hate it when people assume the worst of me like I am lower class and will steal just because of I am mixed black. \n\n&#x200B;\n\nSo first off, I am saving to move to a more diverse state. But in the meantime, I am trying to figure out how to not take racism so personally? Like when I experience racism, it ruins the rest of my day as I feel really down. Any advice? Thanks!",
    "title": "Examples of Midwest racism; How do I not take racism personally?",
    "subreddit": "blackladies",
    "timestamp": 1550425404,
    "score": 29,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 42,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Curvy High School Swimmer Disqualified for a Wedgie For those who have exceeded their Washington Post free article limit:\n\n\"The teenage girl clambered out of the pool, ready to accept victory. A champion swimmer for Anchorage’s Dimond High School, she had crushed her competition in the 100-yard freestyle during Friday night’s meet with a rival from across town.\n\nBut as soon as she stepped out of the water, she learned that she had been disqualified.\n\nThe reason? Her swimsuit was exposing too much of her buttocks, an official ruled.\n\nThe referee’s call, which is now under investigation, has generated intense debate among Alaska’s close-knit swim and dive community, and prompted a larger discussion about how female athletes’ bodies are policed and scrutinized. Lauren Langford, who coaches swimming at another high school in the area, told The Washington Post that she believes racism, in addition to sexism, may have been a factor, given that the teen is among the few nonwhite athletes in a predominantly white sport.\n\n'All of these girls are all wearing suits that are cut the same way,' Langford said. 'And the only girl who gets disqualified is a mixed-race girl with rounder, curvier features.'\n\nThe teenager didn’t pick out the swimsuit — her school chose it and issued it to her. But even though all the girls on her team were dressed identically, she was the only one cited for a uniform violation. Annette Rohde, who was working as an official during the meet, told the Anchorage Daily News that another female ref explained that the bottom of the girl’s suit 'was so far up I could see butt cheek touching butt cheek.’\n\nRohde froze in disbelief, she said, and warned the referee, who has not been identified, 'This is going to blow up.' Sure enough, the decision reverberated throughout the community, where the teen is known as a top-ranked swimmer likely to go on to compete at the collegiate level.\n\n'In a world where young girls are told at every turn that the skin they’re in is not good enough for a thousand reasons, the last thing we need to do in youth athletics is add to that unhealthy dialogue,' Langford, a swim coach at Anchorage’s West High School who coached the teenager and her sisters when they were younger, wrote in a widely shared blog post on Medium after Friday’s meet. She added, 'If you do not like the way that swimsuits fit on these girls’ bodies then don’t look; they are minors, children, and no one should be looking at them anyway.'\n\nSpeaking with The Post on Monday night, Langford said she was angered at the treatment of the teenager, whom she described as 'literally the nicest young lady.' It wasn’t the first time the girl had been made to feel that her curvy figure was problematic: Last year, a parent took a photo of her backside and shared it with other parents to demonstrate that girls on the team were wearing inappropriate swimwear. (District officials said Monday that Dimond High School’s assistant principal 'indicated to the parent who took the photographs that it was not permissible for him to take pictures of others’ children and that he should stop immediately.')\n\n'That to me is so inappropriate,' Langford said. She noted that the teen girl has been accused of hiking her suit up on purpose, but anyone who has competed in swimming would know that suits often ride up unintentionally.\n\n'We have a term for it — it’s called a suit wedgie,' she said. 'And wedgies happen. It’s uncomfortable. No one’s going to walk around that way intentionally.'\n\nOver the years, the conservative one-piece swimsuits traditionally worn by competitive female swimmers have been phased out in favor of a higher-cut style that has less fabric and is more hydrodynamic, but also more revealing. The changes in the cut and fit, Langford said, make it 'even more frequent that you’re picking a wedgie.' But a minor, if annoying, wardrobe malfunction is also likely to be the last thing on the mind of a swimmer intently focused on her form as she nears the finish line.\n\n'If you’re in the water, you’re not thinking about it,' Langford said.\n\nRohde and another local swim coach told the Daily News on Monday that they, too, had never seen the teenager deliberately adjust her swimsuit to make it more revealing. There’s some dispute about whether the referee’s call, which Dimond’s coach has protested, would have been correct if the girl had done so, or if swimmers can be penalized for failing to realize that their suit has bunched up. Officials with the Anchorage School District, who announced Monday that they are reviewing the decision, wrote that the disqualification 'appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms.'\n\nThe National Federation of State High School Associations, the governing body for high school athletics in Alaska, simply states that female swimmers must cover their buttocks and breasts. In August, the organization issued a memorandum alerting coaches that 'suits are being worn in such a way as to expose the athlete’s buttocks,' and provided an illustrated example of what constituted appropriate coverage. District officials said Monday that Dimond High School 'made deliberate efforts over the last year' to meet those requirements — in particular, picking out the regulation swimsuit that the teen was wearing when she was stripped of her victory.\n\n'If the suit was a problem, they all should have been disqualified,' Langford said. 'But they weren’t.'\n\nMeagan Kowatch, the teenager’s mother, told KTUU on Monday that the referee who made the call had previously embarrassed one of her other daughters by critiquing the fit of her swimsuit during a meet. She wants to see the results of Friday’s competition overturned, and for that ref to be kept away from her daughters’ races in future, she said.\n\nThough there’s also been some debate about whether racism played a role in the decision, 'no one seems to be arguing about if it’s sexism,' Langford said. The National Federation of High Schools also published guidelines for appropriate male swimwear in August, and she said she’s seen young men competing in lower-riding suits than the organization deems appropriate. But to her knowledge, it’s never become an issue.\n\nBy contrast, Langford said, Kowatch has been told by other parents that her three daughters on the team, who are all talented swimmers, need to cover up for the sake of their sons. The disqualified teenager, though usually 'tough as nails,' turned teary on Friday night over the referee’s decision, and was 'heartbroken' to learn that people were accusing her of purposefully hiking up her swimsuit, the coach said.\n\n'The fact that she’s been told she’s intentionally trying to draw this sexual attention has really crushed her,' Langford said.\"\n \nBy Antonia Noori Farzan\nSeptember 10 at 6:58 AM\nhttps://www.washingtonpost.com/nation/2019/09/10/anchorage-swimmer-disqualified-wedgie",
    "title": "Curvy High School Swimmer Disqualified for a Wedgie",
    "subreddit": "Feminism",
    "timestamp": 1568221201,
    "score": 15,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Who is classed as being a woman of colour? Hey guys. Been deliberating over this. I'm mixed race, half Iranian and half English. Is this classed as being a WOC?? I've always thought of myself as one but a friend recently caused me to question this as she sees me as v white (she is white herself) . I know I have extreme privilege for often passing as white but I've also experienced a lot of discrimination, especially as a kid, for being middle eastern. I've been called names, made fun of and been made to feel I'm different. This has impacted my life a lot and really influenced the way I see the world. Some people see me as white and others do not. I definitely think people make judgements about me based on my appearance. I also have an extremely middle Eastern name which makes people assume things about me before they even meet me and I worry it may result in discrimination when I'm applying for jobs. But I also feel that I'm not qualified to call myself a WOC because other women that are not light skinned as me have it so hard. Anyway, didn't really know who to ask and Google ain't helping. Let me know if it's the wrong space..",
    "title": "Who is classed as being a woman of colour?",
    "subreddit": "Feminism",
    "timestamp": 1565803290,
    "score": 2,
    "keyword": "mixed race ceo"
  }
]