[
  {
    "text": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us? It kinda hurts a bit. I'm already an awkward kinda person, and I do know stats say black women and Asian men are the least desirable in the dating world. But it's like, a punch in the face when there's black men out there who refuses to even consider someone looking like you, while in the same breath want to be treated fairly, not judged and have their skin color not be an issue to the world.\n\nAnd then there's the colorism in it. \"I only go for light skinned girls/mixed.\" Everyone has preferences, but this is on par with racists who particularly don't date a specific race because [bigoted racist reason] if not worse because like.... These dudes *know* the struggle of being discriminated on and are actively doing it.\n\nI guess it's something that's been bothering me and I dunno how much it gets discussed. It just makes me feel ugly because I haven't done anything yet, black men already cross me and many women off just based off stereotypes. So much shit gets thrown in about us just by appearance alone without even saying a hi.\n\nNot quite the same, but it made me think of when I was inpatient at a hospital. Young gay black man assumed all this stuff about me just due to my appearance (dunno how because we all look beat up coming into the hospital at all times in the day) and when he actually got to know me, whole new opinion. Thought I was loud, \"ghetto\" etc while uh, I wasn't? But I know he wouldn't like it if people assumed he was in a gang, drug dealer, and likes to watch grab dicks for fun. It's a real slap in the face. But, it's nothing new for me and many other black women out there.",
    "title": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625608005,
    "score": 136,
    "keyword": "mixed race principal"
  },
  {
    "text": "People are not teaching experiences! No one owes respect and patience to someone who gives them none. I'm so so sick of being harassed and insulted by prejudiced people, only for mutual friends to turn around and tell me I should let them so that they learn. I'm pretty sure we all are.\n\n \\- At a friend's birthday party this guy silently stared at my chest all night, and touched me inappropriately. The response from my friend when I told him? \"Oh, he's not used to women. Sorry about that, but it would be really good for him if you guys hung out so he could practice talking to women!\"\n\n \\- When my boyfriend had a couple people over for drinks, a new acquaintance of his decided that that was the perfect time to tell our trans friend that when he first met her, he didn't see her as a person, and to tell her all of the disgusting things he still thinks when he sees her. Afterwards, I overheard someone \"comforting\" her by telling her he's just not used to trans people and she should cut him some slack.\n\n \\- Another friend of mine goes to Oxford University (for non-UK: very very prestigious, very white, elitist and rich) she's mixed race and working class. When her intelligence and legitimacy is questioned, when she is made to feel less-than, she has been told things like \"He hasn't met many people like you before! You should give him a chance to see what you're really like!\"\n\nAll of the people telling us this have been men who were our friends and \"allies\". If you feel like these are the kinds of things that you would say to excuse the offensive behaviour of a friend, I understand the impulse to defend someone you care about but please stop! Women, especially minorities, are not anyone's teacher, training wheels or learning experience! We do not owe anyone our patience and understanding when they treat us with contempt. If you are friends with someone that degrades or harasses, YOU should let them know how to change, not the people they're degrading! \n\nNo one is perfect, and we all have work that we need to do, but please take the time to consider if this is something you might need to think about.",
    "title": "People are not teaching experiences! No one owes respect and patience to someone who gives them none.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616525876,
    "score": 44,
    "keyword": "mixed race principal"
  },
  {
    "text": "TW: CSA - desperate for advice ASAP Major Trigger Warning: \n-Child Sexual Abuse\n-Rape / sodomy\n-Incest between children\n-Victim blaming\n-Mention of self-harm and suicidal ideation\n\nMy mind is reeling and I need some advice. This is really fucking long so I included a TLDR at the end. \n\nMy daughter is 10. Six months ago I got a call from CPS stating that they were informed that she was touched inappropriately by her cousin a long time ago and that they needed to investigate. Turns out, she had a safe touch presentation at school and wrote this info on her paper and the school passed it along. \n\nI asked her about it, I took her to the CPS office to do an initial interview with a caseworker. Also had my sister (cousins mother) come in to talk to the caseworker privately and then together with me and made a safety plan: the two kids would not be left unsupervised together anymore. I also had to take her to a forensic interview at a child advocacy place. \n\nAll she disclosed to me was that there was some inappropriate and uncomfortable touching over the clothes as well as inappropriate talk and threats not to tell. My sister cried and tearfully told me she was so sorry and didn’t know what else to say. I outright asked my daughter if the cousin had ever put anything inside of her body (privates or otherwise) and she firmly answered no. \n\nAfter the forensic interview, they took me in a room to privately debrief. They said that she had disclosed to the psychologist that in addition to what she told me, that he also inserted a phallic shaped toy into her backside. That was the extent. I didn’t confront her with this; I decided when she was ready to disclose to me, she would, and I would be there to listen. \n\nThey said law enforcement would decide whether to pursue charges. They didn’t. At the time, I didn’t want them to. My daughter said he had not done anything since he went back to live with his mother (at least 2 years ago) and that she didn’t want to lose him as he’s one of her best friends and he has changed. \n\nPertinent background info: cousin is 4 years older than my daughter. The time frame during which this stuff took place was when he and his brothers were removed from my sister and placed with me due to her alcoholism and subsequent abuse. (The same thing - removal by cps and placement with me - had also happened when this cousin was 2yo as well). \n\nObviously, my nephew was going through some shit at the time. He was angry, acting out, mad at the world - he had to leave his home and his mom and switch schools and also be subjected to structure and consequences which hadn’t been the case before he came to live with me and my ex wife. He also has adhd and some other ambiguous learning disorder. \n\nAlso, he has for a long time confided that he is gay or at least bi and possibly trans. However, when his mother heard of this she shut him down and told him he was wrong and couldn’t possibly know that. She screamed at him when she found him with makeup and nail polish on and made him remove it immediately. \n\nThis boy has always had some pretty severe behavioral issues all around. This was intensified when he was taken from his mom, not to mention the chaos and abuse he witnessed before he was removed from there. \n\nSo, at the time I told them I would rather he receive help than legal punishment, in the form of therapy or whatever they thought best. The caseworker checked both of our homes and closed out the case. He said they don’t pursue kid-on-kid stuff as harshly as adult-on-kid. \n\nTbh, I was relieved it was over with. I got that first call from CPS the day I got home from the hospital after giving birth to my second child (traumatic birth with complications and hemorrhage and nicu and everything). I immediately signed her up for therapy as well. \n\nSince then, she has still had a very high level of anxiety for a 10yo, even after starting meds, with some attitude/behavior issues as well and lots of insecurity, difficulty concentrating, grades dropping, not submitting assignments, etc). She has also decided that she only likes girls, not boys, which is totally fine. \n\nThen the other night, everything got flipped on its head. \n\nI was talking to my dad, with my daughter present, about some conflict she’s been having at school with asshole kids giving her shit for dating a girl, and I had said how my sister had flipped out and acted like I didn’t care because I was asleep on antihistamines and cold meds because I was super sick, rather than being awake and like emailing her principal or something. \n\nI made a comment about how it made me so mad that she acted like she cared more about my daughter getting picked on than I did and how I probably didn’t know what it was like to be bullied… even tho I dated girls and married a woman.. and I said it was fucked up for her to act like that when she was literally one of my first bullies I ever had after being raped myself and deciding to date girls exclusively. \n\nI have always tried to have a very open relationship with my daughter, I always answer her truthfully and share my experiences and struggles. She had already known I’d been raped by my cousin as a teenager, so idk what was different about this time that sparked her to say something to the effect of “you were raped just like I was raped by [cousin]”. \n\nI looked at her alarmed and confused and asked what she meant by that because what she had described before was assault for sure but not rape, and she said she didn’t wanna talk about it in front of my bf who was sitting there. I told her to come talk to me while I got dressed and ready. \n\nWhen we were alone, she finally admitted to me that during these incidents that were reported to and investigated by cps, while the boys lived with us while I was still married, this cousin actually raped her. Not just inappropriate talk and touching. Rape. \n\nI asked her in excruciating detail to make absolutely sure she understood what she was telling me. She said not only had he put that toy in her one time but other times he would put his “pointer finger” in her and also his penis. In her vagina and her anus. That she didn’t like it. That she told him no, that he would get caught. That he would put his hands around her throat and tell her he’d kill her if she ever told. \n\nI asked things to clarify and double check, and she is absolutely adamant that he raped and sodomized her. I asked her if she had to guess how many times/instances he put his penis inside her body and she immediately said “oh at least 20 times.” I asked why he stopped. She said it stopped overall when they were placed back with their mother, and in the moment he’d stop if he heard someone coming up the stairs or if he “just decided” to stop. I asked why she still had anything to do with him, and she said he’s changed now. \n\nThis would’ve taken place when she was in 2nd grade, so about 7 years old, which would’ve made him around 11. Although she told me she feels like she remembers it going on for like two years.. but she said that all but the first time was when they lived with us, which was not even a full calendar year I don’t think. I explained to her that sometimes when we go through something traumatic our brain can make us feel like it went on a lot longer than it did because it was so horrible to go through, but remembering exact details n dates wasn’t important. \n\nI asked her why she never told, especially when all this came up when cps got involved and we had to do the interviews and everything. I have always always checked in w her about these kinds of things, asking if anything had happened or gone on, reminders that she is to tell me if it ever did happen w anybody no matter what. She said not only was she embarrassed but that she was so afraid that he would either hurt her or get everyone to believe that she was lying or wanted him to do it. \n\nI cried and told her I was so sorry she went through that. She pinkie promised that she was finally telling the full absolute truth. I told her “I know I keep asking you why you didn’t tell, but that’s only because I really wish you would have.. because I know exactly why you didn’t tell at first.. it took me a long time to tell, too, and it takes lots of victims a very long time to come out with the truth of what happened to them too. I told her I wish I would’ve known so I could’ve made it stop and protected her, and that I believed her.\n\nShe kept apologizing to me for “being a disappointment” and not telling way back when. I told her multiple times that as long as she’s telling the truth then she has nothing to be sorry for and I would not let anything happen to her for telling. She feels like it’s her fault :( \n\nWe went across the street to hang out with my parents and my daughter gave me permission and asked me to share with them what she had shared with me. So I did. They said we needed to talk to my sister, but not over text. My daughter said she wanted to tell my sister herself because she needed to know. \n\nI let her FaceTime my sister but then my daughter got scared and said she wanted me to say it. So i did. I gave the basic most pertinent information and waited for her to process. She was silent for maybe a full 2-3 minutes, with her face just changing as her thoughts raced. I even said yeah that was my initial reaction too. Finally she just said “apparently you’re all sitting over there talking about it together and idk what to think, I don’t want my reaction to come off wrong so.. I just gotta go.” And hung up on us. \n\nBefore I could stop her, my daughter sent my sister a screenshot of her telling my dad she wanted her cousin “in huge trouble” for it. I told her ok now leave her alone. My sister is very reactive… (bpd, like myself) and VERY sensitive/protective about her youngest son (this cousin). So I’ve been on the precipice of a panic attack ever since, waiting on her to come off with some bullshit. But I left her alone giving her time to process and figured she would end up reaching out to me one way or another. She didn’t. \n\nMy mom started texting with her that day and the few days since. And what I’ve heard that’s come from that … is disappointing to say the least. \n\nFor one thing, she says her and her family will just cut off all the rest of us from here on out because “who would want a rapist at family functions?” She also said that she feels like “something did happen out of normal childhood curiosity but not rape, she couldn’t imagine her son having sex already let alone raping someone over and over, rape is a strong word” ………… my mom says my sister is real hung up on the fact that the word rape was used… \n\nMy sister herself was molested as a child and raped when she was older, and in fact had told me after my own rape that she was raped and I was not because I didn’t struggle or fight hard enough during mine so mine wasn’t even rape like hers was. Ya know, like she’s got a monopoly on it or something. \n\nShe was also the one who, soon after my rape by my adult cousin when I was 17, called and left a horrible voicemail on our home phone when she knew nobody would be home to delete it and we would all hear it. We had gotten into an argument the night before over the phone, I don’t remember why, but I had ended it by calling her a “fucking pothead” \n\nHer voicemail said “I may be a pothead but at least I’m not the one that fucked my cousin.” …. We just don’t talk about that tho. \n\nAnyway, she told my mom that she doesn’t believe what my daughter has claimed. At least “not like how it was portrayed,” that if anything did happen why did no adults know or hear (she said whenever he’d hear someone coming up the stairs he would stop) and why nobody noticed her walking funny (which is stupid anyway, after my first rape he told me he was disappointed I could still walk a straight line…) \n\nSo in other words it would’ve been my fault as I should have known (even tho my daughter says the first time was at a sleepover at my sisters house about a month before the boys were placed with us - again, idk how accurate her timeline is but still). \n\nAlso, most disturbingly and imo unforgivable, my sister (46yo) said that my daughter should own up to her part in whatever happened between the two of them… because she doesn’t believe for a minute that it was ALL her son. That it doesn’t add up. Because how could it have happened and nobody notice anything and my daughter didn’t say anything so she clearly wasn’t bothered by it… \n\nVerbatim “I think something happened on both parts. Not that it was one sided and rape… I do not believe for one minute that it was all [cousin] and that [my daughter] was forced and raped.” And “it’s clear that his side doesn’t matter.” \n\nBecause apparently he swore up and down and even on our recently deceased grandmothers grave that he never did that. I pointed out to my mom that I had an ex bf who looked me in the eye and promised me he had never and would never cheat on me, swore on his fathers grave (whom we had just buried), and then had sex with me. He had just gotten home from fucking someone else. In other words, promises don’t mean shit. \n\nOur therapist sister tried to open up communication about everything on our family group chat. Saying she asked her kids. That her daughter said mine told her back in September that this cousin had raped her but she didn’t tell because it seemed like a long time ago and she didn’t have much emotion behind it. She also said this same cousin tried to get her to take all her clothes off one time. \n\nI replied and said how my mind was reeling and I was so heartbroken and can’t wrap my mind around the fact that this happened to my daughter, that I’m already having to help her cope with this in her first decade of life and never ever thought that would happen. That what I knew for sure was that it definitely did happen and that it was absolutely in no way her fault. That it was pointless to get hung up on the number of times she claims because even once would be horrible and traumatic and absolutely NOT ok. \n\nMy sister then left the family group chat. \n\nOther pertinent info and clues: as I said, my niece told my other sister how this cousin tried to get her to take her clothes off. This same sisters older son used to play fortnite with this cousin and ended up blocking him because he would say the most explicit messed up and mean stuff all the time. Also, apparently soon before they all went to Disney together, they were playing upstairs and this cousin tried to get my niece and nephew to play a “game” where they’d take clothes off and look at/lick his privates and they said absolutely not. Actually just got clarification on this: the cousin in question apparently had my others nephew’s privates in his mouth and tried to get him to do it back. He denied that too of course. \n\nAlso, when my daughter was around 2-3, when I was giving her a bath one night and washing her privates she said “[Cousin] touched my privates once.” I had immediately confronted my sister about this and she had this cavalier attitude of well he said he didn’t, so..idk. My daughter was so little and I couldn’t get any more info out of her and she didn’t bring it up anymore so I stupidly but cautiously accepted that maybe nothing really did happen with that. \n\nAlso, one time when my nephews were placed with me by cps, my ex wife and I went to the grocery store or some quick errand one day and left the 15yo nephew (older brother to this cousin) in charge of him and my daughter. By the time we got back we were told that while we were gone, he had basically gone ape shit and was screaming and cussing (older nephew had recorded the stuff younger nephew had been yelling and omg..) and that he had run all through our house completely naked and like shaking his junk right where my daughter could completely see. \n\nI fkn flipped out about this, yelled at him and told him how inappropriate and horrible it was, I even contacted the caseworker and told her about it and said that I didn’t feel comfortable having him in my house with my daughter anymore and that she would have to place him elsewhere. She told me that they wouldn’t split up the siblings (even tho older nephew wanted to stay with us and we wanted him to as well) so if one was gonna be moved, the other would have to as well. So I relented, because I felt stuck. \n\nThere was also a time recently where he sent a screenshot to my daughter of a Snapchat conversation he was having in which whoever it was sent him a pic of some girl knuckles-deep fingering herself. I flipped out about that too and his reason was that my daughter kept bugging him and texting and asking why he wasn’t answering or responding so he showed her the screenshot so she could know what he was so busy doing that he couldn’t answer her. \n\nWhen my daughter was about 4-5, I ended up having to have the sex talk with her because my nephew decided to (incorrectly) tell her what sex was and I had to clear up the misinformation. \n\nWhen my nephews were placed back with my sister I ended up cleaning out the room he had been using including the closet to set it up for my daughter as it was the bigger room. In the closet I found a duffel bag that contained my ex wife’s fucking gun that had gone missing a month or so before, which was loaded with hollow points!!! It also contained a broken phone, mismatched charger, some lighters, and a couple pocket knives. I never even got to confront him about all that. I did eventually tell my sister though. I didn’t at first because we’d signed a paper stating all firearms would be locked in the safe at all times and my wife did not abide by this and ended up keeping that one in her bedside table in case of emergencies. We didn’t notice until one day we wanted to go to the shooting range and couldn’t find it. \n\nAlso, once my daughter was moved back into the bigger bedroom she started having frequent nightmares and acting weirdly freaked out in a way she had never been before, and what she said was always something like “I just keep thinking that [cousin] is gonna come in here and do something bad to me / hurt me” which of course set off alarm bells in my head but by this time they had gone back to their mother and hadn’t been back over so he literally wasn’t even there so I’d be like what do you mean?? \n\nAnd she’d say she didn’t know, she just had the feeling that he was gonna come in her room and do something and so she was afraid. At the time I thought maybe she was just being dramatic and trying to get out of having to go to bed.. but I’m positive I asked her if anything had happened or if he had done anything to her before and she said no and so I was like ok then go back to bed. :( \n\nI also found out later that he put my cat in a backpack and swung her all around.. and trapped our other cat in the bathtub and turned on the shower. And that he tried to get my daughter to smoke cigarettes. \n\nThis all just fucking breaks my heart. And my mind. He used to be my favorite of all my nephews when he was tiny, he was always so cute and sweet and we had such a good connection and relationship. But then with all the shit he went through his behavior has gotten to the point where nobody really wants him around, especially if they have to be responsible for correcting him and keeping him under control. \n\nNow, idk what to do or what will happen. My daughter has been asking me what will happen and idk what to tell her. I asked her what she would want to have happen and she said she wanted him in huge trouble.. I had to clarify because I didn’t know if she meant legal trouble or trouble by his mom or just to finally admit and acknowledge what he put her through because she’d said she hadn’t wanted to lose him as a cousin and friend and that he’s changed now. \n\nShe answered all the above. That she wants him to be legally prosecuted and put in juvie and that maybe they can be friends again when he gets out, but she wants him to be punished for what he did to her because it gave her so much trauma and anxiety and that he took away her ability to be/feel like a normal kid anymore. That he knows what he did and he knows it was wrong. And my sister is choosing to invalidate her experience and victim-blame as though a 7yo needs to take any kind of responsibility for an older boy forcing himself on her. \n\nIdk what to do now. I didn’t wanna cause a whole big thing about it initially, but now I’m thinking maybe that’s only because in my family (of origin) things like this were never prosecuted, the victims were always to blame at least somewhat, the abusers always sympathized with. Looking back, I hated my mother for years because she wouldn’t prosecute my rapist on my behalf. In fact she told me I was a whore and I must’ve wanted it because I went back and let it happen a second time. \n\nSo, that’s the toxicity I come from which is why I need objective, level-headed advice. \nI keep trying to think of what I wished my mother would’ve done when I finally told, even tho it was inconvenient and fucked up a lot of family dynamics and stuff. \n\nI keep catching myself feeling bad for my sister and like it’s my fault this is getting dumped in her lap and made a huge deal of, feeling guilty for putting this on her.. but trying to remember that it’s not me (or my daughter) that did anything to anyone or put this shit on anyone. It was him. \n\nSo I’m trying hard af to push away all the feelings of guilt so I can do what’s best for my child. Trying to remember that it’s not me hurting my sister or attacking her son, that even though it is causing shit and turning her away from me completely because she feels attacked/feels her son is being wrongfully attacked, and to zero in and only focus on what’s best for my daughter and advocating for her no matter what it does to anyone else. \n\nAnd honestly, seeing my sisters responses to my mom now is making that a lot easier. Seeing her deny, protect, excuse, and then place blame on my daughter for what her son did to her… I can’t even explain the fury I feel at that. \n\nI told her if we report it it’ll be a whole big thing like last time and maybe even go to court and that once that is set in motion there is no going back (she said she is fine with that) and that if the judge or whoever was to think or find out she wasn’t being truthful about it she could be in trouble (to which she vehemently said she is NOT lying, she is telling the absolute truth, and I told her I believe her) and I just wanted her to be prepared for how it could go.\n\nShe was adamant that she is aware of, prepared for, and ok with the consequences of pursuing this legally. I wanted to make sure in case she would refuse to relive it and tell more people. \n\nI hate confrontation and hate the idea of hurting my sister and condemning her son, but I think that’s because I’m still in denial myself. I can’t get my mind to completely accept this as truth. It hurts so bad any time I get close. So I guess that’s why I’m writing this.. maybe to get advice, maybe more so to get validation and gather my mental strength to face all of this head on. \n\nSo now what? What tf do I do with this?! Even if I don’t make the call myself, it’s gonna come up in therapy for me and her both and I know they are mandated reporters. I’m wondering will they (cps, law enforcement, whoever) even do anything since there was already a case open about this (this time frame, these kids, same subject matter of kid-on-kid sexual abuse) since the only thing different is that it went much farther then she actually said it did? \n\nWill they open a whole new case and start from scratch? I guess maybe that would just be bureaucratic and irrelevant to how it actually plays out. Will they believe her and take it seriously since she had said before that it was only inappropriate talk and touching? \n\nHow do I help her get through this?! After I was raped by my cousin I tried to kill myself and that only happened to me twice, and at 17 years old, by my adopted (not biological) cousin.. she says it happened to her many many times and at only 7 or so years old. \n\nWhen she was born I remember saying that maybe it was good I had gone through that so that if my daughter ever goes through sexual assault or rape I would know what she would need and how to help her but I just keep drawing a blank because it’s so fucked up and it hurts so bad to accept it as fact, and I never thought it would soooo line up with my own trauma - it’s definitely bringing up a lot of memories and feelings for me as well. \n\nI’ve wished so hard the past few days that I could find out that she made it up and lied about it and that my baby girl was not truly raped by someone she should’ve been safe with, but deep down I know that is only wishful thinking. She was sobbing and looking me in the eyes telling me this really happened to her, he really did this horrible thing. I don’t believe she was lying or fabricating any of it, and neither do my parents. And taking into account all of the warning signs and clues and hindsight, it truly is not unbelievable, if I’m being honest with myself. \n\nAnd thinking back to my own situation, what I so fucking desperately needed and did not get was for my mom to believe me and be on my side and actually do something about it, regardless of how hairy things got with family members. The one thing that got me through and is still so significant to me from that experience was the fact that my dad believed me, immediately and completely. \n\nMy daughter has already begun to dabble in self harm (scratching herself raw with her fingernails) and has 3x now on different occasions let it slip that she’s having suicidal thoughts. And I of course feel so much fucking guilt and blame myself, but I need to manage that on my own time and not let her feel like I’m making it about me or like she has to feel guilty for “causing” me to be upset by telling all this. She’s already worried about that as it is. \n\nI asked her what made her finally come out with all this and she said it was because she was listening to me talk about my rape, without shame, and the lack of support I had afterward, how hard it was, even tho people told me it wasn’t rape and blamed me, and it gave her the courage to come out with her story as well, and plus she wanted me to know she could relate (because my sweet girl was wanted to let me know I wasn’t alone in the horrible shit I had been through). \n\nSomeone please tell me what to do. How to navigate this. How to help my daughter through it. I obviously should fiercely and fervently believe her completely, right? I still have the phone number of the caseworker that dealt with this to begin with six months ago, should I text or call him? Let it come out in therapy? Fuck. I wish this wasn’t real. I hurt so bad for my baby girl. :(\n\nTL;DR - Four days ago my 10yo daughter disclosed to me that her male cousin, who is 4 years older than she is, actually raped and sodomized her 3-4 years ago when previously she had told me and CPS that it had only been inappropriate talk and touching. Wtf do I do.",
    "title": "TW: CSA - desperate for advice ASAP",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1635181278,
    "score": 2,
    "keyword": "mixed race principal"
  },
  {
    "text": "Pissed off and looking for examples of women/BIPOC owned companies I’m female, millennial, and mixed race, which are all relevant to my story. I recently attended a three-hour marketing seminar as part of a larger business conference event. From the very beginning of the conference, I was shocked to be surrounded by 90% white men, very few women, and even fewer people of color. \n\nThroughout the three-hour seminar, the speaker (white male, in his 40s) showed numerous examples of what he deemed to be successful marketing, including a series of three video commercials back-to-back, each featuring a white, male CEO (or a pair of white, male CEOs), sharing the story of their company. They met in college! They were outsiders to the industry! They took the world of [razors, socks, deodorant] by storm! Immediately after showing these three videos, the presenter said, “When customers can see themselves in your product, that’s when they'll feel a connection with you.” \n\nEvery example in his presentation featured white men as CEOs or in positions of leadership. With each example, it felt increasingly ridiculous. Three hours is a loooong time. The only mention of women was their potential as a customer base, an audience to be marketed to. He spent a cringey amount of time discussing “Millennial Moms,” which he kept referring to as “The Birth of Karen.” Every comment about women and/or millennials was derogatory. No notice that there were actual millennial moms in his audience (leaders in their businesses!) among all the white men present. \n\nAfter the seminar, I went to the front of the room to speak with the presenter. I pointed out the irony of what he said about customers making connections if they can see themselves in a company’s product, when I didn’t see myself represented in any part of his presentation. His response was, “I didn’t choose these companies as examples because they were founded by white men, I chose them because they are great examples of marketing.” I told him to try looking harder. \n\nRedditors, would you please comment with links of amazing women and BIPOC owned companies so I can fill this guy’s inbox with examples for his future presentations? Please and thank you.",
    "title": "Pissed off and looking for examples of women/BIPOC owned companies",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626464187,
    "score": 1,
    "keyword": "mixed race principal"
  },
  {
    "text": "Leaving my teaching position soon I’m a first year teacher at a charter school and my mental health has taken a steep nosedive. The thought of going back onto campus fills me with dread, so I’m planning on quitting with no notice (I’m an at-will employee and checked my contract already). I have no lesson plans for the coming week so have nothing for a substitute. Is that okay? Can I just go? I can’t do this anymore. I had 2 panic attacks last week. One was so bad I had to go home. I can’t do this. I live with a very immunocompromised family member and most of these kids are unvaccinated. We have so many kids that we can’t social distance and I have to remind them everyday to keep their damn masks on. I hate to leave the other teachers in the lurch, but I can’t go back. At this point, I don’t care if everyone there hates me, I just can’t go back. \n\nI know I can leave without notice, but can I leave without giving them any lesson plans? I have literally nothing to give them.\n\nEdit to  add: I'm making plans for the next week, complete with all materials. Thanks for the advice, folks! One more question: what do I do about the student work that I haven't graded yet? Do I just drop it off with someone and let them handle it? To be honest, I don't want to grade it if I'm leaving! I don't want to take on any more work for this job that I'm not staying at!\n\nEdit 2: just sent in the resignation email to my principal and coach. Mixed feelings, but relief is definitely up there!",
    "title": "Leaving my teaching position soon",
    "subreddit": "Teachers",
    "timestamp": 1630325702,
    "score": 92,
    "keyword": "mixed race principal"
  },
  {
    "text": "Andrew Yang, leading Mayor Candidate for NYC, blames the United Federation of Teachers for continuation of school closures Andrew Yang is fed up with New York City’s school closures, and he’s not mincing words about it.\n\nThe leading mayoral candidate, who has a 5-year-old son in a Manhattan public school, took aim at the city’s 190,000-member United Federation of Teachers for its perceived role in delaying school openings during an interview with POLITICO this week.\n\n\n“I will confess to being a parent that has been frustrated by how slow our schools have been to open, and I do believe that the UFT has been a significant reason why our schools have been slow to open,” Yang said.\n\nHe has been among the most vocal of the Democratic mayoral candidates in expressing displeasure with how the de Blasio administration has handled school closures amid the pandemic.\n\nHis comment may endear him to voters who have been agitating to reopen schools faster, distressed by the academic and emotional toll online learning takes on young children and the logistical hurdles it poses for working parents.\n\nBut the remark — made during a 45-minute, wide-ranging interview Sunday — puts him at odds with one of the largest public-sector unions in the city, and one that is presently screening candidates ahead of an expected endorsement next month.\n\n“The UFT was the leading force in New York City public schools opening and opening safely, protecting students and staff. Mr. Yang needs to do his homework,” UFT president Michael Mulgrew said in a prepared statement. The union leader has blamed the de Blasio administration for problems associated with school reopenings, which are underway with relatively few virus occurrences.\n\nThe mayor recently announced a plan to begin readmitting high school students to in-person learning on March 22.\n\n\n\nIt may seem counterintuitive for a political candidate to criticize a large union that has the resources to actively stump for or against someone in the race — albeit with a poor track record in recent decades — and money to pour into negative advertisements. The union spent $2.7 million on the 2013 mayor's race, though its preferred candidate lost to de Blasio.\n\nBut skepticism of teachers unions tracks with remarks Yang made during a 2019 interview with a controversial libertarian podcast host, Dave Rubin.\n\nYang was running for president at the time, and during the interview he advocated for smaller federal government, a higher bar for teacher tenure and a pathway for more charter schools. During that conversation, which was reported by POLITICO on Monday, Yang also blasted teachers’ unions as a hindrance to school choice and blamed politicians for bending to their will.\n\nAnd as part of his argument for a universal basic income, Yang pointed out the failures of a poorly-funded public school system, blaming teachers’ unions for restricting principals from hiring decisions.\n\n“There are excellent charter schools and terrible charter schools. We should just be pro-excellent school, and [stop] saying that this entire category of school is somehow problematic,” he told Rubin, a host with a roster of controversial, far-right guests.\n\nHe labeled himself “pro-charter” and added, “I think it’s ridiculous that we’re tenuring teachers at like the two-year mark or something, and make it so you can’t be paid or you can’t be disciplined or fired.”\n\nInstead, he said, principals should be empowered to build their own teams. “And right now principals have their hands tied by union regs and whatnot,” he added.\n\nWhen asked whether he had heard a good argument against charter schools, Yang said no.\n\n“Unfortunately, I think the main argument is a political one, where teachers unions hate charters,” he told Rubin. “Teachers' unions are a very, very powerful constituency. And so some politicians have said 'I'm better served by getting behind this point of view.’”\n\nDespite his positions, which are anathema to the UFT, several people familiar with the union’s endorsement process said it is reluctantly considering Yang as it evaluates candidates in the crowded field of Democrats looking to replace de Blasio, whose term ends on Dec. 31. Yang is not the organization’s first choice, the people said, but he is leading the polls so union officials feel it would be foolish to ignore him.\n\nDuring a radio appearance on WNYC’s The Brian Lehrer Show Thursday, Mulgrew said candidate screening is underway and the union will host another forum with final contenders before making a decision.\n\n“It’s a very important election cycle,” he said. “Believe me, the UFT members of New York City are not shy about having their opinions heard, which is why I love them dearly.”\n\nIn a statement issued Friday, Mulgrew took more direct aim at Yang.\n\n\"The members of the UFT devote their professional lives to educating people, and it is clear that Mr. Yang has a great deal to learn,\" he said. \"If he is interested in pursuing the support of our city’s teachers, Mr. Yang should take the opportunity to clarify his positions.\"\n\nTwo former City Hall officials speculated that teachers' union skepticism may not be a bad strategy in this cycle.\n\n“They’re a pretty vicious and effective opponent, so it’s usually dangerous. But there is real anger about the union’s role in school re-openings, unclear how wide, but it’s out there,” said Marc La Vorgna, a media consultant who worked for Mayor Mike Bloomberg — a frequent foe of the UFT. “If he knows he isn’t getting the endorsement and they are going to come after him anyway, then it’s a smart play.”\n\nEric Phillips, who served as de Blasio’s press secretary, agreed.\n\n“I think in taking on some of the traditional elements of the UFT, he probably is going to find some support for that,” Phillips said.\n\nhttps://www.politico.com/states/new-york/albany/story/2021/03/18/yang-lays-blame-on-teachers-union-for-sluggish-pace-of-school-reopenings-1368977",
    "title": "Andrew Yang, leading Mayor Candidate for NYC, blames the United Federation of Teachers for continuation of school closures",
    "subreddit": "Teachers",
    "timestamp": 1616245808,
    "score": 75,
    "keyword": "mixed race principal"
  },
  {
    "text": "Angry Parent is Threatening Me I have a student named Derek (not his real name). Derek is not one of my favorite students, though I would certainly never indicate any of the kind to him or to any of my students.\n\nHe's something of a tattle tell and a trouble maker. During pre-Covid times, he would poke another student with a pencil. The student would ask him to stop. After he continued poking the other student, his pencil would be snatched away, snapped in half, and dropped on the floor.\n\n\"TEACHER! TEACHER!\" Derek would shout (even though he knows my name along with the fact that most of my students call me \"chef\" because I'm the chef instructor of a Culinary Arts program).\n\n\"\\_\\_\\_\\_\\_ stole my pencil and broke it!\"\n\n\"Were you poking him with it?\"\n\nDerek would study his feet. \"I dunno. Maybe.\"\n\n\"Did he ask you to stop?\"\n\n\"I don't remember.\"\n\n\"Did you poke him again after he asked you to stop?\"\n\n\"HE BROKE MY PENCIL!\"\n\nAfter telling the other student not to take pencils away from Derek or to snap them in half, I returned to my instruction. Derek had other plans. At home he tattled on me to his mother by offering a one sided perspective. \"And I wasn't doing ANYTHING and a bully took my pencil away and broke it. I told teacher and he didn't do ANYTHING.\"\n\nIncensed over how I had allowed her precious high school freshman to be \"bullied,\" Mama Bear would start to metaphorically poking me.\n\n\"WHY ARE YOU ALLOWING MY SON TO BE BULLIED?\" she would demand via email. \"RESPOND AT ONCE!\"\n\nI typically do not reply \"at once.\" I usually wait for 24 hours. Since I've had lots of prior experiences with this kid (who was also with me as an 8th grader), I knew that it didn't matter what I said because the truth doesn't matter. This parent was prepared to believe anything her son had to say. She was equally prepared to believe that anything I had to say was a lie.\n\nShe's played this game with other teachers. With other teachers she's also played the race card. \"YOU HATE MY CHILD BECAUSE HE'S BLACK!\" The other teachers have all been white.\n\nShe has NOT played this game with me because I'm not white. I'm Asian. I'm even more of a minority than this parent is.\n\nThis hasn't stopped her from relentlessly badgering me.\n\n\"MY SON CLAIMS HE TURNED AN ASSIGNMENT IN BUT HIS GRADE SAYS THAT IT'S MISSING. EXPLAIN!\"\n\nI checked and found that although I had graded an assignment on Canvas (our instructional platform), for reasons unknown, this grade wasn't carried over to our electronic gradebook (Infinite Campus). I sent Derek's mother a thank you note for having brought this to my attention. I explained that Canvas had not transferred these grades to Infinite Campus. I told her that I had reported this to IT and had updated Derek's grades.\n\n\"WHY DOES HE ONLY HAVE A 71?\"\n\nI explained that his low GPA came from the fact that he had only earned a 70 on a unit test. Since the district has required us to weight all tests at 90% of a student's GPA, all test grades are really important.\n\n\"WHY HAS HIS GRADE FLUCTUATED?\"\n\nI have no idea what she meant by this question. Grade point averages change as new grades are added. This is basic math. Instead of saying this to her, I told her firmly but politely that I had addressed her concern about a missing grade and thanked her again for bringing this matter to my attention.\n\nShe's now threatening to complain about me to the district office because I'm rude and I'm allegedly not answering her questions.\n\nI am not worried. She shot her credibility with the district many years ago after she tried to convince the assistant superintendent that our principal, the assistant principal, and all of Derek's teachers \"hate\" her son because he's black.\n\nThis woman has reportedly been screaming at teachers and building administrators ever since her son was enrolled in kindergarten. She will doubtlessly continue to complain so long as Derek remains enrolled in our school.\n\nLucky us.\n\n(sigh)",
    "title": "Angry Parent is Threatening Me",
    "subreddit": "Teachers",
    "timestamp": 1618881513,
    "score": 28,
    "keyword": "mixed race principal"
  },
  {
    "text": "PLS HELP RESTORE MY FAITH IN HUMANITY I just finished my first year as a bilingual Kindergarten teacher. I know what you're thinking... \"you signed up for hell when you chose Kindergarten\" but those sweet little psychos and their families are the only thing that kept me going this year.  \n\nThere are a lot of people involved in this so here is a key for who they are. \n\nU = other bilingual teacher \n\nP = director of human resources\n\nA = executive director of human resources\n\nG = superintendent\n\nK = principal\n\nB = vice principal \n\nJ = ESL specialist\n\nHere we go...\n\nAugust 2020 I thought I had found my dream job. I had moved back to my hometown where my parents have taught for as long as I could attend school. It was my dad's dream to one day get ready with his wife and daughter in the morning to all go to school to teach. So when he heard I got a job in the same district they teach in, he literally got tears in his eyes. (He was a computer teacher...so, he doesn't cry much. Lol) I had been collecting bilingual books since college and I wanted to teach at a Title I school where I could help where the most help was needed. So.... literally my dream job. \n\nSkip to October 2020, the kids have now been in school about a month. I was loving it..masks, desk shields, and all. October 14th was one of my students' birthdays; one day before mine. We celebrated and I had let the birthday boy pass out his cupcakes WITHOUT A MASK UGHHH. (Later, they asked people in charge of COVID stuff if my class had to quarantine and they said no bc it wasn't long enough of an interaction) Anyways... It's October 15th, 6:00am and I get an email from birthday boy's mom that he has COVID. rip. I come rushing into school asking what I'm supposed to do, contact tracing, etc. The nurse asks if we followed protocols & I responded yes except for the cupcake incident. But I told her to check with U , the other bilingual teacher, because she posted a video of the kid with two other kids sitting together without a mask on Seesaw. (We switched classes and taught each other's classes daily)  I go tell U to expect the nurse because my student has COVID and she freaks out bc she never has her mask on either. \n\nThen, I get called to a meeting with the nurse, U, and K (the principal). K tells us that two of my students will have to quarantine because U could not confirm that she asked the students to put the masks on within 15 minutes. We're sent back to class and I get an email about another meeting with K and U during my planning time. I go and K lets me know that U has concerns. Apparently, U has been feeling for a while that our students' parents are comparing us and that I am purposely trying to make her look bad. I tell her that I was just trying to give the kids as much resources as possible and didn't mean to make her look bad. She loses her shit and yells that she can't trust me and that I just want to be better than everyone. K tries to calm her down and then it's time to go pick up the kids from specials. I finish my day feeling really freaking confused and get an email about AN AFTERSCHOOL MEETING. I sit throught another meeting where U compares me to a 17 yo highschool girl (I am 22 and she was in her 50s). I am not exaggerating when I tell you that this woman stalked my SEESAW ACCOUNT to see if anyone had their masks off and was ready to show a file-folder portfolio of it and then proceeded to SCREAM that I'M a traitor. I couldn't get a word in because K proceeded to YELL AT HER to be quiet and stop talking ...no college program or professional development could have prepared me for what was happening before my eyes. Then, the lord answered my prayers and K told me that I could go so that her and U could have a private conversation. \n\nEventually, K tells me to try to be considerate about how my relationship with parents could be hurting U. Despite my own morals, I stop sending as much resources out. Meanwhile U has been at work on the other 4 Kindergarten teachers on the team. She tells them how I'm a traitor and that I think I'm better than all of them. I try to still interact with them but they start leaving me out of things and eventually have their own group chat without me. \n\nA few weeks later, I share with a colleague that I have known since I was 5 that I feel like I'm being bullied. That colleague shares it with K, the principal. The kindergarten team has to have a meeting with K because two other teachers were verbally fighting in the hallway. But, they had already beefed it out so the attention turns to me. Except I had NO IDEA we were about to talk about why I felt bullied. This was basically an opportunity for the other teachers to openly shit on me for having a \"communication problem with my teammate\" and for not \"socializing enough\". \n\nAt this point, my anxiety (which is usually controlled by medication) was off the rail and I felt completely alone. I went to see my doctor and she upped my dose and gave me additional meds which gave me KILLER side effects. I had to absent a few days. Because of the shortage of substitutes, the teachers had to split my kids up and this gave them more reason to hate me. FML. I come back and K has a meeting with me to tell me my team was upset with me because of my absences. I explained that I was having major side effects from the meds and I told her why I was anxious lately. She said she would push my eval date to later because she wasn't sure if I would be ready.  A week or so later I get a \"coin of excellence\" from  superintendent G because my students' parents are writing him emails about how happy they are. Soon enough, K calls me into her office and tells me she doesn't think she will consider me for rehire. I tell her that I would love to work on whatever it is she wants but I need specific examples of what she wants me to do. THESE WORDS WOULD COME BACK AND BITE ME IN THE ASS.  \n\nIt's now the day of the holiday party (right before our Thanksgiving/Christmas break). Our class is supposed to watch the Polar Express and I've created the cutest lesson to go with it where the kids create a book of tickets with a kind word for each of their classmates. One of the other teachers got sick and left so I had 5 of her kids come into my classroom that had no more chairs left. I get them settled and the kids continue working on the activity and watching the movie.  Then K and B (vice principal) come busting in. K tells me that B will watch my class and that I'm going to follow her. K tells me to take a look at my class and then she walks me outside of the room. She then proceeds to walk me to the other monolingual kindergarten teachers rooms and audibly says, \"THAT'S what I want you to do. That's what I want your class to look like\". The teacher was sitting at her desk on her laptop, the kids were all silent in their desks and watching the movie. She took my to the other classroom where it looked the exact same.. teacher at desk, silence, kids in chairs watching the movie. I tried to explain to her that I created an activity to go along with the movie but she told me to stop either the activity or movie immediately. We go back into my classroom where my students are literally rolling around the floor even though the vice principal was supposed to be \"watching them\". I get them to settle down and turn off the movie. K walks me around the room and points out everything that's wrong. Literally the definition of a Party Pooper. \n\nI've had enough at this point so I go to HR. My mom knew P (the director of HR) and assured me she would help. She was wrong. P listened and told me to sit down and have a talk with K after we return from the break. She also said she'd get me some district support since it sounded like I didnr have support at school. \n\nAfter break (January 2021) we have professional development before the kids come back. Things seemed fine with K and I was worried of stirring things up further. Things were NOT fine with K. She told me that J would now be in my class daily for about an hour to help me out. I thought this was for support until J ends up trying to boss me around and telling me that I'm not doing my job. That day I tell her to get out of my classroom because she is being a huge distraction to my students. If things aren't bad enough... I start getting a terrible cough. Eventually I have to leave early on a Friday because I feel really sick and completely lost my voice. Over the weekend, I have to go to urgent care and get a COVID test. The test comes out negative but the doctor is convinced it's a false negative...so, they write me a note and tell me I need to quarantine. I tell K, my team, and HR. HR then responds and tells me that my note doesn't qualify and that I will be docked after my remaining absences are used. I tell them that, in that case, I will be returning Monday. They then state that they will not allow me to return until I feel better... But, I will still be docked. That sounded like a bunch of balogna so I contacted my teacher union and she managed to get them to agree that if I can get a \"clearer note\" that I will get paid COVID leave. Please keep in mind that I'm dying of a fever and fighting off possible COVID. I call the urgent care enough to get them to pity me and they write \"due to covid symtoms\" on my note. Suddenly, those 4 magical words made my note \"qualify\". They give me the paid leave and I have about a weekend to recover until I have to go back. \n\nI get back to my classroom and someone has taken down all my students work in the hallway.     It's my first day back and K comes back \"for an observation\" and tells me how \"out of control\" my kids were while I've been gone. She tells me she'll need to meet for conference. During my conference time, she tells me how out of control my students have been while I've been gone. (Which hadn't been the case as evident by all the days that I had been texting with the substitutes) She then hits me with the, \"do you even want to teach kindergarten? Do you even want to be a teacher?\". I say, \"yes...I love teaching\". She responds, \"then you need to get better at it. It's not working out for you.\" She doesn't get enough time to shit on me because my students end up banging at my door because I was late to pick them up from specials. So, she tells me I need to meet after school. She tells me more BS and how she's not the only person that thinks I'm a terrible teacher. She says that my colleagues can never teach anything because of me, etc. \n\nI email superintendent G as soon as I leave the meeting and tell him to call me. He calls me that evening and I tell him everything. I'll give him props... He really had me thinking that he was going to \"fix\" this. He says that he wants me to continue in this district and that he would get A (executive director of HR) to give me a call and help me out. I tried to tell him that A was already biased because she was pissed about the COVID teacher union incident but he said it was fine. It was not fine. \n\nA ends up calling me eventually and tells me that she is going to tell me the exact same thing that P told me in November... To just sit down and talk to K about my feelings. I tell her I've tried but K is always aggressive and so she tells me to just try again. I email K at ungodly hours (because I'm not sleeping anyway) and tell her in the most professional way to please leave me alone so I have time to practice what she wants from me. So, she says that it's fine but proceeds to send in J to spy on me. \n\nI'm not taking that for an answer so I email superintendent G and tell him that I appreciate him sending me to A but K is now, by definition, harrasing me. He tells me to keep working with HR on the matter... But, he gets nervous so tells A to send me a discrimination and harrasment form so it can be investigation. Despite me telling him I'm uncomfortable with A doing the investigation, she is in charge of it anyway. \n\nIt is now mid February and have lost 20 pounds  (making me underweight), I have developed insomnia and the anxiety has turned into depression. Everytime the door to my classroom opens or I hear a knock, my heart races and I cry on the way to school every morning. I tell A that until she can assure me that I will not have contact with K, I am not returning to campus because I don't feel safe. She eventually agrees for B to be my \"point of contact\" instead of K while the investigation is going on. Those couple of weeks, I had to sit through meetings with B and U where U would just scream at me the entire time and B would try to calm her down.. but, they were the most peaceful I had ever had that school year because K was no longer harassing me. \n\nBut good things don't last, so A tells me that she has concluded her investigation and has found that all the adverse actions I have faced is due to my lack of success as a teacher. What did I expect? Soon, time for resignation approaches and I choose to resign for the upcoming school year. But, I'm still seeking justice bevause I cannot imagine another teacher (especially someone who doesn't have anyone experienced in their family) going through this hell. I talk to my teacher union but the dates of my membership makes them unable to help me with the situation so they refer me to the EEOC. I also get in touch with Workers Comp (who later calls me back and tells me that my principal was only trying to help and now I'm retaliating). But, EEOC tells me to continue documenting everything and to contact them again at the end of the school year. \n\nSkip to the last 3 weeks of school... K and B come down and tell me that I haven't scheduled my final appraisal so I'll have to do it now. I tell them I refuse because I've been asking for a different appraiser all year. They tell me that they will call HR and get it figured out. Later, B comes back and tells me that HR will also be at the meeting as witness and that we are meeting after school. I show up and managed to get all my ratings moved up  on the appraisal because of the evidence I present and K feels pressured since there are 2 witnesses. Then, A tells me that there are district employees that feel threatened by me so they are placing me on paid leave for the last 2 weeks. They take my keys, laptop, and that's it. I have to come pick up all my things about a week or so later and I'm not allowed to talk to anyone other than A (according to the letter the \"superintendent\" sent). I also talked to a school board member who says that what I went through was awful but there's nothing he can do. \n\nI can't get in touch with EEOC in my area but I have time for that... I still plan on bringing ally evidence to them as well. My current issue is that I just got 2 job offers and accepted one. However, when the new principal called K, she spewed all the same BS about me. So much for starting over... Like it wasn't bad enough she harassed me and ruined the year before. The principal wants to risk hiring me... But she admits that now she feels the need to have her eye on me. \n\nSo, that's why I'm here. All school year and summer I've been trying to advocate for this type of situation and show that WE DONT HAVE ROOM FOR THIS. There is already a HUGE teacher shortage... Why are you trying to get rid of the ones willing to come in and take the challenge?? And you wonder why retention rates are so high??? \n\nI am still being bullied by the district I grew up in and that my parents have served in for years and they're getting away with it. This is a shot in the dark... But I need help. What do you do when no one will listen? I have recordings of almost all of this...even when she said the infamous, \"Do you even want to be a teacher?\". And yes... I've showed this to everyone involved but they chose to ignore it. \n\nPlease help. \n\nLove,\n\nA heartbroken kindergarten teacher",
    "title": "PLS HELP RESTORE MY FAITH IN HUMANITY",
    "subreddit": "Teachers",
    "timestamp": 1626837564,
    "score": 23,
    "keyword": "mixed race principal"
  },
  {
    "text": "Adventures in Culinary Arts: A Tale of Three Meatballs My Culinary I students learned to make a brown sauce today. After pureeing the sauce, we made a simple derivative by stirring in some cream. The cream sauce was mixed with macaroni and was served with meatballs that the students made from scratch.\n\n[https://imgur.com/H5QT8kW](https://imgur.com/H5QT8kW)\n\nWhile the meatballs were baking in the oven, I told my students the story of Mr. Smith (not his real name).\n\nWhen I first transferred to my current school some six years ago, the principal decided to have a mid-year open house. Since she wanted to showcase my talents and advertise my presence, she gave me a budget and had me produce hundreds of appetizers with my students.\n\nWe made burger sliders, glazed berry tarts, deep fried pork egg rolls, flan with dulce de leche, and lots of other foods. We also made meatballs in a brown sauce.\n\nI teamed up with our business teacher to serve this food. While my students produced the food, the business teacher's FCCLA students wearing white dress shirts with red power ties and blue blazers served as our counter servers to serve the appetizers. We improvised a counter by placing a table sideways in the main hallway outside the kitchen door.\n\nI am told that no open house has ever been so well attended. I teach at a rural Title I high school of some 300 students. Each parent got 3 tickets for coming to our open house. Each ticket was redeemable for one portion of appetizers.\n\nMr. Smith is one of our teachers. It turned out that he LOVES meatballs. Even before we opened, he was in line to order meatballs. The meatballs came 3 to a portion. To the amusement of the students, he was in line FIVE TIMES throughout the night. He paid for the meatballs using extra tickets that he got from his wife. His wife happens to be our school principal.\n\nAfter telling this story to my class, the students asked if they could take Mr. Smith some meatballs. I've told the same story to all of my classes this week and since Mr. Smith is one of our most popular teachers, every single class has asked if they could take him a portion of meatballs.\n\nMr. Smith has been in gastronomic heaven, much to the amusement of his wife.\n\n**EDIT:** Just in case anyone were to wonder if Mr. Smith abused his spousal privileges by getting extra tickets, he did not. Each teacher, administrator, and staff member was given three tickets. Mr. Smith spent all of his tickets and then mooched two tickets from his wife.",
    "title": "Adventures in Culinary Arts: A Tale of Three Meatballs",
    "subreddit": "Teachers",
    "timestamp": 1620760687,
    "score": 18,
    "keyword": "mixed race principal"
  },
  {
    "text": "Alternatives I am seeing a lot of posts from people who are miserable and wanting out. I was in the same place as the school year approached in Tucson. I had applied for a lot of jobs teaching in Oregon and Washington, and I found myself irritated at all the hoops they wanted me to jump through just for a stinking interview. I started applying outside of teaching and low and behold I was offered a job in real estate managing a large community that is a mix of low income and regular housing at almost half again what I was going to be making in my 5th year as a teacher in Arizona. Giving notice was hard because I honestly loved my principal and the people I worked with, but I hated the district and the way they treated us. \n\nMy new job provides better benefits and waay better pay, including quarterly bonuses that I dont have to kiss ass to actually get. Its a lot of the same work, dealing with people, teaching them how to be good residents and how to navigate all the paperwork, managing a lot of the same issues, but its strictly 9-5. I leave my office at the end of the day and I dont think about work until I walk through the door again the next day. I also can pee when I want, take an hour lunch and I actually have an office and I dont have to buy anything for it. \n\nIts a high need field with jobs all over the place and the skillset teachers have really comes into play. There are options if you are unhappy, and they often pay a lot better and provide some of the same rewards. Dont burn yourself out.",
    "title": "Alternatives",
    "subreddit": "Teachers",
    "timestamp": 1631504133,
    "score": 18,
    "keyword": "mixed race principal"
  },
  {
    "text": "Kids getting consequences...makes them behave? Wow. TLDR: Admin finally backed us up and was shocked that it got the crazy class under control. Flair is contingent on them keeping it up, even though the kids will continue to test worse and worse next week. And probably again after fall break. \n\nMy school is basically a drain school. It's a middle school where we regularly have to remind parents that we don't have student parking, even if your child can drive legally. Kids will get expelled from other places and come here, like it's a halfway house to the alternative school. So of course, there's a horrible mix of kids who need the intense structure of military school and poor kids doing their absolute best. \n\nAdd to that all the special ed kids are in our team, because they could only get 2 special ed teachers for 7th grade--one for math, on for ELA. \n\nAdd to that they took a class with 12 special ed students and put all the behavior students in there too. \n\nIt's a madhouse. No one can handle them. They'll call the principal a bitch to her face and then their mom will swear that she's lying on them. \n\nWe are also a school that \"does PBIS\" AKA we're always told to buy kids candy and ice cream and pizza if they \"try\" (read--don't try at all) because not giving them rewards even when they don't meet expectations discourages them. No restorative circles. No goal setting classes. They still expect us to act like it's a hardass school where no one takes shit. It's just that when they get to admin they get a 10 minute time out for nearly killing each other. \n\nI finally got admin to give me one week of reasonability. If I've called parents and documented that this has happened before, the kid spends the day in ISS. If they cuss at a teacher, 2 days ISS. Refusal? ISS. Fights? OSS. No exceptions. If I send a kid to admin, they don't come back until the end of the day at least. \n\nShe came by expecting to see them going crazy today. She walked in to them silently taking their test 40 minutes in. Why? Because at the 6 minute mark a girl went to admin. And by the 15 minute mark she hadn't come back. \n\nThey saw their friends not coming because they were suspended. When she came in I just raised a brow. \n\nWe've been given permission to keep it up for that class instead of her plan, which was to split them up and ruin every other period instead of learning self management. \n\nTo be clear, I'm not write up happy. I hate doing this. But when kids are saying \"Write me up, I'll go sit in Mr. X's room.\" or \"I'm thirsty. Write me up so Mr. X will give me a sprite\" and flat saying that they think the admin is a joke, something has to change. I work in the classroom when I can. Last year I didn't have a single write up. Student's fidgeting? I find things for them to do more quietly like teaching them to twirl pencils. Student cusses me out? It's usually because they'd rather be in ISS than struggling to do my work, I show them that they can type out questions on our monitoring service and I can answer them for the whole class without anyone knowing they asked it. Kid is hungry? I keep bananas. People joke that I'm best with girls on probation who hate their mom because a lot of the \"problem\" girls are perfectly fine in my class. \n\nBut some kids just never got home training and after a year and a half virtual they'll have to get it at school.",
    "title": "Kids getting consequences...makes them behave? Wow.",
    "subreddit": "Teachers",
    "timestamp": 1632526951,
    "score": 19,
    "keyword": "mixed race principal"
  },
  {
    "text": "I told my students they were acting like brats today Today was supposed to be “student appreciation day.” We had “teacher appreciation day” earlier this week. We were told to plan something fun for the afternoon, so most of us just put on a movie and brought in a few snacks, and the school had provided pizza for lunch. My 6th grade class this year is a particularly difficult group. Teachers who had them previously all say it’s one of their worst groups in recent memory because there’s a lot of them who just have zero manners or respect for anyone but themselves. Their work ethic is atrocious (apparently it was terrible even before covid). There are of course some who are really wonderful kids who work hard, but they are a minority, but they tend to kind of get lost in the mix of so much nastiness. You have to really, really watch what you say with this group because there are a lot who will lie and spin things against you.\n\nSo after lunch I put on a movie. I decided on Pixar’s “Soul,” and I brought in chocolate chip cookies, chips, and juice boxes that I bought all myself. I only have 12 kids in person and the rest are online, so I put the computer as close to the board as I could so the kids at home could see it too.\n\nAs soon as I told them the movie, they complained. Some said they had seen it already so they complained about that. A few said they had seen it and thought it was stupid. The ones who actually wanted to watch it were drowned out by the loudness of the complainers. When I began passing out the snacks, I told them to sit down and I’d come around to all of them. Kids didn’t listen and were coming up trying to grab things out of my hands. I told them to sit down because, you know, social distancing (although who are we kidding here). Some complained that they were only getting one cookie and one juice box.\n\nWhile this is going on, several of the online kids are loudly complaining that they aren’t included and can’t have snacks too, and one even said “this school hates us!” I tried explaining there is only so much we can do when only half of us are here, but that wasn’t good enough for them. The few kids online who I know are quiet and appreciative, were totally lost in the mix of disrespectful ones. And the few in the classroom who were grateful for the movie and snacks were completely drowned out by the loud obnoxious ones. I think, after all was said and done, I had maybe two students say thank you for anything. This all happened within the span of only a few minutes, and I finally had enough, and I said “you guys are acting like such brats right now! You’re so ungrateful!” Of course, as soon as I said it I regretted it instantly. They went silent. A few moments later, two of my online kids who regularly give me grief, just went off at me, screaming that they were gonna tell their parents that I called them brats and one said “my mom will get you fired!” I muted the computer so I couldn’t hear them anymore and I just said to the kids who were here, “look, this afternoon was supposed to be relaxing. We put on a movie, you get to chill and eat junk food, and you don’t have to do any work. Why does this have to be so difficult?” Once everyone had calmed down I apologized for my choice of words earlier and said that I misspoke, and shouldn’t have used the word “brat.” I was just frustrated but I said that wasn’t an excuse to speak that way to them. Most of them understood and many apologized in return, and a couple kids even said “yeah, we were being pretty rude to you.”\n\nAfter we talked and calmed down, I told them I would start the movie only if they could be respectful. I said I wanted this to be fun, but if they can’t handle it then we turn it off. It’s a privilege. They agreed and were actually okay for the rest of the afternoon.\n\nBut I still felt terrible about calling them brats, and I was very worried that a parent would complain and I’d be in trouble. The one student who proclaimed that her mom would get me fired, actually does have a mom who I could see doing that. She thinks her daughter walks on water and farts rainbows. Any indication otherwise is met with attitude and snarky comments towards me. After school, I went in to my principal and explained what had happened, said that I spoke out of frustration and knew it was wrong, but that I did apologize to them. She was good about it and told me she appreciated the honesty and being proactive, and assured me it was fine. She also pointed out there were much worse things I could say, which is true! She said she knows this group is incredibly challenging and she understands the frustration they can bring, but that sometimes it’s better to just take a breather in the hallway when they get like that before you just lose it.\n\nSo, now I’m sitting here at home, and I haven’t gotten any nasty emails from parents yet. I’m so grateful my principal had my back in my moment of weakness. I may not always agree with decisions she makes, but at the end of the day I know she at least cares about teachers and has good intentions.\n\nTL;DR- my students were being obnoxious when I tried to have a fun movie afternoon with snacks. I got frustrated and told them they were being brats, and it raised hell. I ended up apologizing to them. And I explained to my principal who was supportive, thank God.",
    "title": "I told my students they were acting like brats today",
    "subreddit": "Teachers",
    "timestamp": 1612569497,
    "score": 12,
    "keyword": "mixed race principal"
  },
  {
    "text": "Advice for a 2nd-year teacher on dealing with a colleague? I must apologize in advance for how long-winded this post may end up being. I'm too detail-oriented and I like people to have the whole story. I thank whoever takes the time to read this whole long ramble.\n\nGot a new job for this upcoming school year. It's at a private parochial high school - not my ideal placement, but there were slim pickings. I'm one person in a two-person English department. Well, the other English teacher quit as well, so they hired another new teacher shortly after me. The other new hire is now the head of the department (if you really call two people a \"department\").\n\nBackstory: I sort of know the person who got hired for the other job. They would often come into my job when I was in college. They were very friendly and kind to me and let me know they had been a HS English teacher for 20 years. They always gave me their phone number and encouraged me to contact them anytime if I needed advice, venting, etc. (Platonically, people.) I had never reached out to them because I was just super busy at the time, and then COVID struck, but I was super grateful they were willing to help me.\n\nNow back to the current times. My current boss emails and asks if she can give my contact info to the new hire and I instantly recognized the name, so I said sure! As the title indicates, this will only be my second year teaching. So at first, I was enthused to have this person as my cohort that I could turn to for advice. My first year teaching was crappy at a crappy school with crappy people, so I was excited to realize I actually had someone to use as a mentor. \n\nNow, this person has been out of teaching for 2 years because they got married, moved, and their spouse allowed them to take a few years off to acclimate. So, understandably, this person is eager to get into the classroom and figure things out with curriculum and whatnot. But they had my phone number and were sending me like 8-10 texts at once, mostly while I was at school still teaching at my old job trying to finish out the year. This would go on usually 4/5 days a week. I'm terrible with boundaries so I have no idea what to tell people when I'm overwhelmed (working on that). They'd text bomb, then apologize, then text bomb again the next day.\n\nThe colleague also basically forced me out of my classroom. They told me, \"I can just picture myself in this room.\" speaking about my classroom, which was the bigger of the two. Then they went behind my back to the principal and said I said it was okay for them to have that room.\n\nAnother thing this person does is ask for my opinion then shoot it down. They are the head of the department but claim to want my input. Maybe my ideas are just bad? They also want to organize the whole curriculum their way, including my stuff, in a way that only makes sense to them. I don't think that's fair. Again, I should really voice my opinion more, but I feel like it will just get shot down. They're very steam-rollery.\n\nBut probably one of the worst things they did was deceive me and hurt the retiring teacher I'm replacing very deeply. the teacher I'm replacing had been there 12 years and was loved by many. She is retiring from teaching. Apparently, the colleague wasn't supposed to touch anything in the classroom until July 1 on the principal's orders so the old teacher would have ample time to clean out 12 years of stuff. The colleague went in there prematurely (like mid-June) and gutted everything, throwing away sentimental items and 22 years' worth of curriculum and notes for her master's thesis, amongst many other things. The retiring teacher raced to the school that day and was literally in tears seeing all her stuff in the trash and out in the hall when she was under the impression she had more time. I just stood there in awe and shock. (My room was cleared in June because the old teacher left on bad terms, so I was there moving in with permission) The colleague had told me the old teacher was finished, so she deceived me on that. Otherwise, I would have stopped her from chucking everything. I felt it was so rude and unprofessional to do that to a fellow teacher.\n\nThere are more things the colleague has done that make me feel a little iffy about her character but I think this is long enough. I'm disappointed because I thought I was about to work with someone I could trust at a school where I'm new again. They have no idea I feel this way, but I really don't desire to be buddy-buddy with them anymore. I'm going to try and just keep it professional with them. I'm looking for any advice on dealing with this type of person for the upcoming school year. Thanks for reading my long ramblings.",
    "title": "Advice for a 2nd-year teacher on dealing with a colleague?",
    "subreddit": "Teachers",
    "timestamp": 1625519882,
    "score": 12,
    "keyword": "mixed race principal"
  },
  {
    "text": "How do you get out of retail management? Trying this out because I’m feeling desperate, any advice is appreciated. I’ll try to be as specific as possible as to get the best advice. \n\nI’m 28 years old, I have my bachelors in psychology(kind of useless I know) and I’ve worked in big box retail for 8 years, management for 5. I’m a mom of 2 little boys who are only 1 and 2 years old, they’re 18 months apart. I received my most recent promotion 3 months ago and I feel like it was a huge mistake. I’m taking the position behind someone who was very well liked but let a lot of things slide that hurt the business and I’m cleaning up their mess, not to mention Christmas in retail is emotionally scarring for everyone involved. I’m a salaried manager with 3 leaders under me and probably about 80 team members. I’m required to work a minimum of 50 hours a week and almost all of my peers at other stores do more than that. \n\nMy first huge issue is the work/life balance, it’s not there. If I’m sick, I’m expected to be there, not to mention anything involving the kids. You’re judged hard for taking any kind of sick or personal day, but the worst part is that if I do it really details my business due to payroll allocation being so bad in January. They literally need bodies in the building. \n\nMy second huge issue is how powerless I feel as a manager. When I took the job, one of my subordinates told me they wanted to be fired so they could collect unemployment. They talk loudly and frequently about how much they hate the job, but the company is SO afraid of being sued that I have no ability to fire at will. I have to go through a loooong grueling performance management process, and it has to be perfectly in line with company expectation(that I was barely trained on) or I can’t even write them up. I also recently had an employee call out corporate HR and tell them I’m racist with completely and entirely made up examples of me being racist, outright made up. I know it’s hard to believe people in the internet when they say this, but they’re lying. And the higher ups know they’re lying, but again I cannot do anything about this, their recommendation is that I never speak to this person in private even as they spread lies to people about me. I’m very upset about not being able to defend my character. I’m literally in a mixed race relationship, which I know doesn’t automatically mean I’m not racist but still. \n\nAs for the job, I lead our entire salefloor operations: inbound, general merchandise, food, and in store fulfillment. I run a $30M process. I am wildly passionate about team development and have helped get a few of my employees promoted, I’m also very results driven and skilled in finding stopgaps in processes. \n\nI’m looking for something with more work life balance, less office politics, and maybe something that doesn’t require me to work every weekend.",
    "title": "How do you get out of retail management?",
    "subreddit": "careerguidance",
    "timestamp": 1609906610,
    "score": 9,
    "keyword": "mixed race principal"
  },
  {
    "text": "Job offers in which the title is lower than previous title but the work is a little different? What is your opinion about accepting a job with a lower level of seniority than your current or previous job?\n\nI received a job offer from a large company in which I like the team and the work but the only negative thing is that I am being given a lower title. Previously, I was at the principal level in a company that is in the same industry and similarly sized. For this new company, I had interviewed for \"senior product manager\" but the recruiter said they chose someone else for that position and that the hiring manager feels the regular product manager position is more appropriate for me. \n\nThe one thing that might be working against me is that my previous jobs did not have a formal product manager title but a \"principal consultant\" title and my work experience has been a mix of program management and product management.  Regardless, it feels like I am getting a lower title. The salary is also lower by approximately $5-10k.  Also, this company doesn't appear to have a principal level. I think it goes from senior to senior manager or director. So, the hierarchy of titles might be a little different overall. \n\nAny thoughts or advice? Would accepting such a position be a negative hit on my overall resume for any potential future interviews with future companies?",
    "title": "Job offers in which the title is lower than previous title but the work is a little different?",
    "subreddit": "careerguidance",
    "timestamp": 1623369190,
    "score": 4,
    "keyword": "mixed race principal"
  },
  {
    "text": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance! I'll try to keep this as short I as can...\n\nI am a 26-year-old male, Canadian citizen, with a BFA in dance from a liberal arts college in NYC. I've always been keen on education and specifically returning to school after my Bachelor's. I feel like I am on the pathway to figuring out what I would like to study but I am also very lost.\n\nTo provide some context, I am attended school in NYC from 2014-2018, during that time I struggled a lot with my mental health (anxiety, depression, bulimia). Unfortunately, the dance world was too overwhelming for me at the time, and it did not seem like a career that I have fully invested in anymore. I then had to return to Canada summer of 2019 due to the end of my student visa, and since then I've spent almost every day thinking about getting back on track and discovering myself again.\n\nI struggle with weighing my desires and dream life, and also considering the practicality of it all, especially amidst Covid restrictions. I am firm in that I would like to return to school in NYC—it's pretty much my home and where I feel most myself. Beyond that, I have little idea about what I would like to study. At first, I wanted to backtrack and complete a PostBacc so that I could move into the Nutrition & Dietetics field, which stemmed from my past with eating disorders and my drive to be a person to help those in need as I didn't receive that help when I needed it most and to also challenge my brain in a different way than I had used it during my undergrad. I realized that backtracking to fulfill the academic courses, whether in Canada or the US, requires me either finishing high school level courses in Canada and then moving to college/university level courses, or following the international student requirement PostBacc in the US in only one year. At that point, I realized my passion for the subject wasn't fully present, and that the urge to move into sciences came from low self-esteem as my BFA is often viewed as worthless.\n\nSince then, I've been attempting to do a lot of introspective work, which may also be a disadvantage because I am constantly in my head, to figure out my values, goals, desires, interests, etc. As much as I've been focusing on the things that I don't like or may not seem suitable for me, here are some **things I do know**:\n\n* I am queer and I would like to study/work in a space that allows me to investigate the insections of queerness in today's society\n* I am mixed race. I am Black and Japanese and I am interested in incorporating my background as a part of my studies and further into the political and social climate right now\n* I am creative- as much as I've moved away from my dreams of performing, I am still a creative-minded person. I would love to work with dancers, movers, other likeminded people\n* I am interested in fashion, specifically fashion marketing. I would love to study something along the lines of fashion marketing that includes an emphasis on race, inclusivity of models (dancers)\n\nI have other interests, but I guess those are my main focuses right now. With my job history since graduation including working in the admin fitness industry and short-lived receptionist jobs, I have little work experience that would suffice for a grad school application.\n\nTLDR; I guess I'm wondering, how can I figure out my passions and what to study in grad school considering the pandemic and being an international student determined to live in NYC\n\nThank you to anyone who has made it this far\n\nMuch love",
    "title": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance!",
    "subreddit": "careerguidance",
    "timestamp": 1619471969,
    "score": 1,
    "keyword": "mixed race principal"
  },
  {
    "text": "Please don't neglect your communication skills in favor of improving your leetcode skills One thing I found that doesn't appear enough on this SR is communication. I tend to see any variation of \"Is this offer good?\" or, \"Why do I have to grind leetcode?!\". Most of the on-the-job posts consist of \"I am in a toxic environment\" or \"Should I change jobs?\"\n\nI have a piece of career advice for anyone who is fairly new to the field that I think could prove helpful. \n\nFirst, a little about me as while I'm not going to hinder my anonymity I do feel I'm in a position where I can rightly prescribe advice to newer SE's / grads / those still school: I'm a Principal Engineer, and have a wide array of experience across operations (including release / implementation) as well as experience developing user-facing code, and internal tooling used organization-wide. I've worked in the DOD, networking space, e-commerce, and fin-tech. \n\nJobs I've held include:\n\n* Software engineer (senior/staff/principal)\n* DevOps Engineer\n* Lead DevOps engineer\n* Lead Site Reliability Engineer\n* Tech Lead\n* Software Development Manager\n* Director of Operations\n\nOne of the greatest skill deficiencies I see in engineers has always been communication. Communication is a very important part of our job. It allows us to promote our ideas, defend our solutions, play the Devil's Advocate, request help, refuse help, patronize others as well as compliment them. We can use communication to self-promote or self-deprecate. Communication literally sets us apart from every other species on this planet; that's not to say other species can't communicate, but that you won't see one chimpanzee explaining to another what the functional use of a blow-hole in Blue Whales is after explaining the nuances in their childrens' respective behavior while foraging for food. \n\nHere is a hard reality for many engineers: ***Even if you are the best software developer at your entire company, getting others (employees, external customers, internal customers) to actually use what you wrote is a different beast than writing a tool.***\n\nHere is another hard reality: ***Many tasks rely on others to \"un-block us\". There are of course times when the blocker is stubborn enough that solid communication doesn't help, but solid communication never hurts.*** \n\nIt's not uncommon for a developer to feel like a priority queue that relies on other priority queues which are poorly optimized, and plagued with race-conditions. \n\nBelow are some points I'd like to make on the subject of communication:\n\n**Being direct is not mutually exclusive with being polite**. I often find overtly rude people fall on the \"I'm just direct and straightforward!\" excuse as though it actually is an excuse for their rudeness. Consider different ways to say the same thing. This SR, and many others, while not inherently controversial (rudeness is often derived from controversial topics), is plagued with what I'd call \"direct rudeness\". Most of us who have posted here at one point or another have been faced with someone who disagreed but failed to do so in a way that made us feel any productive discussion was possible. \n\nConsider the following two versions of the same sentence (email threads I've actually witnessed, redacted of course):\n\n>Hello \\_\\_\\_\\_\\_, you are writing a tool that duplicates work done in a tool I've already written. You need to do a better job of communicating what you're working on so we aren't constantly creating duplicate work and wasting time.\n\nHowever, consider had it been structured slightly differently:\n\n>Hello \\_\\_\\_\\_\\_, I noticed you're contributing to a tool which I found here(assume a link to source). I'd like to learn more about your specific needs and perhaps discuss whether $TOOL\\_I\\_ALREADY\\_WROTE would fit them, and if not perhaps we could discuss continuing your thread of work towards enhancing the existing tool-set by adding any features you find it's lacking, as there is certainly some overlap. It'd be great if we could avoid duplicate efforts and enhance a tool that's already in use by the organization. Let me know your thoughts.\n\nBoth sentences communicate the same message, but the former puts the recipient on the defensive and immediately raises a few barriers in their mind. Upon receiving it they will be texting / chatting most of their close-colleagues about what a jerk you were. You turned your potential meeting on the topic into a street brawl instead of a discussion. Sometimes it can work out, but why cause additional stress? \n\nI'd argue that the second version of the sentence still gets the point across but puts the recipient and relative ease and opens a dialogue. To expand upon it a bit more in the second version we acknowledge that the recipient is writing a tool, and raise the concern on the overlapping functionality of that tool with an existing one. The purpose of the email is clearly stated as a goal; avoiding overlap. It's not an accusation but a goal and the use of 'we' puts a collective goal in the recipient's mind. Closing with \"Let me know your thoughts.\" opens a dialogue whereas the over-directness of the first version never actually indicates any interest in a dialogue or common goal.\n\n**Everyone is busy, even when they aren't.** We all need things from colleagues, and some colleagues are naturally more busy than others, and some seem like they're never actually working on anything. It's not our job as developers / individual contributors to judge another's workload (and if it is you should evaluate your company's situation). Many things are cyclical and you may be faced with situations where you need a thing done by someone you do not particularly enjoy working with. I have found strategies in communicating with such people that have been effective, for the most part. \n\nPeople love when you acknowledge \"how busy they are\" even when they aren't ever really busy from your perspective. Consider two people asking you for help:\n\n>Hey \\_\\_\\_\\_, can you please do \\_\\_\\_\\_ for me? This is very urgent and blocking $IMPORTANT\\_THING.\n\nConsider that your $IMPORTANT\\_THING isn't always their $IMPORTANT\\_THING. Your emergency isn't always theirs. In a company that is unified it certainly should be, and we should all be empathetic and helpful when we can and have the bandwidth, but it's not always the hand we're dealt. Consider this slight change:\n\n>Hey \\_\\_\\_\\_, I know you're really busy and I'm sorry to bother you! We have an urgent ongoing issue and I'd really, really appreciate it if you could take some time to look!\n\nKeep in mind these are all suggestions and things that have worked for me, but I've had much better luck with using the second version over the first. To reiterate: People love to appear busy. Especially at work. I don't know what it is about perpetually being busy, but it's a badge of honor in our work culture and to not be busy is to not be relevant. ***Also keep in mind that you yourself are not a metric by which to judge people. If you put in 80 hours a week at your salaried job, that's your prerogative. Do not hold that expectation of others.***\n\n**Strong opinions are still opinions.** This one is very relevant in our field as there are many subjects which are inherently based on opinions which draw a lot of controversy. Spaces vs tabs, programming syntax, which language to use, which tools to use, log formatting, etc.. Sometimes we're opinionated about the problems that need to be solved. Do they need to be solved? What's the reason we're solving it?\n\nAlways be self-aware of when you're prescribing your opinion vs. when you're prescribing factual-based information. Pick your battles. If you like tabs, and the project uses spaces, that is not the battle to pick. It's not even really worth a mention unless you can do it without being a jerk. If you want to prescribe your strong opinions onto others then be prepared to back up why you wish to do so.\n\nI recommend being objective, always. Do not make statements that cannot be backed up with other objective statements and explanations.\n\nIdentify why you're so strongly opinionated. Can you present your opinion in a way which shows it derives some mutual benefit?\n\nSometimes one opinion can be stronger than another opinion but this is usually rooted in **facts or history.** For example, the spaces vs. tabs talk is inherently based on opinion. If you walk into a project which uses tabs, and you are a spaces person, you ***do not just reformat the whole project to spaces. This will only make you appear to be an asshole.*** This is also a case where your ***opinion is wrong. Not in that one is superior to the other, but the fact that now when I run a diff in SCM across to revisions, you just created a shit-ton of change where there actually was none, making debugging harder and all because you felt your opinion was superior.*** \n\n**In closing -** I just wanted to possibly help some others in their communication style by providing some examples where I saw what I'd consider communication miss / failure, and examples that have personally worked wonders for me. I'm open to any additional input / advice / suggestions that could help others, as well, including if you want to indicate anywhere you disagree with the things I've said and make suggestions I might not have considered.\n\nJust always be aware that if you aren't communicating at your job, something is wrong. If you aren't communicating ***effectively*** then you are going to hit unnecessary hurdles in your career; a career that is inherently difficult to navigate given the constant churn on technological advancement / changes. I highly recommend any new engineer to host as many lunch and learns, and project demos as they can (code you wrote, tools you wrote, etc..) to improve these skills early in their career, as it will pay massive dividends in the years to come. As for written communication, if you are communicating something that feels edgy / difficult, then sit on it for a bit and proof-read / reread it. Pretend you're the recipient and how you'd respond if you received it from yourself. Consider your relationship with the person you're sending to, and how they respond to and consume various types of communication. Always be learning about your peers and learn how to navigate their personalities in ways that increases your success without inhibiting theirs.\n\n&#x200B;\n\nThanks for reading.",
    "title": "Please don't neglect your communication skills in favor of improving your leetcode skills",
    "subreddit": "cscareerquestions",
    "timestamp": 1634747902,
    "score": 2986,
    "keyword": "mixed race principal"
  },
  {
    "text": "How do you plan for a long, technical-focused careeer in CS? >**TL;DR**: How to age into an old fart (but young at heart and brain) in a technical, CS-related career?\n\n(long post ahead)\n\nHi,\n\nAs the title says, I'm curious about what others in this sub would do to build a long career in tech.\n\nThere are two articles mentioning that a CS career could be long-winded:\n\n* [Teach Yourself Programming in Ten Years (Peter Novig)](https://norvig.com/21-days.html)\n* [A forty year career (Will Larson)](https://lethain.com/forty-year-career/)\n\nFrom this post, I want to learn more about different \"paths\" one can take for a \\~30-year++ career in 2021. In addition, tips on how we could get more out of a long career will be great additions, too.\n\n*To start, I 'll share my take later in the post.*\n\n========================================\n\nIt is definitely welcome to hear from a wide range of experiences. But if you want to focus the discussion, I'm interested in \"paths\" with these traits:\n\n## Lean more towards the technical side (vs people management)\n\nI tend to enjoy concrete work, e.g: writing code, running system, etc. However, things that fall under the \"soft-skill \" umbrella is also OK. I'm just not fond of roles where you end up a meeting-goers every day, letting your technical chop get rusty.\n\n## Reward you for technical \"expertise\"\n\nHere, \"expertise\" means the  ability to solve and understand complex problems in your field.\n\nSome older engineers I know are very good in their field of choice. They also get paid well for it. For example, these fields are: data-center networking, software performance engineering, designing high-availablilty system, writing formally-verified software, etc.\n\nIMO, having expertise in these areas seems like a good way to build your advantage as we age. This is important to not become redudant when faced with hard-working junior colleagues. (It's a sad world like that...).\n\n&#x200B;\n\n&#x200B;\n\n========================================\n\n**A blurb about myself (for context)**\n\n* Graduated with a Bachelor in Computer Engineer => background in hardware, low-level software.\n* Self-learnt CS and more trendy industry topics since.\n* Worked as \"full-stack\", then backend dev (APIs, payment, data warehouse/pipelines, IoT).\n* Recently took on devops role for a decently-sized company, running Kubernetes in data centers and clouds.\n* Worked at various company sizes (<50 => 3000+) .\n* Also worked in various industries (video streaming, electrical/utilities, gaming).\n* Have been both individiual contributor and led small teams (3-5 people) unofficially.\n* Above average ToC (\\~130k++ cash in Canada, \\~6 YoE) but nothing too fancy.\n* Generally enjoy CS-related work, but also open about utilizing tech in other industries.\n\n## Thoughts on \"having a long career\"\n\nIn general, I believe it's possible to have a long career in tech (having seen some old and wise engineers myself). Yet, it seems a long career requires good techincal chops and other complimentary skillsets. For example, besides asking hard coding/system design questions, people also expect you to show leadership + communication skills in interviews/day-to-day work.\n\nIMO, the ideal role for me at 10 YoE (mid-30s) would be a Principal/Staff (software) engineer.\n\nIf these [archetypes of staff engineers](https://staffeng.com/guides/staff-archetypes) are indicative, I aim to be a mix of Tech Lead + Architect + Solver. For example, leading a small team to solve a business-impacting problem would be something interesting.\n\nPast 10 YoE, I don't really know what's else there would be.\n\n**Industry/area of focus**:\n\nI plan to stay in the \"computing infrastructure\" space.\n\n* My experiences are mostly with backends, data-intensive systems right now. This helps build up familiarity with the space.\n* I plan to expand my knowledge in networking, performance engineering soon. In the future, maybe some kernel-related work would be great.\n\nThere's some tenative paths for this area, IMO:\n\n* More **DevOps/SRE** work, hopefully with increasing scale.\n* Specialize in **data-center**: deeper work underneath the \"clouds\". This will need much better networking knowledge, though.\n* Specialize in **kernel/embeded software**. There is transferable knowledge on operating system. But there's a lot more to learn once you are outside the Linux kernel.\n* Specialize in **infra-related areas**: database, data warehouse/pipelines, etc.\n\n**To build up advantages**\n\nThis is what I have been doing so far:\n\n* Keep a hands-on approach to problem solving. For example: participate in on-call rotation, write code and deals with technical debt (mine and others). I also run a home computing lab for experiements.\n* Keep reading/learning. Nowadays, instead of jumping on the industry's latest, I am biased towards more researchy materials. For example books, CS research journal/[the morning paper](https://blog.acolyer.org/), etc.\n* Attempt to acquire novel work-like experiences outside of my dayjob. For example, I help some friends in an NGO with their software-related need.\n* Occasionally crunch some LeetCode to stay fit for medium+ problems.\n* Maintain a light professional network/connections to spot new opportunities.\n\n**On the $$ side**\n\n* Haven't pushed hard for compensation yet, but will start scheduling interviews towards late-2021.\n* I am more concerned about finding a company with good potential (thus problems + money to spend on them). Certain team dynamics/values are also important to me (e.g: value quality work, trusting each other, etc).\n\n==>\n\nIn short, I am betting that \"computing infrastructure\" is not going away soon. Hence, a solid foundation in the field would mean above-average financial outcome. And I get some happiness while being immersed in the area as well.\n\nI am hopeful that this plan will workout. However, sometimes there's a little bit of FOMO on other paths (e.g: AI/Deep learning). Also I see lots of gaps to fill and no quick way out of the rat race :)\n\nHow about you? What are you planning for your career path?",
    "title": "How do you plan for a long, technical-focused careeer in CS?",
    "subreddit": "cscareerquestions",
    "timestamp": 1614244988,
    "score": 56,
    "keyword": "mixed race principal"
  },
  {
    "text": "Senior Software Engineer trying to figure out the next step in my career. This is my first post so I apologize in advance if this is too much information for a single post or if this looks like I just opened the flood gates to some random thoughts in my head.\n\nHi, I am looking for advice in terms of developing a path for myself going forward. For a little background I have approximately 7yrs of experience as a software engineer.\n\n* About past experiences\n   * most tech stacks I worked with included Ruby on Rails (at times with some front end library) and occasionally some devops related work\n   * Ruby on Rails has always been part of or the only stack (for backend positions I have worked at) throughout my career and side project\n   * moreover through different roles, I have also been a part of mentoring and onboarding new devs, participating in communication with stakeholders, release management etc.\n   * I have participated in work done for small startups as well as established ones\n\nNow the question, when i look at the road forward, I want to develop a clear path about the next steps I need to take to grow technically and professionally. Whether its a path of the leadership or specialist, what attributes or qualities I need to develop? I dont always want to be only a software developer, I want to grow either in technical or management capacity in the future e.g. architect, principal software engineer etc.\n\nI have mostly been working with Ruby on Rails and some work with front end frameworks but I often feel I need to solidify the grip on the front end side even more. I feel the extent to which I know a particular framework is down to the amount of time I have worked on it over a certain project. There are certain technologies, frameworks I would like to know more about e.g. I feel I need to learn a lot more about the front end technologies. But on the other hand I feel these technologies will keep on evolving and the work I will be doing mostly will be centered around my current position and its requirements.\n\nThen on the devops side there is docker, kubernetes, helmcharts and these are the things I would like to know more about as well.\n\nI know that is my mind racing across all different sorts of areas and not focusing on a specific one. At some positions roles are dedicated like FE, BE and devops etc.. At others there might be full stack devs working both on the server side and the client side. I don't think in near future roles will be dedicated to just FE and BE positions it may vary across different companies and their needs.\n\nI have spent time on side projects and learnt front end frameworks but my current position is specific to BE only so with a fulltime job, it becomes slightly hard to keep up personal projects at a consistent pace. But I won't say the effort has not been worth it. I have improved from where I was a year ago in terms of knowledge.\n\nWith all that information, with the evolving tech stacks and roles, how should I position my self if I want to take the next step from a Senior Software Engineer. What disciplines, certifications, skills, technologies I should start aligning myself with and evolve my thought process.",
    "title": "Senior Software Engineer trying to figure out the next step in my career.",
    "subreddit": "cscareerquestions",
    "timestamp": 1640550192,
    "score": 3,
    "keyword": "mixed race principal"
  },
  {
    "text": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?) The reactions of black women to this whole Meghan Markle ordeal on this subreddit and Twitter, and on News media have been fairly interesting to me. Would be interested to hear the perspectives of other black women as my opinion might be unpopular going by the views expressed on this subreddit. Personally, whilst I sympathize with Meghan for the racism and blatant discrimination she has faced, I find myself feeling sort of consciously detached to her plight. As a woman of African/Caribbean descent, I find it difficult to wrap my head around as to why any woman of recent African ancestry, or any black woman, would want to marry or be otherwise intricately involved in an institution as racist and colonialist as the British Royal Family. Colonial England, and the BRF, are almost single-handedly responsible for the decimation of African regions and Caribbean countries, which are now part of the Commonwealth and hindered in many ways by this. These people’s ancestors have the blood of her mother’s lineage on their hands. \n\nWhilst I think Meghan is an intelligent woman, I do believe that she was being disingenuous when she relayed her supposed limited knowledge of the royal family, and I believe some of her claims have been disputed by her own friends. Operating under the assumption that what she said is true however, I don’t understand why she didn’t do more research into their colonial heritage and history. The British monarchy, including Harry himself,  are very racist and are symbolical remnants of white supremacy. Price Harry is the man who wore a nazi costume and allegedly denigrated his fellow army-men of color. I find this to be hypocritical and I don’t buy his reasoning that he wasn’t aware of the depths of racial discrimination before meeting Meghan given his family’s history.\n\nI walked away from the interview feeling sorry for Meghan, but feeling that she was very naive and thought that her being biracial/white-passing would somehow aid her. Had Meghan been a fully black, unambiguous black woman of a darker complexion, I seriously think she would not have even been allowed to marry him.\n\nI also take issue with people on here referring to Meghan as black, when she has repeatedly stated that she is biracial, and her experience reflects that of her phenotypically mixed heritage and not that of mono-racial black women. Before I knew of her background, I actually thought she was white. Even Harry thought she was only white when he met her. I’m trying to be open-minded on this point, because I realize that America has a different racial classification system than the rest of the world. I don’t want to be accused of “policing blackness” (although I find it weird that all races but black people can exercise some sort of racial exclusivity) but I do find it slightly bewildering as Meghan, who is ambiguous and white-passing, would be categorized as exactly what she is-mixed/biracial- anywhere else in the world, especially in Africa and the Caribbean. I also take larger particular issue with this as I find that what constitutes a black woman these days are blurred, but not so for our male counterparts. Everyone seems to agree on what a black man can look like, and they are thus aptly represented in the media, but there is a curious leeway for black woken in the media, and I’m starting to see more biracial instead of monoracial media representation for black women and I feel like claiming Meghan as black plays into this. \n\nThis idea that Meghan was going to modernize the BRF is delusional to me and this is exactly the outcome that I expected. Why any black or biracial woman would need to modernize this institution in the first place or add “a splash of melanin” or whatever ridiculous phrase some people are using is lost on me. Why would we need to modernize an institution that oppressed our ancestors? I was surprised that she and Harry stated that after everything, they were still open to working for the Queen and Meghan “representing the commonwealth” (what even...?).\n\nAlso, I find black women claiming Archie is “black” astounding tbh. I hope this is a minority opinion because it makes zero biological sense and is very embarrassing . I have also noticed some BW living vicariously through her, and this has me slightly worried. The majority of women defending Meghan look nothing like her and the people fetishizing this relationship (especially because it may be/is considered interracial) need to stop.\n\nI hope I wasn’t too harsh with my commentary and would be willing to her criticisms/thoughts.\n\nAddition: (unrelated) We may take issue with some things black men do as a collective but some of the black women on Twitter (I see you Monique Pressly) accusing black men of not being supportive enough of Meghan/being the most disrespectful towards her is ridiculous to me. Seriously?",
    "title": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?)",
    "subreddit": "blackladies",
    "timestamp": 1615349273,
    "score": 310,
    "keyword": "mixed race principal"
  },
  {
    "text": "How Black Men Are Discussed on This Subreddit Is Toxic af I am not trying to dismiss what people have experienced. Me myself many times have been put down by black guys which was racist, colorists, or sexist things. It is an experience being both black and a woman and there is intersectionality ignored by feminism, by media, by the LGBT community, and even BLM.\n\nThe thing is I’m confused a lot of the time people dogpile on black men on this subreddit for things when I have experienced much of the same from black women. Are you really telling me colorism, racism, misogyny, and homophobia is one sidely expressed by black men? \n\nI don’t understand about how black men are colorist where Black women can’t be, some of the first colorist things I heard were from my aunt and other black girls. One of my biracial best friends mother told her not to date black men because she does not want nappy headed grandchildren. This is from a dark-skinned black womenI have heard many black girls say they want mixed race kids or someone non-black. But nooo this is just black men right? And not only that it’s weird how Black women in interracial relationships is either promoted on r/Blackladies or side eyed but black men doing are always self-hating and colorist. And their kids aren’t black, relate to black people, they’re mixed not black, that sentiment is not isolating at all to mixed race black people.\n\nWith black men treating black women badly in professional spaces or predominantly white spaces I won’t deny any experiences . There are definitely Black people that purposefully avoid and demean black peoples to gain acceptance in these environments. The thing is are we really going to generalize and say all black men are like this? I have definitely experience reaching out to Black women at professional spaces and being treated rudely in return, but I know not to generalize. Many times it has been easier to befriend women of other races before someone black but ultimately black people are just people to have the chance to be anything, race doesn’t guarantee a friendship from that person or respect.\n\nIt’s so hateful and negative that I feel like unsubbing. It’s weird how a lot of the times people posting about their negative experiences never account for how they chose their relationships or how they come off. A lot of the time they could aloof and uninterested , self-pitying, condescending, and never take responsibility.\n\nIt’s weird how a lot of the people comment that they hate when people generalize black women into stereotypes and we are the most educated and this...but it’s completely okay to avoid black men and stereotype them. Please.",
    "title": "How Black Men Are Discussed on This Subreddit Is Toxic af",
    "subreddit": "blackladies",
    "timestamp": 1636327736,
    "score": 313,
    "keyword": "mixed race principal"
  },
  {
    "text": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media? How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?\n\nOn the bachelor contestants, Taylor Nolan's recent Instagram live, her and Pieper touched on colorism and the mixed race experience. Pieper talked about how being a lighter skinned black woman, racism affects her differently. She talked about how there are nuanced and different levels of racism.\n\nTaylor says she and other light black women (like Pieper) have been portrayed as angry black women. She also talks about how her and other light skinned black people were light enough to get onto the show and be the token black person.\n\nIn my own experience, as a mixed black woman, I think colorism can sometimes allow me to get my foot in the door in white spaces like jobs but I am still watched suspiciously because they assume I will do black stereotypes because of racism (like steal, get angry, be late, be uncivilized and abuse/attack). I remember growing up in the white conservative suburbs and feeling ignored and not considered for dating by white and poc/black boys because I was not white and having a lot of trauma from that. I remember a racist white nurse dismissing my pain and assuming I went in her office to skip class. I remember some white teachers treating me poorly, assuming I had an attitude and not giving me the benefit of the doubt. As a woman, I avoid being in all white spaces... But when I have been, now I have to worry about being hyper sexualized by white men. In liberal white spaces, I worry about being fetishized. When I call a white person out for racism, ask for my needs, am quiet or angry, I am seen as a threat and Intimidating by white people because I am challenging the status quo and not appeasing them. So I definitely have experienced the angry black woman stereotype projected onto me. I also know being a lighter mixed black women other stereotypes may be projected at me such as being seductive, sexual, soft, attractive, intelligent, etc. But that isn't always the case. Sometimes I'm thrown the black stereotypes and other times the mixed race stereotypes, often both.. that's why the experiences overlap for me and I call myself a black mixed woman.\n\n\nHow do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the white media/shows? Do you see any differences in portrayal? Do you think mixed/lighter skinned black women are often portrayed as angry?",
    "title": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?",
    "subreddit": "blackladies",
    "timestamp": 1613577841,
    "score": 122,
    "keyword": "mixed race principal"
  },
  {
    "text": "\"I'm a mixed girl. I just want to be normal.\" If you haven't noticed it, there's a post up on /r/offmychest right now that's gaining quite a bit of karma with the same title. This isn't word play or satire, it's quite literal. Apparently, she really is a \"mixed girl\" who simply wants to be perceived as \"normal\".\n\nOk, I'll admit. I rolled my eyes. I read the title and I immediately rolled my eyes. Even though I'm mother of mixed race children and come from a mixed lineage myself I rolled my eyes.\n\nBut then I took off the Petty Crown, scolded myself for being judgemental, opened the link and got to reading. \n\nI heard her out. I thought about how I would feel if one of my kids were upset because they felt \"abnormal\" and I heard her out. And now I'm struggling, desperately to RESPECTFULLY pen my reaction. I'm not sure if I'm going to succeed, but here goes. \n\nI'll start with a few points I've gathered from her post:\n\n1. \"Normal\" is White. Or at the very least, not Black.\n\n2. She believes cultural appropriation is a myth. \n\n3. The feeling of \"normalcy\" she apparently craves reads much more like \"acceptance from 6f people who don't see color and have lots of \"ethnic\" (abnormal) friends. \n\n4. She is completely removed from her Black side of her family and has no contact with them. I'm not sure if her Black parent abandoned her but she's expressed that she has no ties to them and therefore is frustrated at the fact that she (at times) is percieved as a part of their ethnic group. \n\n5. She seems to have a disdain for African American culture in general. \n\n6. She believes her perceived Blackness is negatively affecting her artwork and how it is recieved. \n\nThere is so much more, I'm just already exhausted with this list.\n\nAt the beginning of her dissertation she recalls an incident where a guy accuses her of \"Looking like the type of person that would accuse someone of appropriation for copying her rat's nest of a hairstyle\". Her disdain isn't aimed at the guy that called her hair a \"rat's nest\". Nor is it aimed at the way he trivialized cultural appropriation (She doesn't belive it exists, remember?) Her disdain apparently stems from being grouped with... us. The audacity. \n\nShe goes on to explain how tired she is of being made to feel that she should have to identify as one of us and research our culture. \n\nIn her own exact words:\n\n\"I am not my race. I am tired of being boiled down to my race by others. I hate having personality traits assigned to my perceived ethnicity.\n\nI wish I was normal and my ethnicity wasn’t a freaking talking point and a major part of my being. It sucks, honestly.\n\nI hate how some people assume I’m some sort of pity seeking, race-baiting asshole because of how I look. I’m just a person, with my own personality. I’m not a statistic.\"\n\n\nHave you ever read something so audacious and absurd that you just placed your phone down and blinked silently at the cosmos?  \n\nHow does one begin to unpack this level of self hatred and dissonance?\n\nIf this sentiment was ever expressed by my own kid I would feel like a complete failure as a mother. I'm talking cry in the shower, 'how could I have let this happen to my baby' type of failure. \n\nI don't really see a point in dissecting this any further or even criticizing her mentality because I don't see that making a difference. Instead, I'd rather make this post a  cautionary tale; to biracial people and parents of biracial children who are half Black. \n\nDon't. Be. This. Guy. \n\nI implore you, if you feel even a smidgen of this sentiment, talk to someone. Talk to your Black parent or a trusted Black relative. Talk to somone educated on Black issues. Talk to someone here. Hell, talk to me if you have no one else... I'll listen. But for the love of cocoa butter, do not DO NOT let yourself sink into the sunken place by relying on mainstream reddit to comfort you in your time of ~~ashiness~~ need.\n\nDammit. I tried.",
    "title": "\"I'm a mixed girl. I just want to be normal.\"",
    "subreddit": "blackladies",
    "timestamp": 1618017484,
    "score": 120,
    "keyword": "mixed race principal"
  },
  {
    "text": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota) It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)\n\nI just saw this picture showing Minnesota is one of the most racist states in the country---so validating (see link below). I knew MN racism was really bad at my core but you get gaslighted so much here that you start questioning your reality. People act like there is no racism here because \"people are so nice.\" White fragility is real here... like narcissists, white people act racist, deny it, make themselves the victims, then put the blame on you. They are so passive aggressive that the racism is so subtle, ex: moving away from you out of fear like you are this big threat. I am a woman and I've learned to keep a lot of physical distance from white women and to not make eye contact---which by the way, is super offensive as a feminine woman. If you aren't going out of your way to be super friendly and make them comfortable, you are a threat. I have had my own white relatives act suspicious of me for visiting and trying to get to know  them. I have always felt so isolated being a higher educated middle class black mixed woman. I've been treated as a criminal by my own employers. One time I walked into my first therapy job and the co-workers spoke to my white supervisor instead of me---they were so shocked and uncomfortable when they found out I was the therapist. The social class and job discrimination is so strong here, they are shocked to see professional black people. Being around all this white supremacy makes you question yourself and internalize their messages... You question your sanity, if you are bad, the problem.. when really they are the problem. They have the history of stealing and killing all groups of people for centuries but somehow they see themselves as the victims. White narcissistic delusion.\n\nThere also isn't much of a community of black professionals. From my experience, there are a lot of black (especially mixed) people who are in denial and will gaslight you about racism, too. I have had a lot of bad experiences with mixed black people who are in denial of their blackness, talk about how they pass for other races, and allign with whiteness. They distance themselves from their blackness and some seem delusional because they do not see that they do look part black.\n\nIt seems like the black/mixed people who make it to the top are the ones who have assimilated, have internalized racism, are not unified with other black people, and have had to swallow the racism they have had to experienced. I could not do that for long without it eating me up. I spoke up for myself and others. As humans, we are not supposed to be abused and just take it.. but somehow as black people, white people see us as less than human and think we are immuned and should just take it.\n\nI am burnt out. I barely leave the house. White people are everywhere here and I don't trust most. When I am around them, I dissociate to avoid feeling the pain of all of their violent \"microaggressions.\" Thankfully for now, I work at a black business. Moving out of this state is mandatory for my sanity. I wish all black people could leave as well. It is hard to succeed and progress here without losing a part of yourself. At least I know I managed to survive (and suceeded educationally and built resiliency) one of the most racist states, it can only get better from here as I move on to a more equitable state.\n\n[Racial Disparity MN pic](https://www.zippia.com/wp-content/uploads/2020/02/racial_disparity_map_worst_states.jpg)",
    "title": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)",
    "subreddit": "blackladies",
    "timestamp": 1620570249,
    "score": 72,
    "keyword": "mixed race principal"
  },
  {
    "text": "Growing as a Black Lady I’m not sure how to write this, but I’m about to move out of my white community that I spent the majority of my life in. I’m just beginning to see that a lot of the trauma I’ve experienced in life is from racist white people and systematic racism, and I’m  done. I think I just need to rant therapeutically.\n\nMy black parents moved to my area in the 1980s to escape the crack epidemic in the city before I was born. They were very “old school” to say the least. They tried to enroll my sisters in the local Catholic school, and the nun interviewing them asked them “Do you live in *insert only poor predominately black community in three counties here*?”\n\nThey weren’t sure what microaggression the nun was insinuating, but it rubbed them the wrong way. Around town one of the neighbors told my parents the local public school was actually the better option academically. So that’s where my sisters were enrolled. My middle sister actually made out decently, but my oldest sister had a hard time. My middle sister was actually crowned *Miss _*insert town here*” and almost went to the state beauty pageant. Never seen before or after in my town. They were both harassed by the school bus driver (who, years later saw the error of his ways and made sure I wasn’t harassed on his route). The school principal and teachers made a point of humiliating my oldest sister. When my sister brought it up to my parents, my parents said “well it’s not like they’re turning the hoses on you. Deal with it.” In their old-school mentality. My oldest sister is still in a cocktail of psych meds today from the abuse she received going through this school, including sexual assault. \n\nMe? Where to begin with me? I was the youngest in my entire grade and the only black child at a new school. The first teacher I ever had in elementary school husband was a reknown bigot in town, and said teacher tried her best to make sure I was held back. She never gave me any attention in class. Funny, to go to the next grade level I had to be tested (the deal my parents worked out with the school). The results came back that although I was the youngest in the grade-level, I was academically a whole year ahead of my classmates with just the equivalent of being at best ignored or regularly bullied each day. The way my parents tell it if it wasn’t for the teacher’s union the administration and Board of Ed would have fired her on the spot.\n\nUp until 8th grade it was pretty uneventful on the social front, I was still emotionally immature, but had a small group of girlfriends. Academically I was still ahead of most of my peers, but each year the bullying by the teachers became more and more intense. Could it be an emotionally younger student is an easier target? Sure, but looking back I think the teachers were looking for low-hanging fruit. Starting in 5th grade, I remember a teacher who liked to bully low-hanging fruit take me aside after another clique tattled on me and said meanly “there’s something wrong with you”. That stuck with me until I started anti-depressants a year ago and was my universal truth. \n\nEnter the guidance counselor. The middle school guidance counselor automatically had me slated as a “bad kid”. I was having a middle school girl fight with one of my girlfriends (truly over something petty). Looking back, I was probably beginning to experience symptoms of childhood depression around age 10 or 11. The middle-school guidance counselor threatened to call the police on me if I upset one of my girlfriends again. She found any excuse to drag me into the principals office (who was a level-headed man, he would just shoo me away within two minutes). 8th grade, there was a switch and my classmates became blatantly racist towards me. No one defended me. We had a new principal 8th grade and he enabled the bullies towards me. Looking back, I was not only depressed, but had begun to exhibit some symptoms of OCD. I had my first panic attack over these bigoted bullies when I was 13. I never told my parents as I was completely shut down and silent at home.\n\nEnter high school, long story short... more of the same. I was not accepted by my white peers, and the few other black kids at the school did not accept me because I was not “black enough”. During these awkward years I was pushed out of the closet as an lgbtq student. So, it truly felt like “we can’t dislike her because she’s black, but we can dislike her for being bisexual”. I was basically the school pariah. Did I mention when the white students came out of the closet they were elevated to popular levels? Some students were openly racist. Once again due to depression I was shut down and nothing was done about it. My OCD, Panic Disorder, and depression was severe in high school. My OCD came up in untraditional ways than cleaning and hand washing; rather I had scrupulosity, limerace, disordered eating, compulsive exercising, sexual OCD, verbally repeating words/sentences, thought cycling, maladaptive daydreaming, and excoriation disorder. Do you want to know what an obsession feels like? Imagine having intrusive, anxiety provoking thoughts on an topic ALWAYS. Sometimes it’s something average about work or school. Sometimes they are grossly inappropriate like socially-unacceptable sexual thoughts. Or anything in-between. Always. When you wake up, when you go to bed, during the SATs and GREs, at your grandma’s funeral. Always! You cannot turn that off. People don’t understand.\n\nWanna know what a compulsion feels like? You know that feeling when your having sex and you’re about to cum? That’s what the build up feels like. When you orgasm, that’s what engaging in the compulsion feels like. So, every time I engaged in religious rituals (my family was Catholic so it was hella easy for this aspect of my OCD to fly under the radar for a while), that I HAD to do or I was damned to hell, this is what it felt like. If I didn’t engage in a religious ritual, it was panic attack inducing.  That’s just ONE aspect of my compulsive nature. As an adult, I stay away from all organized religion. I’m very happy with this decision.\n\nThis was in the early 2000s. Even in my awkward teenage years I was intelligent, I knew something was “wrong”, but when I approached “safe” adults to say something was up I was told I was “looking for attention”. I tried to see my high school guidance counselor, but it became clear that she may have thought she could start an inappropriate relationship with me. She laughed off my concerns and enabled rumors that we were dating. When it got scary, I mustered up the little strength I could and told her to F off and never talk to me again. I was still shut down at home so my parents didn’t know what was going on. They also knew something was “wrong”, but instead of helping me get the help I need, they just screamed at me to “be normal” until a panic attack was induced. My parents would once again say “there’s something wrong with you.”\n\nStarting in college, at a PWI, I finally began healing and I was accepted for who I was. I went to therapy regularly and I truly bloomed.  \nI was still bullied by mean racist girls, but I had a circle of friends who would shut them down because it was the right thing. For the first time, my college had a multi-cultural club, and I had black girlfriends and I began to learn what it meant to be a black lady!\n\n\nThroughout my travels in life, I have consistently been rejected because I was either black or not black enough. I’m an educated woman with a successful career. I’m finally moving out of my racist white county. Is it weird that this is bitter sweet? Its gotten more obviously racist over the years. Trump flags are still up. Blue Lives Matter people are silent over the Jan 6 attacks, but the area is truly beautiful. If things were different I wish I could raise a family there. The cherry on top of everything is when another black family moved into town from a predominantly black area. As a good neighbor I went to say hello, excited to have someone else in town who looked like me. The family was very cold me to with the common look I get from some other black people of “not black enough”. \n\nThere are some very good people in this town. This may sound controversial, but a LOT of town cops and local state troopers made public statements during the BLM protests that “Black Lives Matter” over and over again. They marched with BLM, and were uncomfortable at Blue Lives Matter rallies. The whole community is taking steps to embrace inclusiveness and diversity. They are finally having real conversations. \n\nOne of the few things that came out of COVID-19 is that I started anti-depressants. My “old school” black parents were and still are highly embarrassed I attend therapy sessions, and told me my whole childhood that “only people in crisis go to therapy; only people with something wrong with them go on psych meds”. My life became clear and I found the strength to just leave. I realized how severe my Panic Disorder once when I began to take a PRN med for them every week and a half or so. That didn’t count the panic attacks I had behind a closed door at work or simple panic attacks that didn’t warrant a PRN. Since I was 13, I’ve been averaging 2-3 panic attacks a WEEK. I’m in my 30s... My therapist and my primary collaborated to add an additional medication last month, and for the first time ever the OCD symptoms, which have been notably decreasing since a year ago, (heads up they’ve always gone down little by little since talk therapy) went down significantly in the past month. It was like before I could only walk a mile, and out of nowhere I could run a marathon. I still have work to do in that area, but I count my blessings. \n\nHowever, the bigots are getting louder and louder. If you have guessed where I’m from yet, a local politician recently gutted a local anti-hate bill to only list BLM and Antifa as hard groups (if I understood the controversy correctly). A part of me wants to stay and fight for the town I love, but I think this just may be some sunk-cost fallacy. There are maybe four people in my town who I’m going to keep in touch with. This place is not good for my mental health, which is an ongoing project to heal. The area I’m moving to is far more diverse, mix of black, white, and Hispanic. The community over is predominately Indian, black, and Hispanic. For the first time in a long time, I feel like I fit in in my new community. Where I don’t stand out like a sore thumb just for having more melanin to white people; where I’m not teased for speaking the King’s English to other Black people. I love that feeling.\n\nWhat should I do next? I like what I do at work, but I think it’s time to take the next step in my career... also, I hate being one of the only black people as high up as I am in the company (1st world problems, I know)... I really want to find a company that is more diverse. Should I join the NAACP? Links? Or should I just be me and know I’m exactly where I should be in life?\n\nI don’t know... I’ve never been around a large group of black women in my life (the group of black girlfriends I had, though healthy and fabulous, was small). Have any of you ever experienced any of this? What do you recommend the next steps be as a strong black woman on my life journey?",
    "title": "Growing as a Black Lady",
    "subreddit": "blackladies",
    "timestamp": 1613871236,
    "score": 26,
    "keyword": "mixed race principal"
  },
  {
    "text": "Anyone else have a white parent that instilled an inferiority complex in you? Anyone else have a white parent that instilled an inferiority complex in you for being black?\n\nMy white father was a pedophile, who used me as a second partner, and sexualized me my whole life. He fetishized and sexualized black women but saw him self as a good non-racist white man because he married a black woman and didn't care what society or others said. Yeah, my dad was antiracist in some ways because he didn't adhere to societal norms especially being a highly functioning autistic man.. but he definitely had racist ways. He objectified black women and feared black men.  He one drop ruled me and said I was a black woman. When I wanted to embrace my mixed heritage, he would shut it down and make it seem like I was trying to act like I was better. When I was a child, he told me to be careful with white men because many just want the black experience but won't settle down with me. He said not all white men are like himself who don't care about social status, you have to find a white guy who doesn't care like himself. He made it seem like he was one of the only good ones.\n\n In college, I remember one time telling him how a lot of guys including white guys were interested in dating me in the city (contrary to what he told me growing up) and how (unfortunately) due to colorism, my dating experience is not identical to monoracial black women and I have noticed a lot of white men being attracted and wanting to date me seriously. He would shake his head, try to put me in my place, act like I was bragging, and pessimistically tell me I was wrong and that I had similar issues as black women because they saw me as black. He would act like the expert of my experience as though he walked a day in my shoes. He was instilling an Inferiority complex in me for being black. I think he was jealous of these men being interested in me because he wanted me all to himself and was afraid of losing me. I wonder if he purposely chose black women to date because it made him more secure they would not leave because he thought most wouldn't date them of racism and not trying to lower their social status.\n\nI remember one time telling him I wanted to be a Naturopathic doctor but had some fear because not many black/mixed doctors were out there and I would have a harder time finding BIPOC clients and clients in general due to racism. Instead of encouraging me, he agreed with me and tried to discourage me from leaving the state to pursue my dreams. When I said I wanted to act and model in California, he tried to break down my self esteem made me feel like I would not make it--he would often add how my race would make it harder. When I was dating, he became controlling, abusive, called me a whore, that I needed makeup, and I looked bad without makeup. He was getting insecure as I was an adult, ready to leave and date.\n\n Racism is real and there is definitely some truth to what he says about having to be careful around white men and having a harder time in jobs. I do think there was a part of him that was trying to protect me. But there was also a prominent part of him that wanted me all to himself and he used my race to make me feel insecure and Inferior. I've also had my mixed black brother (who also sexualized me) try to make me feel like white men would not want to date me because he got jealous when white men were interested. I think some black/mixed men do this because of their own internalized racism and Inferiority complex.\n\nInstead of discouraging me, my dad should have encouraged me to work harder and preserve despite the obstacles (when I was young he did this but as I got older, he became insecure and started to discourage me for his own selfish needs). He should have told me not all men are the same and there are men of all races who would date me instead of just focusing on the negative racism to make me feel like no one would really consider dating me. He should have let me talk about my mixed black experience instead of denying it and making me feel like I thought I was better for talking about my nuanced mixed black experience.\n\n I used to think he was an example of a non-racist person in my life and I would ask for his advice and support when it came to racism I experienced. Now I see that he was actually very racist, he lied and was a fraud. He was the type of racist white man he warned me about. This has led me to have a skewed/ black &white view of life. His words and of course racist society were traumatic and have left me with an inferiority complex that I am working to deprogram. I realize now the main root cause of my racial trauma and fear of white racism is because of him.",
    "title": "Anyone else have a white parent that instilled an inferiority complex in you?",
    "subreddit": "blackladies",
    "timestamp": 1622469042,
    "score": 27,
    "keyword": "mixed race principal"
  },
  {
    "text": "I need to vent to other parents of mixed race children As a person of color in a very white, old fashioned, trump loving town, I’ve just had it. I’m leaving this town soon enough, thank god, but it’s been hell. I’ve learned to avoid all other moms by this point. My daughter is in kindergarten and she looks almost completely white. I’m asian. People treat me like I don’t exist. They will talk to my FIVE year old before they even talk to me. After school, the moms gather and arrange their play dates and they treat me like I’m some random nanny. There have been times when assistant teachers greet every single mom and then they don’t even look at me, or they look at me and then proceed to take my daughter from my hand without saying a word to me. \n\nI’ve been to play centers where some people just stare at me until I stare back at them and they make some stupid excuse like “omg your daughter looks just like you.” someone literally said that and I had to pretend I actually believed that horseshit. Even if it were true, like way to point out how strange you thought it was that an Asian woman could look like her mixed race daughter?\n\nI’ve tried to avoid any social interaction whatsoever at this point. But I have to take my daughter to a bus stop where this white lady keeps trying to make conversation with my child who does not have any interest in talking to her. I try to make it less awkward by talking whenever my daughter doesn’t respond but I’ve noticed that this lady doesn’t want to talk to me. She specifically only talks to my daughter. Don’t you think this is just weird? Most moms talk to one another other in these scenarios while the kids play. \n\nI honestly did not even want to believe that this shit was happening. But it happens all the time. I’ve lived in this town for 4 years and I’ve had enough. I have never considered myself different from my own child in any way but this town has made me see the difference.",
    "title": "I need to vent to other parents of mixed race children",
    "subreddit": "asianamerican",
    "timestamp": 1632799843,
    "score": 225,
    "keyword": "mixed race principal"
  },
  {
    "text": "School PTA Member and a school Board Candidate Opposes Raising Asian Cultural Awareness In Bellevue, WA. School board candidate Gregg Smith calls cultural awareness a form of Critical Race Theory (CRT). Threatens legal action, and tries to get educator fired. He targeted:\n\nJing Mei Elementary. Smith calls cultural materials CRT, forwards Chris Rufo (anti CRT figurehead) work to principal. Threatens legal action. https://imgur.com/a/mNHtJZp,  https://imgur.com/a/OWrtuqn\n\nWoodridge Elementary. Smith wants principal fired for raising Asian cultural awareness. Takes complaint to the district. https://imgur.com/a/0fH0XBJ\n\nThe documentation on Smith was discovered through public records requests. Smiths paints a different image of himself on his campaign website. https://www.facebook.com/Gregg4Board/",
    "title": "School PTA Member and a school Board Candidate Opposes Raising Asian Cultural Awareness",
    "subreddit": "asianamerican",
    "timestamp": 1634253174,
    "score": 86,
    "keyword": "mixed race principal"
  },
  {
    "text": "Asian Americans Who Fought During the U.S. Civil War Did you know that 58 Asians fought in the U.S. Civil War?\n\n&#x200B;\n\n[Private Felix Balderry of the 11th Michigan](https://preview.redd.it/4smau7ank1q61.jpg?width=336&format=pjpg&auto=webp&s=0d39e63c5f600e9f381bdf6c5534cae23f344ce7)\n\nPictured here (above and below) is Private Felix Cornelius Balderry. He was a Filipino who came to the United States as a sailor aboard a ship commanded by Captain Joseph Foster of Leonidas, Michigan. After Captain Foster retired from the sea and settled on a Michigan farm, Felix joined him as a farmhand. In December of 1863, he joined the 11th Michigan Regiment just in time to take part in General William Tecumseh Sherman's Atlanta Campaign. As part of this campaign, the Union Army followed a scorched earth policy. They burned fields and houses, razed businesses, and destroyed railroad tracks in an effort to destroy the South's will to fight along with their ability to resupply the Confederate forces. The 11th Michigan was involved in several skirmishes and battles throughout this campaign.\n\n&#x200B;\n\nhttps://preview.redd.it/j5pob2tpk1q61.jpg?width=445&format=pjpg&auto=webp&s=00ee409d82fdb17c11ee56f976973fd03386eb37\n\nPrivate Balderry served through the end of the war and was mustered out of service in September of 1865. He subsequently returned to Michigan where he worked as a tailor. In 1885 at the age of 39, he married a 16 year old girl named Ada May Barns in Constantine, Michigan.  He died of  tuberculosis in 1895 at the age of 49.\n\nThis is Corporal Joseph Pierce of the 14th Connecticut. At the age of ten, his father sold him into slavery to Amos Peck, a sea Captain. He was nicknamed \"Joe\" by the crew. The Captain later gave him the family name of \"Pierce\" in honor of President Franklin Pierce. Although he was technically a slave, after the two month sea voyage from Canton, China to Hartford, Connecticut, he was raised as a family member of the Peck household.\n\n&#x200B;\n\nhttps://preview.redd.it/golha4brk1q61.jpg?width=385&format=pjpg&auto=webp&s=7b29fff77eaac2c588e8224527746bafa846aad3\n\nIn 1862 he enlisted in the 14th Connecticut Regiment. The 14th was part of the Second Army Corps in the Army of the Potomac. Joseph Pierce has the distinction of being the only Asian to have fought at Gettysburg. During his time in the Union's service, Joseph Pierce fought in 34 battles and skirmishes.\n\nAs a result of his bravery at Gettysburg which included voluntarily joining a skirmish line that had advanced on the Confederates, he was promoted to Corporal on November 1, 1863. While this rank may not be considered very high, it should be remembered that the Union had a segregated army. Black men served in black regiments that were commanded by white officers. Since Asians were largely unknown in the United States, people didn't know how to classify them. Some thought that Asians were mulattos (of mixed race ancestry). Others thought that they might be Native Americans. The fact that Corporal Pierce was actually given rank over subordinate white privates was really quite astounding given the time period.\n\nCorporal Pierce served with the 14th Connecticut until the end of the war and marched with his regiment during the \"Grand Review\" in Washington, DC on May 23. He was mustered out of the army on May 31, 1865.\n\nAfter the war he returned to Connecticut where he worked as an engraver for a silver company. In 1876 he married a woman named Martha Morgan from Portland, Connecticut.\n\nHe died on January 3, 1916 at the age of 73 in his home.\n\nAnother Chinese who served in the Civil War was Edward Day Cahota. At the age of 4, he was found with an older 6 year old boy as stowaways on an American merchant vessel that was commanded by Captain Day. The children were starving and did not know their names. The older boy died just two days later and was buried at sea. The Captain named the younger child Edward and in time Edward became a cabin boy.\n\n&#x200B;\n\n[Edward Day Cahota](https://preview.redd.it/rptamw4tk1q61.jpg?width=147&format=pjpg&auto=webp&s=10f42c86cdf3339b46d1f3f1e2a63d789b8f1f05)\n\nWhen Captain Day retired, he brought his cabin boy home with him to  Gloucester, Massachusetts . When Edward insisted upon having a third name, he took the name Cahota which was the name of the ship that he had served upon.\n\nIn 1864, Edward Day Cahota joined the 23rd Massachusetts Infantry. After mustering out of the army at the end of the Civil War, he reenlisted in 1866 and fought in the Indian campaigns. One of the more memorable experiences he had during his time in the western service was when he stood guard over Chief Sitting Bull. He told his family that the chief was really quite friendly. It should be noted that Chief Sitting Bull led the Western and Northern Cheyenne at the Battle of Little Bighorn in which General George Armstrong Custer and the 7th Cavalry were surrounded and slaughtered in 1876.\n\nEdward Cahota died on November 18, 1935 and was buried two days later at Mt. Hope Cemetery in Valentine, Nebraska. One of his dreams that was never realized was to become a citizen of the United States. Despite having served in the Army, he was ineligible to become a citizen after the Chinese Exclusion Act was passed in 1882.\n\nIt's estimated that 58 Asians fought in the U.S. Civil War. While most of them fought for the union, at least two fought for the Confederacy. Picture below are Chang and Eng Bunker. They were Siamese twins who came to the United States to join the PT Barnum Circus. After leaving the circus they settled in North Carolina where they married two white sisters. They lived on a farm and were slave owners.\n\n&#x200B;\n\n[Chang and Eng Bunker](https://preview.redd.it/q067sopvk1q61.jpg?width=406&format=pjpg&auto=webp&s=9e034a2eff384795d3187e3187be0b3c9aa419ff)\n\nWhen the Civil War began, two of their sons, Christopher and Stephen joined the Confederate Army. Since they each had horses and all of the associated gear, they served in the 37th Virginia Cavalry.\n\nIn 1864, Christopher Bunker was wounded and captured in a skirmish at  Moorefield, West Virginia. He was sent to Camp Chase which was outside Columbus, Ohio. Camp Chase was the largest Federal POW camp in the United States.\n\nThe Union didn't spend much money on Confederate POWs. Christopher was housed in a crowded barrack with 197 other prisoners. The union's rations were so meager that at one point, Christopher and his fellow prisoners were reduced to eating cooked rats. On March 4, 1865 he was freed as part of a prisoner exchange between the Union and Confederate forces.\n\nAfter the war, he and his cousin Stephen returned to North Carolina where they resumed farming albeit without slaves since all slaves had been emancipated during the war.",
    "title": "Asian Americans Who Fought During the U.S. Civil War",
    "subreddit": "asianamerican",
    "timestamp": 1617057006,
    "score": 24,
    "keyword": "mixed race principal"
  },
  {
    "text": "#WeArePeopleToo: A Proposal for a New Movement Hi everyone, this is my first post ever on Reddit despite being an avid Redditor. I apologize if I lack any specific Reddit-based decorum when it comes to making a post. I will definitely get better with time!\n\nMy name is Dae and I'm an NYC public school educator in my late 20s. I am a mixed race male and would like to share my story as well as establish my thoughts on a movement to better represent us as mixed-raced humans of the world.\n\n**My Story**\n\nI was born to a Trinidadian mother and a Korean father. As a result of their marriage, my father's side of the family became estranged and cut ties with us. As a result, I have only managed to forge a relationship with the Trinidadian side of my family. I grew up in a fairly Republican/Conservative area of NYC (Staten Island) in which white people were the majority.\n\nMy parents loved me but they had no idea how to deal with raising a multiracial son. They were stern and strict and did not believe in a coddling love. They did, however, believe in the merits of education and made sure that I knew to bring the best grades home. In school, other students stayed away from me. They were polite as young children but they often ostracized me and left me out of activities. At the time I didn't know it was because of how I looked but with time I began to see the relationship. I learned the power of being a fool, of being self-depreciating. As people laughed at me, I saw it as their acceptance. What I had actually done was prime them to note my difference, my mixed-race status, as being something comical, something to decry, deride, and deplore.\n\nI became the class clown and stood to make problems for the sake of other's entertainment. Teachers began to hate me and associate me as a problem child. They suggested mental and learning disabilities despite my high grades due to my parents and their iron fist approach to education. With every letter home, phone call, parent-teacher conference, I would receive a beating from my parents. Slaps in the face, beatings with belts, name calling, screaming in a child's face, bruises on my body. All done for the sake of being accepted by my peers. All for the sake of being loved by someone. I learned that people who love you are allowed to do whatever they want to your body so I let others do what they wanted to me. Friends treated me like a punching bag. At the age of 8 my 13 year-old babysitter blackmailed me into allowing her to rape me. I said nothing, scared more at the idea that I would be in trouble if people knew I had sex because I knew enough to know sex was wrong.\n\nBy the time I was 12 in middle school, I had tried to hurt myself for the first time. I was taken to the guidance counselor because I had told a friend who, doing the right thing, told an adult. In the process, I was treated like I was crazy. I was threatened to be committed because I was a danger to myself. All of this made me feel *different* and I already knew *different* was bad. I knew because of how I felt when people told me I was different. \"What are you?\" \"Who is black?\" \"How did that happen?\" \"Are you \\_\\_\\_\\_\\_\\_\\_\\_?\" The looks of confusion. Even worse was the looks of incredulity, like the fact that I existed couldn't be real. People, regardless of their own race, made me feel so ugly. Ugly because I was different, unique, and beautiful because of my uniqueness.\n\nI knew my parents' union was odd because people told me that. But I didn't know the history of miscegenation in America. I did not know that it was once a crime to be us or to engage in a union that results in the creation of one of us. What I did experience, however, was fetishization as I grew up and became sexually active again. I had a hard time finding someone who thought we had enough of a connection to date one another. When I did, I immediately agreed to date them, I was thirsty for love and affection. But this love was ugly too because it was different. This was even present in friendships. I had friends who told me they would only date black girls because they were black and wanted to have black babies. I had friends who told me I was smart because I was Asian and knew some rap and had rhythm because my mom was Black.\n\nMy girlfriends never, ever brought me home. I was a secret, forever to be hidden. I grew attached to a concept that white girls were the most beautiful. This was partially because of where I grew up but also out of jealousy. White people had such an ownership of their heritage. They knew what they were and forged relationships based on those identities. I wanted so badly to be white. I told my mother that I liked white girls and that in my next life I'd like to be white because they rule the world. My hatred of my blackness stemmed from the fact that society deemed black inferior which led me to believe that my blackness was probably why my interactions with society were so awful. If only I were fully Asian or White and had no blackness to me. I didn't realize it was just because I was mixed. The one girlfriend who took me home only told her family I was Asian. During the death of Eric Garner on Staten Island as racial tensions spilled out onto the streets, I visited her family and had to grimace as they joked about, \"Hands Up, Don't Shoot\". She said nothing. She did nothing. I didn't expect her to.\n\nMy life spiraled out of control as I got older and race became more important as a qualifier in making connections with people. I fell in deep love with a girl from a family who practiced the Islamic faith. She had difficulties accepting her role in the religion and found solace in me, a person with no ties to any culture because my culture was so shattered by my being multiracial. She would often tell me how \"cool\" it was that I was Black and Asian. How \"attractive\" it was. I didn't know what she was doing was fetishizing me, I was desperate to believe she loved me. After a few years, the relationship fell apart and, again, it was because I was different. This time, however, I knew it was because of my race. I never hated myself so much in my life. I cursed myself and my family, I wished I could be one thing.\n\nI drank a lot after the breakup. I wanted to die. I woke up face down in the gutter one night after binge-drinking. I tried to slice my wrists in my backyard, then I tried to fall on the knife. I tried to jump off the overpass by my house into traffic. I wanted my death to be certain. I gained so much weight my heartbeat became erratic. I was smoking a pack a day and developed a wheeze. I hated myself, I needed to punish myself. I fought my father, I ran away from home and became homeless. I hurt and hurt and hurt because love seemed impossible because acceptance was impossible.\n\nI became a teacher. First in Bed-Stuy, Brooklyn where my students, forever ready to curse me out and let me know when I wasn't being \"fair\", accepted me. Almost instantly. They asked what I was, were relieved when they heard \"Black\" because they knew we shared something common, and then made me one of their own. They joked with me, told me gossip, shared their fears, shared their dreams and their emotions. They asked me to share my stories and for the first time, **ever**, someone wanted to truly know me. Now I teach in the South Bronx where my students have yet to ask me what I am. Because it does not matter to them.\n\nI began a journey to heal. I lost weight though exercise, something I was so hesitant to do because I hated myself and wanted to die. I took a road trip from NY to Georgia, across to New Orleans, Louisiana then to Texas, then Cali. I got to see the Pacific Ocean and looked across to imagine my father's country. We drove back and I was refreshed with a new look on life. I educated myself on race relations in America as BLM became a massive presence following the death of George Floyd and learned to love my blackness. I attended my first protest on Staten Island with BLM and learned the importance of being outspoken. I learned to love myself and I learned how to share that love with others. I challenged my perceptions of education and decided to dedicate my life towards bringing a sense of ownership when it comes to science for BIPOC students. By providing students with a more hands-on experience, they learn that science is a gift for all humanity in the form of a community, one that it is honorable to be a part of. I have since been selected to work on a committee that brings more diversity toward l\n\n**The Movement**\n\nThrough my research, I have become extremely disillusioned with the lack of support provided to people of mixed race. I grew up with no one to turn to, no one to help me unpack the burden of being an oddity to society. I left social media, angry, vowing to never use it again because I didn't want to interact with a society that could not accept me. I likened it to being desperate, to chasing the desire to belong to something that has no desire to accept me.\n\nI fell upon Beverly Daniel Tatum's national bestseller, \"Why Are All The Black Kids Sitting Together In The Cafeteria?\" and noted that it was revised and updated. I had never had interest in reading this book before, despite it being mentioned in conversations with friends, teachers, etc. I did not belong to the black culture and so social issues of segregation were particularly damning to me. How could I sympathize with a culture that told me I wasn't black or black enough? At least they had one another in their culture to lean on. I had no one, I felt. In the revised edition, Dr. Tatum places attention to the role that Multiracial families bring to a discussion of race relations in America. Yet, in one fell swoop, she manages to disenfranchise me and other mixed-raced people, \"Given the unique historical and contemporary context, it is the biracial identity development of children of Black and White parents that I will focus on here.\" (Tatum, 304) I was not even enough to garner attention by a champion of Civil Rights and Equality in a book that was groundbreaking in its ability to unpack race relations in my country. I began to wonder how many other mixed-race people felt this way.\n\nI realized that we are under-represented and our lack of support allows us to be targets for confusion. It is this confusion to what we are, to how people treat us, that results in self-hatred, self-depreciation, self-loathing, and self-harm. And we cannot wait for others to be our voice because we are in need. As more attention is being placed towards identifying racism throughout the world, we need to be vocal, we need to stand to let people know: WE ARE THE DISENFRANCHISED TOO. WE ARE PEOPLE TOO.\n\nAnd that has been the movement I've been slowly pushing over social media. I want it to take off. I want us to unify and represent a community that has lacked a true community for so long. #wearepeopletoo\n\nAs people, we deserve to be treated like others. This means we deserve the freedom to be equals in society. We deserve to walk down the street or to make a new friendship without being asked for our race or ethnicity because #wearepeopletoo. We deserve to love and be loved not fetishized because #wearepeopletoo. We deserve to feel like we belong in our families, in our schools, in our government, in our country because #wearepeopletoo.\n\nRight now, the movement is just a hashtag. But even the largest movements begin somewhere. I will not pretend to know what I am doing. I will not pretend to be a leader or to stand as someone to look up to. I believe that this movement needs to be decentralized. No single leader, just a group of people, human beings, who see the need for a change. Right now I am using IG to push the hashtag but I want to begin moving to other platforms, putting out writing, establishing a website. I hoped we could establish [r/mixedrace](https://www.reddit.com/r/mixedrace) as a basis for a headquarters or begin to discuss a place to brainstorm. I stand with all people of the world and I want them to begin to see us as people too. #wearepeopletoo I know I need help, I need teammates and a community to support and be supported by. Even now as I tell people my idea for this movement they tell me I am being divisive, that I am causing more division in the world. But this was division that was forced on me, not one that I created. My goal is to end this division. I share that belief, that one they call utopic, that the world will be better when we see ourselves as one race: the human race.\n\nThank you for hearing me out,\n\nDae",
    "title": "#WeArePeopleToo: A Proposal for a New Movement",
    "subreddit": "asianamerican",
    "timestamp": 1614137067,
    "score": 12,
    "keyword": "mixed race principal"
  },
  {
    "text": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "title": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "subreddit": "MensRights",
    "timestamp": 1636492585,
    "score": 381,
    "keyword": "mixed race principal"
  },
  {
    "text": "I hate my woke school board My friend showed me this sub and I've been really tempted to post on it, so here I am. This is just a throwaway account because I'm scared of what would happen if I posted this on my main. I hate the fact that now people need to be careful about sharing their real opinions.\n\nI'm a 15-year-old girl in grade 10 and I'm fed up with this feminism shit in school. (and before you point it out, yes I know it's ironic that I'm making this post as a female). A lot of the subjects in my school are dominated with social justice and I hate it. English is the worst of all because my teacher is a social justice warrior and always talks about feminism and race insensitively (also making racist remarks about her fellow white people lol) in front of the whole class. EVERY single start of the class she talks about feminism and how girls are poor little victims, their rights are being disrespected, blah blah blah. I fucking hate it. I'm someone who's victimized for both my race and my gender and I hate it so much.\n\nLast month we started reading books. ALL of the options were about social justice. She was like \"It's better if I let you chose a book, rather than if I just handed you a book by an old dead white guy\" (yes, she really said that). Pretty much all the books had an \"important message\" in them, so I chose a book that seemed to be the least like it would be full of social justice. Turns out the entire fucking book is a message about feminism (as well as racism), the two subjects that bother me more than anything. (The book is called \"Monday's Not Coming\" if you dare to touch it)\n\nWell anyway, I was reading a part of a section today for my school work and so basically some girl is invited to a sleepover with other girls. The sleepover takes an unexpected turn that the main character didn't expect and she ends up going to a party and getting drunk. I PREDICTED what would happen next, and I hate that. Some guy sexually assaults her, of course. Fuck that book. Fuck my life. Fuck everything.\n\n&#x200B;\n\nI can't even express my anger in words. I don't even know how to properly end this post but it's just great being victimized for your gender and your race :) (I'm mixed by the way). I hate it how the sjws portray women as \"poor little victims aww omg r u ok :'''( oJHDJGSHJVD ARWJKUD GUSKDBM HJKFWSGJdb,hgajfuckingshootme\"\n\na\n\nwxdquodhkfjvsgfxe\n\nd d\n\necfwd\n\nfwxv\n\n&#x200B;\n\nI am going to have a meltdown\n\nOkay, that's my vent. Bye.",
    "title": "I hate my woke school board",
    "subreddit": "MensRights",
    "timestamp": 1619114505,
    "score": 38,
    "keyword": "mixed race principal"
  }
]