[
  {
    "text": "Donating eggs - my perspective. TLDR: I anonymously donated eggs in 2021. Yesterday I met my donor daughter for the first time. She will be 1yo this month. She is beautiful. She looks like me and my youngest child. Her parents are wonderful. I am incredibly happy for them. My donor recipient had a hard time and went through a lot to get her daughter. My youngest child has been begging me for a sister so he sort of got his wish haha.  \n\n\nLong version:   \nI live in Australia so you can't sell your blood, plasma, sperm or eggs. If you donate, you do it altruistically. I've always donated blood and plasma - I hit 75 donations before my doctor told me to give it a rest for a year. In 2021, I watched a doco on Netflix called One More Shot about infertility. I've always wanted to be a mum. I met my husband at uni. After three and a half years, we got married the day after I turned 23yo (husband was 24yo). I had my first son a year anda bit later when I was 24yo and had my second son when I was 27yo. I'm 32yo now. I fell pregnant easily - especially with my second. I fell pregnant the week my Implanon (contraceptive) was taken out. My GP didn't believe it until he checked the dates - he was the one who took the Implanon out. My point is that I am very fertile, I am done having kids and I have plenty of eggs that I don't plan on using so why not donate?  \n\n\nDonating in Australia had a lot of prerequisites: you had to be of a certain age, be relatively healthy, had finished your own family or sign a waiver saying you wouldn't blame the clinic if your fertility was affected by your egg donation(s), etc. You also had to go through a few other hoops like sessions a few months apart with a psychologist. If you were married like me, you need permission from your partner and they too would have to do some psych sessions. Then came the blood work. The forms. Vaginal scans. Medication. Lots of needles. Lots and lots of appointments. As an egg donor, you basically went through the IVF process and stop short of the implantation part. That was all fine with me. Inconvenient but I'm a SAHP so I had a lot of free time. The clinic paid for everything for my donation - apparently some clinics in Australia want you to donate (for free) but also expect you to pay for it too (medications, hospital stay, doctor fees, psych fees, etc.) so I'm guessing that's when you know who your donor will be and the recipient parents would cover that. I'm an anonymous donor so I didn't know who would get my eggs. I could put stipulations and pick recipients who were of a certain age, race, religion, nationality, etc. but I didn't. When I woke up from the egg retrieval surgery, I was handed a gift bag with a note basically saying thank you and that even if my donation did not result in a baby, that at least I gave them a little more hope anyway. I've kept that note and filed it away.  \n\n\nA year later I heard there wasn't many donors, even less than the exisiting dwindling pool of donors, due to covid. So I made another egg donation in 2022 at the same clinic. My ovaries were overstimulated again but this time was much worse than last time. I was sick for longer and had gained a lot of weight and decided not to continue - legally you could donate up to five families. During this second donation, the clinic let slip that my first donation recipient was pregnant. I was glad for them but didn't seek out anymore information at the time.  \n\n\nOne day I got an email telling me our donor database was being moved over to a government one and I had to fill out new forms. During this process I found out I had a match, that one of my egg recipients were successful and had a baby girl in 2022 (clinic can release the gender and year of birth of donor children to egg donors). I was so glad for them and didn't want to pry so didn't send that email to the clinic. So I filled out the new forms. I had the choice to not put down any identifying or contact information until the child was 16yo but I put down all my details incase they needed it for whatever reason. Maybe they didn't need my details today but might need it in the future before the kid turns 16yo. When the kid turns 16yo, they could find me whether I liked it or not. I was also fine with never hearing from them ever as well.\n\nWithin a week of filling out those new forms, I got an email from my donor recipient. The first embryo implanted worked and she had given birth to a beautiful baby girl. The mum sent me a photo of her and her daughter that day (10mo), plus another photo of her daughter as a newborn. I literally screamed that my kids ran to me. I was so excited and happy for her! I quickly showed my sons and my husband the photos. My youngest who is 4yo has been bugging my husband and I for a sister. My 4yo celebrated and screamed \"yay, I have a sister!\"\n\nThe next few weeks were a mixed bag of feelings. My kids who were extremely happy and excited came home one day saying they don't want to talk about their donor sister and wanted to keep it all a secret. It turned out no one believed them at school and had called them liars. I talked to the teachers and we sorted everything - my kids are fine now. My husband and I had years to talk and process different outcomes of my donations but I forgot that my kids are so young that they would need much more time to sort it all out for themselves. My mum and siblings were excited and a little heart broken but mostly happy. It took almost a year to donated eggs from when I first made an inquiry to the egg retrieval and last blood test. My dad passed away a couple of months before the egg retrieval surgery. He was proud of me, excited, and fascinated by the egg donation. I'm sure my mum would've wanted to talk to him about it.\n\nThe day came when I would meet my donor recipient, her partner and her daughter. I was very, very nervous. Mostly thinking that they wouldn't like me. I was worried that my skin would be darker than they expected it to be or that my personality wasn't what they'd imagined. I didn't want to be a disappointment. When we got to their driveway, we saw their amazing vegetable garden - much like ours. I was so, so nervous but I had my two kids, who are also very keen gardeners, running around the garden finding veggies they could identify. We never even got to knock on the door because my husband and I were chasing after our boys. I looked up and there they were -  they just appeared out of thin air haha. My donor recipient was holding her daughter who looked very much like my youngest. Her daughter had just woken from a nap and was a little groggy but was excited to see my boys playing in her garden. My boys wanted to give her a hug immediately but my eldest changed his mind said that they both should wait and not scare the baby so they crouched on over and said hello. I noticed that she has my eyes, my eyebrows and the same hair as my boys. She definitely has her father's nose and a few of his features too. Time will tell how much more she will take after me or her father (also biological father) through our shared DNA. I'm sure she'll take after her mother's mannerisms and such too. I'm happy that my donor recipient could carry her child through pregnancy, labour and delivery - I know how much she wanted that. I know my pregnancies made me a little closer to my boys and is genuinely a unique experience.\n\nWe eventually went inside. I found out my donor recipient's husband/donor child's biological father is also a long distance runner like myself. My recipient loves gardening like I do. It turns out they are very much my sort of people and I was just so happy for them. I was also relieved that they liked us too. My donor child is so very loved. Her parents had gone through so much. Again, I had my children so easily and young that I never thought about miscarriages, IVF or anything to do with infertility at all. It just never came up in conversations. It was only after I donated that a lot of my friends and family told me about their stories of loss and infertility. My donor recipient had a few miscarriages with some after IVF. I can't imagine the heart break she and her husband endured throughout the years.\n\nI feel a bit goofy typing this but there was this weird amazing feeling when I held my donor child. It was sort of a \"hey there you, did you know that your mum went to the moon and back to get you? You magical little thing. I'm so happy you're here\" She is the sweetest baby girl. She didn't cry at all throughout our visit. Loved being held by my husband but more so me - I kept bouncing her to make her laugh so that's probably why. Her parents said that she doesn't usually like being held by men at all and that she usually takes a little to warm up to people in general but she came right along with my husband and I. She followed my boys everywhere with her tiny legs - she only learnt how to walk a couple of weeks ago. We talked for a couple hours until my children got overtired and probably overwhelmed. We took some photos to show our both our families (hers overseas and mine out of state). They kept mentioning how grateful they are but I don't really know what to say to that. I'm just really, really happy for them. \n\n&#x200B;\n\nJust a couple of notes I want to add in:\n\n1. There hasn't been enough time for my second donation (2022) to result in a child but I've been told the (19 successfully frozen) eggs have been allocated to a family so I hope they get their little one(s) too even if I don't get to meet them ever.\n2. My husband probably would've donated sperm but because we didn't want to have anymore children, he had a vasectomy in 2019. I watched that documentary in 2021 so it was just too late for him to donate sperm in the typical and inexpensive way.",
    "title": "Donating eggs - my perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1688997426,
    "score": 97,
    "keyword": "mixed race principal"
  },
  {
    "text": "I work with all women in science and it’s awesome There’s only 6 of us, but my department is 100% women, more than half are women of color, and we do science at a biotech company. I’m currently in an email thread with two of my managers (both women) and it made me start thinking about how great and easy it is to work with other women. We work closely with other departments, too, so I do work with a good mix of genders/races/ages but it is so refreshing to not have to be constantly explaining myself or proving my worth. My bosses back me up on decisions. They have stopped other departments from assigning me more work that shouldn’t be assigned to anyone in my department in the first place (reports, small projects). They come to me for advice on issues they haven’t encountered before but I have cause I’ve been here a long time. They let me present data at meetings with clients and higher-ups. \n\nI know in my heart that if I had more man bosses, or any gender but misogynistic, I would not be in the same position and salary. \n\nI am so grateful for accidentally ending up here and I’m excited for future young STEM women to be more likely to have this experience, rather than constantly having to prove yourself. I know we are going backwards in a lot of aspects society-wise but this is a little win for me.",
    "title": "I work with all women in science and it’s awesome",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678214336,
    "score": 74,
    "keyword": "mixed race principal"
  },
  {
    "text": "On dealing with my boyfriend’s sexist friends in a second language I’m not sure what I’m looking to achieve by writing this post, perhaps I just need to get this off my chest. However I’m open to advice or encouragement. Tell me to chill, I don’t know.\n\nSorry for the length, I hope this isn’t boring.\n\n\nBackground:\n\nI (32F) am an American in Europe. I’ve been living here, in the same country, for about a decade so the language barrier isn’t such an issue. When I encounter situations where cultural differences are evident, I try my best to reserve judgement and just listen until I’m sure I understand what’s going on.\n\nSo our country’s lockdown was pretty strict. After the first wave, I moved across the country then got stuck in lockdown again in a brand new city. Fortunately, I met a fantastic guy around that time and we spent a lot of our quarantine together.\n\nHe’s not the kind of guy I wouldn’t normally go for: he’s in finance and is a semi-pro sports player. I’m an artist, I’m bi, I’m mixed race, and clearly a foreigner- it’s cool, I’m happy with who I am, but it’s obviously easier running in social circles where we have at least a few of these things in common.\n\nI figured I was changing a lot in my life at that time so why not try to get to know someone who I normally wouldn’t have reached out to before. It turns out it was a great decision. My partner is a fantastic human, his family is also super open to our relationship which isn’t necessarily a given in this region. Thus far, we’ve been together for nearly 3 years.\n\n\nThe issue:\n\nAs we began to settle into our normal lives after COVID, we started hanging out with my partners friends more (most of them are from his sport). Eventually they could resume playing, so a lot of my Partner’s time was spent with the team. Many nights were dedicated to after practice/game hangouts, which was mostly a lot of fun…. except… the rampant misogyny. Honestly I was floored at some of the shit I heard.\n\n\nHere are some classics:\n\n-Just the free usage of the our language’s equivalent of bitch, slut, whore and f**. Sometimes even racial slurs\n\n-A dude at a wedding yelling out “so guys what bitches/sluts are you trying to find tonight” while his wife and baby were at the other end of the courtyard\n\n-Another referring to his wife and mother of his child a crazy, emotional *girl*\n\n-Yet a different wedding one of the groomsmen didn’t understand why Pride needed to be a thing. The irony, gay marriage is not legal here\n\n-Many of the team players have a tattoo for a famous player of their sport, who raped a 19yo. I’ve asked, they still insist “she was lying” or “even if it was true he was really good at said sport”\n\nAnd finally the one that tipped me over the edge:\n\n-I found out a couple months ago, one of their ex teammates stealthed a friend of mine. I can’t say I’m surprised but I would be shocked if this sort of behavior was an isolated incident \n\nFor the first several months of getting to know some of these guys I was pretty reserved. just absorbing context. Getting to know new friend dynamics is difficult on its own, in a different language it’s even harder. However, after a while it was clear that I wasn’t misunderstanding much.\n\nI don’t know if it’s me being a woman or a foreigner, but any time I interjected, no matter how calm or rational it was packaged, I was met with opposition. Most of them would just double down. It’s not really a surprising result. After a while I felt myself becoming hostile to my partner’s friend group as a whole (even though some of his friends are actually chill people). It was not a good look.\n\nMostly I was upset my partner never said anything. Like his discomfort was palpable in some of these situations, but didn’t see the point in being confrontational if the guys weren’t in his close friend circle.\n\nAs for some of the guys in his close friend circle- fucking yikes. To be fair he has been trying to be more proactive when derogatory things are said.\n\n\nThe solution so far:\n\nAs I started making my own friends it has been easier to avoid situations around my partner’s sports friends. I even thought at one point that I was blowing things out of proportion. But now that our interactions are usually for specific events, their disrespect is just more evident.\n\nSo, that’s it. Distance is my solution.\n\n\nThe question:\n\nI don’t even know what advice I need. My partner just finished his last season, but this topic is still thorn in our otherwise great relationship. \n\nIt sucks that I cannot spend an extended amount of time with some of his best friends. And I feel very uncomfortable knowing my partner’s good friends have such little respect for women- but of course I’m never going to say “it’s me or them”.\n\nLike I said, he’s being more assertive on this topic, he has major golden retriever energy and does not like to disappoint people. I applaud his efforts and don’t think I can fairly ask for anything more. \n\nWhen I do see his bros, I’ll just have to keep it superficial until further notice.\n\nThanks for reading and letting me vent.\n\nTDLR\nMy partner and I are an odd pairing. During COVID we made it work then I realized a lot of his friends are pretty sexist. I thought something was lost in translation or there was some cultural thing I didn’t get, but that wasn’t it. My SO makes an effort to speak up when they say fucked up shit but some of his friendships still make me uncomfortable. As a solution I avoid most interactions with his buds. It feels bad.",
    "title": "On dealing with my boyfriend’s sexist friends in a second language",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690741434,
    "score": 26,
    "keyword": "mixed race principal"
  },
  {
    "text": "A man tried to belittle me on a train last night and I'm super upset with myself for not standing up for myself more. For context, I'm pregnant and Audhd (inattentive type, not hyperactive). Relevant to know because I am very oversensitive to sounds, smells and touch naturally so I also empathise with people who are, and I cannot tell where pregnancy hormones end and ADHD stress begins anymore \n\nSo... To the story... I live in the Netherlands but I'm from the UK. I was on my way home from work last night on the train and my mum rang me to ask me questions about my ultrasound scan last night. \n\nWhile I was on the phone a man opposite me on the train told me in a very rude manner to keep down, because 'you are being so loud, it really doesn't need to be so loud, not everyone wants to hear you, just speak quieter'....and he really was mean and aggressive about it. It was not a polite request at all.  I was literally dumbfounded and on the edge of tears. \n\n\n(Side note: This wasn't like one of those normal seats of four... It was a single seater on each side of the door so he was like 2 meters away from me, not right next to me or anything)\n\n\nMy mum is also ADHD and literally does not stop talking.... 90% of our conversation is always just me going 'uh-huh' and reading while she is going off on one about something. So I was barely talking anyway and didn't even know how I could be any quieter, I just kind of stop responding at all and froze while my mum keep asking over and over if I was ok. \n\n\n I keep thinking it over, and I really don't think I was that loud when I was speaking anyway. I am already so self conscious of it, I hate people having loud conversations myself, I despise the people who play music through speakers on public transport, in fact I carry ear plugs at all time because I know too much noise stresses me. Therefore, I'm very mindful of not being rude around people, and certainly in a country that isn't my own. I love living here and I never want to give British people who live and work here, a bad image because I know how lucky I am to be so welcomed, and I want to be a good neighbor and dutchie.  \n\nI am mixed race and it's a real common trope that girls that look like me are loud and brash. It's just easy racism, that I have dealt with my whole life, and I am always self conscious about that, to point I am the polar opposite. I am quiet, overly polite bookworm. And yes I'm loud with my friends or my husband, but I am always the person in public who is just trying to mask and blend in. \n\n I know who I am as a person and if I was genuinely being loud without realising, I would have just apologised profusely and told my mum I would call her back. But I was talking to my mum about my scan and what the doctors said, I was purposely trying to be quiet as I wasn't really wanting to tell the whole carriage about my uterus. (FYI it was nothing gross or inappropriate, I was just telling her you could see the arms on the scan, that the doctor said everything is normal and there was a good heartbeat etc... she asked what she could buy me for the baby  and I said nothing really big, and we don't want to have a lot of stuff, we will buy what we need as we need it.... literally the most vanilla stuff to talk about). \n\n\nMaybe it is classic ADHD over thinking, or maybe it's because of pregnancy hormones, but I have been on the edge of tears since it happened. I was having horrible dreams about and I cannot stop thinking about the situation and playing how he spoke to me and how I froze over and over. \n\nI'm really fucking upset with myself, I didn't make a scene because I didn't want to be the thing he was accusing me off, but I wish I had stood up for myself and not let myself be bullied when I did nothing wrong. I'm so sure he never would have dreamed of saying that to a man, I bet he wouldn't even dream of saying it to a White Dutch woman tbh. \n\n\nSo yeah, don't be me... I'm going to spend the next 7 months learning to stand my ground, because I guess I don't just have myself to advocate for anymore... And I don't want any child of mine to see that and think that it's ok for men to speak to women like that.",
    "title": "A man tried to belittle me on a train last night and I'm super upset with myself for not standing up for myself more.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687332308,
    "score": 0,
    "keyword": "mixed race principal"
  },
  {
    "text": "Racecar driver coolsuit heat transfer ideas/thoughts I have a shitbox racecar I run in an amateur series, and because we're allowed no performance mods (to keep costs down), I tend to mess around with lots of \"pretend race team\" stuff.\n\nOne of the things I have made is a DIY coolsuit, like those used in endurance racing and various  touring car series around the world. \nThey generally consist of a shirt with tiny tubes sewn into it, which connects to a module that circulates cold fluid, cooling the driver. The commercial versions often use dry ice as the cooling medium, which is of course annoying to procure, store and handle when you're a small team with no budget.\n\nMy DIY version is simple insulated coolbox with pump setup, using quick-release fittings that plug into a commercial driver coolsuit. (I did attempt to make a driver coolsuit and it’s the most annoying thing in the world and not at all worth it).\n\nUsing as large a block of ice as will fit, the rest being enough cold water to keep the intake under, the pump circulates the cool water through the tiny tubes that are sewn into the driver coolsuit, which….you know….cools the driver.\n\nIt works well enough, but I have been wondering whether running either a different liquid, or running the water through a radiator and having that immersed in the coolbox would be a more effective method of cooling. \n \nBy more effective, I am looking principally for longevity, i.e. having the cooling last longer before the ice melts and it's just warm water circulating.  On a hot day it can be over 30c (85f), and closer to 55c (122f) inside the car, and then we're wrapped in fireproof underwear and a multi-layer racesuit.  More cooling for longer would be great.\n\nI suppose I am looking for advice on this. My non-engineering-ass assumptions/suppositions are as follows:\n\n* The \"coldness\" limit is going to be based on the ice, so without a separate source of \"coldness\" (a/c, peltier cooler, dry ice etc), going colder than water that's just above 0c is not going to be possible and/or worth the effort\n\n* If a small radiator indeed proved more effective at transferring heat from my person back into the water, this in fact would reduce the time that coldness was available, rather than extending it?\n* The \"time difference\" between cold water directly circulating through the suit, and a closed loop circulating through the small radiator which is immersed in water is going to be pretty negligible?\n* Any different type of fluid with better thermal transfer properties is going to run into the same issue as above, and that's before any cost and/or reliability issues with running weird fluids through consumer stuff designed for water use?\n\nI suppose I am looking for confirmation that going down the road of a radiator isn't worth it, and I'd be better off looking at other parts of the system/ideas, such as improving insulation on the connecting hoses, and maybe adding a Peltier cooler of some kind to the system to keep the water colder for longer?\n\nAny thoughts/ideas would be appreciated.",
    "title": "Racecar driver coolsuit heat transfer ideas/thoughts",
    "subreddit": "engineering",
    "timestamp": 1672898570,
    "score": 14,
    "keyword": "mixed race principal"
  },
  {
    "text": "Saying \"Catch a Bubble\" is now racist... At least according to my school's admin. A bunch of Kindergarten and first grade teachers were told that in a meeting. The teachers were completely confused because they've been saying it for years and asked for an explanation, but of course admin was not able to explain any of their reasoning behind it. One teacher (white woman) was specifically told that she \"doesn't understand the culture of the children (title one school, mostly African American)\" to which she reminded them that she is engaged to a black man and has a mixed race child. They didn't respond to that either and basically the teachers were told if they are ever heard saying it again, they would be fired. \n\nI tried searching this claim and found something about how it's equivalent to telling kids to \"shut up\", but even that seems like a stretch. Nothing about how it's racist. \n\nAnyone else ever heard this?\n\nEDIT:\nTo clarify: I don't think it's racist. I'm just curious if anyone has dealt with something similar with that phrase or another management skill with their admins trying to be \"white saviors\". Also can't believe that of all the issues my school should be dealing with, this seems to be the focus right now. We literally had a child bring bullets into the building last week and that's being completely covered up.",
    "title": "Saying \"Catch a Bubble\" is now racist...",
    "subreddit": "Teachers",
    "timestamp": 1697473897,
    "score": 3983,
    "keyword": "mixed race principal"
  },
  {
    "text": "I was dress coded. Please advise. I, 19f, am a first year student teacher at a middle school. I was wearing a black high-neck body suit with black slacks from old navy. During planning, my mentor teacher told me that a male AP said that I was dressed “inappropriately” and that I need to wear looser clothes. My mentor teacher pointed out that she didn’t find anything wrong with my outfit but she just wanted to let me know. I immediately felt so embarrassed and uncomfortable because I put effort into dressing professionally and I felt like I was being singled out because many of the female teachers wear the same outfit and even more form fitting clothes than what I wore. My personal thought is the AP said something because my butt is big. I cannot control that. Even when I wear my baggy cargos to this school, my butt still pokes out. I just feel weird & targeted honestly. Please tell me if I’m wrong. Thanks.\n\nEdits for clarification:\n\n1. The high-neck bodysuit also has sleeves so no shoulders were out. The bodysuit just looks like a tucked in shirt, honestly. The reason I stated that I believe the AP made the comment specifically about my booty was bc I have a very small chest & my chest has never been a point of attention for me. However, my small waist & large butt combo has always been a point of attention no matter what I wear. \n\n2. I am able to student teach at 19 bc I earned high school credits in middle school due to being on the accelerated track + I dual enrolled during the pandemic, earning most of my freshman & sophomore credits for college before I even graduated hs. Lastly, I graduated hs a semester early. \n\n3. Yes I am in the USA.\n\n4. I am mixed race: Black, White, & Native American.",
    "title": "I was dress coded. Please advise.",
    "subreddit": "Teachers",
    "timestamp": 1695665653,
    "score": 2670,
    "keyword": "mixed race principal"
  },
  {
    "text": "Student cussed and yelled at me today after telling them to put the phone away \nI am a ELL instructional specialist/IC and I am helping a teacher with classroom management (not ESL but they still assigned her to me because we're understaffed). I was in her classroom and saw a student on the phone. Our principal has been very strict about the no-phone policy, students are supposed to put their phone in a bin as they walk into the classroom and only take it out at the end of the block. The principal has been reprimanding this teacher because of phone usage in her classroom, and since I am trying to help her and I don't want her to get in trouble, when I saw a student on her phone I told her to either give it to me to put it in the bin, or do so herself, like I always do in this kind of situation. She kept it in her hand so I stood there waiting and hell broke loose...\n\nShe started yelling at me, telling me to leave her alone, she called me a b*tch multiple times, told me to go f*ck myself multiple times. 2 of her friends intervened and doubled down, yelled all kinds of profanities, and also called me a racist (these students were black but so is 80% of the class and the other 20% are Hispanic students, she was just the only one I saw on her phone).\n\nIn the end she put the phone in the bin and I walked away. At the end of class, I talked to her 1:1 explaining that I am trying to help, telling her that the school is strict on the policy (which she already knows) and I don't want the teacher to get in trouble. She was much calmer, she said she understood, and she even smiled. Even so, I am very ashamed to admit that I have been shaking and my heart has been racing since that happened and once the bell rang I hid in the bathroom to cry. I feel so stupid for reacting like this but unfortunately I am autistic and this kind of direct confrontation really takes a toll on me.\n \nEven though I really enjoy my job, I feel like I have no business working in education because I am weak and not assertive enough and I constantly get disrespected and walked over not just by students but colleagues as well. I feel stupid because I think I handled this very poorly but at the same time I don't know what I could have done differently besides minding my own business. I just want to help this teacher because if she doesn't get this under control, she will keep being reprimanded by the principal and might get written up.",
    "title": "Student cussed and yelled at me today after telling them to put the phone away",
    "subreddit": "Teachers",
    "timestamp": 1692890473,
    "score": 1041,
    "keyword": "mixed race principal"
  },
  {
    "text": "Teacher being unkind to racist student. We got a new student a couple months ago. They are white and the teacher and other aide in the room are black. This is a LIDS (low incidence disabilities) room, so all the kids have some type of disability. I am an aide and white as well. The student got into an argument with the other aide and told her they didn’t like black people and neither did their mom and that’s why they wanted me to give them their spelling test and not the black aide. They then began crying because they worried the aide would confront their mom and ask her if the family was racist. **I talked to the student about this and told them they need to apologize because disliking someone for their skin color is a horrible thing and what they said was mean.**\n\nThe aide then told the teacher who was already having some difficulty with the student as far as misbehavior and laziness concerning classwork. The past couple days, the teacher has been making comments to and about this student in front of them and the other students, who laugh. For example, the teacher said, “For the most part I’m proud of you guys… except you, (student’s name.) I’m disappointed. Do better when we come back from the break.” She has also said, “Why are you asking her for a cookie? You don’t like her.” When they asked the black aide for a Chips Ahoy cookie as she was passing them out to students for our Christmas party. I can tell the student is embarrassed and wants her to stop.\n\nThe teacher already bought all the students an individual gift and told this student that she shouldn’t have gotten them anything because they don’t deserve it. **While I understand that racism is awful and I do not condone their beliefs**, I think it is a little unfair that the teacher is essentially bullying an 11 year old who obviously learned this belief at home. They lived in a very white state before moving here and they are not used to being around people who aren’t white. I do not believe this student fully knows how to interact with kids of a different race than them. To me, I’d be trying to treat this student as kindly as possible to show them their belief is false. Kill them with kindness sort of thing so they will come to understand on their own racism is a bad thing, through positive experiences with people of other races. Instead, their racism is just being cemented through this negative experience I fear. \n\nShould I say something to the principal? This is a very delicate matter and I don’t know what to do.\n\nEdit: This student is in the life skills self-contained classroom. They can’t just be “moved” to another teacher. I am also appalled that people are telling me I’m an apologist for racism??? WTF?! Did you miss the part where I told the student to apologize because what they said was bad? This student has said a lot of things that are off the wall that make me believe that their family is nutty. \n\nEdit 2: Wow. So many of you are being extremely unreasonable and assuming shit. I can’t believe you’re allowed to teach. Your poor students have a moron for a teacher. If you’re not an educator then THANK GOD but I don’t know why you’re commenting. You’re about as sharp as a marble.\n\nEdit 3: I have known this teacher for years. She was MY principal when I was a student at the school I work at. She was known to always have her paddle ready and wasn’t very lenient with the students in general. She has a paddle she uses on the life skills students as well, saying she’s “old school” and will get through to them one way or another as long as the parents/guardians have agreed to it. Her expectations are quite high and she runs a tight ship.",
    "title": "Teacher being unkind to racist student.",
    "subreddit": "Teachers",
    "timestamp": 1702660814,
    "score": 321,
    "keyword": "mixed race principal"
  },
  {
    "text": "Substitute TEXTS ME while I’m sick to tell me my class materials are wrong? Excuse you?? What should I do here? Partially a rant, but also I am looking for advice. Sorry if I ramble here. \n\nFor reference, I’m a government teacher. I majored in political science. I’m VERY qualified to discuss the nuance and differences of different political systems. \n\nThe text I got was this: \n\n> Good morning [my name]! My name is [sub’s name]. I am subbing for you today. We sat next to each other at a [school] dance and music show last semester in the primary school auditorium. I hope you recover quickly and completely. I read the text on your forms of government posters. The description of fascism is incorrect. Based on the description of capitalism, fascism is a form of socialism in which the state controls the means of production. Hitler and Mussolini did not differ in their leadership style or political beliefs they disagreed on how to achieve their goals and who should lead. In fact, they were on the same side.\n\nLike… excuse you?? \n\nFirst and foremost, you’re factually wrong, buddy. Fascism is NOT socialism and I don’t know what the hell you’re doing trying to tell me otherwise.\n\nSecond… what the fuck is your problem? I wouldn’t walk into an art teacher’s class and tell them “this isn’t real art.” I wouldn’t walk into a biology teacher’s class and say “evolution is fake. God made everyone.” I wouldn’t walk into a math teacher’s class and say “your methods for solving the problem is wrong and you should do it this way instead.” \n\nWhy? Because it’s HIGHLY unprofessional and also just rude as hell! So why the FUCK is this man doing this shit to me?\n\nFor full disclosure, my poster says:\n> “Fascism is a far-right, authoritarian, ultranationalist political ideology and movement, characterized by a dictatorial leader, centralized autocracy, militarism, forcible suppression of opposition, belief in a natural social hierarchy, subordination of individual interests for the perceived good of the nation and race, and strong regimentation of society and the economy.”\n\nMerriam fucking Webster defines fascism as:\n> “a political philosophy, movement, or regime (such as that of the Fascisti) that exalts nation and often race above the individual and that stands for a centralized autocratic government headed by a dictatorial leader, severe economic and social regimentation, and forcible suppression of opposition” \n\nSo what should I do here? Do I just let this roll off my back and occasionally share it as a funny story? Should I screenshot the text and email it to HR and my principal? I’m honestly just baffled at the absolute audacity of this guy. And I don’t *know this* yet, but I have a sneaking suspicion that he started bad mouthing me to my students over this in an attempt to undermine my credibility in the classroom. Which I’ll find out about from the kids on Monday, I’m sure. And will only piss me off more of that’s the case. \n\nWhat would you do?\n\n(Note: I teach in Texas. It’s a charter school. I’m, unfortunately, not in a union yet.)\n\nEdit: Gonna go ahead and address this now - if you try to argue with me over the definition of fascism, I’m going to block you. I’m entirely too sick to be dealing with that sort of bullshit right now.",
    "title": "Substitute TEXTS ME while I’m sick to tell me my class materials are wrong? Excuse you?? What should I do here?",
    "subreddit": "Teachers",
    "timestamp": 1694191181,
    "score": 185,
    "keyword": "mixed race principal"
  },
  {
    "text": "My school has a terrible approach to discipline for students - it disrupts the entire classroom and makes everything worse. Is this common or just my school? TLDR; In my school if a kid is chronically disruptive there is either no consequence or a positive consequence. The responsibility goes to the teacher to brainstorm how to better support them. The result is a classroom where the 90% of good kids are in a chaotic environment because the 10% have the run of the place.\n\n&#x200B;\n\nI've been teaching in NYC for 20 years now. When I started, I was very happy and while I felt overworked, my stress levels were not related to student behavior. Now I feel that MOST of my stress has to do with students disrupting the class to a degree that it is nearly impossible to have a pleasant classroom environment, and to work with the students who need extra help to a degree that they need or deserve. For context I work in a K-5 school.\n\nThe short version of this is that when a child is consistently disruptive in my school, the response from admin is a meeting with the teachers about what the teacher can do MORE to support the student. We have made behavior plans and checklists. We have to be accountable every day to this student and their parent in addition to all of our other responsibilities. If a student refuses to do their part, behaviorally speaking, there are no consequences (or there is a positive consequence for them). We literally have students who will spend the whole school day in the hallway playing on an ipad because if you try to ask them to do anything else they have a complete meltdown and teaching becomes impossible.\n\nThis is NOT a covid thing. It has been going in this direction for YEARS. Slowly but surely, the more recent approach has seeped into school culture, as newer students see the older kids getting away with everything and escalating it. Each generation pushes the envelope further, learning from our inaction that anything goes.\n\nTo add context I actually work in a very middle class neighborhood. Ethnically it is extremely diverse. I wouldn't say that one ethnic group is more represented than any of the others. The kids' friends groups are so diverse it's like a Benetton ad, which is really nice.\n\nThis is not the projects. I'm sure there are some in the neighborhood who have trauma in their lives, but not at the community scale that one would see in a high poverty neighborhood. Historically my school should be much more peaceful than it is. We have no excuse not to have a warm, comfortable school environment.\n\nI believe that when some kids act out it IS because of an unmet need. But that does not apply to all kids. Some kids just have a natural desire to do what they want when they want, and we should't affirm that. \n\nI'm also hesitant to put all of this on the parents. Yes, some kids come in with bad habits. But I believe that they can come to understand that there is one set of expectations, and things they can get away with at home, and another for school. The same way when a couple divorces, some kids know that there is some stuff that they can get away with at one parents' house that won't fly in the others' house. But the school needs to make those expectations known and enforce them. \n\nWe had a student (male) punch another student (female) in the face at lunch. He spent the next day in 'Lunch Detention' - this means going into the principals office where she gives him her phone and tells him to pick something off of seamless to order for lunch, and then he played with an ipad the rest of the lunch period. We had a 2nd grader who used to get up during minilesson and just run into the closet and bang his body into the wall over and over. Admin said 'ignore it - addressing it escalates. We don't want to make them more upset'. One day he got up and decided to break the classroom door window - on purpose. He was back in the room 45 minutes later like nothing happened. This is a suburban, middle class neighborhood.\n\nOf course I want MY experience to be better. But on a non-selfish level, I feel bad for the other kids in the class.\n\nWe DO NOT have self-contained (special ed) in my school. All kids who might be in that environment, some of whom are very emotionally disturbed, are put into large (30+) classes that are ICT (two teachers). We've gone from 20+ para's a few years ago (400 kids in the school) to 4 para's. The kids who need para's don't get them.\n\nNot only does this create a disruptive presence for the class, but I fail to see how putting an ED kid, or a kid who is autistic and thus easily rattled, into an overcrowded environment is even beneficial for THEM. The kids who need a lot of academic support are often ignored, because so much attention must be paid to the kid who is about to turn their desk over in a rage, because a teacher asked them to stop banging their pen against the desk during a mini-lesson, and they know that if they start to tear up the room and the first line strategy (ignore them, hope they stop) does not work, than they will be brought to the guidance counselors office to play board games, or allowed to take a walk.\n\nIn any given class 80-90% are absolutely lovely, wonderful kids who want to try their best. They are forced to go into a chaotic environment every day where a kid who scares them has more authority than a teacher. I feel bad for them.\n\nWhat do the other kids think and feel knowing there is a kid in the room who is violent? What do they think when a teacher who is supposed to be the thing between them an chaos, has to stand by and cede the room's energy to a kid who is intent on banging their chair and tearing up the bulletin board while they are supposed to be doing a fun activity? I'd be fucking traumatized if I was in 3rd grade and that was where I had to go every day.\n\nI had a student physically beat up a nice kid who is an abuse survivor and every conversation that followed among the adults was what more can we do to support the kid who was the aggressor? I spoke up and said 'there is a victim here and it is NOT \\[the aggressor's name\\]'. Admin got so pissed at me. They act like I'm a dinosaur who does not want to change. When asked about behavior in general, and the prospect of bringing back consequences, admin uses passive language like \"the world is different now'.\n\nI understand the theory behind getting the kids who are not 'school-ready' into a more inclusive environment, but I find that the negative consequences to the classroom feeling far outweigh the benefits to the kid who might be in special ed or d75. In fact I'd argue that it's worse for them too. A kid who needs help would do far better in a room with 12 kids and 4 adults than in a 30 kid 2 adult room. And a kid with ED is likely triggered by the over-crowdedness and lack of flexibility in a large classroom. No one is benefitting from mixing everyone together.\n\nAnd I feel bad for these kids who want to be there and who are not adversarial toward adults trying to create a good environment for them and other people. I'm ashamed (not that ashamed) to say that I literally fantasize about being given power over the class rosters and imagining what school would feel like if I was able to go to each room of 30 and remove the 3 kids in each room that were taking all of the class' energy and attention away and making it impossible to have a warm classroom environment. I think about the difference from even 10 years ago and it breaks my heart.\n\nI don't see myself finishing it out all the way to retirement.\n\nIs it just my school? I'm in D25 - A 'good' district. Our district superintendent is Dimango, and she seems to be a well of bad ideas regarding discipline and academic practice. Would transferring to another school help? Looking to hear about others' experiences.\n\nAnd before anyone replies - do not even fucking gaslight and condescend to me that this is about 'developing relationships with my students'. This is a school wide problem, and EVERY teacher is feeling it. Additionally I EXCEL at affirming and accepting my students and making them feel welcome. I have secret handshakes and nicknames with every kid. Most know me as the fun teacher and the cool teacher. They love me and I love them. I am MANY kids' favorite teachers. So please save your new age gaslighting for someone else.",
    "title": "My school has a terrible approach to discipline for students - it disrupts the entire classroom and makes everything worse. Is this common or just my school?",
    "subreddit": "Teachers",
    "timestamp": 1679234807,
    "score": 130,
    "keyword": "mixed race principal"
  },
  {
    "text": "Healthy schools do not need instructional coaches (mini rant). Not sure where else to share this, but after a whole summer + PD pre-season week of frustration with my school’s newly minted instructional coach, I had a bit of an epiphany. \n\nIf a school has healthy teachers and administrators, instructional coaches aren’t necessary. \n\nSchools should have a healthy mix of well qualified, seasoned teachers who naturally mentor younger teachers  by example. (And, with a proper stipend, mentor younger teachers formally through things like student teaching programs). \n\nAdministrators should be supportive and instructive and present in classrooms. They should know what is going on in classrooms and be able to effectively communicate expectations and offer support and advice. \n\nInstructional coaches are just a bandaid from lazy/absent administrators, sent in to coach underprepared teachers who have been deprived of healthy examples in colleagues and mentors. \n\nThis isn’t diminishing that there are some good instructional coaches… however, I’m fairly certain that those instructional coaches would be way more effective as classroom teachers themselves or as regular administrators (principals, APs, deans…) rather than as some superfluous middleman.\n\nEDIT: replies have been really interesting to read… those who have had positive experiences with instructional coaches—I’m curious how it’s better than regular collaboration between colleagues? I have no doubt that there are good instructional coaches out there… just seems like the role itself isn’t ideal.",
    "title": "Healthy schools do not need instructional coaches (mini rant).",
    "subreddit": "Teachers",
    "timestamp": 1691883163,
    "score": 22,
    "keyword": "mixed race principal"
  },
  {
    "text": "Falsely accused and reported to TEA I received an email this past weekend from an unknown parent informing my principal and I that last week during a field trip with my students, she witnessed me yelling at African American students multiple times. She “implored” my principal to take action and alluded to my actions being racially motivated. \n\nI had several adult chaperones on that field trip so I reached out to each one to ask if they ever witnessed me raising my voice at a student and to please let me know if this is something I may have done so I could learn from this. Literally every single parent replied that I never yelled at anyone, that I was actually soft spoken, and my students were all so well behaved that raising my voice was never necessary, and they were impressed with how everything went. \n\nWith permission from my principal, I replied to the parent thanking her for bringing this to our attention, that I was not dismissing her claims, but I was confused with what she saw because I don’t recall that happening nor did my chaperones. I asked that we meet so I could gain better clarity and grow from this as well. She replied angrily in all caps that she knows what she saw, knew what shirt color I was wearing, and that she didn’t want me to reply anymore. She also recommended I read a book on racial trauma because yelling at African American kids can cause trauma when it is done by another race. \n\nBy now, I was heated and I probably shouldn’t have replied, but I did. I removed the names of the parents on the screenshots and sent them all to her. I said it is apparent that she does not want to meet in person, I do not know her intentions, so this would be my last correspondence with her. \n\nShe replied, “Did you just say you don’t know my intentions? Your behavior is ridiculous!” Then said she would make a formal complaint to my state’s education agency (she CC’d the complaints email), my superintendent, as well as my principal. \n\nMy principal and I called the chief of schools together to inform her. She said that these things happen all the time and that they would handle it. I’m afraid this parent is going to continue to harass me. I contacted my union for advice on how to proceed, but I guess I’m coming to you all for some comfort and advice as well. Maybe similar stories to help me get through this?",
    "title": "Falsely accused and reported to TEA",
    "subreddit": "Teachers",
    "timestamp": 1680131191,
    "score": 16,
    "keyword": "mixed race principal"
  },
  {
    "text": "Imposter Syndrome - Am I ready for Junior Dev work? I feel ridiculous asking this question, but I'm receiving mixed signals from colleagues and trying to gauge where I'm at.\n\nTwo years ago I began my journey leaving teaching and entering IT.  Total of 6 years Tier II/III support experience (4 in college, 2 recent) and spent 10 years teaching robotics, computer science, and technology while acting as backup IT technician at the High School level.\n\nMy degree is in Mechanical Engineering, specializing in mechatronics.  In addition to engineering programming coursework, I've done undergrad and grad research in coding control systems as well as robotic swarms and consider myself 'adequate' at C-based languages.  My principal weakness is working with databases (designing/optimizing), and I'm actively working to learn in this regard.  My teaching focus involved working with JavaScript, Python, and Java with 9-12th graders.  I've mentored them in projects ranging from writing Pong to developing camera-based color-sensing Rubik's Cube Solvers.\n\nI'm back in Lvl II/III support, and a position has recently become available in my org for a Junior Developer.  It's a super supportive organization and I'd love to work for this team and their manager.  While I write Powershell pretty frequently for my work (interacting with AD on 25,000 users), it's nothing like the C# & Full Stack development these folks do.  I've touched MySQL and am comfortable with it, but this team lives in it.  I can solve just about all 'easy' level LeetCode challenges in the top 75 interview questions on my first try, though not all of them the most efficiently, and can get through most of the mediums less optimally in 1-2 attempts.\n\nIn their job description, they are asking for familiarity with C#, a CompSci/CIS/Engineering degree, and **2 years of dev experience.**  While I don't have industry dev experience, I would hope teaching 180 high schoolers basic CompSci counts for something? While trying to temper my ego, I believe my soft skills to be stronger than 98% of IT thanks to my teaching background, and thanks to my engineering degree and teaching HS engineering, my problem solving skills are comparable if not better than most junior devs (helping students debug code, reading their code, etc).  The job requirements are the same as the last time they hired a year ago, and at that time they hired another internal candidate with no dev experience, but that person had a CIS degree.\n\nFrom those of you in the field, does someone like me have a chance at a Junior Dev position?  Or am I fooling myself?\n\nThanks r/cscareerquestions",
    "title": "Imposter Syndrome - Am I ready for Junior Dev work?",
    "subreddit": "cscareerquestions",
    "timestamp": 1700632037,
    "score": 9,
    "keyword": "mixed race principal"
  },
  {
    "text": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me. Hey everyone, this happened at my daughter’s school this week and I’m kind of uncomfortable with how it went down. Would love to have some insight on this situation.\n\nMy daughter goes to a small school in our town where I volunteer in the library weekly. It’s my favourite day of the week, and I had a great time this week as always reading with and telling stories to the kids, plus getting to spend the day with my daughter. I got there a little early and since no one was in the library, I decided to go and paint with one of the teachers and some of the younger kids.\n\nAs we were painting, one of the little boys, let’s call him Miles, came up to us, pointed at the little bit of lace visible at the front of my wig and loudly said “Fake!” before he and his little brother sat down next to me and started to paint. I rolled my eyes, because kids are gonna be kids, and went back to what I was doing, but the teacher was clearly upset. She told him what he said wasn’t okay and made him apologize, I said it was fine he does that sometimes. She continued to tell me that didn’t make it alright, and started telling me about her experiences with racism growing up as an Indian woman.\n\nFor additional context I know this kid relatively well. I’m friendly with his parents, he’s friends with my daughter, frequently borrows her manga, and will generally come into the library to chat with me on the days I volunteer (translation: to show me his new Pokemon), read with the other kids and flip through whatever book I’m reading (he’s a very advanced reader). A few weeks ago at one of the school’s many events, a bunch of the kids and their parents were eating together and he said that he liked my hair. My daughter’s best friend said that it was fake. The school is very diverse and since a few of the black kids are either from mixed race families or have been adopted into white ones, conversations about my hair are frequent and sometimes the non-black kids join in. He asked what my real hair looked like and I told him that he'd already seen it several times.\n\nBack to the present, one of the other teachers (who was white) came up to me after lunch time and said that he and the other teacher were going to sit down and have a conversation with Miles about what he said and that it was important to talk to kids about racism. I said I didn't think it was necessary, but he continued to talk over me. If you recall my previous post about this school this is the same teacher who had been hitting on me, so I was way too uncomfortable to say as much as I probably should have.\n\nMy perspective on the situation is this. This kid wasn't racially stereotyping me, he has been present for multiple conversations about my hair, so he knew it was fake. He is a kid and is curious about cultural differences which is normal. I think non-black people have a different perspective than black people on what is considered unruly behaviour in a child. I also think non-black people think black hair is some kind of secret and are extremely uncomfortable talking about it or hearing it mentioned. I'm not.\n\nThe little boy is 7 years old. He's not white and comes from Middle Eastern/East Asian background, so there may have been an element of racism to the way the situation was handled towards him. He also made a comment about the first teacher's weight a few minutes after the one about my hair, so I also suspect that she just doesn't like him very much.\n\nAnyway, I'm curious about everyone else's perspective.",
    "title": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me.",
    "subreddit": "blackladies",
    "timestamp": 1688343941,
    "score": 68,
    "keyword": "mixed race principal"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 70,
    "keyword": "mixed race principal"
  },
  {
    "text": "Do you feel like it’s hard to fit in with other Asian Americans? Backstory: I grew up in a dominantly Black and Latino low income neighborhood. My parents were immigrants from Thai and Laos. Going into middle school-high school I hung out with a group of Asians. I thought that was really cool initially because I felt that there were more people who looked like me and enjoyed the things that I enjoyed as far as food and culture similarities growing up. All was well until I kept getting clowned for being “white washed” or not “Asian” enough. \n\nI was doing things at the time that weren’t seen as “Asian”. I played Football, involved with ROTC, hung out with people outside my race, dressed normally, and listened to rock, emo, and metal music. I tried to fit in by spiking my hair, dressing like I was a raver, getting into tuners, etc (this was the early 2000’s AZN movement). Even still, at the time I wasn’t asian enough and it messed with my head as a kid. I was more confused because compared to the “friends” I had at the time…I was fluent in my language and knew more about my culture than they did. Long story short, I stopped hanging out with them and did my thing. \n\nAs an adult I still feel like I don’t fit in but it doesn’t hurt me like it did before. I’m just more curious now. I have some Asian friends I keep in touch with and hangout with once in a while. When we have a big meetup I notice most of the time they have a huge group of other Asians vs my group of friends are more of a mixed group. Whenever I hangout with other Asians I feel like there’s a connection missing there and don’t really know what it is during those situations. Sometimes, it would be nice to connect with someone who shares similarities with me growing up as an Asian American. \n\nCurrently, I am a lead guitarist in a touring Metal Band and have a career in the Plumbing trade. Before that, I was/is a Marine Veteran and former Sheriffs Deputy. I am in a healthy Marriage with my Wife who is Latina and are planning our next stage of life.\n\nI’m proud of being Thai and still talk to my Father in my language. I’m very in tune with my culture and am comfortable with being myself. I don’t make being Asian my identity. \n\nWanted to reach out here on Reddit to hear if there are similar stories and if anyone needs a friend, I’m here.",
    "title": "Do you feel like it’s hard to fit in with other Asian Americans?",
    "subreddit": "asianamerican",
    "timestamp": 1697813820,
    "score": 1,
    "keyword": "mixed race principal"
  },
  {
    "text": "Trans men reveal how toxic society is towards men--MANY sources included &#x200B;\n\nhttps://preview.redd.it/luajuj8w4e6b1.png?width=790&format=png&auto=webp&s=3ef59a9188afe3a26d6caaeb18858427c4666be6\n\nRecently I've been looking at the FtM trans community online, and it's just sad how accurate this meme is.\n\nThe FtM trans community is much smaller than the MtF community, but FtM experiences post-transition are very revealing.\n\nThis community is interesting because their complaints are not only about failing to pass as male, but also about trying to cope with passing as male. From what I've seen, this problem is especially common with those who have completed transitioning and are attracted to women.\n\nAnd once they start getting treated like men, they get a brutal reality check.\n\nMany times, they are people who believed in concepts such as unilateral patriarchy, oppression of women, and male privilege. In their minds, they were gonna lead privileged lives once they became men, but when they transitioned, they were like rabbits caught in headlights as reality hit them like a train. Real life was a 180 degree difference.\n\nThese people have been treated like women their entire lives, and had been led to believe the game was fully rigged against women.\n\nImagine you're playing a game against bots, but you don't realize it and think you're good at the game. Suddenly, you get thrown into a professional match.  \nFucking brutal man.\n\n&#x200B;\n\nhttps://preview.redd.it/i07fp8hx4e6b1.png?width=735&format=png&auto=webp&s=36369715accef2d9714fc6177e1d0e852f6f5ba9\n\nHe said \"like I died and came back as a ghost.\" It's like that movie where Bruce Willis is dead but doesn't realize he's a ghost, and no one can see him. It really nails the reality of being a sub5 male in the West. If you're not [talented](https://journals.sagepub.com/doi/abs/10.1177/0305735613482025), [rich](https://www.sciencedirect.com/science/article/abs/pii/S1090513808001177?via%3Dihub), or a [chad](https://faculty.wcas.northwestern.edu/eli-finkel/documents/EastwickFinkel2008_JPSP.pdf), [that is literally how life can be](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373).  \nTough scenes man, truly.\n\n\"...her reaction was something like disgust mixed with pity.\"\n\nWelcome to the fucking club brother. \"[Disgust mixed with pity](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\" Believe me, I know what it feels like. And now bro, you do too.\n\n\"I used to look in the mirror and envision myself as this confident, strong man...\"\n\nIn his mind, he was gonna transition and drink beer and watch football. He was gonna be like \"yo, bitches, yo, yo\" and life was gonna work out just like that.\n\nThat is how disconnected from reality some people are. They have to find the truth out the hard way.  \nJust because you'd been told about how the system was rigged against women, you thought you knew the ugly side of life.\n\nBut you don't man. You ain't about that life.\n\nThese people are so naive. They look at celebs like Elliot Page.\n\n\"Oh look, Elliot Page has a hot girlfriend.\"\n\nYou ain't Elliot Page. He rode his Stacy look in Hollywood for fucking two decades. And only after his looks faded, he decided to come out. In a sense, he played his cards right.\n\nHe could transition into whatever he wants. He has the status, fame, and money. He could transition into a frog tomorrow with some experimental DNA injection, and [he would still date whomever he wanted.](https://www.youtube.com/watch?v=ol3nAWRLIDA)\n\nYou cannot.\n\nYou literally turned yourself into an inkwell.\n\n&#x200B;\n\nhttps://preview.redd.it/4nxe5z7z4e6b1.png?width=707&format=png&auto=webp&s=4943719e08227f88f88bd92175d6352b9d3530c8\n\nRight off the bat: 5'3. At 5'3 [it's pretty much](https://www.researchgate.net/publication/236670565_The_height_of_choosiness_Mutual_mate_choice_for_stature_results_in_suboptimal_pair_formation_for_both_sexes) [over](https://incels.wiki/images/thumb/e/ea/Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png/800px-Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png?20190704023738), man.\n\n\"People who I barely just met will make rude comments or jokes about my size.\"\n\nThis is true. Happens all the time. Other men sometimes will try to throw you under the bus to make themselves look like an alpha, and then they'll play it off as a joke if you say anything back. [Social dominance games happen all the time](https://www.sciencedirect.com/science/article/abs/pii/S0191886913012245).\n\n\"...plenty of women will reject me just for my height...before I even get a chance to tell them I'm trans.\"\n\nPay attention to the word choice here. So it's okay if it happens to XY men because they're just g[enetic trash if they're 5'3](https://www.salon.com/2011/09/25/sex_cells_interview/), but because he's an XX man, he should get a pass for being 5'3?\n\nAre you really gonna feel any better if you get fake sympathy because you're trans? Personally, I'd rather get rejected for genuine reasons than get a pity pass.\n\n\"...when I try to be confident some people hate short guys with confidence...they see it as a person who doesn't know their rightful place.\"\n\nThis is so true. I love this part. [If you don't have the looks but have the confidence, it annoys people](https://gwern.net/doc/psychology/okcupid/weexperimentonhumanbeings.html). [They think you don't know their place](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116).\n\n\"You gotta be acting because there's no way someone with your looks can be confident.\"  \nIt just doesn't look natural. You'll be seen as someone who crosses the borders of natural hierarchy. [They will feel a subconscious hostility against you](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\n\n\"I don't even benefit from the privileges the average man gets.\"\n\nWait until he learns that [the only privilege average men have is that which they have over sub5 men](https://arxiv.org/pdf/1607.01952.pdf).  \nI love how he thinks that if he was 5'8, his aforementioned problems would just go away. In reality, he would likely end up just like the first poster, getting reactions of disgust mixed with pity.\n\n\"Even studies will show you how height really affects men, [they get paid less](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2709415/), [suicide rate goes up](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373), [more likely victims of crimes](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC32258/pdf/612.pdf), [seen as less attractive](https://www.independent.co.uk/life-style/love-sex/dating-app-tinder-bio-words-most-right-swipes-music-gym-6-foot-badoo-a8512541.html), and so on.\"\n\nWelcome to the ugly fucking reality.\n\n[As a woman, if you're tall, many men will see you as better genetic material for their offspring. If you're short, you'll be seen as more attractive.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9454610/) You really can't lose.\n\n[These days, even obese women are celebrated](https://www.instagram.com/plussizecafe/?hl=en). Meanwhile, being [just overweight as a man](https://royalsocietypublishing.org/doi/full/10.1098/rspb.2017.1819#d3e552) is a virtual death sentence for your dating life.\n\nAnd this isn't only about dating. It goes way beyond dating to life itself. That's the real privilege, [how you're treated by people](https://www.sciencedaily.com/releases/2005/04/050412213412.htm), [the connections you make](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116). It's about everything, man.\n\n&#x200B;\n\nhttps://preview.redd.it/geedhfu05e6b1.png?width=605&format=png&auto=webp&s=5d3562ddf94d42a605a6fcc8bff0f35d1fd27aac\n\n\"I'm a very quiet, thoughtful, and sort of emotionally sensitive trans guy...\"\n\nRight off the bat, if you're like that as a man, you will be seen as a meek bitchboy by even the most socially progressive women.\n\nBut never pay attention to what people say. Progressive women will say \"oh yeah man, crying and showing emotions doesn't make you less of a man, it doesn't make you weak, it actually makes you more of a man bro.\"\n\nBut trust and believe when I, a progressive myself in many regards, say this. [If you are emotionally vulnerable in their presence, their pussies will dry up harder than the fucking Serengeti](https://journals.sagepub.com/doi/abs/10.1177/0146167214543879). And once again, this person had to find it out the hard way.\n\n\"...if I stayed as a girl I wouldn't have to worry whether I did nothing because I would still be liked and appreciated.\"\n\nExactly. I like this one because it includes the social aspects of the difficulties that come with manhood rather than just difficulties in dating. The middle paragraphs are underrated, really. He's spot on.  \n[As a guy, if you're not talented or have a respectable career at a certain age, you're looked down upon by society](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10206369/).\n\nMeanwhile, if you're a woman, if you don't have career ambitions or aren't talented in some field, you won't get dissed by society. [If anything, men will see you as better wife material](https://link.springer.com/article/10.1007/s10645-022-09412-w).\n\nThis is what we mean by \"tutorial mode.\" Men these days are expected to have the full package: [looks](https://link.springer.com/article/10.1007/s40806-017-0092-x), [race](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4631383/), [height](https://www.sciencedirect.com/science/article/abs/pii/S0191886913000020), [money](https://www.sciencedirect.com/science/article/abs/pii/S109051381730315X), etc.\n\nThis is why many men are struggling today. Many women, on the other hand, have none of these expectations placed on them by society.\n\nAnd these FtM men were not aware of the biggest JBW they had: [just be a woman](https://www.tandfonline.com/doi/abs/10.1080/14792779543000002). They fell for the line that men have it easier.\n\nAnd when they transition, the reality hits them like a fucking train. All the social privileges they took for granted have suddenly vanished like smoke in the air. But since they've grown up as female-presenting, they haven't developed the necessary coping skills to deal with the difficulties that come with being a man.\n\nBeing a man in the West is a constant battlefield where you're competing with other men for resources and women.\n\nThis is why I always say obsession with self-improvement for the sake of getting puss is a form of female supremacy. All the redpill gurus and PUAs are telling you to have money, interesting hobbies, ambitious goals in life, a gymmaxxed body, turn yourself into Thanos and travel to Vormir to get the Soul Stone, but for what?\n\nThe average woman, [who is overweight](https://www.medicalnewstoday.com/articles/321003#:~:text=One%20of%20the%20commonly%20used,the%20category%20of%20%E2%80%9C%20overweight%20.%E2%80%9D) and [much more prone to crying than the average man](https://journals.sagepub.com/doi/10.1177/1069397111404519).\n\n\"I want my man to be accomplished and have ambitious life goals?\"\n\nBut what have you accomplished? Do you own a startup and employ people? [You got a liberal arts degree](https://www.amacad.org/humanities-indicators/higher-education/gender-distribution-bachelors-degrees-humanities), and [now you work in retail](https://www.census.gov/content/dam/Census/library/publications/2020/demo/acs-44.pdf).\n\nRedpill dating coaches telling you to improve to get women are the real simps.\n\nAnd the people in this post have not yet realized this. They're in for a wild ride, I can tell you that much.\n\nDon't be a free agent in life. Let the truth guide you.",
    "title": "Trans men reveal how toxic society is towards men--MANY sources included",
    "subreddit": "MensRights",
    "timestamp": 1686926079,
    "score": 1027,
    "keyword": "mixed race principal"
  },
  {
    "text": "I wonder if men of shorter stature are invisible to feminists, or make just as good cannon fodder. You know what they say, \"Men don't have to worry about being safe when walking at night\".\n\nLike this comment:\n\n>The really sad thing is that women even have to consider whether a man is a threat. But this is a reality in the life of a woman. You probably never think twice about walking in a deserted parking garage, or the vehicle parked next to yours with a person sitting in the passenger seat, or getting in an elevator and a man steps in just before the doors close. I guarantee every woman takes her safety into account in these situations.\n\nOh gee, I forgot, that male privilege gives me 100% damage reduction from bullets, punches/kicks, etc.\n\nAnd also: \"It's your duty to intervene, to call out sexism, etc. etc.\" like the infamous Gillette ad four years ago: \"To say the right thing. To act the right way. Some already are. In ways big and small. But some is not enough.\"\n\n\"Men have to hold other men accountable.\" said Terry Crews, the 6'2\"/237# former NFL player.\n\nOkay, now I am 5'7\"/150#, with no athletic inclinations whatsoever. I don't watch any sports at all because it bores me to tears (except classic auto racing, from ca. 1950-2000), I don't know anything about (American) football and don't care to learn because it won't be useful to my life, and with my shorter stature and athletic disinterest combined, thus can't exactly count on physical strength. Do they really think that all men are 6' or taller?\n\nAnd now it's my duty to call out a 6'5\"/250# football player in a cocaine-induced rage because he told one sexist joke.\n\nWhat do they think is going to happen? That this guy will just say \"Oh, hey, you're right, I shouldn't have said that, I will educate myself and try to do better.\" So, tell me you've never met another person before without saying you've never met another person before. This \"~~protect your daughter~~/educate your son\" virtue-signaling. Because I can tell for sure that Bart is totally open to being educated. It's not like he's already an underachiever at school, a prankster and disrespects authority (Homer, Principal Skinner, etc.), calling Homer generally by his first name and not \"Dad\" and [diss raps about him on stage, calling him a fat load.](https://www.youtube.com/watch?v=DTsB95Snluc) He'd totally listen, right? And \"saying all men are rapists/it's in their nature is misandrist/insulting to men/shows you have a really low opinion of men\". Opinion is like an asshole, everyone is entitled to one, doesn't mean it's always right. And when did I say that it's in the nature, point out the exact words. Also, France (Prime Minister Georges Clemenceau) did not try to \"educate the Germans\" at the Paris Peace Conference, but really wanted to really punish Germany hard, harsh reparations, territory annexations, the whole nine yards, because they bore the brunt of the WWI horrors. As he said: \"America is far away, separated by ocean, and even Napoleon couldn't touch England. You two are both sheltered, we are not.\" I guess maybe Woodrow Wilson and David Lloyd George should have called him out for \"having a low opinion of the Germans\" or that he was being \"insulting to the Germans!\"\n\nAnyway, back to the main point, more likely, this 6'5\"/250# football player will be throwing me down on the floor and then beating the shit out of me. Like I said, I'm just 5'7\"/150#, so if he wanted to harm me, he is going to succeed at it. So I have to \"be an ally\" and risk life-threatening injuries, and later also pay the medical costs (at best), have to spend my entire life in wheelchair (worse case) or die (worst case), but hey, at least now I have earned some \"ally points\". What a good deal, where and what for can I redeem them? Like Bill Allen said: \"Better to be a live coward than a dead hero. Sure people will still sing about dead heroes from time to time, but aside from that they get little attention. Unless they manage to get a holiday named after them. Even then, it's not like they get to enjoy the day off.\"\n\nSo, actually here's another debate topic. **For men of shorter stature, safety is not a given.** And many of those feminists tend to also be politically more on the progressive-liberal (not necessarily left/leftist) and collectivist/authoritarian side. The side that's usually not so gun-friendly. But if I am two inches below the average American male height, how am I supposed to defend myself? Not that have to actually want to shoot someone, oftentimes the mere sight of a gun will make an attacker think he's not that tough after all and scamper. I mean, it's such a tragedy that the feminists have to walk with car keys between their fingers while walking at night. While if I did that, since I can't count on physical strength, I would only achieve 1) making the assailant angrier and thus 2) reducing my chances of survival, not to mention fucking up my fingers. Or if I carried pepper spray or mace, it would end up right in my face if used downwind. Knife? You know what they say, \"The winner of a knife fight dies in hospital, the loser in the street.\"\n\n**So, for a shorter man, dating may be harder, but there are more important, more pressing issues, like self-defense/self-preservation.**\n\nPostlogue: But hey, if it mainly targets women, then it's all \"society bad, men bad, have to change\". But when the vast majority of the crime victims are men, \\**crickets chirping*\\* Like New York in the 1970s, in the Lindsey and Beame era, when the city was near bankruptcy (Remember the infamous NY Daily News \"Ford to City: Drop Dead\" headline?), and had to \"defund the police\" to stabilize the budget. And the best NYPD could do under those circumstances was to pass out pamphlets at JFK/Newark/LaGuardia saying \"[Until things change, stay away from New York City if you possibly can.](https://archive.org/details/FearCity/)\" Very likely, the vast majority of the crime victims then were men. So will the feminists also agree that all this was victim blaming: \"Stay off the streets after 6 PM, do not walk, avoid public transportation, remain in Manhattan, protect your property, safeguard your handbag, conceal  property in automobiles, do not leave valuables in your hotel room\"?",
    "title": "I wonder if men of shorter stature are invisible to feminists, or make just as good cannon fodder.",
    "subreddit": "MensRights",
    "timestamp": 1674052416,
    "score": 65,
    "keyword": "mixed race principal"
  },
  {
    "text": "Boys asking to be converted to girls are cultural refugees escaping persecution, of a demographic whose humanity was revoked, similarly to how Jews of 16th-century Spain were driven to request conversion to Christianity to escape persecution by the Inquisition and be regarded human beings In 1949, Jean Paul Sartre’s spouse, Simone de Beauvoir, published a book called The Second Sex, where she wrote that “One is not born, but rather becomes, a woman”. She explained that in her view [there is a difference between sex at birth and what she referred to as Gender](https://www.heritage.org/gender/report/sex-gender-and-the-origin-the-culture-wars-intellectual-history),  which she defined as a social construct. Simone de Beauvoir is  described by feminists as one of the founding mothers of feminism, and  this is historically accurate: after expanding de Beauvoir’s perception  during the 1960s so that the term “gender” would include virtually all  differences between men and women, [feminists have been declaring](https://plato.stanford.edu/entries/feminism-gender/) for 60 years now that manhood and womanhood are not the manifestation of two innate sexes, but merely [cultural-molds](https://www.britannica.com/topic/sexism/Sexism-and-feminism). Following de Beauvoir’s footsteps feminists contended [that men have created](https://www.bbc.com/future/article/20170315-the-invention-of-heterosexuality)  these “molds” to oppress women, by the social construction of  masculinity and femininity, which according to this feminist depiction  of humanity do not result from any biology of two sexes. Women’s  liberation thus became in feminism the deletion of the concept and word  “sex”, to erase the acknowledgment it entails of innate differences, and  replacing it with the idea and term “gender” which would denote  “cultural molds” of differences – such that all sexes-differences would  be construed as arbitrary, strictly socially-constructed, and  oppressive, and listed for erasure, to be achieved by fierce social  action and at all cost until there’s no content to the notion “man”  distinguishable from “woman” – and this and only this – would be  liberation.  The actual physical differences and sex organs were to be  seen as some “external makeup” (related to a person’s inner workings no  more than a tattoo would be – a “three-dimensional tattoo”), average  emotional or cognitive differences that generate average differences in  tendencies or preferences, as “stereotypes that perpetuate themselves”,  sexuality differences as “an invention made by men for their own  convenience”. Of molecular differences such as the different  distribution and function of the receptors for sex hormones in the body  and brain, feminists were not aware, and their ability to hear about  them gradually declined as they restricted any discussion of biological  differences, labeling it “chauvinistic”. The principal tool feminists  have been using for accomplishing their goal of deleting by social  action any and all sexes-differences, perceived by them as “merely  cultural differences”, is familiar to all of us – Gender Studies – whose  name was chosen to announce the underlying perception shared by all  feminists and to promote it by inscribing the term and concept on their  department door like a slogan on a sign: GENDER.\n\nTrue – a person called John Money did  develop an approach to sexes differences, and within an extremely   isolated group of psychologists he may have had some resonance that  traveled for a few decades among some idiosyncratic practitioners,  unknown to most people even within psychiatry, having eventually some  marginal effect in the 2000s on treatment approaches to people  requesting to change their sex. However, this is definitely not what  popularized the term “gender” in its “culture molds” meaning, nor the  perception that all differences between the two sexes should be accepted  as “socially constructed” and could thus be “socially-erased” since  they are in the first place “determined socially”. This popularization  was done entirely by feminists. As someone who studied psychology  including some years in a doctorate degree, I never heard the name  Money, until about a year ago, when social media started implicating him  as the cause for the new madness. It is obvious why his name was  brought up – it was done to show that operating on children to change  their sex can bring about their suicide. But despite this motivation  being correct in principal, Money is causally, historically, not what  had spread and disseminated the term “gender” as designating “cultural  molds” and the idea that innate manhood and womanhood “don’t exist” –  this was all done by feminists, who have been loudly expressing this  perception on every opportunity for approximately five to six decades.  As a very deliberate implementation of their perception about the sexes,  feminists methodically responded to any question that had the word  “sex” in it by using in their answer the term “gender” instead, to  “correct” the speaker’s wording. When no one knew what precisely the  word is supposed to mean in the feminist dialect, “gender” has always  been one of the words feminists insisted on as being  “politically-correct”. The feminist dictated dictionary included  “survivor” instead of victim, “sex worker” instead of prostitute,  “gender” instead of sex. The word in de Beauvoir’s sense of “cultural  molds” became publicly known solely because it was chosen by feminists  to be their trademark, as it still is today.\n\nBy the 1980s, the then-minuscule feminism invents a sort of club, [calling it “identity politics”](https://muse.jhu.edu/article/859072) (the term was [coined and proposed by feminists](https://muse.jhu.edu/article/859072)),  with the sole purpose of attempting to unilaterally annex to the  negligible feminist core various segments in society such as gays or  ethnic minorities to make that obscure core seem wide and formidable.  The annexation never included asking the annexed; for decades polls were  showing 90% objection to identity politics in all of these groups, by  their  objection to what identity politics offered as a substitute for  authentic human empathy – “political correctness” (this obscurity of  feminism and its identity politics prevailed for decades,  until 2017,  when in me-too [feminists used social-media violence](https://lovists.com/2021/10/26/metoo/) to impose their perceptions. Up to that point these perceptions were esoteric – in 2016 [a poll in the UK](https://www.telegraph.co.uk/women/life/only-7-per-cent-of-britons-consider-themselves-feminists/)  reported that only 7% of Britons identify as feminists). During the  first two decades of the 2000s, by a feminist complaint that always [ignores equal numbers when such numbers are reached](https://lovists.com/2021/01/28/what-does-equality-look-like-in-the-feminist-society-we-live-in/), women became [74% of psychologists](https://www.apa.org/gradpsych/2011/01/cover-men#:~:text=Data%20from%20APA's%20Center%20for,influx%20of%20women%20as%20well.)  – almost all of whom educated to be feminists. In the same two decades  feminist mockery of men and boys becomes battering and enters the  mainstream. Women’s journals publish joyful interviews with women who  share [their castration fantasies](https://thoughtcatalog.com/jessica-winters/2016/01/cross-your-legs-guys-18-women-share-their-explicit-castration-fantasies/) – a horrendous feminist castration fantasy was normalized. In those two decades, unsurprisingly, under the increasingly-[acceptable hatred for males](https://www.washingtonpost.com/technology/2021/11/21/facebook-algorithm-biased-race/) a [growing number of boys](https://www.quora.com/Are-transgender-men-female-to-male-more-common-than-transgender-women-male-to-female)  start showing “sadness of own sex” dubbed “gender dysphoria” which  means literally “sadness of own sex”, and between 2000 and 2015 the  proportions of boy-to-girl sex-transition requests in clinics become [**four times**](https://www.quora.com/Are-transgender-men-female-to-male-more-common-than-transgender-women-male-to-female) higher than girl-to-boy requests.\n\nIn me-too in which radical feminists  used their identity politics to recruit as many social segments as  possible to their “no sexes exist, everything is culture-molds that men  invented for oppression, men and manhood are the sickness of the world”,  after exhausting the list of segments they reached in 2018 the trans.  Trans were never an active part of the feminist identity-politics club nor of the  feminist belief in “no sexes exist, there are only cultural molds”, and  always believed they were **not** born in the other sex, but are, **transitioning** to  it (at least in their subjective belief, while for better or worse  changing sex is in fact not possible biologically), hence their name –  trans-itioning, and hence the medical procedures (for someone who thinks  that “man” and “woman” are nothing but cultural molds, switching would  mean changing “culture-mold-elements” such as clothes, not biological  form, as she believes that the man-woman distinction in not biological;  but for trans as for everyone else except feminists, the man-woman  distinction was always biological which is why trans-sexuals regarded  biological operations and medication as the transitioning). Ignoring  this, the me-too vortex re-drafted trans beliefs about themselves to the  feminist culture-mold belief, and, being the most isolated group in  society, after a few months of a rather confused disagreement in 2018,  trans accepted their one-sided annexation by the identity politics club  and by that began adopting for the first time the feminist revision of  their own self-perception, from: “the man-woman distinction is a  biological distinction and I’m transitioning medically because I was ***not born*** in the other sex, but want to be in it”, to the myriad of contradictions of: “I was ***born*** in  the other sex and hence need operations to be in it, because a man and a  woman are just social constructs and not biological entities hence I  need biological surgeries and biological treatments to move between  them”.\n\nBeing 75% of psychologists and having  after me-too absolute power in most of the media, with a legitimized  castration fantasy and [publicly-accepted animosity to maleness](https://lovists.com/2021/09/28/letter/), feminists [promoted](https://lovists.com/2021/03/01/science-plus-violence-equals-silence-the-gender-church-equation/) in clinics, [schools ](https://youtu.be/qCKcs4ODJBY)and the media the practice of chemical castration of [an exponentially-growing number of boys](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0202330), who, after being raised in [exceedingly mainstreamed and  institutionalized anti-male hate](https://lovists.com/2021/09/28/letter/), mysteriously, [wanted not to be considered male](https://www.reddit.com/r/MensLib/comments/opf24t/feelings_of_gender_dysphoria_without_being_trans/).  To hide the possibility that through their hegemony in the corridors of  psychology they are actively avoiding other possible approaches such as  encouraging these boys to learn to appreciate maleness and to love  themselves as they are (as done for example with anorectic girls, [who share similarities with children labelled with gender dysphoria](https://www.researchgate.net/publication/235369838_Gender_Identity_Disorder_and_Eating_Disorders_Similarities_and_Differences_in_Terms_of_Body_Uneasiness)), and that by this avoidance they have crossed a line from acceptance to encouragement to  boys to begin castration, as well as to prevent any sincere inquiry  into the reason for the sky-rocketing rise in the number of boys  expressing discontent with their maleness (which may identify as the  cause the exposure [from birth](https://www.youtube.com/watch?v=ydm5AgVxD8I&list=PLrZ1vxWe4hK6dJeQsEbS9bBRYS0RHdmgM&index=120) of some boys in certain social strata to institutionalized feminist hate, sometimes coming even [from mothers](https://www.reddit.com/r/MensRights/comments/v6xsf3/my_feminist_mother_is_a_monster/) and sisters [consumed by the feminist anti-male rhetoric](https://www.youtube.com/watch?v=k144B_4GAT4&list=PLrZ1vxWe4hK6dJeQsEbS9bBRYS0RHdmgM&index=128)), feminists started the “acceptance” wars.\n\nThese were firstly initiated to present the active role of feminist clinicians [and teachers](https://www.youtube.com/watch?v=qCKcs4ODJBY&list=PLrZ1vxWe4hK6dJeQsEbS9bBRYS0RHdmgM&index=216) ([and sometimes mothers](https://youtu.be/1AP5SQcDiuc))  in chemical castration of young pre-puberty boys, as “nothing more than  passive acceptance of a pre-existing innate quality of the child  expressed by the child” (thus the innateness of being a man or a woman,  which per feminism exists in no person, because per feminism these are  just cultural molds, suddenly does exist, but only when a person is  “innately born in the **other** sex” – in all the rest of  us there’s no innateness to our being a man or a woman, only trans  children have this peculiarity). We should keep in mind that this was  and is said of toddlers [as young as three](https://lovists.com/2021/03/01/science-plus-violence-equals-silence-the-gender-church-equation/),  an age in which children are still learning to talk and would make  mistakes even in naming colors, and that only toward the age of four  after completing previous stages of cognitive development such as  identifying colors and family relations, do children acquire the more  advanced concept of sex, along with the idea of “men have penises and  women have vaginas” and will make mistakes as when learning color names,  simply because toddlers learn every new concept through a game of trial  and error. We should also keep in mind that there is no such biological  phenomenon as “a boy born a girl” or “a girl born a boy” – the  chromosomes, cells, biology **and brains** of children treated as “born in the other sex” [are identical to those of all members of their sex](https://pubmed.ncbi.nlm.nih.gov/29263327/)  – they are ordinary children. You might not be aware of such scientific  data, the reason being that the cynical identity-politics network that  feminism has been attempting to expand for decades (where universal  humanist solidarity will be replaced by a “rights exchange market”  called “inter-sectionalism” for egocentric deals between “groups”,  formed by deconstructing humans into traits), has  evolved through the  fear-culture that  feminists quickly generated out of me-too into a  threat-driven hegemony in the intelligentsia, that began [censoring science and medicine](https://lovists.com/2021/03/01/science-plus-violence-equals-silence-the-gender-church-equation/) from within the academia to prevent such data from reaching the public and even [to stop ongoing research](https://www.vice.com/en/article/m7a4n4/ucla-pauses-unethical-study-designed-to-mentally-distress-trans-people).\n\nWhen facing objections, and now with a  record of actions of genitalia mutilation in minors (defined in an  international treaty as a crime against humanity including, so the  treaty states, when done by creating **a culture** that would cause the minor to cooperate with this mutilation), feminists started using their [power gained through me-too](https://lovists.com/2021/10/26/metoo/) in institutions and the media to demand that no one stand in their way, with [incitement against any objection with the word “phobic”](https://www.spectator.co.uk/article/now-even-richard-dawkins-is-cancelled-by-the-humanists), while abusing their power to [fire, silence and censor](https://miamistandard.news/2022/04/08/psaki-puberty-blockers-for-trans-kids-are-necessary-the-best-practice/?amp=1)  any criticizer. By 2020, girls, raised from birth with applauds from  feminists, became jealous of the excited feminist applauds to boys who  announce themselves trans (from the perspective of many feminists, the  boys are to be applauded for relinquishing the sin and evil of maleness,  by which, in that common feminist perception, the boys are admitting  male evilness and confirm as males the soundness and righteousness of  the feminist hate to maleness and the supremacy of femaleness). Girls  thus began copying the boys to receive again the applauds they were used  to receiving, and [matched trans boys in numbers ](https://www.liebertpub.com/doi/abs/10.1089/trgh.2019.0070?journalCode=trgh)– within that same year a large feminist outcry against “what transitioning does to girls” was formed with [books ](https://www.amazon.com/Irreversible-Damage-Transgender-Seducing-Daughters/dp/1684510317)and in [panels ](https://www.youtube.com/watch?v=TTZsfk6Ms6s&t=355s)–  not a word about the boys, as if mutilating girls was a mistake and not  the goal but mutilating boys was the goal and not a mistake.\n\n \n\nThe castration drive of feminists,  their publicly-expressed hate to maleness, and their decades of  promoting the “no sexes exist, everything is just culture-molds for  oppression” for hideous incitement against men by blaming them for the  very existence of the biology of humanity and for women’s innate  tendencies, were now all legitimized through the power feminism attained  by abuse of me too, culminating in encouraging castration publicly,  which now necessitated for covering the active encouragement and any  possible connection between tens of thousands of boys requesting not be  considered males and years of anti-maleness coming even from teachers  and mothers, a hypocritical demand to “accept” – that humanity isn’t  humanity, that “women are men” and “men are women”, a dictation which  predictably had to result in [putting rapists in women’s facilities](https://www.dailymail.co.uk/news/article-9870055/Transgender-YouTuber-raped-mom-79-interrupts-court-hearing-brag-shes-internet-famous.html)  – because a male rapist who identifies as a woman really is a woman.  This is what entire countries are required by feminism to accept in  order not to dispute feminism’s belief that men and women are just  social constructs and are thus decided socially – this leading  immediately and necessarily to the consequence that “social acceptance”  of someone’s “self-identification-as” creates a reality “because the  reality was to begin with merely a social construct”, with the direct  implication that ***not***  “accepting” is ***inhumanely  denying*** of a person some ***reality*** (again, this illogical thinking, of arguing that “being ‘born in the other sex’ is ***an objective reality***” while insisting that this “objective reality” is “completely dependent on ***subjective*** social construction and hence on social acceptance”, and contending that manhood and womanhood are entirely **social** and at the same time asserting that switching between them therefore requires **biological**  modifications including in children, is at the heart of the feminist  misconceptions – these inconsistencies are not a gap in the criticism  but precisely what the criticism is pointing to.  Feminism often leans  on blunt contradictions, because feminism stems from drives and urges  and these are often inconsistent in humans – feminist thinking is  fundamentally a system of rationalizations for contradicting impulses,  many of them violent). Countries have to accept the dictation, because  following me-too any refusal to accept anything coming from feminism is  misogyny, while being a moral person means accepting every feminist  statement. And so, the court in the UK has now sent a man charged for  raping two women, and identifying as a woman since being charged, to a  women’s prison.\n\n**Most women did not object to  feminist lies and madness over decades nor when in late 2017 feminists  immediately turned me too into a violent insanity-spreading device to  act upon their violent drives, this eventually reaching making  mutilation of children acceptable, which then required an entire culture  of lies that had to result in putting rapists in women’s prisons. Women  are now sleeping in the bed they’ve made. Stop the madness – abort  feminism and return to universal humanism. Female separatism, also known  as “feminism”, is nothing but sex-nationalism and sex-racism. It is  premised on hate, and on paranoid false beliefs generated to justify the  unfounded hate, and those false beliefs are hurting everyone including  women.** **Equality for all has only one name –** [**universal humanism**](https://lovists.com/2022/04/27/humanism/)**.** Feminism is not part of humanism and [not an equality movement](https://lovists.com/2021/05/10/why-i-am-not-a-feminist/) but [a hate movement](https://lovists.com/2021/09/28/letter/) premised on hate. Reject feminism – return to universal humanism, equality, sanity, humanity.",
    "title": "Boys asking to be converted to girls are cultural refugees escaping persecution, of a demographic whose humanity was revoked, similarly to how Jews of 16th-century Spain were driven to request conversion to Christianity to escape persecution by the Inquisition and be regarded human beings",
    "subreddit": "MensRights",
    "timestamp": 1680880845,
    "score": 54,
    "keyword": "mixed race principal"
  },
  {
    "text": "Circumcision in the New Testament: a survey   \n\nI've noticed that a lot of people on this sub are anti-Christian because of circumcision. As a Christian myself, this does not spark joy. I'll start by admitting that there are a lot of Christians who support the practice. Which is unfortunate.\n\nBut I want to let the Bible speak for itself (*with a little commentary*). While some Christians may like cutting up little kids, looking at the Bible should show you that the Christian faith itself does not.\n\nThat said, there are Christians who'll read everything I quote below, and come back saying 'I don't see any of this as a condemnation of the practice'. I submit that anybody who reads this:\n\n**Philippians 3:2**: Watch out for those dogs, those evildoers, those mutilators of the flesh.\n\n*and this:*\n\n**Galatians 5:2**: Mark my words! I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all.\n\n**Galatians 5:12:** As for those agitators, I wish they would go the whole way and emasculate themselves!\n\nand comes away saying 'I see no problem with circumcision from a Christian point of view' is not being honest. 'Christ will be of no value to you' is the worst thing you can say to a Christian (same as 'you'll be obligated to follow the whole of the law;' see below).\n\nProcess: I basically opened Bible Gateway and looked up 'circum'; to get these. This is every direct mention I found in the New Testament.\n\nSome of them look fairly neutral on the surface, but remember: 'first do no harm' (a principal in the hypocritic oath. That's not a typo. Not when I'm talking about mutilators of the flesh).\n\nThere are a lot of verses to go through, so I don't expect anybody to read this all at once; think of it more as a resource. In reading the verses I've posted, please find a Bible and read around them for context. \"Never read one verse.\"\n\nPro-circumcision:\n\n**Acts 16:3**: Paul wanted to take him (*Timothy*) along on the journey, so he circumcised him because of the Jews who lived in that area, for they all knew that his father was a Greek.\n\n*This one is a specific case, where Timothy had to preach to Jews who knew his father was a Gentile but his mother was Jewish. It doesn't apply to more general cases. (See Titus in Galatians 2:3, below*.)\n\nNeutral on circumcision:\n\n*The New Testament does report several times when it actually happened without condemning it (there are several times in the Bible that it reports on a heinous event without editorializing, btw):*\n\n**Luke 1:59**: On the eighth day they came to circumcise the child, and they were going to name him after his father Zechariah,\n\n(*This is about John the Baptist.*)\n\n**Luke 2:21**: On the eighth day, when it was time to circumcise the child, he was named Jesus, the name the angel had given him before he was conceived.\n\n(*I like to think that God condemned the practice after He went through it Himself.*)\n\n**John 7:22-24**: ^(22) Yet, because Moses gave you circumcision (though actually it did not come from Moses, but from the patriarchs), you circumcise a boy on the Sabbath. ^(23) Now if a boy can be circumcised on the Sabbath so that the law of Moses may not be broken, why are you angry with me for healing a man’s whole body on the Sabbath? ^(24) Stop judging by mere appearances, but instead judge correctly.”\n\n(*Here, Jesus is using the example of circumcision as work that can be done on the Sabbath. Note that He contrasts it with 'healing a man's whole body', though. As if it's the opposite of healing, perhaps?)*\n\n**Acts 7:8**: Then he gave Abraham the covenant of circumcision. And Abraham became the father of Isaac and circumcised him eight days after his birth. Later Isaac became the father of Jacob, and Jacob became the father of the twelve patriarchs.\n\n*(Note: see Romans 4:9-12 below)*\n\n*The following verses use the terms 'the circumcised / the circumcision group' simply as a means to differentiate Jews from Gentiles.*\n\n**Acts 10:45**: The circumcised believers who had come with Peter were astonished that the gift of the Holy Spirit had been poured out even on Gentiles.\n\n**Acts 11:1-3**: ^(1) The apostles and the believers throughout Judea heard that the Gentiles also had received the word of God. ^(2) So when Peter went up to Jerusalem, the circumcised believers criticized him ^(3) and said, “You went into the house of uncircumcised men and ate with them.”\n\n**Galatians 2:7-12**: ^(7) On the contrary, they recognized that I had been entrusted with the task of preaching the gospel to the uncircumcised, just as Peter had been to the circumcised. ^(8) For God, who was at work in Peter as an apostle to the circumcised, was also at work in me as an apostle to the Gentiles. ^(9) James, Cephas and John, those esteemed as pillars, gave me and Barnabas the right hand of fellowship when they recognized the grace given to me. They agreed that we should go to the Gentiles, and they to the circumcised. ^(10) All they asked was that we should continue to remember the poor, the very thing I had been eager to do all along.\n\n^(11) When Cephas came to Antioch, I opposed him to his face, because he stood condemned. ^(12) For before certain men came from James, he used to eat with the Gentiles. But when they arrived, he began to draw back and separate himself from the Gentiles because he was afraid of those who belonged to the circumcision group.\n\n**Ephesians 2:11-12**: ^(11) Therefore, remember that formerly you who are Gentiles by birth and called “uncircumcised” by those who call themselves “the circumcision” (which is done in the body by human hands)— ^(12) remember that at that time you were separate from Christ, excluded from citizenship in Israel and foreigners to the covenants of the promise, without hope and without God in the world.\n\n(*Note the 'done in the body by human hands' part, which devalues the act.*)\n\n**Titus 1:10**: For there are many rebellious people, full of meaningless talk and deception, especially those of the circumcision group.\n\n*The following verses say it has no value, however, I'd add that when the Bible says (at best) it has no value; contrast that with the harm it does. The torture and mutilation it inflicts on an innocent baby.*\n\n**Romans 2:25–29**: ^(25) Circumcision has value if you observe the law, but if you break the law, you have become as though you had not been circumcised. ^(26) So then, if those who are not circumcised keep the law’s requirements, will they not be regarded as though they were circumcised? ^(27) The one who is not circumcised physically and yet obeys the law will condemn you who, even though you have the written code and circumcision, are a lawbreaker.\n\n**Romans 3:1**: What advantage, then, is there in being a Jew, or what value is there in circumcision?\n\n**Romans 4:9-12**: ^(9) Is this blessedness only for the circumcised, or also for the uncircumcised? We have been saying that Abraham’s faith was credited to him as righteousness. ^(10) Under what circumstances was it credited? Was it after he was circumcised, or before? It was not after, but before! ^(11) And he received circumcision as a sign, a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but have not been circumcised, in order that righteousness might be credited to them. ^(12) And he is then also the father of the circumcised who not only are circumcised but who also follow in the footsteps of the faith that our father Abraham had before he was circumcised.\n\n^(28) A person is not a Jew who is one only outwardly, nor is circumcision merely outward and physical. ^(29) No, a person is a Jew who is one inwardly; and circumcision is circumcision of the heart, by the Spirit, not by the written code. Such a person’s praise is not from other people, but from God.\n\n**1 Corinthians 7:18-19**: ^(18) Was a man already circumcised when he was called? He should not become uncircumcised. Was a man uncircumcised when he was called? He should not be circumcised. ^(19) Circumcision is nothing and uncircumcision is nothing. Keeping God’s commands is what counts.\n\n**Colossians 2:11**: In him you were also circumcised with a circumcision not performed by human hands. Your whole self ruled by the flesh was put off when you were circumcised by Christ,\n\n**Colossians 3:11**: Here there is no Gentile or Jew, circumcised or uncircumcised, barbarian, Scythian, slave or free, but Christ is all, and is in all.\n\nAnti-circumcision: \n\n**Acts 15:5-11**: ^(5) Then some of the believers who belonged to the party of the Pharisees stood up and said, “The Gentiles must be circumcised and required to keep the law of Moses.”\n\n^(6) The apostles and elders met to consider this question. ^(7) After much discussion, Peter got up and addressed them: “Brothers, you know that some time ago God made a choice among you that the Gentiles might hear from my lips the message of the gospel and believe. ^(8) God, who knows the heart, showed that he accepted them by giving the Holy Spirit to them, just as he did to us. ^(9) He did not discriminate between us and them, for he purified their hearts by faith. ^(10) Now then, why do you try to test God by putting on the necks of Gentiles a yoke that neither we nor our ancestors have been able to bear? ^(11) No! We believe it is through the grace of our Lord Jesus that we are saved, just as they are.”\n\n*The following shows that Paul has been preaching against circumcision:*\n\n**Acts 21: 20-21**: ^(20) When they heard this, they praised God. Then they said to Paul: “You see, brother, how many thousands of Jews have believed, and all of them are zealous for the law. ^(21) They have been informed that you teach all the Jews who live among the Gentiles to turn away from Moses, telling them not to circumcise their children or live according to our customs.\"\n\n  \n\n**Romans 2:12 – 15**: ^(12) Those who want to impress people by means of the flesh are trying to compel you to be circumcised. The only reason they do this is to avoid being persecuted for the cross of Christ. ^(13) Not even those who are circumcised keep the law, yet they want you to be circumcised that they may boast about your circumcision in the flesh. ^(14) May I never boast except in the cross of our Lord Jesus Christ, through which the world has been crucified to me, and I to the world. ^(15) Neither circumcision nor uncircumcision means anything; what counts is the new creation, since there is only one God, who will justify the circumcised by faith and the uncircumcised through that same faith.\n\n**Galatians**\n\nI won't reproduce the whole book of Galatians here, but here's a bit from the introduction to Galatians in the NIV Study Bible: \n\n\"*Occasion and Purpose*\n\nJudaizers were Jewish Christians who believed, among other things, that a number of the ceremonial pracices of the OT were still binding on the NT church. Following Paul's successful campaign in Galatia, they insisted that Gentile converts to Christianity abide by certain OT rites, *especially circumcision*…\n\nBy introducing additional requirements for justification (e.g., works of the law) (Paul's) adversaries had perverted the gospel of grace and, unless prevented, would bring Paul's converts into the bondage of legalism.\"\n\n(*emphasis mine*)\n\n*Here are specific references from the book:*\n\n**Galatians 2:3**: Yet not even Titus, who was with me, was compelled to be circumcised, even though he was a Greek.\n\n**Galatians 5:2-15**: ^(2) Mark my words! I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. ^(3) Again I declare to every man who lets himself be circumcised that he is obligated to obey the whole law. ^(4) You who are trying to be justified by the law have been alienated from Christ; you have fallen away from grace. ^(5) For through the Spirit we eagerly await by faith the righteousness for which we hope. ^(6) For in Christ Jesus neither circumcision nor uncircumcision has any value. The only thing that counts is faith expressing itself through love.\n\n^(7) You were running a good race. Who cut in on you to keep you from obeying the truth? ^(8) That kind of persuasion does not come from the one who calls you. ^(9) “A little yeast works through the whole batch of dough.” ^(10) I am confident in the Lord that you will take no other view. The one who is throwing you into confusion, whoever that may be, will have to pay the penalty. ^(11) Brothers and sisters, if I am still preaching circumcision, why am I still being persecuted? In that case the offense of the cross has been abolished. ^(12) As for those agitators, I wish they would go the whole way and emasculate themselves!\n\n **Galatians 5:12-15**:  ^(12) Those who want to impress people by means of the flesh are trying to compel you to be circumcised. The only reason they do this is to avoid being persecuted for the cross of Christ. ^(13) Not even those who are circumcised keep the law, yet they want you to be circumcised that they may boast about your circumcision in the flesh. ^(14) May I never boast except in the cross of our Lord Jesus Christ, through which the world has been crucified to me, and I to the world. ^(15) Neither circumcision nor uncircumcision means anything; what counts is the new creation, since there is only one God, who will justify the circumcised by faith and the uncircumcised through that same faith. \n\n(*Note: 'he is obligated to obey the whole law' is about the worst thing that you can say to a Christian. It means your Christian faith is worthless.* *It's the same as saying 'Christ is of no value to you', as mentioned.*)\n\n**Philippians 3:2-7**: ^(2) Watch out for those dogs, those evildoers, those mutilators of the flesh. ^(3) For it is we who are the circumcision, we who serve God by his Spirit, who boast in Christ Jesus, and who put no confidence in the flesh— ^(4) though I myself have reasons for such confidence.\n\nIf someone else thinks they have reasons to put confidence in the flesh, I have more: ^(5) circumcised on the eighth day, of the people of Israel, of the tribe of Benjamin, a Hebrew of Hebrews; in regard to the law, a Pharisee; ^(6) as for zeal, persecuting the church; as for righteousness based on the law, faultless.\n\n^(7) But whatever were gains to me I now consider loss for the sake of Christ.\n\n(*This is the Apostle Paul talking about how he fits all the Jewish laws.*)",
    "title": "Circumcision in the New Testament: a survey",
    "subreddit": "MensRights",
    "timestamp": 1687436371,
    "score": 15,
    "keyword": "mixed race principal"
  },
  {
    "text": "My thoughts on Female-only wagons Some countries like India, Japan, and Brazil have wagons exclusive for women. That means only women are legally allowed to enter. If you're a man and enter a Female-only wagon, you're charged for a crime and receive punishments. The countries have different punishments, and a video shows a man in India being slapped all the way out and forced to do squats in public with the hands on his ears by an apparent female cop. https://youtu.be/ggWy50I9et8\n(I couldn't find the neat video, so this link is a report on it. This report had even the guts to defend the law and authorities who did this. Not even if you're caught stealing it's considered right to do this. He received that punishment for being a man). In India, there are not only entire trains dedicated to women, but they also have bus seats reserved to them, among many other things, not to mention the \"women-only\" facilities. I was surprised to see that a bunch of MRAs agreed or sympathized with these laws. So I've decided many years later to make this post telling my thoughts about it. One of the reasons they (MRAs) defended those laws was due to Japan's and India's massive number of passengers, making it nearly impossible to identify abuse. However, we have to understand that there aren't wagons reserved for men like male and female restrooms. Those facilities are reserved for women, and we don't have a similar thing for men. That is, women have the option to opt for the cars, trains, seats, and facilities that are available for everyone or the ones available only for women, while men don't have a similar option. This is practically a manifestation of the thought that women are pure, innocent, and/or victims. This contradiction (the lack of choice for men and women being free to choose) is important for us to comprehend the nature of the discussion, rather than thinking we're being \"equaly\" split (like men and women are commonly match with same-sex roommates, cellmate, etc. or the existente of male and female restrooms, in this case, the discussion takes other parameters. And I'm not saying that it's \"equal\", since women inmates receive better treatment in prison than men does and female restrooms are sometimes better built or has better care than male ones do.) That's why I believe those are just one more female privilege.\nhttps://at.tumblr.com/batatafrita1936/710237251503800320/53jq9jlh9awb\n\nSo, as feminists obviously turn every issue that majorly affects men into a consequence of social cheuverism, sexism against women or other terms, that case would be no different even as you're surprised for common sense saying it's completely absurd. Feminists groups basically split into two positions; those who advocate for female-only wagon as it'd be a need since men represents a danger to women in the train; and the other feminist group that don't accept Female-only wagon as they define it as \"women segregation\".\nIf you're asking yourself how feminists still think it's segregating women by giving them a place only they can access and prevent men from entering it, \"feminism\" is the only answer I can possibly give you.\nIf you have to teach a young boy, \"That train, you're not allowed to go there.\"But why, Daddy?\" \"Only women are allowed in there\" I don't think that's exactly \"segregating women\" as they (women) can legally go anywhere men are (except those who have a similar place for them, where men also cannot go like separated male and female restrooms) and are socially accepted to do so. But that's just an inequality society pretends not to see and they would label it childish if you complain that as a teenager (greetings from a teenager boy who just turned 18 and is forced into the military).\nAnd for the other group of feminists who points out (sometimes biased) numbers of women being abused on the train, or posting on tweeter news that they found a man spying under women's skirt using a camera, I have an answer that will even churn up many MRAs. Yes, I'm very sorry for this, but sometimes, reason has to overcome feelings. My answer to this group would be \"f*** them, it's their problem.\" Honestly, if you're angry about that, congratulations, you just committed a double-standard. If you think a male abusing woman or a male spying women's underwear are a reason to prevent men from entering a place, why don't you prevent black people from entering places as they're the majority of the accused and the majority of inmates in several places of the world? Black people are obviously victims of the social system. That's why they're often targeted as offenders (for instance, everyone knows police tend to target black people more). Men, however, have different views towards them. The reason for that is that we don't simply let aside all moral and ethical principles when it comes to black people. For men, however, society doesn't care about moral principal since they're not considered human to begin with. In some places of the world, a woman is arrested for sexually abusing a dog but can legally rape a man without committing any crime. If a black, asian, christian, or muslim person pulls a gun in the supermarket, it'll never be a reason to prevent that religion or race from entering that place or beginning the new apartheid. I come to the conclusion that every argument feminist or female only facilities advocates make is simply justifying the unjustifiable. And that women only facilities should not exist regardless of the conditions as it's against all equalities principles and moral principles (which are useless when the ones damaged are males) and nothing can justify such vileness.\nPlease share your thoughts or any other additional information you have.",
    "title": "My thoughts on Female-only wagons",
    "subreddit": "MensRights",
    "timestamp": 1677349689,
    "score": 4,
    "keyword": "mixed race principal"
  }
]