[
  {
    "text": "2 job offers in an hour. Which should I choose? I work as a teacher as my primary occupation. \n\nJob A: I would be teaching my ideal subject and grade. I've waited for 3 years to teach high school social studies.    I would be making 10% more money than job B and the cost of living is lower where this job is located.  I also would not have to move. The principal at job A is better his job and the school as a whole is better than the school in job B. I don't really enjoy living in this area though.  Not much to do and people are kind of closed off.  \n\nJob B: is teaching the same subject and grade (freshman English) that I taught last year.  I had great success and test scores last year.   Job B is located 8 hours closer to my parents and my best friend and his family lives in the area.  I would be moving 700 miles for this job.  I also would be living in a more urban area which I have mixed feelings about.  There is much more to do in this area and I have many more friends and acquaintances.  Less pay and higher cost of living and there will be much more time sitting in traffic.\n\nYour thoughts, oh wise sages of reddit?\n\nI can answer any follow up questions if needed.",
    "title": "2 job offers in an hour. Which should I choose?",
    "subreddit": "jobs",
    "timestamp": 1500127190,
    "score": 2,
    "keyword": "mixed race principal"
  },
  {
    "text": "Got a strane email from an older male student but given the context I'm not sure if it's a red flag or not... Backstory for context:\nI am a University student getting my degree and certification in TESOL – Teaching English to speakers of other languages.  I volunteer three-four times a week, two hours each time in a local community college’s ESL classroom.  Each quarter we get old students graduating out of our class (it’s beginning elementary English) and get new students signing up for class.  I speak Spanish and Chinese, as well as English.\n\n\nI always take a special shine (even though I’m not supposed to) to specific students, and certain students really take a shine to me over some of the other classroom assistants.  I like to learn a lot about my students, and usually make an effort to get to class early and stay a little late to get to talk to the students outside of class.  \n\n\nBeginning of my problem:\nLast quarter I had a student, let’s call him Jeng.  He is a late-middle-aged Chinese immigrant, and his wife who I’ll call Xue is also in the class.  He was in our beginning level class, but he’s quite obviously NOT a beginning level English speaker.  He’s damn near fluent, but he just has trouble writing, so needed a quarter in a low level class to catch his writing up with his speaking.  Jeng was always so jovial.  He was very chatty with us, the teachers and the other students.  He always had the most to say, and sometimes could go off on random but entertaining conversation tangents.\n\n\nJeng was VERY complimentary.  To everyone, but I felt like he ‘picked’ on me a lot.  (I say picked but it wasn’t a bad thing, though it was sometimes awkward).  He started out just saying the usual, that I was smart, that I was a good teacher, that I was very helpful.  Then he found out that I speak Chinese, and he would compliment me on my accent, my pronunciation, my vocabulary choice if he ever heard me speaking it.  I’m not a very verbose Chinese speaker though, my vocab is pretty limited, so he would always offer to give me Chinese lessons after class.  \n\n\nThen the compliments got…strange.  He would compliment me on my ‘fair’ skin.  He found out I’m mixed race and then kept telling me I was beautiful and fair for my race (I am very light skinned for my mix but….it’s just a weird compliment to receive, it’s not something I usually take as a compliment but I knew he was just trying to be nice.)  Then he asked me about my ‘white’ side, and I said my ‘white’ side is Dutch, because I tell everyone this, it’s not a secret and I’m not bashful about it.  Then, the next class, he told me ‘You have a very regal air about you, like you could be a fair Dutch queen.’  \n\n\nHonestly I felt like this compliment was way over the top, but what was I supposed to do?  I just tried to deflect in my usual self deprecating way, but he kept insisting for days that I looked like a European queen, or European Princess, or ‘Aristocrat.’  But the thing is, his wife was with him every time he would compliment me, and she would smile and nod, though she wasn’t big on talking (her speaking level was lower than his.)  So, I always got the feeling that these kinds of compliments were somewhat normal to them, and not anything weird.  So I let it go, and chalked it up to a clash of cultures, which happens A LOT in ESL classrooms.  \n\n\nMy current problem:\nI always give out an email address to my students so that they can email me when I’m not in class for homework help, since I assign a lot of them specific homeworks.  But today I got an email from Jeng, who isn’t even in my classroom this quarter, and said he and his wife ‘really like me’.  He wrote ‘My son is coming from China and I think it is good that you meet him!  Then, maybe I can give you Chinese lessons!’ \n\n\nAm I overthinking this?  Is this weird?  Or is this just a little bit overzealously friendly?  I’ve never been to China myself, and so I don’t know if this is a common sort of practice?  My friend joked that maybe he’s trying to set his son up with an American girl but I don’t think that’s the case, I’m pretty sure Jeng told me once his son had a wife or girlfriend or something.  The thing is, if this were a white guy in his early 50s?  I’d probably report him to someone.  But it’s this sweet friendly old Chinese man and his wife, so I feel like there might be a cultural disconnect happening here.\n\n\nI just need someone to tell me ‘no you’re not crazy for feeling weird’ or ‘oh you’re crazy this is a totally normal type of interaction in the context of Northern Chinese culture’ I guess.  What do you ladies think?  I feel like my ‘lady defense’ shield is always up but maybe it shouldn’t be?",
    "title": "Got a strane email from an older male student but given the context I'm not sure if it's a red flag or not...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485592009,
    "score": 4,
    "keyword": "mixed race principal"
  },
  {
    "text": "Should I continue to sleep with my friend? [Disclaimer: As of right now, I am 18 soon to be 19. If you read this post, you'll quickly figure out that I am quite young. I was slightly conflicted between posting this on here or r/Teenagers, but I remembered 13 year olds are over there. I understand that this is an adult issue, so I would like some adult perspective. I guess I am explicitly stating this because I don't want to be talked down to. I know sex comes with this clusterfuck of feelings and issues and conflicts, so on and so forth. I always use condoms, get tested regularly for STDs and I have Mirena inserted. I love having sex, but I want to hold on to the pretense of having a \"future\". I promise you that my Christian mother who had me at 22 has talked to me enough.]\n\nQuick background/rant, sorry:\n\nWe have been really close friends since 11th grade and by our senior year of high school, we had both been in relationships for over a year. But, after some talking, sexting, etc, for a few months, we decided to have sex. I think it was supposed to be a one time thing, but we have been seeing each other off and on since January of this year. I broke up with my boyfriend the day after the first time, but he has still been with his girlfriend. I think I kept seeing him the earlier half of this year because it made me feel less alone. Plus, it has different with him so far.. like sex is unbelievably good.\n\nThe last time I came home (Thanksgiving) he told me that his girlfriend wanted to sleep with someone else of a specific race, so they made an agreement that he could have sex with someone else as well. (If you think this is weird, trust me, so do I.) Since, we have already been seeing each other, he asked me if I wanted to, and of course I said yes. (MORE Background: I go to a university with 50,000+ students. I know I might find someone decent eventually.. but the guys I have been with so far suck in terms of sex.)\n\nMy senior year I felt really bad sleeping with him (+ guilty for cheating). Looking back now I think I was really jealous of his girlfriend and confused with why he was sabotaging his relationship. I know my self-esteem is wrapped up in this still; I am trying to figure out how. For one, I have never wanted to date him (obviously, he cheats, among other reasons). I have always felt jealous seeing them together at school, pictures of her on the internet, etc. Despite just getting out of a relationship, not wanting another one because I knew I was going off to college, maybe... I subconsciously wanted to be with someone?\n\nNow, I am a freshman in college. I have been back home twice and I saw him both times. I really like seeing him. Despite everything else, he is a really good friend of mine and I always have a fun time with him. I think early December while I was prepping for finals he told me that for sure he didn't want to do this anymore. (He has been extremely on and off this entire year.) I agreed because I have always let him decide. I think ONCE, I have texted him first. I really like seeing him and I know I'm going to have a good time, so why say no? But, whenever he would tell me that he wanted to stop, I respected that. Until November, we had seen each other maybe once a month up until August. We go weeks without talking, then he hits me up. I don't mean to be so easy with him, but it is such a chill situation.\n\nOn the other hand, I get bothered by this notion and the posts that circulate the internet that say something along the lines of \"Guys always cheat on a 10 with a 5\" and \"They do it because the 5 is easy to get\". Shit like this. I hate seeing it, because all I think is about this situation. His girlfriend is fucking gorgeous. I know I shouldn't compare myself to anyone, but it's hard. She is feminine, curvy, has beautiful longish dark, curly hair and pretty skin. I am mainly skinny (as a black girl, this isn't the most ideal shape) and look like a 12 year old boy. I don't like the idea of being that sorry \"5\". \n\nFurthermore, I have mixed feelings about him having a girlfriend. I like it because I feel comfortable knowing that this is merely a friends with benefits situation, but I feel bad for her. So many times I want to DM her and tell her that she is beautiful and (probably) smart and funny and talented and she should not be with this loser. (She is a senior in HS now.) I want to tell her that she deserves so much better and she has her whole life ahead of her and she has no reason to stay with this lame ass dude. She will eventually find someone that isn't so emotionally dependent on other people that they cheat when she needs time to herself. But, that \"loser\" is my friend and I can't do that to him. I know he loves her and is good to her, but still.\n\nNow, him and his girlfriend have decided to take a break after New Year's. For them, that means being \"basically single\". Naturally, he texted me and asked if I would be willing to see him and I said yes. But, now I am conflicted; being in college, I am too busy to care about any repercussions, because I see him, then I leave. HOWEVER, when I do care I feel ugly in terms of my personality and my personal appearance, like I'm that \"sorry 5\". I guess I'm asking should I remove myself from this situation permanently or should I continue see him?\n\nTL;DR - I've been the side chick of a good friend of mine for almost a year now. It kind of makes me feel shit about myself, but he is really good in bed and I enjoy the dynamic of our friendship. (No feelings, time in-between, optional, etc.) I'm in town for a few more weeks, should I see him  or should I stop seeing him for good?",
    "title": "Should I continue to sleep with my friend?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1514360814,
    "score": 0,
    "keyword": "mixed race principal"
  },
  {
    "text": "Looking for comments/reactions to this incident that recently occurred at my school Very upsetting thing happened recently at the high school where I work and would like people’s reactions/thoughts because I really can’t wrap my head around it. It is a little long and detailed so bear with me.\n\nA teacher was non-renewed for next year. Although the full reasons are between this teacher and admin, I was told by another teacher who had talked to the non-renewed teacher, it was due to inappropriate relationships with students – nothing sexual, but texting, giving rides to students, being friends on social media, etc. of which this teacher who told me confirmed by showing me a snapchat of the non-renewed teacher’s story of a pic of the non-renewed teacher driving with a student in their car. Added to this, there were supposedly other issues as well with this teacher’s professionalism/practices. I don’t know the teacher personally and never really interacted with them other than a few polite conversations. \n\nThe day the teacher was told they would be non-renewed, the teacher broke down in front of their class, crying, explaining they had been wrongly terminated, it was unfair, unjust, etc.\nIn response to this, students got intensely upset and angry, deeming that there had been an injustice done as many really liked this teacher. This fervor grew throughout the day, although from my POV, I just held class as normal, hearing this and that through students from claims of racism (the non-renewed teacher was a minority) to students arguing back and forth over the cause of the teacher’s non-renewal of which they really could only speculate. I would shut these conversations down best I could, reminding them that speculating leads to rumors which hurts people and I just said we wouldn’t be discussing the issue. \nSeveral to many students were absent from every one of my classes. It turns out, they were staging a broken sort of protest; an attempted sit-in, talking about walking out, because of the perceived injustice that they thought occurred. After the fact, I learned that students were verbally assaulting administration (swearing, calling them names) and demanding the teacher not be let go. Large swathes of students were storming the guidance area to demand the teacher be allowed to come back and refusing to go to class. Although I didn’t see any of it, supposedly, social media was lit up by terrible comments aimed at the administration, specifically, the principal. The non-renewed teacher left after their first class so wasn’t directly involved. \nIt reached the point where, at the end of the day, the principal, obviously shattered and holding back tears over the intercom, tried to quell the situation by explaining that such comments led to him and others feeling very hurt and wanting to reassure others who weren’t involved that this wasn’t with the true culture of our school – it came off as an odd mix of heartfelt pain of being abused all day by students, and a weird balance of working to not directly condemn any students behavior at the same time. Basically, he just sounded exasperated and hurt and was pleading with students to try and contain their emotions and negative comments in-person and on social media.\nWe received an email the following morning asking us to be extra aware of student’s emotional state and allow them to skip class to head to guidance if they felt they needed to express their concern, anger, etc. Just a few students (in my classes at least) did this. The email also contained more admin speak about the culture of our school not reflecting the anger and rude things said on social media and that our duty was to first protect the emotional state of students during this difficult incident. Aside from a little more gossip about the issue and students arguing over it, I believe there were students trying to get signatures to reinstate the teacher, and groups of students were dressed up in certain colors in support of the teacher with hashtags written on them #FreeFIREDTEACHER. Class went on generally as normal but with more admin/teachers regularly in the halls - that’s about it.\nThe previous day, admin. allowed students to amass outside their doors and holler swears and insults at them all day, students were not told to go back to class, explaining to them that their feelings were valid and more or less accepting the idea that, yes, the teacher had been unfairly let go. From what I understood from other teachers talking about the issue, students believed that the teacher was non-renewed over a trivial issue, something involving making a poster for their door that some students didn’t like because they perceived it as offensive and the principal had the non-renewed teacher to take it down – this was months ago. \nFurthermore, no students were punished for either skipping class or their outrage/blatant disrespect toward admin. It seemed that teachers, myself included, just largely stayed out of the issue and watched in awe as students roiled over something they really had no idea or right to get so upset about – yes, this second year teacher may have been a favorite teacher of some, but they had no idea the real reason this teacher was let go and exploded in a rage that grew and grew throughout the day, initially spurred by the action of the non-renewed teacher and a mess of ugliness on social media.\nWhy I can’t shake this issue is – why did admin. let this occur and what does that say about the institution of our school, perhaps all schools, that this kind of thing was handled this way? Thoughts? Reactions? Has anything like this happened at your school? Do you think anything would ever happen at your school or would it be handled differently?",
    "title": "Looking for comments/reactions to this incident that recently occurred at my school",
    "subreddit": "Teachers",
    "timestamp": 1497718913,
    "score": 24,
    "keyword": "mixed race principal"
  },
  {
    "text": "2 teaching job offers in an hour. Which should I take? Job A: I would be teaching my ideal subject and grade. I've waited for 3 years to teach high school social studies.  I would also be teaching 2 AP classes.   I would be making 10% more money than job B and the cost of living is lower where this job is located.  I also would not have to move. The principal at job A is better his job and the school as a whole is better than the school in job B. I don't really enjoy living in this area though.  Not much to do and people are kind of closed off.  \n\nJob B: is teaching the same subject and grade (freshman English) that I taught last year.  I had great success and fantastic test scores last year.   Job B is located 8 hours closer to my parents and my best friend and his family lives in the area.  I would be moving 700 miles for this job.  I also would be living in a more urban area which I have mixed feelings about.  There is much more to do in this area and I have many more friends and acquaintances.  Less pay and higher cost of living and there will be much more time sitting in traffic.\n\nYour thoughts, oh wise sages of reddit?\n\nI can answer any follow up questions if needed.",
    "title": "2 teaching job offers in an hour. Which should I take?",
    "subreddit": "Teachers",
    "timestamp": 1500137234,
    "score": 24,
    "keyword": "mixed race principal"
  },
  {
    "text": "[Inner city] [US History/8th grade] - Black vs African-American? I'm white. For the past four years, I've been teaching 8th grade in a school where 90% of the students are black. I've only taught ELA, but when something comes up regarding race and I say \"black\", someone will cheekily say \"it's AFRICAN-AMERICAN!\", or when I say \"African-American,\" someone will cheekily say \"Just say BLACK, I'm not from Africa!\"\n\nIn reality, I just mix it up based on what sounds better in the given sentence. I probably say \"black\" more because African-American is hard to say with a lot of syllables. But I have some sensitive students that take themselves pretty seriously, so I'm trying to avoid angry parent phone calls this year.\n\nThis is my first time teaching U.S. history so race is going to come up a lot. I want to explain from the start what I just said here, but I really have no right to tell them \"You shouldn't be offended by black!\" or \"Most of you aren't even from Africa, so I'm not using African-American!\"\n\nAny advice? Should I just accept there will be complaints either way and ignore them like I do with most petty complaints?\n\nOther info if it matters:\n\n* In a major northeast city\n\n* Most teachers are white\n\n* Right on the border of a very white neighborhood, so most kids are pretty racially desensitized\n\n* About two kids a year will angrily call me a cracker, so racism is still there a bit",
    "title": "[Inner city] [US History/8th grade] - Black vs African-American?",
    "subreddit": "Teachers",
    "timestamp": 1502968943,
    "score": 12,
    "keyword": "mixed race principal"
  },
  {
    "text": "Update to \"I think I'm in over my head\". So 6 months ago I posted this: https://www.reddit.com/r/Teachers/comments/4xx4ac/i_think_im_in_over_my_head/\n\nHere's a summary of my first semester in my district's alternative program:\n\nWe were 4 teachers: 3 alternative certification (no teacher training or experience) and 1 long term sub. We also had one first year Behavior Management Specialist.\n\nWe had up to 75 students. These kids are in 6-12. They come to our program for 45-180 days after expulsion hearings or when they're released from the Department of Juvenile Justice. Some are the real deal, with violent criminals history, gang affiliation, fights in school and on the bus, and they're frequently in and out of jail. Some were caught with drugs in school (weed or xanax). Some just had too many office referrals. A few have IEPs, but most are unmedicated and their IEPs are only loosely followed at best. Many more have undiagnosed LDs. Only a handful come from decent homes. \n\nThe vast majority of them are loud and uninterested in school, but most are decent, respectful kids if you treat them like human beings. Some will curse you out, but I really like almost all of them. \n\nSo they end up with us for one reason or another. And we're supposed to run a very strict, structured, highly restrictive, punitive program. It's supposed to scare them straight. It's supposed to feel like jail. We have 4 blocks, 4 teachers, and 4  mixed classes. One middle school, one mixed middle and high, and two high school, all with kids in different classes.\n\nMy certification is for MS Social Studies and History and HS History (NOT Social Studies). I have students who are supposed to be doing everything from US History and Constitution to 7th grade World History. If they're actually assigned a social studies class. Many are supposed to be working on things like Health, ROTC, Spanish, Economics, Marketing, Law Education, Art, and Earth Science in my class. I don't speak Spanish. I'm not certified to teach any of those things. Even if I just follow the curriculum, I have 16 other kids in other classes I'm supposed to be teaching at the same time. Even when I have a couple kids in the same class, they're in vastly different places in the curriculum.\n\nThe kids all have tablets. They're supposed to work on Edgenuity, which aligns with the classes in their home schools and should keep them on track if they're self-motivated enough to keep up. None of them are. It's a boring, unengaging, tedious program that shows videos, asks questions, and then quizzes them. Endlessly. They do this in all 4 blocks every day, with a 20 minute break for lunch.\n\nThe principal says to do enrichment, too. Blended learning, she says. But I can't expect my social studies kids to be cool with a whole bunch of extra work that I'm not qualified to give to the Spanish kids. And I can't give enrichment that doesn't directly relate to the Edgenuity lesson each kid is currently doing. I can't take away from the time they could be completing their Edgenuity if I can't offer a direct substitute for the lesson. And I can't do that.\n\nSo we expect these kids to sit from 9 to 3. And I mean sit. They are not to get up. They are not offered any activity ever (which goes really well for the 7th graders). They are not to use their tablets for anything else, ever. They are **absolutely not allowed to listen to music, ever**. They have no freedom to move at all. They must be accompanied to the bathroom in twos, so I can't just take the whole class. They are not allowed water bottles, and cannot get water on their own.\n\nUltimately, it's a huge academic setback. The kids with minor behavior issues end up getting worse, and the kids with serious behavior issues don't get any better.\n\nThen there's our admin. Remember that were three first year alternative certification teachers, a LTS, and a first year BMS. We are very isolated, even from our principal. She's on the other side of the building, through the district office. Our AP was about 45 months pregnant all of last semester, and spent most of her time on the other side with the principal. This left us alone. Very, very alone. We do not do searches. Kids can't bring backpacks, but we don't search and there's no metal detector. Oh, we're also the only school in the district without a resource officer.\n\nWe were having discipline issues (surprise). Principal told us it was because we weren't doing enough, weren't doing our jobs, and she wouldn't do disciplinary stuff until we did. Ha.\n\nWe would call for help, and it would take 10 minutes, minimum, for someone to come help us. If the kids attacked a teacher and took over the class, nobody would know for at least 40 minutes, and up to 2 hours. Even then, what's our very pregnant AP going to do?\n\nWe've never had a fire drill. My room has only 1 door and no windows.\n\nOur SPED teacher is often off campus at the vocational school (which is attended by only the most hopeless students). This leaves IEP kids with IEPs that aren't being followed.\n\nWe've begged for PE. Nothing.\n\nWe've begged for a resource officer. Nothing.\n\nWe've begged for radios. Nothing.\n\nWe've begged for a planning period. Nothing.\n\nThis program is a disgrace. It's a holding tank for the kids the district doesn't want on their expulsion record but doesn't want in real classes. They're waiting for these kids to drop out or get locked up. It's cruel and horrible, and I'm putting in for a transfer.\n\nBut I love the kids, and I love my co-workers, and I know I'm going to love a real classroom.\n\nSo that's it. It's awful, but not because of the kids, and not because of me.",
    "title": "Update to \"I think I'm in over my head\".",
    "subreddit": "Teachers",
    "timestamp": 1487532023,
    "score": 13,
    "keyword": "mixed race principal"
  },
  {
    "text": "Does anybody here have a sibling who contributes to the Black dating issues? I mean the typical issues like the idea that non Black women/men are better than Black people. My brother is this way. He's 32 years old and single and has really low self esteem so I feel bad for him in that way and race issues towards black men bother him a lot. But when I'm with him, he stares at non Black women *nonstop* like his entire body and head will turn so he can check out a woman walking by but a Black female walks by and it's almost like he tries to look away. He proudly tells his friends (none of them are Black) that he's \"pickier with Black girls\" and that she'd have to be a perfect 10 for him to notice... but he's not exactly the perfect 10 type of guy, and his standards for other races are so low. He will date very homely, overweight or just bland looking White, Latina and Asian women. Even then, he doesn't attract many women because he doesn't take care of himself much, physically & that adds to his low self esteem. He also stares at couples who are interracial with a Black man a lot. I tried to hook him up with my friend but I felt bad because she was the one who asked and she's black/brown skinned and I knew he'd not like that.  I'm a Black female, it just feels disrespectful in a way, like his mind is so twisted when it comes to race and I don't understand it other than deep insecurity. \n\n&nbsp;\n\nHe also says the \"I think she's mixed\" thing when he finds a Black girl he finds attractive, which makes me cringe. Our mother is dark skinned, our dad is multiracial and very light but loves dark skinned women like my mom. My brother is darker like my mom but myself and my other siblings are all lighter tones. He seems the most affected by his race in a negative way. We also grew up in a majority white city but this issue seems beyond that. Should I just continue to ignore this? A part of me just wants to pick his brain and ask him *why* he seems to hate Black women so much... I've been reading up more on Black female issues, especially colorism and they're annoying me, so to have a brother who so openly adds to them is driving me insane. But then I feel like I can't change him, he's allowed to have his thoughts... idk. Anybody experience similar? Any suggestions?",
    "title": "Does anybody here have a sibling who contributes to the Black dating issues?",
    "subreddit": "blackladies",
    "timestamp": 1501346838,
    "score": 44,
    "keyword": "mixed race principal"
  },
  {
    "text": "Shout out to Spider-Man Homecoming for diversity? I know a lot of ladies feel like diversity in Hollywood shouldn't be celebrating like it's a victory but should be expecting at this point. I get that I'm still happy as fuck that the new Spider-Man movie has so much melanin. The movie actually looks like the town I grew up in!😄 Thanks casting/director for not pretending Queens is still white as hell. \n\nIt's also refreshing to see that Laura Harrier's character (Liz Allen) had a mixed race family. I love our light skinned, mixed race sisters but it's so annoying (and offensive) that they are often given dark skinned parents. It reeks of colorism and it doesn't represent black families or mixed families at all! Unrealistic casting only appeals to white minds who are only comfortable with a light face.\n\nNow… if only we could get a Miles Morales movie... In the meantime, I'm looking forward to Black Panther!",
    "title": "Shout out to Spider-Man Homecoming for diversity?",
    "subreddit": "blackladies",
    "timestamp": 1499802006,
    "score": 29,
    "keyword": "mixed race principal"
  },
  {
    "text": "A Socialist Defense of Gender Roles Edit: wow.  I've never seen such quick downvotes.   Remember that this is supposed to be a discussion forum not an ideological purity contest.   Only downvote if you think this post has contributed nothing to the debate.   \n\nEdit 2: I give up.   Enjoy the decline.   \n\nUnusual and long post here.    The non-socialist majority may enjoy it for the stats and the un-pc quotes by figures like George Orwell, Nicola Tesla and Christopher Hitchens.  \n\nMRA's are right to suggest that men got a raw deal under traditionalism.    I'm not suggesting we go back to a situation where e.g. a man be forced to pay his wives' debts.   Or that people be forced into certain roles.   I'm suggesting that the majority of men and women would be happier in a traditionalist arrangement: the woman takes care of the kids and home and the man is respected and honored for his contributions in turn.   Nor would this prevent women from achieving status in the male sphere.   It would just be more unusual since women would be doing the more important work of raising children.\n\nA return to a traditional conservative lifestyle is impossible absent collapse.   Female liberation has [never](https://archive.org/details/b20442580) been internally reversed.   Unfortunately it is also incompatible with large inequalities due to female hypergamy.    The majority of men are left out in the cold, so have no impetus to work.  Therefore a combination of men's rights and socialism are required if civilization is to continue.   This will naturally lead to men and women embracing traditional gender roles.    The only other alternative is a return to patriarchy, however that is exceedingly unlikely for reasons JD Unwin explains in the above link.   \n\nI was recently watching a documentary about a financial depression in the late 19th century.   A (female) professor noted that \"many women were forced\" into the workplace.   It struck me as an odd turn of phrase, since feminists claim that women weren't \"allowed\" to work back then.   Turns out this is false.   Karen Straughan notes that there are records e.g. of female blacksmiths going back to the middle ages.   Women could work, they just didn't want to.   Why would they?   For 90 percent of the population working sucked.   It still does.  Also, it's hard to work when you're pregnant.   \n\nThe only way feminists can get away with characterizing the traditional female sphere as a prison is by lying about it.   In truth, women could own [property](https://www.cambridge.org/core/journals/continuity-and-change/article/favoured-or-oppressed-married-women-property-and-coverture-in-england-16601800/617F23DD2D64A036C58E0BF7D56F89BE), wife-beating was severely [punished](https://www.debunker.com/texts/ruleofthumb.html), and women were respected for their role in society.    Alexis de Tocqueville commented on the essential equality of the male and female spheres in Democracy in America (1840) :\n\n“Americans,” he said, did not think that men and women should perform the same tasks, “but they show an equal regard for both their perspective parts; and though their lot is different, they consider both of them as being of equal value.”\n\nWomen have ALWAYS been greatly respected by men for being mothers and nurturers.   What is a more important job than raising a child?   It was only a small number of envious man-haters that decided otherwise.   \n\nThe feminist movement appears to have arisen not do to \"oppression\" but boredom.   Rich women lived lives of luxury most men could only dream of, but they were envious of the social status of their doctor and lawyer male relatives.   They wanted the privileges of both the female and male spheres.  They wanted to \"have it all\".\n\nA number of intellectuals expressed concern, though not as many as you'd expect considering the enormity of what feminists were proposing.   The socialist Earnest Belford Bax claimed that women were already the [privileged sex](https://archive.org/details/fraudoffeminism00baxerich).    The socialist Mother Jones, who spent most of her time organizing male coal miners and fighting child labor, considered it absurd that women could be \"liberated\" by work.   And Nicola Tesla, one of the most brilliant men who ever lived, predicted that \"equality\" between men and women would quickly lead to female superiority and massive social dysfunction: \n\n\"This struggle of the human female toward sex equality will end in a new sex order, with the female as superior. The modern woman, who anticipates in merely superficial phenomena the advancement of her sex, is but a surface symptom of something deeper and more potent fermenting in the bosom of the race.\"\n\nThe Catholic GK Chesterton, who embraced socialist ideas about land reform, suggested that mixing the traditional male and female spheres would be a disaster for society.   \n\nThis [article](http://gkcdaily.blogspot.com/2015/03/chesterton-notorious-anti-feminist.html) provides a decent summary.   \n\n>Woman is wrong, he considers, to try to adapt herself to society by making a man of herself. The contrary should come about—Society should adapt itself to womanhood by becoming gentler. To Feminists, he acknowledges that women undergo a revolting tyranny in factories; but he wanted to destroy the factories, while they, he felt, were content with destroying womanhood.\n\n\"The virtues of the Family and Home, due to free choice and limitation, form the basic cell of the social organism. Banish the spirit of Home, and you suppress the very possibility of a sanely constituted society.\"\n\nChesterton advocated wealth redistribution to the poor so that women wouldn't have to work.   George Orwell, who despite popular belief was a socialist, recommended the same: \n\n\"Far more drastically than anyone has proposed hitherto, taxation will have to be graded so as to encourage child-bearing and to save women with young children from being obliged to work outside the home (CW 16, 223).\"\n\n\"This, of course, is a subject of great interest in India, and roughly what we want discussed is how far women benefit by escaping from home and whether in the long run it is desirable for them to undertake the same work as men” (CW 13, 474).\n\nFeminists set about to destroy the \"patriarchal\" family, but they had nothing to replace it with.   We are not living in hunter-gatherer societies; the idea that the \"whole tribe\" would raise children has amounted instead to children being stuck all day in daycares and classrooms.   Women aren't able to spend as much time with their children as they'd like: they're too busy working.   They have replaced loving husbands with asshole bosses.   In a tragic irony, the \"new American dream\" for women is to become a [housewife](https://www.forbes.com/sites/meghancasserly/2012/09/12/is-opting-out-the-new-american-dream-for-working-women/#3c1b00ad623a).     \n\nThe single mother experiment has been a disaster.    Feminists assumed that men were only needed for their wallets, whereas it turns out that that males are [crucial](http://www.reviewjournal.com/life/family/experts-say-father-s-involvement-pivotal-proper-child-rearing) at every stage of child rearing.   The statistics for children raised by single mothers are nothing short of horrific.  \n\nWhat about men?   Men no longer feel like they have a role to fulfill, so are increasingly dropping out of society.   Suicides are at all time high.   Drug and alcohol addiction is rampant.    \n\nBy privileging girls in school and women in work, young women are now out-earning young men.   This leads to women being unable to find what they consider suitable partners due to hypergamy.  \n\nWomen have become ever more hateful and spiteful toward men.   Part of this is due to feminist lies, part of this is due to being forced to compete with the opposite sex.   The sexes aren't supposed to compete with one another; that's not how we were designed.   We're supposed to be complementary.  Since male leaders don't want to compete with women, they gave them ever more privileges at the expense of men.    So much for patriarchy theory.  \n\nAnd now we find the reason why being a housewife is the new American dream: Research has found that stay-at-home mothers are [happier](http://www.dailymail.co.uk/news/article-3634473/The-job-makes-happiest-Housewife-Survey-finds-stay-home-mothers-satisfied-profession.html) than those who work (female unhappiness is actually at an all time high).   So the whole feminist experiment was a gigantic waste of time.   More than that, it was a potentially fatal social experiment.    \n\nWomen who don't have children are more likely to get [cancer](http://www.everydayhealth.com/womens-health-specialist/childless-women-and-cancer.aspx).   The same applies to women who wait until their thirties to have children (the current trend).    Fewer and fewer women are giving birth.   Since population levels are unsustainable, more and more immigration is required.   This, in turn, leads to increased mistrust in communities.    The ruling class is able to play off workers against one another with ease, preventing solidarity.  \n\nMale creative genius is ignored and suppressed instead of being nurtured.    And for what?   So women can become unhappier?  \n\nIn The Red Pill, Warren Farrell emphasizes flexibility of roles.   But women don't seem to want flexibility for men.   They become resentful of stay at home dads.   They recoil at men expressing emotions.   They refuse to \"date down.\"   They demand all of their traditional privileges.  \n\nThe association between communism and feminism arose mostly from Marx's benefactor Friedrich Engels.   However it is interesting that many of the early socialists rejected his views on the subject and had no problem with traditional gender roles.    They didn't think women should be *forced* to be housewives, but as mentioned, only rich women were privileged enough to conceive of work as liberation.   \n\nFeminists have re-engineered society but it has not helped either men or women.   In the Israeli Kibbutz, which embraces an anarchic form of social organization, people were not given any gender roles but naturally became the most traditionalist society in the world.   This leads me to believe that the vast majority of both men and women prefer behaving like men and women.   We have created a society that ignores the happiness of the 99% and caters to outliers among both sexes -- in particular lesbians.    These outliers should not be oppressed, but they shouldn't dictate how the rest of us behave either.  \n\nIf it is respect and independence women are after, men's rights combined with traditional gender roles would allow them to have both.   They would be respected as mothers, would still be allowed to enter the male sphere if they wished (though only on equal terms -- no feminist bullshit), and wouldn't have to suffer being wage slaves.   They would not be able to simply divorce the man and take the kids and his money, so marriages would remain intact.   Men would likewise be able to act as men again, without being demonized; they would be respected and honored for the work they do to maintain civilization, and would have all the rights that women currently have.   \n\nEgalitarian economics would ensure that the majority of men not be excluded from romance due to hypergamy.   \n\nBonus: Christopher Hitchens: Women shouldn't have to work.  \n\nhttps://www.youtube.com/watch?v=TQas34criFo",
    "title": "A Socialist Defense of Gender Roles",
    "subreddit": "MensRights",
    "timestamp": 1489258273,
    "score": 5,
    "keyword": "mixed race principal"
  },
  {
    "text": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n\"**Consciousness-raising: A Constant Change of Heart**\n\nFeminists are made, not born. One does not become an advocate of feminist politics simply by having the privilege of having been born female. Like all political positions one becomes a believer in feminist politics through choice and action. When women first organized in groups to talk together about the issue of sexism and male domination, they were clear that females were as socialized to believe sexist thinking and values as males, the difference being simply that males benefited from sexism more than females and were as a consequence less likely to want to surrender patriarchal privilege. Before women could change patriarchy we had to change ourselves; we had to raise our consciousness.\n\nRevolutionary feminist consciousness-raising emphasized the importance of learning about patriarchy as a system of domination, how it became institutionalized and how it is perpetuated and maintained. Understanding the way male domination and sexism was expressed in everyday life created awareness in women of the ways we were victimized, exploited, and, in worse case scenarios, oppressed. Early on in contemporary feminist movement, consciousness-raising groups often became settings where women simply unleashed pent-up hostility and rage about being victimized, with little or no focus on strategies of intervention and transformation. On a basic level many hurt and exploited women used the consciousness-raising group therapeutically. It was the site where they uncovered and openly revealed the depths of their intimate wounds. This confessional aspect served as a healing ritual. Through consciousness-raising women gained the strength to challenge patriarchal forces at work and at home.\n\nImportantly though, the foundation of this work began with women examining sexist thinking and creating strategies where we would change our attitudes and belief via a conversion to feminist thinking and a commitment to feminist politics. Fundamentally, the consciousness-raising (CR) group was a site for conversion. To build a mass-based feminist movement women needed to organize. The consciousness-raising session, which usually took place in someone’s home (rather than public space that had to be rented or donated), was the meeting place. It was the place where seasoned feminist thinkers and activists could recruit new converts. Importantly, communication and dialogue was a central agenda at the consciousness-raising sessions. In many groups a policy was in place which honored everyone’s voice. Women took turns speaking to make sure everyone would be heard. This attempt to create a non-hierarchal model for discussion positively gave every woman a chance to speak but often did not create a context for engaged dialogue. However, in most instances discussion and debate occurred, usually after everyone had spoken at least once.\n\nArgumentative discussion was common in CR groups as it was the way we sought to clarify our collective understanding of the nature of male domination. Only through discussion and disagreement could we begin to find a realistic standpoint on gender exploitation and oppression.\n\nAs feminist thinking, which emerged first in the context of small groups where individuals often knew each other (they may have worked together and/ or were friends), began to be theorized in printed matter so as to reach a wider audience, groups dismantled. The creation of women’s studies as an academic discipline provided another setting where women could be informed about feminist thinking and feminist theory. Many of the women who spearheaded the introduction of women’s studies classes into colleges and universities had been radical activists in civil rights struggles, gay rights, and early feminist movement. Many of them did not have doctorates, which meant that they entered academic institutions receiving lower pay and working longer hours than their colleagues in other disciplines. By the time younger graduate students joined the effort to legitimize feminist scholarship in the academy we knew that it was important to gain higher degrees. Most of us saw our commitment to women’s studies as political action; we were prepared to sacrifice in order to create an academic base for feminist movement.\n\nBy the late ‘70s women’s studies was on its way to becoming an accepted academic discipline. This triumph overshadowed the fact that many of the women who had paved the way for the institutionalization of women’s studies were fired because they had master’s degrees and not doctorates. While some of us returned to graduate school to get PhDs, some of the best and brightest among us did not because they were utterly disillusioned with the university and burnt out from overwork as well as disappointed and enraged that the radical politics undergirding women’s studies was being replaced by liberal reformism. Before too long the women’s studies classroom had replaced the free-for-all consciousness-raising group.\n\nWhereas women from various backgrounds, those who worked solely as housewives or in service jobs, and big-time professional women, could be found in diverse consciousness-raising groups, the academy was and remains a site of class privilege. Privileged white middle-class women who were a numeric majority though not necessarily the radical leaders of contemporary feminist movement often gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential.\n\nSuddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing. These careerbased changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate.\n\nWithout the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make CONSCIOUSNESS-RAISING 11ten gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential. Suddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing.\n\nThese career-based changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate. Without the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make one a “feminist.” Without confronting internalized sexism women who picked up the feminist banner often betrayed the cause in their interactions with other women.\n\nBy the early ‘80s the evocation of a politicized sisterhood, so crucial at the onset of the feminist movement, lost meaning as the terrain of radical feminist politics was overshadowed by a lifestyle based feminism which suggested any woman could be a feminist no matter what her political beliefs. Needless to say such thinking has undermined feminist theory and practice, feminist politics. When feminist movement renews itself, reinforcing again and again the strategies that will enable a mass movement to end sexism and sexist exploitation and oppression for everyone, consciousness-raising will once again attain its original importance. Effectively imitating the model of AA meetings, feminist consciousness-raising groups will take place in communities, offering the message of feminist thinking to everyone irrespective of class, race, or gender. While specific groups based on shared identities might emerge, at the end of every month individuals would be in mixed groups.\n\nFeminist consciousness-raising for males is as essential to revolutionary movement as female groups. Had there been an emphasis on groups for males that taught boys and men about what sexism is and how it can be transformed, it would have been impossible for mass media to portray the movement as anti-male. It would also have preempted the formation of an anti-feminist men’s movement. Often men’s groups were formed in the wake of contemporary feminism that in no way addressed the issues of sexism and male domination. Like the lifestyle-based feminism aimed at women these groups often became therapeutic settings for men to confront their wounds without a critique of patriarchy or a platform of resistance to male domination. Future feminist movement will not make this mistake. Males of all ages need settings where their resistance to sexism is affirmed and valued. Without males as allies in struggle feminist movement will not progress. As it is we have to do so much work to correct the assumption deeply embedded in the cultural psyche that feminism is anti-male. Feminism is anti-sexism. A male who has divested of male privilege, who has embraced feminist politics, is a worthy comrade in struggle, in no way a threat to feminism, whereas a female who remains wedded to sexist thinking and behavior infiltrating feminist movement is a dangerous threat. Significantly, the most powerful intervention made by consciousness-raising groups was the demand that all females confront their internalized sexism, their allegiance to patriarchal thinking and action, and their commitment to feminist conversion. That intervention is still needed. It remains the necessary step for anyone choosing feminist politics. The enemy within must be transformed before we can confront the enemy outside. The threat, the enemy, is sexist thought and behavior. **As long as females take up the banner of feminist politics without addressing and transforming their own sexism, ultimately the movement will be undermined**.\"",
    "title": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1507273110,
    "score": 8,
    "keyword": "mixed race principal"
  }
]