[
  {
    "text": "Need feedback/support - planning on giving my two weeks' notice in 3 weeks; no job lined up yet, enough savings to last into next year I've had enough of my current job, and I think I have a plan to make my exodus from it work.\n\nAfter reviewing my expenses and the money I have in my savings account now, I've concluded that if I leave in mid-June, I will have more than enough to cover my basic expenses until next February. The area around me is rife with cafes and bars, and the minimum wage in my city (Chicago) is high, so I think if I get a part-time job I can stretch it out even further if needed. If necessary, I can cut $300 worth of expenses for parking, gas, and insurance for my car by selling it. I barely drive anymore, and now that I've been vaccinated, I won't be avoiding public transportation anymore. If I need to get somewhere that isn't busable, I can hire a Lyft. I'll have extra money anyway.\n\nMy plan is to wait until June 1. I get paid monthly. I'm due to get a quarterly bonus then, so my second-to-last paycheck will be a big one. On top of that, I'll get paid for the two weeks in June that I work, plus my remaining sick days. All this will probably be paid out on June 30.\n\nI will be immune from the coronavirus starting this Friday. My plan is to get a part-time job or contract work until I get a new job to stretch out my savings. When I'm not doing that, I'm going to be treating my job search like a full-time job. I'm going to get up at 8 AM every weekday, be in front of my computer by 9, and work on applications, networking, cold-calling companies - whatever I have to do - until roughly 5. I'll reserve weekends for social activities and self-care, just like I do now. Some days I'll work more, some days I'll work less. Some weeks, I'll work on weekends. Working from home has taught me my limits and how to manage my time better than working in an office ever did.\n\nI recently completed an online portfolio that I made with Squarespace. I've shown it to a lot of people, including the career coach from my college with whom I've been working since September 2019, and the feedback has been extremely positive. I now have 6 years' worth of experience in my field, so getting entry-level jobs is no longer an issue (thank fuck). I have a lot of hard and soft skills that make me a competitive candidate, I've gotten way better at writing cover letters, and my resume is on point (again, according to the feedback I've gotten, though I recognize that what makes a \"good\" resume can vary depending on who you ask).  I've never been a stronger applicant in my field.\n\nI've contacted the agency responsible for unemployment insurance in my state. Willingly leaving employment makes you ineligible for benefits, unless you can prove that they A) did something illegal, B) caused me physical harm or threatened it, or C) discriminated against me on the basis of race, gender, religion, or age (they actually have been mistreating me because of my age, but I'm in my 30s and it sounds like they only take it seriously if the issue is age-based harassment against someone over 40). They said that if I get denied unemployment, I can appeal the decision. I have several GB worth of screenshots of Slack messages, emails, and text messages on my computer showing my coworkers harassing me, being verbally abusive, making baseless accusations against the quality of my work and my character (I have separate screenshots proving their claims are untrue, like a shot of the edit history of a doc I worked on showing I objectively didn't do something I was accused of doing) - their unjustifiable behavior in these screenshots is blatant enough that anyone unfamiliar with me or my company would be able to easily see how dysfunctional and abusive my coworkers are. My plan is to show this to the appeals officer and connect them with my therapist to show that this job has been having a significantly detrimental effect on my mental health. Maybe it won't work, but it's the best shot I've got to get unemployment benefits if I don't get fired between now and June. If it doesn't work, I've still got my savings, and money from part-time work if I get one before I get a full-time job.\n\nFrom everything I've been seeing, the job market is in flux right now. Summer is right around the corner, people are getting vaccinated, loads of people are leaving their jobs, and companies that have had hiring freezes since the beginning of the pandemic are beginning to hire again. I think I can do this.\n\nI'm not stupid or crazy. I know this is a risky move. But the level of delusion, dysfunction, and abuse I've had to endure at this company, even before the pandemic, has been destroying my mental health even worse than the pandemic has. It's also affecting my work ethic and my productivity. It's getting so bad I literally cannot focus enough to do basic parts of the job, so I literally can't do the job either. \n\nI've spoken to my boss numerous times about the problems I have at this company, and he always responds by ignoring what I say and instead telling me how to feel. We have no HR department. It's a small company (I don't think there have ever been more than 8 people in the 3+ years I've been here, not counting interns and seasonal workers), but 3 core staff members have left in that time, including the former CEO and business partner of my boss - he quit within a week of being the CEO. I absolutely cannot stay here anymore. The only ones left are the old friends and family members he hires (this company is unrepentantly nepotistic in its hiring practices and those hires are treated with blatant favoritism - he literally conscripted his college student son to edit video after our camera guy quit and his replacement became a father in March).\n\nI feel like I've covered everything, but I want to leave no stone unturned. I'm taking a big risk, so I need to know that I absolutely am doing everything in my power to make this work. I've been applying to companies with greater frequency now that I'm basically done with my portfolio, but I need more time and mental clarity to maximize my job search. \n\nDoes anyone have any advice as to what else I should do/be doing? Please no comments telling me I'm an idiot. I know this is a risk, but after what I've been through in the past year, I'm convinced it's a necessary one. If you have no suggestions, I could use some emotional support. Thanks.",
    "title": "Need feedback/support - planning on giving my two weeks' notice in 3 weeks; no job lined up yet, enough savings to last into next year",
    "subreddit": "jobs",
    "timestamp": 1620766689,
    "score": 4,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Got a job offer... then was told I would need a drug test. I’ve been looking for several months for a new job and found one that really stood out to me. It was one of those moments where you realize, “hm, what a great job and benefits. I’ll go ahead and apply, even though I’m sure I would never get this”. Lol so I did. Again, knowing that I was never going to really be a contender for this position as I was sure there had to be someone in the 100+ applicants that would be way more qualified than I was (on indeed it tells you a range of how many candidates have applied for the job). A couple weeks went by and I completely forgot I had even applied for the position when I received an email from the company CEO asking if I was still interested in the position. You can imagine my shock when I read the message as I was so sure I would never hear from them. I immediately responded very excitedly, but professionally, and let her know that I was still very interested. She responded right away and we settled on a day the following week. Due to the Coronavirus, the initial interview would be via Zoom. I was so excited that I was given the interview and immediately started doing my part, researching the company, CEO, other employees, etc. After several hours of research I was impressed at not only the company, but myself for even landing an interview with this company. I was even more excited than before because I could tell this was going to be such an incredible opportunity, however, in the back of my mind I continued to tell myself not to get overly excited so that the disappointment wouldn’t be as tough when I’d find out that the position when to somebody else (I know, I know, I need to be more confident in my abilities, but being a recent graduate, I figured there would be other candidates with much more experience). I felt very confident on the morning of the interview. I was knowledgeable about the company, it’s core values, and even the professional history of the CEO and President of the company. This was probably the most ready I had ever been for an interview. I got ready, my heart racing the entire time, my anxiety through the roof... literally couldn’t shake off the nerves. I remember thinking, how am I possibly going to get words out if I’m feeling so shaky and my anxiety was literally making me starting to feel “panicky”. I calmed my nerves and reminded myself that it wasn’t the end of the world if I bombed the interview, after all, In the back of my mind I knew I wouldn’t get the offer. Instead, I started looking at it as an opportunity to practice my interview skills in a much more professional setting. So that is what I did. I entered the zoom call through the website and was having audio issues immediately. I quickly downloaded the app and logged in, apologizing right away for the technical difficulties. I was stunned to learn that it would be a panel interview, my expectation was that I would just be talking to the CEO who scheduled the interview with me, I was naive. The CEO, HR Manager, and the person who would be my direct supervisor, were all present. It began with the typical questions, “Tell ya about yourself” and “Why are you leaving your current job”, pretty standard questions. I couldn’t tell you what came over me, but I was absolutely killing this interview (I was doing extremely well, for those that don’t know the meaning of that expression). What was meant to only be a 15 minute interview, lasted over 45 minutes. There were many laughs, and back and forth exchanges between all of us, it felt very natural and I can tell we were all very comfortable with each other. We were nearing the end of the interview when they asked about questions, and of course I had several for them that I had thought about during my research. Questions regarding the current challenges that the company is facing and how my role, if given the position, would help alleviate some of those challenges. They were all very pleased that I researched the company enough to have questions for them, I can tell they wanted to keep engaging to see how far I had taken my research. Ultimately, it went great and was told they would be in touch. No more than 5 minutes had passed when I received a call from them. It was the woman who would be my direct supervisor, saying how impressed they were with my interview and that they would like for me to come in for a second interview, in person, to meet the company owner / President the following day. I was S H O C K E D. \nI couldn’t believe the outcome. I went into the interview a nervous wreck, even told myself that this would just be practice for a future job that I was more likely to get, and came out of it, pleasantly surprised with a second interview. Of course I prepared again, doing more research, diving a little deeper. \nThe following day, I show up to the interview, early, and was brought into a conference room where I was to meet with the president. The woman who brought me into the conference room was such a pleasure and so kind. She was chatting to me about the company and the position. I felt comfort and security from speaking to her, almost as if she was a friend. She asked if I had any questions, and because she had been so kind and friendly, I felt comfortable enough to ask her how good or bad my chances were at getting the position and how steep the competition was. She giggles and said “knock this interview out of the park like the first one, and the job will be yours”. When she said that, I immediately felt a sigh of relief because I knew I was even more prepared for this interview, than the first. When the president finally came in, we had a great interview. It was more like a conversation really than an interview which only made me feel like the position was already mine and he was merely seeing if my personality was going to be a right fit for their team / company. We spoke for about an hour which was crazy to me because being a President of such a successful company, I knew he had bigger and better things to do. If he spoke to me for so long, it must be a good thing... right? Lol. After about an hour he asked me to wait for the CEO and my would-be supervisor to come in. They did, and we spoke a little more. As we spoke, several employees kept coming by, and I was getting introduced to them, it turned into more of a hang out than interview. After some time they finally let me know that they are going to be offering me the position. I was so incredibly happy and excited to start this new journey. This was very obviously my first real big opportunity and the stepping stone towards my career. I was over the moon. We spoke about salary and benefits, I didn’t want to be greedy so I just said I was OK with the salary that they advertised on the job posting (It was more than I was making at my current job AND I knew it was just a starting off point so I was fine with it). The following day I received my offer letter in my email, they increased the pay rate by 5 dollars from what they had originally posted. Another HUGE shocker. It was so crazy how it was all working out. \n\n\nAnd finally... they let me know there would be a drug test. Which I knew I would automatically fail for marijuana as I take cannabis gummies at times to help me sleep at night when I’m experiencing really bad insomnia. I was freaking out about losing everything that has been so graciously offered to me. However, I live in California. A state where marijuana is legal for both medical and recreational use. Not to mention, the West Coast, particularly California, tends to be more open minded on the topic. However, this was a highly reputable company, not top tier, but high mid tier, one of the leading entities in their industry who is growing at an alarming rate, hence their need to hire. I wrestled with what to do... going back and forth about how I can handle this situation in the most professional manner. How does one let their future employer know they will fail a drug test -_- \nAfter consulting with a few of my professional friends, I decided it would be best to come clean about it. \nFirst off, I truly don’t smoke marijuana and the only traces of it would be from the gummies. Yes, the gummies will trigger a positive result as they contain THC, not to be confused with CBD gummies. Second, I only started taking them recently due to having to work two jobs. I was working 7 days a week, often working doubles and was having a hard time getting sleep due to insomnia that had been worsened from working so much and the stress of having to work two jobs. My respects for any and all who work multiple jobs, it is tough. Anyways, on top of all that my mom and younger sister were forced to move in with me due to COVID and my Mom had to leave work due to being high risk of contracting the virus. All of these played a factor in my deciding to take the gummies to assist me with sleep. I tried everything from melatonin, to teas, to even home remedies and none seemed to work other than the gummies. Obviously when I took them I didn’t foresee I would need to take a drug test... that was my biggest mistake. I contacted the CEO and my would-be direct supervisor and was as honest and candid as possible. I offered an explanation such as the one above, I was honest, sincere, and up front... something that was discussed as crucial in our interview, open communication. I explained that the job offer was so generous that it would eliminate the need for a sleep aid, as I would only need to work one job, thus allowing my body and system to go back to a routine. Also, it would allow me the luxury of having the time off in the evenings or on weekends, which would give me the opportunity to focus on my health and fitness again. I informed them that I am more than happy to allow them to run multiple drug tests on me, even randomly, to assure them down the line that I, in fact, am not a drug user. \nI even used the “I know this may be a risk, but in business terms, sometimes taking a risk will result in a great return” line... I reminded them of what they told me, that they had been looking for over a month until they found me... “a perfect fit” and pleaded with them to not disqualify me over something that happened before I even know that their company even existed. \nI demonstrated the level of passion I have for the job, and proved just how bad I wanted it. \n\nTheir response:\n\n“Thank you so much for your honesty. We appreciate you being up front with us. \n\nPlease allow us a week or two to evaluate this situation. \n\nWe will speak soon”\n\nI replied, reiterating what I had said about how passionate I am about the position, and how I was willing to submit to multiple drug testing down the line. I also mentioned that ultimately I understand that the decision would come down to the fearless leaders of the company and that I had nothing but the utmost admiration and respect for all of them, and that I would eagerly wait for their response. \n\nAnd this is where we are now... playing the waiting game, eagerly waiting their response. \n\nMy questions for any company leaders, CEO, etc:\n\n1. What are my chances of me actually getting to keep the position? (Don’t forget the company and myself are located in Southern California)\n\n2. Would me being honest and up front about things mean anything at all to leaders of a company? \n\n3. Would YOU personally hire me after all of this?\n\n4. If and when I get a response, if it is a “I’m very sorry but we have to rescind your offer”, would it be wise to try and make my case one last time, or should I just thank them for their time and consideration and apologize for the way things worked out? In the final attempt to keep the job, I plan to bring in information regarding how other states have legislation protecting employees from this very situation, over losing jobs for something like marijuana. Not in a threatening way at all, but more in a “see, other states are doing this. We are headed in the direction to federally legalize it in the next few years, so this wouldn’t even be a problem in the very near future” type of approach. Additionally, I want to bring in examples from the Prohibition era and how it was difficult at first to make the transition to socially accept alcohol. What do I have to lose at that point lol \n\nAnyways, any POSITIVE ideas or advice would be greatly appreciated! Any negativity will be ignored, so don’t even bother. Thanks in advance!",
    "title": "Got a job offer... then was told I would need a drug test.",
    "subreddit": "jobs",
    "timestamp": 1614541204,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Need advice on what to do. Need a new job but kind of stuck (long post) (TL;DR: Level 1 IT job offered under different name to hide IT responsibilities from parent company. Started off nice but progressively got more and more worse/challenging to the point I would need a raise to compensate for the extra work that wasnt part of the original responsibilities. Eventually lost about half of my IT responsibilities after said parent company wanted to take over our branch. Now being given tons of menial work from multiple departments, trying to escape into marketing but continuously getting work from everywhere. Taken intermittent FMLA to care for my mom post heart surgery but still doing 40 hours of work per week because I cannot afford to take time off. Job progressively getting worse and looking for other jobs but am beginning to mentally break down and being less efficient by the day) \n\n\n\nI applied for what was advertised Level 1 entry level job. When I got the offer, the title was for \"special projects coordinator\" I ask HR why the names are different and if this is the same role. They said yes. Im working and everything seems right. I really like the job and I'm getting $15 an hour which isn't the best but better than what I had. Later I notice that I'm doing more of a mix between level 1 and level 2 work with a hint of level 3. it's definitely a sys admin role, as I had a lot of power to do things and control over everyone's accounts, even the executives and CEO, had important server passwords access to archived drives and managed said servers. But It's fine because the job is decent and I liked the people. I'm a quick learner so I adapt. I also learned that we are a branch company, and I was in a Sub IT Position that the parent company doesn't know about, I am told not to contact them and not to make it known that we do IT work or they will question our boss and try to incorporate us into their team which was more droning/scriptrd help desk and quota like..whereas this role is more freeform \"approach in a way you think is best\" kind of way.  this is why my job title wasnt specifically \"Level 1 IT\" but for the time being the job was interesting. Time passes quickly, I worked with internal staff only (so no crazy random people) and it was really laid back at times, so much that our manager would just chat with us for hours when the day was slow. They day would fly by and we'd be paid for it. Sometimes he'd let us go home early and give us PTO for the rest of the day if it was the day before a holiday or a super slow Friday. If he's in a good mood.\n\n\nA year goes by and I start getting more and more unrelated responsibilities like mobile device management and doing tons of audits and general grunt work and some hardware stuff here and there. Luckily, I know the marketing team well and the manager there wants me on her team to do graphic design, which is what I graduated in, so my manager and the marketing manager worked out a plan to let me work in marketing for 16 hours a week. I like doing the marketing work but I don't like the environment so I'm stuck between doing something I like and not liking the work environment, vs doing something I don't like but liking the work environment. In the IT dept. I have my own desk, privacy, and my manager isn't nosy or breathing down my neck at all times.\n\nFinally, the parent company decides to provide coverage for our branch. Meaning all my major IT responsibilities are being taken away. Leaving me with just hardware and desktop support mobile device management, audits and whatever else they can strum up, which was still important stuff. I didn't care to do that stuff, coupled with the marketing work. They give me so much work to \"keep me busy\" since I don't handle many tickets anymore that I no longer know what I'm doing. Just felt like I was just being given a list people forgot or don't want to do, this was around June 2020 mid covid lockdown. I ask my boss for a raise since I'm getting overloaded with work but not expecting it too soon considering a ton of people just got furloughed or terminated. Boss says of course, that I've shown time and time again that I'm more than capable and has heard many compliments about me. But cannot process a raise at this time since covid layoffs. But encouraged me to ask once things start improving. I ask again at the end of 2020 after he got a promotion and raise and we started hiring massively and he completely changed his attitude saying it won't be approved. I express my concerns that I'm handling a lot of responsibilities more than I bargained for when I initially applied, again expecting a super weenie hut junior experience that is level 1 IT. He said the job was never advertised as level 1 IT even though I still have the emails from HR and the level 2 coworker that interviewed me with a subject line \"Level 1 IT Position\" I reiterate that I feel overwhelmed and that the pay doesn't match my workload and he give me the \"knowledge and learning new things is just as, if not more important than the wage\" nonsense then tells me he will try to put a request for a raise through, but thinks it will be denied. Despite ugently hiring and him getting a raise and promotion. Instead, he offers if I would like to do more overtime, and offers 45 hrs a week. I take it and leave, frustrated. More time passes and my mother has heart failure and needed serious open heart surgery and I'm the only child of 8 who can care for her. Early 2021, and I'm left with a choice as I have no PTO and only get 15 days of PTO a year, not including major holidays.. the choices are to 1. Try to take care of my mom while working (I was not able to work remotely. My boss wants his IT team in the office even though most of our days are spent doing things that can be done at home.) Or 2. Take an LOA or FMLA to care for my mom. \n\n\nI had to go with option 1 because I couldnt afford to take unpaid time off. I even considered talking to HR to \"Lay me off\" temporarily so that I could get unemployment so that I didn't have to work and just focus onyself while taking care of my mom, since I just feel fucked up inside seeing my mom (per her request because she was terrified of the surgery) unconscious in an ICU bed having her heart and lungs manually being pumped.. But ultimately, to be more practical. I did a combination of 1&2. I asked for an intermittent FMLA with the condition that I work from home to protect my mom from covid while she recovers. Thankfully, the doctors notated that I will need to be home to tend to her and keep an eye on her and take her to her appointments, so it helped me stay home. I expressed that I need all of what I can get and cannot do part time hours because my expenses won't be met. Considering the large about of health insurance now being taken out of my $15/hr full time checks and the cost of driving an hour every day to see my mom at the hospital and paying for daily parking passes on top of that. And finally taking her home with me and adding to the extra electricity bill expenses and food etc. So HR reached out to multiple departments asking if they had anything I could do for them while I am on FMLA so that I could maintain 40hrs a week while I help my mom. \n\n\nWhich takes us to the present. My mom has been living with me since March 28th and will be until May 13th when my FMLA ends. It's been a month and I still have 2 weeks to go before I'm back in office. My mom is much better than before, but as far as work. I'm now doing video editing, marketing, template editing for a different department, MDM, some of my usual IT stuff like hardware repair and support and shipping and even some software support, helping HR with account set ups and such. And EVEN MORE AUDITS. All while still being paid $15. What's worse, is right before I made it known that I could do LOA. My manager said that I could no longer work over time and to keep below 40 hrs. Undermining everything he said back when I initially asked him for a raise.\n\n\nI'm officially done, I use to love this place but now I'm broken. I love that they (HR) is actually helping but my manager is always on my back. For instance, he made a Google sheet for me to put how long I worked and what I worked on, for the days I'm on FMLA. He made the sheet a little late, on April 7th. Then the next day he added previous dates, back to Apr 4th and sent an email saying I never included info on those days and to get it done immediately. Then said I never included info for the last few days either, CC'ing HR and others I emailed, barking back at him with screenshots showing that he literally added the dates 2 hours ago according to Google sheet history without my knowledge and that I did enter data, with screenshots and time stamps. My coworker is constantly piling more and more work on me when I specifically asked for simple, straight forwardthings that don't require too much back and forth since my schedule is intermittent and I'm overwhelmed with caring for my mom. Reiterating that I'm only working because I can't afford to take a break. I've come close to just rage quitting and taking the rest of the FMLA off to just ... Be. \n\nI've already started applying for new jobs with much better pay. But I'm so mentally exhausted that I don't fill them out fast enough or in high enough quantities to increase my chances but I definitely want to leave before I come back. This company is so backwards and around every corner theres something \"new\" but its actually worse because someone made a bad decision and the \"new project\" is just more and more damage control. And more audits of things that should have been done long before I was hired. Like really. I'm auditing andanaging software permissions for a program/website I never developed. Tasked with the job to test EACH permission (100+) see what they do, then document it. You would think the DEVELOPER THAT MADE THE PERMISSIONS IN THE FIRST PLACE would KNOW what each permission does, but they don't. I wanted to wait til I'm back in office to take this responsibility because it requires that I speak to department stakeholders and formulate an approach on how to implement changes, which are things I really don't have the capacity to do now as I have literal 10s of other things to do. One of the worse things was seeing and helping HR with an account recieving a $4 raise. I had to update this person's account to reflect this. Reading the emails for why they got the raise, sing because they worked hard and their manager felt they deserved it. Literally teared up as I make the changes that I can't get the measly $2 raid I had requested.\n\n\nI really want to just quit.. or something, I don't know. I'm done with this. $15 an hour is shit. I just hope something comes along in the next two weeks because my fear is that when I come back. All of these extra tasks I got for FMLA will become permanent responsibilities. I will probably stay there part time to work for marketing only, since they like me so much and I really want the inhouse experience but I don't want to be a victim of being stuck in a job.\n\n\nI just want my mom to get better, reachieve my independence and privacy so I can focus and put all this shit behind me and move on to better things but right now I'm just broke and stuck.",
    "title": "Need advice on what to do. Need a new job but kind of stuck (long post)",
    "subreddit": "jobs",
    "timestamp": 1619684155,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us? It kinda hurts a bit. I'm already an awkward kinda person, and I do know stats say black women and Asian men are the least desirable in the dating world. But it's like, a punch in the face when there's black men out there who refuses to even consider someone looking like you, while in the same breath want to be treated fairly, not judged and have their skin color not be an issue to the world.\n\nAnd then there's the colorism in it. \"I only go for light skinned girls/mixed.\" Everyone has preferences, but this is on par with racists who particularly don't date a specific race because [bigoted racist reason] if not worse because like.... These dudes *know* the struggle of being discriminated on and are actively doing it.\n\nI guess it's something that's been bothering me and I dunno how much it gets discussed. It just makes me feel ugly because I haven't done anything yet, black men already cross me and many women off just based off stereotypes. So much shit gets thrown in about us just by appearance alone without even saying a hi.\n\nNot quite the same, but it made me think of when I was inpatient at a hospital. Young gay black man assumed all this stuff about me just due to my appearance (dunno how because we all look beat up coming into the hospital at all times in the day) and when he actually got to know me, whole new opinion. Thought I was loud, \"ghetto\" etc while uh, I wasn't? But I know he wouldn't like it if people assumed he was in a gang, drug dealer, and likes to watch grab dicks for fun. It's a real slap in the face. But, it's nothing new for me and many other black women out there.",
    "title": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625608005,
    "score": 135,
    "keyword": "mixed race ceo"
  },
  {
    "text": "People are not teaching experiences! No one owes respect and patience to someone who gives them none. I'm so so sick of being harassed and insulted by prejudiced people, only for mutual friends to turn around and tell me I should let them so that they learn. I'm pretty sure we all are.\n\n \\- At a friend's birthday party this guy silently stared at my chest all night, and touched me inappropriately. The response from my friend when I told him? \"Oh, he's not used to women. Sorry about that, but it would be really good for him if you guys hung out so he could practice talking to women!\"\n\n \\- When my boyfriend had a couple people over for drinks, a new acquaintance of his decided that that was the perfect time to tell our trans friend that when he first met her, he didn't see her as a person, and to tell her all of the disgusting things he still thinks when he sees her. Afterwards, I overheard someone \"comforting\" her by telling her he's just not used to trans people and she should cut him some slack.\n\n \\- Another friend of mine goes to Oxford University (for non-UK: very very prestigious, very white, elitist and rich) she's mixed race and working class. When her intelligence and legitimacy is questioned, when she is made to feel less-than, she has been told things like \"He hasn't met many people like you before! You should give him a chance to see what you're really like!\"\n\nAll of the people telling us this have been men who were our friends and \"allies\". If you feel like these are the kinds of things that you would say to excuse the offensive behaviour of a friend, I understand the impulse to defend someone you care about but please stop! Women, especially minorities, are not anyone's teacher, training wheels or learning experience! We do not owe anyone our patience and understanding when they treat us with contempt. If you are friends with someone that degrades or harasses, YOU should let them know how to change, not the people they're degrading! \n\nNo one is perfect, and we all have work that we need to do, but please take the time to consider if this is something you might need to think about.",
    "title": "People are not teaching experiences! No one owes respect and patience to someone who gives them none.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616525876,
    "score": 44,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Pissed off and looking for examples of women/BIPOC owned companies I’m female, millennial, and mixed race, which are all relevant to my story. I recently attended a three-hour marketing seminar as part of a larger business conference event. From the very beginning of the conference, I was shocked to be surrounded by 90% white men, very few women, and even fewer people of color. \n\nThroughout the three-hour seminar, the speaker (white male, in his 40s) showed numerous examples of what he deemed to be successful marketing, including a series of three video commercials back-to-back, each featuring a white, male CEO (or a pair of white, male CEOs), sharing the story of their company. They met in college! They were outsiders to the industry! They took the world of [razors, socks, deodorant] by storm! Immediately after showing these three videos, the presenter said, “When customers can see themselves in your product, that’s when they'll feel a connection with you.” \n\nEvery example in his presentation featured white men as CEOs or in positions of leadership. With each example, it felt increasingly ridiculous. Three hours is a loooong time. The only mention of women was their potential as a customer base, an audience to be marketed to. He spent a cringey amount of time discussing “Millennial Moms,” which he kept referring to as “The Birth of Karen.” Every comment about women and/or millennials was derogatory. No notice that there were actual millennial moms in his audience (leaders in their businesses!) among all the white men present. \n\nAfter the seminar, I went to the front of the room to speak with the presenter. I pointed out the irony of what he said about customers making connections if they can see themselves in a company’s product, when I didn’t see myself represented in any part of his presentation. His response was, “I didn’t choose these companies as examples because they were founded by white men, I chose them because they are great examples of marketing.” I told him to try looking harder. \n\nRedditors, would you please comment with links of amazing women and BIPOC owned companies so I can fill this guy’s inbox with examples for his future presentations? Please and thank you.",
    "title": "Pissed off and looking for examples of women/BIPOC owned companies",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626464187,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I am not doing well and am not sure what to do So, I developed PTSD from watching all my very close patients die last year.  Now anytime we have covid in the building I start getting flashbacks. I actually had a break down and did pull my hair out in frustration. \n\nI left my educator job and am back on the floor the idea was less stress or more manageable stress. \n\nI was tired of never knowing when I was going home, tired of always being asked to stay over, tired of the never ending meetings. So changing positions seemed like a great idea, right? \n\nHahahahahaha\n\nI'm often working as sup and passing meds, sometimes I have two wings. I'm angry and crying all the time. It's difficult for me to change jobs- as you can't qualify for FMLA if you haven't been there for at least a year and I need to get spinal injections plus my brother probably has cancer. Since he can no longer walk or work due to this pain his doctor ignored for over a year and now has fused lymph nodes... He's probably going to die because he's going to lose his insurance. \n\nI can't ever get a sleep schedule or pattern because I'm constantly asked to switch a shift or pick up. \n\nThe few times I do get to be just sup? I'm mostly fine. \n\nBut I'm not well and literally everyone knows it. I feel like I'm tip toeing around half the time. \n\nMy DON told me to snap out of it when I was in hysterics so that was fun. Then when I muttered, \"snap out if it-why didn't I think about that?\" She yelled at me for getting \"smart\" with her. Like, I'm not being smart. I was in hysterics and hyperventilating for fucks sake. She's scared to leave me alone in the building. Which you should be for fucks sake I've been telling you that being in this building makes me want to die what about this is ambiguous?!\n\nAnd I've got CNAs telling people that I was rolling around on the floor pulling my hair out (I have laid on the floor in people's offices with my knees bent when I was having very bad back pain as it was one of the few things that helped, I have never rolled on the ground). \n\nI don't even get to sleep properly since I'm constantly being bugged to come in and work. \n\nI'm seeing a therapist, I'm seeing psych, I've had my meds increased (and was withdrawaling off effexor during all this which just added to the mix). \n\nI don't know what else to do. I feel like I'm in an abusive relationship with my job. Being constantly bugged to work reminds me of when my abusive ex would harass me for sex- so double PTSD issues yay! \n\nI've tried telling people. I've tried talking with HR and even my CEO. \n\nI feel like the only way anyone is going to listen if they find me hanging in closet, but I'm not going to do that to my coworkers, please no one think I'm going to hurt myself-that actually takes energy. I'm crying as I'm writing all this down because I need to get it out. \n\nI've been crying in front of my patients. I don't like that. I'm getting snippy to everyone. \n\nWhat's sad is I feel like the only time I'm actually heard or listened to is when I'm yelling and/or refusing to clock in. Which I have done lately because we were supposed to get several readmits with me on the cart. It was changed to just one and an admit but it's all too much. How do you expect people to do this? How long before people start to die from errors because we're distracted? \n\nThat being said the CNA who's been telling everyone she's seen me rolling on the floor pulling my hair out is working in the morning when I leave and she and I are going to have a little chat. In public. Because I don't trust her. I'm struggling- I don't need her starting shit on top of it. I guess my very real issues are just so fucking funny to them. Yeah this talk did not go well. She essentially told me that I was getting what was coming to me, so that was really cool. Just the icing on the shit sandwich. \n\nAnyway. I just don't know where to go from here. I feel like I'm in a fucking pit and can't escape. I did have a former coworker offer me a RNAC job but I have never done that before and am worried about it I need time off. \n\nI will take any advice. Thank you\n\nEdit: sooooooo someone told me CEO and now I have next week off. To see if that'll help. Idk. Guess we'll see.",
    "title": "I am not doing well and am not sure what to do",
    "subreddit": "nursing",
    "timestamp": 1632975608,
    "score": 32,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Warehousing the children of workers is essential for capitalism to function. That's why schools are being forced open during a pandemic. >Secretary Miguel Cardona tweeted:\n>President Biden recently said, “We can keep our K-12 schools >open, and that’s exactly what we should be doing.”  \n \n>He’s right and we are getting it done because of the resources >provided and the hard work of so many.\n\nTranslation:\n\n\"Warehousing the children of workers is essential for capitalism to function. We are willing to normalize the deaths we cause, because we lack empathy, are shameless, feel no guilt, & know you will not retaliate, just complain online & let us exploit your labor\"\n\nUpdate: **I identified the problem and the why above. Now here's the solution below**\n\nThe CDC admitted that it's most recent guidance was *\"What they thought people would be able to tolerate\"*\n\nThis Douglass quote just keeps fitting with every new development. Not just in general under capitalism but acutely since the pandemic started.\n\n>\"Power concedes nothing without a demand. It never did and it never will. Find out just what any people will >quietly submit to and you have found out the exact measure of injustice and wrong which will be imposed upon >them, and these will continue till they are resisted with either words or blows, or with both. The limits of tyrants >are prescribed by the endurance of those whom they oppress.\" - Frederick Douglass\n\n**So what do we do?**\n\nShort term/Individually: Teachers must self advocate and leave the profession.\n\nWhen people have benefited from & exploited your lack of self-care, they'll hate you when you start taking care of yourself, because, it inconveniences them.\n\nStand up for yourself and say no anyway. \nThey aren't entitled to your labor.\nRefuse to martyr yourself.\n\nLong Term/Cooperatively: Americans must engage in a GENERAL STRIKE, with mutual aid. Mutual aid means providing the needs of everyone participating in the general strike by sharing food, medicine, shelter, safety, & more for free.\nWhile a general strike is occurring we need to create a true democratically run, bottom up, education system. ** community focused worker owned cooperative open schools** should be that system or else the future of education will be child warehouses for the masses.\n\nA marriage of Mondragon in Spain + JCOS in Colorado should be the goal.\nHere are two episodes of an education podcast that you can listen to and learn about [Mondragon](https://soundcloud.com/user-942229618/history-of-mondragon-pt1) and [JCOS](https://soundcloud.com/user-942229618/what-is-an-open-school-exploration-of-jcos)\n\n**So how do we reach these goals?**\n\nFirst we have to confront and internalize that a majority of the people in charge (admin, parents, politicians, CEO's) are sociopaths - people who lack empathy, lack a conscience, are incapable of feeling shame and guilt - *thus they can't be shamed, guilted, or internally motivated to do good.*\n\n**Please read \"The Sociopath Next Door\" by Dr. Martha Stout. It'll help you understand who we are fighting.**\n\nSociopaths also believe that we, people who feel empathy, and have a conscience are gullible, weak, and liars. In an interview Dr. Martha Stout gave she said: *\"One sociopath told me that he thought he was the only honest person because he would admit that he didn’t have a conscience and everybody else was clearly faking it.\"*\n\nThis reads true when you learn about how Republican and American Libertarian beloved author **Ayn Rand admired a Serial Killer's sociopathic qualities. Ayn Rand wrote in her journals: \"Other people do not exist for him, and he does not see why they should,\" she wrote, gushing that Hickman had \"no regard whatsoever for all that society holds sacred, and with a consciousness all his own.**\n\nThe **\"FREEDOM\"** Republicans are constantly screaming about is the freedom to brutalize others without reprisal i.e. the freedom to be sociopaths. This comment doesn't mean I absolve democrat politicians. Democrat politicians have proven that they too are a good mix of sociopath or narcissist.\n\n**Why is this important? Because y'all are wasting time trying to shame the shameless, and guilt the guiltless!**\n\n>“In order for nonviolence to work, your opponent must have a conscience. The United States has none.”\n>- Kwame Ture\n\nAt the end of the summer of 2020 when it was apparent that schools wouldn't open unless forced open some parents were saying some form of this: [\"5-10 teachers will die. Students will get used to the deaths. Schools must stay open.\"](https://twitter.com/LRedSchoolHouse/status/1440110238670077959)\n\nHow has appealing to these types of people's empathy worked for you?\n\n**Has returning to the school helped anyone besides the selfish sociopath parents who don't want their kids interrupting their zoom meetings and the owner class who have made billions in profits?**\n\n**Even the students are suffering!**\n\nWhy are the children suffering?\n\nIt's not BS learning loss or being forced to wear masks. \nChildren are smart, they see through the lies and the delusions adults tell children & themselves. \n\nChildren are seeing their country, a majority of adults, & capitalism reward sociopathic behaviors & that we don’t value EDU, teachers,or them, and instead many adults just want kids warehoused.\n\nChildren also are seeing and hearing how they have no future. So they are rightfully expressing their rage and frustration about the futility and stupidity of not only being in school, but being taught preCOVID education.\n\n**Our kids understand that our country and capitalism rewards sociopathic behaviors. So why can't you?**\n\nIt's because we have been lied to and propagandized our whole lives that Capitalism is not only good, but its the only \"sane\" economic system.\n\n**Do you feel comfortable?**\n\n**Has work made you comfortable?**\n\n**How long do you need to work to reach comfort?**\n\nThe ruling class desires you to give up everything except work. \n\nMaybe its time we stopped trying to solve our problems individually attempting the same solution and instead united in solidarity and just stopped.\n\nAlso, I might be wrong but I'm of the opinion that bullies throw tantrums and attack others to force those people to do what they want.\n\n**So what should you do now? Leave the profession ASAP.** \nNeed help?\nTap your friends, family, & their friends & family - your network- for jobs. AIM FOR WFH jobs because if not you are going from one unsafe job to another.\n\nThen Look on Google, LinkedIn, and indeed with the search terms of:\n\ninstructional design, event planning, copy editor, project management, Sales, marketing, edtech,  real estate, management, & others - \n\nwhich you can figure out by searching Twitter for I left teaching and now do…\n\nthen the next hurdle is if you haven’t applied for a job in a while you will need to rework your resume\n\ntry to find former teachers who are in the fields you are trying to apply too they will most likely gladly help out\n\nLike this group of former teachers who pay it forward helping teachers transition to instructional design\n\nhttps://www.teachlearndev.org\n\n**But I don't want public education destroyed!**\n\nThen long term look into uniting with other like minded teachers to create a better educational system. One community can be found on Twitter @lredschoolhouse\n\nThere's a lot more to say because this isn't a simple problem and is connected to every facet of our lives.\n\nLove over cruelty\nSolidarity over greed\nCompassion over capital",
    "title": "Warehousing the children of workers is essential for capitalism to function. That's why schools are being forced open during a pandemic.",
    "subreddit": "Teachers",
    "timestamp": 1640827075,
    "score": 1354,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Afterschool care--Child feeling underrepresented? Hi all! I'm hoping to get some advice or directions to resources to help me talk to a specific student about race. For context, I am White and the student is Black/mixed, so I want to make sure I can answer her questions in a manner that is situational appropriate, knowledgeable, and sensitive, so that she feels supported.\n\nFor context, I am currently working at an elementary afterschool program in a \\*heavily\\* White state. We are one of the most diverse schools in the state, and there are many BIPOC children in the program, but in the Kindergarten group where I work, of the everyday students, only this one girl is mixed, and the rest are White. One of the directors of the program is Black; but other than that, all of our staff is White, and I believe most if not all of the regular school staff is as well.\n\nThe one girl I mentioned has started asking questions about \"Why aren't there any Black teachers?\" and the like, and I want to give her solid, age appropriate answers, but have been finding myself somewhat unsure of what to say. My instinctive internal answer is along the lines of \"there is still inequality and discrimination, and although this program tries to address this by incentivizing applicants of different identities and backgrounds, there just aren't many BIPOC people in the area\" but that seems a bit discouraging/like its never going to happen, and I feel like telling a 5 year old \"this is just how it is\" is a bad approach on several levels. Because of that, I've kept more to just validation, saying \"you're right, there aren't many Black teachers here and we should have more\" but she doesn't seem satisfied with that answer (considering she keeps asking) and I am not entirely sure what else to say. I've also tried to help her feel represented in other ways--the district \\*does\\* try with diversity, so we have plenty of books with Black characters and written by Black authors, coloring pages with popular characters from those books, etc, which I have been making an effort to request as afterschool materials we can use. \n\nHowever, I still feel like there must be ways to answer her questions at least a little more directly, instead of always deflecting. She's very smart and very self-aware, so my inclination is to try and give her a real answer, but she's also five, and one student among around 10 that I am responsible for, and we are only together for a few hours every week. I don't want to oversimplify a complex situation, but I don't know that I have the time or ability to really get into it. I have also passed all of this on to my director, who clearly sympathizes very closely and personally, but does not have the time to do much more than pick out some books for us to read together. \n\nSorry this post turned into something so long and rambly--TLDR; White afterschool staff, Black Kindergartener, how to talk to her about the lack of diversity she sees at school.",
    "title": "Afterschool care--Child feeling underrepresented?",
    "subreddit": "Teachers",
    "timestamp": 1621387740,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How do you get out of retail management? Trying this out because I’m feeling desperate, any advice is appreciated. I’ll try to be as specific as possible as to get the best advice. \n\nI’m 28 years old, I have my bachelors in psychology(kind of useless I know) and I’ve worked in big box retail for 8 years, management for 5. I’m a mom of 2 little boys who are only 1 and 2 years old, they’re 18 months apart. I received my most recent promotion 3 months ago and I feel like it was a huge mistake. I’m taking the position behind someone who was very well liked but let a lot of things slide that hurt the business and I’m cleaning up their mess, not to mention Christmas in retail is emotionally scarring for everyone involved. I’m a salaried manager with 3 leaders under me and probably about 80 team members. I’m required to work a minimum of 50 hours a week and almost all of my peers at other stores do more than that. \n\nMy first huge issue is the work/life balance, it’s not there. If I’m sick, I’m expected to be there, not to mention anything involving the kids. You’re judged hard for taking any kind of sick or personal day, but the worst part is that if I do it really details my business due to payroll allocation being so bad in January. They literally need bodies in the building. \n\nMy second huge issue is how powerless I feel as a manager. When I took the job, one of my subordinates told me they wanted to be fired so they could collect unemployment. They talk loudly and frequently about how much they hate the job, but the company is SO afraid of being sued that I have no ability to fire at will. I have to go through a loooong grueling performance management process, and it has to be perfectly in line with company expectation(that I was barely trained on) or I can’t even write them up. I also recently had an employee call out corporate HR and tell them I’m racist with completely and entirely made up examples of me being racist, outright made up. I know it’s hard to believe people in the internet when they say this, but they’re lying. And the higher ups know they’re lying, but again I cannot do anything about this, their recommendation is that I never speak to this person in private even as they spread lies to people about me. I’m very upset about not being able to defend my character. I’m literally in a mixed race relationship, which I know doesn’t automatically mean I’m not racist but still. \n\nAs for the job, I lead our entire salefloor operations: inbound, general merchandise, food, and in store fulfillment. I run a $30M process. I am wildly passionate about team development and have helped get a few of my employees promoted, I’m also very results driven and skilled in finding stopgaps in processes. \n\nI’m looking for something with more work life balance, less office politics, and maybe something that doesn’t require me to work every weekend.",
    "title": "How do you get out of retail management?",
    "subreddit": "careerguidance",
    "timestamp": 1609906610,
    "score": 10,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How to Feel Comfortable and Ready for a Full Career Change? And Should I? I'm currently 23 years old. Graduated about 2 years ago with a BA in English and a minor in Psychology, and absolutely no idea what I was going to do with my life. I believed I'd somehow find myself in publication since I thought that's where all English majors would go if not something completely random. I still don't really know. And kind of don't think there's even anything I love the idea of as a career. I spent the first year outside of college in a coding bootcamp that semi-failed me but also taught me some basics, in detail, that I'm still very grateful for. It was offered to me for free so I figured \"Why not?\" and went with it for a good month or two to completion. At the same time I worked as a Barista at Starbucks. To be honest, I really enjoyed this - something about blanking out and following a formula and seeing an immediate benefit to my work I believe thrilled me. Plus, the camaraderie was really something there.\n\nAfter about 4 months at Starbucks I began my current job as a \"marketing intern/manager\". I know. Oh yes, I know. What was I doing there? I had experience in writing articles, in using photoshop, illustrator, and premiere, and had an attention to detail. This little start up decided that was all they needed but really I think they were trying to find someone inexpensive who could teach themselves how to do the job. I've been here for a year. I've decided, maybe because I didn't get the best introduction to marketing, that I actually hate marketing. I really do. I'm not sure if I hate every part of marketing but I definitely don't enjoy my job anymore. I put together and schedule social media posts, I've created flyers and business cards, I've set up never-used marketing strategies that were glossed over by my boss, helped launch projects, write 1-2 blogposts a month, have meetings with our SEO person to discuss website analytics, meet with the site designer/developer to discuss website corrections, and often find myself with nothing to do ironically and I imagine this is because there's nobody helping me figure out what else I'm supposed to be doing in this position. I believe my boss (the CEO) must be doing a good bit of what would be my job because it just feels so... empty.\n\nMy job recently moved me to working two days a week due to financial setbacks. This has been a blessing and a curse. A blessing because I'm truly not enjoying my job anymore. I believe I also just don't like my workplace. There's no structure, no feeling of camaraderie, and I feel just truly insecure in my position. Also a blessing because I've decided to revisit code and possibly ux/ui design. This is because I do make art in my own time, and write in my own time and figure it's a good mix of it all. (I decided art is too unstable of a career option due to a lack of consistent practice over the years - illustration is a very distant dream job for me) Plus I kind of enjoy it and I do have slight experience in that world due to the bootcamp. My boss told me that in the next 2 months the goal is to bring me back on full time. I'm hoping in the next two months I can have a better grasp on front end development so I can completely switch to that. I'm just not sure how possible this is. \n\nPart of me, however, is just concerned that I don't enjoy any kind of work. My job fills me with a sense of dread, dissatisfaction, and exhaustion for the most part, but sometimes I wonder what wouldn't? Does it sound like I'm just not in the right mindspace for a job and that's the problem or like I'm just ready to move on.  Also, is there even hope that I could find a job in something new with my degree and that experience or am I just setting myself up for failure by looking for something new?",
    "title": "How to Feel Comfortable and Ready for a Full Career Change? And Should I?",
    "subreddit": "careerguidance",
    "timestamp": 1611607926,
    "score": 6,
    "keyword": "mixed race ceo"
  },
  {
    "text": "To those who have gone through change in corporate culture? Hi all, I wonder how many of you have worked at an organisation where the culture changed from a laid back small office family-like culture, into a rigid formal “every one for themselves”\ncorporate race?  have gone through this change with 3 CEOs at my workplace.\n\nWhat are your adaptation strategies in making yourself employable or up to the requirements under the “new normal”? I like to hear your experience, whether you like it, you hate it, or you adapted yo the new reality but at the end quit for something else. Thanks.",
    "title": "To those who have gone through change in corporate culture?",
    "subreddit": "careerguidance",
    "timestamp": 1626087459,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance! I'll try to keep this as short I as can...\n\nI am a 26-year-old male, Canadian citizen, with a BFA in dance from a liberal arts college in NYC. I've always been keen on education and specifically returning to school after my Bachelor's. I feel like I am on the pathway to figuring out what I would like to study but I am also very lost.\n\nTo provide some context, I am attended school in NYC from 2014-2018, during that time I struggled a lot with my mental health (anxiety, depression, bulimia). Unfortunately, the dance world was too overwhelming for me at the time, and it did not seem like a career that I have fully invested in anymore. I then had to return to Canada summer of 2019 due to the end of my student visa, and since then I've spent almost every day thinking about getting back on track and discovering myself again.\n\nI struggle with weighing my desires and dream life, and also considering the practicality of it all, especially amidst Covid restrictions. I am firm in that I would like to return to school in NYC—it's pretty much my home and where I feel most myself. Beyond that, I have little idea about what I would like to study. At first, I wanted to backtrack and complete a PostBacc so that I could move into the Nutrition & Dietetics field, which stemmed from my past with eating disorders and my drive to be a person to help those in need as I didn't receive that help when I needed it most and to also challenge my brain in a different way than I had used it during my undergrad. I realized that backtracking to fulfill the academic courses, whether in Canada or the US, requires me either finishing high school level courses in Canada and then moving to college/university level courses, or following the international student requirement PostBacc in the US in only one year. At that point, I realized my passion for the subject wasn't fully present, and that the urge to move into sciences came from low self-esteem as my BFA is often viewed as worthless.\n\nSince then, I've been attempting to do a lot of introspective work, which may also be a disadvantage because I am constantly in my head, to figure out my values, goals, desires, interests, etc. As much as I've been focusing on the things that I don't like or may not seem suitable for me, here are some **things I do know**:\n\n* I am queer and I would like to study/work in a space that allows me to investigate the insections of queerness in today's society\n* I am mixed race. I am Black and Japanese and I am interested in incorporating my background as a part of my studies and further into the political and social climate right now\n* I am creative- as much as I've moved away from my dreams of performing, I am still a creative-minded person. I would love to work with dancers, movers, other likeminded people\n* I am interested in fashion, specifically fashion marketing. I would love to study something along the lines of fashion marketing that includes an emphasis on race, inclusivity of models (dancers)\n\nI have other interests, but I guess those are my main focuses right now. With my job history since graduation including working in the admin fitness industry and short-lived receptionist jobs, I have little work experience that would suffice for a grad school application.\n\nTLDR; I guess I'm wondering, how can I figure out my passions and what to study in grad school considering the pandemic and being an international student determined to live in NYC\n\nThank you to anyone who has made it this far\n\nMuch love",
    "title": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance!",
    "subreddit": "careerguidance",
    "timestamp": 1619471969,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "TripleByte is pivoting (+ analysis) https://triplebyte.com/blog/rethinking-triplebyte\n\nPosting this link more for the frank analysis the CEO included of how recruiting is currently broken (and how their prior efforts were very mixed in success). Nothing mind-blowing in there, but it's explained nicely (and bluntly).\n\ntl;dr - TB being test-based gatekeepers had mixed results, worked for some engineers and not others, didn't seem likely to scale well. Existing job search boards favor what companies want over what candidates want, mirroring who has more leverage in the process generally. With engineers, it's not really true that companies have more leverage (at least for experienced devs), and yet job boards mostly still act like it is, because individual engineers can't use their leverage very effectively. TB wants to now be a job board with pro-candidate policies, rewarding companies for things like being transparent with compensation, and punishing companies who lie or mislead (via reviews/feedback from candidates).\n\nThere's some good discussion in the hacker news comments as well, including many responses from the CEO (\"ammon\"), as well as one of the PM's involved (\"rachofsunshine\"): https://news.ycombinator.com/item?id=27541676",
    "title": "TripleByte is pivoting (+ analysis)",
    "subreddit": "cscareerquestions",
    "timestamp": 1624010918,
    "score": 61,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How do you plan for a long, technical-focused careeer in CS? >**TL;DR**: How to age into an old fart (but young at heart and brain) in a technical, CS-related career?\n\n(long post ahead)\n\nHi,\n\nAs the title says, I'm curious about what others in this sub would do to build a long career in tech.\n\nThere are two articles mentioning that a CS career could be long-winded:\n\n* [Teach Yourself Programming in Ten Years (Peter Novig)](https://norvig.com/21-days.html)\n* [A forty year career (Will Larson)](https://lethain.com/forty-year-career/)\n\nFrom this post, I want to learn more about different \"paths\" one can take for a \\~30-year++ career in 2021. In addition, tips on how we could get more out of a long career will be great additions, too.\n\n*To start, I 'll share my take later in the post.*\n\n========================================\n\nIt is definitely welcome to hear from a wide range of experiences. But if you want to focus the discussion, I'm interested in \"paths\" with these traits:\n\n## Lean more towards the technical side (vs people management)\n\nI tend to enjoy concrete work, e.g: writing code, running system, etc. However, things that fall under the \"soft-skill \" umbrella is also OK. I'm just not fond of roles where you end up a meeting-goers every day, letting your technical chop get rusty.\n\n## Reward you for technical \"expertise\"\n\nHere, \"expertise\" means the  ability to solve and understand complex problems in your field.\n\nSome older engineers I know are very good in their field of choice. They also get paid well for it. For example, these fields are: data-center networking, software performance engineering, designing high-availablilty system, writing formally-verified software, etc.\n\nIMO, having expertise in these areas seems like a good way to build your advantage as we age. This is important to not become redudant when faced with hard-working junior colleagues. (It's a sad world like that...).\n\n&#x200B;\n\n&#x200B;\n\n========================================\n\n**A blurb about myself (for context)**\n\n* Graduated with a Bachelor in Computer Engineer => background in hardware, low-level software.\n* Self-learnt CS and more trendy industry topics since.\n* Worked as \"full-stack\", then backend dev (APIs, payment, data warehouse/pipelines, IoT).\n* Recently took on devops role for a decently-sized company, running Kubernetes in data centers and clouds.\n* Worked at various company sizes (<50 => 3000+) .\n* Also worked in various industries (video streaming, electrical/utilities, gaming).\n* Have been both individiual contributor and led small teams (3-5 people) unofficially.\n* Above average ToC (\\~130k++ cash in Canada, \\~6 YoE) but nothing too fancy.\n* Generally enjoy CS-related work, but also open about utilizing tech in other industries.\n\n## Thoughts on \"having a long career\"\n\nIn general, I believe it's possible to have a long career in tech (having seen some old and wise engineers myself). Yet, it seems a long career requires good techincal chops and other complimentary skillsets. For example, besides asking hard coding/system design questions, people also expect you to show leadership + communication skills in interviews/day-to-day work.\n\nIMO, the ideal role for me at 10 YoE (mid-30s) would be a Principal/Staff (software) engineer.\n\nIf these [archetypes of staff engineers](https://staffeng.com/guides/staff-archetypes) are indicative, I aim to be a mix of Tech Lead + Architect + Solver. For example, leading a small team to solve a business-impacting problem would be something interesting.\n\nPast 10 YoE, I don't really know what's else there would be.\n\n**Industry/area of focus**:\n\nI plan to stay in the \"computing infrastructure\" space.\n\n* My experiences are mostly with backends, data-intensive systems right now. This helps build up familiarity with the space.\n* I plan to expand my knowledge in networking, performance engineering soon. In the future, maybe some kernel-related work would be great.\n\nThere's some tenative paths for this area, IMO:\n\n* More **DevOps/SRE** work, hopefully with increasing scale.\n* Specialize in **data-center**: deeper work underneath the \"clouds\". This will need much better networking knowledge, though.\n* Specialize in **kernel/embeded software**. There is transferable knowledge on operating system. But there's a lot more to learn once you are outside the Linux kernel.\n* Specialize in **infra-related areas**: database, data warehouse/pipelines, etc.\n\n**To build up advantages**\n\nThis is what I have been doing so far:\n\n* Keep a hands-on approach to problem solving. For example: participate in on-call rotation, write code and deals with technical debt (mine and others). I also run a home computing lab for experiements.\n* Keep reading/learning. Nowadays, instead of jumping on the industry's latest, I am biased towards more researchy materials. For example books, CS research journal/[the morning paper](https://blog.acolyer.org/), etc.\n* Attempt to acquire novel work-like experiences outside of my dayjob. For example, I help some friends in an NGO with their software-related need.\n* Occasionally crunch some LeetCode to stay fit for medium+ problems.\n* Maintain a light professional network/connections to spot new opportunities.\n\n**On the $$ side**\n\n* Haven't pushed hard for compensation yet, but will start scheduling interviews towards late-2021.\n* I am more concerned about finding a company with good potential (thus problems + money to spend on them). Certain team dynamics/values are also important to me (e.g: value quality work, trusting each other, etc).\n\n==>\n\nIn short, I am betting that \"computing infrastructure\" is not going away soon. Hence, a solid foundation in the field would mean above-average financial outcome. And I get some happiness while being immersed in the area as well.\n\nI am hopeful that this plan will workout. However, sometimes there's a little bit of FOMO on other paths (e.g: AI/Deep learning). Also I see lots of gaps to fill and no quick way out of the rat race :)\n\nHow about you? What are you planning for your career path?",
    "title": "How do you plan for a long, technical-focused careeer in CS?",
    "subreddit": "cscareerquestions",
    "timestamp": 1614244988,
    "score": 56,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How I dropped out, applied to 16 companies, and got offers from 4 Before anything, I just want to emphasize that my experience was *far* from the norm. Please do not take anything I've written as any form of \"guide” or process. A lot of risk and luck was involved, and I am extremely grateful of how things turned out.\n\nNow that’s out of the way, here are the high-level details of the offers I received along with the general flow of applications → results summarized in a Sankey diagram:\n\n## Offers\n\nConsumer fitness startup:\n\n* $90K base\n* 0.1% equity stock options\n\nCreator economy startup:\n\n* $80K base\n\n**Consumer fin-tech startup (accepted)**:\n\n* $85K base, **negotiated to $106K**\n* $22K signing bonus, **negotiated**\n* $20K stock options\n* Health/dental insurance\n\nStudio/agency-like company:\n\n* $62.5K base\n* Discretionary profit sharing program\n\n## Sankey Diagram\n\nhttps://i.imgur.com/a8gWIcP.png\n\nIt’s slightly hard to tell, but interestingly, I only received offers from companies that either reached out to me through Discord, or that I reached out to (directly to CEO) through Twitter.\n\nNow you’re probably thinking, “Discord? WTF.”\n\nYou see, the first thing I did when I started my job hunt, was make a short post in this Discord server about my qualifications.\n\nThe server in question is [Gen Z Mafia](https://genzmafia.com), basically a community of young people building stuff in the general tech-y/startup-y space. They've been featured in the [The New York Times](https://www.nytimes.com/2020/09/15/style/gen-z-tech-mafia.html), and have interviewed people like Ryan Hoover from [Product Hunt](https://producthunt.com), Michael Siebel from [Y Combinator](https://ycombinator.com), etc. I joined around November 2020 when it was much smaller.\n\nThe next thing you’re probably thinking is: “The offers are pretty much only from startups.”\n\nYep, that was a core part of my “strategy.” You see, the reason why I dropped out was to pursue my own startup, [Disco](https://disco.so), back in Fall 2020.\n\nI built a quick MVP to validate the idea, found an awesome co-founder, built a full-fledged mobile app, grew to 1.5K+ users in \\~2 months, but ultimately was not able to receive funding or generate significant revenue before my internship at Amazon—or my co-founder's summer classes—started (early June 2021).\n\nI had anticipated this happening when I dropped out, however, and concluded that if it were to happen (which it did), I’d probably be able to find a decent job **at another startup** with all the experience I gained (which I did).\n\nI knew it would be hard to even get interviews at big tech companies due to my lack of degree, but I didn't care. After my previous internship with Amazon last year, I realized the big tech life was not for me, and that I much preferred the fast pace of startup-like environments, while not minding the higher risk.\n\n[This](https://imgur.com/a/yWs8eLm) was the resume I used throughout the process. A large chunk of it is my own projects which were pretty much all I talked about in my interviews, especially Disco. No one really cared about Amazon, one company even slightly questioning my choice to work there haha.\n\n## Takeaways\n\n### Calculated risks can pay off nicely.\n\nI was super passionate about Disco (it’s still running!), but the timing was off and my savings were running out. I knew going in I would most likely fail, but that “failure” wouldn’t be so bad as I’d be able to leverage this unique experience for so many other opportunities (job interviews, content, a cool story to tell, etc.).\n\nThe cost was of course my degree. I knew I’d have a tough time getting past ATS systems, but that was offset by the fact that I didn’t want to work for companies that had a strict degree-requirement in the first place.\n\n### Practical experience matters more than almost anything\n\nThere’s a reason why personal projects are emphasized so much. If you go a step further and really try to *pursue* a project to its end, that can be even more beneficial imo, but you’ll have to think of the time-benefit trade-offs for that particular project.\n\n### Startups are a whole different game\n\nProbably the biggest takeaway. Only 1 technical interview out of my 4 involved Leetcode questions. The rest were a mix of take-home projects, practical problem solving, and paid contract work as a trial period.\n\nBeyond the technicals, however, it was clear that every startup was looking for *culture fit* above anything else. It's critical for startups to find the right people, aka people passionate about and invested in the larger vision while also being able to vibe with the team.\n\n### Negotiate, negotiate, negotiate\n\nThis obviously applies if you have multiple offers, but even if you only have 1 offer, you can still negotiate, provided the offer’s not from somewhere like Amazon.\n\nThe best resource I found and that I constantly referred back to was [this post](https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/) by Haseeb Qureshi.\n\nHere are the 10 rules of salary negotiation that he lays out:\n\n1. Get everything in writing\n2. Always keep the door open\n3. Information is power\n4. Always be positive\n5. Don’t be the decision maker\n6. Have alternatives\n7. Proclaim reasons for everything\n8. Be motivated by more than just money\n9. Understand what they value\n10. Be winnable\n\nObviously more info’s in the post. Definitely worth a read.\n\n## Conclusion\n\nSo does this mean you should drop out and pursue your own startup in the hopes of landing similar offers?\n\nFuck no. If you’re going to start a startup, do it because you genuinely want to. You’ll most likely fail, but you’ll learn a *ton*.\n\nAs for dropping out, I admit, I was deep in the whole “degree-doesn’t-matter-at-all” stage for quite some time. I’d now say there’s a nugget of truth to it, *if* you're someone that loves the startup life and hates the big tech/corporate life *and* you've actually built something significant and put it out there. Things are changing, for sure, but degrees are still a *basic* *requirement* for most companies with a HR department.\n\nI’m super glad to be done with the job hunt, though admittedly mine was much less stressful than most other people’s. The team I joined is awesome imo and I really vibed with them and the overall product vision. Super pumped.\n\nNow it’s time for me to wrap up my Amazon internship (sending in my 2-week notice tomorrow). Which reminds me, I forgot to mention that due to me dropping out, I won’t be eligible for a full-time return offer through the internship program. I’ll have to apply through their regular portal if I want to work there full-time (which I obviously don’t).\n\nAnyway, I’ll be happy to answer any questions! either here or through DMs (Twitter preferred [@itsmnjn](https://twitter.com/itsmnjn)).",
    "title": "How I dropped out, applied to 16 companies, and got offers from 4",
    "subreddit": "cscareerquestions",
    "timestamp": 1626048090,
    "score": 14,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Newly hired lead web designer has me second guessing my first dev position. Hi o/ not sure if thats the right flair or this is the right sub, as im (39m) 6 months in on my first job as a web developer. After 3 yrs of part time classes while working to get my A.S. and dev certification, and a yr and a half of looking, i landed a developer role with a tiny, 20 personish company.\n\nFor the last 6 months ive been tasked with building a site that i was given a total of 4 screen shots of, no real data or any files or previous anything, just 4 screen shots and asked if i could build something similar to them, and told to get creative with it. Its now some 7 html pages, 9 js files, and css for days lol\n\nIts also my first remote gig which is kinda nice. I speant 20+ yrs in kitchen work, so being in the a/c and listening to spotify all day is a plus too.\n\nIve only dealt with the CEO whom hired me and the payroll lady, thats all. I havent met another person that works for us, collaborated with or bounced ideas or thoughts or questions off of, nobody, just myself and a couple of reddit subs when id get stuck. Up until 2 days ago...\n\nI get a text over the weekend asking if i could go into the office monday, to meet a new hire and go over some things. The new hire is, im assuming, the new lead designer, and i say that only since he wasnt introduced as so and so the new blah blah. But, hes a 30 yr long friend of the CEO, and theyve done numerous projects and made tooooooons of money together, thats what they were saying.\n\nCEO leaves to do a conferance call down the hall in another room, so hes not there anymore. We start going over some things, work history, random stuff, conversation. Some 30 minutes in and he starts talking about how hes leaving an extremely large, well known company that handles gov contracts because of vaccine mandates. Hes anti vax, claims to never have had any vaccine, and plans on staying pure for religious reasons. So he came here now to work. Rather arrogant, cocky, very his way or no way type of vibes.\n\nHe then gets back into work history, and how prior to the big company hes leaving, he worked with \"a bunch of indians that didnt know s**t about building apps\" and \"were completely terrible clowns to deal with\", mocked the way they talk, and used a very racial tone along with some not so nice language and terms. He did this 3 other different times over the total 5 hrs i was there, mind you ive only known this guy for maaaaybe an hr by now.\n\nMixed in with all that, i find out theres a prototype/mock build of what ive been doing for the last 6 months, and apparently hes the one that built what i have the 4 screen shots of, but i was never told about this proto from the CEO, but was supposed to be. Now im going back and moving, adjusting and rebuilding portions to follow with his proto. \n\nWe talk a little more on responsiveness, although he kept calling it \"zoom display\". He tells me he doesnt do media queries for anything above 1400px 😳 \"because if you try to hit all screen sizes its just gonna make a bunch of unneccesary work for us\" and \"tablet sizes are about where it stops now\". In my head im going \"uh what the actual f**k\" ive never heard/seen that done\". I go from 400 - 700 - 1000 - 1300 - 1920, all my projects have those 5 queries.\n\nTheres a couple other things from this meeting too, but ill kinda stop there.\n\nI text him yesterday at 5pm ish just to share the new reworked updates ive done so far. He responds with \"ok good progress, see ya tommorrow\". I responded jokingly \"How? You comin to my house orrrrr what? Lol\" He says \"Oh CEO said he told you to come in\". I text back \"No i was never asked to go in there tommorrow (today)\". I text CEO about it and tell him id rather not as i wasnt feeling well, which was a lie, i just got suuuuuper not cool with new guy from the 5 hr conversation at the office the day before. He says \"ok cool no biggie\". And now here i am today.\n\nIm honestly here asking for advice as to what to do/how to go about this. Im back cruising the job sites, but it reminds me that it took a yr and a half and literal 100s of applications and resumes to get this job. I could go back to the country club i was at prior, but the pays not really close, as i just got put on salary 2 weeks ago with this. I would have group health insurance again instead of having to source my own like now though, which that was a s**t show in itself.\n\nIm really just need some pointers and/or advice please. And im sorry if i just wasted an hr + of anyones time whom reads this. Thank you to anyone that responds.",
    "title": "Newly hired lead web designer has me second guessing my first dev position.",
    "subreddit": "cscareerquestions",
    "timestamp": 1635349324,
    "score": 7,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Career Advice I don't know how to start it, it's been quite hard for me for the past year.\n\nSo, before working for this job, I was managing small team for a new company. I'm starting at junior position with permission to take another job since my job desk was pretty easy. talking to customers, find user requirement, looking for the big picture of the projects and etc. then I present it to the developers.\n\nI know pretty sure that the senior developer in that company at the time doesn't have a lot of experiences, but I choose to stay quite since I'm new. I was quite shocked with the decision that he made, and I preparing to leave since all of the tasks are impossible. Before that happened, he was disappear since he unable to kept his words, but our CEO met him personally and made him finish the job.\n\nOne day the directors gimme a chance to delivering a project and I'm giving my best, I even make some friend with our client and they always using our services. Then I'm moving to another project, create a lot of proposal and suddenly we need more people so I was assigned to manage the developer and getting my salary doubled. At the time I'm still working for both company. It was fine until we got a lot of projects, and mostly my job was keeping the project on schedule. my workflow was quite stressful since I'm moving from project to project that I flagged danger, so all the project is kept progressing but I had feeling that our clients doesn't really like that since the pace starting get faster when I'm focused on them. that make me sad but I need to continuing doing that. I even doesn't have time even on weekend and a lot of meetings after working hours and sometimes I got called at 2 am or 4 am since we are supporting networking things too.\n\nThen I realize I need to chose one job and I chose this company instead the remote job since I can't perform well on my remote job. the remote job was good, the people, the stacks, the tasks, the salary, but their application is complex since they're using old application and lot of refactoring need to be done. the good thing is they had the automation tests so it's good for me to refactoring. And from this company too I know what agile development process and code standards are. I implement all the stuff that I learnt when I managing my developers as well. until I got burnt out and leave that company when I got feeling my ceo getting more greedy and don't like to recruiting when the project number is increasing. I left when all of the projects are in healthy condition and joined my first client that I handled, that i thought might be better.\n\nI'm starting at the lowest level again. But I can see there are lot of strange things at the company. I told to them the way of doing it, but it takes monthly to changes it, even a small changes like daily standup takes 3-4 hours finally cut down just recently when disaster finally happened. there are lot of things that I learnt before doesn't exists in this company, and it's stressing my at the beginning and i'm starting to ignore it since I've told them many times. People just doesn't care and as long as the development progressing, and they don't mind it. but in reality. I know these application are hard to maintain and doesn't have standard code at all. mixed pattern used, no tests, bugs and bugs, break changes makes delivery teams crying since no migration script provided and everyone just code with their own knowledge level without proposing, architecting or design process, so just code without anyone concern.\n\nI was protesting hardly on that and I ready to leave as well since I can't take it anymore. but after talking to my CEO and manager, i chose to stay since i care with these people and want to learn more complex computing at cpu level since that what this company doing. at the time, I got better offer from my last remote job and they ready to compete with my current company which i think that's cheating since they'll win anyway because of  concurrency level. But I'm too greedy, and I'm taking the double job again without my current  company knowledge.\n\nit's quite good at the beginning until my current company asking me for overtimes without being paid for weeks. I'm starting to unable to perform on remote job and I can't working more hours since I'll get headaches pretty bad in the afternoon. so I'm starting to ghosted them(manager remote company), and suddenly it's been two months. I don't know why they didn't kicked me yet from github and slacks and still contacting me last month. this is too embarrassing for me to say hello again to them and I dont know how to handle it. because I'm not professional and I think i'm worthless to them.\n\nThen the disaster starting, one by one developers starting to leaves the this company, until one fully team resigned, and they made really bad code legacy that gonna take times to refactor it, and the remaining developers need to continue that smelly projects while more developers are resigning, we got half developers and no more recruitment since there is an \"office politic\".\n\nMy manager tried his best to maintain the project but, backend and frontend development are two different things. and I can see that clearly since I've experience developing with that fully opinionated framework(Angular :) ) and mistakes are made, if he continue to doing that, I just thinking nothings gonna changes, just how previous and current developer preferences.\n\ni think most of our developers doesn't have experience writing with opinionated frameworks since there are lot of owned style with strange pattern and no lacks of communication in designing process. I don't wanna follow that path, but I'm starting to give up. I love and respect my manager, he is humble and good person. and writing code with cache friendly is his things, but when working and follow framework pattern are different things. I'm not saying I'm so expert but, I always thought at my current level I'm able to see the mistakes made me uncomfortable and not enjoy writing codes.\n\nRecently I got pay rise and an \"award\" since I'm still staying even lot of developers are resign. I think this as a damage control and I know my managers and CEO trying their best to kept me staying at this company and I respected that.  I've been thinking to stay little longer until next middle year, but I can't enjoy to code at this company anymore and the office politics getting more crazier. I'm confused if I need to continue, or taking back and saying sorry to my remote job manager and get back to him, or looking for a new job. if you're at my positions, what're you gonna do?",
    "title": "Career Advice",
    "subreddit": "cscareerquestions",
    "timestamp": 1635686347,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Who gets more free time a L8 Software Engineer or a small sized company owner? I have just graduated from college and in the position of making that hard decision whether to start my own startup or work as an employee. I have heard mixed answers for whether the people running small sized companies get free time so don't know what's right. Now I know that it depends on the situation but in what situation will I get free time in a small sized business company that will be more than an employee who works at the highest position of software engineer. For example, if I have a ceo, a manager and 5 leaders to lead and manage a team of like 200 employees will I get some free time on my hands as compared to working at the highest position of software engineer? Sorry for this bad example but I hope you get what I'm trying to say. Thank you.",
    "title": "Who gets more free time a L8 Software Engineer or a small sized company owner?",
    "subreddit": "cscareerquestions",
    "timestamp": 1610404150,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?) The reactions of black women to this whole Meghan Markle ordeal on this subreddit and Twitter, and on News media have been fairly interesting to me. Would be interested to hear the perspectives of other black women as my opinion might be unpopular going by the views expressed on this subreddit. Personally, whilst I sympathize with Meghan for the racism and blatant discrimination she has faced, I find myself feeling sort of consciously detached to her plight. As a woman of African/Caribbean descent, I find it difficult to wrap my head around as to why any woman of recent African ancestry, or any black woman, would want to marry or be otherwise intricately involved in an institution as racist and colonialist as the British Royal Family. Colonial England, and the BRF, are almost single-handedly responsible for the decimation of African regions and Caribbean countries, which are now part of the Commonwealth and hindered in many ways by this. These people’s ancestors have the blood of her mother’s lineage on their hands. \n\nWhilst I think Meghan is an intelligent woman, I do believe that she was being disingenuous when she relayed her supposed limited knowledge of the royal family, and I believe some of her claims have been disputed by her own friends. Operating under the assumption that what she said is true however, I don’t understand why she didn’t do more research into their colonial heritage and history. The British monarchy, including Harry himself,  are very racist and are symbolical remnants of white supremacy. Price Harry is the man who wore a nazi costume and allegedly denigrated his fellow army-men of color. I find this to be hypocritical and I don’t buy his reasoning that he wasn’t aware of the depths of racial discrimination before meeting Meghan given his family’s history.\n\nI walked away from the interview feeling sorry for Meghan, but feeling that she was very naive and thought that her being biracial/white-passing would somehow aid her. Had Meghan been a fully black, unambiguous black woman of a darker complexion, I seriously think she would not have even been allowed to marry him.\n\nI also take issue with people on here referring to Meghan as black, when she has repeatedly stated that she is biracial, and her experience reflects that of her phenotypically mixed heritage and not that of mono-racial black women. Before I knew of her background, I actually thought she was white. Even Harry thought she was only white when he met her. I’m trying to be open-minded on this point, because I realize that America has a different racial classification system than the rest of the world. I don’t want to be accused of “policing blackness” (although I find it weird that all races but black people can exercise some sort of racial exclusivity) but I do find it slightly bewildering as Meghan, who is ambiguous and white-passing, would be categorized as exactly what she is-mixed/biracial- anywhere else in the world, especially in Africa and the Caribbean. I also take larger particular issue with this as I find that what constitutes a black woman these days are blurred, but not so for our male counterparts. Everyone seems to agree on what a black man can look like, and they are thus aptly represented in the media, but there is a curious leeway for black woken in the media, and I’m starting to see more biracial instead of monoracial media representation for black women and I feel like claiming Meghan as black plays into this. \n\nThis idea that Meghan was going to modernize the BRF is delusional to me and this is exactly the outcome that I expected. Why any black or biracial woman would need to modernize this institution in the first place or add “a splash of melanin” or whatever ridiculous phrase some people are using is lost on me. Why would we need to modernize an institution that oppressed our ancestors? I was surprised that she and Harry stated that after everything, they were still open to working for the Queen and Meghan “representing the commonwealth” (what even...?).\n\nAlso, I find black women claiming Archie is “black” astounding tbh. I hope this is a minority opinion because it makes zero biological sense and is very embarrassing . I have also noticed some BW living vicariously through her, and this has me slightly worried. The majority of women defending Meghan look nothing like her and the people fetishizing this relationship (especially because it may be/is considered interracial) need to stop.\n\nI hope I wasn’t too harsh with my commentary and would be willing to her criticisms/thoughts.\n\nAddition: (unrelated) We may take issue with some things black men do as a collective but some of the black women on Twitter (I see you Monique Pressly) accusing black men of not being supportive enough of Meghan/being the most disrespectful towards her is ridiculous to me. Seriously?",
    "title": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?)",
    "subreddit": "blackladies",
    "timestamp": 1615349273,
    "score": 314,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How Black Men Are Discussed on This Subreddit Is Toxic af I am not trying to dismiss what people have experienced. Me myself many times have been put down by black guys which was racist, colorists, or sexist things. It is an experience being both black and a woman and there is intersectionality ignored by feminism, by media, by the LGBT community, and even BLM.\n\nThe thing is I’m confused a lot of the time people dogpile on black men on this subreddit for things when I have experienced much of the same from black women. Are you really telling me colorism, racism, misogyny, and homophobia is one sidely expressed by black men? \n\nI don’t understand about how black men are colorist where Black women can’t be, some of the first colorist things I heard were from my aunt and other black girls. One of my biracial best friends mother told her not to date black men because she does not want nappy headed grandchildren. This is from a dark-skinned black womenI have heard many black girls say they want mixed race kids or someone non-black. But nooo this is just black men right? And not only that it’s weird how Black women in interracial relationships is either promoted on r/Blackladies or side eyed but black men doing are always self-hating and colorist. And their kids aren’t black, relate to black people, they’re mixed not black, that sentiment is not isolating at all to mixed race black people.\n\nWith black men treating black women badly in professional spaces or predominantly white spaces I won’t deny any experiences . There are definitely Black people that purposefully avoid and demean black peoples to gain acceptance in these environments. The thing is are we really going to generalize and say all black men are like this? I have definitely experience reaching out to Black women at professional spaces and being treated rudely in return, but I know not to generalize. Many times it has been easier to befriend women of other races before someone black but ultimately black people are just people to have the chance to be anything, race doesn’t guarantee a friendship from that person or respect.\n\nIt’s so hateful and negative that I feel like unsubbing. It’s weird how a lot of the times people posting about their negative experiences never account for how they chose their relationships or how they come off. A lot of the time they could aloof and uninterested , self-pitying, condescending, and never take responsibility.\n\nIt’s weird how a lot of the people comment that they hate when people generalize black women into stereotypes and we are the most educated and this...but it’s completely okay to avoid black men and stereotype them. Please.",
    "title": "How Black Men Are Discussed on This Subreddit Is Toxic af",
    "subreddit": "blackladies",
    "timestamp": 1636327736,
    "score": 318,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media? How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?\n\nOn the bachelor contestants, Taylor Nolan's recent Instagram live, her and Pieper touched on colorism and the mixed race experience. Pieper talked about how being a lighter skinned black woman, racism affects her differently. She talked about how there are nuanced and different levels of racism.\n\nTaylor says she and other light black women (like Pieper) have been portrayed as angry black women. She also talks about how her and other light skinned black people were light enough to get onto the show and be the token black person.\n\nIn my own experience, as a mixed black woman, I think colorism can sometimes allow me to get my foot in the door in white spaces like jobs but I am still watched suspiciously because they assume I will do black stereotypes because of racism (like steal, get angry, be late, be uncivilized and abuse/attack). I remember growing up in the white conservative suburbs and feeling ignored and not considered for dating by white and poc/black boys because I was not white and having a lot of trauma from that. I remember a racist white nurse dismissing my pain and assuming I went in her office to skip class. I remember some white teachers treating me poorly, assuming I had an attitude and not giving me the benefit of the doubt. As a woman, I avoid being in all white spaces... But when I have been, now I have to worry about being hyper sexualized by white men. In liberal white spaces, I worry about being fetishized. When I call a white person out for racism, ask for my needs, am quiet or angry, I am seen as a threat and Intimidating by white people because I am challenging the status quo and not appeasing them. So I definitely have experienced the angry black woman stereotype projected onto me. I also know being a lighter mixed black women other stereotypes may be projected at me such as being seductive, sexual, soft, attractive, intelligent, etc. But that isn't always the case. Sometimes I'm thrown the black stereotypes and other times the mixed race stereotypes, often both.. that's why the experiences overlap for me and I call myself a black mixed woman.\n\n\nHow do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the white media/shows? Do you see any differences in portrayal? Do you think mixed/lighter skinned black women are often portrayed as angry?",
    "title": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?",
    "subreddit": "blackladies",
    "timestamp": 1613577841,
    "score": 124,
    "keyword": "mixed race ceo"
  },
  {
    "text": "\"I'm a mixed girl. I just want to be normal.\" If you haven't noticed it, there's a post up on /r/offmychest right now that's gaining quite a bit of karma with the same title. This isn't word play or satire, it's quite literal. Apparently, she really is a \"mixed girl\" who simply wants to be perceived as \"normal\".\n\nOk, I'll admit. I rolled my eyes. I read the title and I immediately rolled my eyes. Even though I'm mother of mixed race children and come from a mixed lineage myself I rolled my eyes.\n\nBut then I took off the Petty Crown, scolded myself for being judgemental, opened the link and got to reading. \n\nI heard her out. I thought about how I would feel if one of my kids were upset because they felt \"abnormal\" and I heard her out. And now I'm struggling, desperately to RESPECTFULLY pen my reaction. I'm not sure if I'm going to succeed, but here goes. \n\nI'll start with a few points I've gathered from her post:\n\n1. \"Normal\" is White. Or at the very least, not Black.\n\n2. She believes cultural appropriation is a myth. \n\n3. The feeling of \"normalcy\" she apparently craves reads much more like \"acceptance from 6f people who don't see color and have lots of \"ethnic\" (abnormal) friends. \n\n4. She is completely removed from her Black side of her family and has no contact with them. I'm not sure if her Black parent abandoned her but she's expressed that she has no ties to them and therefore is frustrated at the fact that she (at times) is percieved as a part of their ethnic group. \n\n5. She seems to have a disdain for African American culture in general. \n\n6. She believes her perceived Blackness is negatively affecting her artwork and how it is recieved. \n\nThere is so much more, I'm just already exhausted with this list.\n\nAt the beginning of her dissertation she recalls an incident where a guy accuses her of \"Looking like the type of person that would accuse someone of appropriation for copying her rat's nest of a hairstyle\". Her disdain isn't aimed at the guy that called her hair a \"rat's nest\". Nor is it aimed at the way he trivialized cultural appropriation (She doesn't belive it exists, remember?) Her disdain apparently stems from being grouped with... us. The audacity. \n\nShe goes on to explain how tired she is of being made to feel that she should have to identify as one of us and research our culture. \n\nIn her own exact words:\n\n\"I am not my race. I am tired of being boiled down to my race by others. I hate having personality traits assigned to my perceived ethnicity.\n\nI wish I was normal and my ethnicity wasn’t a freaking talking point and a major part of my being. It sucks, honestly.\n\nI hate how some people assume I’m some sort of pity seeking, race-baiting asshole because of how I look. I’m just a person, with my own personality. I’m not a statistic.\"\n\n\nHave you ever read something so audacious and absurd that you just placed your phone down and blinked silently at the cosmos?  \n\nHow does one begin to unpack this level of self hatred and dissonance?\n\nIf this sentiment was ever expressed by my own kid I would feel like a complete failure as a mother. I'm talking cry in the shower, 'how could I have let this happen to my baby' type of failure. \n\nI don't really see a point in dissecting this any further or even criticizing her mentality because I don't see that making a difference. Instead, I'd rather make this post a  cautionary tale; to biracial people and parents of biracial children who are half Black. \n\nDon't. Be. This. Guy. \n\nI implore you, if you feel even a smidgen of this sentiment, talk to someone. Talk to your Black parent or a trusted Black relative. Talk to somone educated on Black issues. Talk to someone here. Hell, talk to me if you have no one else... I'll listen. But for the love of cocoa butter, do not DO NOT let yourself sink into the sunken place by relying on mainstream reddit to comfort you in your time of ~~ashiness~~ need.\n\nDammit. I tried.",
    "title": "\"I'm a mixed girl. I just want to be normal.\"",
    "subreddit": "blackladies",
    "timestamp": 1618017484,
    "score": 121,
    "keyword": "mixed race ceo"
  },
  {
    "text": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota) It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)\n\nI just saw this picture showing Minnesota is one of the most racist states in the country---so validating (see link below). I knew MN racism was really bad at my core but you get gaslighted so much here that you start questioning your reality. People act like there is no racism here because \"people are so nice.\" White fragility is real here... like narcissists, white people act racist, deny it, make themselves the victims, then put the blame on you. They are so passive aggressive that the racism is so subtle, ex: moving away from you out of fear like you are this big threat. I am a woman and I've learned to keep a lot of physical distance from white women and to not make eye contact---which by the way, is super offensive as a feminine woman. If you aren't going out of your way to be super friendly and make them comfortable, you are a threat. I have had my own white relatives act suspicious of me for visiting and trying to get to know  them. I have always felt so isolated being a higher educated middle class black mixed woman. I've been treated as a criminal by my own employers. One time I walked into my first therapy job and the co-workers spoke to my white supervisor instead of me---they were so shocked and uncomfortable when they found out I was the therapist. The social class and job discrimination is so strong here, they are shocked to see professional black people. Being around all this white supremacy makes you question yourself and internalize their messages... You question your sanity, if you are bad, the problem.. when really they are the problem. They have the history of stealing and killing all groups of people for centuries but somehow they see themselves as the victims. White narcissistic delusion.\n\nThere also isn't much of a community of black professionals. From my experience, there are a lot of black (especially mixed) people who are in denial and will gaslight you about racism, too. I have had a lot of bad experiences with mixed black people who are in denial of their blackness, talk about how they pass for other races, and allign with whiteness. They distance themselves from their blackness and some seem delusional because they do not see that they do look part black.\n\nIt seems like the black/mixed people who make it to the top are the ones who have assimilated, have internalized racism, are not unified with other black people, and have had to swallow the racism they have had to experienced. I could not do that for long without it eating me up. I spoke up for myself and others. As humans, we are not supposed to be abused and just take it.. but somehow as black people, white people see us as less than human and think we are immuned and should just take it.\n\nI am burnt out. I barely leave the house. White people are everywhere here and I don't trust most. When I am around them, I dissociate to avoid feeling the pain of all of their violent \"microaggressions.\" Thankfully for now, I work at a black business. Moving out of this state is mandatory for my sanity. I wish all black people could leave as well. It is hard to succeed and progress here without losing a part of yourself. At least I know I managed to survive (and suceeded educationally and built resiliency) one of the most racist states, it can only get better from here as I move on to a more equitable state.\n\n[Racial Disparity MN pic](https://www.zippia.com/wp-content/uploads/2020/02/racial_disparity_map_worst_states.jpg)",
    "title": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)",
    "subreddit": "blackladies",
    "timestamp": 1620570249,
    "score": 72,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Anyone else have a white parent that instilled an inferiority complex in you? Anyone else have a white parent that instilled an inferiority complex in you for being black?\n\nMy white father was a pedophile, who used me as a second partner, and sexualized me my whole life. He fetishized and sexualized black women but saw him self as a good non-racist white man because he married a black woman and didn't care what society or others said. Yeah, my dad was antiracist in some ways because he didn't adhere to societal norms especially being a highly functioning autistic man.. but he definitely had racist ways. He objectified black women and feared black men.  He one drop ruled me and said I was a black woman. When I wanted to embrace my mixed heritage, he would shut it down and make it seem like I was trying to act like I was better. When I was a child, he told me to be careful with white men because many just want the black experience but won't settle down with me. He said not all white men are like himself who don't care about social status, you have to find a white guy who doesn't care like himself. He made it seem like he was one of the only good ones.\n\n In college, I remember one time telling him how a lot of guys including white guys were interested in dating me in the city (contrary to what he told me growing up) and how (unfortunately) due to colorism, my dating experience is not identical to monoracial black women and I have noticed a lot of white men being attracted and wanting to date me seriously. He would shake his head, try to put me in my place, act like I was bragging, and pessimistically tell me I was wrong and that I had similar issues as black women because they saw me as black. He would act like the expert of my experience as though he walked a day in my shoes. He was instilling an Inferiority complex in me for being black. I think he was jealous of these men being interested in me because he wanted me all to himself and was afraid of losing me. I wonder if he purposely chose black women to date because it made him more secure they would not leave because he thought most wouldn't date them of racism and not trying to lower their social status.\n\nI remember one time telling him I wanted to be a Naturopathic doctor but had some fear because not many black/mixed doctors were out there and I would have a harder time finding BIPOC clients and clients in general due to racism. Instead of encouraging me, he agreed with me and tried to discourage me from leaving the state to pursue my dreams. When I said I wanted to act and model in California, he tried to break down my self esteem made me feel like I would not make it--he would often add how my race would make it harder. When I was dating, he became controlling, abusive, called me a whore, that I needed makeup, and I looked bad without makeup. He was getting insecure as I was an adult, ready to leave and date.\n\n Racism is real and there is definitely some truth to what he says about having to be careful around white men and having a harder time in jobs. I do think there was a part of him that was trying to protect me. But there was also a prominent part of him that wanted me all to himself and he used my race to make me feel insecure and Inferior. I've also had my mixed black brother (who also sexualized me) try to make me feel like white men would not want to date me because he got jealous when white men were interested. I think some black/mixed men do this because of their own internalized racism and Inferiority complex.\n\nInstead of discouraging me, my dad should have encouraged me to work harder and preserve despite the obstacles (when I was young he did this but as I got older, he became insecure and started to discourage me for his own selfish needs). He should have told me not all men are the same and there are men of all races who would date me instead of just focusing on the negative racism to make me feel like no one would really consider dating me. He should have let me talk about my mixed black experience instead of denying it and making me feel like I thought I was better for talking about my nuanced mixed black experience.\n\n I used to think he was an example of a non-racist person in my life and I would ask for his advice and support when it came to racism I experienced. Now I see that he was actually very racist, he lied and was a fraud. He was the type of racist white man he warned me about. This has led me to have a skewed/ black &white view of life. His words and of course racist society were traumatic and have left me with an inferiority complex that I am working to deprogram. I realize now the main root cause of my racial trauma and fear of white racism is because of him.",
    "title": "Anyone else have a white parent that instilled an inferiority complex in you?",
    "subreddit": "blackladies",
    "timestamp": 1622469042,
    "score": 26,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I need to vent to other parents of mixed race children As a person of color in a very white, old fashioned, trump loving town, I’ve just had it. I’m leaving this town soon enough, thank god, but it’s been hell. I’ve learned to avoid all other moms by this point. My daughter is in kindergarten and she looks almost completely white. I’m asian. People treat me like I don’t exist. They will talk to my FIVE year old before they even talk to me. After school, the moms gather and arrange their play dates and they treat me like I’m some random nanny. There have been times when assistant teachers greet every single mom and then they don’t even look at me, or they look at me and then proceed to take my daughter from my hand without saying a word to me. \n\nI’ve been to play centers where some people just stare at me until I stare back at them and they make some stupid excuse like “omg your daughter looks just like you.” someone literally said that and I had to pretend I actually believed that horseshit. Even if it were true, like way to point out how strange you thought it was that an Asian woman could look like her mixed race daughter?\n\nI’ve tried to avoid any social interaction whatsoever at this point. But I have to take my daughter to a bus stop where this white lady keeps trying to make conversation with my child who does not have any interest in talking to her. I try to make it less awkward by talking whenever my daughter doesn’t respond but I’ve noticed that this lady doesn’t want to talk to me. She specifically only talks to my daughter. Don’t you think this is just weird? Most moms talk to one another other in these scenarios while the kids play. \n\nI honestly did not even want to believe that this shit was happening. But it happens all the time. I’ve lived in this town for 4 years and I’ve had enough. I have never considered myself different from my own child in any way but this town has made me see the difference.",
    "title": "I need to vent to other parents of mixed race children",
    "subreddit": "asianamerican",
    "timestamp": 1632799843,
    "score": 223,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 34,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Asian Americans Who Fought During the U.S. Civil War Did you know that 58 Asians fought in the U.S. Civil War?\n\n&#x200B;\n\n[Private Felix Balderry of the 11th Michigan](https://preview.redd.it/4smau7ank1q61.jpg?width=336&format=pjpg&auto=webp&s=0d39e63c5f600e9f381bdf6c5534cae23f344ce7)\n\nPictured here (above and below) is Private Felix Cornelius Balderry. He was a Filipino who came to the United States as a sailor aboard a ship commanded by Captain Joseph Foster of Leonidas, Michigan. After Captain Foster retired from the sea and settled on a Michigan farm, Felix joined him as a farmhand. In December of 1863, he joined the 11th Michigan Regiment just in time to take part in General William Tecumseh Sherman's Atlanta Campaign. As part of this campaign, the Union Army followed a scorched earth policy. They burned fields and houses, razed businesses, and destroyed railroad tracks in an effort to destroy the South's will to fight along with their ability to resupply the Confederate forces. The 11th Michigan was involved in several skirmishes and battles throughout this campaign.\n\n&#x200B;\n\nhttps://preview.redd.it/j5pob2tpk1q61.jpg?width=445&format=pjpg&auto=webp&s=00ee409d82fdb17c11ee56f976973fd03386eb37\n\nPrivate Balderry served through the end of the war and was mustered out of service in September of 1865. He subsequently returned to Michigan where he worked as a tailor. In 1885 at the age of 39, he married a 16 year old girl named Ada May Barns in Constantine, Michigan.  He died of  tuberculosis in 1895 at the age of 49.\n\nThis is Corporal Joseph Pierce of the 14th Connecticut. At the age of ten, his father sold him into slavery to Amos Peck, a sea Captain. He was nicknamed \"Joe\" by the crew. The Captain later gave him the family name of \"Pierce\" in honor of President Franklin Pierce. Although he was technically a slave, after the two month sea voyage from Canton, China to Hartford, Connecticut, he was raised as a family member of the Peck household.\n\n&#x200B;\n\nhttps://preview.redd.it/golha4brk1q61.jpg?width=385&format=pjpg&auto=webp&s=7b29fff77eaac2c588e8224527746bafa846aad3\n\nIn 1862 he enlisted in the 14th Connecticut Regiment. The 14th was part of the Second Army Corps in the Army of the Potomac. Joseph Pierce has the distinction of being the only Asian to have fought at Gettysburg. During his time in the Union's service, Joseph Pierce fought in 34 battles and skirmishes.\n\nAs a result of his bravery at Gettysburg which included voluntarily joining a skirmish line that had advanced on the Confederates, he was promoted to Corporal on November 1, 1863. While this rank may not be considered very high, it should be remembered that the Union had a segregated army. Black men served in black regiments that were commanded by white officers. Since Asians were largely unknown in the United States, people didn't know how to classify them. Some thought that Asians were mulattos (of mixed race ancestry). Others thought that they might be Native Americans. The fact that Corporal Pierce was actually given rank over subordinate white privates was really quite astounding given the time period.\n\nCorporal Pierce served with the 14th Connecticut until the end of the war and marched with his regiment during the \"Grand Review\" in Washington, DC on May 23. He was mustered out of the army on May 31, 1865.\n\nAfter the war he returned to Connecticut where he worked as an engraver for a silver company. In 1876 he married a woman named Martha Morgan from Portland, Connecticut.\n\nHe died on January 3, 1916 at the age of 73 in his home.\n\nAnother Chinese who served in the Civil War was Edward Day Cahota. At the age of 4, he was found with an older 6 year old boy as stowaways on an American merchant vessel that was commanded by Captain Day. The children were starving and did not know their names. The older boy died just two days later and was buried at sea. The Captain named the younger child Edward and in time Edward became a cabin boy.\n\n&#x200B;\n\n[Edward Day Cahota](https://preview.redd.it/rptamw4tk1q61.jpg?width=147&format=pjpg&auto=webp&s=10f42c86cdf3339b46d1f3f1e2a63d789b8f1f05)\n\nWhen Captain Day retired, he brought his cabin boy home with him to  Gloucester, Massachusetts . When Edward insisted upon having a third name, he took the name Cahota which was the name of the ship that he had served upon.\n\nIn 1864, Edward Day Cahota joined the 23rd Massachusetts Infantry. After mustering out of the army at the end of the Civil War, he reenlisted in 1866 and fought in the Indian campaigns. One of the more memorable experiences he had during his time in the western service was when he stood guard over Chief Sitting Bull. He told his family that the chief was really quite friendly. It should be noted that Chief Sitting Bull led the Western and Northern Cheyenne at the Battle of Little Bighorn in which General George Armstrong Custer and the 7th Cavalry were surrounded and slaughtered in 1876.\n\nEdward Cahota died on November 18, 1935 and was buried two days later at Mt. Hope Cemetery in Valentine, Nebraska. One of his dreams that was never realized was to become a citizen of the United States. Despite having served in the Army, he was ineligible to become a citizen after the Chinese Exclusion Act was passed in 1882.\n\nIt's estimated that 58 Asians fought in the U.S. Civil War. While most of them fought for the union, at least two fought for the Confederacy. Picture below are Chang and Eng Bunker. They were Siamese twins who came to the United States to join the PT Barnum Circus. After leaving the circus they settled in North Carolina where they married two white sisters. They lived on a farm and were slave owners.\n\n&#x200B;\n\n[Chang and Eng Bunker](https://preview.redd.it/q067sopvk1q61.jpg?width=406&format=pjpg&auto=webp&s=9e034a2eff384795d3187e3187be0b3c9aa419ff)\n\nWhen the Civil War began, two of their sons, Christopher and Stephen joined the Confederate Army. Since they each had horses and all of the associated gear, they served in the 37th Virginia Cavalry.\n\nIn 1864, Christopher Bunker was wounded and captured in a skirmish at  Moorefield, West Virginia. He was sent to Camp Chase which was outside Columbus, Ohio. Camp Chase was the largest Federal POW camp in the United States.\n\nThe Union didn't spend much money on Confederate POWs. Christopher was housed in a crowded barrack with 197 other prisoners. The union's rations were so meager that at one point, Christopher and his fellow prisoners were reduced to eating cooked rats. On March 4, 1865 he was freed as part of a prisoner exchange between the Union and Confederate forces.\n\nAfter the war, he and his cousin Stephen returned to North Carolina where they resumed farming albeit without slaves since all slaves had been emancipated during the war.",
    "title": "Asian Americans Who Fought During the U.S. Civil War",
    "subreddit": "asianamerican",
    "timestamp": 1617057006,
    "score": 24,
    "keyword": "mixed race ceo"
  },
  {
    "text": "#WeArePeopleToo: A Proposal for a New Movement Hi everyone, this is my first post ever on Reddit despite being an avid Redditor. I apologize if I lack any specific Reddit-based decorum when it comes to making a post. I will definitely get better with time!\n\nMy name is Dae and I'm an NYC public school educator in my late 20s. I am a mixed race male and would like to share my story as well as establish my thoughts on a movement to better represent us as mixed-raced humans of the world.\n\n**My Story**\n\nI was born to a Trinidadian mother and a Korean father. As a result of their marriage, my father's side of the family became estranged and cut ties with us. As a result, I have only managed to forge a relationship with the Trinidadian side of my family. I grew up in a fairly Republican/Conservative area of NYC (Staten Island) in which white people were the majority.\n\nMy parents loved me but they had no idea how to deal with raising a multiracial son. They were stern and strict and did not believe in a coddling love. They did, however, believe in the merits of education and made sure that I knew to bring the best grades home. In school, other students stayed away from me. They were polite as young children but they often ostracized me and left me out of activities. At the time I didn't know it was because of how I looked but with time I began to see the relationship. I learned the power of being a fool, of being self-depreciating. As people laughed at me, I saw it as their acceptance. What I had actually done was prime them to note my difference, my mixed-race status, as being something comical, something to decry, deride, and deplore.\n\nI became the class clown and stood to make problems for the sake of other's entertainment. Teachers began to hate me and associate me as a problem child. They suggested mental and learning disabilities despite my high grades due to my parents and their iron fist approach to education. With every letter home, phone call, parent-teacher conference, I would receive a beating from my parents. Slaps in the face, beatings with belts, name calling, screaming in a child's face, bruises on my body. All done for the sake of being accepted by my peers. All for the sake of being loved by someone. I learned that people who love you are allowed to do whatever they want to your body so I let others do what they wanted to me. Friends treated me like a punching bag. At the age of 8 my 13 year-old babysitter blackmailed me into allowing her to rape me. I said nothing, scared more at the idea that I would be in trouble if people knew I had sex because I knew enough to know sex was wrong.\n\nBy the time I was 12 in middle school, I had tried to hurt myself for the first time. I was taken to the guidance counselor because I had told a friend who, doing the right thing, told an adult. In the process, I was treated like I was crazy. I was threatened to be committed because I was a danger to myself. All of this made me feel *different* and I already knew *different* was bad. I knew because of how I felt when people told me I was different. \"What are you?\" \"Who is black?\" \"How did that happen?\" \"Are you \\_\\_\\_\\_\\_\\_\\_\\_?\" The looks of confusion. Even worse was the looks of incredulity, like the fact that I existed couldn't be real. People, regardless of their own race, made me feel so ugly. Ugly because I was different, unique, and beautiful because of my uniqueness.\n\nI knew my parents' union was odd because people told me that. But I didn't know the history of miscegenation in America. I did not know that it was once a crime to be us or to engage in a union that results in the creation of one of us. What I did experience, however, was fetishization as I grew up and became sexually active again. I had a hard time finding someone who thought we had enough of a connection to date one another. When I did, I immediately agreed to date them, I was thirsty for love and affection. But this love was ugly too because it was different. This was even present in friendships. I had friends who told me they would only date black girls because they were black and wanted to have black babies. I had friends who told me I was smart because I was Asian and knew some rap and had rhythm because my mom was Black.\n\nMy girlfriends never, ever brought me home. I was a secret, forever to be hidden. I grew attached to a concept that white girls were the most beautiful. This was partially because of where I grew up but also out of jealousy. White people had such an ownership of their heritage. They knew what they were and forged relationships based on those identities. I wanted so badly to be white. I told my mother that I liked white girls and that in my next life I'd like to be white because they rule the world. My hatred of my blackness stemmed from the fact that society deemed black inferior which led me to believe that my blackness was probably why my interactions with society were so awful. If only I were fully Asian or White and had no blackness to me. I didn't realize it was just because I was mixed. The one girlfriend who took me home only told her family I was Asian. During the death of Eric Garner on Staten Island as racial tensions spilled out onto the streets, I visited her family and had to grimace as they joked about, \"Hands Up, Don't Shoot\". She said nothing. She did nothing. I didn't expect her to.\n\nMy life spiraled out of control as I got older and race became more important as a qualifier in making connections with people. I fell in deep love with a girl from a family who practiced the Islamic faith. She had difficulties accepting her role in the religion and found solace in me, a person with no ties to any culture because my culture was so shattered by my being multiracial. She would often tell me how \"cool\" it was that I was Black and Asian. How \"attractive\" it was. I didn't know what she was doing was fetishizing me, I was desperate to believe she loved me. After a few years, the relationship fell apart and, again, it was because I was different. This time, however, I knew it was because of my race. I never hated myself so much in my life. I cursed myself and my family, I wished I could be one thing.\n\nI drank a lot after the breakup. I wanted to die. I woke up face down in the gutter one night after binge-drinking. I tried to slice my wrists in my backyard, then I tried to fall on the knife. I tried to jump off the overpass by my house into traffic. I wanted my death to be certain. I gained so much weight my heartbeat became erratic. I was smoking a pack a day and developed a wheeze. I hated myself, I needed to punish myself. I fought my father, I ran away from home and became homeless. I hurt and hurt and hurt because love seemed impossible because acceptance was impossible.\n\nI became a teacher. First in Bed-Stuy, Brooklyn where my students, forever ready to curse me out and let me know when I wasn't being \"fair\", accepted me. Almost instantly. They asked what I was, were relieved when they heard \"Black\" because they knew we shared something common, and then made me one of their own. They joked with me, told me gossip, shared their fears, shared their dreams and their emotions. They asked me to share my stories and for the first time, **ever**, someone wanted to truly know me. Now I teach in the South Bronx where my students have yet to ask me what I am. Because it does not matter to them.\n\nI began a journey to heal. I lost weight though exercise, something I was so hesitant to do because I hated myself and wanted to die. I took a road trip from NY to Georgia, across to New Orleans, Louisiana then to Texas, then Cali. I got to see the Pacific Ocean and looked across to imagine my father's country. We drove back and I was refreshed with a new look on life. I educated myself on race relations in America as BLM became a massive presence following the death of George Floyd and learned to love my blackness. I attended my first protest on Staten Island with BLM and learned the importance of being outspoken. I learned to love myself and I learned how to share that love with others. I challenged my perceptions of education and decided to dedicate my life towards bringing a sense of ownership when it comes to science for BIPOC students. By providing students with a more hands-on experience, they learn that science is a gift for all humanity in the form of a community, one that it is honorable to be a part of. I have since been selected to work on a committee that brings more diversity toward l\n\n**The Movement**\n\nThrough my research, I have become extremely disillusioned with the lack of support provided to people of mixed race. I grew up with no one to turn to, no one to help me unpack the burden of being an oddity to society. I left social media, angry, vowing to never use it again because I didn't want to interact with a society that could not accept me. I likened it to being desperate, to chasing the desire to belong to something that has no desire to accept me.\n\nI fell upon Beverly Daniel Tatum's national bestseller, \"Why Are All The Black Kids Sitting Together In The Cafeteria?\" and noted that it was revised and updated. I had never had interest in reading this book before, despite it being mentioned in conversations with friends, teachers, etc. I did not belong to the black culture and so social issues of segregation were particularly damning to me. How could I sympathize with a culture that told me I wasn't black or black enough? At least they had one another in their culture to lean on. I had no one, I felt. In the revised edition, Dr. Tatum places attention to the role that Multiracial families bring to a discussion of race relations in America. Yet, in one fell swoop, she manages to disenfranchise me and other mixed-raced people, \"Given the unique historical and contemporary context, it is the biracial identity development of children of Black and White parents that I will focus on here.\" (Tatum, 304) I was not even enough to garner attention by a champion of Civil Rights and Equality in a book that was groundbreaking in its ability to unpack race relations in my country. I began to wonder how many other mixed-race people felt this way.\n\nI realized that we are under-represented and our lack of support allows us to be targets for confusion. It is this confusion to what we are, to how people treat us, that results in self-hatred, self-depreciation, self-loathing, and self-harm. And we cannot wait for others to be our voice because we are in need. As more attention is being placed towards identifying racism throughout the world, we need to be vocal, we need to stand to let people know: WE ARE THE DISENFRANCHISED TOO. WE ARE PEOPLE TOO.\n\nAnd that has been the movement I've been slowly pushing over social media. I want it to take off. I want us to unify and represent a community that has lacked a true community for so long. #wearepeopletoo\n\nAs people, we deserve to be treated like others. This means we deserve the freedom to be equals in society. We deserve to walk down the street or to make a new friendship without being asked for our race or ethnicity because #wearepeopletoo. We deserve to love and be loved not fetishized because #wearepeopletoo. We deserve to feel like we belong in our families, in our schools, in our government, in our country because #wearepeopletoo.\n\nRight now, the movement is just a hashtag. But even the largest movements begin somewhere. I will not pretend to know what I am doing. I will not pretend to be a leader or to stand as someone to look up to. I believe that this movement needs to be decentralized. No single leader, just a group of people, human beings, who see the need for a change. Right now I am using IG to push the hashtag but I want to begin moving to other platforms, putting out writing, establishing a website. I hoped we could establish [r/mixedrace](https://www.reddit.com/r/mixedrace) as a basis for a headquarters or begin to discuss a place to brainstorm. I stand with all people of the world and I want them to begin to see us as people too. #wearepeopletoo I know I need help, I need teammates and a community to support and be supported by. Even now as I tell people my idea for this movement they tell me I am being divisive, that I am causing more division in the world. But this was division that was forced on me, not one that I created. My goal is to end this division. I share that belief, that one they call utopic, that the world will be better when we see ourselves as one race: the human race.\n\nThank you for hearing me out,\n\nDae",
    "title": "#WeArePeopleToo: A Proposal for a New Movement",
    "subreddit": "asianamerican",
    "timestamp": 1614137067,
    "score": 13,
    "keyword": "mixed race ceo"
  },
  {
    "text": "The Modern Feminist Movement Is Damaging My Husband. RANT Sorry for the rant. I just needed to get this out...\nI 30f have been with my husband 31m for the past 15 years and I've seen a drastic change in him within the past 2ish years but I would say that start was around 2017 when the whole #metoo movement started. When the movement got big he really started hyper analyzing every. single. thing. Everything, from years past sexual experiences to (then) present day, little communication faux pas. \nHe categorized some things as straight up rape, which he still holds to this day. It breaks my heart that this man carries around this guilt of RAPE against ME for which he never even committed. \nI'm so fucking sick of women. \nI grew up with an selfish, alcoholic mother who abused us and a father who worked himself to death for us and was never appreciated by her.(She passed in a DUI accident when I was 13) \nSo, I was primarily raised by father and had a male dominant household with an older brother and his friends over in constant rotation. I grew up a bit of a misogynist and I was always aware of the constant double standards that society places on both of our genders.\nI watched my husband get treated as a pack mule, grunt, laborer by his parents merely for being a boy. While his sister got to sit on her ass and had to do jack shit.... \nWomen you want to pickup a fucking broom? Then you need to pickup a rake. I always helped my husband move heavy objects, and do work 'meant for men's if I was able.\nWe put all the onus on men for everything and everything that's wrong. 'Men rule the world' 'Men start wars' idk about you guys but I know my sweet, gentle man isn't responsible for any declarations of war and none of the males in my life are CEOs or multimillionaires.\nMen get bitched at for not cleaning up the household but I never heard of any women get chastised for not mowing the lawn. Completely omitting the fact that jobs are spilt by gender beginning with chores as children. Men have to be taught things too, I didn't know how to use the weed eater until he taught me. \nMore and more responsibilities are being put on men and it's only a matter of time before they start to crack. The societal exchange/contract between men and women is severely broken and to be frank idk if it can ever truly be fixed. \nIMHO (I apologize if I offend, this is just my opinion) the sexes are NOT equal and they NEVER were. In earlier times women were responsible for child rearing, food preparation and homesteading while men were responsible for hunting, warfare, ceremony and protection. That's as 'equal' as we're ever going to get. Men had the most important job, to provide food for the tribe and we cannot survive without sustenance. Yes, childcare is important to the human race and tanning hides and stuff was difficult but you're not actually putting your life on the line. If  you take everything away, and have a man and woman obviously women are the 'least dominant' sex because most men can physically best most women. \nSo, feminist need to just stfu and realize that nature holds the cards and noone picks the hand they're dealt. I'm all for equality but it has to be EQUAL \nMen carry all the pressure, all the weight without even a goddamn thank you. Men are treated like their very lives are worth nothing and can be wasted. While women are treated as beautiful,life givers as if men have no part in bringing children into the world.\nMy husband won't even talk to me anymore about the things bothering him anymore because he's afraid I'm going to think less of him and leave. I was his one outlet in the whole world and I've watched him recede into himself while femnazis got into his head. I enjoy performing my traditional gender roles, I like cleaning and cooking and making his lunches I like nuturing him. I want to treat him as king because he treats me as a queen. Now, he's stressed over every little minute chore. He thinks that I'll think of myself as his mom or something? No, ik I do most of the household chores but I know that he'll protect me with his very life if he needed too. The least I can do is make the man a fucking sandwich. \nI've watched him take more and more on his shoulders every single year and I'm just waiting for the day he can't carry it anymore. I miss my husband and I miss the implicit trust we shared. He's changing and I bet he's not the only one.\nIt makes me dislike women, and hate feminism it reminds me of my mother, always selfish and constantly greedy asking for more and more while never grasping how good they actually have it.",
    "title": "The Modern Feminist Movement Is Damaging My Husband. RANT",
    "subreddit": "MensRights",
    "timestamp": 1637992753,
    "score": 508,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "title": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "subreddit": "MensRights",
    "timestamp": 1636492585,
    "score": 384,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I hate my woke school board My friend showed me this sub and I've been really tempted to post on it, so here I am. This is just a throwaway account because I'm scared of what would happen if I posted this on my main. I hate the fact that now people need to be careful about sharing their real opinions.\n\nI'm a 15-year-old girl in grade 10 and I'm fed up with this feminism shit in school. (and before you point it out, yes I know it's ironic that I'm making this post as a female). A lot of the subjects in my school are dominated with social justice and I hate it. English is the worst of all because my teacher is a social justice warrior and always talks about feminism and race insensitively (also making racist remarks about her fellow white people lol) in front of the whole class. EVERY single start of the class she talks about feminism and how girls are poor little victims, their rights are being disrespected, blah blah blah. I fucking hate it. I'm someone who's victimized for both my race and my gender and I hate it so much.\n\nLast month we started reading books. ALL of the options were about social justice. She was like \"It's better if I let you chose a book, rather than if I just handed you a book by an old dead white guy\" (yes, she really said that). Pretty much all the books had an \"important message\" in them, so I chose a book that seemed to be the least like it would be full of social justice. Turns out the entire fucking book is a message about feminism (as well as racism), the two subjects that bother me more than anything. (The book is called \"Monday's Not Coming\" if you dare to touch it)\n\nWell anyway, I was reading a part of a section today for my school work and so basically some girl is invited to a sleepover with other girls. The sleepover takes an unexpected turn that the main character didn't expect and she ends up going to a party and getting drunk. I PREDICTED what would happen next, and I hate that. Some guy sexually assaults her, of course. Fuck that book. Fuck my life. Fuck everything.\n\n&#x200B;\n\nI can't even express my anger in words. I don't even know how to properly end this post but it's just great being victimized for your gender and your race :) (I'm mixed by the way). I hate it how the sjws portray women as \"poor little victims aww omg r u ok :'''( oJHDJGSHJVD ARWJKUD GUSKDBM HJKFWSGJdb,hgajfuckingshootme\"\n\na\n\nwxdquodhkfjvsgfxe\n\nd d\n\necfwd\n\nfwxv\n\n&#x200B;\n\nI am going to have a meltdown\n\nOkay, that's my vent. Bye.",
    "title": "I hate my woke school board",
    "subreddit": "MensRights",
    "timestamp": 1619114505,
    "score": 36,
    "keyword": "mixed race ceo"
  }
]