[
  {
    "text": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2] Hey r/jobs, it's me again, coming at you with all of the resume advice you could ever need, and more! I posted all of my resume tips and tricks a couple of months back, which led me to receiving an amazingly overwhelming amount of comments (THANK YOU!) and I wanted to clear up some things, and include some things I missed in my last post. I've put all of this advice in order so it's easy to find the info you need when you need it.\n\nTo introduce myself, my name is Holly, and I am an experienced resume writer and editor located in North America. Essentially, I love helping people make their resume the best it can be, and I often help out in the r/jobs discord, and a tech workers slack channel, giving free advice as often as I am able to.\n\nResume writing and editing has been a part time hobby/job for me since 2017. I work full time as a senior account manager in tech, plus I have a bunch of hobbies outside of work, so I give my time where I can, which is unfortunately not as much as it used to be. I guess that's why I've written these posts, because I can no longer help as many people as I used to, and hopefully this way it can assist hundreds or even thousands of people!\n\n***DISCLAIMER: Many of these tips are North America specific,*** ***and some/many don't apply to creative fields like designers/marketing resumes.*** *Also some of these are for people working in the corporate world and don't apply to food service or retail jobs.* ***Of course, some of these won't apply to you specifically, so use your common sense to take what is useful to you.***\n\n~\n\n# CONTACT INFORMATION AND TOP OF PAGE\n\n* **Contact details** \\- at the top when of your resume under or next to your name, you need to include the following things: your location (if you're willing to relocate to the area the job is in, put the jobs city in and not your current location) email address, and your LinkedIn profile. Phone number isn't essential, so include it or don't, it's fine. Other optional things to include - if you have a portfolio or GitHub, definitely include them. Don't paste them as a messy link, instead write \"GitHub\" and turn it into a hyperlink.\n* **Location:** Are you located in San Francisco, California, applying to jobs in your city, and/or remote? Write \"San Francisco, CA\".\n* **Location:** Are you in San Fran, but open to relocation, AT THEIR EXPENSE? Write \"San Francisco, CA (open to relocation)\".\n* **Location:** Are you in San Francisco currently, but you're willing to move **before** starting a new job to New York AT YOUR OWN EXPENSE, where your dream job is located? Or you've already planned to move to New York and you're only applying to roles there? Put your location as \"New York, NY\". Why? Because you're moving there on your own cost prior to starting work, at your own expense.  If it comes up in the interview, tell them the truth. \"This is my dream job and I'm planning to move prior to starting if I'm successful\", or \"I'm moving to New York on X-date - which is prior to the start date of this job - and everything is already organized, which is why I have my location listed as New York rather than San Francisco.\"\n   * If you want them to pay for your relocation fees, then use the (open to relocation) that I wrote above.\n* **DO NOT INCLUDE YOUR FULL ADDRESS IF YOU'RE IN NORTH AMERICA** \\- only include your City and State/Province, and use one of the above depending on your circumstances.\n* **Contact details (what not to include)** \\- don't include the word PHONE before your phone number, or EMAIL before your email address. They are not necessary. People know what a phone and email look like. You're just taking up space for no reason. Also don't include your social media accounts except for LinkedIn (unless they are professional accounts for marketing/design/media positions of course, etc.).\n* **LinkedIn link and info:** Make sure your LinkedIn profile link is customized. You can get a custom LinkedIn link from your LinkedIn profile on the right hand side at the top right, click on \"Edit public profile and URL\". Make sure your custom LI link includes your name and not just a bunch of random numbers. Be creative. Are you a John Smith and you're located in Texas? Maybe your custom link could be smith.john.tx or johnsmith.tx, or include your middle initial. Play around with it until you get the perfect LI custom link. When including your LinkedIn link on your profile, instead of including the whole URL, only include the last bit (for example, **in/johnsmith**) - and lastly, make sure you include the hyperlink on your resume so that people can click it while viewing your resume.\n* Do the same as above with GitHub or any other professional links you're including on your resume. Make it a hyperlink so you're not including some messy link that's killing the \"feng shui\" of your resume.\n* **DO NOT INCLUDE A PHOTO OF YOURSELF IF YOU'RE APPLYING TO JOBS IN NORTH AMERICA.** Companies have to prove that their hiring processes isn't based on race, gender, age, appearance, etc. Including a picture in NA can actually get your resume thrown out entirely. I know LinkedIn profiles include your profile picture, which is weird that we're just okay with this, but not with pictures on resumes, but here we are. Hey, I don't make up the rules, I merely abide by them and am here to ensure your resume is, *\\*chefs kiss\\**, perfectly formatted.\n* **Summary/Objective - to add or not to add?** I only recommend adding one if you're making a career move/change, and applying for jobs that aren't in your career ladder. The other alternative is if you've been out of your industry for a while, either studying or working in a completely different field, or if you took a break and need to explain the gap in work. I believe a summary should be no longer than 5 lines of the page maximum, which is typically around 3-4 sentences. You don't need a summary if you're looking for jobs on your current career ladder and don't have any gaps on your resume.\n\n# HOW TO ORGANIZE YOUR RESUME (IN ORDER)\n\n* If you HAVE had relevant experience since your education, then put your professional experience first. DO NOT INCLUDE YOUR HIGH SCHOOL EDUCATION (unless you're still in high school, or are looking for your first or second job out of highschool, or if you don't have university to add to it and you have less than 2 years of work experience). So it would go like:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it) 3. Experience 4. Education & Certifications 5. Projects (if you have any you want to add, and the space to add them, or simply link to your GitHub or LinkedIn and list them there) 6. Skills 7. Volunteering - if it's going to assist with your current career, or if you have the space for it 8. Languages spoken (only add this if you speak more than one language fluently) 9. Interests (if you have the space and want to add them)\n* If you HAVEN'T had relevant experience and your education was in the past 1-3 years and it's relevant to your job, then:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it - I do recommend it here to explain the direction you're heading) 3. Education & Certifications 4. Projects (if you have any) 5. Skills 6. Volunteering (if you have any) 7. Languages spoken (only add this if you speak more than one language fluently) 8. Interests\n* Basically, just put the best most recent and relevant info at the top that relates to the jobs you're applying to, and mark it in order from there.\n\n# ONE PAGE OR TWO?\n\nAh I love this question, people get so heated about it haha! There's a lot of variables and a lot of opinions on this, so let's get into it...\n\n* FIRST THINGS FIRST - If you're going to go to 2 pages, for the love of the flying spaghetti monster, DO NOT, I REPEAT DO NOT have it as less than 1.5 pages. If you're commiting to 2 pages, USE THE SECOND PAGE. Beef up some bullet points, make some of the text or the lines larger, whatever you need to do if you're absolutely convinced it will not fit on one page. Otherwise, REDUCE that bad boy to 1 page. Nothing quite grinds my gears as much as seeing an 8th of the second page being used. IT LOOKS AWFUL, REALLY REALLY AWFUL. Thanks for letting me get that off my chest.\n* Unless you're in senior management, your resume (for North American applicants anyway) should be one page ideally, two pages max if you have over 10 years of RELEVANT experience, but in saying that...\n* Do you have LESS than 10 years of university and work experience combined, and you're NOT in a high up VP/Director position? You are likely best to go with one page.\n* No education after highschool, but you've got 10 years or less of really amazing experience, but not in a higher up position? You are likely best to go with one page.\n* Do you have LESS than 10 years of university and work experience combined but you also have a few AMAZING projects you worked on separately, and you've done relevant volunteer work, and your resume is actually kind of incredible? Then hell yeah, go for 2 pages! Brag all you want and show them why they need to hire you!\n* I could go on. Just one page or two, either way, ensure you use the full page if you've got it, I hate seeing only 1.5 pages or less. Either bring it closer to 2, or bring it down to 1.\n* **\"What about 3 pages, or 4, or 5? I have so many jobs and I'm awesome and want to show them!\" In North America, NO, GET OUT OF HERE, ABSOLUTELY NOT!** They won't see it as \"Wow this person is amazing\", they will see it as \"Oh wow this person doesn't know how to write a resume, and this is way too long for me to bother to read\" and they'll delete it. In other parts of the world? Sure. I know some countries like the UK for instance that want a full CV (they are different from resumes, as they list every single job, achievement, certification, volunteer experience, and more) that are often 3+ pages long. Well, my advice isn't for UK resumes, because that's not my specialty. I'm just saying that 2 is the max for North America.\n* Need to find extra space on your resume to reduce it down to 1 or 2 pages? **Use narrow margins.**\n* **SO ONE PAGE OR TWO?** Honestly, either is fine if you're using the space efficiently, and aren't writing giant bullet points and paragraphs. ***If you're unsure, go for one page.***\n\n# GENERAL FORMATTING\n\n* **Make sure EVERYTHING is uniform**. If most of your dates are 3 letters only, like Jun 2016 - Oct 2020, then they ALL need to be the same. Yes, even the months of June and July with just one more letter. It looks much neater. Ensure you double check the spacing is correct too, for example, the most common error I see on resumes is some dates having a space and then a hyphen, and then no space before the next date (example Jan 2019 -Jun 2020 and then Jul 2020-Feb 2022, then Apr 2022 - Present) - this is a very small issue, but it shows you do not have attention to detail. Whichever format you choose for one, ensure they ALL follow the same format.\n* Double check if something is bolded, or underlined (like a title or date or company name), ensure that all the others are in the same format.\n* Is the font the same for each section? It's fine if you're using different fonts on your resume, but ensure that each section is the same. For example, if one job with all the bullet points are Times New Roman, then all jobs needs to be in Times New Roman. If one section header is Garamond, and the next section header is Times New Roman, it shows you don't have the attention to detail.\n* **Remember, your resume needs to be PERFECT. You seriously need to go through each line by line with a fine tooth comb.** Imagine not securing an interview with your dream job because of a few silly spelling mistakes or poor formatting. \"Well I didn't want that job anyway\"... yeah you did. It can be a hard pill to swallow and it's easy to make light of it, but you never know who is the one deciding on the yes or no pile and where yours will land.\n* **Ensure all line breaks are the same size**. If one blank line in between 2 paragraphs is size 7, and then the next blank line between paragraphs is size 11, it's a very noticeable detail to those looking at your resume.\n* **For your paragraphs and bullet points, use the \"justify\" align**. It removes a bit of the white space and brings your text fully to the right of the page. It's much neater and removes the jagged look of left align. The exception to this (as there usually are) is if none of your bullet points are longer than one line. I like justify align on a summary/objective if you're adding one, and on bullet points or any paragraphs that are 2 lines or longer. Play around with it and see what works best for your resume.\n* **DON'T WASTE AN ENTIRE LINE ON A HANDFUL OF WORDS!** I often see people when writing their bullet points taking up less than half a line, or only a couple of words on the 2nd or 3rd line. Not only does this create a lot of white space, but it's also selling yourself short. You have one, maybe two pages to sell the sh!t out of yourself. Make every single line of your page count. Make sure every single line of your bullet points is at least halfway across the page or more. Either beef up that bullet point, or condense it.\n* **5 bullet points max per job** (of course there are exceptions, but this is as a general rule). The older the job, the less bullet points. A job from 10 years ago will only require 1-3 bullet points (and only if it's relevant to your current career. Really think hard about whether to include it on your resume or not. Remember, all your jobs are on LinkedIn, not everything needs to go on your resume... again, North American advice).\n* **Use a different verb at the start of each bullet point.** I roll my eyes when I see the same word repeated multiple times as the first word in bullet points. Instead of just using the word managed, use words like Coordinated / Directed / Orchestrated / Oversaw / Spearheaded. There's a great article written by the Muse, you can find it here: [https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome](https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome). If you work in a field with specific wording, like Nursing for example, then google \"Nursing resume verbs\" or something like that. Put the work in to your research for your resume wording and you'll reap the rewards.\n* **DO NOT USE COLUMNS** (unless you're in a creative field like a designer, or your resume is being handed to someone in person) - Columns do not play nicely with ATS (AI resume reading software) and as the majority of companies now rely on ATS to quickly read resumes, you're shooting yourself in the foot by using columns or any other weird formatting.\n* Each bullet point should not be paragraphs long. Each bullet point should be 1-2 lines long only on the page, 3 maximum.\n* Each job should take up no more than 1/4 of the page, unless you've only had one or two jobs, or are more senior. Or in another unit of measurement, no more than 11 or 12 lines of the page. The more recent the role, and the more impressive the tasks, the more bullet points there should be, but don't just include the job description which leads me onto my next point...\n* Reiterating that each job should only include the achievements from that job, and only the most impressive things you achieved should be listed. Include KPIs, processes you implemented, articles you wrote, dollar amounts of your biggest sales or averages, include numbers of accounts you managed, or how many calls you took each day, if you went over your OTE what was the percentage, etc. It shouldn't read as a job description, you need to sell yourself and show them what you're capable of! (disclaimer - unless your jobs are more entry level or food service etc, then job descriptions are likely the norm).\n* Don't include irrelevant jobs/projects. If you worked at Starbucks for 6 months 5 years back, and you've had relevant experience in your field after that, then remove the Starbucks (or whatever other unrelated jobs you have) from your resume. Your resume should be tailored to the jobs you're applying for! To give you some more reference, I have been working since 2003, and my resume only has jobs from 2014 onwards.\n* **Try to have your dates on the right hand side of the page, and your position and company on the left (list the position first, then the company next to it or below it).** It's the standard, and makes the person reading your resume find the info much more quickly. Trying to make your resume too unique (again, unless you have a creative job then ignore this) will only hurt your chances of it being taken seriously. Of course you want to make it look nice, but try to follow the standard format where possible so it's easy to read.\n\n# SKILLS & INTERESTS\n\n* **Put your technical/software/program skills in one line**, separated by commas or | lines | like | these. Putting a single skill on each line is a waste of space, and will create too much white space. Your resume should be concise, to the point and get everything across in as little space as possible.\n* **Don't use the \"slider\" scales for your proficiency in various skills.** Why? Well, firstly, if the hiring manager wants to know your level in each, they will ask. And secondly, the dots or slider scales aren't measurable and take up extra wasted space that again is not going work well with ATS. Instead, as I mentioned above, list your skills and programs/software etc. in a line separated by commas | or | these | lines. Don't include software that you used 10 years ago and never progressed past a beginner level, but list pretty much everything else within reason. Most things you'll pick back up quickly even if it was 5 years ago, provided you were semi-decent with your knowledge of it.\n* What about interpersonal skills? Should you add them? I highly recommend adding them into your bullet points, rather than listing them separately. In saying that, though, there's going to be some industries, or some skills, that require them listed separately. If you're listing them separately, first ensure that you actually need them on the resume, and which ones are necessary and which ones can be removed if any. If you're still adament you want to list them separately, then put them in the same format as your technical/software skills as I listed above, either separating each with the | lines | like | these, or with commas, one on line. And that line needs to go below the hard/tech/software skills, not before, and ideally not together.\n* **Languages:** In North America, only list a languages section if you speak more than one language. Always list English first as this is a job requirement every time, and then other languages after that. If you're fluent in English, a native in Spanish, fluent in French, and have intermediate German, I would list it as such:\n   * \"Languages: Fluent in English, Spanish and French, intermediate in German.\"\n* **Interests - should you add them or not?** It's a highly debated topic and everyone will have a different view on this. I personally believe that you should include them. For example, I ride motorcycles and love stand up comedy shows, am coffee obsessed and love my local lacrosse team. Almost every single interview I land, my interests are brought up, with the interviewer connecting with one or more of my interests, or asking me more about them. It's a great conversation starter, and it makes you more than just an applicant, they will remember you as the person who they discussed their favourite sports team with, or the person who recommended them an amazing cafe that they've now added to their list. INTERESTS WILL MAKE YOU STAND OUT, I guarantee it. **Obviously, it can be negative depending on what you write, so be REALLY selective of what you include in your interests** (for example, don't include things like Anime or Manga, or the shooting range, or reading Holocaust novels, or your weapons collection, or anything political or religious, or anything you don't want to discuss during an interview - KEEP IT LIGHTHEARTED). I would make your interests 1 or 2 lines maximum on your resume, and don't go into detail (just list them out - for example, my interests on my resume are listed as \"Interests: Motorcycles, Warriors lacrosse, console and PC games, comedy shows, arcades, & searching for the perfect espresso.\") So basically, include them if you want, but if you do include them, make sure they aren't negative or controversial topics if it's brought up in an interview.\n\n# AVOID COMMON MISTAKES\n\n* \"References available upon request\" or adding references to your resume, is a BIG no no for North American resumes. Why? Because 1. it's assumed that you have references available on request, so including that is unnecessary, and 2. You don't want the company contacting your references if you've listed them, PRIOR to letting your bosses know, which is usually after you've received an offer, and 3. You don't want your references, whom have so kindly agreed to be one for you, getting inundated with calls or emails from the companies you're applying to, prior to the offer stage. Imagine applying to 50 companies, and all 50 call your references. Ouch. They won't be your reference for much longer.\n* Is your job across two pages? Nope, that's not going to work! I hate when I see a jobs bullet points going onto the next page. In my opinion, it's messy and just says \"poor formatting\".\n* **DO NOT MAKE YOUR RESUME TOO FLASHY! STOP WITH THE COLOURED TEXT!!** (this applies to non-design resumes only) Black text ONLY, with the exception of your name, contact information and section headers. You can put those in a colour other than black for a tiny bit of a \"pop\", but nothing overly in your face like red or bright pink. I personally use a dark blue, or dark green, or dark purple for the contact info and headers - DO NOT USE LIGHT COLOURS if you're going to use any at all. But objective/experience/skills/education etc, all the actual sections (not section headers) must be black text ONLY.\n* You absolutely should not have any images, and there should NOT be any background colour or background images whatsoever.\n* Do not use tables on your resume. That won't pass ATS and it looks pretty bad honestly.\n* Don't include a paragraph at the end along the lines of \"thanks for your time, please call me on 555-123-4567 if you have any questions or would like to set up an interview\". This isn't a cover letter. And even if it was, don't include your phone numebr or email in the cover letter body, that should be included with your contact details at the top of your cover letter, which should match the same format of your resume.\n* If you're going onto a second page, include the exact same name and contact information format as you have on your first (and other pages if outside of the US where more than 2 pages is common).\n\n# FINAL STEPS - SENDING YOUR RESUME\n\n* **NAMING YOUR RESUME:** And I'm not talking about naming him Resume McResumeface. Your resume name should be \"Firstname Lastname Resume\". Don't include the job title on there, or any periods, underscores, or any other information. \"J\\_Smith Customer Support Rep. Resume V2 Final\" is everything wrong with a resume title. I hear you asking, \"But holly948, how do I have multiple resumes then for the different jobs I'm applying to?\".\n* **ALWAYS SEND YOUR RESUME AS A PDF DOCUMENT!!** If you send it through as a Word document, their computer could mess with the formatting and it could ruin the perfect look of your resume. PDF will ensure they view it exactly how you have designed it to look. Sending through as a Word doc could ruin all of the hard work you put into the formatting. Devastating!\n\n# COVER LETTERS\n\nI'm sorry that's not my area, and I loath cover letters with a passion. Write them or don't, whatever. I personally never write cover letters as I find they are a waste of my time.\n\n# AKSHUALLY...\n\nLastly, I hear many of you about to furiously get into the comments with \"but my experience was...\" and \"in my opinion, you should...\", and \"actually, I think...\" and I get it! There is no \"one perfect way\" and everyone has different opinions. **This entire write up is in MY opinion and MY experience.** I'm not saying don't comment, just, please take this post as my opinion rather than \"it must be done exactly how I say or else you're never getting a job and your resume sucks\". Do whatever you want, man. Different things work for different companies and industries. This is my own general advice, and I know with resumes there is no \"one size fits all\". No two resumes I do are the same, because it comes down to the individuals experience, education, interests, what they're applying to and so many other factors. I'm just giving free advice from my own experience, in my own opinion, to serve the majority of people updating their resumes (primarily in North America).\n\n\\~\n\n**TL;DR** \\- **if you want to improve your resume, then I've given you everything you need minus the template.** **However, I'm doing up a template at the moment, and will share with you all, hopefully this weekend.** I want to give you all of the tools you need to succeed.\n\n*Enjoyed my advice from this post and/or the last? You can buy me a coffee!* [*https://www.buymeacoffee.com/holly948*](https://www.buymeacoffee.com/holly948)\n\nI sincerely hope this has helped, and I wish you all the best of luck in your job searches!",
    "title": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2]",
    "subreddit": "jobs",
    "timestamp": 1676641102,
    "score": 22,
    "keyword": "mixed race director"
  },
  {
    "text": "Got fired from a high paying job for my industry and now it feels like I'm starting from scratch Hi all, \nI wanted to share my recent story to get some views on it. At the end of November of this year (2023) I was \"let go without cause\" from a Director position a held at a community health service for 1.5 years. \n\nI had a bit of a unconventional progression to that position. I only started my career in health services in 2017 after graduating from a 2 year community college diploma. My employers over the last few years saw great leadership potential and I quickly found myself in managerial roles. When I went to the place I got fired from, I entered as a manager and was promoted to director after 8 months of strong work. I had great working relationships with my senior leaders and the 150+ staff that reported to me in my division. I never missed a deadline, had a performance issue, or anything. I would say the only thing that created uncertainty about me was my age in comparison to my younger counterparts, it's something my CEO would always refer to. I'm also now 30 years old.\n\nTBH the reason I got fired escaped me for awhile, but I think it was a misinterpretation of something I did. I had been given a project to transition some tenants from a house and set them up in new accommodations so we could sell the house they were in, I was given a ridiculously short deadline of 4 weeks to make it all happen and we did. On the moving day we had contracted a moving service - they did great work and had to be paid of course. I was working from home that day and left my manager and her team to oversee the move, but when it came time for paying the vendor, they claimed they couldn't accept electronic funds or credit payments so we had to come up with $350+ in cash. I couldn't ask my manager or frontline workers to front this so I went there myself, withdrew the cash from my account and paid the movers - job done... I figured I'd just claim it on my expenses. I didn't go to any of the worksites or interact with any of the staff or clients, however my bosses were aware I was sick and WFH that day. Of course in healthcare, COVID scares are still strong sooooo when I come in Monday, half way through the day I was served my termination papers and escorted out of the building. \n\nIt really sucked, as I felt like I did so much for the company to the point where Ive fronted operational expenses on multiple occasions (never again). I get it, as a director I should have led by example and not show up to work - but I felt it was for a good reason to pay our vendors. Overall I dont know if this was the true reason, as I wasn't given one at the point of termination. \n\nAnyhow... I start a new job today. It has a 10k pay cut and a drop in title to \"senior manager\" but the organization seems ok. I desperately took this job to be able to keep income coming, but I also believe in the good of the program and operation I've been hired to lead. My current employer tells me that they only ask for at minimum 1 year of commitment to the role, knowing that my skills and competency exceeds the value of the position; I found this very courteous. \n\nI deeply fear not having the opportunity to climb the career ladder again. Not only because healthcare is taxing and only senior management and up positions really earn good money, but I also am not competitive in the job market with a 2 year diploma. I have a plan to go back to school to finish a BA and put some more work into my breathwork business but as I begin my new role, I can't help but feel hopeless that I'm stuck in this rat race in a low paying industry and if I don't get opportunities like the ones I've cultivated at previous employers then I'll never be able to live my ideal life (house and kids). \n\nHas anyone ever been knocked back in their career but found success later on down the line? How big a role did your age play in it?",
    "title": "Got fired from a high paying job for my industry and now it feels like I'm starting from scratch",
    "subreddit": "jobs",
    "timestamp": 1703686657,
    "score": 19,
    "keyword": "mixed race director"
  },
  {
    "text": "My (F24) job is an extremely toxic environment I currently work as HR for a foreign maid service in New York. By foreign I mean I work with a lot of different ethnicities. For example I work with a lot of Ukrainian and Spanish employees. Currently I am navigating multiple situation that has created a storm of terrible mental health. \n\nMy director is a tyrant. She is consistently out for multiple weeks, and is never in the office. She insists that everyone must work in the office regardless of the situation in the building. there have been multiple situations where the office AC broke, or the bathrooms flooded, and refuses to let us work from home. She will randomly get very upset for no reason. For example she held an meeting with the whole office to tell us that she does not see any passion from the employees. She believe this because she sent out an email and she believe we did not respond with enough urgency. This said email was send at 3:00 pm on Friday and we all responded by 3:30 pm (I responded at 3:08). Her expectations is we respond within the next five minutes. She said that she makes the office comfortable and she can easily take it away from us. I am fed up and so is a majority of staff in the office. At this point we are all on the verge of quitting and I terrified because I do not want to go through another job search. My mental health has been complete trash to the point where my body is numb from all the racism, exclusion, drama and immature behavior not only demonstrated from my boss but from my fellow coworkers. I experience my fellow coworkers getting drunk in the office, excluding employee due to gender, or race. I am stuck in the middle of this because my boss and manager are constantly at odds together. I hate my job and I hate what it has been doing to me mentally. I know even know why I am posting. I think I need to vent and cry. But I feel like my body is so numb that I can not even do that. So I thought maybe I would post on reddit and see what happens.",
    "title": "My (F24) job is an extremely toxic environment",
    "subreddit": "jobs",
    "timestamp": 1681737678,
    "score": 8,
    "keyword": "mixed race director"
  },
  {
    "text": "I kinda just need a pep talk Hey all, I'm a graphic designer, I've been in the field for 7 years. I have the experience needed to be a senior designer or art director but my current employer has already stated they don't plan to promote me in the near future.\n\nI got my portfolio put together, trying to show a diverse level of work (I mostly deal with layout, print, and digital, but I got some motion graphics and branding in there). I also got my LinkedIn updated and my resume.\n\nI've now applied for 78 jobs, with a mix of Senior Designer and Art Director, I haven't gotten a single phone call from a recruiter and I've gotten plenty of \"no\" email's.\n\nI'm just feeling a bit discouraged like the things I'm working on at my current job aren't standing out. I know I'm for sure qualified to be a senior designer, and on paper the job descriptions show that I'm also qualified to be an art director.\n\nI'm just feeling a little deflated, when I applied to my first design role it took 220 applications over 1 year and I only got 4 interviews. I guess I was just hoping that now that I have 7 years experience I would have more of a chance. It's just frustrating because many of these roles are asking for 1-3 years in a leadership role, but how am I supposed to get that experience if experience is a qualification?\n\nAny advice or just words of encouragement means a lot",
    "title": "I kinda just need a pep talk",
    "subreddit": "jobs",
    "timestamp": 1676506995,
    "score": 6,
    "keyword": "mixed race director"
  },
  {
    "text": "Am I Crazy Thinking a 20% Raise for Internal Position is Not Enough? TL;DR: Applied for internal position as credit analyst at our corporate office, got an offer for $60k (20% raise), not sure it's enough given I have to relocate to Dallas TX.  \n\n\n  \nReally looking for some outside perspective on this because I've gotten mixed feedback from friends and family. Also on a throwaway as I'd prefer not to use my account linked to my name.  \n\n\n  \nFor some background, I currently work as a cash applications/AR Specialist for our company's regional office in Phoenix, AZ. I have been in this position almost exactly one year and my current compensation is $23/hr plus medical, dental, 401K and PTO. I get maybe a few hours OT pay around month end and I also have a bonus structure related to A/R and collections metrics. I do have my BBA in Finance and two years experience in a previous company doing similar work. Frankly I feel currently underutilized/underpaid, so about a month ago I started looking at jobs. Last week I actually glanced at internal opportunities and saw a credit analyst position open at our main office in Dallas TX. I had met the director/hiring manager for this position, so I reached out individually to her and long story short we cruised through an application and interview into a job offer.  \n\n\n  \nSo here's the thing - part of the application process I was asked for desired compensation. I put $66k thinking I'd probably end up around 63-65. In the interview, my hiring manager mentioned a range of 60-65, which I said was acceptable and we can talk about it more if/when an offer comes. Well, of course the offer comes in at $60k. The reason I was given for this is that apparently HR's policy is that they can't offer more than a 20% raise to internal candidates regardless of role. I don't really know how true that is but that's the reason I was given. I asked about relocation assistance and it's also unavailable for this position. With that in mind, on Friday morning I submitted a formal counter of $63k, noting some examples of my work and my performance metrics in areas where I've had impact.  \n\n\n  \nSo am I crazy for thinking $60k isn't enough here? I'd keep my current benefits structure (and add one day/week WFH, currently in office every day) but obviously I need to relocate and I'm stepping into a much more demanding role. Of course it's a significant raise and it's a far more desirable role for me personally, yet I still have this nagging feeling I'm getting the short end of the stick. I also feel petty haggling over a few grand but the percentage increases at this point in my career are really important. If they come back on Monday with no changes, I'm still leaning towards doing it but I just can't shake the idea it's not enough. What do you think?",
    "title": "Am I Crazy Thinking a 20% Raise for Internal Position is Not Enough?",
    "subreddit": "jobs",
    "timestamp": 1694900641,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "2024 MS Grad Seeking Career Advice - When to apply for jobs with June 1 start? Where do my skills fit best? Looking for general advice on when to start applying for full time employment with a start date of June 1, how to network - MS grad student graduating May 2024  \na) interested in tech, management, economic, sustainability consulting / think tank / research type work  \nb) looking for full-time post grad school employment, finishing up my Master of Science in Applied Economics and a Graduate Certificate in Community Resilience and Planning May 2024, BA with Honors in Geography and Geospatial Technologies graduated May 2023 (finishing my Masters and Bachelors in 4 years total)  \nc) geography: currently attending the University of Vermont in the US, looking for employment in Midwestern US (Chicago, Detroit, Minneapolis, etc)  \nd) résumé    \nEDUCATION  \nMaster of Science. 2024. Community Development and Applied Economics, University of Vermont. GPA: 3.88/4.0  \nCertificate of Graduate Study. 2024. Community Resilience and Planning, University of Vermont. GPA: 4.0/4.0  \nBachelor of Arts with Honors. 2023. Geography, Geospatial Technologies, Honors College, University of Vermont. GPA: 3.89/4.0\n\nRESEARCH ASSISTANTSHIPS  \nGraduate Research Assistant, Community Development and Applied Economics,  2022 – 2024.  \nGeographic Information Systems Technician, Spatial Analysis Lab. 2021 - 2022   \nTechnical Research Assistant, Geography, 2021.\n\nTEACHING ASSISTANTSHIPS  \nGraduate Service-Learning Community Partner Coordinator, PA 6170: Systems Analysis and Strategic Management, 2024 \\*\\*accepted to position starting January 2024  \nGraduate Teaching Assistant, CDAE 002: World, Food, Population and Development, 2023.  \nUndergraduate Teaching Assistant, GEOG 060: Geography/Race and Ethnicity in the United States, 2023.\n\n  \nRESEARCH  \nApplication of Social, Economic, and Behavioral Science to Water Resources Prediction, Cooperative Institute for Research to Operations in Hydrology (CIROH). 2022 – 2024.  \nContributed to the development of a forecast design center aimed at exploring the heterogeneity of risk perception and behavior, as well as decision heuristics concerning water hazard mitigation. Played a key role in organizing and hosting empaneled focus groups with stakeholders in the Winooski Watershed in Vermont. Collaborated on the creation of a nationwide survey focused on public flood risk perception, utilizing the Extended Parallel Process Model (EPPM) as its framework. Responsible for data cleaning and validation in R and STATA, while also maintaining version control through Git Lab. Conducted an analysis of survey data using Exploratory Factor Analysis (EFA) to create a supervised Structural Equation Model (SEM). Will continue to analyze survey data by creating an unsupervised SEM in BayesiaLab and comparing the validity of the supervised model to the unsupervised mode.  \n\n\nSocial Relations, Second Homes, and the Space Between “Insider” and “Outsider” in a Rural, Amenity Rich Community, Honors Thesis with Distinction and College Honors in Geography,  2021 – 2023.  \nInitiated an independent research project examining the social dynamics between primary and secondary homeowners and the affordability of housing in a high amenity community in Northern Michigan. This involved independently formulating a research proposal and successfully navigating the Institutional Review Board (IRB) process at my university. Conducted nine separate focus groups, transcribed data, and performed qualitative coding of the information through NVivo. Additionally, analyzed National Low Income Housing data using SPSS to investigate whether an increase in second home ownership was associated with higher housing prices.  \n\n\nImpacts of plastic bag legislation on consumer behavior in the United States: Evidence from a statewide survey in Vermont. 2022.  \nConducted data collection and an extensive literature review on plastic and paper grocery bag legislation in Vermont. The data were analyzed using SPSS, drawing from the annual Vermonter Poll survey conducted by the Center for Rural Studies, in order to reveal Vermonter preferences regarding payment for paper grocery bags.  \n\n\nAlliance for System Safety of UAS through Research Excellence (ASSURE) A28, University of Vermont Spatial Analysis Lab, Federal Aviation Administration. 2021 - 2022  \nContributed insights into the safe and secure integration of Unoccupied Aircraft Systems (UAS) into the disaster preparedness and emergency response and recovery sectors. Conducted an extensive literature review on emergency response in the United States from 2000-2020. Gathered and organized data pertaining to the utilization of UAS and helicopters for FEMA-declared disaster responses. Qualitatively coded interview data with the aid of NVivo. Compiled and presented reports to FEMA and the FAA.  \nMapping American Childhoods, 2021.  \nExplored historical geographies of childhoods, with a particular focus on the examination of child labor and compulsory schooling laws in the United States during the early twentieth century. Transformed historical data into CSV format using Excel. Employed ArcGIS to present the converted historical data in map format. Generated data visualizations for academic presentations through the use of Tableau.  \nCERTIFICATIONS  \nResponsible Conduct of Research (RCR), Collaborative Institutional Training Initiative (CITI) Program.  \nSocial-Behavioral-Educational Researchers, Collaborative Institutional Training Initiative (CITI) Program.  \nIRB - Human Subjects Research, Collaborative Institutional Training Initiative (CITI) Program.  \n\n\nHONORS and AWARDS  \nHonors Thesis with Distinction, 2023. University of Vermont.  \nCollege Honors, 2023. University of Vermont.  \nPeter Young Award for Excellence in Geospatial Analysis, 2023. University of Vermont.  \nDr. Kim Monteaux de Freitas Women’s Empowerment Award, 2023. University of Vermont Fraternity & Sorority Life.  \nPresidential Scholar, 2020 – 2023. University of Vermont. Dean’s List Scholar, 2020 – 2023. University of Vermont.  \nGamma Theta Upsilon. International Honor Society in Geography. Inducted member.  \n\n\nPRESENTATIONS  \nGuest Lecture, “Rural Resilience,” Interdisciplinary Perspectives on Community Resilience, Champlain College. 2023.  \nSocial Relations, Second Homes, and the Space Between “Insider” and “Outsider” in a Rural, Amenity Rich Community Rural Sociological Society Annual Meeting. August 5, 2023. Burlington, VT.  \nStudent Research Conference 2023. Honors College, University of Vermont.  \nHonors Thesis Defense with Distinction, 2023. Honors College, University of Vermont.  \nInvited Panelist, 2023, Undergraduate Research Experiences, University of Vermont.  \nInvited Panelist, 2023, Department of Geography and Geosciences, University of Vermont.  \n\n\nLEADERSHIP:  \nVice President, University of Vermont Outing Club  \nDirector of Communications, University of Vermont Outing Club  \nLeadership Development Program Coordinator, University of Vermont Outing Club  \nOutdoor Orientation Head Leader - Mountain Biking, University of Vermont Outdoor Programs",
    "title": "2024 MS Grad Seeking Career Advice - When to apply for jobs with June 1 start? Where do my skills fit best?",
    "subreddit": "jobs",
    "timestamp": 1703093351,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "It's Day 1 in your new role as a Graphic Designer. Here's what will set you up for success! As part of helping people with their careers, I've been interviewing different people who are in different roles asking them - what do you do?\n\nThis time it's for a Graphic Designer and this will be the last one leading up to the Christmas break. This interview promises insights and advice for aspiring enthusiasts. 21 questions are answered.\n\n**The Value Add:**\n\nThis will hopefully give people a realistic understanding of the day-to-day responsibilities, challenges, and expectations associated with a particular job. Question 21, the final question, will hopefully set people up for success\n\n**If this has helped you in any way, or if you have found it an interesting read, let me know!**\n\nHere we go!\n\n**Q: Where are you located?**\n\nA: I am based in Kent, Ashford in the UK.\n\n**Q: What is your role title?**\n\nA: My role title is Graphic Designer.\n\n**Q: In your words, describe what you actually do?**\n\nA: As a graphic designer, I create visual communications like logos, advertisements, animations, and illustrations to convey ideas and information visually. I combine creative and artistic skills.\n\n**Q: How long have you been doing this role for?**\n\nA: I've been a graphic designer for a few years, since 2021.\n\n**Q: How did you get to this point in your career?**\n\nA: I studied graphic design in school and built up my skills and portfolio over time. I applied for junior roles at design agencies and worked my way up.\n\n**Q: When it comes to remuneration, what are your three B’s? (Base, Bonus, Benefits?)**\n\nA: For remuneration, my base salary is really good. It’s currently in £95k. I receive an annual bonus based on performance and that varies year on year. My benefits include health insurance, retirement contributions, and paid time off.\n\n**Q: I’m not going to ask you who you work for, but, what industry is your company in?**\n\nA: I work at a design agency that serves clients in various industries. We do graphic design work for marketing campaigns, branding, publications, events, and more.\n\n**Q: When it comes to work flexibility, is your work primarily office-based, fully remote, or a mix of both? Which do you prefer? Does your company allow you to be flexible?**\n\nA: My work is a mix of in office and remote. I go to the office for collaborative meetings and work sessions. But I also have flexibility to work from home when I need focused time. I like the combination.\n\n**Q: What does an average week or a typical day look like for you? Can you walk me through your day? What time do you arrive and start at work, what are your main tasks/responsibilities, who do you interact with, what meetings do you attend, etc.?**\n\nA: A typical day starts around 8:30 AM when I commute to the office. We have a morning meeting at 10:30 to align on priorities. Then I'll work on current design projects - maybe creating a logo or laying out a magazine ad. I collaborate with other designers and take feedback from clients. I take a lunch break around 1 PM. More heads-down design work in the afternoon. I try to leave by 6 PM if possible.\n\n**Q: What does a typical day look like when things are going well vs a more challenging/stressful day?**\n\nA: On good days, I'm in the flow creating new design work. On stressful days, there may be tight deadlines or challenges getting feedback and approvals from clients.\n\n**Q: What skills or knowledge are most important for your day-to-day work?**\n\nA: The most important skills are creative thinking, communication, and expertise in design software and tools.\n\n**Q: What are some examples of recent accomplishments or contributions you've made in this role?**\n\nA: Recent accomplishments were rebranding a client's visual identity and being promoted to senior designer.\n\n**Q: Do you have a supportive manager and do you feel valued?**\n\nA: My manager provides guidance but also gives me autonomy. I feel valued for my contributions.\n\n**Q: How much time do you spend collaborating with colleagues vs working independently?**\n\nA: It's a mix - I collaborate closely with my design team but also have independent work.\n\n**Q: Is there anything you wish you would have known before starting this role?**\n\nA: I wish I had known how much communication with clients would be part of the job.\n\n**Q: What do you hate most about your role?**\n\nA: The tight deadlines can be frustrating.\n\n**Q: What do you love most about your role?**\n\nA: I love the creative process of problem solving and designing appealing visuals.\n\n**Q: What’s the next role for you and when do you hope to achieve this?**\n\nA: In the next few years I hope to become an Art Director leading projects.\n\n**Q: Is your next role going to be with the same company or a different one?**\n\nA: I plan to progress within my current company for now.\n\n**Q: What’s one piece of advice you could give to someone who aspires to reach your position?**\n\nA: My advice is to develop your style and skills but also be open to feedback and collaboration. Communication is key.\n\n**Q: It’s Day 1 for someone in your role. What one piece of advice would you give them to succeed?**\n\nA: Don't be afraid to ask questions! Whether it's clarifying a project brief, getting feedback on a design, or asking colleagues for help with a technical issue - don't assume you can or should figure it all out on your own.\n\nThe people you work with have valuable insights and experience to share. Asking questions shows you want to do your best work and continue growing. Admitting what you don't know yet is a strength, not a weakness.\n\nThe other key is believing in your own creative vision and skills. Trust your instincts and design ability, while also taking constructive criticism and mentorship from others. Finding the right balance of conviction in your own ideas and openness to feedback will help you create great work and thrive in your role over time. Have confidence in yourself on this new role journey!",
    "title": "It's Day 1 in your new role as a Graphic Designer. Here's what will set you up for success!",
    "subreddit": "jobs",
    "timestamp": 1703195459,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "(Needing Advice) Let’s Talk about Remote Jobs ——————————————\n\n**START READING HERE IF YOU CARE ABOUT THE PROCESS AND ACTUALLY HARDSHIPS I TOOK TO GET A REMOTE JOB**\n\n——————————————\n\n- **I am 22F and have a WFH job.** I found it after graduating college (May ‘23), after being fired from my in-person WholeFoods position (e-commerce) in February ‘23.\n- I am an Evergreen Writer under GAMURS Group. $20/hr part time (I am in grad school so basically still poor lol).\n- I found this job after applying for **300+** remote jobs in my field *(writing, SEO, media, video game web content, journalism, communication)*.\n- I spent **6-12hrs** fixing my resume and curating my **LinkedIn**. Yes, I found my job through a mixture of LinkedIn and going on the company’s website and going to their ‘Careers’ section. \n- I also personally reached out to editors/directors of content/writers via Twitter and Facebook. I joined Discords, Facebook Groups etc.\n- I had *1 interview* out of 400 jobs applied for and I was blessed to get it.\n\nI told everyone I talked to or emailed to connect with me on LinkedIn. It was my anchor where most of my professional life (freelance work) was displayed. I became addicted to signing up for jobs and even now, when I go on LinkedIn, I mentally start looking at new positions even though I have one. **I’ve been with GAMURS for 5 months now.**\n\n——————————————\n\n**START READING HERE IF YOU DON’T CARE ABOUT MY LIFE AND WANT TO ANSWER THE QUESTION**\n\n——————————————\n\nNow the problem lies: How do I get another remote job, specifically for my boyfriend. He also worked at WholeFoods e-commerce for a year and is trying to get the simple **Call Representative/Customer Support/Online Assistant**— \n- He has gotten **2 interviews** after applying for around 150ish jobs. He has made it to the 2nd step with a company called LeafWell and only the 1st part of the interview process with HR Block as both were Custom Service jobs. \n- I have started to apply for jobs for him as well — signed into his account and just went off.\n- He’s been **unemployed since March ‘23** and we’re just trying out best. \n\nWe’re staying **AWAY from Indeed/SimplyHired/Glassdoor/ZipRecruiter/Monster**: They have too many tests and too many scams. He was almost scammed out of $980 from some company claiming to send a check to buy equipment. There have been other attempts at unsuccessful scams as well. \n\nOnly through LinkedIn have we been able to stay away from scams. He also has signed up for places like **Rat Race Rebellion/Remotive**. We keep an excel list of everywhere he has signed up for as well as a Trello board. For side money he does commissions and video editing for freelance. But now looking for something stable which is the hardest thing ever. \n\n**Any suggestions? Any insight? What company do you work for that is remote? Anyone have a list? I need advice!**",
    "title": "(Needing Advice) Let’s Talk about Remote Jobs",
    "subreddit": "jobs",
    "timestamp": 1699045504,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Waiting for next step on what I thought was a positive interview Hey guys\n\nI work as a content writer/copywriter in content marketing for an agency and applied for a similar-ish role elsewhere a few weeks back. It's with a company I've been in contact with for some time and they've been aware of me for a while.\n\nAs soon as the job ad went up, I applied and they got me in for a chat very quickly. Everything seemed fairly positive and the managing director was sort of speaking as if there was a high likelihood of me getting the role.\n\nShe invited me for a second interview, taking me through their clients, getting me to chat with other members of the team and then doing a proofreading/editing task. The plan was for her to send me another writing task to do from home last week, but I still haven't received one.\n\nDuring my second interview, she seemed a tiny bit less positive and also said something that could be interpreted as 'she'd already made her mind up on me'. \n\nJust very mixed messages - what would be your advice and should I follow her up and ask about the writing task? A big part of me just thinks if she was interested in hiring me, she would've sent it on time?",
    "title": "Waiting for next step on what I thought was a positive interview",
    "subreddit": "jobs",
    "timestamp": 1702293254,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Police in Japan uncovers a ring of 17 men who have filmed 10,000 naked women in hot springs across Japan for decades. The men hid in mountainous areas near the springs and used telephoto lenses to film the women. They also held gatherings to view the footage together, police say. **News link:** \n\n[https://www.insider.com/voyeurs-japan-hot-springs-filmed-women-police-say-2023-2](https://www.insider.com/voyeurs-japan-hot-springs-filmed-women-police-say-2023-2)\n\n&#x200B;\n\n>The Japanese police have arrested 17 men suspected of photographing and filming more than 10,000 women who were bathing in hot springs.  \n>  \n>The group's ringleader, Karin Saito, 50, was arrested in December 2021, per the [Yomiuri Shimbun](https://www.yomiuri.co.jp/national/20230201-OYT1T50285/). Saito was nabbed in the Hyogo Prefecture, west of Kyoto, and charged under a nuisance prevention ordinance, a local [law against illicit photography,](https://www.asahi.com/ajw/articles/13866723) [The Asahi Shimbun](https://www.asahi.com/ajw/articles/14830952) reported.  \n>  \n>**Between December 2021 and February, 16 more men were arrested, including a doctor from Tokyo, senior company executives, and local government officials,** reported the [South China Morning Post](https://www.scmp.com/week-asia/people/article/3209915/japans-hot-spring-perverts-circulated-photos-10000-women-over-30-years-police?module=lead_hero_story&pgtype=homepage). The men were detained by the police in 11 different prefectures, per The Asahi Shimbun.\n\n&#x200B;\n\n&#x200B;\n\n>  \n>  \n>**Saito has confessed to taking voyeuristic photos of nude women for 30 years in 46 different prefectures,** the police told the Yomiuri Shimbun. After being arrested, Saito informed the police about at least a dozen others in his group, reported the SCMP.   \n>  \n>Saito and his crew used high-end camera equipment like long-focus telephoto lenses to film women bathing in the open-air hot springs, the Japanese police told The Asahi Shimbun. **The men would take these pictures while hiding in mountainous areas several hundred meters from the springs, the police said. The group would also get tips from Saito on how best to photograph the women, and hold gatherings to view the footage together.**\n\n&#x200B;\n\n&#x200B;\n\n>Yutaka Seki, an executive director at the Japan Hot Springs Association, told the SCMP that while photography and filming are prohibited in hot springs, new technology makes it difficult to fully prevent such cases from happening.  \n>  \n>\"I am very much in favor of both sexes being able to bathe together in a friendly and safe manner, but incidents such as this attract bad publicity and worry people,\" Seki told the SCMP. \"And that makes my hope of mixed, communal bathing — as used to be the case in the past — more difficult.\"  \n>  \n>**In 2018, people convicted of taking illicit photographs faced a year in prison and a fine of a million Japanese yen ($8,784)**, per the [SCMP](https://www.scmp.com/week-asia/society/article/2168389/metoo-too-slow-japan-peeping-toms-come-under-spotlight).  \n>  \n>Hot springs, or \"[onsens](https://www.japan-guide.com/e/e2292.html)\" as they are known in Japanese, are popular across the country amongst locals and tourists. Known for their mineral-rich hot water, these baths are said to have a relaxing impact on the body and mind and are meant to be enjoyed naked.   \n>  \n>Representatives for the Japan Hot Spring Association did not immediately respond to Insider's request for comment.",
    "title": "Police in Japan uncovers a ring of 17 men who have filmed 10,000 naked women in hot springs across Japan for decades. The men hid in mountainous areas near the springs and used telephoto lenses to film the women. They also held gatherings to view the footage together, police say.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676372749,
    "score": 129,
    "keyword": "mixed race director"
  },
  {
    "text": "Donating eggs - my perspective. TLDR: I anonymously donated eggs in 2021. Yesterday I met my donor daughter for the first time. She will be 1yo this month. She is beautiful. She looks like me and my youngest child. Her parents are wonderful. I am incredibly happy for them. My donor recipient had a hard time and went through a lot to get her daughter. My youngest child has been begging me for a sister so he sort of got his wish haha.  \n\n\nLong version:   \nI live in Australia so you can't sell your blood, plasma, sperm or eggs. If you donate, you do it altruistically. I've always donated blood and plasma - I hit 75 donations before my doctor told me to give it a rest for a year. In 2021, I watched a doco on Netflix called One More Shot about infertility. I've always wanted to be a mum. I met my husband at uni. After three and a half years, we got married the day after I turned 23yo (husband was 24yo). I had my first son a year anda bit later when I was 24yo and had my second son when I was 27yo. I'm 32yo now. I fell pregnant easily - especially with my second. I fell pregnant the week my Implanon (contraceptive) was taken out. My GP didn't believe it until he checked the dates - he was the one who took the Implanon out. My point is that I am very fertile, I am done having kids and I have plenty of eggs that I don't plan on using so why not donate?  \n\n\nDonating in Australia had a lot of prerequisites: you had to be of a certain age, be relatively healthy, had finished your own family or sign a waiver saying you wouldn't blame the clinic if your fertility was affected by your egg donation(s), etc. You also had to go through a few other hoops like sessions a few months apart with a psychologist. If you were married like me, you need permission from your partner and they too would have to do some psych sessions. Then came the blood work. The forms. Vaginal scans. Medication. Lots of needles. Lots and lots of appointments. As an egg donor, you basically went through the IVF process and stop short of the implantation part. That was all fine with me. Inconvenient but I'm a SAHP so I had a lot of free time. The clinic paid for everything for my donation - apparently some clinics in Australia want you to donate (for free) but also expect you to pay for it too (medications, hospital stay, doctor fees, psych fees, etc.) so I'm guessing that's when you know who your donor will be and the recipient parents would cover that. I'm an anonymous donor so I didn't know who would get my eggs. I could put stipulations and pick recipients who were of a certain age, race, religion, nationality, etc. but I didn't. When I woke up from the egg retrieval surgery, I was handed a gift bag with a note basically saying thank you and that even if my donation did not result in a baby, that at least I gave them a little more hope anyway. I've kept that note and filed it away.  \n\n\nA year later I heard there wasn't many donors, even less than the exisiting dwindling pool of donors, due to covid. So I made another egg donation in 2022 at the same clinic. My ovaries were overstimulated again but this time was much worse than last time. I was sick for longer and had gained a lot of weight and decided not to continue - legally you could donate up to five families. During this second donation, the clinic let slip that my first donation recipient was pregnant. I was glad for them but didn't seek out anymore information at the time.  \n\n\nOne day I got an email telling me our donor database was being moved over to a government one and I had to fill out new forms. During this process I found out I had a match, that one of my egg recipients were successful and had a baby girl in 2022 (clinic can release the gender and year of birth of donor children to egg donors). I was so glad for them and didn't want to pry so didn't send that email to the clinic. So I filled out the new forms. I had the choice to not put down any identifying or contact information until the child was 16yo but I put down all my details incase they needed it for whatever reason. Maybe they didn't need my details today but might need it in the future before the kid turns 16yo. When the kid turns 16yo, they could find me whether I liked it or not. I was also fine with never hearing from them ever as well.\n\nWithin a week of filling out those new forms, I got an email from my donor recipient. The first embryo implanted worked and she had given birth to a beautiful baby girl. The mum sent me a photo of her and her daughter that day (10mo), plus another photo of her daughter as a newborn. I literally screamed that my kids ran to me. I was so excited and happy for her! I quickly showed my sons and my husband the photos. My youngest who is 4yo has been bugging my husband and I for a sister. My 4yo celebrated and screamed \"yay, I have a sister!\"\n\nThe next few weeks were a mixed bag of feelings. My kids who were extremely happy and excited came home one day saying they don't want to talk about their donor sister and wanted to keep it all a secret. It turned out no one believed them at school and had called them liars. I talked to the teachers and we sorted everything - my kids are fine now. My husband and I had years to talk and process different outcomes of my donations but I forgot that my kids are so young that they would need much more time to sort it all out for themselves. My mum and siblings were excited and a little heart broken but mostly happy. It took almost a year to donated eggs from when I first made an inquiry to the egg retrieval and last blood test. My dad passed away a couple of months before the egg retrieval surgery. He was proud of me, excited, and fascinated by the egg donation. I'm sure my mum would've wanted to talk to him about it.\n\nThe day came when I would meet my donor recipient, her partner and her daughter. I was very, very nervous. Mostly thinking that they wouldn't like me. I was worried that my skin would be darker than they expected it to be or that my personality wasn't what they'd imagined. I didn't want to be a disappointment. When we got to their driveway, we saw their amazing vegetable garden - much like ours. I was so, so nervous but I had my two kids, who are also very keen gardeners, running around the garden finding veggies they could identify. We never even got to knock on the door because my husband and I were chasing after our boys. I looked up and there they were -  they just appeared out of thin air haha. My donor recipient was holding her daughter who looked very much like my youngest. Her daughter had just woken from a nap and was a little groggy but was excited to see my boys playing in her garden. My boys wanted to give her a hug immediately but my eldest changed his mind said that they both should wait and not scare the baby so they crouched on over and said hello. I noticed that she has my eyes, my eyebrows and the same hair as my boys. She definitely has her father's nose and a few of his features too. Time will tell how much more she will take after me or her father (also biological father) through our shared DNA. I'm sure she'll take after her mother's mannerisms and such too. I'm happy that my donor recipient could carry her child through pregnancy, labour and delivery - I know how much she wanted that. I know my pregnancies made me a little closer to my boys and is genuinely a unique experience.\n\nWe eventually went inside. I found out my donor recipient's husband/donor child's biological father is also a long distance runner like myself. My recipient loves gardening like I do. It turns out they are very much my sort of people and I was just so happy for them. I was also relieved that they liked us too. My donor child is so very loved. Her parents had gone through so much. Again, I had my children so easily and young that I never thought about miscarriages, IVF or anything to do with infertility at all. It just never came up in conversations. It was only after I donated that a lot of my friends and family told me about their stories of loss and infertility. My donor recipient had a few miscarriages with some after IVF. I can't imagine the heart break she and her husband endured throughout the years.\n\nI feel a bit goofy typing this but there was this weird amazing feeling when I held my donor child. It was sort of a \"hey there you, did you know that your mum went to the moon and back to get you? You magical little thing. I'm so happy you're here\" She is the sweetest baby girl. She didn't cry at all throughout our visit. Loved being held by my husband but more so me - I kept bouncing her to make her laugh so that's probably why. Her parents said that she doesn't usually like being held by men at all and that she usually takes a little to warm up to people in general but she came right along with my husband and I. She followed my boys everywhere with her tiny legs - she only learnt how to walk a couple of weeks ago. We talked for a couple hours until my children got overtired and probably overwhelmed. We took some photos to show our both our families (hers overseas and mine out of state). They kept mentioning how grateful they are but I don't really know what to say to that. I'm just really, really happy for them. \n\n&#x200B;\n\nJust a couple of notes I want to add in:\n\n1. There hasn't been enough time for my second donation (2022) to result in a child but I've been told the (19 successfully frozen) eggs have been allocated to a family so I hope they get their little one(s) too even if I don't get to meet them ever.\n2. My husband probably would've donated sperm but because we didn't want to have anymore children, he had a vasectomy in 2019. I watched that documentary in 2021 so it was just too late for him to donate sperm in the typical and inexpensive way.",
    "title": "Donating eggs - my perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1688997426,
    "score": 93,
    "keyword": "mixed race director"
  },
  {
    "text": "I work with all women in science and it’s awesome There’s only 6 of us, but my department is 100% women, more than half are women of color, and we do science at a biotech company. I’m currently in an email thread with two of my managers (both women) and it made me start thinking about how great and easy it is to work with other women. We work closely with other departments, too, so I do work with a good mix of genders/races/ages but it is so refreshing to not have to be constantly explaining myself or proving my worth. My bosses back me up on decisions. They have stopped other departments from assigning me more work that shouldn’t be assigned to anyone in my department in the first place (reports, small projects). They come to me for advice on issues they haven’t encountered before but I have cause I’ve been here a long time. They let me present data at meetings with clients and higher-ups. \n\nI know in my heart that if I had more man bosses, or any gender but misogynistic, I would not be in the same position and salary. \n\nI am so grateful for accidentally ending up here and I’m excited for future young STEM women to be more likely to have this experience, rather than constantly having to prove yourself. I know we are going backwards in a lot of aspects society-wise but this is a little win for me.",
    "title": "I work with all women in science and it’s awesome",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678214336,
    "score": 76,
    "keyword": "mixed race director"
  },
  {
    "text": "On dealing with my boyfriend’s sexist friends in a second language I’m not sure what I’m looking to achieve by writing this post, perhaps I just need to get this off my chest. However I’m open to advice or encouragement. Tell me to chill, I don’t know.\n\nSorry for the length, I hope this isn’t boring.\n\n\nBackground:\n\nI (32F) am an American in Europe. I’ve been living here, in the same country, for about a decade so the language barrier isn’t such an issue. When I encounter situations where cultural differences are evident, I try my best to reserve judgement and just listen until I’m sure I understand what’s going on.\n\nSo our country’s lockdown was pretty strict. After the first wave, I moved across the country then got stuck in lockdown again in a brand new city. Fortunately, I met a fantastic guy around that time and we spent a lot of our quarantine together.\n\nHe’s not the kind of guy I wouldn’t normally go for: he’s in finance and is a semi-pro sports player. I’m an artist, I’m bi, I’m mixed race, and clearly a foreigner- it’s cool, I’m happy with who I am, but it’s obviously easier running in social circles where we have at least a few of these things in common.\n\nI figured I was changing a lot in my life at that time so why not try to get to know someone who I normally wouldn’t have reached out to before. It turns out it was a great decision. My partner is a fantastic human, his family is also super open to our relationship which isn’t necessarily a given in this region. Thus far, we’ve been together for nearly 3 years.\n\n\nThe issue:\n\nAs we began to settle into our normal lives after COVID, we started hanging out with my partners friends more (most of them are from his sport). Eventually they could resume playing, so a lot of my Partner’s time was spent with the team. Many nights were dedicated to after practice/game hangouts, which was mostly a lot of fun…. except… the rampant misogyny. Honestly I was floored at some of the shit I heard.\n\n\nHere are some classics:\n\n-Just the free usage of the our language’s equivalent of bitch, slut, whore and f**. Sometimes even racial slurs\n\n-A dude at a wedding yelling out “so guys what bitches/sluts are you trying to find tonight” while his wife and baby were at the other end of the courtyard\n\n-Another referring to his wife and mother of his child a crazy, emotional *girl*\n\n-Yet a different wedding one of the groomsmen didn’t understand why Pride needed to be a thing. The irony, gay marriage is not legal here\n\n-Many of the team players have a tattoo for a famous player of their sport, who raped a 19yo. I’ve asked, they still insist “she was lying” or “even if it was true he was really good at said sport”\n\nAnd finally the one that tipped me over the edge:\n\n-I found out a couple months ago, one of their ex teammates stealthed a friend of mine. I can’t say I’m surprised but I would be shocked if this sort of behavior was an isolated incident \n\nFor the first several months of getting to know some of these guys I was pretty reserved. just absorbing context. Getting to know new friend dynamics is difficult on its own, in a different language it’s even harder. However, after a while it was clear that I wasn’t misunderstanding much.\n\nI don’t know if it’s me being a woman or a foreigner, but any time I interjected, no matter how calm or rational it was packaged, I was met with opposition. Most of them would just double down. It’s not really a surprising result. After a while I felt myself becoming hostile to my partner’s friend group as a whole (even though some of his friends are actually chill people). It was not a good look.\n\nMostly I was upset my partner never said anything. Like his discomfort was palpable in some of these situations, but didn’t see the point in being confrontational if the guys weren’t in his close friend circle.\n\nAs for some of the guys in his close friend circle- fucking yikes. To be fair he has been trying to be more proactive when derogatory things are said.\n\n\nThe solution so far:\n\nAs I started making my own friends it has been easier to avoid situations around my partner’s sports friends. I even thought at one point that I was blowing things out of proportion. But now that our interactions are usually for specific events, their disrespect is just more evident.\n\nSo, that’s it. Distance is my solution.\n\n\nThe question:\n\nI don’t even know what advice I need. My partner just finished his last season, but this topic is still thorn in our otherwise great relationship. \n\nIt sucks that I cannot spend an extended amount of time with some of his best friends. And I feel very uncomfortable knowing my partner’s good friends have such little respect for women- but of course I’m never going to say “it’s me or them”.\n\nLike I said, he’s being more assertive on this topic, he has major golden retriever energy and does not like to disappoint people. I applaud his efforts and don’t think I can fairly ask for anything more. \n\nWhen I do see his bros, I’ll just have to keep it superficial until further notice.\n\nThanks for reading and letting me vent.\n\nTDLR\nMy partner and I are an odd pairing. During COVID we made it work then I realized a lot of his friends are pretty sexist. I thought something was lost in translation or there was some cultural thing I didn’t get, but that wasn’t it. My SO makes an effort to speak up when they say fucked up shit but some of his friendships still make me uncomfortable. As a solution I avoid most interactions with his buds. It feels bad.",
    "title": "On dealing with my boyfriend’s sexist friends in a second language",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690741434,
    "score": 27,
    "keyword": "mixed race director"
  },
  {
    "text": "Stood up to a jerk. I am participating in a Karting race league monthly. It’s been really fun and challenging to try to beat all the guys out there on the track. I am the only woman racing out of about 30 drivers. I’ve felt like an imposter the whole time, but I know I also deserve to be out there on the track. For some background, there are four different racing classes: open, heavy-weight, pro, and rookie. As this is my first season, I’m a rookie. Even though there are different classes, we all race together. \n\nI love the challenge, but last night I got spun out by people behind me and had a driver try to push me off the track at the finish line. When I went to tell the race director, he didn’t do anything. So that was the first annoying part. The next race, I got spun out which put me in last. That guy did get a penalty. I get it, it’s part of racing and I know it happens. I’m feeling a bit down because I beat all the rookies with my qualifying speed, but kept losing positions because they spun me out. \n\nThe icing last night was when we finished the last race, one of the pros couldn’t get past me. I felt good the whole race and passed everyone I could with the kart I had. When we pulled into the pit, a guy looked at the pro behind me and said, “what, you couldn’t even pass this girl?” I looked him in the eye and said, “Wow, that was really condescending.” He try to back track and say “lady” instead of “girl” like that was the problem. I told him he didn’t need to say anything at all and walked away. \n\nAfter everyone left, the pro came and apologized for his friend and said he’s said worse things than that. I was like, “well I’m glad I called him out on that if he says worst things than that.”\n\nI’m hoping that I made both of those guys think a bit about their words. Was a weird night, but I am 6th in the running for the rookies and plan to just keep racing as best I can to shut them up. \n\n\nTLDR: called out an asshole who was surprised a guy couldn’t pass me while racing because I was a girl.",
    "title": "Stood up to a jerk.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689190175,
    "score": 14,
    "keyword": "mixed race director"
  },
  {
    "text": "Saying \"Catch a Bubble\" is now racist... At least according to my school's admin. A bunch of Kindergarten and first grade teachers were told that in a meeting. The teachers were completely confused because they've been saying it for years and asked for an explanation, but of course admin was not able to explain any of their reasoning behind it. One teacher (white woman) was specifically told that she \"doesn't understand the culture of the children (title one school, mostly African American)\" to which she reminded them that she is engaged to a black man and has a mixed race child. They didn't respond to that either and basically the teachers were told if they are ever heard saying it again, they would be fired. \n\nI tried searching this claim and found something about how it's equivalent to telling kids to \"shut up\", but even that seems like a stretch. Nothing about how it's racist. \n\nAnyone else ever heard this?\n\nEDIT:\nTo clarify: I don't think it's racist. I'm just curious if anyone has dealt with something similar with that phrase or another management skill with their admins trying to be \"white saviors\". Also can't believe that of all the issues my school should be dealing with, this seems to be the focus right now. We literally had a child bring bullets into the building last week and that's being completely covered up.",
    "title": "Saying \"Catch a Bubble\" is now racist...",
    "subreddit": "Teachers",
    "timestamp": 1697473897,
    "score": 3981,
    "keyword": "mixed race director"
  },
  {
    "text": "I was dress coded. Please advise. I, 19f, am a first year student teacher at a middle school. I was wearing a black high-neck body suit with black slacks from old navy. During planning, my mentor teacher told me that a male AP said that I was dressed “inappropriately” and that I need to wear looser clothes. My mentor teacher pointed out that she didn’t find anything wrong with my outfit but she just wanted to let me know. I immediately felt so embarrassed and uncomfortable because I put effort into dressing professionally and I felt like I was being singled out because many of the female teachers wear the same outfit and even more form fitting clothes than what I wore. My personal thought is the AP said something because my butt is big. I cannot control that. Even when I wear my baggy cargos to this school, my butt still pokes out. I just feel weird & targeted honestly. Please tell me if I’m wrong. Thanks.\n\nEdits for clarification:\n\n1. The high-neck bodysuit also has sleeves so no shoulders were out. The bodysuit just looks like a tucked in shirt, honestly. The reason I stated that I believe the AP made the comment specifically about my booty was bc I have a very small chest & my chest has never been a point of attention for me. However, my small waist & large butt combo has always been a point of attention no matter what I wear. \n\n2. I am able to student teach at 19 bc I earned high school credits in middle school due to being on the accelerated track + I dual enrolled during the pandemic, earning most of my freshman & sophomore credits for college before I even graduated hs. Lastly, I graduated hs a semester early. \n\n3. Yes I am in the USA.\n\n4. I am mixed race: Black, White, & Native American.",
    "title": "I was dress coded. Please advise.",
    "subreddit": "Teachers",
    "timestamp": 1695665653,
    "score": 2676,
    "keyword": "mixed race director"
  },
  {
    "text": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation I thought Matt Yglesias' post today about the failure of teacher evaluation/pay as a policy over the past 15 years, would interest some here. It's from his substack which has a paywall for most posts, but I thought it would be reasonable to put the text in here, maybe he'll get a new subscriber or two. If you want to see the whole thing with the charts/graphs and hypertext links, check it out over there.\n\n&#x200B;\n\n[https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped](https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped)\n\n&#x200B;\n\n**Why teacher evaluation reforms flopped:The strange death of education reform, Part V**\n\nBy Matt Yglesias\n\n&#x200B;\n\n\\[This is part five of an ongoing series. Check out part one on the nature of the education reform movement, part two on the rise and fall of the achievement gap, part three on the successes and failures of charter schools, and part four on the right’s embrace of unregulated privatization.\\]\n\nI can’t believe I’ve gone this far in the series without discussing what was probably the single most important component of Obama-era Education Reform: the large-scale effort to shift teacher compensation and teacher evaluation from a system that was very focused on seniority and credentials to one focused on teachers’ measured ability to generate learning gains for students.\n\nObama was not only convinced by this strategy on the merits, but his administration was also empowered in a very unusual way to implement this change.\n\nThis was in part thanks to the Great Recession, which left state and local governments short on money and the macroeconomy in need of fiscal stimulus. The American Recovery and Reinvestment Act allocated money for a grant program called “Race to the Top” that, instead of giving federal money to school systems based on some formula, granted funds based on the extent to which schools implemented Department of Education-approved reforms. It was also in part a somewhat peculiar legacy of the original No Child Left Behind law, which deliberately gave states unrealistic proficiency targets and required non-compliant states to obtain “waivers” from the federal Department of Education.\n\nThe nexus of RTTT and the NCLB waivers gave Arne Duncan unusual influence over K-12 policy (which is typically more of a state and local matter), and Obama empowered Duncan to wield that influence fairly aggressively — especially to push states to adopt quantitative teacher evaluation systems.\n\nThis was politically dicey. Teachers unions hated it, and while rank-and-file Democrats never turned on Obama over his advocacy for this idea, the dispute drove a lot of intra-party tension and organizing. A lot of people who are today firmly anchored in the progressive wing of the Democratic Party don’t realize (or don’t remember) that downstream disputes about teacher evaluation 10 to 15 years ago were the genesis of so much factionalism, but they were. At the same time, while this cause had a degree of bipartisan support, it wasn’t really something Republicans or the conservative movement leapt to give Obama credit for. Rather than right-of-center people praising Obama for taking on the unions, conservatives generally negative-polarized away from their belief in the reform project, leading to today’s revived interest in vouchers.\n\nIf it had all worked out as intended, we would today see this as a major pillar of the Obama legacy — ARRA might not have been large enough to fully close the output gap, but it was large enough to drive systematic and beneficial change in American education.\n\nThe unfortunate reality though is that while there are some teacher evaluation success stories, these reforms did not on the whole generate great results. The upshot is that a ton of political capital was poured into something that didn’t work, the energy for reform dissipated, and a tremendous opportunity was lost.\n\n**The 10,000-foot case for evaluation reform**\n\nAs I’ve argued before, in politics it’s really helpful to be right about everything all the time. Unfortunately, Obama and his allies were wrong about this, and I was, too. The upside, though, is that I feel like I can describe pretty clearly what the reformers were thinking.\n\nThe basic point is that when it comes to setting teachers’ salaries (or deciding who gets laid off during a budget crisis), you have to pick some system. You could pay everyone the exact same amount (or do layoffs randomly), but that would still be a choice. And I think paying every teacher the exact same amount would probably be a mistake. Instead, districts typically pay teachers based on seniority, with extra pay based on their possession of graduate degrees. Because of the way pension and health benefits work, a veteran teacher is more expensive to have on the payroll than a rookie, even if their salaries are identical. So in practice, the system is even more weighted toward seniority than the salary schedule alone would suggest. Meanwhile, many systems operate on a “last in, first out” system for layoffs, meaning the most junior teachers are the ones who have to go in the event of a budget crisis.\n\nYou can model this as just union clout, but I think many who support this system have a good-faith belief that seniority serves as a rough proxy for teacher skill. That’s even clearer for the graduate degrees — giving people extra comp for extra credentials makes no sense unless you think the credentials are a good proxy for quality.\n\nIn reality, though, seniority is a pretty weak proxy for quality. In a very influential paper published in 2006 by the Hamilton Project at Brookings, Robert Gordon, Thomas Kane, and Douglas Staiger argued that the positive impact of experience on performance plateaus fairly rapidly.\n\nThe research on paying teachers extra for getting Master of Education degrees is, if anything, much clearer — these degrees do not help teachers become more effective, in part because the incentives are obviously screwy. Teachers are strongly incentivized to get the degrees whether or not the degrees are valuable, so universities compete in the marketplace to make the degrees as easy to obtain as possible. And as any teacher could tell you, that is not a good way to teach anything useful to anyone.\n\nThat’s what made the idea of switching to a system that emphasizes measured effectiveness so compelling.\n\nIs it straightforward to measure what makes a great teacher? Of course not. Are there problems and shortcomings with value-added measures based on test scores? Sure. At the same time, a highly imperfect proxy still seems much better than a proxy that definitely doesn’t work well, like seniority. And the master’s degree thing is worse than useless — the teacher ends up with less than 100 percent of the raise because some of the money goes to pay off the student loans that financed the useless degree.\n\nSurely we can do better than this.\n\n**It’s hard to do better**\n\nI think that we can, in fact, do better, and the teacher pay reforms that Washington, D.C. enacted during this era have had some clear benefits.\n\nBut in terms of the big national push for compensation reforms, the news is bad. That’s the conclusion of a recent and convincing paper co-authored by Joshua Bleiberg, Eric Brunner, Erica Harbatkin, Matthew Kraft, and Matthew Springer:\n\n\"Federal incentives and requirements under the Obama administration spurred states to adopt major reforms to their teacher evaluation systems. We examine the effects of these reforms on student achievement and attainment at a national scale by exploiting the staggered timing of implementation across states. We find precisely estimated null effects, on average, that rule out impacts as small as 0.015 standard deviation for achievement and 1 percentage point for high school graduation and college enrollment. We also find little evidence that the effect of teacher evaluation reforms varied by system design rigor, specific design features or student and district characteristics. We highlight five factors that may have undercut the efficacy of teacher evaluation reforms at scale: political opposition, the decentralized structure of U.S. public education, capacity constraints, limited generalizability, and the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security.\"\n\nI really like this paper because it not only presents a provocative result but offers a good explanation for what went wrong. Federal officials saw local reforms that seemed to be producing good results and decided to create a financial structure whereby the federal government would try, via the states, to make localities adopt similar reforms.\n\nBut not only do education interventions in general have an annoying habit of failing to work at a large scale, but this particular effort was beset by huge problems of political implementation.\n\nLots of the state-level politicians thought these evaluation systems were a good idea, of course. But the marginal elected official in these jurisdictions often didn’t think this was a particularly good idea, and only went along with it because they wanted the RTTT money. That meant there wasn’t a strong state-level political coalition that really wanted to overhaul the teacher personnel system. And this was atop another implementation layer of school boards (or occasionally mayors) who almost certainly didn’t want to change things. This then filtered down to another layer of implementation where principals were suddenly dealing with teachers who didn’t like being subjected to a new evaluation framework. Meanwhile, a range of actual practitioners (including some fervent reformers) has emphasized to me that reformers at the time tended to ignore the fact that most principals in schools with challenges really, really hate needing to fill vacancies. There isn’t some huge line of skilled teachers looking to take jobs in high-poverty schools.\n\nThe last line in the quote above about “the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security” is really important in my opinion.\n\nA key linchpin of the D.C. merit pay efforts is that average compensation went up by a large amount — and is only partially undermined by the high cost of D.C. housing. Every teacher, every year, needs to make a choice between “keep teaching” and “change careers.” The goal of compensation reform is to make the above-average teachers marginally more likely to keep teaching and the below-average teachers marginally more likely to change careers. But if teachers on average find the assessment process annoying and the reduction of job security troubling, then you’re making retention of average teachers harder and undermining the whole process.\n\n**Revisiting the original recommendations**\n\nThe Gordon/Kane/Staiger paper I mentioned earlier was very influential on my thinking. And it’s not just me. The Hamilton Project, in the late Bush years, played a major role in developing the policy agenda of what would turn out to be the Obama administration. Then-Senator Obama was even a featured speaker at Hamilton’s launch.\n\nI think it’s fair to say that the paper wasn’t just one of the research documents that supported the Obama administration’s approach; it was, in a sense, the intellectual blueprint for the whole thing.\n\nStill, it’s worth saying that this policy agenda was conceived during a different set of circumstances than those under which Obama became president. He says in the talk above that “when you keep the deficit low and our debt out of the hands of foreign nations, then we can all win,” and the policy panel that followed really focused on deficit reduction. Democrats in the mid-Bush era were not expecting the Great Recession, a huge collapse in aggregate demand, soaring unemployment, and ultra-low interest rates. They believed the Bush policy mix of tax cuts, wars, and Medicare expansion was unsustainable and that it would fall on them to replace it with something more responsible. By the same token, Obama name-checks Gordon as one of the Hamilton people “I have stolen ideas from liberally.” But Gordon’s paper does not propose using federal stimulus funds to try to strong-arm states into changing teacher evaluation policies, in part because the whole idea of doing a big federal stimulus wasn’t on the radar.\n\nWhat they wanted the federal government to do instead was pick up the tab for “up to ten states” to create a system that would offer bonus pay to highly effective teachers who were willing to work in high-poverty schools while denying tenure to highly ineffective teachers.\n\nThat’s similar enough to RTTT that you can see how one idea became the other. But it’s also genuinely different — Gordon proposed, essentially, a subsidy to a handful of states whose political leaders were genuinely enthusiastic about reform, with the reform in question designed to take nothing away from veteran teachers. It’s a policy change that is designed to generate a much higher level of top-to-bottom alignment, from teachers to principals to district leaders to state-level politicians. The hope, obviously, was that the reforms would prove to be a huge success, which would generate pressure for further adoption.\n\nThe other important plank of Gordon/Kane/Staiger was reducing barriers to entry in teaching. They cite data indicating that while traditionally certified teachers are better on average than uncertified ones, the difference is small with plenty of overlap. The idea was that by pairing certification reform with tenure reform, you’d cycle through more cohorts of rookie teachers faster, weed out the least-effective ones, and over time raise average teacher quality. And you could achieve that without doing anything negative from the standpoint of veteran teachers.\n\nBecause of the Great Recession, we ended up in a situation where districts weren’t hiring new teachers or creating new bonus programs. There was instead a lot of emphasis on using effectiveness evaluations to structure layoffs, which makes sense conceptually but is a clear and present danger to veteran teachers, and the point of RTTP was to tempt jurisdictions that didn’t particularly want to do compensation reform to do it anyway.\n\nI think the hope was that this would bring reform to scale much faster.\n\nInstead, it generated tons of ill will while creating a very strong socio-psychological connection between the evaluation movement and a period of severe education austerity in which budgets were slashed, jobs were lost, and inflation-adjusted salaries fell. And it was from within the union backlash milieu that we first started hearing from Ibram X. Kendi that the idea that an achievement gap exists is racist and that we can’t try to evaluate teachers based on student test performance because standardized testing is also racist.\n\n**Pitfalls of change**\n\nAs I mentioned above, I was a true believer in this particular reform idea.\n\nAnd I still believe that the 10,000-foot version of it is correct. If anything, I’m more focused than ever on the role that screwy compensation practices play in supporting rent-seeking graduate schools of education and in incentivizing them to operate as highly ideological enemies of sound social science and pedagogy. One potentially promising compensation reform proposal is to simply eliminate all new graduate degree bumps on a forward-looking basis and plow the savings into higher base pay across the board. This would have only minor educational benefits, but down the road it would have good political economy benefits.\n\nMore broadly, though, my thinking about the other great municipal workforce — cops — is greatly shaped by my understanding of what did and didn’t work here.\n\nMy points about the spatial misallocation of police officers are directly parallel to the Gordon/Kane/Staiger points about the utility of paying bonuses for highly effective teachers who are willing to take on the most difficult assignments. The discourse about “merit pay” flew off in a different direction, but the basic idea was never intended to be anti-teacher — it’s simply harder to teach classrooms full of kids who are dealing with a lot in their lives and whose parents are less likely to have the bandwidth or the financial resources to participate actively in their education. But the system as a whole does not serve its intended goals if valued teachers all self-select out of those assignments, leaving the toughest jobs to a mix of rookies, idealists, and people who’ve washed out of other schools.\n\nSimilarly, whether you’re talking about cops or teachers, if you want to hold people to a higher standard you need to be willing to spend money on higher pay and to think hard about recruiting pipelines.\n\nThe next, and probably final, entry in this series will focus on something that, based on the arc of ed reform, I am both hopeful and concerned about: I’m inclined to support the new wave of enthusiasm for phonics and “the science of reading,” but I also worry it will turn out to be another example of something that’s hard to bring to scale in a decentralized system.",
    "title": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation",
    "subreddit": "Teachers",
    "timestamp": 1684956059,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Advice regarding stress in the classroom I am the Assistant Director of an OSHC (for non-Australian's, this is where some kids go if their parents can't pick them up after school, so they're with me from 3 - 6.30pm). We get around 60 kids per night and have a small amount of indoor space but a lot of room outside. When the bell goes, the kids line up and are signed in and go into our room and hang out with their friends until everyone's signed in (\\~15 mins). We then have a group chat, send them up to eat, and then play inside and outside. \n\nSounds easy enough, but the sheer volume of kids is mayhem. We have a lot of special needs kids that can be violent or run away, and we need to be eagle-eyed to make sure the kids don't escalate as it happens quickly and kids hurt each other. We are overstaffed but it still doesn't feel like enough. However my issue is that I am stressed out beyond belief. I get a tight chest, pressure in my head, fast heart rate etc. the whole time the kids are with us. I find it hard to sleep without having racing thoughts about the kids, I talk about work to my partner all the time, and I sleep so so lightly now.\n\n I **love** my job and I actually enjoy going to work. I love the kids and I'm paid well. But the stress is taking over my life and I am never well rested, and I am always thinking about work, dreaming about work, talking about work. I'm getting sick often, and get a lot of tongue sores meaning I'm run down. *I know I need to conquer the stress but I just don't know how.* \n\nI will also note that I was previously the Director of a smaller OSHC, and had the exact same physical manifestations of stress.\n\nPossible stressors:\n\n* having to direct and manage staff and having difficulty with this as I haven't got the confidence or training to do so\n* already have anxiety disorders and depression\n* workplace is overstimulating with the amount of noise and people\n* feeling like I don't know what I'm doing (I have 4 degrees incl. in special ed. and have nearly 10 years experience so I think this is a feeling and not necessarily true in reality)\n* having to raise my voice often which increases my physical stress level\n\nIf you  have any stress reduction or management techniques, please let me know.\n\nLocation: South Australia. Age level: 5 - 12 years old.",
    "title": "Advice regarding stress in the classroom",
    "subreddit": "Teachers",
    "timestamp": 1690724089,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Book recommendations on equity? (US-based, ESL teacher) I'm planning to work as an ESL teacher in the US in 2024 after having taught abroad for many years.\n\nI'm planning to apply to a Transition to Teaching fellowship.  A major theme of the fellowship is equity and diversity.\n\nFull disclosure, I'm a white male living in an Asian country in a city where over 99.9% of people are of the local ethnicity.  There essentially is no ethnic diversity.  Virtually everyone I would come into contact with is also roughly middle class (there are nearly no truly rich people here and the government takes pretty good care of poorer families).\n\nSo I am not exactly the expert on equity in education or diversity, unless you can count the fact that I have been a racial minority for nearly half my life here and have a mixed-race family.\n\nI'd like to broaden my understanding of the situation in the States.  I also believe that being an ESL teacher puts me in a unique position because I will not be working with the general student population.  My students will not necessarily represent the ethnic/income situation of the school/population at large.\n\nDo you have any book recommendations for someone in my position?  I feel this is one area that I should really learn more about.\n\nThank you!",
    "title": "Book recommendations on equity? (US-based, ESL teacher)",
    "subreddit": "Teachers",
    "timestamp": 1693536505,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Director just scheduled a random meeting with me - am I right to worry? Hi Reddit.\n\nSo I just got an email from a director who scheduled time into my diary tommorow for a half an hour catchup at lunch tommorow - which is strange, considering he never messages me or anything. In fact, I havent even met him in person. \n\nI sent him a message there asking if I was in any kind of trouble, and he replied saying 'Hi, We will discuss Tommorow at the meeting'. And now my anxiety is going through the roof, and my mind Is racing about what it could be. \n\nSome thoughts are:\n- I haven't really been coming into the office all that often, because I haven't been given any project work so it often bears no difference  to me if I'm in or not. In addition I have anxiety which required me to take off work for a time and attend counselling, and report to occupational health regarding it.\n- My manager frequently ignores my messages asking about project work & upskilling opportunities in the meantime. \n- about a week ago, I told my career advisor these issues and he had a chat with my manager. Now all of a sudden a director wants to chat with me about presumably something negative. \n\nAm I going to get sacked? Or get a written warning? It's worth noting that for the year end review, I got a significant bonus, and was in the second highest tier for performance. So I'm just wondering what this could be about and I'm shitting myself.\n\nUPDATE:\nSo I had the meeting, it went well and was professional all things considered. They told me that going forward, they are restructuring the team and they are approaching members of staff firm wide to make a severance package offer. It is very significant financially, with other benefits such as setting up a service for updating my CV, and they would still give me a reference. I can also choose to deny it. In all honesty, I wanted to change my job anyway as I wasn't happy in it for the longest while as it was, and I've been half-assed looking for other work. And because I have significant savings as it is, I feel like it's the best choice because even if I say no, they will still have a review and determine if they will enact a compulsory redundancy package, which I think pretty much means they will get me out one way or another.\n\nI actually feel happy and content with the news, because apparently it wasn't brought about by poor performance or gross misconduct or anything like that - as I mentioned  above I had a strong year-end and high performance tier with a bonus too, so I didn't get reprimanded or cussed out. It would be the push I need to find new, satisfying work In the end. Either way I'm just glad it's over.",
    "title": "Director just scheduled a random meeting with me - am I right to worry?",
    "subreddit": "careerguidance",
    "timestamp": 1698181129,
    "score": 38,
    "keyword": "mixed race director"
  },
  {
    "text": "I need help deciding which job offer! Started at Job A last week when Job B wanted to call with an offer as well - which would you take? JOBS\n\nA\nManager @ Private Tech Company \n$130K Salary Base\n7 Holidays\n6 month wait for PTO accrual period -> 5 days a year max\nStrict Dress Code \n3 month waiting period before sick days + health insurance \nIn - Office Everyday 8 hours work, 1 hour lunch \nOffice culture: cold\nWorkload: Light / Work finishes early \nTeam dynamic is nice. No micromanaging - things get done pretty quickly \nApprovals can take a long time\nNo flexibility on hours start time and end time\nNo flexibility for work from home or remote\nOffice culture is kind of cold. Older mainly men, No dynamic no one talks to each other. Lack of women (I’m female)\nOffice is very hot lol\n\n\nJOBS\n\nDirector @ Agency \n$120k Salary Base, $125k in 3 months, $130k in another 3-5 months after that**\n\n** there is a contingency that this is based hitting targets and meeting goals and progress \n\n7 Holidays + 2 weeks off Christmas \nUnlimited  PTO & Sick Days / Work Remote\nCasual Dress Code \n3 month waiting period before health insurance \nIn - Office 7 hours a day; 1 hour lunch, 1 day work from home \nOffice culture: Younger - can be cause for drama or conflict \nWorkload: Can be a lot more. Team dynamic is unknown. Will have high expectations coming in.\nHours are earlier in day which is nice\nFlexibility for work from home or remote\nOffice culture is unknown. During interview seems good mix of women and men",
    "title": "I need help deciding which job offer! Started at Job A last week when Job B wanted to call with an offer as well - which would you take?",
    "subreddit": "careerguidance",
    "timestamp": 1689731448,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "(26) I'm a program director at a large non-profit and I hate it. Are all non-profits like this? What can I pivot to? I started at this non-profit as a summer camp counselor last year. About a year ago, the assistant director of that summer camp program became a director of a different program, and in the spring, took me on as her admin because of my work ethic. The program was very small, just three employees total, and in July, my director announced to us that she was leaving in September. Afterwards, she privately asked me if I wanted the position. I took about a week to think about it as my grandpa had passed away the week before and I wasn't really confident in myself, but she was confident in me and was willing to train me until she officially left. Plus, it would be a great learning experience, so I said yes. She recommended me to her supervisors, each of whom interviewed me and eventually gave me the promotion.\n\nUnfortunately, it wasn't a smooth process as the third member of our team wanted the position too and started to talk badly about me, my supervisor, my supervisor's supervisors, and people in other departments to anyone who would listen ever since my supervisor announced she was leaving in July. The whole office environment shifted and no one felt comfortable with her there. She was eventually fired in October for falsely accusing others of child abuse among other things. \n\nMeanwhile in September, with my supervisor gone I was basically doing her work without proper pay. I was only officially promoted in October, and since then I've had a lot of conversations with my previous supervisor and other managerial staff about what it's really like working here. There was the one-month delayed promotion to start. But even as a program director, I haven't had account permission to hire people since this month, and I still don't have permission to purchase items. At the end of every pay period, I've been modifying my budget by moving money from personnel to equipment and other supplies, and I honestly have no idea when I'll be able to actually buy equipment. Plus, it's been really frustrating being the only one in my department.\n\nThe job itself also involves oversight from four different organizations: the non-profit, the government office that provides the program's grant, the school the program is supporting, and a third-party evaluator. It's extremely frustrating trying to meet the demands of these four different organizations, especially when they directly contradict each other. I don't know if this is a normal thing working in educational organizations or non-profits, but I really hope it isn't.\n\nI was much happier as an admin assistant when I had much better work/life balance and less stress. My only desire for money is to pay off living expenses and save for a simple future. I never wanted to become a director for the money or power and it was a great learning experience because I learned that I don't want to/can't handle it. I sincerely love the work I was able to do to support the school and the local community, like giving out free vaccines, clothes, and food, and managing after-school programming, but having four different departments/bosses and the lack of basic support from my non-profit to enable me to do my job is draining. My heart races every morning when I wake up and I dread working or becoming one of those people that put minimal effort into their jobs. I know I've genuinely helped people and would hate to give up on that.\n\nIs it worth the time and effort to try and find a similar job at another non-profit? Or is it likely I'll have a similar experience? I enjoy the project management part and wouldn't mind trying to develop this into my career. On the other hand, since I'm still young I'm also considering exploring different fields and seeing what other careers might be a better personal fit for me. (I genuinely was happier being an admin, but I'm a little worried AI will make that job obsolete. I've also been spending a lot of time on 80000 Hours.)",
    "title": "(26) I'm a program director at a large non-profit and I hate it. Are all non-profits like this? What can I pivot to?",
    "subreddit": "careerguidance",
    "timestamp": 1703714861,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "My new job is a mess, should I stick it out or leave? So my new job is kind of a bust. I am with senior staffers who have been here since the 1990s and they seem more concerned with me mixing well with them and the culture instead of me working. They are way more interested in getting me to talk and play around and crack jokes. Since im on probation I've done neither of that. Despite the willingness to play around everyone is worried about being reported to directors. They wont give me keys to access building, nor a locker, nor a uniform instead all of these things come to me when off probation. So far I have just been ferried around by senior staff, my foreman refuses to give me directions instead tells others what will be done and they grab me at some part in the morning. I have gotten 0 training aside from \"learn to have thick skin\" and that everyone here is super particular on how they want to do things, and who gets to touch what equipment. Me reaching beyond would be a big no-no. Most here are temperamental babies \"Who touched my truck\"\"who left that here\"\"dont come into my area\" I am expected to read minds, minds that change the rules they made constantly.  Its a union workplace so I get the seniority thing so there needs to be a chain to the info but I feel like im being treated like a work horse.\n\nThe pay is excellent, and I like the work although boring and not stimulating  but the people factor is driving me nuts? I want to stick it out but all these red flags make me feel otherwise. The money is fantastic but the bullshit outweighs the fact I do almost nothing all day",
    "title": "My new job is a mess, should I stick it out or leave?",
    "subreddit": "careerguidance",
    "timestamp": 1679421658,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "34 Y.O with random experience, what am I qualified for? Hi r/careerguidance\\-  \nI am 34 years old and feeling extremely burnt out looking for my 'calling.' I've tried so many different careers and industries, and don't know where to look next. I've done all of the career personality tests but I'm looking for something that may be lesser known or falling through the cracks of these tests' suggestions.  \nUnfortunately, I can't afford to spend more money on education at this point, so I'm looking for something I may be qualified for already or some kind of paid training. Any advice or suggestions as to what may be a career fit, I'd love to hear them. I somehow feel less qualified for my past roles than I did when applying to each of them. Thank you in advance!  \nEducation:  \nB.S. Kinesiology (I don't enjoy career fields related to my major like athletic training or physical therapy)  \n6 month coding bootcamp  \nFirefighter Academy  \nJob experience:  \nEMT with 911 experience (liked)  \nRobotics field service technician (liked)  \nDirector of Marketing for a tech company (very small company and I don't necessarily enjoy marketing)  \nInside sales development for a SAS company  \nCoding internship (this was a short stint and I wouldn't consider myself skilled in coding and/or qualified for a coding role)  \nPorsche shop technician/Racing pit crew (liked but was not advancing)  \nAgain, thank you for taking the time to read my post, any and all advice is more than welcome. Thank you so much!",
    "title": "34 Y.O with random experience, what am I qualified for?",
    "subreddit": "careerguidance",
    "timestamp": 1686865156,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "Can I go from a six-year entertainment job to supply chain management? There's a TL;DR at the bottom. Most of this is me talking about my animation career.\n\nHi. Currently I'm a 2D animation rigger. I went to college for it right out of high school and since then I've had an almost seven-year career animating and rigging on multiple Netflix, Disney, and Apple productions. My job in rigging is niche and that allows me to go to any studio and probably get CAD$1400 weekly under contract, and most studios always want to retain their riggers so benefits aren't a big issue for me. The pay isn't really the problem, even with prices in Canada rising so drastically.\n\nI have a complicated relationship with my job. My first employer laid me off after four and a half years working there and forfeited any chance of me getting a third week of vacation. Working for other studios has been mixed, but my original job was working on some of the most cutting edge animated series' on television, and while the studios I've worked at since recognize that talent, they are very slow to change their practices and I've run into a lot of directors who are, in a word, backwards.\n\nJust before the WGA strike, I was making plans to coast on my savings, work on my own projects, and generally relax this summer. My last contract was not renewed in March due to lack of projects, but I'm very blessed to have made the decision to take a break myself, and to have prepared for this. However, the time off has given me time to think about my career and whether or not I'm enjoying this line of work. Covid also spurred me to a psychologist who diagnosed me with ADHD, which has really helped me realize, well, a lot of reasons why my life has gone in the direction it has. For the record, I'm medicating and counselling, and I've improved in a lot of places with help of friends and family.\n\nTwo things currently keeping me in the job are a teaching opportunity I received at a local college. They do really good student films and they want to teach state-of-the-art techniques, which I'm excited about. Another thing is that unionization is becoming more popular post-Covid and I'd like to be in the industry to push for that. However, neither of these are totally likely. Right now I'm consulting with the college on their syllabus but they can't find a position for me, and unionization is difficult when everyone is moving around so much.\n\nI love drawing. I love bringing characters to life through rigging. I love the problem solving, building hierarchies, and building dynamic systems.  I love giving drawing nodes funny names and then getting messages from the animators who notice. I love the animation pipeline, I love all the people that will touch a single second of animation before it gets to the screen, and how cooperatively we can make some of the greatest television and film there is. I love how no matter what my task is, even just entering data, I'm doing it while staring at a cartoon character.\n\nBut this job is really killing me, and I'm starting to think this industry isn't for me. I've been learning more about the business side of animation, and it doesn't seem sustainable. Large companies contract these studios full of talent and just wring them the fuck out, until they're completely dead, then they liquidate them and move to the next one. And it's everywhere in entertainment, like VFX and gaming.\n\nI'm just completely burnt out. On the advice of my councillor, I'm formulating a plan B. Just in case my teaching job doesn't materialize. I want to go to university for Supply Chain Management.\n\nI know it's weird. Usually in stories people go from a dreary management job to the arts, not the other way around. But I've always been passionate about economics and in trying to figure out what the flying fuck is wrong with this industry, I've learned a thing or two about business. I'm even working with a collective of colleagues to formulate a business strategy for all of us. I also just really like video games about it. Tycoon games and factory games are my bread and butter, as well as a lot of grand strategy. I don't know, maybe that's juvenile, I literally don't know what the day-by-day for a supply chain manager would be. But the idea of sourcing goods and managing things like travel routes, throughput, local demand, is interesting to me. I'm starting here so I can learn more about it, and if it would be a good fit for me.\n\nI know the grass is never greener so just know this isn't a sudden decision for me, it's something I'm going to think about over the year. It's not really about money, it's more just about enjoying what I do.\n\nTL;DR I'm burnt out after a career in animation, and I'd like some advice on either how to deal with this industry, or what supply chain management is like, and whether I should seriously consider a career change.",
    "title": "Can I go from a six-year entertainment job to supply chain management?",
    "subreddit": "careerguidance",
    "timestamp": 1692656068,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "Should I quit? (Yes or yes) I currently have the perfect job - it pays well, it’s remote, I’m doing exactly the kind of work I want to do. But my team is so, so cruel. It feels like they go out of their way to bully me. \n\nThey talk over me in meetings. They ignore my questions. They ask me to ideate content and pull reports that they never use, then get angry when I have to reprioritize my daily projects to make time for their asks. They don’t communicate when things change and send passive aggressive Slack messages about why I didn’t triple check the process. Or they ask vague questions instead of saying what they need and blowing up at me for not following their directions. I’ve become a project manager for some, sending reminders on THEIR daily projects and explaining everything I’m doing so they seem up to date if our director asks. And then they entirely ignore me when making small talk, they’ll even stay muted and off video if I’m the only person waiting in the call. They’ve made sarcastic comments about my frizzy hair, like we’re in high school?? Then 3 months ago, my manager held an impromptu performance review during my 1:1 and was so harsh, I started sobbing 20 minutes in AND SHE KEPT GOING FOR ANOTHER 50 MINUTES.\n\nI could go on and on. I know it sounds like I’m exaggerating, but I promise I’m not. And my biggest concern is that I have no one I can go to for help, even my director takes part in all this and belittles me in front of the team. So of course they do it too. I’m trying so hard to accommodate their asks and work through all the personality-based critiques from that disastrous 1:1. It just isn’t getting any better. \n\nEverything is pointing towards needing to quit but I can’t get over the money and experience I’d lose out on. I want to believe a career gap wouldn’t dissuade future employers, but the market is so competitive. And there’s also the fact I’ll lose health insurance. I have an emergency fund so it’s manageable, I’m just scared about my career trajectory.\n\nAt the end of the day, I know no one should be talked to this way. I can barely believe not a single person has felt empathetic enough to say something, even in private directly to me. The first few months I brushed it all off, but now it’s taking a toll on my mental health. My heart races constantly. I have no energy for my hobbies. I’m a sad, bitter person when I’m with them. \n\nI think I should quit…convince me to do it (or not, idk anymore, i’m just so tired).",
    "title": "Should I quit? (Yes or yes)",
    "subreddit": "careerguidance",
    "timestamp": 1685672119,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Masters in Engineering Management - useful or not? (USA) I’m starting to look at grad schools now as a way to build a solid foundation for the rest of my career. I work as a software engineering team leader now with a B.S. and I love my role, but we’re expanding quickly and I’d eventually like to get into a “leader of leaders” role, which at my company means a title of Manager or Director. It’s somewhat an unspoken rule that getting to those positions requires postgraduate education. \n\nI’m trying to figure out what Grad  program makes the most sense. As I said, i’m already a line manager and want to stay in the management track. It seems like either an MBA or a Masters in Management is the best play based on what our current directors have. \n\nOne program looks appealing - a Masters in Engineering Management. I’ve heard mixed things though - just yesterday I saw on another sub where someone called it the “unwanted step-child of a systems engineering degree and an MBA”. On the other hand, the program looks like it would help my ideal daily role, would only take a year or so, and is what some current directors at our company have. \n\nI want the credential, for sure, but I also want a program that will actually benefit me, both now and into the future. I don’t just want the easiest path to a diploma. \n\nThose who are in the SWENG industry, especially in management, what do you think would serve me best? “Generic” MBA, or something like a Masters in Engineering Management? Why?",
    "title": "Masters in Engineering Management - useful or not? (USA)",
    "subreddit": "careerguidance",
    "timestamp": 1683720329,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Balancing Master's Studies, Toxic Work Environment, and Personal Projects - What should I do? Hi everyone,\r  \n\r  \nI'm a 21-year-old recent graduate from Colombia, with a degree in Systems Engineering (a mix of Computer Science and Software Engineering in my country). Over the past two years, I've been part of a signal research group where I completed my thesis, and I've been working with them since April. They offered me the opportunity to pursue a Master's in Applied Math starting in January, and while money isn't an issue, I'm unsure whether I should accept this offer.\r  \n\r  \nThe work environment in the research group is toxic, with the center's director being quite authoritarian. However, my immediate supervisors, including my thesis director, are great people, and I'd love to continue researching in my thesis area, potentially improving and expanding on it for my Master's thesis.\r  \n\r  \nBut there are some concerns. Two brilliant friends who were also part of the research group just left and advised me to gain work experience first and then decide about pursuing the Master's later. They believe that having an advanced degree might make it harder to find entry-level jobs. They also suggested considering the time I could dedicate to my passion for music, which I've had to put on hold due to my commitments.\r  \n\r  \nAdditionally, my friends and I have been accepted into a machine learning/data science bootcamp with a low acceptance rate. However, if I secure a job by the end of it, I won't be able to work in the industry simultaneously as it would create conflicts with my current job. The bootcamp starts next week, and this could further strain my already packed schedule, potentially affecting the quality of my current project work.\r  \n\r  \nAdding to the pressure, I'm studying an additional language, but my performance has declined recently due to feeling burned out. I've also faced minor health issues related to stress, which I don't want to escalate.\r  \n\r  \nDeep down, I have a strong desire to pursue the Master's, especially with the opportunities available to me, but it feels like it would be practically exploitative to stay in this toxic work environment. I value my thesis director, but I also understand the reasons for leaving this place.\r  \n\r  \nAt this point, I truly don't know what the best decision is for the long term, especially considering my desire to pursue a postgraduate degree someday. The prospect of further education excites me, but I also want to prioritize my well-being, personal projects, and future job prospects.\r  \n\r  \nI'm at a loss, and I'd appreciate any advice or insights you all might have. Thank you for taking the time to read this and help me with my dilemma.",
    "title": "Balancing Master's Studies, Toxic Work Environment, and Personal Projects - What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1691330680,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Should I Confront Descrimination? Seeking advice before I send my boss an email confronting the descrimination that I experienced when she denied promoting me, late October 2022.\n\nTimeline:\nI started in 2019 as a coordinator, promoted to senior coordinator November 2021, applied for 1 of 5 open analyst positions. Applied and interviewed in September 2022. Was denied promotion then promoted to a new position created \"just for me\" as an associate analyst, plus my duties as Sr. Coordinator (November 2022).\n\nI referred an employee to replace my coordinator position who was hired in April 2022. My trainee (white male) applied at the same time as me for the analyst position and was promoted in September 2022 to the analyst position. There are 2 analyst positions that have yet to be filled. \n\nDescrimination History:\nTrainee was assigned a \"high priority\" state that I assisted on (aka prepare everything and having the director approve before filing) for 2 years. I even trained the previous analyst how to do the job. \n\nI am a Hispanic female. The coordinator/admin positions have been filled with Hispanic and white employees for the past decade (at least) but only the white employees have been promoted to salaried positions. Not one Hispanic employee has ever been promoted to a salaried position in my department, that's 20+ years streak. There is one non-white salaried in the department and they were just hired. \n\nI am coincidentally the only \"analyst\" who is an hourly non-exempt employee; performing the same job as previous salaried analysts. I'm getting paid $20,000 less than my trainee now. They won't even approve overtime for me, I am seriously expected to do two jobs in 40 hours. Instead, I've been instructed to ask my manager to finish any of my tasks left at the end of each day. It's still extra work to delegate those tasks and sometimes they don't get done which then gets blamed on me!\n\nI complete my associates degree in paralegal studies this month, but a college degree is not required per the job description. \n\nMy education and/or race are the only two possible explanations for why I was denied the promotion. When the director met with me via video chat to let me know that I was denied the analyst position and would be promoted to a newly created associate analyst position, she said it was because she and the managers thought I would need too much training. But she is apparently fine with training a new employee who has only 5 months of experience on the hardest job on the team.  Starting to feel like opposite land yet? \n\nI haven't received any negative feedback on my annual review in 2 years. \n\n***********\n\nI want to email pretty much all of what I wrote here, albeit more concisely. \n\nAt the end I want to lay out some acceptable solutions:\nA) Promote me to a \"real\" salaried analyst position and assign me CA. \nB) Promote me to the new salaried operations manager position.\nD) Give me unlimited overtime each week to complete both jobs.\n\nThey will probably fire me under the guise of being 1 minute late clocking in or whatever. But if they do then I will file a complaint all the way to the top. I'm planning to find a new job anyway, just can't leave this month. \n\nI've already spoken with an employment attorney and following their instructions. But this post is mostly to vent, hear about similar experiences, and advice on how to phrase my points listed above.\n\nThanks!",
    "title": "Should I Confront Descrimination?",
    "subreddit": "careerguidance",
    "timestamp": 1673399483,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Rejected for a position after a final interview, but was referred to another role in the same department for significantly less pay. Should I go for it?  \n\nHey everyone. I was laid off a couple of months ago and have been actively searching for work. I applied for an analyst position with a well-known company that would have represented a significant pay bump from my previous job, and had a successful phone screen and a successful zoom interview with the hiring manager. She mentioned the next steps in the process: she would ponder over the candidates, and if there was a strong contender, she would make an offer the next week. If it was too close to call between a couple of candidates, there would be a final interview with the director of the department. The latter wound up happening, and I did a zoom interview with the director. We had a great conversation, and he said a decision would be made the following week.\n\nThat week, I got a call from the HR rep I have been speaking with throughout the entire process. She said I unfortunately didn't get the job, but that they liked me so much that the director personally wanted to refer me to another role within the same department. I was honestly pretty flattered when I heard that, but she told me the job description and the pay, which is significantly lower than the job I was originally going for, and even less than I made with my previous job (the job I was going for was at 68K, my old job had me at 55K, and this is at 45K (I also have a decade of experience as an analyst.) Needless to say, I was a little bit disappointed, especially when she said things like \"we increased the pay just for you: you'll be the highest paid person in this department\" (that refers to the 45K I mentioned: the regular pay for the role is lower.)\" I told her it was less than what I made at my last company, and she said that she took a pay cut from her last job to get hired here because of how good of a company it was. I told her to send me the description and that I will think about it.\n\nI am of mixed feelings with this. I heard instances of people being rejected for roles and making a good enough impression that they wanted the rejected candidate in another role, and like I said, while I was flattered that they liked me so much, I really wish they referred me to a role that was more reflective of what I was looking for in pay. What should I do? Should I interview anyway and try to negotiate more pay or if not pay better incentives? Should I try to get the role with the intent of quickly working my way up to the position I originally applied for? Should I ask, since they like me so much, if there are other roles that more closely aligns with the pay I am looking for?\n\nThank you!",
    "title": "Rejected for a position after a final interview, but was referred to another role in the same department for significantly less pay. Should I go for it?",
    "subreddit": "careerguidance",
    "timestamp": 1679064452,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Micro aggression? How do you deal with this? Microaggressions, eh? How do you navigate that minefield? In my decades-long career, I've battled the corporate beasts: cringe-worthy bosses, colleagues who make cacti seem warm and fuzzy, folks who wouldn't know leadership if it smacked them with a motivational poster, and of course, the undeniable sting of outright racism. \n\nBut the subtle art of microaggressions? That's a new one on me. Maybe I just didn't realize I was in the ring.\n\nHere's the deal - I'm in the tech biz, sitting pretty in a senior director seat. Only catch is, I'm not a full-time employee. I'm the external consultant they brought in for a 19-month contract. In my role, I've got five counterparts, all either on the same rung of the ladder or one step below.\n\nI'm the only splash of color in this vanilla-flavored group. I'm a Black man. On the whole, the team's alright. Been in this role for over half a year, but there's this one guy... always stirring the pot.\n\nHe's got this annoying habit of running to my boss for things he should be bringing to me - notifications, escalations, inquiries, you name it. It's gotten so out of hand that even my boss has started wondering why he's not coming to me. Beats me. All I know is, it grinds my gears.\n\nWhen it comes to projects or goals in my territory, with all my peers in the mix, he'll send one of his underlings, maybe a manager or a senior analyst, to liaise with me. Sometimes he even has the audacity to patronize me, to the point where I've had to remind him we're playing in the same league. He just laughs it off, apologizes, and says he didn't mean anything by it.\n\nHe talks and behaves like he's got some kind of upper hand, dropping snide remarks about my department and hinting he'll have to chat with the bigwigs about decisions in my area. Newsflash, buddy, this is my turf! But he keeps on keeping on, and my peers, even my boss, have taken note. I'm just not sure how to handle it.\n\nI don't want to rock the boat, especially given my contract status, and part of me wonders if that's why he's acting this way. I'm just looking for a strategy to tackle this situation without putting my job in the crosshairs.\n\nThoughts?",
    "title": "Micro aggression? How do you deal with this?",
    "subreddit": "careerguidance",
    "timestamp": 1682635655,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Weird feeling about a company I applied to So I'm an 8YOE SWE and I'm trying to change jobs in a location with very few companies operating in my field, therefore finding an offer that matches my skills and interests in such a place is a rare and precious event.\n\nSo as hinted by the title I just found one and I'm about to have the first interview round with them. But I see a lot of weird things and I'd like more opinions, perhaps it's just normal. \n\nFirst, this company has existed since about 40 years and they are doing some custom high-end parts for big and expensive machines, eg in the medical field, so typically sell very few parts at a very high price. \n\nFirst thing I noticed is that there are only a dozen employees, but I'd expect an engineering company that survived for so long to have grown a bit more. \n\nSecond thing I noticed, more than half of the employees have director/executive/marketing/sales kind of role and are there from the early days (mix of PhD and MBAs, sometimes both). According to my research, some of them serve multiple boards of directors at the same time. I saw only 3 or 4 engineers I could relate with and except one they all joined in the past 3 years (after they got a new CEO). \n\nThen I googled them and while they have a quite nice website describing their work, team, etc, but I found only a single press article about them, yet they've been around for a long time. Ok, perhaps there are some outside of the Web, but just one? Oh and on social medias they have been active for a few years, but the reactions on their posts are always from the same 2-3 employees. \n\nThey do exist legally, I checked and it's a properly registered company, the names listed being the ones of their board of directors who've been there since 40 years ago. \n\nNow I'm wondering how sketchy this all could be, as I'd really want to not switch job to end up in a failing company, not seeing my salary at the end of each month, or being fired early. I'm wondering if the new CEO managed to lift investments and is trying to boost a company that's been around as a side-kick for many people for decades. I'd be fine working for a growing startup, but one that existed for so long? \n\nAnyone has some experience with something similar?",
    "title": "Weird feeling about a company I applied to",
    "subreddit": "cscareerquestions",
    "timestamp": 1683780855,
    "score": 6,
    "keyword": "mixed race director"
  },
  {
    "text": "WLB in Industry (Manager level and above). Is it a myth? We all know about those cushy staff / senior jobs where you do nothing for 75% of the month and then maybe have to work a full 8 hours for the week of close…. but for those were able to find WLB in industry at the manager, senior manger, director, controller level … what is your job / industry and how many hours do you work per week? \n\n8 years into my career (mix of Big 4, private company and F500) and I am getting pretty tired of the 50+ hour month end weeks and 60+ hour quarter end weeks (not too mention the multitude of fires each and everyday + trying to juggle workload with a revolving door of staff / seniors). Is it even possible to find WLB at these levels? Honestly thinking of just going back to senior and hoping to find a relaxed 30-40 hour job with occasional OT 1-2x a month \n\nHave lost all motivation to keep climbing the ladder as each promotion comes with more work and bullshit. Hoping to find some sort of WLB without taking a huge pay cut, but now sure if I am looking in the wrong places, I just need to push back more and accept the consequences or if I am trying to find a unicorn job that doesn’t exist. \n\nAnyone find WLB in management roles or above? Or decided to leave management and take a pay cut for actual WLB?",
    "title": "WLB in Industry (Manager level and above). Is it a myth?",
    "subreddit": "Accounting",
    "timestamp": 1688682533,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "CPA PEP Exam Performance Management September 2023 How’d everyone find it? I can’t remember all the AOs but I think it was like this: \n\nCase 1 - Break Even Sales Mix, Responsibility Centres, Risk Mitigation (to address or to not address risk) Bonus/Measures issue, Transfer Pricing, Board of Directors\n\nCase 2 - SWOT/KSF, Mission/Vision statement, Profit calculation with joint costs allocated based on NRV, Outsourcing (Quant/Qual), 4 Quarter Forecast\n\nMCQ - variance, few assurance, capacity constraint, BoD, CSR\n\nI think the cases and MCQ were pretty fair. I think the Break-Even Sales mix tripped me up, I think I said 40 total units out of the 45 is needed to sell to break even? Thankfully no heavy variance AOs or Equivalent units AO",
    "title": "CPA PEP Exam Performance Management September 2023",
    "subreddit": "Accounting",
    "timestamp": 1695317615,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "Entertainment company or Aerospace company, which offer should I take? My(26f) current company is Japanese entertainment company. I worked here for 3 years as account payable and currently make $48k.\nAfter my husband got job at well known aerospace company and started making six figures right out of college, I decided I’m ready to level up my skills by getting a degree.\n\nI started pursuing accounting degree this March. The college is fully online(WGU).\n\nSeveral company reached out to me after I  put my college information on LinkedIn as I also started applying to similar position with more responsibility. I ended up landing offer from two very different companies.\n\nCompany A is in similar business to my current, focused more on licensing of the Japanese stuffs they make. They were looking for staff accountant. Direct report will be made to accounting manager who is willing to teach me from scratch, offering to be a mentor for my accountant journey. They will allow me to build experience as an accountant immediately. Basic benefits. Slightly less PTO than current. Will accrue more based on years worked. Same pay as current.\n\nCompany B is an aerospace start up. Different aerospace company from my husband’s. when I first decided to pursue accounting, we talked about how it will be cool if we can both work in aerospace industry. Direct report will be director of finance but my position will be mix of account payable and procurement. I will not be doing much direct accounting stuffs but higher starting salary (+$15k), flexible PTO, equity bonus. \n\nJoining either of the company will allow me to build relationship with great mentor. They both have snacks and drinks I can have while I work. \n\nTLDR: I recently started accounting degree and received two job offer. One as staff accountant with basic benefit, second as account payable and procurement specialist with higher pay.\nWhich offer should I take if I really want to reach 6 figure asap?",
    "title": "Entertainment company or Aerospace company, which offer should I take?",
    "subreddit": "Accounting",
    "timestamp": 1687570332,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Update: The Showdown at the Country Club I met up with the Partner, Director, and Client this morning for the round of golf. After taking advice from the last post specifically /u/Saints2804\n \"Turn up the heat. If you are going out, burn it down.\"\n\nWe opened up on a par four, with the client and partner riding together with myself and director in the other cart. The director gave me the side-eye and said, \"keep it cool today\"...I felt like he knew something was up, maybe he knew of my secret? The client tee'd off, followed by the partner and director. It was my turn and my mind was racing, do I miff it intentionally or do I hit it square down the fairway? I chose the latter and outdrove the client by 15 yards. A sharp \"what the fuck\" was whispered from the client after the shot. I noted it was pure luck.\n\nThe next seven holes continued with myself and the client neck-in-neck around one under par. I could routinely hear the client getting frustrated with my partner as I was 15-25 yards closer to the pin than he was. It appeared my partner was getting uncomfortable in this entire situation.\n\nAt the finish of nine, the client excused himself to \"drain his massive log\" and the partner pulled me aside. \"You know how to play? I thought you never played in your life!\" my partner exclaimed! \"You need to throw this game!\" he pleaded. I didn't know what to do, this client was a glorified man-child. He was given everything his entire life and all he did was shit on those below him.\n\nWe started off the back nine with me taking a few shots that were intentionally bad. A few bogeys led to the client being one under and myself at two over at the number 14 hole. That's when the trash talk started, \"You young whippersnapper, you think you can come out here and beat me? At my club?\" I want to leave most of the language out of this, but he made comments about my mother, father, sister, brother, cousin, friends, dog, etc. The man was ruthless with his trash talk in a glorified boomer type of way. This got under my skin.\n\nThen it happened. Hole 17...he imploded. His triple bogey put himself one stroke ahead of me going into hole 18. We all walked up to the number 18 teebox and that's when he said it, \"I bet you depreciate land you son of a bitch.\" I looked at my partner with a glare and he met me with sheer terror in his eyes.\n\nIt was a 550 yard par five and I hit the best damn tee shot of my life. I outdrove the client by 50+ yards. \"You fuck, I bet you can't create a pivot table in Excel\" I heard bellowing from him. I was on the green in two with vengeance in my blood. The client held fast and was on the green in three. He squared up and missed his first putt from eight feet away and shot it three feet past the hole. \"Fuck\" I heard in exclamation from him. He lined up again and put it in for a par. I walked up to my ball ten feet away shooting for an eagle, if I made this I would beat the client by one stroke. \"Your dumbass works 70+ hours a week for a $55k salary!\" he exclaimed. I tapped the ball and sunk it for an eagle.\n\nThe next few moments were a blur. The client proceeded to call me every name in the book and grab all of his clubs and break them individually, then throw them in the closest pond. The partner was actively performing damage control as my director just seemed to sink into the background as tempers flared. With the client storming off claiming we wouldn't be performing work for his company in the future, my partner gave me a look of disgust and pure anger.\n\nWith the client gone I had the scheduled post-game meeting with the director and partner (both fuming at me). \"Well, you just cost us one of our biggest clients during a pretty turbulent year\" my partner commented. He then went on to inform me that this meeting was originally setup to discuss me being placed on this engagement with hopes I would lead it in the future and pull me off the bench. The golf game was to build rapport with the client. \"I just flushed that down the drain\" in my partner's own words.\n\n​\n\nI finally just got back to the office and have a rushed meeting with HR at 5PM.",
    "title": "Update: The Showdown at the Country Club",
    "subreddit": "consulting",
    "timestamp": 1684526299,
    "score": 198,
    "keyword": "mixed race director"
  },
  {
    "text": "Thinking to switch to Industry after 2 years I started as Consultant in one of the Big4s in Germany 2 years ago, and my experience so far has been mixed. I had thought Consulting is all about long hours, travel, Client focused work. But so far, it has been chilled out days, no client related travel and delivering sub par deliverables set by the managers. I used to work in a startup and it feels like that was the most innovative stuff I worked on, in consulting it just seems like there is no work on leading tech and no innovation. I'm thinking to switch to Tech Industry, for more pay and better work.\n\nMy question is: In the long run, my assumption is SM, Directors and above make more. Is it worth it to exit Consulting and maybe think of returning as SM and above. Or am I wrong ? I work in analytics if that helps.",
    "title": "Thinking to switch to Industry after 2 years",
    "subreddit": "consulting",
    "timestamp": 1692521190,
    "score": 24,
    "keyword": "mixed race director"
  },
  {
    "text": "When you finally realize that all \"skin folk ain't kinfolk\". I had a conversation with the director of our property department that's within a major nationally known organization. She's a black woman as well, and the organization comprises of about 20% black employees.\n\nAlthough our particular office (HQ) is evenly mixed, a lot of new black employees naturally gravitate towards me. Because of this, I always find myself in some awkward conversations that eventually gives me a feel of what they are like outside of the office. \n\nAnywho, this director didn't just work with me- but she was also a real estate broker. I mentioned to her that my mom was kind of in the market for a new home, and she gave me her information. The conversation changed when she found out where my mom lives. \n\nShe went on and on about how many properties she owned in that neighborhood because, \"#iggas gonna rent!\" She further stated that no matter how bad the area gets, \"we\" will always want to stay there because we don't know any better. \"You want to know why people can't get out the hood? Because they don't want to! No matter how many programs the government creates, there will always be a hood because that's what \"they\" like. \n\nShe states how she buys a property, barely fixes it up, and offers it for rent since the tenants never care. \n\nShe doesn't realize that she is also part of the problem. She discourages \"gentrification\" because she knows she would have to find another place to make a profit in. \n\nIt's sometimes your own people.",
    "title": "When you finally realize that all \"skin folk ain't kinfolk\".",
    "subreddit": "blackladies",
    "timestamp": 1687023696,
    "score": 233,
    "keyword": "mixed race director"
  },
  {
    "text": "Tbh, we need more variety in \"Black media\" Don't get me wrong, I loved Insecure, Rap Sh!T has me in a chokehold and I'll be the one to admit that I've binged quite a bit of Sistas, Harlem, etc. but I feel like there is NO variety when it comes to shows harboring a majority Black cast. \n\nDo people, black folk included, feel like we don't want to consume anything but relationship drama and racial trauma? \n\nAs a cinephile and one who loves Horror, Sci-Fi, Cyberpunk, etc. we are not there. You'll find a Black guy or two in these movies, but BW are so scarce. If we are there, well... you all know. \n\nI was watching Rebel Moon earlier and while the movie in terms of writing is trash, the visuals were beautiful but I noticed that every race is represented except for monoracial BW. We are not even in the background. I won't lament about non-Black writers and directors putting us in their films, because let's be honest - they do not care, but I want Black writers and directors to branch out. \n\nNot every show needs to be about 20s/30s BP navigating more struggle relationships or a racist system. Where is our escape? Where is our Rebel Moon, Harry Potter, Star Wars, etc. \n\nThere are plenty of Black creatives on that \"nerd\" tip who deserve a chance to bring something to the screen and it's a shame that the Black people with money (TP, Oprah, etc.) aren't trying to diversify and support them.",
    "title": "Tbh, we need more variety in \"Black media\"",
    "subreddit": "blackladies",
    "timestamp": 1703300258,
    "score": 123,
    "keyword": "mixed race director"
  },
  {
    "text": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me. Hey everyone, this happened at my daughter’s school this week and I’m kind of uncomfortable with how it went down. Would love to have some insight on this situation.\n\nMy daughter goes to a small school in our town where I volunteer in the library weekly. It’s my favourite day of the week, and I had a great time this week as always reading with and telling stories to the kids, plus getting to spend the day with my daughter. I got there a little early and since no one was in the library, I decided to go and paint with one of the teachers and some of the younger kids.\n\nAs we were painting, one of the little boys, let’s call him Miles, came up to us, pointed at the little bit of lace visible at the front of my wig and loudly said “Fake!” before he and his little brother sat down next to me and started to paint. I rolled my eyes, because kids are gonna be kids, and went back to what I was doing, but the teacher was clearly upset. She told him what he said wasn’t okay and made him apologize, I said it was fine he does that sometimes. She continued to tell me that didn’t make it alright, and started telling me about her experiences with racism growing up as an Indian woman.\n\nFor additional context I know this kid relatively well. I’m friendly with his parents, he’s friends with my daughter, frequently borrows her manga, and will generally come into the library to chat with me on the days I volunteer (translation: to show me his new Pokemon), read with the other kids and flip through whatever book I’m reading (he’s a very advanced reader). A few weeks ago at one of the school’s many events, a bunch of the kids and their parents were eating together and he said that he liked my hair. My daughter’s best friend said that it was fake. The school is very diverse and since a few of the black kids are either from mixed race families or have been adopted into white ones, conversations about my hair are frequent and sometimes the non-black kids join in. He asked what my real hair looked like and I told him that he'd already seen it several times.\n\nBack to the present, one of the other teachers (who was white) came up to me after lunch time and said that he and the other teacher were going to sit down and have a conversation with Miles about what he said and that it was important to talk to kids about racism. I said I didn't think it was necessary, but he continued to talk over me. If you recall my previous post about this school this is the same teacher who had been hitting on me, so I was way too uncomfortable to say as much as I probably should have.\n\nMy perspective on the situation is this. This kid wasn't racially stereotyping me, he has been present for multiple conversations about my hair, so he knew it was fake. He is a kid and is curious about cultural differences which is normal. I think non-black people have a different perspective than black people on what is considered unruly behaviour in a child. I also think non-black people think black hair is some kind of secret and are extremely uncomfortable talking about it or hearing it mentioned. I'm not.\n\nThe little boy is 7 years old. He's not white and comes from Middle Eastern/East Asian background, so there may have been an element of racism to the way the situation was handled towards him. He also made a comment about the first teacher's weight a few minutes after the one about my hair, so I also suspect that she just doesn't like him very much.\n\nAnyway, I'm curious about everyone else's perspective.",
    "title": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me.",
    "subreddit": "blackladies",
    "timestamp": 1688343941,
    "score": 69,
    "keyword": "mixed race director"
  },
  {
    "text": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies? Hi all, apologies for the long post below that is likely full of some grammatical errors! :)\n\nI have been with my partner for 5 years. He works for a very intense advertising company and is the only Black individual on his team. His managers are White/Asian and have started using terms such as, “disrespectful,” “angry”, “isolative.” I want to be clear, my partner is loved by his team/ “mini” managers (those who he supervises). He has received very good reviews and is extremely engaging/polite. He’s truly lovely. His colleague in the exact same position is vocal and will often raise his voice during calls, to which my partners bosses simply reply with, “that’s fine. We hear you.” \n\nToday, my partner worked from 7am-7pm and a 30 minute call was put on his calendar at 6pm. There has been some financial issues going on with their company, so everyone is feeling the pressure. My partner wrote in the teams chat, “I’m a bit blinded sided by this meeting. What is it in regards to?”  to which his manager said, “that is a disrespectful response. WE have been working harder than you the entire weekend.” My partner responded with: “Okay, let’s just do this then” to which they wrote “you’re so angry and disrespectful.”\n\nThis resulted in a very heated, 30 minute Teams call in which his superiors called him paranoid, disrespectful, and angry. He highlighted that his White colleague has said much worse and even hung up on calls, to which they responded, “we have no memory of this.” My partner refused to say that being labeled as such is damaging to but he did say he felt unsafe (they ignored it).\n\nI wanted to jump in this call SO fast but held my tongue. My partner was extremely defeated and I was livid the entire time. As Black women, how do you all navigate your partner experiencing bias, racism, labeling, etc? I am exhausted and this was just ONE 30 minute call.  He has been at this company for 4 months and wants to stay at LEAST 1-2 years to make Director. Part of me wants him to find a new job ASAP but I also know that isn’t feasible.\n\nI just feel defeated and watching him experience this hurts me deeply. Any tips?\n\n****EDIT:*** The only thing we can think of that has contributed to their perception of him changing is that he took a Monday off (approved leave) to move apartments. He didn’t log on at all to check accounts/budgeting and one of his Supervisee’s had made a mistake with an account. This was caught the next day but resulted in everyone having to work this error out. This was about two months ago.\n\nUpdate: Thanks so much everyone for your feedback! He has started documenting everything, as you all have noted. Not sure how this will turn out but it is definitely concerning. He’s also started updating his resume and making sure everything is followed up with an email documenting what was/has been talked about in meetings. He noted that he is fearful to use “the race card” because there is no coming back from that, which I understand but still I am still encouraging him to address how damaging language can be as the ONLY Black male on his team. It’s not the race card, it’s the reality and race is ALWAYS present (whether conscious or unconscious). \n\nFor right now, he is keeping his cool and maintaining professionalism.",
    "title": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies?",
    "subreddit": "blackladies",
    "timestamp": 1688601081,
    "score": 38,
    "keyword": "mixed race director"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 70,
    "keyword": "mixed race director"
  },
  {
    "text": "Trans men reveal how toxic society is towards men--MANY sources included &#x200B;\n\nhttps://preview.redd.it/luajuj8w4e6b1.png?width=790&format=png&auto=webp&s=3ef59a9188afe3a26d6caaeb18858427c4666be6\n\nRecently I've been looking at the FtM trans community online, and it's just sad how accurate this meme is.\n\nThe FtM trans community is much smaller than the MtF community, but FtM experiences post-transition are very revealing.\n\nThis community is interesting because their complaints are not only about failing to pass as male, but also about trying to cope with passing as male. From what I've seen, this problem is especially common with those who have completed transitioning and are attracted to women.\n\nAnd once they start getting treated like men, they get a brutal reality check.\n\nMany times, they are people who believed in concepts such as unilateral patriarchy, oppression of women, and male privilege. In their minds, they were gonna lead privileged lives once they became men, but when they transitioned, they were like rabbits caught in headlights as reality hit them like a train. Real life was a 180 degree difference.\n\nThese people have been treated like women their entire lives, and had been led to believe the game was fully rigged against women.\n\nImagine you're playing a game against bots, but you don't realize it and think you're good at the game. Suddenly, you get thrown into a professional match.  \nFucking brutal man.\n\n&#x200B;\n\nhttps://preview.redd.it/i07fp8hx4e6b1.png?width=735&format=png&auto=webp&s=36369715accef2d9714fc6177e1d0e852f6f5ba9\n\nHe said \"like I died and came back as a ghost.\" It's like that movie where Bruce Willis is dead but doesn't realize he's a ghost, and no one can see him. It really nails the reality of being a sub5 male in the West. If you're not [talented](https://journals.sagepub.com/doi/abs/10.1177/0305735613482025), [rich](https://www.sciencedirect.com/science/article/abs/pii/S1090513808001177?via%3Dihub), or a [chad](https://faculty.wcas.northwestern.edu/eli-finkel/documents/EastwickFinkel2008_JPSP.pdf), [that is literally how life can be](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373).  \nTough scenes man, truly.\n\n\"...her reaction was something like disgust mixed with pity.\"\n\nWelcome to the fucking club brother. \"[Disgust mixed with pity](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\" Believe me, I know what it feels like. And now bro, you do too.\n\n\"I used to look in the mirror and envision myself as this confident, strong man...\"\n\nIn his mind, he was gonna transition and drink beer and watch football. He was gonna be like \"yo, bitches, yo, yo\" and life was gonna work out just like that.\n\nThat is how disconnected from reality some people are. They have to find the truth out the hard way.  \nJust because you'd been told about how the system was rigged against women, you thought you knew the ugly side of life.\n\nBut you don't man. You ain't about that life.\n\nThese people are so naive. They look at celebs like Elliot Page.\n\n\"Oh look, Elliot Page has a hot girlfriend.\"\n\nYou ain't Elliot Page. He rode his Stacy look in Hollywood for fucking two decades. And only after his looks faded, he decided to come out. In a sense, he played his cards right.\n\nHe could transition into whatever he wants. He has the status, fame, and money. He could transition into a frog tomorrow with some experimental DNA injection, and [he would still date whomever he wanted.](https://www.youtube.com/watch?v=ol3nAWRLIDA)\n\nYou cannot.\n\nYou literally turned yourself into an inkwell.\n\n&#x200B;\n\nhttps://preview.redd.it/4nxe5z7z4e6b1.png?width=707&format=png&auto=webp&s=4943719e08227f88f88bd92175d6352b9d3530c8\n\nRight off the bat: 5'3. At 5'3 [it's pretty much](https://www.researchgate.net/publication/236670565_The_height_of_choosiness_Mutual_mate_choice_for_stature_results_in_suboptimal_pair_formation_for_both_sexes) [over](https://incels.wiki/images/thumb/e/ea/Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png/800px-Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png?20190704023738), man.\n\n\"People who I barely just met will make rude comments or jokes about my size.\"\n\nThis is true. Happens all the time. Other men sometimes will try to throw you under the bus to make themselves look like an alpha, and then they'll play it off as a joke if you say anything back. [Social dominance games happen all the time](https://www.sciencedirect.com/science/article/abs/pii/S0191886913012245).\n\n\"...plenty of women will reject me just for my height...before I even get a chance to tell them I'm trans.\"\n\nPay attention to the word choice here. So it's okay if it happens to XY men because they're just g[enetic trash if they're 5'3](https://www.salon.com/2011/09/25/sex_cells_interview/), but because he's an XX man, he should get a pass for being 5'3?\n\nAre you really gonna feel any better if you get fake sympathy because you're trans? Personally, I'd rather get rejected for genuine reasons than get a pity pass.\n\n\"...when I try to be confident some people hate short guys with confidence...they see it as a person who doesn't know their rightful place.\"\n\nThis is so true. I love this part. [If you don't have the looks but have the confidence, it annoys people](https://gwern.net/doc/psychology/okcupid/weexperimentonhumanbeings.html). [They think you don't know their place](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116).\n\n\"You gotta be acting because there's no way someone with your looks can be confident.\"  \nIt just doesn't look natural. You'll be seen as someone who crosses the borders of natural hierarchy. [They will feel a subconscious hostility against you](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\n\n\"I don't even benefit from the privileges the average man gets.\"\n\nWait until he learns that [the only privilege average men have is that which they have over sub5 men](https://arxiv.org/pdf/1607.01952.pdf).  \nI love how he thinks that if he was 5'8, his aforementioned problems would just go away. In reality, he would likely end up just like the first poster, getting reactions of disgust mixed with pity.\n\n\"Even studies will show you how height really affects men, [they get paid less](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2709415/), [suicide rate goes up](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373), [more likely victims of crimes](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC32258/pdf/612.pdf), [seen as less attractive](https://www.independent.co.uk/life-style/love-sex/dating-app-tinder-bio-words-most-right-swipes-music-gym-6-foot-badoo-a8512541.html), and so on.\"\n\nWelcome to the ugly fucking reality.\n\n[As a woman, if you're tall, many men will see you as better genetic material for their offspring. If you're short, you'll be seen as more attractive.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9454610/) You really can't lose.\n\n[These days, even obese women are celebrated](https://www.instagram.com/plussizecafe/?hl=en). Meanwhile, being [just overweight as a man](https://royalsocietypublishing.org/doi/full/10.1098/rspb.2017.1819#d3e552) is a virtual death sentence for your dating life.\n\nAnd this isn't only about dating. It goes way beyond dating to life itself. That's the real privilege, [how you're treated by people](https://www.sciencedaily.com/releases/2005/04/050412213412.htm), [the connections you make](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116). It's about everything, man.\n\n&#x200B;\n\nhttps://preview.redd.it/geedhfu05e6b1.png?width=605&format=png&auto=webp&s=5d3562ddf94d42a605a6fcc8bff0f35d1fd27aac\n\n\"I'm a very quiet, thoughtful, and sort of emotionally sensitive trans guy...\"\n\nRight off the bat, if you're like that as a man, you will be seen as a meek bitchboy by even the most socially progressive women.\n\nBut never pay attention to what people say. Progressive women will say \"oh yeah man, crying and showing emotions doesn't make you less of a man, it doesn't make you weak, it actually makes you more of a man bro.\"\n\nBut trust and believe when I, a progressive myself in many regards, say this. [If you are emotionally vulnerable in their presence, their pussies will dry up harder than the fucking Serengeti](https://journals.sagepub.com/doi/abs/10.1177/0146167214543879). And once again, this person had to find it out the hard way.\n\n\"...if I stayed as a girl I wouldn't have to worry whether I did nothing because I would still be liked and appreciated.\"\n\nExactly. I like this one because it includes the social aspects of the difficulties that come with manhood rather than just difficulties in dating. The middle paragraphs are underrated, really. He's spot on.  \n[As a guy, if you're not talented or have a respectable career at a certain age, you're looked down upon by society](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10206369/).\n\nMeanwhile, if you're a woman, if you don't have career ambitions or aren't talented in some field, you won't get dissed by society. [If anything, men will see you as better wife material](https://link.springer.com/article/10.1007/s10645-022-09412-w).\n\nThis is what we mean by \"tutorial mode.\" Men these days are expected to have the full package: [looks](https://link.springer.com/article/10.1007/s40806-017-0092-x), [race](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4631383/), [height](https://www.sciencedirect.com/science/article/abs/pii/S0191886913000020), [money](https://www.sciencedirect.com/science/article/abs/pii/S109051381730315X), etc.\n\nThis is why many men are struggling today. Many women, on the other hand, have none of these expectations placed on them by society.\n\nAnd these FtM men were not aware of the biggest JBW they had: [just be a woman](https://www.tandfonline.com/doi/abs/10.1080/14792779543000002). They fell for the line that men have it easier.\n\nAnd when they transition, the reality hits them like a fucking train. All the social privileges they took for granted have suddenly vanished like smoke in the air. But since they've grown up as female-presenting, they haven't developed the necessary coping skills to deal with the difficulties that come with being a man.\n\nBeing a man in the West is a constant battlefield where you're competing with other men for resources and women.\n\nThis is why I always say obsession with self-improvement for the sake of getting puss is a form of female supremacy. All the redpill gurus and PUAs are telling you to have money, interesting hobbies, ambitious goals in life, a gymmaxxed body, turn yourself into Thanos and travel to Vormir to get the Soul Stone, but for what?\n\nThe average woman, [who is overweight](https://www.medicalnewstoday.com/articles/321003#:~:text=One%20of%20the%20commonly%20used,the%20category%20of%20%E2%80%9C%20overweight%20.%E2%80%9D) and [much more prone to crying than the average man](https://journals.sagepub.com/doi/10.1177/1069397111404519).\n\n\"I want my man to be accomplished and have ambitious life goals?\"\n\nBut what have you accomplished? Do you own a startup and employ people? [You got a liberal arts degree](https://www.amacad.org/humanities-indicators/higher-education/gender-distribution-bachelors-degrees-humanities), and [now you work in retail](https://www.census.gov/content/dam/Census/library/publications/2020/demo/acs-44.pdf).\n\nRedpill dating coaches telling you to improve to get women are the real simps.\n\nAnd the people in this post have not yet realized this. They're in for a wild ride, I can tell you that much.\n\nDon't be a free agent in life. Let the truth guide you.",
    "title": "Trans men reveal how toxic society is towards men--MANY sources included",
    "subreddit": "MensRights",
    "timestamp": 1686926079,
    "score": 1027,
    "keyword": "mixed race director"
  }
]