[
  {
    "text": "Guys I need some help, got suspended from my job for unfair reasons So I have been employed at a restaurant that is corporate for 7 years. Never had any write ups, never had any reprimands, nothing. Always on time, always the one to volunteer to work extra. I serve, bartend and hourly manage. Haven't called out a day in over 2 years and that was when I had the flu. When the gm wants to leave early, I am the one that picks up the slack so they can leave.\nAnyway, we have had alot of complaints lately through email about service in the restaurant, especially how rude the host stand is. The host stand is one of the areas I am in charge of so I have been feeling alot of heat from this. We have nothing but kids on the host stand (I am in my 40s), so I decided it was time to put my foot down and I had to get stern with them. I told them to put away their phones, stop eating at the front, stop going to the back and flirting with the cooks and to do their job. Stuff I have been trying to get them to do all along but they haven't been.\nSo I get called in the office yesterday and told I am suspended until further notice and under investigation because my name came up for saying discriminatory remarks towards certain races. I said that was ridiculous and asked what was supposedly said. The manager wouldn't tell me. Just said they will complete their investigation and let me know. \nI feel like these kids have all ganged up on me and made up things to get me out of there. I have been called \"mean\" by them alot lately. I know things are sensitive in corporate and they have to take allegations seriously but how can they get away with this? \nAn amusing thing about this is I am white, they are basically accusing me of being racist and my husband and children are mixed race. I just don't get it and need some serious opinions and advice please.",
    "title": "Guys I need some help, got suspended from my job for unfair reasons",
    "subreddit": "jobs",
    "timestamp": 1549822933,
    "score": 2,
    "keyword": "mixed race principal"
  },
  {
    "text": "I think this roommate might be grooming a young girl. I'll do my best to be clear with this information, but honestly my heart is pounding like crazy. I don't want anyone to get hurt and I'm trapped with indecision. So, I've made a throwaway account because I need some place to put all these feelings I have.\n\n&#x200B;\n\nObviously, specific information is hidden for the sake of privacy. The beginning is going to seem to go on for a while, but I want to get all of this information of my chest so that I get the best help to understand what's happening.\n\nSo there's me (28m), my gf (25), our friends Mary (26f) and James (31m), Barry (27m), and Sam (13f)\n\n&#x200B;\n\nI live in a decent neighborhood, economically speaking. It's mostly middle-class with free wifi at the shopping centers, farmer's markets on weekends, and middle school parades through the neighborhood for holidays or the local football team. My block is a mix of town houses and apartments, which is where I and many of my friends live. I have high functioning autism as well as ADHD, so I tend to be a little \"outside the lines\" when it comes making friends and hanging out, which means I know my fair share of who I like to call neurodivergent people. \n\n&#x200B;\n\nOne of my friends, let's call him Barry, I've known for almost 10 years. When I first met him, he had been walking around with a hat with fox ears and a matching tail hanging out of his back pocket. He shares an apartment with three other guys and we're similar in age. We bond over our love of video games and anime, although when it comes to anime all he wants to watch are harem themes, where one boy/young man (the hero) is surrounded by a supporting cast of girls/young women who all want his attention and it just isn't my thing.\n\n&#x200B;\n\nAt some point, Mary moves in as she's dating James, who lives there. Eventually her and James, my gf and I all become pretty good friends. As for me and Barry, over time our relationship has become very strained. When I told him that I couldn't come over to hang out one day, he tried to tell me that I hurt everyone around me by jerking their feelings around and don't respect other people's time. When I started to date my current partner, who is also Barry's and Mary's mutual friend, he held an intervention at his house to tell us that we're spending too much time together and it's destructive to our other relationships.\n\n&#x200B;\n\nOne day, Barry and I were talking about consent and sex positivity. I reveal that one of our friends (who doesn't live in the house) had loudly slapped my gf's butt out in public and that isn't remotely cool at all. Barry's attitude was \"You don't get it. He's just like that. He's always been like that. Why is that a big deal?\" We argue for hours about respect and how women fight an uphill battle for basic shit. He continues to take the stance that I'm misinterpreting the event. He infers that women act like gold-diggers because that's just biology (what). . . and then he says \"If it's the end of the world and she doesn't want it, it doesn't matter. ***The preservation of the human race is way more important, wouldn't you agree?***\" I leave and blow off everything with him, now realizing that he is an actually full-blown nightmare person.\n\n&#x200B;\n\nThat was early last year. Now, the only time I see him at all is when I come over to hang out with Mary or James, since they all share rent together. But lately, Mary has been telling me that Barry has been going to a small, out of the garage dojo ran by an old instructor on the other side of the block (roughly twenty-five minutes away by foot). There's maybe anywhere from 8-12 student there during a lesson and I knew Barry had been attending for all these years. These days, he's essentially the instructor's protige, sometimes leading classes, and will pay special attention to the one and only young girl there who's about to start high school, Sam. Apparently, Barry and Sam text every day, asking what she's doing, how her day was, how her family is doing, how's school. And he's been doing this for years.\n\n&#x200B;\n\nHe's positioned himself as a pillar of support for this young girl over the last 5-7 years, since her parents started taking her to the dojo. He's openly told me that he's depressed and that he \"doesn't want to be a wizard,\" meaning a 30-year old virgin. He's said that \"age is just a number and girls mature faster than boys\" and that he's \"good at playing nice for parents.\" His notification tone for her texts is a loud cat's meow. \n\n&#x200B;\n\nI worry that he may be manipulating her, filing her head with nonsense about the way boys and girls are because of \"biology\" or grooming her to act \"properly\" for his tastes in anime lolis. He's quick to anger, works out, and is a walking Dunning–Kruger effect, interupting people often just to be loudly wrong.\n\n&#x200B;\n\nSo, there you have it. I don't know what to do. I've thought about going to the dojo and speaking to the instructor directly about this. Chances are that he has Sam's and the family's numbers, but I wanted to see if there's other options available OR if I'm way out of bounds here, acting paranoid, and trying to pry into a teenager's private life for my own sense of warped sense of safety or morality. I honestly feel crazy about this and need more feedback.",
    "title": "I think this roommate might be grooming a young girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1546563688,
    "score": 18,
    "keyword": "mixed race principal"
  },
  {
    "text": "My first dating experience was a wreck. Throwaway because the person described knows my Reddit username.\n\nIn my third year of college, I met a guy online through a game and became friends with him. He lived many states away from me in the US and I knew he was older than me. We chatted daily and played together.\n\nThis fast friendship continued into my senior year. We had been playing a different game together and voice chatting more often. I think I was actually charmed by his voice. It was deep and rich, and he had a great laugh. I didn't expect him to be incredibly good looking, but he was kind and funny, and his breadth of experience as an older guy (I didn't know then how much older) was very appealing. He was easy to talk to, and I confided in him. I had been seriously struggling with undiagnosed clinical depression and anxiety. I think he thought of me as a side hobby of sorts. Just a problematic girl he met online who he wanted to help. \n\nI confessed to him, and was rejected. He seemed more incredulous that I would want a relationship with him.\n\nI was always open to him about my life. He knew how old I was, what I sounded like, even what school I went to. On the contrary, I knew very little about his appearance or height, or even his race. After I showed him my picture, he was surprised because apparently he expected me to look like Sadako from The Ring. The compliments felt good to receive, even though it hurt that he thought I was so scary/unattractive. I'm a 175 cm (5'9\") Asian girl, and at that time, I was 115 lbs. The next day, his tune changed, and he seemed to be considering the relationship. And then later that week, he said that I should be happy, because he had reconsidered my feelings for him and was willing to give the relationship a go.\n\nMy feelings at this point were already mixed. That day, when I confessed to him, I had asked to see his picture after I showed him mine. But he was evasive and ended up showing me a picture of him from many years back, when he was in college. When I asked for a more recent picture, he showed me one that was incredibly blurry and I couldn't make out any of his features. Then he reluctantly told me that he was 39 years old. I had known he was older, but never in my wildest dreams had I expected him to be so much older than me. There was a 17 year age gap between us. Relationships with such age gaps often do work out, but I was still super concerned and immediately knew that my strict Asian parents would NEVER approve of him. \n\nAll of this was obviously raising flags and I was now regretting confessing to him, but when he said that he liked me back and wanted to progress with the relationship, I hesitated to go back on my word. I had never dated before and was a complete virgin, and honestly, I craved a relationship. I wanted to feel desirable, to feel loved and attractive. We started dating. For us, that meant phone calls lasting 4-6 hours and many texts in between. He encouraged me to seek therapy for the panic attacks and suicidal thoughts I kept having (senior year became very stressful, with all the looming thoughts of the uncertain future ahead). For that, I will always be thankful to him. No one else in my life had ever told me to go into therapy. My parents told me I would get over it and that this was a phase that everyone went through. He was the first person to tell me that it wasn't normal to think about how I would end my own life on a daily, if not hourly, basis.\n\nAnd then, after a few weeks of daily conversation, he showed me his body and face.\n\nTo be honest, I was completely repulsed. I feel bad saying that about anyone but I would have never wanted an intimate relationship with him if I had seen his appearance beforehand. Everything about him was simply not my type. He was very overweight (although he was working hard to lose it) and much shorter than me. 17 years older than me and balding. I started realizing this would never work. I had fallen in love with his personality, but I could not feel even an ounce of attraction to his body.\n\nThis is important, of course, because he also taught me about phone sex and sexting. I became very good at moaning, because I knew it turned him on. However, I could never bring myself to actually imagine his body on top of mine. It scared me a little. But for him, it was all too easy. He would tell me about erotic fantasies he had about me. He seemed to always be thinking about sex, and masturbated to porn frequently. I was happy to think that he found me so attractive, but at the same time, I was pretty scared.\n\nI told him once that I was hesitating, that I liked him, but was not attracted to him. BUT I was willing to still give it a try, that maybe I would get over it. He must have sensed these feelings growing in me after he showed me his picture, because he totally assumed that I was dumping him and had apparently planned to lash out at me. His vengefulness and anger was frightening. I don't remember everything he said then, but one thing stuck: He thought I at least owed him sex.\n\nI think I was too much in shock and too overwhelmed by my mixed feelings to realize how concerning those words were. He was never a bad person. I think now that he was seriously lonely and thought of me like a rice cake dropped into his lap from the sky. At almost 40, his dating opportunities were becoming rather slim. He told me that I was his \"last chance\" to find love and marry, have kids, and live the rest of our lives together.\n\nAnd so... my chance to end the relationship decisively slipped away from me, and we continued dating. He made plans for the future, and I continued worrying and doubting. He booked a flight and planned to come see me, and I continued to dread actually meeting him. I know I should have told him clearly that it would not work between us, but I didn't. I felt bad that he had helped me so much, and that we had spent so many hours talking. I didn't want to have been a waste of his time and care. And most of all, I could not bring myself to destroy his \"last chance.\"\n\nWhen my anxiety about the relationship came to a head, I told him I needed a break. To this day, I regret having not laid things out clearly. But I felt bad about everything, and just wanted to escape from the mess. I knew I was essentially stringing him along this whole time and lying to him, but I honestly never meant to hurt him. I was 22 years old, completely naive, and had no idea how to express my own wishes, how to listen to my body's signals, and how to heed the red flags I had seen along the way.\n\nI offered to recoup the cost of the flight. He rejected that offer at first, but the next day he sent me a very formal text saying he had reconsidered and wanted me to pay $250. At that time, that was a lot of money for me, but I agreed and sent him the check immediately.\n\nI believe I was an asshole in this relationship. I could have avoided all this pain for both of us by listening to my true thoughts and realizing that no amount of worrying is going to suddenly make me feel attracted to a body that isn't my type. He knew, from the very beginning, that I was vulnerable and incredibly naive. I had a lot of fault in this, but he also manipulated my feelings and withheld his appearance and personal details (namely his age) from me until it was too late for me to easily back out. He KNEW that I would find him unattractive, and so he kept me in the dark for a long time.\n\nI wrote all of this to finally process my lingering feelings. It's been 2 years since then and I'm in a loving, non-long-distance relationship with someone else. I'm even getting married soon, but I still have pained thoughts about my first boyfriend sometimes and I realized that I never really got over it. I'm scared to invite criticism, but I know I need to hear it.\n\n(Edited typo about my height!)",
    "title": "My first dating experience was a wreck.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1561470315,
    "score": 22,
    "keyword": "mixed race principal"
  },
  {
    "text": "Rant: Men Commenting on My Smile Background: I'm a 20-something female, mixed race (but White passing), and I've never really been one to smile. I just don't. This has led to multiple comments throughout my life of looking \"angry/RBF\" but whatever. I smile when I want to, when I'm happy and it's appropriate. Not all the time. Also I currently work for a school photo company doing portraits and have a Disney pass.\n\nRant:\n\nThis week at work we were training for the season. We practiced taking photos but I also volunteered to model since free semi-pro photos, why not? Boss is male in his mid 50s and Hispanic. Coworkers are almost completely non-White. Handful of blacks, mostly Hispanic. 50/50 male female.\n\nWe were there for 4 days. Between days 2-4 my boss felt the need to comment on my smile in front of other people. Started with me modeling. I gave what I think of as my best smile. It's a big smile. Photo taken, I relaxed and the photographer got feedback. Boss commented, \"I don't know if you're clowning around.\" Next photo taken, same smile, same comment. I laughed at something afterward, almost like I was embarrassed. Boss, \"*That's* the smile I want to see.\" I even told him, \"This is my natural smile,\" when I gave my best smile after he made the same comment the second time. Just ugh.\n\nDay 3 he made another comment. I can't remember specifically what but he said it after I was modeling again. Over lunch I had been telling a more experienced coworker who was just there for that day that boss had made these comments. She was sympathetic. While I was modeling she was watching and giving feedback. After boss commented I went up to her and whispered that he said something again. Just ugh.\n\nDay 4. This time I wasn't even modeling. Last day of training so boss was going over key details one last time and answering questions. We had been critiquing photos taken in the field by experienced coworkers that week and I think talking about forced vs natural smiles in these shots. Something of this context I think. Boss, \"I had even teased (OP) about her smile.\" Me in my head, \"That was an unnecessary comment, especially in front of everyone, and also that wasn't teasing to me.\" Made me mad. Just ugh.\n\nHe's generally a nice boss and I've never taken issue with him. I've trained with him every time. Great personality, knows how to engage people who are there because it's a job, he can make people laugh but bring them back down when it's time to be serious. Never had an issue with him before this week. I like him but those comments were just ugh.\n\nThen there was Disneyland. DISNEYLAND.\n\nLast night I went. I go a lot and I know how to get through security as fast as possible because f*ck that line. Bf and I bring only what's necessary (phone, wallet, keys, jacket) so we don't get a bag check. Last night I had my passport because I needed photo ID but my current license has a hole punched through it while I wait for a new one in the mail.\n\nDumped my phone, wallet, and passport in the tray and got the ok to walk through the metal detector. Turned to grab my stuff and wait for bf to pass. I had my things in hand when a guard turned to me. \"Excuse me, miss.\" We made eye contact. I hadn't set anything off or otherwise caused necessary attention to myself but thought he might be telling me to be cautious because he'd seen my passport in my hand. How I wish.\n\n\"You're gonna need to find your smile before you get to the park. They're not gonna let you in without it.\"\n\nWHAT THE ACTUAL FFFFFFFFFFFF. I'm fuming reliving this to put it into text. Forgive.\n\nI didn't know what to say. Couldn't come up with some snappy comeback fast enough but my eyes were dead set on his. I thought about telling him off, telling him that's inappropriate or asking him why my smile is any of his business.\n\nNope. With my stuff in hand and without losing eye contact I decided it best to just put my phone and wallet in my back pocket and walk away a second or two later. Dumbfounded. This guy was security.\n\nTold my bf what he said. Bf said, \"If it's the guy I'm thinking of then he was checking you out.\" I described him. Yes, that was the guy. 6', White, full beard, glasses, about 40yo. I only wish I looked at his nametag.\n\nThinking about reporting him. I know the time I was there, where I was in security, a description of someone else from security nearby, and this guy's physical description. Only thing is I don't have his name and he looks like *several* other guards employed by Disney.\n\nI don't get why men feel the need to say something about my smile. Does it matter that what I think is my best smile doesn't look like that to other people? No. If I had been a customer my mom would've bought the picture. Does it matter that I don't smile going through a metal detector? No. The fun is in the park, not being waved down with a metal detector wand by a guy who needs a boner to kill time at his job. Hell that guy was a mood killer and I was going to Star Wars Land the second day it was open.\n\nOnly regret is not speaking up. I thought about privately telling my boss that what he said hurt. I even said the first day when he commented that it was my best smile. End of story. No more comments should've followed. What I wish I'd told the guard was, \"You see this smile? I'm gonna take it to City Hall and report you for that unnecessary comment. What's your name, sweetheart?\" Wish I could've watched his face go pale, too.\n\nRant over. I think I'm gonna go get a hot drink and a donut and appreciate the fact that my bf, the only male in this world whose opinion matters to me when it comes to my appearance, tells me daily I'm sexy and beautiful and that he wants me.",
    "title": "Rant: Men Commenting on My Smile",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1559491272,
    "score": 0,
    "keyword": "mixed race principal"
  },
  {
    "text": "Me: 1, Crazy Mom: 0 This is the story of my last week. The saga ended today...\n\nSo, like many if you I keep snacks at my desk; an assortment of chex mix, cheese puff balls, and peanuts. I know what some of you might be thinking \"What about your students who are allergic to peanuts?\" Well, severe allergies like that are required to be reported on 504 just like if a kid has diabetes, seizures, or severe asthma. If a student could go into anaphylactic shock from their prescence in my room, I wouldn't eat them at school.\n\nOn Wednesday after testing concludes, I have a new student in my 7th period class; nice kid, seems bright, and quiet. Anyway, I grab a handful of peanuts in my class and start eating them while  we watched an episode of Andy Bourdain: Parts Unknown. Fast-forward to Thursday morning and I get an mail from the mother of said new student. The email said \"I am utterly appalled at your utter disregard for the safety of your students! Nut allergies are a serious and life threatening condition and a student can die just from being exposed to the slightest hint of dust! People like you have no business teaching or working around children!\" Yes, every sentence ended in an exclamation mark.\n\nI responded saying I understood her concern, our policies regarding food and allergies, and azkwd if there was an issue with her student we should be aware of. Nothing happened again until 7th period when said student walked in the room. He immediately went to my desk and asked if my mom really emailed him, and I said yes. He replied, \"I am so sorry. My mom is batshit overprotective of us. She told us eating peanuts straight like that is poisonous. Like, I'm pretty sure she tracks our every movement on our phone cause if we take a slight detour home she texts us worried. Anyway, my sister has a slight nut allergy, just can't eat them and sometimes get a rash if someone by her is eating peanut something nearby.\"\n\nFriday, I get an email from my principal about arranging a meeting with everyone, and it was scheduled for today after school. My student was practically embarrased as we walked down to the office together. Everyone sat down and the meeting started, and here's out it went...  \n\nCM: Miss Snowymacie is endangering not only my son, but all of her students!  \nP: Okay ma'am. What exactly is she doing?  \nCM: She's eating peanuts in class!  \nP: Excuse me?  \nCM: You heard me.  \nP: (annoyed)... Is your son allergic?  \nCM: (appalled) Well, no.  \nP: ...(annoyed) I am certain Miss Snowymacie is aware of her students' medical conditions listed in documentations, including allergies. While I understand your concern, unfortunately there are over 4,000 students, faculty, and staff on this campus, which makes it impossible to dictate what people bring from home. If someone does want to refrain from bringing something which can trigger allergies, it's up to them.  \nCM (upset) Well, do you let your staff or even students bring alcohol or drugs!?! How do you she didn't spike that Dr. Pepper's she drinking?  \nP: (done with this nonsense) Completely different issue ma'am, legally, ethically, policy wise and everything.\nCM: (scoffs) This is a public school. It should be accommodating to all children!  \nP: I agree ma'am, which is why we take every precaution we can in our food preparation and in our cafeteria in general. If someone was so allergic that we had to ban students and teachers from all nut or any food product on campus, I would, but otherwise it's an unnecessarily strict and overbearing policy. Until that occurs, we do everything we can with what we know, not hypotheticals. You daughter is also a senior at our school and as far as I am aware, never had an emergency on our campus.  Now, is there anything else you'd like to discuss?  \nCM: (fuming) I'm going to report this to your boss!  \nP: Okay ma'am. Have a good afternoon.  \n\nAfter the meeting...\nMe: Do they ever go to your boss? \nP: Nope. But maybe next time don't eat nuts in front of kids, just in case.",
    "title": "Me: 1, Crazy Mom: 0",
    "subreddit": "Teachers",
    "timestamp": 1571780891,
    "score": 450,
    "keyword": "mixed race principal"
  },
  {
    "text": "Is Anyone Else NOT Looking Forward to the Start of Another School Year? This will be my 30th year in the classroom. I'm dual certified in elementary (17 years including 8 years abroad) and secondary (Culinary Arts, this will be my 13th year).  I work at a rural Title 1 school for the Clark County School District, This will be my 5th year at this location.\n\nWhile other teachers eagerly look forward to the start of the new school year, I suspect that my autism keeps me from sharing similar sentiments. I have NEVER enjoyed the start of a school year because for me there are always too many uncertainties. What will the chemistry of each class feel like? Who (if anyone) will be my \"problem\" kids? How many of my kids will be able to support the Culinary Arts program through the payment of their annual $40 lab fees? Who will become financial burdens to the program because they'll submit waiver requests to be excused from paying their lab fees?\n\nI especially hate the first two weeks. Teachers report back to work next Wednesday and we'll start with professional development, getting to know you activities, and excruciatingly boring looks at student data to identify which reading, writing, and math standards the kids did well in and which will need additional focus during the coming year.\n\nEven though I don't teach reading, writing, or math, the school's education coordinator makes me attend these sessions because she says that my culinary students read recipes and measure ingredients.  To my way of thinking, this nebulous connection could just as easily be applied to making me attend an in-service for science teachers because my students measure and mix ingredients.\n\nThe first week activities with my students are always boring. After taking first day attendance, each student has to sign the master attendance roster. I then assign seats because part of my problem with autism is that I have poor facial recognition skills. Since people of a similar age, ethnicity, gender, and physical build tend to look the same to me, it's far easier for me to take attendance with a seating chart as opposed to looking around the room to check off names. It invariably occurs that some students will \"forget\" and move to another seat during the coming days and weeks. Although I usually catch this because the student is sitting where no student has been assigned, it annoys me when students can't (or won't) follow basic expectations.\n\nI will have to go through school rules, classroom rules, and my expectations. I will have to pass out a course syllabus for each class and fully expect to answer 30 days into the school year, basic questions that I covered ON THE FIRST DAY regarding the culinary dress code, the payment of lab fees, or the submission of waiver requests. There are times admittedly when I feel as though I should just record my oft recurring expectations on my phone to play back as needed. (sigh)\n\nI much prefer school after the first month when we've all settled into a basic routine.  The students know where they're supposed to sit. They've paid their lab fees (or have  submitted waiver requests) and they know enough to pay attention to my short powerpoint slide show or production demonstration video so that they'll know what to do in the kitchen. Once we're in the kitchen, they know how to set up their workstations, how to don hair restraints and to wash hands (according to the health code) , and how to read and follow the sequential directions of their recipes.\n\nMy stress levels for the coming year are higher than usual because in addition to the normal uncertainties that accompany the start of the school year, the union has called for a strike, the date, time, and location of which have not yet been announced. In the aftermath of the superintendent's decision to rescind the termination of all junior level administrators in the district by laying off 170 deans along with 25 assistant principals, my principal has decided to eliminate the dean's slot at my school. Although she's posted a vacancy for an assistant principal, there is no certainty that my former dean will be hired. if she isn't hired, she'll have to transfer back to Vegas assuming she can find a job as a dean, an AP, or as a teacher. If she winds up leaving, who will my new supervisor be and will this person be as caring and as supportive as the dean was? I don't know.\n\nTo cheer myself up, I've been making some of my favorite foods. Pictured below is my Sunday dinner ... chicken fried tenders with a twice baked potato that was covered with cheese prior to being smothered under country gravy. The potatoes were then sprinkled with salad toppings and chopped green onions.\n\n&#x200B;\n\nhttps://preview.redd.it/o1kleqlvvje31.jpg?width=532&format=pjpg&auto=webp&s=92e1db7f1d0495de888dd3991401f2ade8b1b8d4\n\nAfter enjoying the luxury of a mid-afternoon nap, I indulged in one of my favorite hobbies. Pictured here is a blueberry Danish soap that actually smells like a blueberry Danish. I enjoy making food themed soaps to give to friends, colleagues, and relatives as unique one of a kind gifts. This particular soap was made using goat milk's soap and glycerin.\n\n&#x200B;\n\nhttps://preview.redd.it/nhl0r13cwje31.jpg?width=5312&format=pjpg&auto=webp&s=4c575dd7662e0bf29d909776710fcccaa463b3c3\n\nWhile other teachers began to voluntarily report back to work as early as last week, I'm not planning on going to work until I'm actually required to go to work.\n\nIt won't take me long to set up the kitchen. I will just have to wheel the stainless steel wire shelving into place and to pull off the plastic coverings. Microwaves, plastic dish racks, and red sanitizer buckets will pulled out of the storage closet to place at work stations. Bulletin boards will go up. A few posters will add color to the walls. Tables will be pulled into place and chairs will be added.\n\nFrom start to finish, I can have the classroom and kitchen ready to go within 1 day. Since I'm not a core academic teacher, I don't see any point in reporting back to work any earlier than I absolutely have to.\n\nDoes anyone else feel the same way? Just wondering.\n\n**Edit 8/5/2019:** Thank you all for your replies. It makes me feel better knowing that I'm not the only one who feels this way. I'll be fine after the school year starts. It's the back to school jitters and all of the in-service training and meetings that admin says we have to have that I find unnerving ... that and the fact that by nature I'm a reclusive introvert and after 2 months of self imposed isolation, it's hard for me to force myself to interact with others. \n\nI'll be fine AFTER we get back in the kitchen. I like my kitchen routines. I don't have much interest in all the stuff that leads up to it. Since students need to have time to reorganize their class schedules, it doesn't help that my building admin won't let us to to the standards from Day 1. We have to do orientation, preassessment testing, and getting to know you activities for the entire first week. Instruction doesn't begin until the 2nd week of school.  \n\nhttps://preview.redd.it/rp6xnyudyje31.jpg?width=1280&format=pjpg&auto=webp&s=9016d918ec96702f28f0dd39fc3aa1708fba31ff",
    "title": "Is Anyone Else NOT Looking Forward to the Start of Another School Year?",
    "subreddit": "Teachers",
    "timestamp": 1564977264,
    "score": 28,
    "keyword": "mixed race principal"
  },
  {
    "text": "Students have a problem with Frederick Douglass? Help! Alright... I have 2 students, siblings, who do not want to read *The Narrative of the Life of Frederick Douglass*...because of the way white people are portrayed.  They approached me about it--adamantly stating, \"We NEED a new book.  I do not want to learn about slavery.\"  They said that they were uncomfortable about how white people come off in this text.   I told them that for now, my answer was no because this a classic piece of literature, it meets the standards, and works with the interdisciplinary unit we're in with their US History class.  After this conversation I conferred with my department head and she was with me on this.  We even sent an email to admin and our principal said that a parent would have to call in for this to change... so of course, after school, I get an email from my principal that I have to meet with this parent.  This is a big enough problem for them that I have to meet with their parent and my principal about it!  I'm just taken aback by this...\n\nThey didn't want to read *Kindred* with the rest of the class because there is sexual abuse in it, which is completely understandable.  I developed an independent study for them.  They do a little bit of googling for each section about historical context, and then they read and answer guided questions.  I looked over the questions--and really they're mostly about Douglass himself.\n\nYes--the first chapter is a bit gory and violent.  This is the only thing I could see the students have a qualm with, however, based on the work they've completed, it seems that they've only read the introduction--which is written by William Lloyd Garrison.\n\nAnd, of course, I can't ignore the race thing here.  The students here are white.. and have expressed to another teacher that they've been accused of being racist before.  Clearly they are uncomfortable with race--but discomfort happens when people learn.  Learning is hard and uncomfortable..\n\nHas anything like this happened to you before?  I'm kind of shocked... and a little lost at what to do.  This text is a classic--I've seen it taught anywhere from middle school to college level.  It may be the first time these kids have come across it--but it won't be the last.\n\n&#x200B;\n\nEdit: I should add that this is a 10th grade English class.\n\nEdit: I added more details about what happened.",
    "title": "Students have a problem with Frederick Douglass? Help!",
    "subreddit": "Teachers",
    "timestamp": 1572749164,
    "score": 18,
    "keyword": "mixed race principal"
  },
  {
    "text": "Kid quote of the day... (H.S.) “I’m not afraid of my mom, she’s white.”\n~a mixed race sophomore boy with lots of teenage attitude \n\nContext: one of the table groups was discussing how their parents react when teachers call home.",
    "title": "Kid quote of the day... (H.S.)",
    "subreddit": "Teachers",
    "timestamp": 1550194970,
    "score": 17,
    "keyword": "mixed race principal"
  },
  {
    "text": "This is why racial “jokes” are never okay \n\nLong post, bear with me.\n\nLast Thursday a 6th grader (white) went up to several classmates (black) and called them the n-word. Immediately of course, there was an uproar. The student claimed that in his Latin class they learned the names of the colors and that the word for the color black is “niger,” which is what he was referring to as a joke. Personally I don’t believe him, but regardless, the matter was dealt with and he was suspended for a day last Friday. His parents were very supportive and horrified that their son did this. The students he had said it to seemed alright after they talked it out with the principal. \n\nThe problem is that since then, we’ve had numerous race related issues pop up, which never seemed to be much of an issue before. Sure we have fist fights and arguments and such happen, but it always seemed to be normal teenage drama shit, not necessarily motivated specifically by race. \n\nExample 1: On Friday, a black male student in my homeroom (7th grade) shouted at a white girl and called her racist, and she screamed back at him that he was a jerk and was always running his mouth at her. In talking with them both, the boy claims that she was taunting him, claiming she was going to call him the n-word if he didn’t shut up. When I spoke with the girl, she claimed this was not true, and that he had referred to her as a “stupid white hoe.” \n\nExample 2: That same day, two black girls in my class were having a conversation in which I heard one of them say “I can’t believe that kid didn’t get expelled. This school hates black people.” (Many black students are outraged that the 6th grader who started this got “only” a suspension).\n\nExample 3: again on Friday, an 8th grader wore a shirt to school that said Black Lives Matter. The problem is this is a parochial school so we have a uniform. When he was told he had to change into his uniform, he said “so you think Black lives don’t matter?” And he repeated that all day.\n\nExample 4: in one of my 6th grade classes I’ve got two students who sit sort of near each other who tend to annoy one another. One is a black girl and the other is a white boy. Sometimes they bicker, just about stupid shit- like “stop tapping your foot, it’s *so annoying!!*” But the point is it’s always petty stuff that has nothing to do with race. It’s just kid stuff. And to be fair, the boy tends to annoy just about everyone no matter where he sits, and the girl argues with lots of other students too. Today they were arguing about the fact that the boy apparently found a pen on the ground earlier that day that the girl claimed was hers. One thing led to another and the girl shoved the boy, who shoved her back. It only happened once, I stepped in and shut it down, talked to each of them, and separated them. After that they were fine the rest of the class. At the end the girl even went up to him and apologized for starting it. I thought it was over, although I did plan to speak with both their parents just to alert them to what happened.\n\nAbout 5 minutes later as we’re switching classes, there’s a ton of kids in the hallway saying “did you hear? L & R got in a fist fight in class and are getting suspended!” I explained that was not what had happened at all, and that it had been already dealt with. But despite what I said, that version of events must have gotten around. Because after school my principal calls me in and asks what happened in class. I explained that it was a disagreement that led to shoving, but it was over with quickly and that I had dealt with it, and that the girl had apologized to her classmate. My principal sighs and shows me an email she had just received from a parent (not one of the students involved) who was berating her for allowing so much racially motivated violence and inappropriate language within the school. The parent also claimed that her daughter told her in my class two students got in a fist fight over race and punched each other in the face (not true), that I had done nothing to stop it (again not true), and that she wasn’t sure she felt comfortable sending her daughter somewhere where teachers hold no regard for black people. And she again references the situation last week and believes the student who said the n-word should have been expelled and not just suspended. \n\nAfter speaking with my principal, she said I handled it just fine and that she would deal with this mother.\n\nI’m just concerned that one incident (albeit a serious one) has opened up a whole can of worms. I feel that people are making everything out to be racially motivated when I don’t actually think that’s the case. Just because two students argue about something, it doesn’t mean one of them is racist. But because this happened, now all of a sudden everything is about race. It’s very frustrating and I worry that something larger is going to happen if this doesn’t get addressed.",
    "title": "This is why racial “jokes” are never okay",
    "subreddit": "Teachers",
    "timestamp": 1574135145,
    "score": 13,
    "keyword": "mixed race principal"
  },
  {
    "text": "The Angry Parent and the Case of the Lemon Crisp Cookies &#x200B;\n\n[Lemon Crisp Cookies](https://preview.redd.it/1zpkhxgmynm31.jpg?width=797&format=pjpg&auto=webp&s=c5bad4fca2db861dc20ad51163a0aefce2ef2947)\n\nA TOSA teacher (teacher on special assignment) serving as an acting dean of students in matters of school discipline, went to bat for me last Friday. \n\nI teach Culinary Arts at a small rural Title 1 high school. On Friday an angry parent came to school to share her complaints with the principal about another teacher. Her daughter was pulled from an English class to share her version of events. While the girl was in the office the bell rang and her English class ended. After five minutes another bell rang marking the start of my Culinary Arts class.\n\nSince I didn't know that this particular student was in the office, I marked her absent. After introducing the lesson, we went into the adjoining kitchen where the students used Kitchen Aid mixers to mix lemon crisp cookie dough. After mixing the dough, the students rolled balls of dough between their hands prior to rolling them in powdered sugar and placing them on sheet pans lined with parchment paper in four rows of three.\n\nThe cookies were in the oven when the student who had been in the office, (I will call her Maggie which is not her real name), came to class. Since she arrived too late to participate, she was asked to sit out. \n\nAfter class ended, the TOSA teacher sought me out to tell me about a parent complaint that had been leveled against me. It seems that Maggie had complained to her mother that she hadn't received any lemon crisp cookies. \n\n\"But of course she didn't receive any cookies,\" I said. \"She was late to class, she missed production, and since she didn't help to make the cookies, she didn't receive any.\"\n\n\"I can work with that.\" The TOSA teacher left to call Maggie's parent. \n\nHe was back five minutes later. \n\n\"Maggie's mom wants to know if you could just give her some cookies.\"\n\nI shook my head. \"The cookies were already distributed. There is nothing left to share.\" \n\nLeft unsaid was the fact that Maggie had never even submitted the $20 lab fee needed to support our culinary program. I also didn't tell the TOSA teacher that while the students in Maggie's group could have given her some cookies, they chose not to. Some have previously complained about Maggie's abrasive behavior. \n\nWhile I understand that I work in a Title 1 school in an area with an 18.4% average poverty rate, I sometimes wonder about the sense of entitlement among some families. While I haven't met Maggie's parents,  I have met other parents who have come to school to submit waiver requests while reeking of alcohol or tobacco. \n\nHow is it that some parents have money for alcohol or tobacco while not having any funds for student lab fees? For that matter, why does Maggie have a late model smart phone if her mother submitted a waiver request? And now she and her mother expect free cookies? (sigh)\n\nThe art and music teachers have suggested that I just pass the cost onto the students. Instead of giving waiver requests, students who can't pay their lab fees have their fees deferred. If and when the students withdraw from our school and need their transcript or if the students graduate and are expecting a copy of their diploma and their transcript, none of these records will be released until their delinquent accounts are made good. Since we're a grade 4 - 12 school, many students could have hundreds of dollars from four or more years of accumulated fees. \n\nInstead of doing this, I collect lab fees or waiver requests. After collecting all waiver requests, I tell the office what my budgetary shortfall is and the office makes up these funds from the school fund. \n\nWhile I don't know how other programs can function with deferred payments, my reality as a Culinary Arts instructor is that I need funds NOW for the purchase of culinary supplies.",
    "title": "The Angry Parent and the Case of the Lemon Crisp Cookies",
    "subreddit": "Teachers",
    "timestamp": 1568515874,
    "score": 13,
    "keyword": "mixed race principal"
  },
  {
    "text": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans? **TL;DR/ Daily objective:** I am posting here seeking resources about research or programs about how U.S. public schools can respond to and change a culture of fighting and truancy. The \"goal,\" is not to expel all the students who've ever caused trouble--the goal is to create a school culture where students don't want to cause serious trouble, and former \"troublemakers,\" can receive and flourish form a quality education. I am hoping that we can compile some crowd-sourced resources including: links to online articles and research studies, names or links to programs with high success rates that our school could look into buying or implementing, book suggestions that contain this kind of information, or other concrete data-based evidence or action plans. Anecdotes would be appreciated, but anecdotes are not evidence and our school can implement a school-wide, multi-year improvement plan based on an anecdote. I will post basic details, then more detailed details underneath this TL;DR/objective comment; if you read this intro and have ideas, go ahead and post them without reading it all, but if you have the time or interest, I will give many details. \n**If you read the title of this post, my TL;DR/ objective right here, or my following detailed information and think to yourself, \"This is stupid, why is this person asking for help on reddit/ trying to fix a whole school/ believing that school culture improvement can happen/ working too hard/ not seeing the red pill ~truth~ and just blaming all the Black students,\" and you would like to make a disparaging or simplistic comment, please reconsider doing so and maybe go do something fun like eat some cheese crackers instead.** \n\n\n**Basic details:**\n\n\n-School location: Flyover state, USA \n\n\n-School demographics: 40% white, 20% Hispanic or Latino, 25% Black, 10% choose not to say/identify only as mixed race; 5% Asian/ Pacific Islander, Native American, and other. \n\n\n-80% of students on free and reduced lunch \n\n\n-Advanced Placement Participation Rate: 15%\n\n\n-Standardized test scores: below state averages \n\n\n-Important/ successful departments and programs: art, theatre, speech and debate, fine arts, music, ballet and dance, pre-career EMT, pre-career dental, pre-career welding, pre-career autoshop, pre-career automotive, pre-career fire science\n\n\n-Location part II: in a weird area that covers of dense-population urban areas, suburban areas, and about 20% farm kids \n\n\n-Gang activity in the area: Exists, present in some schools but mostly limited in ours, little to no direct gang affiliations, tags, or threats, but about 5-10% of students have direct gang ties or affiliations; lots of students joke about who is what or call other students members of gangs to call them stupid (\"Yeah well you go ahead and be your dumbass self, gangster disciple motherfucker,\" \"Miss, you know I'm Mexican, you can't fail me or I'll sic the Kings on you.\")\n\n\nProblems: Fighting, retaliatory fighting, people wanting to know about and watch fights, understaffed/ ineffective/ elderly/ moderately racist/ lazy security staff, truancy and loitering within the school/ hallway-wandering, phones, sexist comments and catcalls toward girls from boys, horseplay/joking around that turns serious, boys \"just joking,\" around with touching girls when they've said stop repeatedly and genuinely don't want to be touched, \"playing around,\" by taking another student's phone, parts of the school mysteriously smelling like mint/mango/ creme/ cucumber/ fruit/ Virginia tobacco, mysterious rectangular flash drives plugged in all over the place, students who think they can responsibly and reasonably handle their weed but show up smelling like skunks and unable to answer higher-level questions or complete complex tasks, disrespect to teachers, disrespect from a select few teachers who hate teenagers.\n\n\n-Most students are good or fine, typical high school students who are also fed up with people who walk the hallways, who fight, and who disrupt classes. But also everyone loves watching fight videos. \n\n\n-Students of all races participate in fights, hallway-wandering, and class disruptions/ disrespect toward teachers. However, Black and Hispanic students doing these activities are seen as bigger troublemakers while white students are more likely to get a warning and no true referral. Also, Black students are more likely to be stopped in the hallway by teachers and security guards and asked for a pass, even students who do not habitually wander hallways but are just genuinely trying to go pee, or really did forget their notebook in their 5th hour classroom.\n\n\n**Heckin' details**\n\n\nWe have a current epidemic of fights. One fight happens, then other students get mad because of who attacked whom, yeah, but also because of who tried to hold someone back, who DIDN'T try to hold someone back, who filmed, why they filmed it (it was funny? it was tea? they were supporting their friends? an attempt to create and preserve evidence of what truly happened? evidence of teacher or police mistreatment? who knows), who previously had beef with the person who was fighting and it got re-ignited, who got suspended or who didn't get suspended, etc, etc... So there's groups of students who are on edge, then there's a fight, then other people hear and try to run toward it, problems emerge while breaking up the fight, students get suspended, they miss classes, they get in bad trouble at home OR don't get in any trouble bc of uninvolved or otherwise \"let's get them back,\" parents, they smoke a lot, they return to classes, they're behind on work and annoyed by how students are looking at them (because everyone knows who was in the fight), students get on edge, then there's a fight, then other people hear it and try to run toward it, then...the cycle continues. \n\n\nWe also have a problem of students loitering/ skipping but staying in the building. There is a core group of students who come to near every class late, leave their materials in lockers, get out of class by finagling a pass from an exhausted teacher or a sub or just plain walking out, they walk to their locker and friends' lockers and stop to pee in the juul rooms, they walk by their friends' classes that hour and wave to them from the windows, OR my favorite, a random wandering student walks into another teacher's classroom and insists on talking to their friend (??? I've had students walk in my door if it's propped open, push past me if I open it assuming the student is a pass-runner, or POUND on my doors making me think there's a life-threatening emergency), the students walk slowly and on their phones, or people scream at each other, fights break out... hopefully at some point, hallway-wanderers will be intercepted by a teacher or security guard. Then they're either simply snapped at \"Get to class!\" and the student looks serious, says they're going, and walks away to wander another day, or they're taken down to our dean's office where they get in trouble. \n\n\nAnd that's another problem; what do we do with students who continue these negative behavior patterns? \n\n\nIt's obvious that students fighting and skipping have no place in the classroom setting and need to be suspended, as punishment for their actions AND to keep them from distracting or even harming other students; obviously we need to suspend or expel troublemakers.\n\n\nIt's also obvious that students are skipping or getting in small fights so that they can get suspended and stay home from school, plus the fact that having troublemaking students OUT of school-- where they have order, rules, meals, staff who care, and access to quality public education, which is a right in our country and a way to lift people out of poverty--is undesirable and possible unethical; it's obvious we have to keep students in school and we can't just give students what they want and suspend or expel them. \n\n\nWe have many teachers and administrators who are prepared to try their best to take our school from okay to great, to make our strengths shine and **fix** our problems, rather than covering them up or kicking them further along the road. Not all teachers and admins are spectacular. But there's enough of us to make changes, as long as we know what changes to make, we work in sync, we reflect on progress, we use our resources, and we have a some but not an unreasonable amount of Jimmy John's work-til-8:00PM sessions. There are also students who are WONDERFUl, talented, hardworking, resourceful, curious, growth-oriented, compassionate, and more. We've had successful community outreach programs (food drives, volunteer programs, community elder outreach), and many students are incredibly frustrated about fights, hallways, and disrespect to teachers, and know that those are some stupid ways to go through life and handle problems. \n\n\nPlease, let me know what you know that can help. I cannot thank you enough for giving me any info to look into and report to my team.",
    "title": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans?",
    "subreddit": "Teachers",
    "timestamp": 1549597210,
    "score": 8,
    "keyword": "mixed race principal"
  },
  {
    "text": "Immediate offer from a huge company after only a phonecall, am I getting scammed? I was contacted by a recruiting agency to interview for a junior role that is a mix of dev with experience from my previous career. I took the phone interview with the hiring manager at the company I will be working with on Friday and it went really, really well. Monday morning I got a call back from my recruiter saying they'd like to extend me an offer, which is amazing. Unbelievable. Almost too good to be true.\n\nI asked my recruiter if he's sure I don't need to do an on-site, and he said nope - it's rare that this happens so quickly over just a phonecall, but that it's not unheard of. This is my first dev role and honestly I was expecting a few challenges and on-sites, and for this to take weeks not days. Am I getting scammed here? How do I know if this is legit? How much of my personal info should I be giving my recruiter? I'd call the principal company to double check that this is all in their records, but they don't have an HR phone number posted online, so I'm a bit at a loss of what to think.",
    "title": "Immediate offer from a huge company after only a phonecall, am I getting scammed?",
    "subreddit": "cscareerquestions",
    "timestamp": 1553634793,
    "score": 38,
    "keyword": "mixed race principal"
  },
  {
    "text": "Not just Grown-ish: Black-ish has a color problem too Been thinking about this a lot and wanted to speak on it. As someone who is lighskin and frequently mistaken for mixed race I try to be very aware of my privilege within the black community and slight advantage in white spaces. I've never been able to fully appreciate Blackish or partake in the hype surrounding it because the majority of the cast seems to be made up of \"safe\" black people. Palatable for white audiences, that is. Other than the little girl, the rest of the family range from light to medium skinned. Half are biracial. Outside of the main family few of the guest characters are dark skinned, and it's always bothered me and kept me from getting into the show. If it's not representative of all of us then in my opinion it's not representative at all. \n\nContrast this with black entertainment in the 70's and even 80's and 90's when seeing dark skin on black shows, even dark skinned women, wasn't as sparse and uncommon. Even though I feel we have more overall representation today, it is less reflective of our features than before from my vantage point. There was less black representation back then but when there was, the characters were predominantly non-biracial black folk. As far as colorism in black hollywood, we've gone backwards. Name an attractive, popular dark skinned (or non biracial) actress besides Lupita and (sometimes) Gabrielle Union. Now compare that to Yara Shahidi, Amandla Steinberg, Tessa Thompson, Laura Harrier, Zendaya. These are the faces young black women in my age group have. It's not as alienating for me because (to a degree) I look like them. But most black women don't. There are no dark skinned equivalents. It really saddens me and as someone who wants to write and direct movies/tv someday, I hope to amend it with my work. More of us gotta start writing content and casting ourselves. \n\nI do see it getting a little better in the music industry. We have Lizzo, a rise in female rappers with regular black backgrounds and black features, although even that has been overshadowed by Cardi B. The new black female artists who've enjoyed the most success, other than Lizzo, are biracial or lightskin. Jorja Smith, Ella Mai, H.E.R (Black passing but still biracial), in addition to Cardi who has had the most. Beyonce and Rihanna still reign supreme. \n\nStill! There's hope. A few years ago I really couldn't see people like Lizzo (or Noname) getting exposure or a chance to become popular. I think the internet has allowed for a lot of people to get platforms they wouldn't otherwise have, which has indeed resulted in oversaturation and mediocrity, but also for some great talents to emerge and get traction. \n\nWhat do you ladies think about this issue?",
    "title": "Not just Grown-ish: Black-ish has a color problem too",
    "subreddit": "blackladies",
    "timestamp": 1556978071,
    "score": 85,
    "keyword": "mixed race principal"
  },
  {
    "text": "Examples of Midwest racism; How do I not take racism personally? Examples of Midwest racism; How do I not take racism personally?\n\n&#x200B;\n\nI am going to give a some examples of covert and overt racism I have experienced as a 26 y/o half black and half white female living in the midwest this past year:\n\n1. Last fall I started my first new job as a therapist in a very white and wealthy area. I go to the school with my white supervisor to first meet with the staff at the school. During the meeting, the staff at the school start talking to my supervisor because they assume she is the therapist and then get shocked/visibly uncomfortable/anxious when they find out I will be the therapist at the school. Ugh, the worst--i felt embarrassed and anxious!! During my first week at the job, one of my white blonde coworkers is visibly uncomfortable and anxious around me. Every time I come into her classroom, she gets anxious and makes comments to show she is not racist such as \"I am going to watch Black Panther tomorrow!\" or \"I love the show, Dear White People!\" or she says to one of the only black kids in the classroom, \"I love your beautiful brown and and skin!\" So awkward and uncomfortable!!! It makes me think she is actually racist/ignorant for trying to work so hard to prove she is not.  Something else she did was she pitied one of the only black boys and talked about how his mother did not care about him and totally had the whole \"white savior complex\" where she tried to save the black kids. She was extra easy on him and let him get away with things more than the white kids and maybe its because she pitied him but also she might think that if she is super nice to him then she won't seem racist. I almost feel like her and the other coworkers were super nice to him to prove to themselves they were not racist and to wash away all the guilt they may have for being racist in the past. I quit that job in less than two months. I feared she would start watching me closely to make sure I didn't abuse the kids or act aggressive/angry like the black mother of the kid or act like the \"black stereotype.\" Anytime I showed anger, she became visibly tense and scared. I didn't feel safe or comfortable in that environment to say the least.\n2. I go into Target in the self-checkout lane and am putting water into paper bags. I happen to look up at the camera and see this white employee behind me watching my closely as I put the water in the bag while she is pretending to fix up some bags. She sees that I see her in the camera and she walks quickly away. As I leave, she smiles and wishes me a good day. I tell her the same. All that passive aggressive, midwestern nice, and covert racism wrapped up in one. Now I understand that the state I live in has a tremendous class gap between blacks and whites. Where most black people are lower class and most white people are middle class. So often I feel isolated being a black mixed race middle class woman.. but it is ignorant for some of these white people to think every black person is going to steal and is lower class.\n\n&#x200B;\n\nI do not feel safe in majority white areas. Sometimes I will drive further away from my home to shop at a Target where it is more diverse (but also a lower class neighborhood) in order to not feel so hypervigilant in white store areas. I have recently started shopping on line so I don't have to feel so on edge while shopping. These racist experiences are very painful and angering, and hits a tender spot inside of me. Every time a white person is racist to me, it feels like rejection like even though I am half white, I will never be one of them. Also, I hate it when people assume the worst of me like I am lower class and will steal just because of I am mixed black. \n\n&#x200B;\n\nSo first off, I am saving to move to a more diverse state. But in the meantime, I am trying to figure out how to not take racism so personally? Like when I experience racism, it ruins the rest of my day as I feel really down. Any advice? Thanks!",
    "title": "Examples of Midwest racism; How do I not take racism personally?",
    "subreddit": "blackladies",
    "timestamp": 1550425404,
    "score": 29,
    "keyword": "mixed race principal"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 512,
    "keyword": "mixed race principal"
  },
  {
    "text": "Feminism and the Duluth Model. Note: In this post the terms \"IPV/DV/PV\" are used interchangeably.\n\n**1) The Duluth Model: The predominant model of domestic violence.**\n\nIn 1981, the Domestic Abuse Intervention Program created the Duluth Model, which was a more structured approach to batterer treatment and it is usually credited as introducing domestic violence into society's mainstream conscience. \"The program was born from the creative energies of battered women and feminist activists, included members of EMERGE, one of the first batterer intervention programs in the country. 13 battered women from Duluth participated in creating the Duluth Model's Power and Control Wheel based on traits and behaviours specific to their own abusive husbands. Later, scientists tested the program's curriculum with a sample group of nine subjects, including five battered women and four abusive men, who had all participated in the program. Based on the results of the test, the Duluth Model emerged as one of the nation's most utilized models for batterer intervention programs.\"\n\n[https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr](https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr)\n\nBefore we move on, let's get something straight here since I've seen a lot of denial around it generally from people who support feminism: The Duluth Model is entirely based on feminist theory. In [this](https://tspace.library.utoronto.ca/bitstream/1807/10972/1/NQ28298.pdf) thesis written by Ellen Pence herself (she is the woman who is usually credited with creating the Duluth Model) in 1997, she says in pages 1 and 2:\n\n\"I am indebted to the Domestic Abuse Intervention Project (DAIP), where I have worked for 16 years. As a group we have been an important part of a historic social movement. We were the first grassroots group to break through the barrier of institutional resistance to establishing community-monitored interagency policies (including policies mandating arrest, promoting aggressive prosecution, imposing increasingly harsh penalties on repeat offenders, and **requiring a feminist based educational model for abusers**). This speaks to the excellence of our group as well as to that of the leaders in our police and court system. To my co-workers and the many practitioners who have lent to my experience and to this specific endeavour, I am eternally grateful.\"\n\nShe says right here that the model is feminist based. Now that we've got that out of the way, we can move on to the main bulk of this.\n\nThe Duluth Model characterises domestic violence as being a primarily male-perpetrated crime caused by \"patriarchal terrorism\", theorising that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. Supposedly, men who batter are using violence to to maintain their individual and societal patriarchal dominance over women.\n\nDAIP itself says of Duluth:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"We still live in a sexist society where women are devalued, where many men believe they are entitled to be in control in an intimate relationship, and where men who batter believe they have the right to use violence. While it is a goal to change the attitudes of men who batter, the ultimate goal of the Duluth Model has always been to ensure that victims are safer by having the state intervene to stop the violence and address the power imbalance inherent in relationships where one person has been systematically dominated and subjugated by another.\"\n\nIt's described in further detail in a 1993 book that Ellen Pence co-authored; [\"Education Groups For Men Who Batter: The Duluth Model.\"](https://books.google.com.au/books/about/Education_Groups_for_Men_Who_Batter.html?id=tJ189FTdO38C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) The book says:\n\n\"The tactics used by batterers reflect the tactics used by many groups or individuals in positions of power. Each of the tactics depicted on the Power and Control Wheel are typical of behaviors used by groups of people who dominate others. They are the tactics employed to sustain racism, ageism, classism, heterosexism, anti-Semitism, and many other forms of group domination. Men in particular are taught these tactics in both their families of origin and through their experiences in a culture that teaches men to dominate. ...We use gender-specific terms not only because the curriculum is for men who batter, but because battering is not a gender-neutral issue.\"\n\nThe Duluth Model's Power and Control Wheel details the tactics that are used to sustain an abusive partner's control over an abuser.\n\n[https://www.theduluthmodel.org/wheels/](https://www.theduluthmodel.org/wheels/)\n\n* Physical and Sexual Violence (outer ring)\n* Using Intimidation\n* Using Emotional Abuse\n* Using Isolation\n* Minimizing, Denying and Blaming\n* Using Children\n* Using Male Privilege\n* Using Economic Abuse\n* Using Coercion and Threats\n\n[https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf](https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf)\n\nThe Duluth Model currently reigns as the most commonly state-mandated model of intervention. While many approaches to intervention include a mix of the Duluth Model's feminist analysis of DV and cognitive behavioural therapy (which is a more holistically-oriented approach to DV that maintains that DV is associated with cognitive distortions and faulty attitudes and beliefs), most existing intervention programs as well as state laws and guidelines that regulate IPV intervention still espouse key aspects of feminist perspectives on IPV etiology and intervention.\n\n**2) Gender symmetry in DV: The evidence and the denial.**\n\nHowever, more and more studies have come up showing gender symmetry in DV.\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf)\n\n\"More than 200 studies have found that men and women perpetrate partner violence at approximately equal rates and that the most prevalent pattern is mutual violence (Archer, 2002; Fiebert, 2004). Moreover, when it is not mutual, female-only and male\\~only partner violence occur with about equal frequency among married couples (K. L. Anderson, 2002; Capaldi & Owen, 2001; Gelles & Straus, 1988; Kessler, Molnar, Feurer, & Appelbaum, 2001; McCarroll, Ursano, Fan, & Newby, 2004; Medeiros & Straus, 2007; Moffitt, Caspi, Rutter, & Silva, 2001; Straus, Gelles, & Steinmetz, 2006; Williams & Frieze, 2005). Among young couples and dating couples, the percentage of female-only partner violence exceeds the percentage of male- only partner violence (Straus & Ramirez, 2007; Whitaker, Haileyesus, Swahn,& Saltzman, 2007). This pattern of gender symmetry is true even for severe partner violence, such as kicking, attacks with objects, and choking. However, the injury rate is much higher when the perpetrator is male (Gelles & Straus, 1988). Police statistics and crime survey statistics seem to contradict the idea of gender symmetty because 80% to 99% of the perpetrators identified in such surveys are men (Straus, 1999). This is not because of higher numbers of physical attacks by men but because of the greater probability of injury from attacks by men and greater fear for safety by women (Straus, 1999). These are characteristics that lead to police intervention. Such cases are mistakenly taken as representative of partner violence, even though at least 95% of partner violence cases are not known to the police (Kaufman Kantor & Straus, 1990; Statistics Canada, 2005).\"\n\nAnd...\n\n\"Not only do men and women tend to perpetrate physical partner violence at about equal rates, but they tend to do so for similar reasons. The most commonly reported proximate motivations for use of violence among both men and women are coercion, anger, and punishing misbehavior by their partner (Cascardi & Vivian, 1995; Follingstad, Wright, Lloyd, & Sebastian, 1991; Kernsmith, 2005; Stets & Hammons, 2002). For example, Pearson (1997) reported that 90% of the women she studied assaulted their partner because they were furious, jealous, or frustrated. The motive of self-defense, which has often been put forward as an explanation for high rates of female violence, explains only a small proportion of partner violence perpetrated by women (and men; Carrado, George, Loxam, Jones, & Templar, 1996; Felson & Messner, 1998; Pearson, 1997; Sarantakos, 1998; Sommer, 1996). For example, using a college student population, Follingstad ot al. (1991) found that perpetrators reported that their motivation was self-defensive about 18% of the time (17.7% for men, 18.5% for women). As violence becomes more severe, there are greater gender differences in the use of violence in self-defense; however, self-defense is still a motivation for a relatively small proportion of violence. For example, in a sample of couples presenting for marital therapy, Cascardi and Vivian (1995) found that 20% of wives and no husbands attributed their use of severe aggression to self-defense.\"\n\nOne study even showed that half (49.7%) of relationships which had violence were reciprocally violent, and that in nonreciprocally violent relationships, women were the perpetrators in more than 70% of the cases.\n\n[https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020](https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020)\n\nIn 1999, Ellen Pence, in her book [\"Coordinating Community Responses to Domestic Violence: Lessons from Duluth\"](https://books.google.com.au/books/about/Coordinating_Community_Responses_to_Dome.html?id=Vk_qT-apdT4C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) came out herself and admitted that she and the DAIP staff involved in Duluth were driven by ideology. In the chapter \"Some Thoughts On Philosophy\", she wrote:\n\n\"The Power and Control Wheel, which was developed by battered women attending women's groups, was originally a description of typical behaviours accompanying the violence. In effect it said \"When he is violent, he gets power and he gets control.\" Somewhere early in our organizing efforts, however, we changed the message to \"he is violent *in order to* get control or power.\" The difference is not semantic, it is ideological. Somewhere we shifted from understanding the violence as rooted in a sense of entitlement to rooted in a desire for power. By determining that the need or desire for power was the motivating force behind battering, we created a conceptual framework that, in fact, did not fit the lived experience of many of the men and women we were working with. The DAIP staff - like the therapist insisting it was an anger control problem, or the judge wanting to see it as an alcohol problem, or the defense attorney arguing that it was a defective wife problem - remained undaunted by the difference in our theory and the actual experiences of those we were working with. We all engaged in ideological practices and claimed them to be neutral observations.\"\n\n\"Eventually, we began to give into the process that is the heart of the Duluth model: interagency communication based on discussions of real cases. It was the cases themselves that created the chink in each of our theoretical suits of armor. Speaking for myself, I found that many of the men I interviewed did not seem to articulate a desire for power over their partner. Although I relentlessly took every opportunity to point out to men in the groups that they were so motivated and merely in denial, the fact that few men ever articulated such a desire went unnoticed by me and many of my coworkers. Eventually, we realised that we were finding what we had already predetermined to find.\"\n\nSo even Ellen Pence herself outlined the limitations of the Duluth Model and acknowledged that she and her coworkers had created a conceptual framework that was inadequate in describing DV.\n\nHowever, the conception that DV is a primarily male-perpetrated crime which is an outgrowth of normal male behaviour and socialisation still persists, and people who challenge Duluth's characterisation of DV face extreme backlash.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n\"Suzanne Steinmetz made the mistake of publishing a book and articles (Steinmetz, 1977; Steinmetz, 1977-1978) which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware. Twenty years later the same processes resulted in a lecturer at the University of Manitoba whose dissertation found gender symmetry in PV being denied promotion and tenure.\"\n\n\"A PhD student working with Straus was warned at a conference that she will never get a job if she does her PhD research with him. At the University of Massachusetts, Straus was prevented from speaking by shouts and stomping. At two hearings held by the Canadian Commission On Violence Against Women the chairperson stated that nothing Murray Straus publishes can be believed because he is a wife-beater and sexually exploits students (Toronto Magazine article, ??). When Straus was elected President of the Society For the Study Of Social Problems, a group of members occupied the first few rows of the auditorium and, at the start of the presidential address, stood up and walked out.\"\n\n\"As a result of these types of harassment, there is widespread self-censorship by authors who fear that publishing politically incorrect data will undermine their reputation, or in the case of graduate students, their ability to obtain a job.\"\n\nSo despite all the evidence proving that DV is a crime that can be committed by both genders and that men and women who commit DV both share similar motivations, the Duluth Model is still very frequently used and widely accepted.\n\nEDIT: You know what, I'm including more.\n\n**3) The VAWA and a lack of services for abused men.**\n\nAs a result of this erroneous viewpoint that Duluth has created, male victims of domestic violence struggle to obtain services. Most resources are allocated to helping female victims of DV and much less for men.\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\nThe Violence Against Women Act is the centre of controversy, with a lot of complaints being made about sex-based discrimination by VAWA-funded programs. Technically, anti-discrimination provisions apply to the Violence Against Women Act, and the 2005 renewal of VAWA added this requirement:\n\n\"Nothing in this title shall be construed to prohibit male victims of domestic violence, dating violence, sexual assault, and stalking from receiving benefits and services under this title. 16\"\n\nHowever, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature:\n\n* \"In 2002, the OVW instructed the Delaware Domestic Violence coordinating council that, “states must fund only programs that focus on violence against women.”17\"\n* \"Department of Justice (DoJ) research solicitations have explicitly excluded applications that focus on male victims. One Solicitation for Proposals from the DoJ National Institute of Justice specifically prohibited “proposals for research on intimate partner violence against, or stalking of males of any age…”18\"\n\nAnd...\n\n\"Given these federal actions, it is not surprising that state-level governmental programs follow suit\":\n\n\"In Texas, an application for a program serving male victims was turned down because “programs that focus on children and/or men” were deemed ineligible.20 The next year, a grant application kit from the Texas Criminal Justice Division used identical words to reiterate the exclusion: “Programs that focus on children and/or men.”21\"\n\n\"Likewise, the OVW awarded $3 million to Baylor University to establish the Faith and Community Technical Support (FACTS) program designed to reduce domestic violence in rural communities. In 2006 the FACTS program issued a grant solicitation stating, “As with previous VAWA methods, it is assumed that … all victim data reported is about victimized women.”22 One of the questions on the FACTS grant application asks, “Number of years organization has spent working on violence against women issues.\"\n\nIn 2007, a letter was sent to the Office on Violence Against Women under the Freedom of Information Act (FOIA) requesting the OVW provide \"sex-specific utilisation data for each of the following grant programs\":\n\n1. Transitional Housing Program\n2. Rural Domestic Violence and Child Victimization Enforcement Grant Program\n3. Legal Assistance for Victims Program\n4. Stop Violence Against Indian Women\n5. Grants to Encourage Arrest Policies and Enforcement of Protection Orders\n6. Grants to Reduce Violent Crimes Against Women on Campuses\n7. Services, Training, Officers, and Prosecutors (STOP) Violence Against Women Formula Grant Program\n\n\"Overall, only 9.7% of persons receiving help were male victims, the remaining 90.3% being female victims. The percentages of male victims for the Legal Assistance for Victims and Transitional Housing programs were much lower – 3.9% and 0.4% respectively.49\"\n\nIn accordance with this, the experiences of men who attempt to seek help for domestic violence through formal resources have largely been negative. From a study of U.S. men who have sustained domestic violence from their female partners:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\n\"Qualitative research has documented the experiences of men who seek help for female-to-male IPV (Cook 2009; Hines et al. 2007). For example, Cook (2009) performed in depth interviews of 30 men who sustained all types of IPV from their female partners and tried to seek help. This work shows that men often experience barriers when seeking help. When calling domestic violence hotlines, for instance, men who sustained all types of IPV report that the hotline workers say that they only help women, infer or explicitly state that the men must be the actual instigators of the violence, or ridicule them. Male helpseekers also report that hotlines will sometimes refer them to batterers’ programs. Some men have reported that when they call the police during an incident in which their female partners are violent, the police sometimes fail to respond. Other men reported being ridiculed by the police or being incorrectly arrested as the primary aggressor. Within the judicial system, some men who sustained IPV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of IPV and abusing their children. According to some, the burden of proof for male IPV victims may be especially high (Cook 2009).\"\n\nAnd...\n\n\"We found that men who sustain IPV seek help from a variety of resources, most typically from informal resources, such as family, friends, and the Internet, and the formal resource of a mental health professional. Family and friends were overwhelmingly reported as being the most helpful resource, and mental health and medical professionals were rated as being among the most helpful of the formal resources. These professionals were reported to have taken the male victims seriously and to inquire about the origin of the men’s injuries. The resources providing the least support to men seeking help for IPV victimization are those that are the core of the DV service system: DV agencies, DV hotlines, and the police. On the one hand, about 25% of men who sought help from DV hotlines were connected with resources that were helpful. On the other hand, nearly 67% of men reported that these DV agencies and hotline were not at all helpful. Many reported being turned away. The qualitative accounts in our research tell a story of male helpseekers who are often doubted, ridiculed, and given false information. Thus, our hypotheses that men who would have largely negative experiences with formal resources were supported, which is consistent with prior qualitative research (Cook 2009; Hines et al. 2007).\"\n\n\"These findings are in stark contrast to ratings of social services by battered women. For example, in a study of 119 women who sought services for DV-related concerns from a DV shelter, 89% of the clients believed that they were helped by the services that they received and 84% reported that they felt better because of these services (McNamara et al. 2008). These findings are similar to a study which examined women’s impressions of a hospital-based DV support group (Norton and Schauer 1997). Of the 59 women in this study, 95% reported that they were mostly or very satisfied with the services that they received. Their reasons for satisfaction included that the group leaders were supportive, they were able to hear about other women’s experiences with abuse and were supported by them, they received referrals for additional support/services and they were able to learn about DV. These findings are consistent with other literature which states that women are often very satisfied with the services that they have received for IPV (Bowker and Maurer 1985; McNamara et al. 1997; Molina et al. 2009). Similar results with regard to satisfaction among battered women have been found in relation to police assistance. For example, one study of 95 female IPV victims indicated that the female victims found the police to be very helpful and 80% would contact the police again for assistance (Apsler et al. 2003).\"\n\nSo male victims are largely marginalised.\n\n**4) Mandatory Arrest Laws and Predominant Aggressor Policies.**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV. Statutes in numerous states directed police officers to undergo training on domestic violence and victim assistance and limited their discretion.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n\"Under the assumption that intimidated witnesses are reluctant to testify against their abuser, district attorneys began to adopt “no-drop” prosecution that circumvented victim cooperation. The 23 states that call for *mandatory arrest* allow the least amount of discretion, with statute language that ranges from vague, as in Colorado (“probable cause to believe a crime of domestic violence was committed”), to more specific, as in Washington where police can arrest when there is probable cause to believe a person 16 years or older within A, B, C, D, E the previous 4 hours assaulted a family or household member and believes (1) felonious assault occurred, or (2) assault resulting in bodily injury occurred whether injury is visible or not, or (3) any physical action occurred which was intended to cause reasonable fear of imminent serious bodily injury or death. (Hirschel, 2008, pp. 19–20)\".\"\n\nAnd when mandatory arrest laws were instituted, the arrests of women *skyrocketed.*\n\n\"In California, men in 1987 were arrested at a rate of 247 per 100,000, whereas women were arrested at a rate of 74.8 per 100,000. By 1997, the rates had increased only 136% for men, or up to 338 arrests per 100,000, but as much as 500% for women (DeLeon-Granados, Wells, & Binsbacher, 2006). Feminists welcomed the rise in male arrests. However, despite evidence that “political and/or organisational pressure may discourage officers from arresting women as aggressors” (Hirschel & Buzawa, 2009, p. 5), they found the sharper spike in female arrests of concern.\"\n\nSo, in order to counter this, feminists worked with policy makers to institute \"predominant aggressor\" guidelines which allegedly attempted to curb the arrest of victims by taking into account the “relationship behind the assault”.\n\nTo anyone denying that predominant aggressor guidelines have anything to do with Duluth's feminist analysis of DV or feminism, DAIP (remember: birthplace of the Duluth Model) itself states:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"Doing away with **pro-arrest policies targeting the predominant aggressor (a core component of the Duluth Model)** reduces the total number of arrests but increases the proportion of dual arrests. Dual arrests have proven ineffective in stopping violence, and they also have the unfortunate consequence of making victims more reluctant to call the police when further acts of violence occur.\"\n\nSo there you go.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\nCalifornia is one of several states that defines the dominant aggressor not as the first aggressor but rather the most “significant,” a sharp deviation from accepted police practice in responding to other crimes. As specified under state law and found in the domestic violence section of the Peace Officer Standards and Training (POST) manual, here are the factors taken into account when determining the predominant aggressor.\n\n* Age, weight, and height of the parties;\n* Criminal history;\n* Domestic violence history, including convictions and probation;\n* Strength, special skills (e.g., martial arts, boxing);\n* Use of weapons;\n* Offensive and defensive injuries;\n* Seriousness of injuries;\n* Use of alcohol and drugs;\n* Who called 911;\n* Who is in fear;\n* Presence of behaviors of power and control in the relationship;\n* Detail of statement;\n* Demeanor of the parties; and\n* Existence of corroborating evidence (California Commission on POST, 2010, pp. 3–5, 3–6)\n\nNone of these criteria are openly anti-male, but there are some bits that are prejudicial to men as a result of the criteria that was selected in determining the predominant aggressor.\n\n\"Again, many of these factors are vague, not easily interpreted and of dubious value. “Age, weight, and height of the parties,” and martial arts training are only relevant if the individual actually uses these advantages in an aggressive way. Men are usually bigger and stronger than women are, but most men do not abuse their partners, and there is no correlation in the general population between a person’s size and strength and the extent to which they abuse intimate partners, including among same-sex couples (Renzetti, 1992). When men are assaulted, they often refrain from striking back, both out of fear of being arrested and the code of chivalry. ... A man who is larger and stronger than his partner may have the *potential* of causing greater physical damage, but this factor is irrelevant unless he actually uses this to his advantage, just as the smaller woman has the *potential* to obtain a gun and kill him. The reader will notice that for weapons, officers are asked to consider their *use*, but not so with size and strength. In this respect, there is reason to suspect that the choice of criteria may be prejudicial to men (Sacks, 2010).\"\n\nOn the other hand, how police are trained to identify the predominant aggressor is blatantly gender-biased.\n\nIn two official police training manuals, including the POST manual cited earlier (California Commission on POST, 2010):\n\n\"The POST manual contains sections that define domestic violence that discuss its impact on victims and instruct officers in a detailed manner on response and arrest procedures and the protection of victims. Brief case scenarios are presented for the purpose of illustration and to facilitate learning. ... The manual generously offers 50 such examples, in which one party abuses or otherwise acts aggressively toward the other. ... Of the 50 examples, *not a single one* depicts unilateral abuse by a female upon a male (see Table 1). ... The examples send out a clear message to law enforcement in California, the largest state with more than 10% of the U.S. population: Officers should concern themselves only with male-perpetrated violence.\"\n\n\"The Maine training program, *Identifying Predominant Aggressors in Domestic Violence Cases (Train-the-Trainer*), is a 2-to 4-hour presentation consisting of lectures, video scenarios, and group discussions from the Maine Criminal Justice Academy, the organization that conducts trainings for all law enforcement and corrections agencies in the state of Maine (Rogers & Faragher-Houghton, 2008, p. 3). More so than the POST training, the Maine curriculum focuses right from the start, in its definition of domestic violence, on the exclusive needs of female victims. Following an exposition on the evolution of the criminal justice response, trainees are presented eight examples (one involving a public disturbance; the others depicting a domestic violence incident between a man and a woman) and asked to decide which party is the predominant aggressor based on the state’s legal criteria (similar to California’s), and who to arrest. Trainees are then informed that in seven of those cases, it is the man who should be arrested. In the other case, there is no specific recommendation to arrest either the man or the woman, but the clear implication is that the man is the dominant aggressor.\"\n\nAnd...\n\n\"The gender bias found in both the California and Maine trainings is blatant, indeed. However, considering the process by which dominant aggressor laws were put on the books, one should hardly be surprised. Laws protecting victims from domestic abuse were enacted not by abused men or men’s rights groups or disinterested bureaucrats, but through the efforts of battered women’s advocates, some of whom had previously been victimized in their own lives, and by feminists concerned broadly with the oppression of women (Mills, 2003). It was feminists who fought for the creation of dominant aggressor guidelines, and they did so explicitly to stem the rising tide of female arrests, on the grounds that domestic violence is a *gendered* problem. This view, based on a feminist analysis of patriarchy and sometimes referred to as the *gender paradigm* (Dutton & Corvo, 2007; Dutton & Nicholls, 2005), has had a profound influence on policy and intervention.\"\n\n\"The existence of training bias and political activism only suggest—and do not prove—that police officers actually carry out arrests in a gender-biased manner, and clearly much more research is needed. However, there is evidence elsewhere in the criminal justice response to domestic violence of a clear political agenda, as evidenced by the tendency of police to dually arrest significantly more often when the male is the victim, compared to the female (Hirschel & Buzawa, 2009); the preferential granting of restraining orders to women relative to men in response to similar complaints (Muller, Desmarais, & Hamel, 2009); the failure of law enforcement to adequately inform male victims regarding community resources (Buzawa & Hotaling, 2006); and the proliferation of intervention programs based on a patriarchal theory (Dobash & Dobash, 1979; Pence & Paymar, 1993). In addition, telling is the official domestic violence training offered by the U.S. Victims of Crime office, whose training manual gives 11 examples of physical domestic violence and various power and control tactics. Of these 11 examples, 8 involve male-on-female battering, 2 involve female-on-female lesbian abuse, and 1 involves a male perpetrator and a victim whose gender is not specified (Office of Justice Programs, 2010). Once again, trainers are not able to imagine any scenario whatsoever in which the perpetrator is a woman and her victim is a man.\"\n\nSo this has been the unfortunate effect of the Duluth Model and the narrative that feminists have created and tried incredibly hard to maintain that it is primarily men who are the perpetrators of DV/IPV. And that they have successfully maintained, despite there being a massive body of evidence that disproves said narrative.",
    "title": "Feminism and the Duluth Model.",
    "subreddit": "MensRights",
    "timestamp": 1561084678,
    "score": 103,
    "keyword": "mixed race principal"
  },
  {
    "text": "Elite schools snub £1m gift for poor white boys https://www.thetimes.co.uk/edition/news/race-row-as-1m-gift-is-snubbed-by-elite-schools-winchester-dulwich-mhsr75d85\n\nTwo leading private schools have rejected scholarships of more than £1 million for poor white boys from a philanthropist for fear of breaching anti-discrimination laws.\n\nDulwich College and Winchester College turned down an offer from Professor Sir Bryan Thwaites, 96, to leave the funds in his will.\n\nSir Bryan, who attended both schools on scholarships, wanted white British boys from disadvantaged homes to benefit because they did worse at school than almost every other ethnic group. Studies have shown that they perform relatively poorly in exams and are less likely than their peers to attend university.\n\nStormzy, the rap star, established Cambridge University scholarships exclusively for black British students. The refusal of leading boys’ schools to allow financial help exclusively for white pupils has prompted a row about equality laws.\n\nSir Bryan said: “If Cambridge University can accept a much larger donation in support of black students, why cannot I do the same for underprivileged white British? Winchester said it would harm its reputation by accepting my bequest, but in my opinion it would gain enormously by being seen to address what is the severe national problem of the underperforming white cohort in schools.”\n\nTrevor Phillips, former chairman of the Equality and Human Rights Commission, said that well-known schools had turned down more than £1 million of financial help for white boys in recent months. He blamed a “lethal cocktail of inverted snobbery, racial victimhood and liberal guilt” for the reluctance to help white boys, whom he described as “today’s educational left-behinds”.\n\nHe said: “I doubt that I’ll ever work out why the British appear untroubled that so many of their children emerge from over a decade of expensive, compulsory education with scarcely more in the way of literacy and numeracy than the average Neanderthal.”\n\nWriting in the online magazine Standpoint, he continued: “On half a dozen occasions over the past five years I’ve been asked to advise on whether it is acceptable to offer bursaries or scholarships to one minority group or another. Invariably, I have said yes; but donors remain nervous, and beneficiary institutions are routinely discouraged by their lawyers.\n\n“I have no idea how many such generous offers have been turned down, but I do know that in recent months two well-known fee-paying schools have lost bequests totalling over £1 million that might have supported some of our most disadvantaged children for one reason: the donor, like Stormzy, wants his money to go to people of his own background — poor but talented white British boys.” Mr Phillips said that such a proposal was not racist and that the Equality Act of 2010 was not called the “Be Kind to Blacks Act”, adding: “In circumstances where the racial group that is disadvantaged is white, there should be no bar to doing for them exactly what we would do for so-called black and minority ethnic groups.”\n\nSir Bryan was principal of Westfield College, part of the University of London, for 17 years. He planned to bequeath £400,000 to Dulwich College in south London and £800,000 to Winchester College in Hampshire.\n\nHe attended Dulwich until the outbreak of the Second World War, when he was sent to Winchester. Scholarships paid for him to attend both institutions. He has long supported both schools and taught at Winchester, where he founded the School Mathematics Project that reached 80 per cent of schools by the early 1970s. Both schools are understood to have consulted widely with lawyers, trustees and charity experts before declining the bequest.\n\nUnder the Equality Act positive discrimination, where someone is given preferential treatment because they have a specific characteristic, is generally unlawful. However “positive action” is permitted for efforts aimed at encouraging someone to overcome a disadvantage attributed to their race or other protected characteristic.\n\nA spokesman for Winchester College said: “Acceptance of a bequest of this nature would neither be in the interests of the school as a charity nor the interests of those it aims to support through its work. Notwithstanding legal exceptions to the relevant legislation, the school does not see how discrimination on grounds of a boy’s colour could ever be compatible with its values.”\n\nA spokesman for Dulwich College said: “The community at Dulwich is proudly diverse, both socio-economically and ethnically, reflecting our location. Bursaries are an engine of social mobility and they should be available to all who pass our entrance examinations, irrespective of their background.”\n\nHow ‘positive action’ works The protected characteristics that enable “positive action” under the Equality Act 2010 are: age, disability, gender reassignment, pregnancy and maternity, race, religion or belief, sex and sexual orientation (Billy Kenber writes). A school or university offering a scholarship or bursary for a particular group of students must be able to demonstrate that the group being helped suffers a disadvantage because of their protected characteristic. These scholarships are lawful as long as they are also a proportionate means of overturning the disadvantage.\n\nhttps://i.imgur.com/oFI3I2V.png",
    "title": "Elite schools snub £1m gift for poor white boys",
    "subreddit": "MensRights",
    "timestamp": 1577705652,
    "score": 60,
    "keyword": "mixed race principal"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 45,
    "keyword": "mixed race principal"
  },
  {
    "text": "Curvy High School Swimmer Disqualified for a Wedgie For those who have exceeded their Washington Post free article limit:\n\n\"The teenage girl clambered out of the pool, ready to accept victory. A champion swimmer for Anchorage’s Dimond High School, she had crushed her competition in the 100-yard freestyle during Friday night’s meet with a rival from across town.\n\nBut as soon as she stepped out of the water, she learned that she had been disqualified.\n\nThe reason? Her swimsuit was exposing too much of her buttocks, an official ruled.\n\nThe referee’s call, which is now under investigation, has generated intense debate among Alaska’s close-knit swim and dive community, and prompted a larger discussion about how female athletes’ bodies are policed and scrutinized. Lauren Langford, who coaches swimming at another high school in the area, told The Washington Post that she believes racism, in addition to sexism, may have been a factor, given that the teen is among the few nonwhite athletes in a predominantly white sport.\n\n'All of these girls are all wearing suits that are cut the same way,' Langford said. 'And the only girl who gets disqualified is a mixed-race girl with rounder, curvier features.'\n\nThe teenager didn’t pick out the swimsuit — her school chose it and issued it to her. But even though all the girls on her team were dressed identically, she was the only one cited for a uniform violation. Annette Rohde, who was working as an official during the meet, told the Anchorage Daily News that another female ref explained that the bottom of the girl’s suit 'was so far up I could see butt cheek touching butt cheek.’\n\nRohde froze in disbelief, she said, and warned the referee, who has not been identified, 'This is going to blow up.' Sure enough, the decision reverberated throughout the community, where the teen is known as a top-ranked swimmer likely to go on to compete at the collegiate level.\n\n'In a world where young girls are told at every turn that the skin they’re in is not good enough for a thousand reasons, the last thing we need to do in youth athletics is add to that unhealthy dialogue,' Langford, a swim coach at Anchorage’s West High School who coached the teenager and her sisters when they were younger, wrote in a widely shared blog post on Medium after Friday’s meet. She added, 'If you do not like the way that swimsuits fit on these girls’ bodies then don’t look; they are minors, children, and no one should be looking at them anyway.'\n\nSpeaking with The Post on Monday night, Langford said she was angered at the treatment of the teenager, whom she described as 'literally the nicest young lady.' It wasn’t the first time the girl had been made to feel that her curvy figure was problematic: Last year, a parent took a photo of her backside and shared it with other parents to demonstrate that girls on the team were wearing inappropriate swimwear. (District officials said Monday that Dimond High School’s assistant principal 'indicated to the parent who took the photographs that it was not permissible for him to take pictures of others’ children and that he should stop immediately.')\n\n'That to me is so inappropriate,' Langford said. She noted that the teen girl has been accused of hiking her suit up on purpose, but anyone who has competed in swimming would know that suits often ride up unintentionally.\n\n'We have a term for it — it’s called a suit wedgie,' she said. 'And wedgies happen. It’s uncomfortable. No one’s going to walk around that way intentionally.'\n\nOver the years, the conservative one-piece swimsuits traditionally worn by competitive female swimmers have been phased out in favor of a higher-cut style that has less fabric and is more hydrodynamic, but also more revealing. The changes in the cut and fit, Langford said, make it 'even more frequent that you’re picking a wedgie.' But a minor, if annoying, wardrobe malfunction is also likely to be the last thing on the mind of a swimmer intently focused on her form as she nears the finish line.\n\n'If you’re in the water, you’re not thinking about it,' Langford said.\n\nRohde and another local swim coach told the Daily News on Monday that they, too, had never seen the teenager deliberately adjust her swimsuit to make it more revealing. There’s some dispute about whether the referee’s call, which Dimond’s coach has protested, would have been correct if the girl had done so, or if swimmers can be penalized for failing to realize that their suit has bunched up. Officials with the Anchorage School District, who announced Monday that they are reviewing the decision, wrote that the disqualification 'appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms.'\n\nThe National Federation of State High School Associations, the governing body for high school athletics in Alaska, simply states that female swimmers must cover their buttocks and breasts. In August, the organization issued a memorandum alerting coaches that 'suits are being worn in such a way as to expose the athlete’s buttocks,' and provided an illustrated example of what constituted appropriate coverage. District officials said Monday that Dimond High School 'made deliberate efforts over the last year' to meet those requirements — in particular, picking out the regulation swimsuit that the teen was wearing when she was stripped of her victory.\n\n'If the suit was a problem, they all should have been disqualified,' Langford said. 'But they weren’t.'\n\nMeagan Kowatch, the teenager’s mother, told KTUU on Monday that the referee who made the call had previously embarrassed one of her other daughters by critiquing the fit of her swimsuit during a meet. She wants to see the results of Friday’s competition overturned, and for that ref to be kept away from her daughters’ races in future, she said.\n\nThough there’s also been some debate about whether racism played a role in the decision, 'no one seems to be arguing about if it’s sexism,' Langford said. The National Federation of High Schools also published guidelines for appropriate male swimwear in August, and she said she’s seen young men competing in lower-riding suits than the organization deems appropriate. But to her knowledge, it’s never become an issue.\n\nBy contrast, Langford said, Kowatch has been told by other parents that her three daughters on the team, who are all talented swimmers, need to cover up for the sake of their sons. The disqualified teenager, though usually 'tough as nails,' turned teary on Friday night over the referee’s decision, and was 'heartbroken' to learn that people were accusing her of purposefully hiking up her swimsuit, the coach said.\n\n'The fact that she’s been told she’s intentionally trying to draw this sexual attention has really crushed her,' Langford said.\"\n \nBy Antonia Noori Farzan\nSeptember 10 at 6:58 AM\nhttps://www.washingtonpost.com/nation/2019/09/10/anchorage-swimmer-disqualified-wedgie",
    "title": "Curvy High School Swimmer Disqualified for a Wedgie",
    "subreddit": "Feminism",
    "timestamp": 1568221201,
    "score": 14,
    "keyword": "mixed race principal"
  },
  {
    "text": "Who is classed as being a woman of colour? Hey guys. Been deliberating over this. I'm mixed race, half Iranian and half English. Is this classed as being a WOC?? I've always thought of myself as one but a friend recently caused me to question this as she sees me as v white (she is white herself) . I know I have extreme privilege for often passing as white but I've also experienced a lot of discrimination, especially as a kid, for being middle eastern. I've been called names, made fun of and been made to feel I'm different. This has impacted my life a lot and really influenced the way I see the world. Some people see me as white and others do not. I definitely think people make judgements about me based on my appearance. I also have an extremely middle Eastern name which makes people assume things about me before they even meet me and I worry it may result in discrimination when I'm applying for jobs. But I also feel that I'm not qualified to call myself a WOC because other women that are not light skinned as me have it so hard. Anyway, didn't really know who to ask and Google ain't helping. Let me know if it's the wrong space..",
    "title": "Who is classed as being a woman of colour?",
    "subreddit": "Feminism",
    "timestamp": 1565803290,
    "score": 1,
    "keyword": "mixed race principal"
  }
]