[
  {
    "text": "Had a mental breakdown today after months of being bullied and belittled by my bosses. Is quitting via email with no notice justified for me? So I'm 24 and work part time as a sales assistant in clothing. I'm a student and am finished at the end of the year so I'm working part time retail gigs for pocket money. It started as a Christmas gig around November, but I worked my absolute butt off and about a month after I started, I was offered a management position. All the management treated me golden, praised me during meetings and wanted me in their 'circle'. I was flattered, but ultimately turned it down because I knew it was full time but I was still studying full time so I couldn't do it. I still stayed as a casual, and continued to put 100% in, work really hard and continue to prove myself as hard working and capable.\n\nIn the meantime, I heard that many of my coworkers took badly to me being offered management, and many created a private group chat where they belited and made fun of me and thought I didn't deserve the job. One of my friends at work heard about this through someone who was in the chat. None of them knew that before I went back to college, I actually had 2.5 years of management experience from my last job or obviously how hard I worked. Still, I brushed it off as jealousy and they don't know me and just went there to do my job and nothing more. Then out of nowhere about 2 months ago, shit just hit the fan. I had several coworkers report me to my boss for the most miniscule things. One reported me for talking \"too long\" to a customer when I asked her about her weekend plans when I was putting the sale through. Another reported me for using scissors instead of a box cutter (I asked another manager for one and they said there were out). Another for taking my break only TEN minutes after my scheduled time because I was closing a sale worth THREE thousand dollars. The list went on. \n\nThen, my boss turned against me suddenly, obviously believing all these people, and then finding her own little things to pull me up for. Then last month, my work introduced store credit cards to try to scam customers into signing up for one. They always existed, but I was never told during my interview or when I first started that it was mandatory to sell them. It's not mentioned in my contract or job description either. But still, the pressure to sell them became unreasonably high. You can't just pressure people to get a fucking credit card, we're a clothing store not a bank! My manager screamed at me in front of 5 of my other coworkers on the sales floor for not getting a card yet. She said I was pulling everyone else down and that everyone's sick of picking up my slack. I could see my coworkers smirking with glee behind her. \n\n\nThen, to replace the management job I was offered, they picked two of my other coworkers to be team leaders instead.  Both of these people are a lot younger, have zero management experience and this is their first and and only job. Still, I gaveth the benefit of the doubt and I respected them as my superiors. Immediately, they both went on a massive power trip and directed all their pulling up activities at me and only me. I found out that one of the new managers is actually the person that STARTED the group chat about me. So knowing that I had a manager who had a preexisting unjustified hatred towards me made me feel very unsafe and sick to go to work. Two weeks ago, I rock up to my shift and one of my team leaders asked to have a \"chat\" to me. I knew it was serious, and expected to go into a meeting room of some sort for privacy. No. She takes me to the stockroom where in eye and ear view of 10 other employees, begins to tell me that in July there are performance reviews and I'm one of the half a dozen or so who are looking at not keeping their jobs. She never explicitly said \"you'll be fired\"  but she told me that I'm a \"grey area\" and \"sell a card or you won't be moving on with us\". I was shaken and told her I didn't understand. I told her I go above and beyond my sales targets, get nothing but praise from customers and other managers up until now. She told me \"don't talk back to me just do your job\" so I told her I'm really trying and will continue to. Instead of giving me the chance to be on the sales floor to actually sell one, I'm forced to spend my whole shift unpacking stock in the back. I realised then and there that my time was fast approaching an end there, and I should start applying for  other jobs.\n\nThen they cut my shifts, and I didn't get one for almost two weeks. Then Thursday I had my first shift in that time, but still I kept positive and happy and went to work in a good mood and told myself I'd work hard and get a card. Not even five minutes into my shift, BOTH of the team leaders come up to me and both ask to see me privately. Again I'm thinking okay I'm either gonna be fired now or I'll be yelled at again. They take me again into the back room. Zero privacy or dignity and both of them gang up against me 2-1 with the same horse shit. I later found out via my country's union that having two managers against one person is not okay in HR standards but whatever. So they both begin with the same story. That I still haven't sold a card, that I'm dragging everyone else down and so on. I said to them I haven't been here for two weeks to get the chance to sell one. Then they both put on 'sweetheart' voices and say in a really bitchy way \"Well that's why you're here today...to get one\". Then the threats started. \"So you're still not looking good for the people that will be cut after June\", \"Our manager is currently interviewing for new staff\", and \"There's letters are currently being sent out to the people that won't be moving with us\". They didn't explicitly say \"and you're on the list\" but you get the jist. I told them again that I'm trying really really hard and selling a credit card isn't as easy as signing up to a mailing list but I will try.\n\n\nI felt really bullied and defeated that they both went two against one publicly where lots of other staff saw. I still tried to hold my dignity and went back on to the floor with smiles even though I wanted to cry and throw up inside. I did really good with sales. Then..every twenty minutes yes twenty one of the team leaders would come up to me and only me to ask if I've gotten a card yet. When they both went on their breaks I used the opportunity to ask the seven other people on my team that night if out of curiosity they've gotten a card since they started pushing them. All but one said *nope*, I asked if they've had it mentioned it to them. Only *one* did and she said it was briefly mentioned at the start of their shift to get one if she could. That was my breaking point. I went on my break after that and bawled my eyes out in the bathroom cause I realised it was only me they were targeting and unfairly at that. So I come back and keep trying to get a card to no avail. Then about an hour before closing it was obviously dead quiet and I accepted that I'll be lucky if I serve one person so how the hell am I gonna get a card. Then one of my team leaders came up to me and instructed me to stand in another section where it might get busier to sell a card. I happily obliged with a continued smile on my face. Not a single person came in to that section, but I did what I was told and stood there anyway. I realised about fifteen minutes before closing that I still need to tidy up my department's section and went back over to do it. I raced around the racks finger spacing it and making it look pretty when my team leader came up to me. \n\nShe put on a \"sweetheart\" voice but I could hear the bitchy undertones. She asked me how I found my shift today. I told her that while I'm naturally disappointed I didn't sign up a card, I did very well with sales. She smacked her lips and said \"right...it's just that I just couldn't help but notice now that you're looking incredibly sad and mopey and it's not a good look\". I actually laughed and said to her \"sorry? I've been nothing but smiles the whole day, I've been expressionless yes while I'm tidying up the racks but why would I be smiling at the racks I'm tidying up?\" She pursed her lips and goes \"right well it's just not a good look and something to take on board\". I said to her okay I will..? But it doesn't stop there. She then continued to say \"I also can't help but notice that you're tidying the racks up now but it's something that should've been done an hour ago\". I told her that I would've, but you specifically asked me to spend the last hour in another section to try and get a card, which I **did** so how could I do both at once? She pursed her lips again and just said \"anyway thanks for the day we're closed now so you can go home\". So I'm certain that she'll spin this and tell our boss that I'm sad and mopey, that I don't tidy up, whatever she can spin to make me look bad.\n\n\nI left and cried walking to the train station. I cried on the train and then when I got home I basically had a big fat breakdown to my parents and brother. They were all gob smacked and told me that this is bullying and threatening and should quit. Now. I have a tonne of savings from working during Christmas and I still live at home and study full time anyway so it's fine for me to be suddenly unemployed I know I can find another part time retail job soon. But I don't know how to quit. I would like to mention that I also get really bad anxiety. It was under control for a while, but this last two weeks I've hyperventilated and had panic attacks on the daily. It should be easy for me to just call my boss and tell her I'm done except for me it's kind of not. My brain just can't do it. So then my friend said well fuck it if they don't give a shit about you, don't give a shit about them email your boss and just do it like that. I don't know what else to do. I know that going in to quit will lead to me breaking down, crying or letting it all out and I just can't mentally handle it anxiety wise. My next shift isn't until this coming thursday, and it's for three hours (I was getting 3x7 hour shifts a week) only so as you can see, I'm being cut out already. So if I was to email my boss today, she'd surely see it by Monday. My brother works in a building a block over and offered to go in and give my badge and staff card back if they request it. I know two people who quit by email with little to no notice, and neither of them even got a reply back from my boss. I only know one person who quit in advance with two weeks notice, and she was forced to fill out some resignation form. Surely they can't make me do the same? I'm a casual. I don't really care about \"bridges being burned\" because my reference is from my previous assistant manager who left during my \"peak\" there and we're FB friends and all that and always told me I'm welcome to use her as a reference. \n\n\nBut I don't know what else to do, I mentally cannot deal. I've slept 3-4 hours every night the last two weeks, barely eat either, have panic attacks and cry everyday. Please help me.\n\nEdit: far out I can’t believe one of y’all gave me gold. My first ever reddit gold. Thank you so much, truly from the bottom of my heart to you and everyone else who left me a comment and message. Thank you so so much. I’ll do an updated post towards the end of the week",
    "title": "Had a mental breakdown today after months of being bullied and belittled by my bosses. Is quitting via email with no notice justified for me?",
    "subreddit": "jobs",
    "timestamp": 1556933622,
    "score": 448,
    "keyword": "mixed race manager"
  },
  {
    "text": "You applied and heard nothing - blame ATS WHO- over 98% of Fortune 500 companies use an ATS.  All online job sites provide them to employers - \nhttps://www.jobscan.co/blog/fortune-500-use-applicant-tracking-systems/\n\nWHAT- applicant tracking system (ATS) is software used to filter candidate applications automatically based on given criteria such as keywords, skills, former employers, years of experience and schools attended.\n\nEDIT - Sorry miss edited the above section \"what\" on mobile.  This comes from https://en.m.wikipedia.org/wiki/Applicant_tracking_system\n\"In many cases, Applicant Tracking Systems filter candidate applications automatically based on given criteria such as keywords, skills, former employers, years of experience and schools attended.[3] This has caused many to adapt resume optimizationtechniques similar to those used in search engine optimization when creating and formatting their résumé.[4]\"\n\nThis has caused many to optimize their resume to be accepted by the system.  \n\nWHERE - online only - you can have a nice resume that is human friendly but NEVER use it to submit online.\n\nWHY - job sites have made it too easy for too many unqualified applicants to apply so recruiters and hiring managers need a way to find the qualified candidates.\n\nHOW- ATS NO NOS - remove the following immeadatly!\n1. Profile pictures\n2. Graphics\n3. Symbols\n4. Icons\n5. ®️ (Prince2, Agile etc)\n6. Italics\n7. Horizontal lines\n8. Vertical lines (except tiny dividers)\n9. Mixed fonts\n10. Multiple colours\n11. Graphs\n12. Tables\n13. Font size SMALLER than 11 points\n14. Hyperlinks (including links to email and LinkedIn)\n15. Text boxes\n16. Underlines\n17. Dates older than 12 years if you are 38 years or older\n\n- Tiny standard bullet points are fine\n- ATS does not like ‘design’\n- ATS likes boringly simple\n- ATS likes Tomes New Roman & Ariel\n- ATS prefers text or Word docs - NOT PDF\n\nRemember to ‘stuff’ your CV/Resume with relevant keywords from the entire job description, for EACH job you apply for via online portals.\n\n\nFunny technology to solve problems caused by technology.\n\nEdit- check these out for help:\n\njobscan.com\n\nhttps://resumeworded.com\n\nhttp://www.cheapresumewritingservices.org/test-resume-against-ats-with-free-ats-resume-scanner/",
    "title": "You applied and heard nothing - blame ATS",
    "subreddit": "jobs",
    "timestamp": 1565001843,
    "score": 211,
    "keyword": "mixed race manager"
  },
  {
    "text": "Not sure what to do. Not sure what to even call this. Its about a job position I was denied and lied to about the reason.   So I live at an apartment complex. They had an opening for groundskeeper which I applied for. I was interviewed by a maintenance tech and a leasing agent from the property. I took an aptitude test as well for them to gain an understanding of what I knew about apartment maintenance. (I was a groundskeeper for almost a year when I was 18 so I do know what goes on). \n\n  Skip to a week later and Ive gotten no response. So i wrote an email asking if id gotten the job or not. I was told the hiring wasnt up to them and they would let me know. Another week passes and i ask again and receive the response ITS COMPANY POLICY TO NOT HIRE PEOPLE WHO LIVE ON THE PROPERTY.\n \n  Now what you dont know is that all of current staff live on the property except for the head tech. I accept this bc they said they didn't count or something along these lines because the company is just now enforcing it. \n \n  Cut to 6 months later. They hire a new leasing agent and groundskeeper and BOTH live on the property. The groundskeeper for sure lived here before he was hired. So my question is, what is this? I know discrimination is about sex, race and religion but I feel Ive been wronged here and am not sure if i can do anything legally or not. Does it even have a name besides straight up lying? My only thought is that because I had horrible neighbors and had complained several times before the interview that they just didnt want me around. I was perfectly qualified for this job tho. Not sure what to do.\n\nThanks in advance. \n       Bummed in Colorado\n\nName of the company: FPI Management \n\nEdit: for those of you telling me to move on... I have another job. Ive been hired as an assistant for an accountant. Data entry mostly. I still feel I was wronged and am simply seeing if anyone has experienced this or dealt with it in general. I am very clear on what discrimination is and I know this is NOT IT. Its just crazy to me this and other multi-million dollar companys can have its employees say whatever they want without repercussions. I also live on this property still. I have to see these people regularly. Maybe thats another reason I cant move on.",
    "title": "Not sure what to do. Not sure what to even call this. Its about a job position I was denied and lied to about the reason.",
    "subreddit": "jobs",
    "timestamp": 1546619336,
    "score": 36,
    "keyword": "mixed race manager"
  },
  {
    "text": "You are now the manager of purgatory, it’s a mix between heaven and hell. How would you make people uncomfortable, while they can also enjoy things?",
    "title": "You are now the manager of purgatory, it’s a mix between heaven and hell. How would you make people uncomfortable, while they can also enjoy things?",
    "subreddit": "AskReddit",
    "timestamp": 1561725364,
    "score": 49507,
    "keyword": "mixed race manager"
  },
  {
    "text": "Racially fetishized and harassed at work, reprimanded by management Came here to vent as I recently quit this job. Perhaps some of you guys have had similar experiences in customer service and can relate. \n\nI worked as a barista at a popular cafe in an upscale part of town. Most of my regulars were fantastic and we developed nice casual relationships and some of them were complete dicks as is the norm of any service industry job. My least favorite customers were the entitled creeper type and the worst offender of this pleasant bunch was “Steve.” \n\nSteve was a self proclaimed golden customer and “frequent flier” as he liked to put it. He took out basic customer service niceties as invitations to get uncomfortably friendly and blur the line of professional exchange (liked to try to come behind the counter sometimes and help himself to pastries if the line was long etc). He asked weirdly personal questions, most of which were targeted at the female staff, and even made other female customers feel uncomfortable by invading their personal space on multiple occasions. He assumed his business was superior to other clients and expected above and beyond service and quality time with employees (even during the busiest times of day with lines out of the door) in exchange for very little money spent and no tip. He liked to request a personal smile from each female employee before he left. Every time he came in. \n\nSteve also had an Asian fetish. My first interaction with Steve began with me warmly greeting him to which he responded by asking me what my nationality was. My family is from the specific country that seems to be Steve’s preference. I tell Steve bluntly that I am  ____ to which he states “ well you don’t look very _____. I would know because I go there all the time. I even adopted my daughter from there.” \n\nOver his next few visits, he tells me more about his second life in said country. He tells me about the business he’s done, the industry he’s dominating, the women he’s fucked. He asks me if I spoke the language well and offered tutoring sessions and if I dated outside my race. He comments on my body and how I’m shaped differently than the standard over there. At the time I was 10 weeks pregnant and super bloated. Even so what an invasive and fucking disgusting thing to say. I told him pretty bluntly to fuck off. He walked away with the most flabbergasted and hurt expression on his face. \n\nI reported him to management that day. A couple days later my manager pulls me aside and tells me there’s been a complaint about me. After some questions I find out it’s Steve who said “I get that it’s Origamibee’s culture to be stoic and cold sometimes but I feel that she’s purposefully being mean to me. I just miss her smile.” Over the last few days of him coming in I had only given my tables to other coworkers so I wouldn’t be directly serving him and refused to make eye contact. That was it, that was all. I was then written up. \n\nI’m so glad I quit and I hope I never have to work in a service job again. Fuck people like Steve and fuck racial fetishization.",
    "title": "Racially fetishized and harassed at work, reprimanded by management",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1572933991,
    "score": 2835,
    "keyword": "mixed race manager"
  },
  {
    "text": "To the man who told me I look like sunshine A few weeks ago, I started feeling like my world was falling apart. Things in my life changed, I felt out of control, and my mental health took a nose dive. I lost 6 pounds the first 3 days, I couldn't sleep. Panic attacks happened daily, multiple times. I was far from okay.\n\nI kept myself busy as much as I could. Because when I wasn't busy, I was thinking. And being alone in my head is not a nice place to be.\n\nSo I stayed busy. Working, reading, doodling, writing, anything. I was barely getting by but I was managing.\n\nBut then I had to grab supplies from the ER, which is a decent walk away from my clinic. I dreaded the walk. Not because of how many steps or minutes it took - in the medical field, you get used to walking a ridiculous amount - but because I knew that the whole walk, I'd be by myself, alone with my thoughts, even if it was just a few moments. If you've been where I am, you know how terrifying that can be.\n\nSo after procrastinating as long as possible, I finally gathered my composure and walked. And as soon as I stepped through my clinic doors, the thoughts came racing in. They taunted me, dancing like flames in an unstoppable fire.\n\nMost people didn't make eye contact with me. This was good.\n\nUntil towards the right of a hallway sat an old man. His skin was worn and wrinkled; the little hair he had left was white and grey. His pants were high on his hips and his back hunched a bit. My gaze randomly caught his and on cue, being second nature at this point to do so when seeing a patient, I gave him the best smile I could muster.\n\nHe immediately smiled back, his eyes glistened, and without missing a beat he excitedly exclaimed, \"You look like sunshine!\"\n\nI stopped for a second. His words sent a shock to my brain and for a short moment, the bad thoughts stopped. I happily thanked him, made a little small talk, and went on my way.\n\nHe didn't know that I had been crying and praying for death just hours before. He didn't know that I crawled into bed every night, not being able to fall asleep because of the heavy sensation of my heart pounding every time my eyelids dared to close. He didnt know that I felt unsafe and scared and alone. He didn't know the demons I was fighting as I walked from one end of the hospital to another.\n\nBut his words sparked enough happiness and joy in me to remind me that I am here for a reason. Contrary to what I often tell myself, I am a good person. I can make a difference in people's lives by just existing, just as easily as they can make a difference in mine. I am worthy of being alive.\n\nI am still struggling but finally am receiving the help I desperately needed. But when things get rough, I think back to that old man, his happy smile and the words he spoke to me. His kindness reminded me that the sun will always come up again tomorrow - the one in the sky, and the one within me.",
    "title": "To the man who told me I look like sunshine",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1550185262,
    "score": 85,
    "keyword": "mixed race manager"
  },
  {
    "text": "Homeopathy is a total fraud, and a cruel way to exploit people who are desperately looking for help. #Why it doesn't work\n\nEssentially, homeopathy is based on the belief that **like cures like**. In practice, this would mean that different symptoms would be treated using small amounts of substances that in bigger doses would cause them.\n\nI do acknowledge that this \"like cures like\" principle has been scientifically researched, with the name **hormesis**. Because of these studies, it's widely accepted that a small amount of a substance can in some cases have a different effect on a cell than a higher dose. However, we don't know how rare this phenomenon is, and the alternate effect it causes isn't necessarily positive or desired at all. \n\nPracticioners of homeopathy generalize this very unclear and controversial theory by thinking anything that causes a symptom can cure it in low doses. For example, in 2018, naturopath and homeopathic practicioner Anke Zimmermann gave a 4-year-old boy a remedy containing the saliva of a rabid dog, to treat the boy's supposed anger management issues (which, by the way, are perfectly natural for children that age), aggression and poor sleep, claiming that the solution \"cured\" him. If the remedy actually contained the virus, this woman was literally endangering a child's life for some crazy pseudoscientific experiment, while probably charging the parents a significant sum of money for it.\n\nAdditionally, there is another, arguably even bigger problem with homeopathy. Homeopathic medicine is produced using a method called \"potentization.\" This means mixing 1 part of the desired ingredient with 9 parts of water, then shaking the solution, then mixing 1 part of the mixture with 9 parts of water again, and repeating this process over and over again. Homeopaths claim that the less of the ingredient the final solution contains, the more effective it is. This leads to the ingredients being diluted into nonexistence: in almost all homeopathic remedies, not a single molecule remains of the original ingredient. And even remedies that do have something else than water or alcohol in them only contain a couple of molecules of it: not enough to cause any effect. Again, none of this has been scientifically proven to work, but to be honest, homeopathic \"doctors\" don't seem to care about science anyway.\n\n\n#Research on homeopathy\n\nMost medical institutions around the world have rejected homeopathy as pseudoscientific nonsense, and rightfully so. In 2015, Australia's National Health and Medical Research Council, one of the world's biggest and most respected health institutions, conducted a massive study on homeopathy, with over 1800 different studies systematically analyzing papers and documents related to the topic. They concluded that there was \"no good quality evidence to support the claim that homeopathy is effective in treating health conditions.\"\nThe NHMRC had already come to the same conclusion earlier, in 2014, when they found homeopathy to have no effect in treating any of the 68 different health conditions included in the study.\nIn 2010, BMJ (earlier known as the British Medical Journal) wrote an article proving that complementary medicines, such as homeopathy, are absolutely useless as substitutes for conventional medicine.\nEven back in 2002, the British Pharmacological Society debunked homeopathy as completely ineffective.\n\nLinks:\n\nNHMRC study 2015: https://www.smithsonianmag.com/smart-news/1800-studies-later-scientists-conclude-homeopathy-doesnt-work-180954534/\n\nNHMRC study 2014: https://www.theguardian.com/world/2014/apr/08/homeopathy-is-bunk-study-says\n\nBMJ article 2010:\nhttps://www.eurekalert.org/pub_releases/2010-12/bmj-cmc122210.php\n\nBPS article 2002:\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1874503/\n\nThese were only a few examples of the overwhelming majority of evidence clearly showing that homeopathy has no real curative powers. It's a fact at this point.\n\nMost of, if not all of the \"evidence\" supporting homeopathy, however, is based on people's personal experiences. The problem with this is that these experiences originate from the subjective viewpoints of people who might be biased towards homeopathy, thinking it cured them for sure, when in reality there are tons of other possible reasons to someone recovering from a health condition. It could have been another treatment that was used alongside homeopathy that did the trick. It could have been a change of lifestyle. It could have simply been time: the human body fights for its health by itself. We all have powerful immune systems designed for keeping us alive and well.\nBesides, what about all the people who didn't experience any help from homeopathy? We never see the homeopaths talk about them.\n\nThere is only one way homeopathic treatment could possibly help a human win over a disease or health condition: placebo. But it's an effect that applies to literally everything. You could eat a piece of candy, and believing in it enough, it could make you feel less ill. Funnily enough, that's basically what homeopathy is all about.\n\n\n#Why it's unethical\n\nHomeopathic doctors act like kind-hearted and helpful people, who embrace the idea of \"natural\" medicine as a way of healing for everyone. Some of them, I'm sure, truly believe their own lies. But this empathy is also a way to attract customers. Homeopathy is a big business, and a very greedy one.\n\nThese mixtures of water and alcohol are being sold to unsuspecting people as a risk-free, non-invasive cure to a plethora of different diseases/symptoms, usually as a liquid or in the form of small sugar pills. The problem with this is that even though they have no effect whatsoever, they are highly expensive, disguise themselves as real medicine and deceive people who often have chronic, painful, difficult, crippling diseases or conditions that they are desperately looking for relief for. The homeopathic industry not only lies to people and takes their money, it can even worsen public health by discouraging people from seeking help from proven, conventional medicine, guiding them towards homeopathy and other nonsensical alternative treatments instead. This is a true problem.\n\n\nLastly, I want to link you to a video about homeopathy made by a brilliant knowledge-spreading Youtube channel that some of you may have heard of: Kurzgesagt (In a nutshell). This video is what made me aware of the many flaws of homeopathy in the first place, and for that I'm endlessly thankful to the creators of it!\n\nhttps://youtu.be/8HslUzw35mc\n\n\n\nEdit: just wanted to thank the strangers who gave me silver! Never expected anything like that from a post like this.\n\nEdit: wow, huge thanks to the redditor who gave me gold, I couldn't be happier!",
    "title": "Homeopathy is a total fraud, and a cruel way to exploit people who are desperately looking for help.",
    "subreddit": "medicine",
    "timestamp": 1558111113,
    "score": 1178,
    "keyword": "mixed race manager"
  },
  {
    "text": "Bang the Drum Slowly I work at a world-class hospital, we have a brand, we have name recognition, and we have an admirable mission and value statement that I still believe in. We serve a unique population, a population everybody who works there can easily and readily relate to. We lead innovations in treatment and technology, we are guided by altruism, and we attract the best and brightest. People pick up their lives guided by an urge to be a part of that mission and many of us form deep bonds with who we serve and our colleagues. You might have even participated in a fundraiser for us. Thank you.\n\nMy organization also routinely wins awards for “best places to work” and as an institution it is an amazing place to work, we are already global but our upper leadership wants to extend that in a way that is currently difficult to imagine even for those who conceive of it.\n\nAt one time, it was a prestigious place to work as a nurse or in other allied health direct care positions, and when I first arrived years ago I recall being a bit put off by the level of pride in the voices I heard in my colleague’s voices. I thought they were a bit snobby and elitist but I found myself gradually assimilating myself into that exact same mind set. In social situations, I was quick to let people know where I worked, and I certainly got the validation in the form of praise when I did that.\n\nThese days there is a different conversation going around, almost always in semi whispers, almost always in small groups, and always between people who have worked there a long time. And the conversation is very similar in content, “I miss the “old” X, the new “X” is a different animal.” I have a colleague who announced a retirement this week, everybody who knows this person was aware it was coming. The commentary is shocking similar: I envy him; he is leaving at the right time, good for him. Nobody thinks he will miss his old job, nobody thinks he is making a regrettable decision, nobody worries he might be having second thoughts. Nobody. He does not want to be a member of the new X because he knows he will not be valued, he knows he is just a part of an engine, he knows his opinions and ideas are no longer valued, he knows if he speaks up in anything other than glowing and positive terms, he will be dismissed. The name of the game at my place is recruitment, not retention.\n\nThere were always somewhat endemic problems in nursing. Prestigious jobs tended to go to the person with friends and connections. Bad behavior from some people was tolerated, while mild infractions from others were severely punished. I think that is not a unique issue in the hospital world. We routinely hear about transparency and accountability as a guiding force but the truth is much different, you can be transparent if you are powerful, everybody else is taking a risk.\n\nAfter our laissez fair Nurse Executive moved on to another position I knew we would bring in a much different personality, a change agent. I was hoping for somebody young and dynamic. Instead the organization hired a very capable, intelligent, and dynamic end career nurse who has held many positions of change an authority and who quite clearly wants to top off the resume and ride off into the sunset with a flourish. The changes she is leading and implementing will have far reaching impact. Long after she is gone many others will be living and working with the structure put in place. I think it is a smart move: lead the revolution and then get the fuck out to avoid the wrath.\n\nWe also made other leadership changes in HR and the financial sectors. A metamorphosis so subtle nobody initially noticed the old “X” was transforming.\n\nOn the advice of consultants, we are in the process of dismantling one of our most popular retention tools to keep experienced and seasoned RNs at the bedside during off hours. Of course, it turned out that it was a very expensive program to maintain. After careful market assessment, it turned out many of these nurses were making above the market. These nurses were recently called into a meeting and told they were “grossly over paid” and their wage structure was being adjusted. Some people because of years and service, education, and professional credentials that they thought they earned, are now on the hook for losing thousands of dollars. They are all older and the younger nurses are lacking in sympathy because they don’t make as much. It doesn’t occur to them that if they build a career here in five or ten years somebody else is going to call them into a meeting and saying something very similar: sorry we did a market adjustment: you make too much. This all occurs within a context of constantly being told during performance evaluations to focus on professional growth, get more education, get a certification, volunteer for projects and committees more. In other words, people did what they were told to do and then in doing what they were told to do, they priced themselves out. The lesson here is obvious: the smartest nurses come to work, work hard but temper their ambition.\n\nThe next thing that leadership decided was that all the front line supervisors needed to be restructured. Now, I am going to say this: I have a lot of colleagues in this group who are honest, decent hard working people. I also have a few who routinely manipulate their schedules and have chronic attendance issues so we are not all a bright and shining group. Over the last few years we have continually had to change our schedules and work short and there have been power struggles as we have adapted to a faster pace, and more complex populations. We have frequently been pitted against one another as we grapple for resources while being told to be united and collaborate. One minute we are critiqued for collaborating if it is the wrong kind of collaboration, and the next we are praised, usually for collaborating in the ways that make upper nursing leadership look good.\n\nSeveral of us have done this job for ten and twenty years and in a months time we are all being forced to interview for our jobs, competing against not just one another but everybody else in the institution and external candidates. Instead of doing things the old way: anybody with experience has been through the scenario where bean counters come in and decide all the Managers are making too much money and they get escorted out of the building, we are doing it the new way. The new way is that we have been to two retreats where we are asked to talk and sort our “feelings” and sectioned off into task forces to do process design and job design. That way when we do our Magnet application one of the selling points will be that the front line supervisors we the ones who “recognized” the problem and restructured their own jobs. But when we ask questions about job duties, schedules, compensation, and other relevant factors we are met with vague answers. We were also told we had to construct a “brand” to present at interviews to impress and wow the panel.\n\nMeanwhile we are expected to continue doing our jobs, act as if this new process is the most fantastic thing to have been conceived, and to encourage other people to apply for our jobs. There is a very good chance I am supervising people who think they can do my job better than I can who will apply. They will certainly be cheaper, they will certainly have less understanding of the systemic problems, and probably some of them are smarter than I. I am not making assumptions.\n\nBut certainly the message I am getting, and the message several of my colleagues are getting is that loyalty, longevity, and service mean nothing. \n\nThat is part of my take home message: if you are a young nurse or even an ambitious one with designs on leadership: consistency, hard work, and loyalty will work against you. It is far better to take what you can get and move on to the next offer when it comes up. Don’t feel bad about leaving your colleagues; don’t get emotionally attached to an organization or even a mentor. Your mentor today could be telling you to pack your shit up tomorrow. Part of the reason my colleagues made that mistake is because our mission is so appealing, so real, and so tangible that we were unable to see we were just part of the machinery. The reality is the mission we so deeply connect to can be served by anybody. We don’t matter. If I do not get hired for a position, the mission statement does not care if I cannot pay my mortgage, or if I have no health insurance. It is not personal against me either; it is business the mission has to be served. The very thing that draws people in: a personal connection to the mission and values is the thing that makes us expendable.  So many other people want to serve the exact same thing that we become merely units of calculation.\n\nI also realized even if I do succeed and make myself a worthy candidate, I will always be looking over my shoulder, I will always wonder what the next great revision of the vision will be. Will a new leadership come in and demand new changes? \n\nNow, from an intellectual point of view I can rationally understand this is all a part of strategic planning, this is all a part of institutional survival in a world where resources are shrinking and we have to manage them especially since we are a non-profit. That is another takeaway: never assume that a for profit hospital is more calculating and less capable of repudiating their human capital. They all make the same decisions; they simply express them in a different way. The for profit organization are simply more nakedly opportunistic.\n\nThe timing of all this is also very specific. We are re-applying for our Magnet status and we need new structures in place that show us to be deserving. Many of the nurses I work with think we don’t deserve it and that the designation is meaningless to them. Upper leadership argues that Magnet hospitals tend to have better quality indicators which in turn lead to better outcomes but if they read some of the common literature they would find that many teaching hospitals that are not Magnet certified often have the exact same metrics and outcomes. The literatures is somewhat mixed.\n\nDuring one of the retreats we were extorted to “find our joy” and that if we could not “find our joy” we were not a good fit. The message was clear, wear the mask. Losing your job can be an “opportunity” for personal growth and reflection. \n\nOnly in modern corporate hospital scenarios can joy be used to inflict tyranny and positive attitudes used as an instrument of conformity and dread.",
    "title": "Bang the Drum Slowly",
    "subreddit": "nursing",
    "timestamp": 1563298532,
    "score": 41,
    "keyword": "mixed race manager"
  },
  {
    "text": "Post Magnet survey one-on-one... Current hospital I work at is trying to reach Magnet, so they rolled out a survey sometime last month.\nBasically my particular unit \"scored\" really low.\nOur managers came back in a meeting and seemed disappointed in us. As if we were personally punishing them rather than just being honest about our work environment.\nFast forward to a few days ago, my manager called me into her office for a quick one-on-one.\nShe immediately opened up with the magnet survey scores and wanted to know why we scored the unit so low.. Because she felt as if we were \"doing good.\"\nI was simply honest and said, we can't keep staff and we are stretched so thin. Not to mention we're the lowest paid hospital in the area. So you mix that with not proper staffing, and people don't feel like the work they put in is being rewarded. We don't feel compensated at all.\n\nSo instead of my manager taking some kind of responsibility or even show sympathy... She proceeded to say, \"then if you all are so unhappy, why are you still working here? That's my biggest question.\"\n\nI was appalled. I simply told her... People have families, bills, debt. It's not exactly easy to find a new job at a moments notice. People have to stay for very many different reasons.\n\nSo completely ignoring that comment, she then proceeded to blow my mind yet again. And literally asked me to change my answers on the next survey. She would \"really appreciate it.\"\nSo basically, you want us to change the answers on the survey to benefit your job, but nothing will change for us? No thank you. \n\nAre you kidding me? I was probably red in the face when I left that office. I couldn't believe what I was hearing.\n\nI am not going to begin to understand the world of management, but all I know is that they are so damn disconnected from the real side of it and it is SHOCKING how their mind works. /rant.",
    "title": "Post Magnet survey one-on-one...",
    "subreddit": "nursing",
    "timestamp": 1555597717,
    "score": 32,
    "keyword": "mixed race manager"
  },
  {
    "text": "I’m a horrible nurse. Pretty much exactly what the title says. I’m someone who has always been extremely intelligent and book smart, but less gifted in actually applying that to hands-on skills and that is starting to become painfully obvious. I guess it could be worse - I’ve never committed a medical error, sneaked narcotics or had a discrepancy, or had a patient die due to my negligence.\n\nI’ve been a nurse for about a year, the first 8 months or so of which were on a mixed medical ICU and PCU. I was mostly on the PCU side, but I juggled 3 patients (our max ratio, which was pretty much all the time) fairly easily and in general felt like I had the grasp of most of the job by 6-7 months in. I left because I hated management and the patient population. Due to the fact that I am very task- and detail-oriented, I thought the OR might be a good fit for me and so I was hired into our heart, vascular, and neuro ORs. \n\nIt’s been 3 months and according to my managers, I’m not doing well and not where they want to be. They told me by 4 months they expected me to be handling cases mostly independently and all the other orientees, even those who started after me, are succeeding much more quickly. This morning I dropped a tray (it was mostly of extras and according to the rep the case could easily proceed without it) and the surgeon asked to remove me from the room. Unbeknownst to me, my manager told me that many of the vascular surgeons (my favorite service) don’t want to have me in their rooms. None of my preceptors ever gave me any indication that I should be farther along or that maybe my sterile technique wasn’t the best (I’ve since worked very hard on improving it and my techs have noticed and been very patient in allowing me to help them open and set up the rooms). \n\nWhat do I do? I’m having so much anxiety over this job I can’t sleep at night. I’m sure I’ll be fired at any moment. Any advice, constructive criticism, or whatever else is appreciated.",
    "title": "I’m a horrible nurse.",
    "subreddit": "nursing",
    "timestamp": 1548434382,
    "score": 19,
    "keyword": "mixed race manager"
  },
  {
    "text": "My Quest to Leave Patient Care TL;DR: I decided to leave patient care and pursue a career in nursing informatics. I couldn’t be happier. \n\nFor the last year, I have wanted nothing more than to leave patient care. It became obvious to me that my mental health had become an unfortunate victim of the exhausting schedules, the constant stresses of day-to-day nursing life, and the ever-looming sense that I would likely continue to feel this way if I didn’t change my path. Granted, I have been working as a psychiatric nurse, and burnout is always creeping around the edges of my periphery. But there is also a *fear* that leaving the bedside is career suicide, and I subscribed to the idea that all these negative feelings were just “a part of the nursing experience.” I felt like I was betraying my fellow nursing compatriots with the very thought of leaving, like I was a deserter in a long-fought war. So I decided to push through with the hope that something would *click* and I would be well on my way to my much-coveted retirement from nursing. Of course, I’ve only been a nurse for four years, so that retirement was a very small light at the end of a very long tunnel. \n\nThen, something *did* click. I came to the startling realization that I was allowed to give myself a fighting chance if I wanted to see this whole “nursing thing” through to the bitter end. I started to do what I usually do, which is to peruse various job boards and hospital websites and dream about the possibility of sitting behind a computer and never seeing a patient again. I have found the process of recreating my resume and hypothetically marketing myself to be strangely therapeutic in the past, and every so often it gives me just enough of a confidence boost to push through whatever funk I’ve fallen into. But this time was a little different. I decided it would be a good idea to start applying to all the positions I would be interested in, regardless of whether I was qualified for them. After all, it was just for fun (and I hadn’t really considered the professional implications of doing this, so I don’t know if I recommend it). They were all at large medical centers anyway, and I’m sure they get tons of applications that go directly into the trash. \n\nBut then something weird happened. I got a callback from a hospital about an hour away from where I live asking if I would come in to interview for a nursing informatics position. On a whim, I decided it couldn’t hurt to see what would happen. I attended the interview, and then attended another interview, and then was offered the job. It was all very shocking and I was elated by the possibility that I was even considered for a position that was not in direct patient care. However, I was still stricken by the idea that if I were to leave patient care, then my marketability would come crashing down and I would end up crawling back to another entry level position and extending my misery. So I did what every self-respecting nurse would do: I harassed everyone who has ever mentored me to see what they thought. \n\nOf course, the advice I received was generally mixed. However, one piece of advice stuck out to me. My original hiring manager (and now friend) told me that no matter what I decided to do, that I should account for my own happiness. Nursing is a massive field and no matter how important I might be to my unit, there will always be someone waiting in the wings to replace me. So I should never feel like my soul is intrinsically linked to my unit or my patients. But even more so, there is no set rule-book on how to be a nurse. There is no pre-determined path that establishes what it means to be a “real nurse,” and I shouldn’t feel like I deserve less respect for choosing a path that makes me happy. \n\nSo I accepted the job and I start next week. I left patient care. I did it.",
    "title": "My Quest to Leave Patient Care",
    "subreddit": "nursing",
    "timestamp": 1573540451,
    "score": 15,
    "keyword": "mixed race manager"
  },
  {
    "text": "Calling all ICU nurses: What are some tips that you have for a new grad hoping to get into the ICU setting? Hoping this post isn’t redundant. 4th year BSN student here. Looking for tips on how I can best prepare myself to perform well in an ICU setting?\n\nI’ve gotten my shoe in the door at one particular hospital where I worked on a mixed MedSurg, PCU, and ICU floor. Still not a sure thing but better than nothing, I assume. I’ve familiarized myself with a lot of the analgesics, sedatives, and basic assessments. \n\nIt seems like time management is really important in the ICU setting. Any tips that you wish you would have known prior to starting out in the ICU?",
    "title": "Calling all ICU nurses: What are some tips that you have for a new grad hoping to get into the ICU setting?",
    "subreddit": "nursing",
    "timestamp": 1566153854,
    "score": 13,
    "keyword": "mixed race manager"
  },
  {
    "text": "Kid quote of the day... (H.S.) “I’m not afraid of my mom, she’s white.”\n~a mixed race sophomore boy with lots of teenage attitude \n\nContext: one of the table groups was discussing how their parents react when teachers call home.",
    "title": "Kid quote of the day... (H.S.)",
    "subreddit": "Teachers",
    "timestamp": 1550194970,
    "score": 16,
    "keyword": "mixed race manager"
  },
  {
    "text": "The best Fridays are the ones that start with your best class exploding into a shitstorm, right? Music k-4 \n\nI have a second grade class in my rotation that is wonderful. They pay attention and always excel at whatever activity/song we do, above even third grade classes. \n\nThere’s one girl who’s a little out of the mix. She has no information on any disabilities/IEP or the like. She’s one that’s always very pouty. It’s progressively gotten worse in the past couple weeks. I’ve addressed this, nobody has followed up with me on her issues. \n\nLast time the class was with me, she was already upset about something from PE (thanks for not resolving any issues, PE teacher) and sat in the back of the room, whining and pouting. A very bad actress too, acting more upset and in pain when your eyes linger near her. \n\nToday it was the same deal. I’m right next to PE so I can hear screaming in there that happens before kids come into my room. Lots of yelling this morning and in the hall. She came in and did the same thing, refused to sit in a spot, refused to talk, etc. Except this time, she was extremely loud. We do a calming activity when we come in the room every day. Not very calming when someone is yelling through it, shouting indiscriminately and at nothing. \n\nWell another student, who I guess has an anger issue, had been yelling back at her all morning. Screaming at her to shut up. Furiously. I told him to cut out the rude attitude. I told the class repeatedly to ignore her—she’s seeking attention and their response to her makes matters way worse. She says she’s bleeding, I don’t see it but tell her to get a band aid. She gets one and it stayed in the wrapper in front of her. \n\nOnce our activity got going, she stopped shouting out and all that. When we finished our song game, kids were going back to their spots to get shaker eggs and do another little activity song. She decided to sit on a spot quietly like she should, I asked her if she was calm and steady enough now to have an instrument, treat it right, etc. and she said yes. I handed her an egg and it was fine for two seconds—then she realized it wasn’t the color she wanted it to be. \n\nMeltdown x 200. Screaming batshit crazy. Not speaking, literally saying “wah” and yelling as loud as possible. I tried reasoning with her and she just yelled. Now her stomach hurts, and she’s pushing it in with her fingers and jabbing herself—like she’s trying to make it hurt. \n\n The song ended and I took the eggs up. She kept yelling. We had ten more minutes but I sent the class outside because she was at a decibel capable of causing hearing damage at this point. If I spoke to another student or even looked at someone in the class, she would scream louder. \n\nI buzzed the office to ask for help. I had to repeat myself four times because they couldn’t hear me. I had to stop asking “Hi, I need help with a student that’s having some issues in Music” and switch to “I need help”. Door is propped open by a good student, kids are outside, an aide comes to help—just as another aide I’m familiar with is walking by and asks if I need help (only nice thing about this situation, thank god I have some support). The aide assumes it’s one of the kids he sees that regularly have breakdowns. Neither aide—both of whom work with all grade levels—knew who this girl was. \n\nWhile she’s being taken care of, asshole kid who yelled back at her over and over is talking shit while everyone else is being quiet and waiting patiently. I tell him to stop talking, getting more and more firm. *Don’t talk like that. It’s not your job to handle her. Worry about yourself and stop talking. Hush.* He just. Kept. Talking. Mind you, it’s 930 and this kid is already on like, double red. This omnipotent 8 year old then says that he could have fixed her behavior. I look at him and ask who the adult is, who’s in charge of managing students. \n\nHe goes, “I am. You aren’t, you weren’t even yelling at her.” \n\nSo off to the office we go. I’ve been cool this whole time, I snapped at him once mid-class and raised my voice, but that was mostly to fight the various sounds. Now, I have a whole rotation of classes waiting (other teachers know what’s going on obviously) while I take this kid up to the front. Only one AP was in her office, I peeked inside and she was on a call. She stopped for a second and said “He usually sees other AP”. Oh, so this kid always acts this awful. \n\nI leave him up at the front to get my next class that I’m four minutes late for. My face is red but I walk in and bring my kids inside. I put on a video for them for a minute while I went to wash my hands and take a klonopin, and started writing up the emails and reports. \n\nThen, the rest of my day happened. All six and a half more hours.",
    "title": "The best Fridays are the ones that start with your best class exploding into a shitstorm, right?",
    "subreddit": "Teachers",
    "timestamp": 1552090185,
    "score": 12,
    "keyword": "mixed race manager"
  },
  {
    "text": "First year teacher, what do I do in this situation? Sorry for the rant. I'm a young white female HS science teacher (gay but not out to students). I'm originally from a very white conservative town.  I teach in a very diverse NYC school.  It's my first year and the admin is super supportive, co-workers are super helpful and great mentors,  and I really enjoy teaching. \n\nI wanted to teach in a diverse area in a Title 1 school because I felt like I could probably relate to the students more than I could relate to students where I'm from. \n\nDespite growing up in white middle class suburbia,  my parents struggled to pay bills and regularly accepted food donations to keep us fed.  I survived a violent crime at a young age and have dealt with clinical depression and PTSD for the majority of my life.  I've had to be financially independent since i graduated high school. My parents do not accept me for being gay. My dad is verbally and emotionally abusive but stopped talking to me for the past couple of years because of our differing views.\n\nObviously being white I can't relate to the students' experiences with systemic racism,  and I don't pretend to understand what racism feels like. And I don't know what my students who are immigrants have gone through or are going through either. But I can at least relate to surface level discrimination (as a woman in science and as a lesbian in general).  \n\n\n\nWell as a first year teacher,  I didn't start off with strong classroom management and I try to be very understanding and kind to the students.  So naturally they walked all over me, took complete advantage of me,  and as soon as I tried to apply what I've learned and get classroom management under control,  they lashed out. \n\nOne particularly tough student calls me a racist for asking the class generally to behave, acting like I'm addressing only him by name. During a test this week he stormed out of the room and declared in the hallway that I'm racist because I asked EVERYONE to stop talking during the test.  He is the oldest kid in the school and the younger students look up to him,  so they have started to tell me that they feel targeted as well if I tell them that I need them to be quiet during a test.\n\n\nAnd these kids try to gaslight me (challenge my reality to drive me crazy) every day.  I ask them not to talk while I'm talking,  they say they weren't talking. I say I saw you talking and I need you to stop talking. They say no, I wasn't talking. I tell them their classmates deserve a quite testing space and ask them to be mindful of their peers,  and they tell me they don't need a quiet space. They have no regard for other people. \n\n\nI thought I could relate to these kids,  but I just can't understand them.  I had a tough life growing up,  I thought at least some of them would have had similarly tough lives  and would have some level of maturity.  But it's like I'm teaching the third grade most days. I watch them throw a water bottle and reprimand them and they tell me they didn't throw it!\n\nI always felt ostracized growing up having such a different perspective than my peers and family,  and I feel totally ostracized by my students now. They don't accept me and since they keep playing the race card it feels like they just don't like me because I'm white and they see me as not like them. \n\nThey operate on the principle that everyone,  including teachers,  have to earn their respect. I try to show interest in their interests,  I check in on them when they seem to be having a bad day,  I'm there for them every day,  and I try very hard  to be as fair as possible in everything. But I have been unable to earn their respect. What can I do?\n\nThank goodness I have the next week off for mid writer recess because I've been so distraught over this lately. \n\n\n\nTL;DR  I assumed since low income students in a rough area experience more difficulties  in life they'd be more mature and I could relate to them.  I was terribly wrong. I can't seem to earn my students respect and I can't understand their logic behind anything.",
    "title": "First year teacher, what do I do in this situation? Sorry for the rant.",
    "subreddit": "Teachers",
    "timestamp": 1550291574,
    "score": 11,
    "keyword": "mixed race manager"
  },
  {
    "text": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans? **TL;DR/ Daily objective:** I am posting here seeking resources about research or programs about how U.S. public schools can respond to and change a culture of fighting and truancy. The \"goal,\" is not to expel all the students who've ever caused trouble--the goal is to create a school culture where students don't want to cause serious trouble, and former \"troublemakers,\" can receive and flourish form a quality education. I am hoping that we can compile some crowd-sourced resources including: links to online articles and research studies, names or links to programs with high success rates that our school could look into buying or implementing, book suggestions that contain this kind of information, or other concrete data-based evidence or action plans. Anecdotes would be appreciated, but anecdotes are not evidence and our school can implement a school-wide, multi-year improvement plan based on an anecdote. I will post basic details, then more detailed details underneath this TL;DR/objective comment; if you read this intro and have ideas, go ahead and post them without reading it all, but if you have the time or interest, I will give many details. \n**If you read the title of this post, my TL;DR/ objective right here, or my following detailed information and think to yourself, \"This is stupid, why is this person asking for help on reddit/ trying to fix a whole school/ believing that school culture improvement can happen/ working too hard/ not seeing the red pill ~truth~ and just blaming all the Black students,\" and you would like to make a disparaging or simplistic comment, please reconsider doing so and maybe go do something fun like eat some cheese crackers instead.** \n\n\n**Basic details:**\n\n\n-School location: Flyover state, USA \n\n\n-School demographics: 40% white, 20% Hispanic or Latino, 25% Black, 10% choose not to say/identify only as mixed race; 5% Asian/ Pacific Islander, Native American, and other. \n\n\n-80% of students on free and reduced lunch \n\n\n-Advanced Placement Participation Rate: 15%\n\n\n-Standardized test scores: below state averages \n\n\n-Important/ successful departments and programs: art, theatre, speech and debate, fine arts, music, ballet and dance, pre-career EMT, pre-career dental, pre-career welding, pre-career autoshop, pre-career automotive, pre-career fire science\n\n\n-Location part II: in a weird area that covers of dense-population urban areas, suburban areas, and about 20% farm kids \n\n\n-Gang activity in the area: Exists, present in some schools but mostly limited in ours, little to no direct gang affiliations, tags, or threats, but about 5-10% of students have direct gang ties or affiliations; lots of students joke about who is what or call other students members of gangs to call them stupid (\"Yeah well you go ahead and be your dumbass self, gangster disciple motherfucker,\" \"Miss, you know I'm Mexican, you can't fail me or I'll sic the Kings on you.\")\n\n\nProblems: Fighting, retaliatory fighting, people wanting to know about and watch fights, understaffed/ ineffective/ elderly/ moderately racist/ lazy security staff, truancy and loitering within the school/ hallway-wandering, phones, sexist comments and catcalls toward girls from boys, horseplay/joking around that turns serious, boys \"just joking,\" around with touching girls when they've said stop repeatedly and genuinely don't want to be touched, \"playing around,\" by taking another student's phone, parts of the school mysteriously smelling like mint/mango/ creme/ cucumber/ fruit/ Virginia tobacco, mysterious rectangular flash drives plugged in all over the place, students who think they can responsibly and reasonably handle their weed but show up smelling like skunks and unable to answer higher-level questions or complete complex tasks, disrespect to teachers, disrespect from a select few teachers who hate teenagers.\n\n\n-Most students are good or fine, typical high school students who are also fed up with people who walk the hallways, who fight, and who disrupt classes. But also everyone loves watching fight videos. \n\n\n-Students of all races participate in fights, hallway-wandering, and class disruptions/ disrespect toward teachers. However, Black and Hispanic students doing these activities are seen as bigger troublemakers while white students are more likely to get a warning and no true referral. Also, Black students are more likely to be stopped in the hallway by teachers and security guards and asked for a pass, even students who do not habitually wander hallways but are just genuinely trying to go pee, or really did forget their notebook in their 5th hour classroom.\n\n\n**Heckin' details**\n\n\nWe have a current epidemic of fights. One fight happens, then other students get mad because of who attacked whom, yeah, but also because of who tried to hold someone back, who DIDN'T try to hold someone back, who filmed, why they filmed it (it was funny? it was tea? they were supporting their friends? an attempt to create and preserve evidence of what truly happened? evidence of teacher or police mistreatment? who knows), who previously had beef with the person who was fighting and it got re-ignited, who got suspended or who didn't get suspended, etc, etc... So there's groups of students who are on edge, then there's a fight, then other people hear and try to run toward it, problems emerge while breaking up the fight, students get suspended, they miss classes, they get in bad trouble at home OR don't get in any trouble bc of uninvolved or otherwise \"let's get them back,\" parents, they smoke a lot, they return to classes, they're behind on work and annoyed by how students are looking at them (because everyone knows who was in the fight), students get on edge, then there's a fight, then other people hear it and try to run toward it, then...the cycle continues. \n\n\nWe also have a problem of students loitering/ skipping but staying in the building. There is a core group of students who come to near every class late, leave their materials in lockers, get out of class by finagling a pass from an exhausted teacher or a sub or just plain walking out, they walk to their locker and friends' lockers and stop to pee in the juul rooms, they walk by their friends' classes that hour and wave to them from the windows, OR my favorite, a random wandering student walks into another teacher's classroom and insists on talking to their friend (??? I've had students walk in my door if it's propped open, push past me if I open it assuming the student is a pass-runner, or POUND on my doors making me think there's a life-threatening emergency), the students walk slowly and on their phones, or people scream at each other, fights break out... hopefully at some point, hallway-wanderers will be intercepted by a teacher or security guard. Then they're either simply snapped at \"Get to class!\" and the student looks serious, says they're going, and walks away to wander another day, or they're taken down to our dean's office where they get in trouble. \n\n\nAnd that's another problem; what do we do with students who continue these negative behavior patterns? \n\n\nIt's obvious that students fighting and skipping have no place in the classroom setting and need to be suspended, as punishment for their actions AND to keep them from distracting or even harming other students; obviously we need to suspend or expel troublemakers.\n\n\nIt's also obvious that students are skipping or getting in small fights so that they can get suspended and stay home from school, plus the fact that having troublemaking students OUT of school-- where they have order, rules, meals, staff who care, and access to quality public education, which is a right in our country and a way to lift people out of poverty--is undesirable and possible unethical; it's obvious we have to keep students in school and we can't just give students what they want and suspend or expel them. \n\n\nWe have many teachers and administrators who are prepared to try their best to take our school from okay to great, to make our strengths shine and **fix** our problems, rather than covering them up or kicking them further along the road. Not all teachers and admins are spectacular. But there's enough of us to make changes, as long as we know what changes to make, we work in sync, we reflect on progress, we use our resources, and we have a some but not an unreasonable amount of Jimmy John's work-til-8:00PM sessions. There are also students who are WONDERFUl, talented, hardworking, resourceful, curious, growth-oriented, compassionate, and more. We've had successful community outreach programs (food drives, volunteer programs, community elder outreach), and many students are incredibly frustrated about fights, hallways, and disrespect to teachers, and know that those are some stupid ways to go through life and handle problems. \n\n\nPlease, let me know what you know that can help. I cannot thank you enough for giving me any info to look into and report to my team.",
    "title": "[USA] [HIGH SCHOOL] Our school has a culture of fights and truancy. There's also the debate between \"suspend/ send home,\" and \"keep children in school.\" Have you been at a school that's successfully changed school culture to a more positive, lifelong-learner culture using research and action plans?",
    "subreddit": "Teachers",
    "timestamp": 1549597210,
    "score": 8,
    "keyword": "mixed race manager"
  },
  {
    "text": "Advice for New Teacher-Productive Summer Hello!\n\n&#x200B;\n\nNew to Reddit. I have been long-term subbing and just landed my first job in 6th grade for next Fall! I'm very excited. Now I am just waiting. I've been go go go since College and I feel like I should be doing something towards my goal right now. I've been working on my  management plan among other things but wanted to see if I could get some advice from all of you.\n\n&#x200B;\n\nWhen do you think it would be a good time to start working on my room?\n\nWhat do you wish people told you your first year?\n\nBest books to read? (Reading the First Days of School currently)\n\nHow can I make best use of my Summer? (I have limited teaching materials at the moment/no textbooks/kits)\n\n&#x200B;\n\nI have a whole flood of questions for the principal but wondering if I should wait til mid Summer or closer to the school year as she might be overwhelmed with other things? What do you think?\n\n&#x200B;\n\nBasically I just have a lot of excitement mixed with a whole lot of anxiety and uncertainty. Some words of advice would be great!",
    "title": "Advice for New Teacher-Productive Summer",
    "subreddit": "Teachers",
    "timestamp": 1559249660,
    "score": 7,
    "keyword": "mixed race manager"
  },
  {
    "text": "To the two people who shaped me to be who I am today - thank you Middle school is a scary, awkward, and all-around bad time for everyone to go through. The other students judge you, the new class structures confuse you, and you don’t know if you’re still a kid anymore, or if you’re in the weird gray area known as “tweens.” With everything swirling around you, stressing you out and making you want to curl up in a bathroom stall and cry during the class changes, the teachers can make or break those three years, and even beyond.\n\nI was an odd kid; there’s no way around it. Blunt-cut bangs mixed with old My Chemical Romance t-shirts and photos of Star Trek characters taped to the inside of my locker did not make for a kid who was going to be popular. I had friends, don’t get me wrong, but I still felt like an outsider; someone that did not, and would never, fit in. Walking around with the idea that no one really cares fucked me up for a good while.\n\nThen, you two came along. Back-to-back, one in sixth grade and one in seventh grade, you both managed to make me feel like someone actually cared, that my interests meant something and would get me somewhere in life.\n\nIn sixth grade, I walked into the first day of school and hated it up until the last class of the day. The bell for sixth period rang, and when I walked into your class, there was something in the air that made every bad thing that happened that day fade away.\n\nYou were at the front of the class, an older man who reminded me of my dad. After introducing yourself to us as Mr. Damanda, you had a kid go to your desk and pull out a copy of the Hobbit. You then proceeded to recite the first page aloud to us, with the kid holding the book checking every word that came out of your mouth. You said every word correctly, of course, and it made my Tolkien-loving self realize that maybe, just maybe, this year wouldn’t be the worst thing ever.\n\nEvery single fucking day I looked forward to your class. The anecdotes you’d tell us about your childhood, friends, or the various animals you’d interacted with over the years always made me laugh, even when I was in mental states that I didn’t know how to get out of. With every reading log, you never accused me of lying when I’d write down the number of pages I’d read. You’d seen me in class and knew that I was absurdly fast when it came to reading, tearing through a hundred pages in less than an hour. You saw the photos my friends taped to my locker on my twelfth birthday; instead of telling me to take them down, you mentioned how you also liked Fall Out Boy, and that the photo of Spock with “Party Like a Vulcan!” written on it made you laugh.\n\nThe end-of-week homeworks weren’t my favorite thing to do at first, but after a while, I grew to love them. You always added insightful comments to my assessments and opinions of whatever novel I’d been reading; showing me how to improve my ideas and what I was doing right. Even years later, I still have every single homework that you edited.\n\nWhen it came time for the final project of the year, making a short, fifteen-page novel, you didn’t laugh at me when I said I didn’t think I could draw well enough to make it a storybook. You heard my words, and instead of forcing me to do something I didn’t want to, you let me write through the pages I should’ve been coloring. You allowed the writer in me that I’d been holding back to flourish; when I wrote past the fifteen-page limit, you never once told me to delete something. You’d have me drop the double spacing to singular, and you had me decrease the font size. It ended up being seventeen pages, but you let it slide.\n\nMost of all, you let a twelve-year-old who was confused about who she was write a story where two women fall in love at the end, married and happy, even when that kind of marriage wasn’t legal across the country yet. You allowed me to feel safe to be who I was, to test the waters of who I wanted to be, and nurtured my love of writing to be the creature it is today. I remember going back to your classroom on the last day of eighth grade, and when I told you I made it into the writing program at a high school nearby, the excitement on your face made me close to tears. You believed in my writing when I never did, and I can never thank you enough for it.\n\nSeventh grade was a similar story, yet different in the ways I needed it to be. I’d been looking forward to my science class all day, and when you welcomed me inside, I knew I had been assigned the best science teacher the school had. You started the class off with a powerpoint on why science matters in the modern world, and when it reached a slide about Mars, you and I had a back-and-forth conversation that I still remember fondly to this day.\n\nEvery single day was a new topic, a new area to bring my fascination into, and you knew it. We’d end up talking the class away over whatever new discovery had come up in the news, and the other kids in class would occasionally join in. I thought of you as the mom I never had, a maternal figure who loved me, supported me, and knew that I would do something great with my life. When you saw me, you didn’t see the broken-down girl who sheared off her hair into a pixie cut halfway through February because she didn’t know who the hell she was anymore; no, you saw a girl who loved the stars and world more than anything else, you saw a girl you believed in, you saw a girl who you wanted to see succeed in her life, and you made sure that I knew it. On the last day of school, your last day before retirement, I cried when I hugged you goodbye, and I saw you cry as well.\n\nNext fall, when I was in eighth grade and had an assignment in English to interview someone I idolized, I asked my art teacher if she could message you about it through Facebook, and you said yes. I came in after school with a notebook, my phone, and the biggest grin I’d had since June. When I saw you, all I wanted to do was hug you and call you “Mom” instead of Mrs. Conway, the second of which would’ve probably weirded you out. I left it to just a hug instead and started the interview. After we finished, you gave me a calendar filled with bird photos (since you took up photography ever since you retired) with a note on the back, wishing me luck in whatever career I chose to take up in the future.\n\nEver since I left the brick building I spent three years in, I’ve thought about you two. I think of Mr. Damanda when the story I’m working on passes fifteen thousand words, or when I read my work aloud at the open mic nights hosted at my school, run by the very program I’m apart of. I think of Mrs. Conway whenever the world’s knowledge of the universe expands, whenever I find myself looking up at the night sky, wondering what could possibly be out there, and knowing in my heart that I want to be the one to discover it.\n\nTo all of the teachers out there who wonder if it’s worth it, who think that they aren’t changing lives and making kids into the best versions they will ever be, I can assure you that there’s no one more influential to us than people like you.\n\nPeople like you give the kids who never want to go home a place to feel loved. People like you help the kid who doesn’t know who they are become who they want to be. People like you ensure that the childlike wonder we feel never fades, and turns into something for the betterment of everyone on Earth.\n\nPeople like you are the reason why myself, and thousands upon thousands of others, never gave up. Whether you make an impact in one student’s life, or every student that passes through your doors, you changed a kid’s life forever, and we can never, ever thank you enough.",
    "title": "To the two people who shaped me to be who I am today - thank you",
    "subreddit": "Teachers",
    "timestamp": 1555647400,
    "score": 7,
    "keyword": "mixed race manager"
  },
  {
    "text": "Love these kids This might end up on r/thathappened, but I’ll swear until the end this is truth. \n\nI suffer with gout. For those who don’t know, it’s considered one of the most painful conditions to live with. I’m in constant low level pain at best, and during this week, an attack left me in constant agony. I could feel every individual stitch on my shoe in the affected area, and I needed a walking stick to even be able to move around. \n\nI work preschool. Kids from 3-5. It’s Friday night of a week from hell. Everyone is watching the clock waiting for the parents to finally arrive. Me and a couple of students pick a “Where’s Wally” book to read (we’re British). After a few pages, the kids are super invested, making it a race to see who can find the red and white prick first. Suddenly, one kid (called D from now on) finds it. She jumps for joy... and double foot stomps right on top of my foot. \n\nThe roar I let out is heard throughout the building, and instinct makes me roughly grab Ds arm and yank her to the side. She runs, petrified to another teacher and I know. I’m screwed. I’m still well into my probation period after being hired, and I’ve technically just assaulted a child. D is now terrified and crying, and I’m doubled over in agony. \n\nThe other teacher goes to comfort D and I apologise to the other child (E) for shouting. They knew about my foot and I explain how D landed on it by accident. I’m doing my best to hold back tears, both from pain and the expectation that I might be fired. E looks at me with a tiny angry pout (such that only a 3 year old can pull off) and states “I’m gonna look after you and protect you!” Then gives me the biggest hug her tiny arms can manage. I’m not ashamed to say I nearly broke down. E didn’t leave my side for an hour. Even after we finished the book. I asked if she wanted to get another but she shook her head and didn’t let go of me. \n\nEventually mum arrived and E very slowly let go and ran to her. I got up and hobbled my way over to her and explained what happened and how all the candy in the house wouldn’t be enough for what E did for me. \n\nI’ve learnt that it’s her birthday tomorrow. Maybe I should get her something.",
    "title": "Love these kids",
    "subreddit": "Teachers",
    "timestamp": 1561832356,
    "score": 8,
    "keyword": "mixed race manager"
  },
  {
    "text": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals) Hi all! I am a first year teacher in the public school system, but I work in a Pre-K/VPK Blended classroom. For those who may be unfamiliar (as I was, since I'm originally from a state who doesn't have VPK), basically I have x amount of gen ed kids on my roster, and my co teacher has x amount of special needs kids on hers. Technically, I'm supposed to teach for the first 3 hours of the day (as VPK is 3 free hours unless you pay extra for wraparound care) and my co teacher is supposed to make accommodations for the special needs kids on her roster. However, she \"doesn't agree with the co teacher model\" and has decided she is the \"teacher\" and I am the \"assistant\". The biggest problem with this being that I actually am a certified teacher and have 10+ years experience working in a preschool setting. Anyway, she decided I could have a 10 minute teaching slot before my 3 hour VPK kids go home. Whatever. \n\nThat isn't even the part I'm here for advice about. This teacher is miserable. In no certain order, these are just some of the things that have occurred since mid August, when the school year started:\n\n-She made a comment that, last year, she recommended that all the \"blacks\" in her class be put in the \"black\" kindergarten teachers' class just because that teacher is also black.\n\n-While commenting on a mixed race student on my roster, she said she would not claim the \"black half\" as it would \"only make life harder\".\n\n-She makes unprofessional comments and holds unprofessional conversations with parents at drop off and pick up.\n\n-She chases my parents out of the classroom if she thinks they've been in talking too long (she has done this multiple times with one of my parents who has deep concerns about her child's behavior and mental well being).\n\n-She constantly berates, belittles and corrects my teaching style, going so far to even suggest I should change how I have always taught to match hers.\n\nJust a few days ago, she was pulled in by our admin and told that there had been a few parent complaints regarding her, and that one of my students refers to her as \"the mean teacher\". Here is where I need advice - do I go to admin over this? I'm told that everyone \"knows how she is\" already, but I don't feel like that makes her behavior okay. But, I'm new and she has been at this school for 14ish years (only in pre-k for 3, though). Has anyone else dealt with a terrible co teacher, as well? I'm kind of at my wits end.",
    "title": "Advice for working with a very difficult co teacher? (Cross post from r/ECEprofessionals)",
    "subreddit": "Teachers",
    "timestamp": 1573167874,
    "score": 7,
    "keyword": "mixed race manager"
  },
  {
    "text": "What are hiring managers and hr really looking for on a LinkedIn profile that the can't find on a resume? Watched a video where the guy was saying it's used for discrimination and doesn't have any verification of employment. It's becoming required by more jobs in order to get more information on an candidate than they normally don't need so they can use it to discriminate (age, sexual orientation, race, job gaps etc.)\n\nIs this what it's actually used for? I'd prefer from actual hiring managers and hr but i'm open to all opinions. I have never thought about it that way, I just have it to connect with people and keep a network open.\n\n\nEdit: The [video](https://youtu.be/lGcY_FbDKEM) if anyone is curious",
    "title": "What are hiring managers and hr really looking for on a LinkedIn profile that the can't find on a resume?",
    "subreddit": "careerguidance",
    "timestamp": 1572963871,
    "score": 197,
    "keyword": "mixed race manager"
  },
  {
    "text": "Help! Ghosted after accepting job offer?! I recently quit my job of 6 years that I loved because I was recruited by another company through LinkedIn who saw my skills/experience and thought I would be a perfect fit for the job as manager overseeing 3 different high volume locations on a high school campus. \n\nRecruiter invited me to a invite only job fair. When I arrived the HR rep automatically assumed I was there for a \"shift supervisor position\" which is way lesser of a position than I was going for/ qualified for. She said there was only shift supervisor & assistant management positions open. I told her I must have been mislead, and I had spoken to a recruiter on linked in. Only then did she \"check her computer\" & see that in fact, there was a full management position open. \n\nThe interview itself was with the general manager, & I completely nailed the interview. This company focuses on guest service and standards so I answered my questions around that. My district manager from my previous job used to be this managers district manager as well, so I made sure to ask if she knew him in the interview. They did seem worried that I had worked only low volume locations(my companies high volume doesn't touch their low volume), but loved that I had experience as a leader in 3 stores, supporting other locations & had opened a brand new location in the area recently as well. I also had all the management training done, certifications done, & experience training leaders/tms for the district.  I almost expected to be hired on the spot. But was told they needed to get through the rest of the applicants, see how the day plays out & then would get back to me. \n\nThe recruiter reached out to me and asked what I thought. I was completely honest, I told him about the mix up & how the hr rep seemed to judge me based on my age. He said he would figure out what happened because he had spoken prior directly with her & said that I specifically was there for the upper level management position. He basically hinted that I was overqualified. \n\nThe manager reached out to me and asked me to come in for a second interview with another manager. The interview was with both managers. It was extremely laid back and it seemed like more of a meet & greet then an interview. When I explained all the training I had, the second manager asked the first what one of them was- and the first goes \"thats the training you're doing now.\" The second manager asked the first if we talked about pay, where the first manager kinda of whispered - well I think that *hr rep* will discuss that. \n\n2 weeks went by and I thought ok, not happening. Then I get a call from the hr rep apologizing because they realized noone had reached out and then offering me the position. I explained I was still interested but was currently at work & asked if I could call back in a few hours. \" Ok no problem! \"\n2 minutes later the 2nd manager calls me and asks if I'm still interested, I told her I just spoke to Jessica & I was, but I was at work and would call back in a few hours. I called back and neither answered their phones, kept ringing. I left a voicemail on one. Noone ever called me back but HR rep emailed me the welcome packet, job offer, etc. The position was for assistant manager (a position lower than I had interviewing for) but salary pay & higher than I was making at the job I was working. I completed all the paperwork (e-sign) sent it in, and asked if It was possible for a later start date so I could remain professional with my employer & give them correct notice. Hr rep replied it was no problem and since I let them know about my vacation during interviewing. She offered I start the day I come back. I said that would be great!\n\nSince noone had called me back to discuss more of the position, I reached out to check about dress code. They said they would order me a shirt & asked what size. I replied back with size & a thank you. Now time has gone by and I am meant to start in 6 days. I reached out the day before my vacation to the 1st manager, Ccd the 2nd manager in, & did not get any responses.... I asked about the rest of the dress code, and where exactly/what time I would be reporting to since there are 3 locations on campus. \n\n3 days have passed since I sent the email. I'm on vacation at the other end of the country & would rather not make a phone call because the manager speaks very broken English and it's hard for me to find somewhere quiet here. Should I fwd the email to the HR rep and ask for her help? I dont know what to do and dont understand why they are ghosting me😭",
    "title": "Help! Ghosted after accepting job offer?!",
    "subreddit": "careerguidance",
    "timestamp": 1566572804,
    "score": 126,
    "keyword": "mixed race manager"
  },
  {
    "text": "How do you break into project management? Hey everyone, this may a bit of a ramble but I'm just looking for pointers.\n\nI quit my job on Friday. I was given an ultimatum of looking after my infant daughter who had chicken pox for a few days or keeping my job.  I know I could take the whole thing to tribunal but I have had enough with the company and decided to leave on my own terms.\n\nI had a bit of a mixed role. My title was estimator, but in reality I was running my own department estimating and coordinating stone masonry projects all over London. There was a lot more scheduling, meeting with clients, checking progress and reevaluation of projects going on for a typical estimating role. After looking into project management and what it entails I am fairly certain that is what I have been doing all along under a different title.\n\nMy question is, without 'project manager' on my CV how would I go about getting into that?  I am also hoping to step away from construction as although I am competent in it I have lost my interest in the sector. Which leads to my next hurdle. How would I go about breaking into project management in a marketing or digital agency where my interests currently lie?\n\nThanks in advanced, any tips would be appreciated.",
    "title": "How do you break into project management?",
    "subreddit": "careerguidance",
    "timestamp": 1560161247,
    "score": 54,
    "keyword": "mixed race manager"
  },
  {
    "text": "Called in sick to a boss who didn't respond to my email. Messy backstory but would you reach out again? UPDATE - Hello, I have no idea if anyone ever comes back for updates but here we go.  Thank you so much for your support and guidance. Starting tomorrow, I am taking four weeks to care for my sick relative under FMLA.  It was an incredibly easy process, if anyone is curious. At least for me, it was. Doctors had to fill out paperwork, I was interviewed over the phone by my insurance and it was approved quickly. The HR dept was great and my boss was,and has been, supportive throughout. I don't think he and I will ever mesh but that's okay. He has been thoughtful and encouraging which has helped us relate much better. So thank you very much again. It's going to be a tough time but I feel like I can breathe a little easier.  Reddit is the best, thanks guys!\n\nHi all,\n\nThe messy backstory....After 10 months , I'm burnt out from being a caregiver and working a job for a micromanager. I've been spiraling. I lost my dad last year and now am caregiving another close relative, it's a bad time. Typical burnt out, insomnia, exhausted, drained.  I'm in therapy (highly recommend) but here is my question...\n\nLate last night I took my relative to the hospital, spent hours there, didn't get a wink of sleep and emailed my boss I wouldn't be coming in, with, of course, an apology. I didn't elaborate other than a \"family emergency\". For the first time, he did not respond to me.\n\nMy relative is okay, thank God, but as for work.  I feel like a zombie, going through the motions of a job that is not a good fit, people quitting weekly. Weekly. I hate to miss but I also have done, objectively, a really good job considering the challenges. Received great feedback from other mgrs, just not my own. HIS boss likes my work and I think that's why I have the job.\n\nSo it's a bad mix. I think he is fed up, I'm burnt out on two fronts (job and personal), and here I am, seeking advice.\n\nBack to the question - Would you reach out again? I'll just add this. When my boss has been upset before, he gives the \"silent treatment\". That's part of his management style, for lack of a better word.\n\nToday I'm going to take the time to sleep and then ask my out of town siblings for help. I've spun out, they need to step up and help us.\n\nIf I hadn't experience the silent treatment, I wouldn't worry. Oh, you probably are wondering how much I've missed. One day a month, less on some months. I've always offered to provide proof.\n\nI have enough money saved to last over a year. So that's helpful, obviously.  Now I'm rambling, stopping now.\n\nMany thanks for reading and your input. I have anxiety about tomorrow and yet I don't.",
    "title": "Called in sick to a boss who didn't respond to my email. Messy backstory but would you reach out again?",
    "subreddit": "careerguidance",
    "timestamp": 1564580886,
    "score": 19,
    "keyword": "mixed race manager"
  },
  {
    "text": "Switching back to IT, why i can not find an IT position? Dear all;\n\nThis is the first time i use reddit, a friend of mine advised me to join and take the advice of the members with regards to my case. i came to the states couple of years ago and i found a job as a controls engineer which i found out that it is not my passion so i decided to go back to the IT domain. Just to brief you about my background:\n\nI have a bachelor degree in computer engineering from my old country. Masters (MBA) from NYIT New York. i have a mixed work experience between the IT and Management. i started as Technical Support Engineer and then a Senior IT Technical   Support Engineer, i switched to management after taking my online MBA in 2008 and i got involved in management (Operations Manager and Business Development) till 2015 when i came to the USA. so IT has been my passion since the beginning but Controls is the job i found and i have been doing it for the past couple of years but i do not see myself doing it any more.\n\ni have been applying aggressively for IT jobs even jobs for entry level, jobs like project management, business analyst, IT consultant and any other job that does not require technical work or technical customer support  (Basically any job that i can use my management skills with the support of my previous technical skills in troubleshooting and supporting microsoft platform such as Windows Server, Exchange, ISA,....) with no luck.\n\ni thought that my resume is the issue so i decided to ask the help of a professional resume writing company and they reshaped my old resume and gave me a new one that can pass the ATS systems. i have been using the new resume since June and i did not receive any phone call. I'm wondering what is wrong. What do i have to do to get a job in the IT domain? I find a lot of jobs that are pretty much tailored to the skills i have and i apply to them with no luck. \n\n&#x200B;\n\nAny ideas what to do or what is wrong?\n\n&#x200B;\n\nPlease Advise\n\nRegards",
    "title": "Switching back to IT, why i can not find an IT position?",
    "subreddit": "careerguidance",
    "timestamp": 1563044418,
    "score": 20,
    "keyword": "mixed race manager"
  },
  {
    "text": "My husband wants to leave the animation industry. Any ideas or suggestions on career options he could explore? \n\nHello everyone! Long time lurker, first time poster. My husband has been dealing with career struggles for a long time and I was hoping posting here could help generate some ideas on some possible career options and next steps. Any advice or insight would be greatly appreciated! \n\nFor some background info, my husband has been working in the television animation industry for the past 12 years. He started out as an animator, worked his way up to a supervisor position, and then became the director on a few productions (he’s managed teams of 65+ people). He studied animation in college for a few years but got offered a job before finishing, so as of now he only has a high school diploma as far as education goes. \n\nWhile he enjoys animation as a medium and likes the people he works with, the industry has mostly been very volatile and stressful. We’re in Canada, so most projects are service work for big studios in the US, meaning the studios are competing for projects with overseas studios offering bottom dollar. It’s essentially a race to the bottom.\n\nAll this to say, he’s thinking of leaving the industry in favour of something more stable and with better prospects as far as industry outlook and career advancement. We’re thinking of having kids in the next few years, and he doesn’t want to be an absentee dad. \n\nHe’s a great animator and artist, but he’s also very personable, likes managing people and projects, is a great problem solver, is someone who’s more than willing to work very hard and is very used to working in high pressure situations (I think he thrives in it honestly)! His biggest worry about leaving animation is that he’ll miss being creative; I think he needs to continue “making” things, if that make sense? He has a penchant for technology and gadgets, so I’m wondering if something in tech could suit him? We also discussed the idea of transitioning to video games (I work in that industry) but although my job has been blissfully good and stable so far, it’s still a notorious industry as far as stability and “crunch” goes. \n\nAnyways, taking all that into consideration, anyone have any ideas or suggestions on careers we could start researching?",
    "title": "My husband wants to leave the animation industry. Any ideas or suggestions on career options he could explore?",
    "subreddit": "careerguidance",
    "timestamp": 1557711981,
    "score": 16,
    "keyword": "mixed race manager"
  },
  {
    "text": "M24, Chicago - Unemployed, time to go back to school? After being out of work for about 5 months now, things are starting to get a little frustrating.\n\nA little back story: At the beginning of the year I was let go from a mid-sized company in the battery/automotive industry. I did enjoy working at the company albeit the frustrations of my job. The company was very involved with a majority of the auto manufacturers here in the US and some overseas. Mainly I worked in a tech support/customer service hybrid role, but I did involve myself with other departments (software & hardware engineering, product testing and quality control) I saw a great future there and actively pursued an open role in product management for one of our lines. After what seemed like a minor disagreement with my immediate supervisor one day, I was fired at the end of the next day.\n\nI do have a bit of a colorful background, including commercial food service design, MEP design & drafting, land surveying & drafting and computers & networking. I also run a very small business on a property that I rent where I do race car fabrication, welding and general work.\n\nI attended a local community college taking classes in automotives, computers, networking, welding and other general studies. I do have an associates, but it absolutely is not anything useful (non-transferable) I actually obtained it on accident and by surprise, just showed up in the mail one day.\n\nFinding work with what I believe is a fair compensation has been extremely challenging. I feel this is my sign that I should go back and continue my education, my issue here is I am not confident in what exactly I should be pursuing or even where.\n\nIf you have opinions about the fields surrounding computers, networking, automotives, mechanical/electrical engineering, etc. Please let me know, I would love to talk to some experienced people from different backgrounds.",
    "title": "M24, Chicago - Unemployed, time to go back to school?",
    "subreddit": "careerguidance",
    "timestamp": 1567595207,
    "score": 8,
    "keyword": "mixed race manager"
  },
  {
    "text": "Does a Masters in Regulatory Affairs or Biotechnology make more sense here? Hey guys,\n\nAsking advice for career progression and am hoping to start a masters program in January 2020. I have two options here and as stated they are either in Regulatory Affairs (RA) or in Biotechnology. For a little background I have about 6 years experience in Quality Control (QC) in primarily medical devices but also in biologics/pharma. Additionally, I have about 2 years experience in late stage development (R&D) in medical devices as well. I am currently now back in QC for pharma but am sort of in both a laboratory and management role. I do believe my current path is taking me more in the management direction and eventually fully out of the lab. Have mixed feelings on that, but the career path seems to be a good one.\n\nI have just a bachelors in Biochemistry and Molecular Biology and am thus trying to get a Masters to help with the transition to a management role. Just trying to see which master program makes more sense here. For anyone that doesn't really know the biotech/pharma industry a helpful analogy for me has always been that Regulatory/Compliance writes the rules of the game, QA acts as referees to ensure people are adhering to the rules, and QC acts as the actual players. Even though these groups are separated by job function, they are all heavily intertwined and an understanding of the concepts and ideas of each group is highly advantageous for either group. For example, if QC analyst understood why they have to act in a quality manner (compliance) or if QA understood how a specific process worked to a relative degree (QC/technical). \n\nSo in this case a Masters for me in pure Regulatory Affairs would give me that compliance knowledge I need which I can then hopefully apply to my team and make the work easier for compliance reasons. A Masters in Biotechnology, with maybe a concentration in Regulatory Affairs, will actually give me a refresher in some technical aspects but only touch base with the regulatory side on a lighter level than a pure masters in RA. Is a deeper technical knowledge really needed on that management level though? I see pros and cons of it so I may have a biased judgement. From a financial standpoint though the RA masters is cheaper. RA degree will cost about $35K and the biotech degree at about $50K. I am located in the DMV area and am targeting George Washington University for their RA program and Johns Hopkins for their Biotech program. GWU is an online masters and JHU is a hybrid program and neither will be an issue for completion. My company will also give me about $10k for completion of the degree so it is a little bit of a discount. \n\nAny thoughts or advice is highly appreciated. Thanks.",
    "title": "Does a Masters in Regulatory Affairs or Biotechnology make more sense here?",
    "subreddit": "careerguidance",
    "timestamp": 1575041321,
    "score": 6,
    "keyword": "mixed race manager"
  },
  {
    "text": "I'm 22, I haven't applied to more than 20 companies in my life, and I have 6 SWE/intern positions under my belt, and I wanted to share some tips I read a lot about people applying to 300 jobs and getting like 2 callbacks, but I had a very different experience. I wanted to share some of my tips that I've learned.\n\n1. I never applied a ton, I had connections. In college I joined a professional fraternity and 4 out of the 6 jobs I got were through people I knew who worked there. You get your resume handed right to the manager instead of through HR. I recommend making friends with people in your class, or finding somebody else with a strong network and free-loading off of theirs (and buy them lunch or something). Furthermore, people you know there can give you invaluable advice on what is going to be on the interview/what the hiring manager is like, etc.\n2. I made friends with the \"CS gods\" who were role models in my class. Then, I just ask them for their resume, for them to look at mine, for their advice, their compensation and negotiation tactics, etc. It's not like the med field where other people want the competition to fail, I rarely meet any SWE who DOESN'T want to help others get a job.\n3. Even when I cold apply, NEVER apply on the website, there's too many people that do that. Instead, I find a recruiter on Linkedin, I find their WORK EMAIL with this extension (https://connect.clearbit.com/), and I email them DIRECTLY with my resume, my interest, and a blurb showing that I've researched the company.\n4. (only applies to US citizens) This sounds shitty, but if you have an asian sounding name and you ARE a citizen, put that you're a citizen on there. Some recruiters will toss resumes JUST because they're asian and the company can't sponsor, even if you are a citizen. I literally put \"US Citizen\" next to my phone number, linkedin, and github.\n5. Interviewing is honestly all about confidence. You have to be a salesman. You can't just be good at coding and suck at talking, or vice versa. I don't really study that much the day before an interview (that's for the weeks before), I just go on walks, run, do jumping jacks, get my blood flowing so that I feel the most alive I can be before stepping in to the room.\n6. credit to u/Chewbahka72, but if you don't have experience just apply to smaller companies, instead of FB/Apple/Google/MSFT. There's a reason those companies pay so well, it's cause everybody has tons of experience, it's ok to start at smaller companies where you can get good tech experience without the cool free food benefits and the company jerking you off while you work.\n\nLet me know if you want me to take a look at your resume or anything!\n\n**EDIT: RESUME TIPS:**\n\nI got some PMs about resumes, I'll take a look at them but here are my tips for resumes:\n\n1. Don't use Arial, Calibri, Times New Roman. I know this might be an unpopular opinion, but if you want to get a job (esp. in Silicon Valley), make it unique. DO put some interest in design. I'm not saying make the whole thing in LaTeX or get Elon Musk to lick it before applying, but try some different fonts and dear God learn to right justify text on the same line. (https://fonts.google.com/) (https://fontawesome.com/?from=io - for LinkedIn, github, email, phone# icons). I use Open Sans and Raleway\n2. Use PROBLEM, SOLUTION, IMPACT. Indicate the PROBLEM you're trying to solve, then indicate how you SOLVED it (what language, framework, architecture, system, design), and then talk about IMPACT (financial - saved $42069k, operational - less people needed to do this task now, time - saved 20% time on this operation). Here's an example: \"Built a batch utility using Java, SQL, Hibernate to automate self-checking of the business's pricing processing system (SOLUTION), allowing the business to catch failed charges due to temporarily failed downstream services (PROBLEM mixed with a little bit of SOLUTION), which in one instance saved the company $2000 in revenue leak\"\n3. Split up your skills into LANGUAGES and FRAMEWORKS/TECHNOLOGIES. Languages: Java, SQL, Python. Frameworks/Technologies: React, Redux, git, AWS, Docker\n4. Bold text that is important, make text lighter or smaller for text that is not important. IMPORTANT: Company names, Job title, headers. NOT AS IMPORTANT: employment durations, project times, company locations\n5. Just find a good-looking CS resume online or from a friend and copy the formatting. MS Word is honestly enough for the vast majority of cases.\n\n**EDIT 2: Here is my anonymized resume:**\nhttps://i.imgur.com/VpPK5G3.png\nNot all my experience is on there, I put what I thought were the most valuable ones. I want to highlight that my resume doesn't have the biggest names on there in terms of company names, but I do think it is a strong one due to formatting, design, and wording.\n\n**EDIT 3:** I had 4 internships in school (1 per summer, 1 in part time) and 2 full-time positions already, sorry for the confusion",
    "title": "I'm 22, I haven't applied to more than 20 companies in my life, and I have 6 SWE/intern positions under my belt, and I wanted to share some tips",
    "subreddit": "cscareerquestions",
    "timestamp": 1556127076,
    "score": 1957,
    "keyword": "mixed race manager"
  },
  {
    "text": "The 3 most common salary negotiation questions, answered Thank you all for your fantastic questions in the [salary negotiation AMA](https://www.reddit.com/r/cscareerquestions/comments/cdym2g/were_candor_levelsfyi_here_to_answer_your_burning/)! Wanted to follow back with some of the most common questions with definitive answers to help you get the most out of your next negotiation.\n\n*— Levels.fyi + Candor*\n\n## I’m underpaid - how do I get a raise?\n\n* **Look for new roles**: By far the easiest way to get a salary increase is to switch into another job adjacently at a slightly higher level\n* **Get leverage**: If you’d rather stay where you are, you should still interview to get offers and gain leverage in negotiations. Negotiating empty handed is much more difficult.\n* **Relocate**: If possible, moving to higher paying locations like the Bay Area, Seattle, or New York — even despite the high COL, these places will definitely improve your take-home pay (especially if you correctly [account for COL differences](https://www.reddit.com/r/cscareerquestions/comments/6o0ypv/psa_cost_of_living_you_a_defense_of_big_cities/))\n\n## What should I say to recruiters?\n\n* **Never reveal your salary:** Giving up information at this stage has basically no advantage for you.\n* **If asked, be polite, but firm**: Tell the recruiter it's too early to know and you'd love to discuss once you're excited and confident there's a fit. The Candor guide has example [scripts](https://candor.co/salary/guide/#ask) you can use.\n* **Remember your rights**: In some states (like CA), the recruiter has to tell you the base salary band for the position and you are not required to answer questions about your past pay.\n   * Even if you don’t live in a state like that - you always have the right to not answer questions that put you at a negotiating disadvantage\n\n## What are the biggest mistakes while negotiating?\n\n* **Not getting leverage**: to get a big bump in comp from FAANG, you’ll need a counter-offers. If you don’t have any counter-offers, look to your existing employer. Even just saying “I mentioned this offer to my manager in our 1:1 and the team is scrambling to put together a counter-offer in the $XXX range ” can help you get leverage.\n* **Being non-committal and not specific.** Recruiters spend all day negotiating with people who aren’t serious — if you want them to go the extra mile, you need to be firm and committed. Only start the negotiation process if you mean it. Once you’ve made your mind, set a specific number as a TC goal that you’ll 100% commit to signing if the recruiter can hit it. Make it clear you're a team working together to overcome a common hurdle and work with them on designing a comp mix that hits the TC goal.\n* **Not being informed**: Know your market rate and what people are paying. Check out [Levels.fyi](https://www.levels.fyi/) for up to date tech salaries. Once you finalize your offer, please [submit your salary info](https://www.levels.fyi/addcomp.html) anonymously to help everyone else in the community.\n* **Not considering all locations**: Consider all locations and cost-of-living. The compensation hierarchy is roughly: SF > NY >= Seattle > Everywhere else.\n* **Not considering all benefits**: Make sure to know [benefits](https://candor.co/salary/benefits/) your employer provides. Non-monetary compensation such as free food, good healthcare, etc can add up to thousands of dollars in value.\n* **Not being realistic**: Particularly for new grads, offers are often set and not negotiable — you may still have a bit of wiggle room (e.g. getting an extra 10k signing bonus) but you should know you have less leverage.\n\n*A note on new grads/students*: If you’re a new grad, just remember experience trumps what you learn in the classroom. Go out and do internships and work on side projects!",
    "title": "The 3 most common salary negotiation questions, answered",
    "subreddit": "cscareerquestions",
    "timestamp": 1565631359,
    "score": 482,
    "keyword": "mixed race manager"
  },
  {
    "text": "My Journey: From failing databases in College (~3.0 GPA) -> 3 FT offers including Lyft Clickbait title aside, this is a story of dealing with mild depression, imposter syndrome, self-improvement and rediscovering a passion for things. [u/elliotbot/](https://www.reddit.com/user/elliotbot/) has already done an amazing post on the “how” of interview prep here ([https://www.reddit.com/r/cscareerquestions/comments/6278bi/my\\_journey\\_and\\_tips\\_29\\_gpa\\_at\\_a\\_noname\\_liberal/](https://www.reddit.com/r/cscareerquestions/comments/6278bi/my_journey_and_tips_29_gpa_at_a_noname_liberal/)), but I wanted to talk more about the “why” and how it’s transformed other parts of my life. Hope this inspires those who are feeling helpless or generally on autopilot in life. \n\n**TL;DR**\n\nGraduated from a liberal arts college 2.5 years ago with a 3.0 GPA and failed Databases class. Got an internship at a large enterprise software company and returned full-time for the $ and perks. No real passion and was living life on autopilot chasing short term highs. Never did Leetcode or had an onsite until the past year. Considered applying for PM roles, but couldn’t be bothered. Felt stifled by work and finally decided to put in the time + energy to work on myself.  Studied/worked 220+ hours in a year with a full-time job. Rediscovered an interest in CS, software engineering and hobbies. Landed 3 offers from 5 onsites including Lyft $300k+ offer. \n\n**Disclaimer & thoughts on prestige**\n\nCopy+pasting this disclaimer from [u/elliotbot/](https://www.reddit.com/user/elliotbot/) 's post because it sums up my thoughts entirely: \n\n“I am not claiming that Big N or unicorn or w/e is the be-all end-all of companies. I'm not interested in debating whether they're overrated. This is aimed specifically at people who might be interested in pursuing these sorts of roles, and especially at people who don't think they can \"make it,\" because of background, etc. I'm also not claiming this is a fully general solution. This is just my journey and what worked for me—hopefully it will prove a little bit useful for you.”\n\n**Background:**\n\nSwitched to majoring in CS mid way through college. The early classes were interesting and I did well, but grades soon went downhill as higher level classes got harder and my lack of study habits really showed. Was pulled in too many directions and couldn’t focus. Late night Netflix binging turned to early morning Netflix binging. Had a C in pretty much every semester and failed my Databases class. I couldn’t motivate myself to regularly attend morning classes and none of them were recorded. There was too much of a disconnect between what I was learning in class and what I thought would actually be useful post-college. Considered looking for PM roles after a largely boring internship as a software engineer, but ended up applying to only Facebook and Google software engineering roles. Solved maybe 2 problems on LeetCode and - surprise surprise - failed the Google interview. Ultimately took the return offer at the enterprise software company because it was the easiest route. \n\nIn hindsight, my lack of passion in anything long term and lack of career direction was the root of why I felt depressed. Every time I tried to branch out and explore a potential career path by joining some club, I got rejected. The rat race had already started one month into college and I didn’t know the rules of the game.\n\n**Full-time work with little passion**\n\nFull time work was soul sucking. I missed the days of being a student, being surrounded by friends and giving few fucks. Was on a brand new team but had to work with some very old frameworks with little mentorship and the codebase was so new that it was hard to be successful. Things settled in a routine fast and I could feel myself spiralling and relying on things like Netflix and video games to compensate for my unhappiness at work. Eventually, projects got more interesting and finally had a good mentor. But it wasn’t long before we our team had a new manager who had no faith in junior engineers. The pressing deadlines meant we were made to work solely on writing tests and other boring work and was told that this work wouldn’t even count towards promotion because it wasn’t deemed challenging enough. I spoke of being unhappy and underutilized every 1 on 1 meeting with my manager but things did not change. There weren't many internal job postings for my engineering level and those seemed like a gamble. I wanted to leave but had no interviewing skills. Call it a first world problem, but I would happily trade those six figures for a job where I didn’t feel so directionless and powerless to change things. \n\n**Reflection**\n\nUp until this point, I had almost always taken the easy route. With every unfulfilling internship, I would get a temporary boost of motivation but it would soon fade. I was content with knowing I had potential. It was a depressing way to live really. Never really being dedicated to anything and caring about nothing. I just wanted to cruise for now. Besides, I could “turn it on” whenever I wanted right? Wrong. I didn’t know how to learn in a structured way and had no self discipline. Procrastination is an [emotional regulation problem](https://www.nytimes.com/2019/03/25/smarter-living/why-you-procrastinate-it-has-nothing-to-do-with-self-control.html) and the [instant gratification monkey in my brain](https://waitbutwhy.com/2013/10/why-procrastinators-procrastinate.html) almost always won. I needed to right this ship. Well, first I needed to learn how to learn again. Cal Newports’ Deep Work was really insightful here. I’m the kind of person who can’t blindly follow advice, and Newport gives simple actionable advice backed by evidence (he is a professor after all) and makes a convincing case for how to live a fulfilling life. My biggest takeaway was to accomplish deep work, we need to establish routines to preserve our limited willpower. Simple \"hacks\" like marking a streak of productive days on a calendar make a hell of a difference over the course of weeks and months. \n\nLooking back at the past years, I realized that if you don’t actively choose a path or work on improving yourself, your circumstances will choose it for you. I was stuck with unfulfilling work because I didn’t have the interviewing skills to job hop nor did I have the hard skills to prove my worth. I never wanted to be in this position again. I started Cracking the Code Interview and worked through an online course on React. Feeling stifled at work fueled my self-studying. Offhand comment by an acquaintance about how I’m only an engineer at <”unprestigious” company>? Thank you very much, extra fuel for my tank of motivation on the Leetcode train. \n\nAfter a new manager was hired, things got a lot better. Got to work on more exciting projects and for once, my career development was actually a conversation. I generally tried to work on the hardest problems I could find. Even when I was made to work on only testing under the previous manager, I took the initiative and worked on creating a separate test pipeline for legacy and slow tests. Got promoted months after, although I was still unhappy because I felt it was long overdue. I was as productive as ever at work and felt fulfilled for the first time at work. But I never wanted my happiness to be jeopardized by a toxic manager again and had other reasons to leave so I continued leetcoding. \n\n**Imposter syndrome**\n\nI still felt major imposter syndrome. I was the guy that failed databases. So I retook the databases class online on the Stanford site. Still felt imposter syndrome because I had no idea what big data, nosql, systems design or distributed systems were. So I joined a book club to read through and discuss Designing Data Intensive Applications. Certain parts of the book were a bit of a slog, but others I actually found enjoyable and continued reading even though it became clear that it was tangential to interview prep. I felt overwhelmed by all this time spent on technical things so I devoted more time with friends, my existing hobby (a sport) and picked up a new one. \n\nThis growth mindset spilled over into other parts of my life. How could I make my existing hobby (a sport) more fulfilling? I started training because seeing improvement and being good at things was satisfying. How could I be a better friend and open up to people more? I started intentionally reaching out more and carving out quality time with friends and family. I felt as alive as ever. \n\n**First interviews**\n\nAll this work and I still bombed a front end interview and later an algorithms interview. I remember being way too nervous and unable to think clearly. Each one took 2 weeks for me to recover mentally, but motivated me to study harder. I eventually hit \\~85 problems solved on LeetCode which is considered a bit of a sweet spot for interview prep. \n\n**Startups?**\n\nAt this point I realized that a lot of my friends at startups felt much more fulfilled by their work and impact and I was drawn to the startup world. I questioned whether I would even enjoy the work culture of another large company. And what if the startup I joined was the next Google?! Extremely unlikely, but one can dream. Unfortunately the LeetCode arms race that I had been training for wasn’t really a transferable skill set to interviewing for startups. They wanted to see projects, put you through bug bashes, see if you can build stuff and most importantly, see if there’s a culture fit. I had already put in so much time on LeetCode prep, but I didn’t want to have any regrets so I set out to build 2 full stack projects I found interesting and deployed them. Besides, you can’t really say that you know a language or framework until you’ve built something with it and even then your skills are functional at best. Projects just look good on a resume anyways. I put my LeetCode on hold and spent some weekends and after work hours working on these projects. Starting the projects were tough, but I ended up enjoying building them a lot and having autonomy over everything. It’s funny that I started with the rather contrived goal of making myself a strong candidate (front-end, back-end, data, practical skills) and actually ended up rediscovering a genuine passion for CS and software engineering. \n\n**Interviewing again**\n\nI started interviewing again. For every interview I aced, I flunked another. It’s a noisy process - many employees wouldn’t be able to pass interviews again at their own company. I got my first offer and after that my confidence skyrocketed. It validated that I wasn’t an imposter anymore. Pre-interview jitters were still a thing, but I enjoyed the challenge of solving problems. I made an AngelList profile (for the uninitiated, it’s essentially LinkedIn for startups) and talked with seed, series A, B and C startups. I got better at selling my skills and experience. I spoke with founders, really accomplished engineers and got to learn about their business models and engineering teams. Some turned me down, but I had learnt to deal with rejection and the no’s bounced off my newfound sense of worth career-wise. Every startup had a skeleton in the closet too so rejections stung less. The startup interview process was tough because it was so hands-on and I struggled with ones that needed me to just write React code to work with an API or write back-end code with transactions, neither of which I had actually done at work. After every so-so interview, I would work on implementing the optimal solution afterwards. Almost every startup I interviewed with was impressed by my side projects, the book club and my full stack skills. I got an offer from a startup with a great engineering team. I saw that my knowledge and experience was stronger than some of my interviewers and turned down onsites for roles or companies that I was no longer as interested in. \n\n**Lyft**\n\nEventually I thought I might as well interview with Lyft even though I had little confidence of passing their onsite interview. It was a “tier 1” engineering company and I was just an evolving imposter. People there collected internships and could solve longest palindromic substring before I even knew what CS was. \n\nTo my surprise, I did very well in the interview and ended up getting an offer. In the experience round, I talked about my previous manager who forced junior engineers to take on menial work and how I made the best out of that situation and took on the most impactful and challenging work. I later found out that round I had scored very highly. I had come full circle. The adversity that made me so unhappy in the first place not only helped me get a job offer but, after negotiations, placed me in the top band of the level and allowed me to make 66% more than I did before. Needless to say, the product, tech stack, engineering culture, reputation, team’s mission, level of ownership, impact, learning and growth opportunities were also an upgrade on before. The biggest wins for me though were a newfound growth mindset, better understanding of myself, rediscovering passion and regaining control over my life. I wasn’t a passenger anymore - I was the driver. \n\nSpecial thanks to my friends, family and SO for their support. The mental side is half the battle. Also recognize that I have tremendous privilege. Privilege to devote time and energy to self-improvement and being in the golden era of software engineering. Never has there been such a clear cut path to riches and the means to attain them for relatively late bloomers and non-traditional learners like myself.",
    "title": "My Journey: From failing databases in College (~3.0 GPA) -> 3 FT offers including Lyft",
    "subreddit": "cscareerquestions",
    "timestamp": 1577161660,
    "score": 118,
    "keyword": "mixed race manager"
  },
  {
    "text": "How to handle getting yelled at as an intern Hey everyone, TLDR at the bottom since I wrote a lot of text.\n\nI’m still a little bit shaken up by this, since it just happened today and my mind has been racing so I figured it would be good to ask you all for advice.\n\nI’m an intern at a startup company, and I’ve been here for a few months now. Every week we have an intern status meeting where we talk about what we did that week to our managers. Ever since I started, one of the managers (not my direct supervisor) has seemingly hated me. I get along well with everyone else and i’m not sure why he doesn’t like me.\n\nDuring our first meeting, I used incorrect terminology which seemed to really upset him (he understand what I was saying - I just used the wrong word to describe what I was doing). He didn’t necessarily yell at me as he was connecting with us remotely, but I could tell he was very upset. After this first meeting, my manager pulled me aside and assured me it was a simple miscommunication and I was doing fine in my work.\n\nOnto the juicy stuff. Today we had another meeting where I brought up two topics. Firstly, I was concerned that one of our processes (that I am working with) might be making biased results and I wanted to make sure my work wouldn’t increase this bias. Given my understanding of the process, my logic was correct (I even ran it by another engineer who validated my thoughts and commended me for exploring this potential issue). However, my understanding was actually incorrect, and there wasn’t a problem. Rather than illustrating this to me nicely, the manager who dislikes began yelling at me on how I “refuse to understand this despite being explained countless times” (I was vaguely told of the process once, a week prior, which actually lead me to my concern). This continued on in front of everyone in the meeting for the first 15 minutes.\n\nAt this point I was visibly shaken and tears were slightly welling up - I’ve been yelled at plenty of times before, but never for being curious and trying to provide insight and help on work. I swallowed my pride and continued on with my second point. I suggested an algorithm I discovered which could optimize the work I’m doing. This algorithm is a variation of another algorithm I proposed a week prior but was shot down by the same engineer - the changes should resolve the concerns he had about it. I even found several papers claiming the algorithm worked, and explained how these changes would make it better. I was then yelled at for another 15 minutes about how I can’t justify proposing algorithms based on the results of papers I found online, and have to have facts to back up my claims (even though I explained how the algorithm was different and showed the results of the papers claiming it works).\n\nAt this point, I’m unsure of what I should really do. This engineer obviously hates me and has been degrading all the work I’ve ever done at the company (correction: he gave me one nice compliment in the 8 weeks I’ve been here). I have to go in for a 5hr shift tomorrow and I really don’t want to see him because I feel I’ll start tearing up again. Does anyone have any thoughts on what I should do?\n\nTL;DR:\nSenior engineer has hated me (intern) from the start and today yelled at me for 30 minutes in front of several employees for proposing two insights into the processes at the company.",
    "title": "How to handle getting yelled at as an intern",
    "subreddit": "cscareerquestions",
    "timestamp": 1551408204,
    "score": 64,
    "keyword": "mixed race manager"
  },
  {
    "text": "Offer Rescinded? So after interviewing with a technical manager for an internship, I was pretty confident that I was getting an offer. (I didn't just feel good about it, he asked wether I had any other offers, and if I did, I should choose to come intern here because etc.).\n\n  \nI got the job offer two days later around 5 PM, with a 24 hour deadline. I was waiting on another offer the next day, so I thought I'd just reply back the next morning.   \nNext morning, I wake up to an email saying that there has been a mix-up with the hiring managers, and that my candidacy is still under consideration, however they're not able to offer me the position at this point.   \nAfter having some words with the recruiter, I asked for my interviewer's email to clarify things with him, and she refused to give it to me, saying that there are other candidates above me in preference and that I would have to wait 10-14 more days for an answer.\n\nI don't have a lot of experience in that kind of thing, but what do you guys think is actually happening, cause I don't really get it? Any advice on what I should do? (Try to get ahold of my interviewer, sit back and wait, etc.?)  \n\n\nAny insight is appreciated, thanks!",
    "title": "Offer Rescinded?",
    "subreddit": "cscareerquestions",
    "timestamp": 1572371832,
    "score": 53,
    "keyword": "mixed race manager"
  },
  {
    "text": "Immediate offer from a huge company after only a phonecall, am I getting scammed? I was contacted by a recruiting agency to interview for a junior role that is a mix of dev with experience from my previous career. I took the phone interview with the hiring manager at the company I will be working with on Friday and it went really, really well. Monday morning I got a call back from my recruiter saying they'd like to extend me an offer, which is amazing. Unbelievable. Almost too good to be true.\n\nI asked my recruiter if he's sure I don't need to do an on-site, and he said nope - it's rare that this happens so quickly over just a phonecall, but that it's not unheard of. This is my first dev role and honestly I was expecting a few challenges and on-sites, and for this to take weeks not days. Am I getting scammed here? How do I know if this is legit? How much of my personal info should I be giving my recruiter? I'd call the principal company to double check that this is all in their records, but they don't have an HR phone number posted online, so I'm a bit at a loss of what to think.",
    "title": "Immediate offer from a huge company after only a phonecall, am I getting scammed?",
    "subreddit": "cscareerquestions",
    "timestamp": 1553634793,
    "score": 37,
    "keyword": "mixed race manager"
  },
  {
    "text": "How to avoid being pigeonholed    Hello unlike a lot of people here, I'm an experienced professional with close to 20 years experience.  So it may seem odd to even ask this question, but I would love mother's insights.\n\n   So a little about my background I started my career in support and eventually moved up the ladder via working in data centers.  Around the 3rd year of my career I became a Solaris System Admin and spent a few years on infrastructure and datacenter related work.  I eventually was able to break out of it and had a career as  a Java developer for several years.  \n\n   I eventually moved into Python full time and around 2013 to 2016 i worked a position as a senior Java and Python developer in an extremely mixed environment.  I soon discovered my passion for data engineering.  I loved dealing with large scale systems and databases.  And soon found myself becoming a bit of a superstar on my team.\n\n   Unfortunately everything comes to an end, and I left the job in 2016.  I had been a contractor with the company for 3 years and they had no plans or budget to bring me own permanently so I bailed when I was offered a full time role, which was also remote as well.\n\n   The problem is the job was DevOps.  Now I have nothing against Devops but I soon found that Devops became \"shit devs dont want to do\".  I know that's not what its suppose to mean and I know it's not even suppose to be a job title.  Spare me I'm aware of all the talking points.  The reality is that most companies dont have a clue and their Devops staff just become break fix guys and fire fighters with some occasional automation and development sprinkled in when they have time.\n\n   I worked that job nearly 3 years but I left last year.  I found an escape with Golang.  I actually love coding I  the language and have been able to find really good employment with the language.  It also has allowed me to still stay remote which I've grown to like.\n\n  So what am I complaining about?  Well I can't live down my DevOps background.  You see I recently decided to join up with a startup that does blockchain.  And I love blockchain.  They brought me in as a developer but told me that they prefer I focus on more Ops stuff because \"it's taking too much of our developers time\".  Keep in mind I know just as much Go as all of their developers if not more.  And I actually have deep knowledge of blockchains.  But they just couldn't pass up an opportunity to use their Ops savvy resource to do shit ops work.  And trust me its nothing fun\n\n  I find myself becoming pigeonholed into DevOps.  I feel anytime I try to move out of it I keep getting pulled in by recruiters or by managers pulling bait and switch on me.  I really don't enjoy DevOps type work. Mainly because Devops only works when you're allowed to take ownership of process.  But oftentimes I'm forced to do DevOps with a lot of constraints.  Which is just not a fun experience.\n\n  Has anyone ever found themselves being pigeonholed?  How have you escaped it?",
    "title": "How to avoid being pigeonholed",
    "subreddit": "cscareerquestions",
    "timestamp": 1550088572,
    "score": 36,
    "keyword": "mixed race manager"
  },
  {
    "text": "Are these things about my company normal? Is it even worth tolerating or should I leave? I work at a mid-stage startup as a SWE.\n\nThe engineers regularly work nights and weekends and there are basically no boundaries. People will ping you with aggressive messages at any hour. One engineer told the team he's going out on a friday night but will take his laptop with him incase something goes wrong (it was not a critical release day or anything). Another young engineer spends a lot of time watching the server logs and pinged me on a weekend about some unknown, but uncritical messages. One \"senior\" engineer actually barely commits any code and acts a pseudo scrum master assigning people random tickets.\n\n&#x200B;\n\nIs any of this normal? Should I tolerate it? Should I be working harder to match the other young engineer?\n\nFrom my perspective, this is toxic and counter productive. People love looking productive but this is just a rat race to the bottom. Also, this is really good for the management because they can get as much value out of the team without giving appropriate raises and promotions. We actually have more engineers overseas than here in the US and entire projects are being shipped of there. I was offered to \"lead\" the project but that basically entails working my normal 10-12 hour days, and then syncing with the overseas team for three hours at night. \n\nWorking hard is not the problem here, I love working hard and long. I just don't feel I'm being productive for my career and life overall.\n\n&#x200B;\n\nThoughts?",
    "title": "Are these things about my company normal? Is it even worth tolerating or should I leave?",
    "subreddit": "cscareerquestions",
    "timestamp": 1569183726,
    "score": 22,
    "keyword": "mixed race manager"
  },
  {
    "text": "I emailed code from company to personal - what should I do? I recently left my last employer on good terms, a big and lesser known financial institution, and before I left I emailed a small java project to my personal email.  It was a lapse in judgement and I've heard from a friend that it was flagged and legal is looking into the situation and I'd love some advice on how best to handle it.\n\n**What/why did I take?**\n\nI worked mostly on infrastructure apps - general utilities for engineers, not really business-facing apps.  In a particular library that I'd authored, we had some really clever ways to test asynchronous code in Spring/Java.  I put a great deal of thought and heart into this code and I wanted to blog about it, but didn't have time before I left.  Long story short - in the tunnel-vision mindset one sometimes gets when immersed in code, I zipped up the project and emailed it to myself, along with a few other innocuous files I wanted to keep such as my IDE keymap and color theme.  While I knew this was a violation of company policy, I was so focused on the engineering tasks at hand and just exhibited poor judgement (a combination of \"they wont' notice\" and \"its innocuous code, no one will care\").  The code I took didn't have any sensitive data such as financial/customer data, database links etc.., nor does it have business value (ie. a competitor wouldn't be able to monetize it like they would say a trading algo).  It's basically utility code that has some clever engineering tricks.\n\n**Then what happened**\n\nI heard through the grapevine that they'd gotten wind that someone on our team emailed code outside the company and legal was investigating.  I tried to call my managers but they had blocked me - I'm sure they were advised to break all contact.   A buddy advised I seek a legal consul for the best course of action and basically got mixed information (can anyone recommend a lawyer who might specialize in this?) with these 3 options:\n\n1. Reach out to my former employer and get out in front of it.\n2. Have a lawyer reach out to the company instead - basically option 1 with legal advisement from the get go.\n3. Do nothing - wait for them to contact me and then respond.\n\n*Regarding 1*: this was my first instinct; however, as my managers have broken contact with me and the company is a huge beuracracy, I don't know who/how to even reach out to.\n\n*Regarding 2:* If I do this, it might just make me look like I have something to hide (ie. am hiding behind a lawyer).\n\n*Regarding 3:* this lawyer was under the impression that if what I took is indeed innocuous and can't be shown to have a direct link to their bottom line, then there's really no damages/losses that can be directly correlated and courts wouldn't want to deal with the trifle of things that can't be expressed in monetary damage.\n\nI'd really love some advice here and also expectation of the consequences.  I have seen that sometimes engineers are jailed for such things, but in each case they seem to involve serious damages.  For example, the guy that stole 140k social security numbers from amazon or the engineer who wrote the VW car code that tricked emissions tests.  Is it conceivable to think I might be in for serious fines or jail time over what I did?\n\nOn a side note, there's a [SO discussion](https://softwareengineering.stackexchange.com/questions/154155/should-you-keep-a-copy-of-all-the-code-you-write) about the ethics of taking code from an employer.  To any devs who do this, or are considering it, please don't do this.  The sinking overwhelming feeling you'll get when you hear a legal team is investigating you is orders of magnitude worse than any potential value that code; which, let's face it, we probably won't use again.\n\n&#x200B;\n\n**UPDATE : Matter is resolved**\n\nI ended up waiting for them to contact me and about a week later received an affidavit letter requiring my immediate signature that I will not distribute the software and will destroy and copies.  I signed it and mailed it back - hoping that's the end of it.  Thanks for the help everyone.",
    "title": "I emailed code from company to personal - what should I do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1572655770,
    "score": 21,
    "keyword": "mixed race manager"
  },
  {
    "text": "I enjoy programming in my free time, but I don't want to be a software engineer. What other careers would be suitable for me? So I won't get too into it, but I don't want to be a professional developer. Just little things like having to study your ass off for hard interviews, Scrum, legacy code, environment issues, bad teammates, bad managers, uninteresting work, stress, etc.\n\nI like having programming as just a hobby. Most people are going  to tell me at this point \"work is work, we wouldn't be paid if it was for fun, blah blah\". \n\nAnd they are right. But I'm unhappy as a pure dev. So to get to my question already; are there any careers in CS that might be able to code a little here and there, but isn't the main focus? \n\nPerhaps a mix of being alone and interacting with people? Not high-stress, good work-life balance?",
    "title": "I enjoy programming in my free time, but I don't want to be a software engineer. What other careers would be suitable for me?",
    "subreddit": "cscareerquestions",
    "timestamp": 1549469620,
    "score": 20,
    "keyword": "mixed race manager"
  },
  {
    "text": "Life After Public Accounting   \n\nI have been a long time lurker on this sub, using everyone’s advice since I was interviewing for B4 internships so I wanted to pay it forward. I have found my time on this sub has had mixed reviews of B4/public accounting so I wanted to share my experience now that I have exited into industry. \n\nOne thing that I constantly struggled with was, does this job suck or do I think it is supposed to suck because that is what I have been told since being a college student. To be honest, a little bit of both. It is easy to get caught up in the complaining and whining which can overall bring your mood down. It is best to allow yourself to vent and then move on. Some parts of the job were great –  working with smart and motivated people, flexible work schedule, the ability to see and understand how a company is ran, while other parts – long hours, non-value add to a business (imo), pressure to make the client’s problems our problems were absolutely awful. This will be up to you to judge what is worth it. For some people, 1 year is plenty and they will move on, others may make it to senior, some stay until the day that they retire. For me, I always took it 6 months at a time. I knew that my opinion of the job could be determined by the teams I was on, what was going on at the client, or personal/family issues that the demands of the job and my drive to stay there were going to be fluid. \n\nMy biggest piece of advice is that everyone’s path is going to be different. Once you can accept this, your life will be much better. Often times we compare ourselves to our peers, duh the firms do for compensation, but when you take a step back realize that how can you compare your time on a large public job to those people that juggle 8 private jobs year-round? It is best to worry about yourself and look out for yourself, because no one is going to do that for you. You don’t have to be a jerk, crushing those in your path, but I find that it is easy to get caught up in office drama if you are constantly worrying about everyone else.\n\nWith that being said, I exited after 5 years in B4 public accounting for a job at a top 25 public company that I would venture to say \\~90% of the world is familiar with. I had my manager schedule in-hand, when the opportunity arose. I was always open to hear opportunities but always knew I was never going to just leave for anything. If you work your butt off in public accounting, don’t just leave for anything because you are frustrated. BE PICKY! You have earned it. While public accounting isn’t the only way to have a successful accounting career, it sure can open up some doors. I have met various successful people in industry who have had varied public accounting experiences. When I told my partners and managers of my departure, some thought I would be stupid to leave without 1 year of manager experience. They made me feel as though I couldn’t be successful without the firm. I knew I was taking a risk. Maybe the new job wasn’t going to be sunshine and rainbows as promised. Maybe I wouldn’t like what I was doing. Maybe I would be bored and not challenged and struggle to get through a 40 hour work week. But I knew that a job like this wouldn’t come around again. I would be leaving for a 45% raise, better benefits (health, 401K, etc), more PTO and the ability to actually use it, flexibility in owning my schedule, not to mention no more working until 3AM for months on end. In my leaving I realized the people that truly cared about me were happy as they realized what type of an opportunity this was for me, while others showed their true colors – showing me that basically I was nothing more than a warm body that was willing to work ungodly hours. As it all turns out, I am in a manager roll here, with everything turning out as promised. It is okay to trust your gut and remember than not everyone is going to have the same path.\n\nPublic accounting isn’t always fun – probably not even 50% of the time. Take time for yourself and take care of yourself. Don’t be pressured by what you are supposed to do or expected to do. Leave after 1 year, 2 years, 5 years, 10 years or stay forever. You don’t need to apologize to anyone. This is your career and your life. Good luck all!",
    "title": "Life After Public Accounting",
    "subreddit": "Accounting",
    "timestamp": 1562183048,
    "score": 170,
    "keyword": "mixed race manager"
  },
  {
    "text": "What if we were honest about our time? Yesterday, /u/bigfourslave posted asking: \"[Why do people eat their hours?](https://www.reddit.com/r/Accounting/comments/aq2ozj/why_do_people_eat_their_hours_especially_if_your/)\"  Frankly, it really threw me into a crisis of conscience.\n\nI wish I could say differently, since I'm just as big a hypocrite about it as anyone else, but **being dishonest about your time in a billable hour profession is simply wrong**.\n\nStudents and those not familiar with how the profession works (in very simple terms): For larger engagements, we submit bid proposals to our clients. These bids have an estimate of our fees based on our idea of what we think it it will take to do the work. Just like an estimate for a car repair, this bid is what we think it will cost but we won't actually know until we do the work.\n\nWhen build the estimate correctly, and bill about what the client was expecting, everyone is happy. This is increasingly rare in our profession.\n\nAs a profession, we're always underbidding our jobs. We're stuck in a race to the bottom. Don't get me wrong, the metrics used to track our performance are extreme and partners burn a lot of time playing games to get their numbers up across the board. Partners that aren't client rainmakers are stuck playing a ton of optimization games, using their managers and staff as if they were pieces on a 3D chess board.\n\nWhat are those games mostly? Asking our staff to not properly charge their time. As was said in that thread, HR tells our staff not to do it and to go to them if we ask them to. Yet, through various other peer pressure tactics even the most clueless intern knows like the cop fresh out of the academy that you NEVER \"rat\" to HR. You tow the line. You follow our Public Accounting code of silence and learn how to eat your hours.\n\nAs a result, we are increasingly disconnected from how complex these jobs are becoming, how little we are putting into training and development, how much stress we are creating beyond the long hours and how we're **training an entire generation to be servile and compliant.**\n\nOur audit quality is horrendous. From our PCAOB reports:\n\n[KPMG](https://pcaobus.org/Inspections/Reports/Documents/104-2019-001-KPMG-LLP-2016.pdf): \"In  22  of  the  51  Audits  reviewed ... certain  of  the  deficiencies  identified  were  of  such  significance  that  it  appeared to the inspection team that the Firm, at the time it issued its audit report, had not obtained sufficient appropriate audit evidence to support its opinion\"\n\n[EY](https://pcaobus.org/Inspections/Reports/Documents/104-2018-018-Ernst-Young.pdf): 15 of 55\n\n[Deloitte](https://pcaobus.org/Inspections/Reports/Documents/104-2019-001-Deloitte-Touche-LLP.pdf): 11 of 55\n\n[PwC](https://pcaobus.org/Inspections/Reports/Documents/104-2018-001-PricewaterhouseCoopers.pdf): 11 of 56\n\n***There should not be ONE SINGLE AUDIT that has a deficiency so extreme it calls our opinion into question.***\n\nWe clearly have a problem. Underbidding jobs and putting false pressure on our staff and encouraging them to improperly report their time in order is the single biggest driver as far as I can see it.\n\n# I've since instructed my teams to follow firm policy to the letter about properly charging time and to report any divergence from firm policy to me and HR.\n\nWill this absolutely wreck the budget on my jobs? Yes.\n\nWill it screw up every statistic that's used to track my performance? Yes.\n\nCould it possibly impact the careers of my managers and their prospects for making partner? Absolutely.\n\nWill it end the cycle of abuse in our profession? Probably not.\n\nWill it end my career? Definitely.",
    "title": "What if we were honest about our time?",
    "subreddit": "Accounting",
    "timestamp": 1550075964,
    "score": 149,
    "keyword": "mixed race manager"
  },
  {
    "text": "I've Worked in Audit, TAS, and Accounting Advisory - AMA Before I Vacation for the Holidays \\*EDIT - Title should say \"AMA Before I go on Vacation\" before you guys jump on me for that :(\n\nHi Everyone,\n\nI'm posting from a throwaway because I'm going to give some background/information on me that is potentially revealing and I don't want some of my coworkers who frequent these forums to find out my main handle.\n\nVery briefly, I started out in audit with a Big 4, went to one of RSM/GT to do TAS, and recently joined AAS at a golf equipment manufacturer. Since I have a variety of experiences already (I literally just joined AAS, so I'm less helpful here, and have obviously not been in industry), I thought I'd give share some advice or answer peoples' questions as someone with a little more experience than the 2-3 year people that are usually on here about life in public/what to do. There's seems to be a fair amount of negativity on these boards, some of which I understand is harmless banter/memes, but I wanted to share some perspective because I think it may help people, especially since busy season is about to start. I'm heading on vacation tomorrow, but I'll try to respond as much as I can since I'll be remote (and hopefully not bothered for a couple of days by work).\n\nSome initial thoughts:\n\n* Advisory, including FDD, is definitely better than audit, but it is still accounting at the end of the day. If you don't like accounting, TAS or AAS won't make you feel better. Actually, don't assign much happiness to work in general. Even the cool sounding, non-accounting projects (i.e. \"strategy\" and \"restructuring\") have their own drudgery and can be much more stressful day-to-day - I know because I directly worked in or have heavily assisted those workstreams. Sure, the work is a little cooler/more value-add, but that can be offset by the other stresses in my experience.\n* Big 4 kool-aid is annoying for sure, but there is some truth to it. You know going in that you're going to be paid below market value - just accept it. It sucks to not get paid what you're actually worth, but the training and exposure you get do pay off later on IMO (or at least I hope). YMMV, but I personally saw a drop-off in the exits I was getting at the MM firm I was at compared to what I was getting asked for as an auditor at the Big 4. The job responsibilities were better (i.e. true FP&A, some corp dev, etc.) because I was in diligence, but the companies weren't as nearly as good (low MM firms versus F500).\n* Regarding comp - as someone who wanted to be a private equity, lord of finance making $400K at 30 in college to someone who bailed on M&A to do boring, operational accounting work that gets paid a fraction of that at 29, what people say about money not mattering after a while is 100% true. Realize that people in really high-paying jobs are usually getting that money not because they're so damn smart (legit geniuses like Steve Jobs/Elon Musk excepted), but because of the SACRIFICES they have to make. I'm not going to throw a \"coast\"/walkaway number out, because there are so many factors that go into it, but once you have attained certain a certain level of luxury and security, the relationships you have in and outside of work, your health, or just having more time/independence take much higher precedence on average than a higher salary. That number where you prefer to coast than grind/take on more responsibility is probably lower than you think too (it certainly was for me). If you truly enjoy only the finer things and will stop at nothing to get them, get into FDD, transition to IB or a top MBA, and get to the buyside ASAP because you won't get it here for a long time.\n* Regarding the pessimism on the boards in general - I get it. I was a second year not long ago questioning why the hell I was sitting at a client site at 1 AM, getting paid 5 figures with no OT, to perform useless compliance work that nobody will care about. The good thing about accounting is that you get paid decently well relative to the hours you put in and I personally find the work at upper-levels to be a good mix between analyzing data and telling stories about companies, which is what I enjoy. It's going to suck for the first 7-8 years while you're learning the ropes. However, once you get to experienced manager/senior manager-level, you can really cash-in your chips with industry and get paid an upper class salary to pretty much coast the rest of your career. If you want to climb the ladder/hierarchy, you can aspire to the CFO spot/partner and clear much more. Hell, if you want to be entrepreneurial and eat what you kill/desire max freedom, you can start your own firm (I personally am leaning more towards this as time goes on).\n\nAnyway, enough of me being on the soapbox. Let me know what questions you have/how I can be helpful while I'm here.",
    "title": "I've Worked in Audit, TAS, and Accounting Advisory - AMA Before I Vacation for the Holidays",
    "subreddit": "Accounting",
    "timestamp": 1576686678,
    "score": 51,
    "keyword": "mixed race manager"
  },
  {
    "text": "What watches do you rock? I haven't really worn any watches since high school (Class of '08) until about four years ago when I bought my first smartwatch: A Huawei Watch. Rocked it for about two and a half years before my battery was giving me issues. Ended up selling it to a friend who wanted to tinker with it and see if he could fix it up.\n\nNow I'm back on the market (99% sure I'm going with the Fossil Carlye HR Gen 5 smartwatch come next paycheck or two), and started thinking for curiosity sake. Almost all of the managers and higher had a smartwatches at the CPA firm I interned at during busy season, with a mix of staff either having a smartwatch, a regular watch, and four people going with no watches.\n\nSo what do you rock? A smartwatch, a regular watch, or are you living the no watch life?",
    "title": "What watches do you rock?",
    "subreddit": "Accounting",
    "timestamp": 1565648176,
    "score": 10,
    "keyword": "mixed race manager"
  },
  {
    "text": "Anxiety before graduation and the new possible accountant I’m just super worried about what I’m going to do once I get out of school finally. \n\nI started my accounting degree in 2016 after a 10-year career in journalism. I started working as a billing agent for a freight forwarder in 2014 and fell in love with the ins and outs of AP/AR through it. I taught myself those two things and then decided to go back to school doing two classes at a time while working full-time so no internship. In the ensuing 3.5 years, I’ve outgrown my position and am finishing up my degree so it’s time to get out and get started.\n\nSchool-wise, I nailed the intro stuff. I ended community college with a 4.0 GPA in Intro Accounting, Intro Managerial, Management and Statistics. It’s been more mixed but positive at my college now: C+ in macro economics, Intermediate I and II, A’s in Auditing, business law, micro economics and finance, B+ in Advanced Accounting and Cost Accounting. No repeats, thankfully.😅\n\nI LOVED auditing and cost. They made the most sense and seemed to come naturally to me. I don’t have plans right at the moment to take the CPA exam, either. I have marketing and income tax as the last two classes starting in January and then I’m done.\n\nI’m just scared that I don’t know enough to legit go out and start interviewing for accounting jobs. I feel like I’m missing a lot of stuff and I will seem like a fraud once I get into an interview and they start asking questions. I know the basics but I get tongue-tied about revenue recognition and cash vs. accrual, which are also basics. \n\nI have an interview with a law firm for a billing assistant in about two weeks so I’m nervous about that, too, in addition to income tax possibly being scary and wedding planning, too!\n\nPlease help with some advice if you can on where I can start and how not to lose it between now and May 2, 2020!",
    "title": "Anxiety before graduation and the new possible accountant",
    "subreddit": "Accounting",
    "timestamp": 1577565748,
    "score": 9,
    "keyword": "mixed race manager"
  },
  {
    "text": "Burning the midnight oil Time management help! \n\nI often find myself working on things that require higher cognitive load at nighttime - sometimes through the night. The reason is probably a toxic mix of procrastination, and an inability to focus during the day due to discussions on approaches, client calls etc.\n\nI'm relatively new to consulting (<1 year) at a non-managerial role, one that involves BD support and execution for existing projects. I'm seriously concerned about the effect all the night time work is having on work life balance and the quality of output. \n\nWhile I understand consulting is constant hard work, how do you guys manage your time on and off work? I've noticed some my colleagues manage to be productive (and motivated) so maybe it's something I'm doing (or not doing?)",
    "title": "Burning the midnight oil",
    "subreddit": "consulting",
    "timestamp": 1575840038,
    "score": 102,
    "keyword": "mixed race manager"
  },
  {
    "text": "/r/consulting, Best of 2018 Winners! Hi all,\n\nThank you to over 3000+ of you who participated by voting in this year's best of content.\n\n\n**Our winners are as follows:**\n\n\n* Post of the Year: \"Analyst Kyle\" (by a huge margin I might add) by /u/Silent_Packmule\nhttps://www.reddit.com/r/consulting/comments/83zvnf/working_with_a_bizarre_project_manager_is_this/\n\n* Most Helpful: /u/QiuYiDio. I think this is his 3rd or 4th year in a row now?\n\n* Top poster: /u/minhthemaster who won last year as well as the year before, if I am not mistaken\n\n\nFor next year we'll be looking to refresh the categories and mix things up a bit. \n\n\nCongrats to all of the winners!",
    "title": "/r/consulting, Best of 2018 Winners!",
    "subreddit": "consulting",
    "timestamp": 1547477099,
    "score": 80,
    "keyword": "mixed race manager"
  },
  {
    "text": "Am I being screwed over? Apologies for the length, I just needed to get this off my chest. Work at a big 4, and last year made a move from IT audit into risk consulting. I am only being utilised on projects where they need someone to test IT controls. \n\nThings were finally looking up when I got booked onto a different project. Got pulled off at the last minute.  Been on the bench for the last 3 weeks (only person in the department at my grade who was on the bench). During this time, I approached senior managers/directors for work but was told there is not much in the pipeline (which is untrue when it comes to BD work). Others in the team have been approached to help out with the BD work despite being fully utilised. \n\nMy feedback has generally been very positive except for the last one which was mixed and raised points on professionalism. It said that I need to be more visible at client site and to avoid leaving early or to work from home (I wfh 3/4 times during the entirety of the project and if I left early, it was due to medical appts which my manager always knew about well in advance)  That I need to stop using earphones while working. That I shouldn't use Skype to communicate with other team members while in the room (these weren't even project related but just general chit chat). The latter two were not even communicated to me during the project and if it had been, I would have immediately adjusted my work style. \n\nFinal nail in the coffin: loaned out to do FS audit work which I know nothing about but am expected to be a SME because they think there's no difference between FS and IT audit. \n\nI have been thinking of my options: there's a potential opportunity to move to the strategy arm which might take time to materialise or to go back to IT Risk (I still have a good network in my old team who would help me move back).\n\nTL;DR: moved teams from IT audit to Risk Consulting, only being utilized on projects which involve IT controls and not being given opportunities elsewhere. What do I do?",
    "title": "Am I being screwed over?",
    "subreddit": "consulting",
    "timestamp": 1556991752,
    "score": 47,
    "keyword": "mixed race manager"
  },
  {
    "text": "Honestly, am I missing the point of the Consulting scene by actually trying to build/engineer things, vs. manage? I've always been inspired by coding, software, technology and have tried to have my passion drive where I want to focus my efforts.  And over the past few years I've worked with some great people, and done some good work, but of course there are always some failed/dud projects.  But suddenly feel like I'm missing the point, that with the rat race the Consulting scene is ultimately meant to facilitate who can climb the ladder/pyramid quickest, how many people can you fit under your power shadow, how many clients you can herd and contracts crafted/sold.  The work is a means to this greater end?!?!\n\nDoes anyone else feel this way, or have to defend their existence in Consulting, and not getting consumed into this Management Csonulting thought trap?",
    "title": "Honestly, am I missing the point of the Consulting scene by actually trying to build/engineer things, vs. manage?",
    "subreddit": "consulting",
    "timestamp": 1566465637,
    "score": 19,
    "keyword": "mixed race manager"
  },
  {
    "text": "How do you handle being a team lead for a friend outside of work? For context, my team won new work and will be expanding our team in the next few weeks. My senior manager was recommended one person by a senior manager on another project to interview and so far, he meets what my senior manager wants as he staffs that open position.\n\nAs a potential team lead for the workstream that this new member would be a part of, my senior manager pulled me aside and asked if I had any thoughts before he interviewed this person next week. As I was reading through his resume, I realized this was one of my friends who had joined our consulting firm at the same time. We were new hires in the same start class and became friends together outside of work as we were staffed on different projects.\n\nMy concern is that since we already have a friendship outside of work, adding a work relationship (especially one where I am overseeing him) could complicate that. I don't want to risk jeopardizing my friendship or my work relationship. In addition, since we started at the firm at the same time, I'm not sure how he would react to me being his team lead.\n\nI brought up my prior friendship with my senior manager and asked if this could cause issues. He stated that it should be seen as a strength as I would have a relationship already built up to begin with.\n\nGiven that one of the first pieces of advice my counselor gave me when I first joined was to be cautious about mixing work and personal relationships, I wanted to do my due diligence and know how to best approach this situation.\n\nHas anyone here dealt with potentially overseeing someone who you were previously friends with? What are some best practices to minimize potential conflicts or issues?",
    "title": "How do you handle being a team lead for a friend outside of work?",
    "subreddit": "consulting",
    "timestamp": 1555861699,
    "score": 6,
    "keyword": "mixed race manager"
  },
  {
    "text": "Stay in current FP&A track or pivot, even if temporarily? Throwaway account - this is my first time posting on Reddit. Thanks in advance for any insight or assistance this community can provide! Apologies for the lengthy post! Tl;dr is at the bottom.\n\n**About Me**: I am currently in a finance leadership role at a small, privately owned software company in the NY area. I have been in the workforce for about 12 years in various capacities (accounting, consulting, and the majority of my career spent in FP&A) working at a mix of private, public, large, and small companies. I am almost a year into this current position (joined in an FP&A capacity but previous boss left so I was promoted to this role), and I am responsible for overseeing a larger part of organization, including but not limited to finance, FP&A, accounting, HR, and G&A. As a member of the leadership team now, I also am involved in broader organizational and strategic discussions with colleagues and our investors/owners. This past year has been somewhat of a trial by fire and incredibly taxing, but I have gained valuable experience along the way that I feel will be instrumental as my career progresses.\n\n**Job Situation**: I mentioned above that our company is privately owned. New investors/owners took over earlier this year, and we as management made a lot of tough decisions around the business in order to preserve cash flow, remain in compliance with covenants, and materially improve the bottom line. Along the way, however, we have been unable to grow the top line and have in fact lost a few key clients. It has been particularly stressful for me as the “finance person” as I am trying to manage a bottom line with no help from the top line, and many/most of those client issues are out of my control. Because of our current trajectory, the investors/owners have become increasingly demanding, wanting us to find more ways to cut costs (read: RIF) and scrutinizing everything (certain personalities there are also widely regarded around the water cooler as complete jerks for whom no one would want to work). Objectively, I understand where they are coming from as investors, but the past few months have been draining for me as I try to make the numbers “work”, sacrificing my personal life, outside interests, and oftentimes mental and emotional state as I have fallen more and more into depression. Ultimately, while there are aspects of this particular role at this particular company that I enjoy, I too am not confident in where the organization is trending and do not see any personal upside from a professional or economics perspective, thus I am actively searching for an exit.\n\n**Next Steps**: I have been working with recruiters, tapping my networks and contacts, and applying to similar level jobs on a regular basis for the past 2 months in an effort to get out ASAP. I have not yet made much headway (not sure if it is the market or my own qualifications or other factors), although I am currently in the second round recruiting stage of a tech start up that may be promising – fingers crossed. I believe that my work experience thus far has put me on a “CFO track” and in an ideal situation, I would like to continue in that trajectory. As previously mentioned, I enjoyed various aspects of the role I have now, but the company atmosphere and investors make it incredibly unappealing to work there indefinitely.\n\nNow, throughout my years, I have remained in close contact with a boutique software implementation firm (in the Enterprise Performance Management space) – everyone I have met there is very nice and the company is doing well. They more or less offered me a position with them (no details yet on comp, etc) as an implementation consultant where I could leverage my FP&A experience and expertise, however, I did not immediately accept knowing that this would be a pivot in my career. There is appeal to being able to just join this company and leave my current company sooner rather than later, and the work, although different, would have its own merits (travel if desired, client facing, working on different projects, meeting different people, etc). However, I am concerned that if ever I wanted to get back on the “CFO track”, this type of transition would be difficult to explain away and I would also set myself back for however many years I decided to stay in this implementation role. That being said, I could end up very much enjoying this role and thriving in it and never wanting to leave. At this point, I simply cannot tell.\n\nThe main question is then – do I hang in there and continue trying to find a job in my current career track, even if it means that it may take longer (if I even find a job at all) and thus I would spend more time being absolutely miserable at my current company that may be going downhill anyway? Or, do I jump ship ASAP and take the sure thing at a company that is doing well, but assume the risk that it could sacrifice my current career and/or make it difficult to get back into this career later on in life?\n\n**Tl;dr**: currently in a finance leadership role but very burned out because company is not doing well and demanding investors are awful to deal with; trying to determine if I should hang in there and keep applying for jobs in the same field or pivot to a guaranteed software implementation role",
    "title": "Stay in current FP&A track or pivot, even if temporarily?",
    "subreddit": "consulting",
    "timestamp": 1572406646,
    "score": 3,
    "keyword": "mixed race manager"
  },
  {
    "text": "Concerned Project Budget May Be Holding Back My Promotion The title says it all. I'm a Sr Analyst trying to get promoted to Consultant this cycle and I am concerned that I might be getting shot down for promotion by my project manager due to budgetary constraints on the project, not because of my actual work performance. What is the best way to approach this, given that promotion discussions are taking place in the next few weeks?\n\nReasons why I think this is the case:\n\n1. I already know the budget is tight. All mileage and per-diem expenses for local employees have been cut (the cutting of expenses took place months after the project had started) except for my fuel (I drive over 150 miles a day in my personal vehicle). I knew that the budget was tight, but when I initially asked at the onset of the project about whether it would impact my promotion I was told that my PM had not factored it into the budget, but that somehow they'd make it work, that they  wouldn't get in the way of anyone's career.\n2. I have been told by my PM that I am DEFINITELY eligible for promotion mid-cycle (this time next year), and potentially for an outstanding achievement bonus at that time. Mid-cycle promotion next year happens to fall in the same month that my project ends.\n3. I have received glowing feedback from non-project leaders I work with on extra activities\n4. I have received very positive feedback from the other managers on my project, whom I do not report to;  we all report directly to my PM because it's an exceptionally small team.\n5. Despite being an analyst, I am owning multiple deliverable items - I'm actually responsible for more deliverable items than the managers on my project are who are working on comparable work.\n6. I have been told by my PM that the client likes me a lot; this is obvious as they joke around with me, we are on great terms. This is especially important because we recently lost a team member due to poor client perception.\n\nI am not pretending to be perfect; I have received some constructive feedback, taken it to heart, and heard verbal recognition from my PM that they have seen a marked improvement in those couple of areas. I have also been told by my PM that I'm \"fucking killing it\" and that I need to \"keep doing what you're doing\".\n\nHow can I simultaneously be fucking killing it while owning multiple deliverables and managing the deliverable workstreams (tasks way above my paygrade), and simultaneously be not  ready for on-time promotion because I have more to learn - learning which apparently cannot be completed between now and promotion time at the end of the year, but which I will DEFINITELY have completed by this time next year? I am simply confused about this mixed-messaging and would like some guidance on how to proceed.",
    "title": "Concerned Project Budget May Be Holding Back My Promotion",
    "subreddit": "consulting",
    "timestamp": 1564688274,
    "score": 2,
    "keyword": "mixed race manager"
  },
  {
    "text": "How do you find outbound leads as an independent consultant? Hi all,\n\nI was hoping I could tap into your combined creativity and experience - as an independent consultant, how do you recommend finding outbound sales leads?\n\nAs a bit of background: I've been lucky enough to have a broad range of experiences working in software - from entry level software engineer through various leadership roles to full operations management. I've spent a lot of time developing ways to improve the companies I've worked with, and I'd like to translate that into independent consulting. I'm currently doing a mix of contracting as a software engineer, launching an online business, and providing occasional training workshops to some smaller firms.\n\nI strongly believe I've got a lot to offer and can help move the needle for software companies in a number of key areas I specialize in. I'm in the process of productizing some specific consultancy packages in the hope that it will make the value-prop more apparent and saleable.\n\nBut - I'm inexperienced in outbound sales, and would love to know how any tips and tricks you've come across. E.g. specific individual job roles to search for on LinkedIn, winning cold email wording, finding the right people to call, etc etc. \n\nHow do you do it?",
    "title": "How do you find outbound leads as an independent consultant?",
    "subreddit": "consulting",
    "timestamp": 1569593980,
    "score": 2,
    "keyword": "mixed race manager"
  },
  {
    "text": "Not just Grown-ish: Black-ish has a color problem too Been thinking about this a lot and wanted to speak on it. As someone who is lighskin and frequently mistaken for mixed race I try to be very aware of my privilege within the black community and slight advantage in white spaces. I've never been able to fully appreciate Blackish or partake in the hype surrounding it because the majority of the cast seems to be made up of \"safe\" black people. Palatable for white audiences, that is. Other than the little girl, the rest of the family range from light to medium skinned. Half are biracial. Outside of the main family few of the guest characters are dark skinned, and it's always bothered me and kept me from getting into the show. If it's not representative of all of us then in my opinion it's not representative at all. \n\nContrast this with black entertainment in the 70's and even 80's and 90's when seeing dark skin on black shows, even dark skinned women, wasn't as sparse and uncommon. Even though I feel we have more overall representation today, it is less reflective of our features than before from my vantage point. There was less black representation back then but when there was, the characters were predominantly non-biracial black folk. As far as colorism in black hollywood, we've gone backwards. Name an attractive, popular dark skinned (or non biracial) actress besides Lupita and (sometimes) Gabrielle Union. Now compare that to Yara Shahidi, Amandla Steinberg, Tessa Thompson, Laura Harrier, Zendaya. These are the faces young black women in my age group have. It's not as alienating for me because (to a degree) I look like them. But most black women don't. There are no dark skinned equivalents. It really saddens me and as someone who wants to write and direct movies/tv someday, I hope to amend it with my work. More of us gotta start writing content and casting ourselves. \n\nI do see it getting a little better in the music industry. We have Lizzo, a rise in female rappers with regular black backgrounds and black features, although even that has been overshadowed by Cardi B. The new black female artists who've enjoyed the most success, other than Lizzo, are biracial or lightskin. Jorja Smith, Ella Mai, H.E.R (Black passing but still biracial), in addition to Cardi who has had the most. Beyonce and Rihanna still reign supreme. \n\nStill! There's hope. A few years ago I really couldn't see people like Lizzo (or Noname) getting exposure or a chance to become popular. I think the internet has allowed for a lot of people to get platforms they wouldn't otherwise have, which has indeed resulted in oversaturation and mediocrity, but also for some great talents to emerge and get traction. \n\nWhat do you ladies think about this issue?",
    "title": "Not just Grown-ish: Black-ish has a color problem too",
    "subreddit": "blackladies",
    "timestamp": 1556978071,
    "score": 87,
    "keyword": "mixed race manager"
  },
  {
    "text": "Racism and sexualization I experienced at Child Care Job Racism and sexualization I experienced at Child Care Job\n\nI’m a mixed black woman living in a very white Midwestern state. Recently, I was a child care worker at a super white and Trump supporting day care (didn’t know it when first applying for job) and I have never experienced such blatant racism! A lot of the white People were shocked to see I was working there and they reacted by ignoring me, giving me a dirty look to my face, talking about me in front of my face, and watching my every move to make sure I didn’t steal, lie or abuse the kids. They acted like I was the first black person they ever interacted with. They were envious I was in graduate school and ate healthy  also. Everytime a kid would cry, a worker would rush to my room and ask the kid what was happening. I felt like I had to always smile and not show any negative emotion like anger in order to make them comfortable and not fearful. I swear that job added to my ptsd.  One mother of a child saw me, ignored me, then asked another worker who was going to be looking after her baby (definitely implying she didn’t want me to). Also the child care workers told me to make sure I wore conservative clothes and to not flirt. While some of the other workers came in yoga pants and flirty and the managers didn’t say anything. They assumed I would be hypersexual and try to steal husbands or something! Then the child care director tried to figure out my insecurities and make me feel inferior/insecure by bragging about blonde women with blue eyes then watching me to see my reaction. It’s like she didn’t like seeing how I was happy, successful and black at the same time.\n\nThen after working for some time, a lot of the white fathers of the children started sexualizing and had crushes on me which made the white women more mad. What made me quit, though, was when a couple assumed I had abused their kid because she all of the sudden started having accidents (peeing). When his daughter was probably having accidents because of their marital concerns—- the husband cheated on his wife with the other day care workers and was trying his hardest to get with me. The father was also a police officer. And then the white co-workers became envious the police officer liked me because they all wanted him so they got even meaner and tried to sabotage me. I am betting they were telling the police officer lies about me being dangerous or crazy or something which is another reason the girl’s parents assumed the worst—that I was abusing her. \n\nWhat confused me was he was obviously racist (he didn’t acknowledge the other black woman worker) but acted like he was in love with me. but I think he was only nice to me because he thought I was attractive. Or then i wondered if it was a colorism thing but I doubt it because I was like the same skin color as her in the summer. I wonder if they were stereotyping me based on jezebel stereotype or sexualized mullato (although I doubt they knew I was mixed)?\n\nI also had no one to turn because the day care director was the most racist of all and would direct her workers to watch me. She would let her white workers come in late but was hard on me if I did. \n\nI feel hurt and angry Thinking about my experience at this job especially so because it confirmed that white people reject me, see me as other, and as a threat no matter what I do and who I am.\n\nWorst job. Should have made a complaint  for discrimination and reported them. Anyone relate or have similar experiences while working at child care?\n\nEdit: As for the parents assuming I abused their kid.. there was definitely racism and stereotypes going on there. But I also have to say, during that time, I was very emotionally unstable. I had just moved out of my abusive parents’ Home out on my own, financially independent for the first time. I was victim blamed from my family for my dad’s sexual abuse so I didn’t have any support system. Also, I already had trauma reactions from past racial discrimination. So being around all these white People made my ptsd alive and I was super hypervigilant, had major mood swings, was dissociating, and would sometimes be standoffish and other times friendly. It’s important I mention this because this played a factor in my treatment. But I still wouldn’t have been this mistreated if I was white. And I know this because there was a white girl that started right after me who was often angry, yelled at the kids, and was emotional.. but they didn’t care. And they weren’t watching her constantly or checking her kids in the room frequently.\nAlso, I forgot to mention, when I first applied the director almost was warning me about the location. Because she said, “this location is very Lilly white. Maybe you would prefer our other more diverse location since you are going to graduate school for social work.” Basically this woman segregated her child care centers. One was all white and the other was diverse. I was the first black woman to work at her “white” center.",
    "title": "Racism and sexualization I experienced at Child Care Job",
    "subreddit": "blackladies",
    "timestamp": 1548154953,
    "score": 61,
    "keyword": "mixed race manager"
  },
  {
    "text": "Lost my job because I was targeted for being a white male I'm a 33 year old white male, and I am a mental health counsellor. I worked on a team with 4 other females, all counsellors/social workers/etc. On that team was a 23 year old who made her opinions about men very clear. Back in August she presented my manager with a list of things that I had said that offended her. I had no idea I was saying anything that offended her. There was about 6 things on this list, and many of them were just me expressing a different opinion than her. It was certainly never my intention to offend anyone with these opinions, and they weren't racist or sexist or derogatory. I've shown this list to many people, including many women, some of whom said they disagreed with some of my opinions, but none said they were worth complaining about. What's worse is this individual took the things I said, and twisted them, either misquoting them or taking them completely out of context, to make me look a certain way. I don't think she did this intentionally, I do believe this is what she heard me say as my words went through her filter. \n\nShe took it to the manager, who is a female and has also demonstrated having a negative bias towards men. For this reason, I was not offered the chance to tell my side of the story; I was ignored when pointing out that I didn't say these things the way she is saying I did. I was offended, and pointed out to my manager that other people on the team, including the woman who presented this list and my manager herself, have made comments that I could have complained about should I have wanted to. My manager has also commented on my appearance more than once, which is sexual harassment, and I reminded her of this (although I didn't put it that way). I stated that I felt this was incredibly hypocritical, but it didn't matter; I was sent to anti-racism anti-oppression training, one-on-one with a trainer chosen by my manager. I showed him the list, told him my side, and he said, in his professional opinion of doing this for 20+ years, that he felt I'm being singled out and I'm being sent to this training to be \"fixed\" so I'll go back to work, shut my mouth and be quiet. He believed this was a team issue being turned into a me issue, and I agreed. This was in September. In November we met with this trainer as a team. It was uncomfortable. I expressed my fear of sharing an opinion that someone disagrees with lest it be held against me at a later time. But we did the training, and things went back to normal. My working relationship with this young woman was never the same, but it was civil. \n\nFlash forward 3 months, when I am sitting in my office waiting for my first client of the day, and my manager and an hr rep entered my office and told me I am being let go because I \"don't fit in\" and that my \"views are better suited elsewhere.\" It was out of nowhere. I had been so careful with everything I had said since August. I received no warning, no investigation, no opportunity to fight for my job. It was decided.\n\nI have dedicated my life to helping others. I do not discriminate against anyone, quite the opposite in fact. I help individuals of all genders, sexual orientations, races, religions, ethnicities, ages and so on. I help many people who have been discriminated against, oppressed, or stigmatized. But I was on a team with a 23 year old female who only ever saw me as a white male, and she targeted me, and she was successful. She has had an impact on me financially, on my career, and a severe impact on my mental health. I hate her, and I hate my biased manager who handled the situation different than she would have if the roles were reversed. This is a scary time.\n\nEdit: I should have mentioned I consulted an employment lawyer. He is a friend of a friend, so I trust him and his advice. He said that although I likely have a case of discrimination, he strongly suggested I don't take legal action on the basis of discrimination, due to the fact that I am straight, white and male. He said that win or lose the case, it would reflect bad on me, particularly in the field that I work in.\n\nThe list:\n-age (she was the youngest on the team by 10 years. Myself, and the rest of the team, would occasionally playfully tease her about her age. I never once put her down because of it. At a team meeting she asked all of us to stop it, and I know I did. And yet, it still made the list) -he said that questions about power and privilege on interviews are useless (in fact, I said \"I didn't see the point\" but I was referring to one specific case, but that's a whole other story. But she generalized it, and that was not my intention or meaning nor my words) - mat leave (the women on the team were having a conversation about how the US was cutting parental leave time and were talking about how sexist it is. I said I don't think it's fair to call it sexist because, although it disproportionately affects women, it affects all genders who would take parental leave) -said he wanted another male on the team; \"there are too many of you and only one of me\" (at a team meeting we were talking about hiring a new person for the team, I suggested we consider hiring another male as some clients request male counsellors specifically and because I felt it might add some more diversity to the team. I was often shut down very quickly if the women on the team did not agree with my opinion. I certainly did not say the words she put in quotation marks) -you look nice (said to her ONE TIME in the year I worked with her before she gave this list, because she got dressed up for a presentation and I was just trying to be nice. I didn't think anything of it. I certainly wasn't hitting on her or flirting with her, and again, it was a one time occurence)\n-he is aggressive when his point is not agreed with and does not take into account other people's feelings (in fact, I would often be shown aggression from the females on my team. When I suggested hiring another male, the 23 year old snapped at me \"you can't say that!!\" and she clearly did not take into account my feelings. But of course that doesn't go both ways)",
    "title": "Lost my job because I was targeted for being a white male",
    "subreddit": "MensRights",
    "timestamp": 1552375623,
    "score": 3035,
    "keyword": "mixed race manager"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 510,
    "keyword": "mixed race manager"
  },
  {
    "text": "I was sexually harassed and then laughed at by coworkers. So a few notes for context. I'm white,  gay and overweight.\n\nI just started working for a gas station overnight. Last night I was working the cash register when this heavy black lady came up (race plays a small role so that's for description) and I rang her up. Supposedly before I started another guy used to work and she used to flirt with him. My manager was there and explained he got fired for something. The customer then said, \"oh that's too bad. Well at least I have a new fat white boy to mess with\". \n\nMore context, I'm not very comfortable with being called fat. And it's not for the obvious reason. It's because the last time someone called me fat he pulled a gun on me in a robbery attempt.  \n\nSo my face was supposedly frozen. My manager laughed to try to defuse the situation but the customer then said, \"oh, I mean nice plump boy\" then fucking reached over the register and grabbed my chest (I'm big mind you so I do have man boobs) and started squeezing them. \n\nI was very uncomfortable and upset. My manager just laughed at the whole situation as did some of the other customers.  I can't lose this job but I do feel kinda upset to be honest. And there's nothing I can do because I'm a guy. \n\nI hope this fits here. I don't really know where else to talk about it and I feel like it's pretty relevant because if I was a woman then the customer would of most likely gotten into deep shit.",
    "title": "I was sexually harassed and then laughed at by coworkers.",
    "subreddit": "MensRights",
    "timestamp": 1570317108,
    "score": 82,
    "keyword": "mixed race manager"
  },
  {
    "text": "International Women are Good Men Are Bad Day Hi ladies and  gents, if you live in the northern hemisphere you're probably still 'enjoying' the celebrations for International Women's Day. Now if this day was a celebration of women, motherhood, women's achievements, et cetera, I'd be enjoying it too, and have a glass of sparkling grape juice and a piece of cake.\n\n&#x200B;\n\nBut as a bigger, older school bully might say to you when you explain to her you need your lunch money, 'that's not how it works!'.\n\n&#x200B;\n\nIt's easy for men to celebrate women's achievements, and vice-versa, and at a superficial level that's not a zero sum game. However, when the tire hits the road, and we get into the real stuff like who gets the kids, who gets the university place, who gets the good job, and who gets a long prison sentence because their ex wants to say, 'yes, we did it like bunny rabbits for 5 years, but the last time was just horrible, I didn't want to and he should have known!', IT IS A ZERO SUM GAME To me, and my 'unconsciously biased' and 'white privileged' and 'arsehole and the cause of all human problems' eyes, feminism is not about equality, it is about increasingly advantaging group A (women) at the detriment of group B (men). And not a bit, crazy much. Don't get me wrong, most of this - except the kids bit - won't affect elite men and women, the top 5% can build their own businesses and make themselves the boss, feminism can't and won't attempt to influence this sort of thing. Their exes, who are likely also elites, will have too much to lose by making false claims and grueling through the justice process out for years, so they're unlikely to make them.\n\n&#x200B;\n\nSo selfish men in the top 5% of the income bracket, please stop reading now, enjoy your life, and forget about the enormous lifelong harms and disruptions injustly happening to other men.\n\n&#x200B;\n\nNow back to the point, IT IS A ZERO SUM GAME. It doesn't have to be - anyone who's had a good relationship with the opposite sex knows that. But as time goes on, I'm beginning to think the feminists who came after the Bolshevik revolution (so not the Suffragettes), were probably girls with pretty bad form sheets (several men, none who lasted) who always intended to create a zero sum game where women 'win' and men lose. Now of course, feminism clearly accepts the inevitable side effect of creating a zero sum game involving sex and/or marriage with the rules totally tilted against one player - the marriages don't last so well anymore. This is also not an accident, destabilizing marriage where monogamous, lifelong male female marriage becomes an exception rather than a norm was a primary goal of post Bolshevik feminism very early. You can see it in the Philippines - which is such an odd country as divorce is still illegal there - who is out there arguing for legalization of divorce? You got it, the women's rights movement. Philippines' divorce law is odd, as no other real country prohibits divorce, and I'm not actually defending the law - it seems outrageous to apply a Catholic standard of divorce for example to atheists, Muslims, or Episcopalians) - my point is, who's agitating for divorce? Feminists. Philippines is a valuable example because what we see is the progressive nature of feminism.\n\n&#x200B;\n\nFirst it's divorce, fine, that's gender neutral. Then it's no-fault divorce, well, fine, still gender neutral, although it causes massive spike in the divorce rate. But now the zero-sum part comes in - courts award custody of children to mothers, hey not so gender neutral, more zero-sum. Then, we've suddenly got a significant percentage of the population being divorced women with kids - hey the state needs to look after them. So there's welfare for single parents, again zero-sum with women 'winning' as they are the single parents. Now divorce is a cost-free option, because the state will carry the tab. Then UNMARRIED single mothers say, 'hey, what about me!', so now anyone who has a baby gets looked after by the state.\n\n&#x200B;\n\nI was once on a motorbike in Thailand. And a sad-looking, young-looking, not-pretty-looking Dutch woman came after me like a Cheetah wanting to mate with a Dachshund. All over me, wanting to come to my room. I must have friended her on Facebook or something, but did not go with her suggestion she come and stay in my room. A few years later I look on Facebook, sure enough a little white baby boy is born in Holland, sans-father. I don't blame this woman for having a baby, she was lonely and wanted one, and the Dutch state took care of the tab.\n\n&#x200B;\n\nSo that's one zero-sum game. But let's get now to couples, people who marry or are de-factos. If you live in any western country here's how it goes: You'd better forgive her for her occasional adulterous 'indiscretions' or 'you'll get what's coming to you'. If you've got kids, she'll get them - if you fight hard enough you'll get to see them, sometimes. She'll decide where they go to school, what they eat, wear, what out of school activities they do, what religion or no religion they follow, and how many boyfriends she brings back to meet them. If you have daughters, they will have the fortune of seeing and having modelled that women can have a 'healthy sexuality' as the wife leaves her husband and brings back a series of male lovers over a period of years.\n\n&#x200B;\n\nOh and of course, the money. Elites are a little bit different. But for the majority of the population, she'll get most of the assets - even if it was paid for by the husband's earnings. She'll also get a regular cut of your income - after all husbands should pay for the care of children they're denied to see, that's perfectly fair, isn't it?\n\n&#x200B;\n\nThen there's jobs. Got a profession like nursing or teaching predominantly female - that's fine. I went to a bank the other today and out of the 10 staff in the bank, 1 was male, the rest including manager and all seniors female. The lady Asian teller, who I'm normally very friendly with, got quite angry when I suggested it didn't look like the best bank branch for male job applicants. All deans of all faculties female (like RMIT University in Melbourne was), fine, most paediatric doctors female, fine. Too many senior board executives male - OH NO WE MUST FIX IT. Jobs predominantly male must have female quotas, jobs predominantly female should be left alone - ZERO SUM GAME people. Boy Scouts must allow girls, Girl Guides need not allow boys. I saw in the newspaper in Melbourne today that Geelong Grammar can discriminate and give scholarships only to girls. Does anyone reading this believe that any mixed private school in Melbourne would be given dispension to give scholarships only to boys?\n\n&#x200B;\n\nSo it's zero-sum game across the board: children, relationships, marriage, school, jobs...but let's get to the really good one, 'crimes against women and children'. So all this stuff I've mentioned above would still not keep down an entrepreneurial man who runs his own business. If he is his own boss, well, it's easy for him to hide income so his ex gets less - which would tend to press her to the negotiating table re: the kids - and he won't pass himself over for promotion because he is a man in his own business, so his own talent is his only limit. Now such a man might get uppity, and think he was equal with women, and go around doing a lot offensive male things like being assertive, picky about a women's sexual background and divorce history, and just being self-confident and living without fear.\n\n&#x200B;\n\nCan this really be tolerated? The feminists came up with the solution to that one too, let's change the law whenever a guy is charged with a crime against a woman - ie. the ex girlfriend who cries rape. Let's reveal his identity in the newspaper, but make hers protected upon penalty of contempt of court. Let's make him testify in open court, but let's let her testify remotely via video. Oh and if there's a hung jury, because some sexist jury member goes, 'oh wait, she was banging him the Tuesday before, and sexting, but how come she's saying rape on the Thursday?', guess what - she doesn't have to testify again, the court can just reply her recorded testimony. Oh yeah, and we can't ask her about her sexual history, or say that the fact, you know, she had sex with her boyfriend for years might mean it wasn't rape. I'm not making this stuff up - it differs from jurisdiction to jurisdiction, but there are a complete raft of these laws trying to engineer convictions. It often works, but not always. I spoke to a female former teacher of mine from University years ago, and she told me about a rape trial she was a jury member on. Finally the jury didn't convict because the 'victim' about an hour after her rape went and had sex with her boyfriend - the sexist jury didn't believe that a woman who was raped by her friend (not a cheating girlfriend, how dare you!) would go and then have sex with her boyfriend an hour later.\n\n&#x200B;\n\nThank God I've never had to deal with false charges brought against me - and let's face it, the system would grind to a halt if it started getting out of hand - but just the fear of false claim again is used to oppress and strike fear into the hearts of men. I'm not that worried by it, but mostly because I don't want to have flings with tarty looking girls with bad histories, and I think every man in his right mind would be aware of this and have some sort of risk management plan for it - this, itself, is fear.\n\n&#x200B;\n\nLook, I've gone on and on, and I could go on and on even further. But I won't. I would celebrate Women's Day if it wasn't for the fact that it's really, 'help women, harm men' day. It doesn't have to be like this, but it likely will continue to be so for the rest of our lives. In summation I have one point:\n\n&#x200B;\n\nFeminists realise their objective is a ZERO SUM GAME where there is a definite winner (women) and loser (men). Men and women who are not feminists need to realise the same thing, and the sooner the better.",
    "title": "International Women are Good Men Are Bad Day",
    "subreddit": "MensRights",
    "timestamp": 1552081689,
    "score": 68,
    "keyword": "mixed race manager"
  },
  {
    "text": "#MeToo: men close ranks | Well-intentioned steps to advance women in the workplace have sparked resentment. Now for the backlash. From today's Australian newspaper, a sober look at the damage that feminism in general, and #MeToo in particular, are doing to gender equality in the workplace.\n\n>In this week of International Women’s Day ­celebrations, I have troubling news from the front line of gender relations. The conflict between men and women at work is increasing in some sectors. It’s a trend that’s worrying many who hoped our workplaces were becoming more equal for men and women and now fear they may be going backwards. Ironically, many attribute these problems to steps that have been taken to help women stay in work and get promoted. They point to well-intentioned programs designed to promote “diversity and inclusion” through flexible work, coaching and mentoring that have unintentionally sparked resentment among men. Some see it as killing with kindness.  \n>  \n>Last year, I wrote about the “big little lies” we tell about working and parenting (“Working lies”, Sept 1-2). It struck a chord, particularly the reports of some women with big jobs who said in public that Having It All was fantastic, while privately they were falling on the floor with exhaustion. Many working women got in touch with me in response to the article to say that while they found themselves publicly spouting the merits of “lean in” — Sheryl Sandberg’s famous pronouncement that women should be more ambitious — the ­reality is that their lives are highly stressful and sometimes chaotic. When, in December, Michelle Obama broke ranks to declare candidly, “That whole, ‘So you can have it all’ — nope, not at the same time. That’s a lie. And it’s not always enough to lean in, because that shit doesn’t work all the time,” women everywhere breathed a sigh of relief.  \n>  \n>Since then, I’ve been talking to some of these apparently successful women about why they ­pretend it’s working when, privately, they say they’re pushed to breaking point. Some women, depressingly, say it’s getting worse: they fear a future where there are actually fewer women at senior levels in some industries (law, finance, management consultancy, media, advertising).  \n>  \n>At the start of conversations about why top women don’t tell the truth, many give me the ­reasons I expect. Namely, that they want to encourage other women in the hope that having more women at the top will improve things for everyone. They also lie about their lives because they want to be loyal to their employers or, at least, to keep their jobs. Finally, they are reluctant to admit their lives are not working out because ­confessing that you’re finding things hard at work and at home sounds like an admission of failure, and high-flyers are used to being seen as a success.  \n>  \n>One senior woman who reflected on why she used to lie about her working reality, before she burnt out and moved out of corporate life, said: “The first thing we do is we lie to ourselves. We tell ourselves that working at this pace is normal. Then we lie to our families and colleagues — and then we lie to other women. We almost collude with each other to make this OK. Central to it, I think, is shame. And competence. I was used to being able to solve problems and move on in life, then I had kids and I didn’t know how to do it. Children aren’t a problem to be solved, they require a different state of being — one that takes effort but one that is hard to own up to. No woman wants to be thought of as a bad mother.”  \n>  \n>All of this makes sense. But as the conversations go on, more troubling thoughts begin to emerge. A woman who works in finance spoke on the promise of anonymity. “I am really worried that we are already at risk of going backwards on female representation at the senior levels of business, especially in finance. What I’m seeing is that the men are afraid and we’re getting the backlash. They feel the world is changing and their status is under threat. I am watching them gather around each other and close ranks. They already think women get the better deal. I worry it could actually be harder for the next group of women coming through than it was for my generation. I see so many of my friends, peers and colleagues becoming ‘mumpreneurs’ or quitting altogether because of this. It’s extremely depressing. But speaking out more publicly would, I think, create more resentment and might actually make it worse.”  \n>  \n>Looking out through the glass conference room doors to check nobody is watching us talking, she goes on: “I see growing resentment among men of women’s progress. Men I like personally as colleagues openly say that a lot of women get jobs because of tokenism. They don’t think they deserve the jobs. If the women then dare to ask for flexibility, they doubly resent it. We have great policies on paper around flexibility. But I’ve heard the men call working from home ‘TTP’ days, which means Taking The Piss days. Some label the women’s group at work the Burning Your Bra group and joke that it’s held around a cauldron.”  \n>  \n>It’s a view that columnist and former host of Top Gear Jeremy Clarkson tapped into recently when commenting on the BBC’s search for a host for one of its prime-time programs. “Anyone who has got a scrotum, forget it. They just aren’t giving jobs to men at the moment. There is an argument that it’s been all men for a long time, so what’s wrong with it being all women for some time? I get that. That’s fine. We just, as men, have to accept we’ve had it. Let’s just go down the bar.”  \n>  \n>And, increasingly, powerful groups of men are going to the pub or to network on the golf course without the women, excluding them once again from the inner circles where decisions are made.  \n>  \n>Similarly, a group of men at the advertising agency JWT have challenged a decision to let them go, after a new female creative director promised to shake things up. They say they have been discriminated against on the basis of gender, age and race. Others say it’s well overdue that the “pale, stale and male” agency had an overhaul and others were given a chance to shine. Human resources expert Claudia Iton nods knowingly at all this. “I’m reminded of the saying that, for a privileged group, any steps towards equality, however limited, can feel like discrimination,” she says.  \n>  \n>A corporate headhunter I spoke to observes a cycle that he worries is also making the problems worse. “If senior women are recruited and are seen to have been chosen for their gender rather than their skills, they start off in a difficult place,” he says. “However subtle it is, they will feel unsupported and may then struggle to hit their targets. This will confirm the view that women can’t cut it at those levels. In some cases, they are also being paid perhaps over the odds to help ‘reduce’ the reported pay-gap numbers. What I see are many executive boards talking the talk but not walking the walk on diversity. They are box-ticking — and the way they are doing it may make things worse.”  \n>  \n>All this has to be seen in the context of dramatic changes in working patterns over the past 20 years. In that time, we have moved from an expectation that most families will have one, usually male, breadwinner and the other parent in a supporting role, either based at home or working in a more flexible way. House prices and social expectations have changed and dual-income households are now seen as normal. This means that parents have to figure out how to care for their families in spite of longer hours in the office, longer commutes and potentially endless demands online. It’s not easy to do, even if you’re in charge. A chief executive of a business that prides itself on being family-friendly told me recently that, much as she tries to protect her staff from constant ­electronic intrusion, the reality is that she is still online after midnight every night of the week.  \n>  \n>Yet there is great potential for economic rewards from creating working patterns that appeal to those who also have caring roles. The Organisation for Economic Co-operation and Development attributes 10-20 per cent of GDP growth in Nordic countries to the raft of measures they have introduced over the past 50 years to make work and family life more compatible. More companies are experimenting with shorter working days and weeks. German tech firm Digital Enabler has introduced a five-hour day from 8am to 1pm in a bid to attract the best talent and improve productivity by having a really focused working day.  \n>  \n>As yet, this isn’t the way many big businesses are going. In fact, rather the opposite. Someone who made it to the top in corporate finance, but has recently stepped out to run her own business, reflects on the additional impact of the “always on” phenomenon. She describes years of working days that started as she woke and ended when she charged her phone by the bed. So much so that her two kids chose to go to boarding school, partly because both parents worked every evening. “We did a legal deal a few years ago and the lawyers respond to emails at 1am. When do they sleep?”  \n>  \n>Even when she was quite senior, she says she struggled with a boss who held team meetings at 7am. “I did talk to HR, but absolutely nothing was done and I had to move teams.” Another banker reports that her company had to introduce a ­policy to stop conference calls on a Saturday. Which is good, she says, except that Sunday has instead become pretty much like any other work day.  \n>  \n>The problem is that many of the men who run businesses still see the world through the prism of the way it has worked for them. One mum of three says: “Most have no concept of what it means to be a co-working family. I work with men who have wives who literally pack their suitcases for them when they go on work trips. These men have no idea of the planning that their female ­colleagues, male colleagues with working partners and single parents have to do. Not to mention how much we all end up spending on emergency childcare. Because of this, it’s not unusual to find out at the very last minute that an extra day has been added to a work trip. When that happens, it can make me feel physically sick. I say nothing because they would just see it as moaning, but a change like that will have me up half the night, sorting out the arrangements for the family.” This is a woman whose husband also works but, like many I interview, she still shoulders the vast majority of the family organising.  \n>  \n>One lawyer continues on the impact of having a predominance of men at the top of the business: “You get a certain culture,” she says. “There is still a lot of shouting and aggression and a very high-pressured environment. There is an expectation that everything will be done immediately and that people are available pretty much all the time. They have no tolerance for someone who leaves at 4pm to pick up their kids, saying that they can’t edit a document right this moment.”  \n>  \n>Those who do manage to carve out a more ­balanced schedule describe the frustrations that come with it. If they managed, for example, to negotiate a three- or four-day week, they were expected to work more hours than they were paid for. They were also put on the “mummy track”.  \n>  \n>It is also a culture that makes those inclined to speak out hesitate. A board-level woman in banking says: “When someone asks me to speak about diversity and women in finance, my heart sinks. You know someone will be primed to savage you. They force confrontation and use bullying tactics to put you off speaking out. They say that the ‘leaking pipeline’ is just ‘lifestyle choices’. That it’s not a ‘right’, it’s a ‘choice’ to have a baby and you just have to deal with it. It puts me off speaking.”  \n>  \n>It isn’t just hours. A team leader at an investment bank says: “At our firm, there remains an after-work drinking culture that anyone involved in running family life can’t be a part of. It used to be that younger women would join in with that and at least have a chance of being part of the ‘in crowd’. But, since #MeToo, the men are wary. Too many stories are told about pay-offs to young women who say they were groped on a night out. It’s very hard to know the truth about these ­stories, as they usually get settled \\[with a non-disclosure agreement\\]. But the stories that are told are always that the woman exploited the system for money. Whether that’s the case or not, what really worries me is that a lot of other women will suffer professionally as a result. One man I work with went as far as to say, ‘Why would we include them \\[women\\] when they do this to us?’”  \n>  \n>There is evidence to support this view. A ­survey last year by Sheryl Sandberg’s [LeanIn.org](https://LeanIn.org) and ­SurveyMonkey showed that almost half of male managers who participated were uncomfortable ­mentoring, socialising or working alone with female colleagues. Sixteen per cent of male managers now hesitate to mentor a woman — more than triple the number that said this before #MeToo. Surveys suggest that ­senior men are more likely to hesitate to have a work dinner with a junior-level woman than with a junior-level man, and they are five times more likely to hesitate to travel for work with a junior-level woman. This is perhaps why some report noticing an increase in work-related social/client events that are strongly geared towards men: ­racing-car excursions, extreme ­skiing, caving — all held at weekends, of course.  \n>  \n>This cultural backdrop also has a negative impact on many males. One senior man in banking says: “I resent that I can’t open up my schedule to spend a few hours at the kids’ school or leave before 7pm sometimes, even though the women can. I don’t resent the women for it, but I do see it as a failure of management.” He says his executive team wouldn’t even recognise what he is talking about.  \n>  \n>The women I talk with acknowledge this: “I see that younger dads who want to go home at sensible times of the evening and take the parental leave they’re entitled to are afraid of being a laughing stock. People ask them, ‘Don’t you care about your career?’ Or they are accused of being henpecked. Some of these men, who feel emasculated if they ask for what women can access, grow to resent their colleagues who can work flexibly.”  \n>  \n>Some men are also burning with indignation that the focus seems to be on helping their female colleagues to the exclusion of their needs: “\\[Women\\] get mentoring, coaching and a support group — we just have to get on with the work.”  \n>  \n>As I listen to these stories, I despair. I see these bright, talented women who are so tempted to give up in the face of insurmountable challenges, while everyone pretends this is working out just fine. Meanwhile, the men say they too are stressed, tired and frustrated that they can’t ever escape work. The risk here is that we all shrink further back into our shells. What we urgently need are senior people to talk about these issues in public.  \n>  \n>The good news is that some companies are ­trying to make changes. Emma Codd, managing partner for talent at Deloitte UK, says: “When we started a move to more flexible working, I decided to calculate the costs of not addressing this — to look at the people walking out of the door that didn’t need to leave, the recruitment and training costs of replacing them and the office space we could save on — and it was clear that it was in our interests to make it happen. Since then, just in the UK, we have saved about £200 million as a result.”  \n>  \n>Over the past few months, I have been talking to psychologists and therapists about children raised by parents who are both working long hours. Sarah Clarke, a child and adolescent therapist, says: “Much as I want to be a badass feminist supporting working mums everywhere, my therapy room is full of sad children who miss their parents. I am not going to not say this just because it makes people feel guilty.”  \n>  \n>More than good intentions, what we need is action, and that starts with senior men and women speaking out about the reality of their lives.\n\n&#x200B;",
    "title": "#MeToo: men close ranks | Well-intentioned steps to advance women in the workplace have sparked resentment. Now for the backlash.",
    "subreddit": "MensRights",
    "timestamp": 1552098057,
    "score": 56,
    "keyword": "mixed race manager"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 42,
    "keyword": "mixed race manager"
  },
  {
    "text": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education   \n\nOrwell’s famous dystopia *1984* is often cited as a parable  about the banality of administrative evil. The ever-vigilant bureaucrats  of Oceania position themselves not only on the Left side of history,  but also at its *end.* To err from their ideology is treason.\n\nThe citizens of Oceania live in a state of self-imposed hypnosis  where they have to pretend that even the simplest of words signify their  exact opposites. The government agency that specializes in espionage  and torture is thus called *The Ministry of Love*. The Ministry views every sexual act as a potential crime unless proven otherwise via affirmative surveillance.\n\nImagine a federal agency that has invested itself with the authority  to monitor the most private details of citizens to root out sexual  heresy. Imagine a federal  agency which once contemplated [installing security cameras](http://pgbovine.net/OET-Draft-Grit-Report-2-17-13.pdf) in every classroom in order to monitor the facial and optical muscles of all students nationwide.\n\nThis agency was so devoted to its ideological mission that it never presented its [unconstitutional rules](https://www.thefire.org/did-the-office-for-civil-rights-april-4-dear-colleague-letter-violate-the-law/) to the American public to consult their opinion, considered itself to be [a superior alternative](https://www.huffpost.com/entry/why-students-are-fighting-for-title-ix_b_58e27314e4b0ca889ba1a848) to the criminal justice system, granted itself [universal jurisdiction](https://www.insidehighered.com/news/2018/01/19/feds-find-buffalo-state-failed-investigate-alleged-sexual-assault-created-hostile), threatened many colleges with financial death unless they punished [constitutionally protected speech](https://www.nas.org/blogs/dicta/ocrs_new_sexual_harassment_guidelines_threaten_academic_freedom_due_process), sought to abolish the [“reasonable person” standard](https://reason.com/2016/09/12/ocr-to-frostburg-state-university-common), and created [a class of imitative bureaucrats](https://www.nas.org/blogs/dicta/gender_inequity_among_the_gender_equity_enforcers) in academic institutions to perpetuate an industry of victimhood.\n\nImpossible, you think? We have just objectively described the record  of the Department of Education’s civil rights branch, the Office for  Civil Rights.\n\nThe Office for Civil Rights (OCR) received bipartisan and  professional criticism for its unconstitutional actions during the Obama  administration. Formal critics include the [Federalist Society](https://regproject.org/wp-content/uploads/RTP-Race-Sex-Working-Group-Paper-Campus-Misconduct-Proceedings.pdf), [Heritage Foundation](https://www.heritage.org/crime-and-justice/report/campus-sexual-assault-understanding-the-problem-and-how-fix-it), [National Association of Scholars](https://www.nas.org/articles/nas_applauds_secretary_devos_decision_on_title_ix),[ California Governor Jerry Brown](https://www.wsj.com/articles/jerry-browns-title-ix-veto-1508280834), [Justice Ruth Bader Ginsburg](https://reason.com/blog/2018/02/19/ruth-bader-ginsburg-due-process-me-too),  [American College of Trial Lawyers](https://www.actl.com/docs/default-source/default-document-library/position-statements-and-white-papers/task_force_allegations_of_sexual_violence_white_paper_final.pdf), and [Reason Foundation](https://reason.com/blog/2017/09/07/betsy-devos-rape-ocr-title-ix-campus).\n\nMoreover, courts that have heard cases involving OCR’s Title IX  procedures have often strongly denounced them. Examples include  condemnatory opinions from the [Second Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca2/15-1536/15-1536-2016-07-29.html) and the [Sixth Circuit of Appeals](http://www.opn.ca6.uscourts.gov/opinions.pdf/18a0200p-06.pdf). In a recent [Seventh Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca7/17-3565/17-3565-2019-06-28.html)  opinion, Judge Barrett stated that “Purdue’s process fell short of what  even a high school must provide to a student facing a days-long  suspension.” Professor KC Johnson [has covered the case in greater detail. ](https://www.city-journal.org/john-doe-v-purdue-univ)\n\nObama’s OCR espoused a particular brand of radical feminism.  According to this doctrine, taught across the nation in women’s studies  departments, men have brutalized women since the beginning of history.  Past oppression must be remedied through government intervention,  eliminating the due process principles that are meant to protect every  American.\n\nThe perils of government tyranny aside*,* the fundamental  assumptions of the “patriarchy theory” cannot survive rational scrutiny.  While it is true that women were historically denied various rights,  they have also been sheltered from grievous harm (combat, for example).  Also, analysis of federal aggregate data from the United States  demonstrates that women are [as likely to engage in sexual coercion](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) against men as [vice versa](https://www.sciencedirect.com/science/article/pii/S1359178916301446?via%3Dihub), which undermines the “patriarchy” narrative.\n\nAt any rate, past historical wrongs cannot be rectified by unfair treatment in the present, as the Eighth Circuit stated in [this ruling](https://cases.justia.com/federal/appellate-courts/ca8/18-3077/18-3077-2019-03-06.pdf?ts=1551889833).\n\nOCR’s historical record speaks to its lack of fairness. The agency  authored a total of 255 resolution letters (formal decisions in a case)  from 2012 to 2019.\n\n[Pekgoz summarizes the circumstances in a Synthetic Analysis](https://static.wixstatic.com/media/ea7b71_a751c44c74dc4e8fa8f35666ab9b81a1~mv2_d_3812_2108_s_2.jpg/v1/fill/w_3812,h_2108/PrintScreen%2C%20Synthetic%20Analysis.jpg).\n\nThe analysis shows that whenever OCR wrote a resolution letter  between 2012 and 2019 to adjudicate adversarial proceedings between  female and male parties, they sided with the female 216 times but only 9  times with the male (2400% more likely to side with the female). Their extreme partisanship is clear in every  aspect of Title IX.\n\n&#x200B;\n\n* **Athletics.** The Department’s athletics compliance tests have been [rightfully criticized](https://www.nccivitas.org/2010/title-ix-blind-quota-system-or-how-kneecap-college-sports/)  for imposing unconstitutional quotas. The agency sided with female  athletes 63 times, but sided with the male only once between 2012 and  2019. The only resolution letter favorable for male athletes is the [Temple University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03142257-a.pdf).\n* **Grading.** The Department sided with female students who alleged [discrimination](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/06112126-a.pdf) in [grading](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11162077-a.pdf) on [multiple occasions](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15132147-a.pdf), while dismissing [very similar allegations by male students](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/07132238-a.pdf).\n* **Retaliation.** The Department sided with female  complainants alleging retaliation on many occasions. There are at least  23 letters in this category, such as the [Jacksonville State University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/04142086-a.pdf)  where the agency sided with a “falsely accused” woman. There is no  clear example of the Department siding with a male student alleging  retaliation on the basis of sex, [but dismissal letters do exist](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10111376-a.pdf).\n* **Sexual Harassment.** Male students who petitioned the  agency to allege bias in sexual harassment disputes (either as the  accused, or the accuser) had a success rate of 1.1 percent during  2012-2019 (6/532). The Department was very aggressive when it came to  siding with female accusers while consistently dismissing the concerns  of accused males. This is despite male students often suffering  life-altering consequences, such as expulsion or a permanent notation on  their transcript, in addition to severe emotional distress. [Some have committed suicide](https://www.insidehighered.com/news/2017/05/02/title-ix-cases-resulted-suicide-suicide-attempt-two-colleges-prompt-fresh-debate).\n* **Reasonableness.** OCR urged schools to get rid of the  “reasonable person” standard at least twice:  One letter involved a  female student who accused a male teacher of [staring at her breasts for 3-4 seconds](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09141376-a.pdf). Another letter involved a costly systemic review because very young students [were playing “National Grab Ass Day”](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131106-a.pdf) during play time. The agency even sided with a female student whose claims of sexual violence [were disproven via DNA evidence](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15112115-a.pdf).\n* **Due Process.** While sending a dismissal letter to an accused male student, OCR argued that [“due process” is not covered by Title IX](https://www.scribd.com/document/426012564/Samuel-Meritt-University-Dismissal).  As long as the accused is a man, that is. Federal bureaucrats  aggressively sided with women who were accused of various sexual  infractions. On one occasion, the Department condemned a university for  allowing a male [to file a counter-claim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11116001-a.pdf) of misconduct against a female student. Another time, the agency [threatened a university](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/01102089-a.pdf)  with loss of federal funding for pressing fraud charges against a woman  who made false accusations. There is also an example of OCR using [defamation theory to side with a female complainant](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11141175-a.pdf), even though the agency has never accepted any complaints concerning the damaged reputations of accused men.\n* **Single-Sex Programs.** Women are the majority of college students, but many colleges offer dozens of support programs [for women only](https://www.jamesgmartin.center/2019/05/identity-politics-versus-basic-logic-should-colleges-offer-affirmative-action-for-the-female-majority/).  Whenever male complainants challenge female-only programs, such as  women’s centers or STEM camps for girls, the Department has dismissed  their complaints on various pretexts. One popular pretext is that these  female-only programs cannot be challenged unless men specifically apply  to them and receive rejections, thus creating a putative victim.  However, OCR has resolved [procedural complaints in the absence of any victim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/02152290-a.pdf) on many occasions, as long as the objective [was consistent with their agenda. ](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03121217-a.pdf)\n* **American Psychological Association (APA) Guidelines.** OCR dismissed a Title IX complaint challenging the APA guidelines, which sought to [classify masculinity as a mental illness factor](https://www.dailywire.com/news/46458/foia-request-reveals-boston-title-ix-office-has-ashe-schow).  This was despite serious public outcry against those guidelines. In the  dismissal letter, officials argued that Title IX cannot be applied in a  manner that would interfere with curricular materials. That was false.  OCR has aggressively interfered with [the training materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11142219-a.pdf) and [the curricular materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131096-a.pdf) of [various colleges](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10131040-a.pdf) as long as doing so furthers their gender agenda.\n* **Administrative Closure.** OCR has a rule requiring  the dismissal of pending complaints if similar allegations have been  filed elsewhere. This rule is rigorously applied [to male students to dismiss their Title IX complaints.](https://www.documentcloud.org/documents/3479594-Stanford-University-09-15-2324.html) However, when [female students file complaints against their institutions](https://www.ed.gov/news/press-releases/office-civil-rights-launches-investigation-university-southern-californias-handling-sexual-harassment-claims), administrative closure is not applied to dismiss their allegations.\n\nSome might assume that OCR has received few meritorious complaints  from male students. According to a Freedom of Information Act request,  however, the Department received [532 complaints](https://www.scribd.com/document/426016051/FOIA-All-532-Cases-With-545-Relevant-Allegations) from men in the sexual harassment category alone between 2011 and 2019.\n\nThe Department of Education became a hive of identity politics under  Obama and there is little evidence of improvement. The modest reforms  proposed by Secretary Betsy DeVos have not yet been implemented.\n\nResolution letters published under the Trump administration perpetuate the Obama doctrines. For example, [the Stanford University letter](https://provost.stanford.edu/wp-content/uploads/sites/4/2018/04/OCR-Redacted-Stanford-Letter-of-Finding.pdf) tried to eliminate the reasonable person standard. [The Butte-Glenn Community College letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09132096-a.pdf) involved a retroactive review of many old complaints, demanding the creation of a complex bureaucracy. [The Buffalo State University letter](https://www.insidehighered.com/sites/default/server_files/media/OCR-SUNY-Buffalo-State.pdf) wrongfully claimed that off-campus incidents fall under the jurisdiction of Title IX, [despite case law to the contrary.](https://caselaw.findlaw.com/us-8th-circuit/1410731.html)\n\nUnsurprisingly, some politicians want to abolish the entire Department of Education. Representative Thomas Massie has [introduced a bill](https://massie.house.gov/newsroom/press-releases/rep-massie-introduces-bill-to-abolish-federal-department-of-education)  to do just that. While we cannot predict whether the Department will  ever be abolished, we must never cease our vigilance against our very  own *Ministry of Love.* \n\n*Kursat Christoff Pekgoz is a PhD student at the University of Southern California.*\n\n*James E. Moore, II is professor of industrial and systems  engineering; public policy and management; and civil engineering at the  University of Southern California.*\n\n[*https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/*](https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/)",
    "title": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education",
    "subreddit": "MensRights",
    "timestamp": 1570815774,
    "score": 15,
    "keyword": "mixed race manager"
  },
  {
    "text": "Curvy High School Swimmer Disqualified for a Wedgie For those who have exceeded their Washington Post free article limit:\n\n\"The teenage girl clambered out of the pool, ready to accept victory. A champion swimmer for Anchorage’s Dimond High School, she had crushed her competition in the 100-yard freestyle during Friday night’s meet with a rival from across town.\n\nBut as soon as she stepped out of the water, she learned that she had been disqualified.\n\nThe reason? Her swimsuit was exposing too much of her buttocks, an official ruled.\n\nThe referee’s call, which is now under investigation, has generated intense debate among Alaska’s close-knit swim and dive community, and prompted a larger discussion about how female athletes’ bodies are policed and scrutinized. Lauren Langford, who coaches swimming at another high school in the area, told The Washington Post that she believes racism, in addition to sexism, may have been a factor, given that the teen is among the few nonwhite athletes in a predominantly white sport.\n\n'All of these girls are all wearing suits that are cut the same way,' Langford said. 'And the only girl who gets disqualified is a mixed-race girl with rounder, curvier features.'\n\nThe teenager didn’t pick out the swimsuit — her school chose it and issued it to her. But even though all the girls on her team were dressed identically, she was the only one cited for a uniform violation. Annette Rohde, who was working as an official during the meet, told the Anchorage Daily News that another female ref explained that the bottom of the girl’s suit 'was so far up I could see butt cheek touching butt cheek.’\n\nRohde froze in disbelief, she said, and warned the referee, who has not been identified, 'This is going to blow up.' Sure enough, the decision reverberated throughout the community, where the teen is known as a top-ranked swimmer likely to go on to compete at the collegiate level.\n\n'In a world where young girls are told at every turn that the skin they’re in is not good enough for a thousand reasons, the last thing we need to do in youth athletics is add to that unhealthy dialogue,' Langford, a swim coach at Anchorage’s West High School who coached the teenager and her sisters when they were younger, wrote in a widely shared blog post on Medium after Friday’s meet. She added, 'If you do not like the way that swimsuits fit on these girls’ bodies then don’t look; they are minors, children, and no one should be looking at them anyway.'\n\nSpeaking with The Post on Monday night, Langford said she was angered at the treatment of the teenager, whom she described as 'literally the nicest young lady.' It wasn’t the first time the girl had been made to feel that her curvy figure was problematic: Last year, a parent took a photo of her backside and shared it with other parents to demonstrate that girls on the team were wearing inappropriate swimwear. (District officials said Monday that Dimond High School’s assistant principal 'indicated to the parent who took the photographs that it was not permissible for him to take pictures of others’ children and that he should stop immediately.')\n\n'That to me is so inappropriate,' Langford said. She noted that the teen girl has been accused of hiking her suit up on purpose, but anyone who has competed in swimming would know that suits often ride up unintentionally.\n\n'We have a term for it — it’s called a suit wedgie,' she said. 'And wedgies happen. It’s uncomfortable. No one’s going to walk around that way intentionally.'\n\nOver the years, the conservative one-piece swimsuits traditionally worn by competitive female swimmers have been phased out in favor of a higher-cut style that has less fabric and is more hydrodynamic, but also more revealing. The changes in the cut and fit, Langford said, make it 'even more frequent that you’re picking a wedgie.' But a minor, if annoying, wardrobe malfunction is also likely to be the last thing on the mind of a swimmer intently focused on her form as she nears the finish line.\n\n'If you’re in the water, you’re not thinking about it,' Langford said.\n\nRohde and another local swim coach told the Daily News on Monday that they, too, had never seen the teenager deliberately adjust her swimsuit to make it more revealing. There’s some dispute about whether the referee’s call, which Dimond’s coach has protested, would have been correct if the girl had done so, or if swimmers can be penalized for failing to realize that their suit has bunched up. Officials with the Anchorage School District, who announced Monday that they are reviewing the decision, wrote that the disqualification 'appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms.'\n\nThe National Federation of State High School Associations, the governing body for high school athletics in Alaska, simply states that female swimmers must cover their buttocks and breasts. In August, the organization issued a memorandum alerting coaches that 'suits are being worn in such a way as to expose the athlete’s buttocks,' and provided an illustrated example of what constituted appropriate coverage. District officials said Monday that Dimond High School 'made deliberate efforts over the last year' to meet those requirements — in particular, picking out the regulation swimsuit that the teen was wearing when she was stripped of her victory.\n\n'If the suit was a problem, they all should have been disqualified,' Langford said. 'But they weren’t.'\n\nMeagan Kowatch, the teenager’s mother, told KTUU on Monday that the referee who made the call had previously embarrassed one of her other daughters by critiquing the fit of her swimsuit during a meet. She wants to see the results of Friday’s competition overturned, and for that ref to be kept away from her daughters’ races in future, she said.\n\nThough there’s also been some debate about whether racism played a role in the decision, 'no one seems to be arguing about if it’s sexism,' Langford said. The National Federation of High Schools also published guidelines for appropriate male swimwear in August, and she said she’s seen young men competing in lower-riding suits than the organization deems appropriate. But to her knowledge, it’s never become an issue.\n\nBy contrast, Langford said, Kowatch has been told by other parents that her three daughters on the team, who are all talented swimmers, need to cover up for the sake of their sons. The disqualified teenager, though usually 'tough as nails,' turned teary on Friday night over the referee’s decision, and was 'heartbroken' to learn that people were accusing her of purposefully hiking up her swimsuit, the coach said.\n\n'The fact that she’s been told she’s intentionally trying to draw this sexual attention has really crushed her,' Langford said.\"\n \nBy Antonia Noori Farzan\nSeptember 10 at 6:58 AM\nhttps://www.washingtonpost.com/nation/2019/09/10/anchorage-swimmer-disqualified-wedgie",
    "title": "Curvy High School Swimmer Disqualified for a Wedgie",
    "subreddit": "Feminism",
    "timestamp": 1568221201,
    "score": 15,
    "keyword": "mixed race manager"
  },
  {
    "text": "Who is classed as being a woman of colour? Hey guys. Been deliberating over this. I'm mixed race, half Iranian and half English. Is this classed as being a WOC?? I've always thought of myself as one but a friend recently caused me to question this as she sees me as v white (she is white herself) . I know I have extreme privilege for often passing as white but I've also experienced a lot of discrimination, especially as a kid, for being middle eastern. I've been called names, made fun of and been made to feel I'm different. This has impacted my life a lot and really influenced the way I see the world. Some people see me as white and others do not. I definitely think people make judgements about me based on my appearance. I also have an extremely middle Eastern name which makes people assume things about me before they even meet me and I worry it may result in discrimination when I'm applying for jobs. But I also feel that I'm not qualified to call myself a WOC because other women that are not light skinned as me have it so hard. Anyway, didn't really know who to ask and Google ain't helping. Let me know if it's the wrong space..",
    "title": "Who is classed as being a woman of colour?",
    "subreddit": "Feminism",
    "timestamp": 1565803290,
    "score": 2,
    "keyword": "mixed race manager"
  }
]