[
  {
    "text": "What boomers and older folks are failing to recognize about wages, the state our economy, and the struggle of younger generations. The following was pulled from answer on Quora by Eris Ke Ku’e. Let me know what you think. Why don’t people want the American Dream anymore - marriage, kids, a dog, and the white picket fence?\nI feel like my husband and I are part of the last American generation to be able to achieve this “American Dream\". We are late Generation Xers. How were we able to make this happen?\n\nMy husband grew up upper middle class. I grew up lower class. He was able to attend college because his parents had the savings to pay for his tuition, room, and board. I was able to attend college mainly on the back of hearty Pell Grants, with a few academic scholarships. We both attended the same well-respected state university and at the time, tuition was a mere $1,500 a semester in state. Our books were about $700 a semester. Room, board and meal plans were crazy affordable.\n\nWe walked out of college completely debt free, him thanks to his parents, me thanks to very affordable tuition, government subsidy, and some work on my part for academic scholarships. We got married Junior year in college. Our apartment was dirt cheap ($400) and I was able to pay for it, along with food, entirely on the back of a part time job. And in 2000, I was a pharmacy tech making $11 an hour. We used public transport and I got dirt cheap birth control from Planned Parenthood. We had cheap student health insurance. We were good.\n\nI graduated with a BSN in nursing and he became a teacher. Neither pay royally, but because we were married, our combined income was adequate to support us. We married young and being a dual income house paved the way for us. We had our first baby, planned, a couple years later, while in a fairly nice apartment, 2 bedrooms, very nice area, for $650 a month in a larger city on the East coast. Simply put, housing was affordable.\n\nNext, we were able to buy a house before the market crash. We moved to a bigger city south of us, and we picked an up and coming area where prices were fractional to established areas. In May of 2005, we picked a lovely 1,800 square foot, 3 bedroom, 2.5 bath house with a loft and a two car garage with a killer master suit on half an acre of wooded land for the absolutely bargain price of $140,000. Did I mention it was a new build with a warrantee? I mean, it was a buyer's market all the way.\n\nAs for financing. Interest rates were incredible. They were handing out loans like candy. We got an 80/20 loan at 0% down at a 4% interest rate on the main and a 4.5% interest rate on the 20%. The first mortgage was a 30 year and the second mortgage was a 15 year. Our total house payment, after taxes and insurance, was around $1,000. Retrospectively, the loan process was a ridiculous breeze. We obviously did not get stuck with a subprime loan and we didn’t buy a house that was overpriced. We were certainly lucky, not so much wise. These loans with those rates simply do not exist anymore.\n\nThen the market crashed. We had another child and we soon decided that we wanted to get rid of our second mortgage and get a 15 year fixed loan. However, the game had changed. We eventually succeeded, but the sheer difficulty of this process post crash was insane. Even though we were not a risk, the mortgage company needed years of financial statements, years of tax returns, so many paystubs, freaking statements from our employers that we were not at risk of being terminated, even multiple property appraisals. You can see how if someone is just starting out and trying to buy a home, they very well might not have years and years of solid employment and financials. I could see where the industry was coming from, but if a very stable, middle class couple was struggling with a refinance, what on earth would a single person, or a person of less money or weaker employment do?\n\nAnd to put things in perspective, even though I was a pharmacy tech almost 20 years ago in college, current pharmacy techs aren't even making $11 an hour! Two decades later! Their pay is seemingly going backwards. All while the tuition for the university I attended has over quadrupled for in state tuition! If I were in the exact same boat today, I absolutely would not have become a middle class homeowner. Government subsidies for education have dropped, the interest rates for loans are up, you cannot claim your interest on taxes anymore, and tuition is absolutely through the roof.\n\nIf I were in school now, there would be zero way I would be able to walk away with a college degree and no debt. No way could I only have worked part time to pay for housing. No way would I find an apartment that affordable. The same apartment I lived in 15 years ago is now $1,100 a month. And guess what? Wages have not risen enough to offset that cost. And Lord knows what I would have done for birth control because that particular Planned Prenthood had to close its doors.\n\nI'm no economist, historian, or sociologist. I only know my experience. And looking at the cost of things overall today, mixed with the poor growth in wages, I'd be screwed as a millennial today. To put it into perspective, in 10 years, the price of our first house has gone up a full $100,000. The area developed, but it certainly didn’t turn into anything terribly different from when we lived there.\n\nThat being said, as a nurse, in the ten years since we bought that house, my wages have gone up exactly $3/hr. My husband has not gotten a raise in 7 years. That's right. Seven years and not even a 1% bump. But his insurance has gone up and his benefits have decreased, as have mine. At the price it is now, we would not be buying that house with our current incomes in this current economy. Due to the rise of insurance, we are both taking home less money than we were 7 years ago. That certainly feels counter intuitive.\n\nSo, yeah. The masses aren't reaching for the American Dream anymore because everybody knows the American Dream is much harder to reach than it was 15 years ago. People have had to compromise. Maybe you can afford education but not a house. Maybe you aren't lucky to afford even an education. Maybe you're in a field where wages are frozen. Maybe you aren't married and you don’t have the perk of a dual income. Maybe, maybe, maybe, there are a thousand maybes.\n\nAnd all of this isn’t even considering the fact that perhaps this new generation has different goals. Maybe they would rather travel than own property frozen in one place. Maybe they want to be at the top of their field rather than at home raising kids. Maybe they just want to be able to eat and have a roof over their head, because in this economy, that truly is considered a success.\n\nSo I say, we kind of ruined the fact that the American Dream used to really be the American Reality. Now, younger generations have a different reality to face, and we should not be judging them on making choices that make more sense in this new reality that they face. They are having to make new dreams, because the old dream is rapidly dying.",
    "title": "What boomers and older folks are failing to recognize about wages, the state our economy, and the struggle of younger generations. The following was pulled from answer on Quora by Eris Ke Ku’e. Let me know what you think.",
    "subreddit": "jobs",
    "timestamp": 1628359120,
    "score": 113,
    "keyword": "mixed race judge"
  },
  {
    "text": "Why do they ask about your race/ethnicity in job applications? Should they? Hey everyone. So I have noticed that in every single job application ever (in the US) we are asked to say our race/ethnicity. Why? I think that's a horrible idea. I read somewhere it's because that data goes to government, so that they can see there is \"no discrimination\". But wouldn't that make more sense if the data was collected AFTER the person is hired, whoever they are? Especially since nowadays the applications are online, the hiring manager won't know the race or other physical attributes of a person, so they will judge solely on the candidate's resume, accomplishments, etc. I think it gives the employer more chance to discriminate, if the job seekers are asked to write their race. Because then employers could also take the race as a decision driver, and that is very bad. I always have found it so odd, why should my race matter, just look at whether I qualify. \n\nWhat do you guys think about it?",
    "title": "Why do they ask about your race/ethnicity in job applications? Should they?",
    "subreddit": "jobs",
    "timestamp": 1617754014,
    "score": 62,
    "keyword": "mixed race judge"
  },
  {
    "text": "Is it okay to quit after only one day? I only just got hired at a retail chain last week, basically immediately. I've had a pretty dismal experience with getting hired on the spot, so I was already a bit hesitant, but I took the offer because I need the money. I was promised around 20 hours a week (subject to change, the manager said) and while it's less than what I was looking for, I could work with it. After 6 straight hours of video training, a few days later I get a call from my manager telling me to come in tomorrow (which is today). Then she told me my schedule for next week. I'm only scheduled for two days, for a grand total of seven and a half hours. She told me that they call in employees when they need them - that's why I wasn't scheduled for more days. I can't afford to work uncertain hours like that. I'm a student who has deadlines to plan around, and I also take public transportation to get to work, so I need to plan ahead for that as well (the busses in my city are mediocre at best). I did tell them that my hours were flexible, since I only have classes on two days of the week, but I didn't mean that my *schedule* was flexible. Basically, I can't be an on-call employee, and the fact that I would basically be one was only revealed to me just yesterday. Plus eight hours a week isn't nearly enough to pay the fees I need to. Still, I did promise the manager that I would stay for about a year when asked during my interview. I feel obligated to uphold that, for some reason.\n\nEssentially, I feel like I was lied to even though they *technically* didn't. I've heard mixed things about leaving after only one day (which might not even apply to my situation, since I haven't even actually worked the floor yet). I have another offer from a much better company that I want to take, so being out of a job isn't an issue. However, everything feels pretty time-sensitive, since I don't want to keep the hiring manager of the other company waiting, but I also feel like I shouldn't be so quick to judge with the job I have now. Should I just quit? If I should, how do I do it? Should I do it today when I go in for work? Thanks for the help.",
    "title": "Is it okay to quit after only one day?",
    "subreddit": "jobs",
    "timestamp": 1630080524,
    "score": 5,
    "keyword": "mixed race judge"
  },
  {
    "text": "What should a Business MIS graduate struggling with the job search do? Before you reply, please be nice and understanding with me. Don't judge me because this isn't easy.\n\nI  graduated with B.S. Business MIS, and in the courses we learned Python,  SQL, Excel, Tableau, along with the general business concepts like  project management and such. However, the major is so broad that it  doesn't delve deep in any one software skill like how Computer Science  or the engineerings focus on Java, C++, etc. This is both a strength and  a weakness.\n\nI'm having trouble  finding a job after graduation, it's been almost 1 year now and I feel  exhausted and desperate. Worse, I held off on having a part time job  (living with family) for months to focus on the job search, thinking I  would land one soon, but it never came (will aim for a part time now and  resume the full time search after). Even worse, I made the *heinous*  mistake of graduating during the lockdown, and unfortunately did not  secure an internship because of said pandemic. I didn't waste my free  time during college though, I did a lot of student leadership and  extracurricular which taught me other skills (leadership, teamwork,  event planning, virtual adaptation, hosting meetings, philanthropy,  volunteering).\n\nThe early portion  of post-graduation I focused on applying for Data Analyst jobs, but soon  discovered it was too advanced and not entry level friendly, too  catered towards CS degrees. I focused then towards a mix of nonprofit  administrative positions and business admin / database admin type  positions, or any tech, but to no avail. Currently, per recommendation  of some friends and my sister who switched from accounting to IT, I am  gunning for IT. Except the entry curve is just as difficult and I am  stuck needing to go for Help Desk Support if I want to start this career  path.\n\nTo be honest nothing about  any of those fields excite or motivate me (my choice of major wasn't the  smartest even though lucrative), perhaps I'd be most interested in  certain types of nonprofits that promote ethnic justice, education,  helping others, etc. But nonprofits just pay less, and I'm particularly  jaded after a nonprofit (where I've personally known everyone and  volunteered with for years) that had a full time job opening still did  not accept me after the interview stage due to having no professional  experience in the nonprofit management industry. It was after that I  decided to gun for IT, but now I have doubts. If I need to go for Help  Desk (which I'm struggling to get into) and spend loads on certificates  to advance, am I and my skill-set even a right fit?\n\nWhat  am I supposed to do? Which path do I go down? What is the most entry  level friendly (not that 2-5 years minimum experience BS please) given  my developed skills and experiences? And I've tried to rework my resume  and interview skills but it's just not working, what do I do?",
    "title": "What should a Business MIS graduate struggling with the job search do?",
    "subreddit": "jobs",
    "timestamp": 1638771401,
    "score": 3,
    "keyword": "mixed race judge"
  },
  {
    "text": "People need to understand just how serious The Supreme Court taking the Mississippi abortion case is * The law would effectively ban all abortions - including in cases of rape and incest - after 15 weeks in the state, a significant jump from the current national standard of 20-24 weeks based on viability as established in Planned Parenthood v. Casey ([https://en.wikipedia.org/wiki/Planned\\_Parenthood\\_v.\\_Casey](https://en.wikipedia.org/wiki/Planned_Parenthood_v._Casey)). \n* It was signed into law by Republican Governor Phil Bryant in 2018, before ultimately being struck down by a federal judge based on Roe v. Wade and Planned Parenthood v. Casey. This prompted an appeal to the Supreme Court to reconsider the abortion standard, but the case was left by the court in limbo, reportedly because the conservative justices didn't believe they could count on Chief Justice John Roberts, a right-leaning centrist, to give them the decisive vote against abortion in a 5-4 court. \n* That all changed with the appointment of Amy Coney Barrett last October, which gave the conservatives a 6-3 advantage on the court and an opportunity to bypass Roberts on major cultural issues. The conservative justices started openly plotting on how to take down abortion rights [https://www.cnn.com/2021/03/19/politics/abortion-supreme-court-conservatives-thomas-roberts/index.html](https://www.cnn.com/2021/03/19/politics/abortion-supreme-court-conservatives-thomas-roberts/index.html) and this is clearly the case they've chosen to do it with.\n* The fact that a majority of the court was outright planning to do this is crucial here, because it shows that it's all but certain that this case WILL yield a conservative outcome, and abortion rights will at least be scaled back. The question now is, how much?\n* The case opens the door to the court delivering one of two major decisions:\n\n1. **They could use the case to question the entire validity of the notion of there being a constitutional right to an abortion (since the Constitution does not explicitly give one), from the original Roe v Wade decision to the viability framework in Planned Parenthood v Casey and as such could strike down all existing abortion protections and return them to the individual states.** \n2. **They could uphold the Mississippi law and put it into effect.**\n\n* If the court goes with option 1, it would result in **20 states** immediately banning abortions outright as of today, and experts believe that more would follow in this situation. It is also expected that in the event of abortion restrictions being returned exclusively to the states, even some of the more Democratic-voting ones would tighten restrictions at least somewhat, including Maine, Wisconsin and more ideologically mixed states like Arizona.\n* If the court goes with option 2, it would allow all states to enact abortion bans after 15 weeks instead of the current standard of 20-24, thus cutting the time women get to decide on an abortion by potentially 2 months+. It would also allow states to enact these restrictions WITHOUT the need for exceptions to **rape** and **incest**, since the Mississippi law explicitly excludes them as reasons for justifying abortions past the 15-week limit. It's expected that if the MS law were enacted, around half of all states would enact similar restrictions, as the reliably conservative block of states would be joined by conservative-leaning politically mixed states such as Florida, Texas and Arizona.\n* The court going with option 2 would also open the door to a barrage of further restrictions being enacted down the line, as it would destroy the existing standard for what is an \"undue burden on a woman\" in getting an abortion that Planned Parenthood v Casey defined as being the standard for judging whether an abortion restriction is constitutional or not. It's currently based around the time of viability, but this law would remove that standard as 15 weeks would be well before it. As such, states would fire away with further restrictions of say 12 and 10 weeks and argue that these restrictions too are not placing an undue burden on the woman. And as there'd be no set standard of what IS an undue burden anymore, and with Republican-appointed majorities on almost every branch of the judiciary ([https://en.wikipedia.org/wiki/Judicial\\_appointment\\_history\\_for\\_United\\_States\\_federal\\_courts](https://en.wikipedia.org/wiki/Judicial_appointment_history_for_United_States_federal_courts)), it's likely that these restrictions would also be upheld. \n* Experts believe that in this scenario, courts and conservative states would chip and chip away at the \"undue burden\" basis of PP v Casey until they reach the 'first heartbeat' stage that multiple Republican states have recently proposed, which would be at 6-8 weeks. That isn't to say that every state would enact abortion restrictions of 6-8 weeks, but it would open the door to a situation where say Middle America has caps at 6-8 weeks, states like Texas and Arizona have it at 10-12 weeks, states like Florida and Pennsylvania have it at 15 weeks and more liberal states like New York and Maryland have gone the other way and increased it well past the period of viability.\n\nSo what can we do to stop this? In truth, not a lot:\n\n* We can organize, protest and campaign against it, but in conservative states where majorities of the populations support these types of restrictions, it's likely to fall on deaf ears. \n* We can rally to look to win the next several election cycles so we can eventually replace Supreme Court Justices Thomas and Alito (both on the conservative block and aged 71/72) which would tilt the court's majority from 6-3 conservative to 5-4 liberal and from there we could re-take these restrictions to the court, but the Republicans would only need to win one election in the next 15-20 years to replace them both and lock up a conservative supermajority for the next several generations. Hell, if they get lucky again they could end up replacing one or both of liberal Justices Breyer and Sotomayor (with the former in his 80s and the latter having health problems) as well for a 7-2 or even 8-1 court! \n* And lastly there's a last gasp effort by a small group of progressives to attempt to increase the size of the Supreme Court via legislation to dilute the conservative influence. However, the constitutionality surrounding the ability to do so is highly dubious and disputed; it was only attempted once before by President Franklin D. Roosevelt in the 1930s but failed spectacularly after the leaders of both the House and Senate Judiciary Committees believed it to be unconstitutional, a view that is held by multiple legal scholars and law professors today ([https://lawliberty.org/is-court-packing-constitutional/](https://lawliberty.org/is-court-packing-constitutional/), [https://www.newsweek.com/court-packing-unconstitutional-opinion-1543290](https://www.newsweek.com/court-packing-unconstitutional-opinion-1543290)). The Congressional Research Service also released a report recently that questioned the legality of it [https://crsreports.congress.gov/product/pdf/LSB/LSB10562](https://crsreports.congress.gov/product/pdf/LSB/LSB10562) and The Republicans appear to be lining up these arguments to strike down any serious attempt to ever rekindle FDR's old idea, with Republican-aligned newspapers running sensationalized, Fox News style versions of these arguments en masse lately to prime their base for it ie [https://nypost.com/2021/04/29/court-packing-isnt-just-a-bad-idea-its-downright-unconstitutional/](https://nypost.com/2021/04/29/court-packing-isnt-just-a-bad-idea-its-downright-unconstitutional/). To be absolutely fair though, the Democrats played this game too with gay marriage, when they got the Supreme Court to overturn both congressional AND court precedent to legalize it in the 2010s. Republicans only need to overturn congressional precedent on expanding the court based on the most shaky of precedents from when they had to add a few justices to help handle the workload as justices had to travel from state to state by horse to hear cases in the 1800s, which became untenable in such small numbers as the country kept adding new states to the union. A simple argument of 'the basis for expansion then was legal but now it would just be changing the judiciary to rule better on a President's/Party's agenda, which would violate the separation of powers in Article 3' is likely to suffice. \n\n***In short***: one way or another, things are likely to feel very bleak and change drastically for a lot of women over the next few years. To our female friends, family and colleagues, it's going to be important to be there for each other and support one another through some likely difficult times ahead. But we need to stand strong and not give in, because our resolve, determination and fighting spirit is gonna be tested to the absolute max over the next few years!",
    "title": "People need to understand just how serious The Supreme Court taking the Mississippi abortion case is",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1621281040,
    "score": 1827,
    "keyword": "mixed race judge"
  },
  {
    "text": "My Mom works and my Dad is a house husband. It's created tension with me and some male friends. I'm sorry if the title to this doesn't make much sense, but I wasn't sure how to snappily quip about this.\n\nI (26F) am unsure if it is entirely fair to do so, but I've started to judge my male friends when they see exactly how much my Dad loves my Mom, and I worry for their relationships with women. For context's sake, my parents are late Boomers.Let me explain who they are and why this is a red flag for me.( There's a tldr; if you hate context.)\n\nMy Dad has always been a strong candidate among my friends for \"the coolest\" Dad, mostly because he participates in (and is really good at) some really typical masculine hobbies/social norms- he likes working on old junky cars and used to race them when he was younger, he tells a lot of dirty jokes, loves sitting around with a cold beer, has a somewhat wild youth with stories that would probably make his mother gasp if she knew the extent of them, he had a cool job (he works with remotely operated subs) etc. etc. He was always the parent my friends would gravitate towards. He was cool, he was non-judgmental, he's \"seen some shit\", whatever you'd like to call it.\n\nMy mother in contrast, was a \"typical\" suburban Mom. Constantly chatting, works at a daycare part-time, did most of the housework, loves a quiet book, enjoys hiking. Of course my friends rarely bothered to ask where she was when my dad was roaming the streets in his teens, drag racing junkyard cars at an abandoned air strip (she was sitting shotgun, probably in hot pants that would make HER mother gasp). Some of my more bold friends expressed that my parents didn't match, that my mother was too \"tame\" for my dad, etc etc. But at the time, in my teens, they understood the dynamic of my parents because it fit the typical mould: My dad worked longer hours, sometimes multiple hours of overtime, and would go to sea a lot to make better money, so he often wasn't around, and wasn't able to participate in a lot of household organization/doing chores/etc. because he was either at sea or wouldn't come home until dinner had started, or even sometimes until we were in bed. My mom did most of everything around the house, and worked 3, rarely 4, days at daycare. They \"made sense\" to my friends, because that is how that dynamic has always been portrayed.\n\nBut then, after us kids moved out and were pretty self-sustaining, my dad didn't need to work nearly as much. He can pick up a few months of at-sea work here and there throughout the year, which pays really well, and spend the rest of the time at home, with his wife, and his hobbies. And when this happened, the dynamic shifted, and my perspective, and the perspective of a significant number of men I talk to, seems to completely diverge.\n\nMy dad now does the laundry, he vacuums the house while my mom is away, does the yardwork (except for her herb garden because she likes to do that herself), does the dishes, does the household chores, grocery shops, helps arrange appointments, and then he relaxes and putters and does whatever hobbies he wishes to... until his alarm goes off. He has set an alarm on every landline phone in our house, to always go off 30 minutes before my mom gets home, so he can change out of his sweaty house work clothes, put on a fresh outfit, do his hair, shave, get all pretty, and be ready waiting at the door when my mom gets home. When she gets home the first thing she sees is always my Dad, she gets told he loves her, he hands her a drink he's made, and they sit and talk about her day, how her work was. In the morning, she has to get up early so she can open the daycare, and my dad, who has no regular day job and no reason to wake up until noon, gets up an hour earlier than her and gets her coffee going, makes her breakfast, in the winter he warms up her car with a heater, and makes sure that her slippers are by the bed. It is all centered on my Mom. He can't stop talking about how in love with her he is, how he likes getting to pamper her, how their dynamic has changed now that she doesn't have to worry about those things and it makes him SO. HAPPY.\n\nAll of those things are things my mom would do for my dad when he was working 12 hour days, sometimes going to sea for months at a time, when he was doing labour intensive jobs , and no one batted an eyelash. Now my dad does it for my mom while she works part-time at a daycare job, and I have met so many men who have talked about how \"whipped\" my dad is, some even implying my mother must be manipulative because \"I wouldn't allow that\", they get confused why this \"manly man who does manly things\" also does everything they associate with being a good housewife. Some just laugh and then look uncomfortable, because they can't really question my dad's masculinity when presented with who he is- no red-blooded, rebellious, car-racing, beer-drinking, blue collar working boy would DARE stoop to the level of .... unconditionally loving his wife? Caring for the person who works the most in the house? Treating the person he's married to with care?\n\nI'm not saying I think these men are advocating for my dad to treat my mom \"badly\", or what they would consider \"badly\", but the fact that \"Man of the House\" is somehow synonymous with \"contribute the bare minimum and reap the most rewards\" in their eyes, sets my teeth on edge. I end up shying away from them, worrying about their girlfriends/wives/spouses. When I gush about how my dad calls me to chat about how much he loves my mom, how happy they both are, the nice dates they get to go on, what he did for her today, etc. they look at me like I've lost my mind, or they don't believe me, they think I'm exaggerating. Even some of the well-meaning ones make jokes about how he's a \"Simp\" or \"whipped\" until they see it irks me, or I say \"And?\", and then they get uncomfortable. They wouldn't joke about my mom doing these things for my dad. It's not funny then, it's expected.\n\nBasically I'm here to check if my continued judgements of people to actively include in my friend group, based off of their reaction to my dad's relationship with my mom, is unwarranted. This is the kind of standard I hold to my spouse (and he's doing a great job), and it creates so much friction with some of my friends. They think it's asking too much. Am I asking too much? Is my worldview horrifically slanted? This is me honestly asking. I've had people before tell me that if keep that standard for myself I'll \"limit my options\"... which is kind of the point? Isn't it? I end up gravitating more towards my male friends who react with \"I love that\" or \"This man is goals\", but I am unsure if I'm just creating an echo chamber. This has kind of set the bar for me, and I think for some of the other women who have met my dad, and I don't know how to feel when it seems to set a distance between me and some of the guys I previously thought were pretty alright.\n\nTldr; My father has recently partially retired, and cares for my mom (who still works), like he's a 50's housewife, while waxing poetic about how much he loves her, and I end up making judgements of my male friends based on how they react to that. Am I wrong to do so, and are my standards for how I think wives should be treated too high?  \n\n\nUpdate: Thank you for the gold and all the responses, I really appreciate it! I also informed my Dad that he and Mom and their relationship was getting internet applause and he thought that was fun. He did laugh though because I called him right as he was getting ready to welcome my Mom home (his alarm went off) and could not do his normal greeting because he was talking to me.",
    "title": "My Mom works and my Dad is a house husband. It's created tension with me and some male friends.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624988389,
    "score": 978,
    "keyword": "mixed race judge"
  },
  {
    "text": "I can’t even buy brownie mix Context:  I’m spending some time with a friend who has later stage breast cancer. So we are making a good meal for ourselves and a nice dessert.  I text her on the way over and ask if she needs anything.  She replies “Just the brownie mix”. \n\nSo I enter my local favorite grocery store. Grab a my favorite box of brownie mix to indulge ourselves. I got up front and because I have time (and I hate them), I skip the self check out and go into the express lane. \n\nThere I find a poor woman who is just trying to do her job as a cashier being verbally held hostage by a very very aggressive man.  I say aggressive because I was wearing a mask as a kindness to employees. And he turns to me and starts berating me for wearing a mask. I then look at the poor woman who is just trying to do her job. I decide that i had to to help the poor woman. \n\nI start conversing with the gentleman about his favorite topic, my god given choice to wear my mask and take my medicine. Please note I was just standing there and minding my business.  I get petty.   \n\nI was able to change the subject pretty quickly away from politics. So by changing the subject I mean, I told him I did meth so it didn’t matter what I put in my body.  I said I was a cook and it’s absolute garbage. \n\nHis eyes became giant saucers, he stepped back, and gave me verbal space. He still bothered me with questions about the local bakeries. (Knowing I’d gone too far I was polite). When he left the cashier was visibly relieved. \n\nI get up to check out my Brownie mix and pay.  I say to the woman  “I apologize, I have been 20 years sober.  Please don’t think less of me.”  \n\nShe looked me dead in the eye and thanked me. “I don’t judge anyone, but that guy was hitting on me. He has a girlfriend”. \n\nWorth it to skip the self checkout today.\n\nEdited because I’m tired.\n\nEdit again:  thank you for the award. I appreciate it. Also thank you for the encouragement in the comments. It is a difficult journey, sobriety, and I’m glad the cashier found humor in it.",
    "title": "I can’t even buy brownie mix",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634944495,
    "score": 763,
    "keyword": "mixed race judge"
  },
  {
    "text": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us? It kinda hurts a bit. I'm already an awkward kinda person, and I do know stats say black women and Asian men are the least desirable in the dating world. But it's like, a punch in the face when there's black men out there who refuses to even consider someone looking like you, while in the same breath want to be treated fairly, not judged and have their skin color not be an issue to the world.\n\nAnd then there's the colorism in it. \"I only go for light skinned girls/mixed.\" Everyone has preferences, but this is on par with racists who particularly don't date a specific race because [bigoted racist reason] if not worse because like.... These dudes *know* the struggle of being discriminated on and are actively doing it.\n\nI guess it's something that's been bothering me and I dunno how much it gets discussed. It just makes me feel ugly because I haven't done anything yet, black men already cross me and many women off just based off stereotypes. So much shit gets thrown in about us just by appearance alone without even saying a hi.\n\nNot quite the same, but it made me think of when I was inpatient at a hospital. Young gay black man assumed all this stuff about me just due to my appearance (dunno how because we all look beat up coming into the hospital at all times in the day) and when he actually got to know me, whole new opinion. Thought I was loud, \"ghetto\" etc while uh, I wasn't? But I know he wouldn't like it if people assumed he was in a gang, drug dealer, and likes to watch grab dicks for fun. It's a real slap in the face. But, it's nothing new for me and many other black women out there.",
    "title": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625608005,
    "score": 135,
    "keyword": "mixed race judge"
  },
  {
    "text": "My abortion from beginning to end and update First of all thank you to all the awesome people here and all around the world that dedicate their time and resources to helping people make their own decisions no matter what any other person or government says. Without you all, I may be dead, homeless by choice or forced to have a child when I myself am a child. To the people who tried to attack me with words and religion or attempted to dox me to friends and family to further your own views, fuck you.\n\n\nThere are some things that are VERY wrong with all of this, the entire system. I myself am to blame for not knowing about it all too, but it's not really all my fault because I was never told about how it all works and never looked into it all before I was in a situation where I needed to find the resources to have an abortion.\n\n\nI've lived in Texas my entire life, I've always heard the arguments for and against abortion and always found myself in the middle. Everyone can make their own choices, just make sure they have all the information available. I knew what abortion was, and I thought that was all I needed to know if a time ever came where I needed one, how completely wrong this thinking is and I know for a fact it's how a lot of girls my age think. This needs to change, it is an incredibly complex and nearly impossible thing to get to without a lot of people helping you (here in Texas at least, some places are a lot easier but still not as simple as a thing as you think when you finally do make a choice)\n\n\nTo start everything off, we did use a condom every time. I was not on birth control, which is something I should have done also. Not everything is 100%. Also 6 weeks is an impossibly short time to find out you're pregnant, and this isn't even a definitive time either because in Texas it's when a fetal heartbeat is detected which can happen even sooner than 6 weeks. The only reason I knew I had to check something was that I use a period tracker app and by then it was likely I was too late to make my own decision because Texas, I knew earlier than a lot of others would just because I keep track of my periods beginning and ending on an app and I still couldn't do anything to comply with the law.\n\n\nIt's really hard to describe the feeling of checking my app, thinking for a moment then having an extremely clear realization I could be pregnant and step one is to go get a pregnancy test. The feeling of mixed emotions is a rollercoaster that I don't think can be explained well unless you've gone through it but it was constant thoughts of every emotion, happy, sad, scared, kind of excited too but just all of it all at once and then trying to think of what I can possibly do alone because asking for help due to family, community and religion. \n\n\nI've never felt so entirely alone and like I had to hide something so deeply in my life but I'm entirely in public. I drove over an hour away from my house, drove around the parking lot and sat watching people go in and out to make entirely sure I could go in there and no one would know me while I buy some pregnancy tests. I don't even know what to say about this but when ANYONE for ANY reason feels truly afraid to go into a public place to buy something off a shelf because of how people will look at you and add into the endless feelings roller coaster I can't get off of and I wanted to just hide forever and something is wrong with this.\n\n\nAfter all of that and after doing the tests, I had this weird just thought that I know I am pregnant, I didn't feel any like signs or anything and I googled everything possible to look for or feel for if that makes sense but I just knew. Tests turned out positive and I had no one in my life I could ask for help so I just started searching for how to get an abortion. I knew Texas had a new law but in my mind I was okay because I knew extremely early and I was about to turn 18, I could handle all of this without having to involve anyone. How wrong I was and this is where we need to somehow teach not just what an abortion is but the process, or make it easier I don't know but I do know what we have right now doesn't work here in Texas!\n\n\nI started finding groups, and sites that offer help, assistance, guidance etc and just opened them all in different tabs. Do you want to know what happened the first few sites and numbers and organizations that say they help people with abortions etc? They turn out to be the exact opposite and tell you about every option except abortion. I'm so glad I used a random name and new email for all these calls and sites because I'm so sure some of these would have used that information to try and tell my family about the pregnancy because later, some people did try! Add all of this on top of everything else I am going through entirely alone and I felt trapped, I could do absolutely nothing. This is wrong, who thinks it's okay to make the process be like this for so many young women, young couples? Hell not even just young, but people in general.. why do this to people?\n\n\nI've never been so unable to find something for myself online ever, seriously start going down the rabbit hole of googling abortion help Texas and then try searching out standard reviews to judge what's legit and what's not and for abortion it's like endless back and forth and you cannot find clear answers unless you find the right places but the right places look just like the wrong places and everything you search for online about it is like backwards land which honestly wasn't surprising considering how backwards Texas is on this entire damn thing.\n\n\nSo now I'm alone and can't figure it out that way, so I begin looking up at home ways to force abortion. That is a rabbit hole that I recommend no one goes down, it's full of extremely dangerous ways to do it that are filled with people backing it up. I came across some seemingly safe ways too I think but all of it is dangerous in some way and lots of these ways after more searching can cause later issues with pregnancy maybe and I do want kids later, I just can't do it now. The amount of dangerous and sketchy advice and tutorials out there for this is really scary, it's all over on yt/tiktok and this should be fixed somehow or at least talked about. I even received comments here about it, they were removed but yea… it's messed up.\n\n\nSo now what? Well first thought after all this honestly was pack up, take a car and head to the nearest state that allows abortions because I am more than likely too late even after knowing really early. I don't know anyone in the states near me but that's not the biggest issue right now. Everything just keeps getting worse, so I figured what's the worse that happens, let's go ahead and make a public post on reddit and see if it's actually possible there's a real place that can help that I can call or go-to, all while worrying that someone might somehow recognize me randomly online. \n\n\nI can't thank some of you enough on here, people so willing to offer help, drive me to places, take me in for the procedure in a state that's not so against individual rights. I wasn't able to accept anyone's direct offers for help on here for a few reasons, it's hard to trust accepting help from strangers I mean I'm barely 18 and getting into someones car who offered to drive here from a different state, house me, take me to procedures then take me home is incredibly generous and I love all of you for it who offered. It's just super dangerous and this is the part that needs to get exposure I think, you have lots of young women stuck in situations where they tell no one they know and get into strangers cars and travel.\n\n\nI'm not saying anyone who messaged me to offer help had any bad intentions but there's always a risk, I ultimately was able to get in contact with organizations in Texas from the advice from people here, but even then that process is full of unknown also. You have people being extremely cautious because of the new laws and possible criminal charges in Texas and since there hasn't been many real cases heard in the courts yet no one knows where the line is and take extreme cautions, almost making it like dealing with strangers again.\n\n\nThis is possibly the worst thing about all of this, I had no one in my life I could turn to in this and because of how messed up everything is with the laws and everything else, I had no one except strangers to trust and turn to. I had no way to help myself. It was truly eye opening to be in a situation where you have no one and you can't do it yourself, then you have to feel like a criminal being secretive, running around and everything else. Since when did being female become illegal? That's how it felt.\n\n\nThe organizations were extremely helpful in getting me the exact answers to my questions, offer assistance be it travel, lodging, anything.\n\n\nUltimately I made the decision to do it myself with all the information I could get from them about nearest places, how different nearby states operated. I took this path because I was still afraid that maybe places were just trying to get all of my information to try and stop be from doing what is my choice and I was able to borrow the money needed for gas, hotel etc without my family knowing which I know some people might not be able to do and these places do offer help with these costs.\n\n\nI just immediately felt like it was impossible to trust anyone because there were places I originally reached out to that turned out to try to do just that. Lead me towards anything except abortion and try telling me I'm wrong, young, will regret it etc, these places pretending to offer abortion assistance should be illegal and only made things worse. \n\n\nSo there's my Holiday abortion story, I don't know what exactly needs to change but something does because no one should have to go through all of this.",
    "title": "My abortion from beginning to end and update",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1639586391,
    "score": 56,
    "keyword": "mixed race judge"
  },
  {
    "text": "People are not teaching experiences! No one owes respect and patience to someone who gives them none. I'm so so sick of being harassed and insulted by prejudiced people, only for mutual friends to turn around and tell me I should let them so that they learn. I'm pretty sure we all are.\n\n \\- At a friend's birthday party this guy silently stared at my chest all night, and touched me inappropriately. The response from my friend when I told him? \"Oh, he's not used to women. Sorry about that, but it would be really good for him if you guys hung out so he could practice talking to women!\"\n\n \\- When my boyfriend had a couple people over for drinks, a new acquaintance of his decided that that was the perfect time to tell our trans friend that when he first met her, he didn't see her as a person, and to tell her all of the disgusting things he still thinks when he sees her. Afterwards, I overheard someone \"comforting\" her by telling her he's just not used to trans people and she should cut him some slack.\n\n \\- Another friend of mine goes to Oxford University (for non-UK: very very prestigious, very white, elitist and rich) she's mixed race and working class. When her intelligence and legitimacy is questioned, when she is made to feel less-than, she has been told things like \"He hasn't met many people like you before! You should give him a chance to see what you're really like!\"\n\nAll of the people telling us this have been men who were our friends and \"allies\". If you feel like these are the kinds of things that you would say to excuse the offensive behaviour of a friend, I understand the impulse to defend someone you care about but please stop! Women, especially minorities, are not anyone's teacher, training wheels or learning experience! We do not owe anyone our patience and understanding when they treat us with contempt. If you are friends with someone that degrades or harasses, YOU should let them know how to change, not the people they're degrading! \n\nNo one is perfect, and we all have work that we need to do, but please take the time to consider if this is something you might need to think about.",
    "title": "People are not teaching experiences! No one owes respect and patience to someone who gives them none.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616525876,
    "score": 43,
    "keyword": "mixed race judge"
  },
  {
    "text": "My multicultural teaching class hates disabled folk. I’m disabled. I know what I mean. I’m not exaggerating.\n\nWe had to take some tests where we judge our internal prejudice based on a test that relies completely on the ability to see and use your hands perfectly. My results were all over the place cause my eyes unfocused due to how the images were placed and I have dyscalculia among other things. I was somehow racist and ableist. Shocking since I’m not white and in a wheelchair.\n\nI made a student discussion post after reading some other responses about how can this test be fair/it’s ironic/it’s flaws. I made a very sharp point to be open, communicative, and kind. I was so sure my classmates would agree. That they see how ABLEIST this MULTICULTURAL EDUCATION CLASS has gotten.\n\nThen I read the rest of the posts. One of them literally said “My results showed I have a very strong preference for abled people over disableds. This doesn’t mean I dislike disableds. But I do prefer abled people over them”. This woman is studying to be a teacher.\n\nAnother dude went on a rant about how he’s been hurt but bucked it up so yea he does dislike SOME disabled people cause hes never made an excuse for himself (he was military he literally had no choice but go off) so 22 year olds with handicap placards piss him off. He also said that he doesn’t really care cause he’s too old to change his mind.\n\nAnd of course there was a SE teacher who admitted she also disliked disabled folk. And she saw no issue with that. Just… wow. Wow.\n\nI once again wrote a long, respectful message as someone who is ACTUALLY REALLY DISABLED. For him at least. For her I just basically said “hello how is this possible”. For the SE teacher I just closed my laptop cause I got so mad I wanted to cry.\n\nI thought that’d be the end of it but there were so many who seemingly took the disability prejudice quiz to just… show off how much they hate my kind?\n\nWhen it came to incorrect test results due to how the test is designed with neurologically and physically perfect folk in mind, the only ones who complained were the ones who took the gender and race tests. Other than one who got wrong on the disabled test. ONE. Out of a class of 36 where about half did they disability test.\n\nI had my suspicions before due to the fact that the course is a few weeks close to done and a flawed quiz is the most we’ve talked about disability but this throws it.\n\nI know good and well how hurtful the world is to disabled folk. I just expected better HERE.\n\nI don’t know where to go or what to do. I’m honestly afraid of the responses I’m gonna get now that I see the whole truth. Is the whole profession this ableist?",
    "title": "My multicultural teaching class hates disabled folk.",
    "subreddit": "Teachers",
    "timestamp": 1636162749,
    "score": 13,
    "keyword": "mixed race judge"
  },
  {
    "text": "It's the little things Hi everyone! I'm a grade twelve student who is graduating this year, and I've been thinking about all of the memories I have from my twelve years of school. I have some memories of big events like assemblies and class parties, but most of my fond memories are of really little, insignificant things. If it's OK with you, I'd like to share some of the little things that my teachers did for me that I still remember. I moved twice and it would be hard to track down all of these teachers individually, so I'm hoping that maybe one of them might see this. And if you're having  bad day, feel free to pretend these are about you :)\n\n1. In grade two I wanted to earn my music badge (Girl Guides). I brought my badge book to my music teacher and she spent the entire lunch that day listening to me sing and play piano so that she could sign my badge book and I could earn the badge.\n2. In grade three I dressed up as Princess Leia for Halloween and my Mom did my hair in space buns. Space buns don't mix well with big winter hats so by the time recess was done they had pretty much come undone, and I was very upset. My teacher saw this and helped me redo my hair before the costume parade.\n3. In grade four I lost my mittens at recess, and when I told my teacher she gave me her extra pair without hesitating, because she didn't want me to have to walk home without mittens on.\n4. One day in grade seven I was having a really bad day and so I sat in the corner and cried (don't judge), and when my teacher asked me why I was crying I couldn't really explain so she just sat with for a while until I was calm enough to explain what the problem was. (She is one of the most patient people I have ever met)\n5. In grade ten I accidently overheard my French teacher being laid off due to budget cuts when I went into the office to do the morning announcements (who does that kind of meeting with the door open??) and I was so confused and upset. I went to my music teacher and she didn't know what to say so she just gave me a hug and sat with me while I processed it all.\n\nI guess what I'm trying to say is that It's the little things that people will remember. I'm so thankful to have had so many great teacher role models, and I only wish I could thank them all personally.",
    "title": "It's the little things",
    "subreddit": "Teachers",
    "timestamp": 1609547310,
    "score": 11,
    "keyword": "mixed race judge"
  },
  {
    "text": "Afterschool care--Child feeling underrepresented? Hi all! I'm hoping to get some advice or directions to resources to help me talk to a specific student about race. For context, I am White and the student is Black/mixed, so I want to make sure I can answer her questions in a manner that is situational appropriate, knowledgeable, and sensitive, so that she feels supported.\n\nFor context, I am currently working at an elementary afterschool program in a \\*heavily\\* White state. We are one of the most diverse schools in the state, and there are many BIPOC children in the program, but in the Kindergarten group where I work, of the everyday students, only this one girl is mixed, and the rest are White. One of the directors of the program is Black; but other than that, all of our staff is White, and I believe most if not all of the regular school staff is as well.\n\nThe one girl I mentioned has started asking questions about \"Why aren't there any Black teachers?\" and the like, and I want to give her solid, age appropriate answers, but have been finding myself somewhat unsure of what to say. My instinctive internal answer is along the lines of \"there is still inequality and discrimination, and although this program tries to address this by incentivizing applicants of different identities and backgrounds, there just aren't many BIPOC people in the area\" but that seems a bit discouraging/like its never going to happen, and I feel like telling a 5 year old \"this is just how it is\" is a bad approach on several levels. Because of that, I've kept more to just validation, saying \"you're right, there aren't many Black teachers here and we should have more\" but she doesn't seem satisfied with that answer (considering she keeps asking) and I am not entirely sure what else to say. I've also tried to help her feel represented in other ways--the district \\*does\\* try with diversity, so we have plenty of books with Black characters and written by Black authors, coloring pages with popular characters from those books, etc, which I have been making an effort to request as afterschool materials we can use. \n\nHowever, I still feel like there must be ways to answer her questions at least a little more directly, instead of always deflecting. She's very smart and very self-aware, so my inclination is to try and give her a real answer, but she's also five, and one student among around 10 that I am responsible for, and we are only together for a few hours every week. I don't want to oversimplify a complex situation, but I don't know that I have the time or ability to really get into it. I have also passed all of this on to my director, who clearly sympathizes very closely and personally, but does not have the time to do much more than pick out some books for us to read together. \n\nSorry this post turned into something so long and rambly--TLDR; White afterschool staff, Black Kindergartener, how to talk to her about the lack of diversity she sees at school.",
    "title": "Afterschool care--Child feeling underrepresented?",
    "subreddit": "Teachers",
    "timestamp": 1621387740,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Am I weird for not wanting to move up the ladder? I’m currently in my 30s, have a good career at a prestigious company, and make very good money as an individual contributor. I feel a lot of pressure to move up the chain - from my manager, but also societal expectations and the “rat race” culture that many people in my network subscribe to (I have an mba so that probably explains why).\n\nBut sometimes I sit back and think… wait, I have 30 MORE YEARS of working until I can retire (god willing!) Why should I be in a rush? Some people are so eager to get to VP level and I think that’s great for them. But at the same time, I feel judged for wanting to make a lateral move even though it may take me longer to get promoted, and doesn’t involve a fancy new title or pay increase. Like it’s weird for wanting to prioritize learning and growing my skill set in my job. Maybe one day I’ll want to be a Manager, but I want to do it on my terms when I’ve found the right fit. I don’t want to come across as lazy,  complacent, or not living up to my potential… I am the opposite of that, I just express it differently than most. \n\nAnyway - I just want to know if anyone feels me on this so I know I’m not alone. Or maybe some encouragement that this is a totally valid path and mindset to have.",
    "title": "Am I weird for not wanting to move up the ladder?",
    "subreddit": "careerguidance",
    "timestamp": 1637707629,
    "score": 96,
    "keyword": "mixed race judge"
  },
  {
    "text": "How do you get out of retail management? Trying this out because I’m feeling desperate, any advice is appreciated. I’ll try to be as specific as possible as to get the best advice. \n\nI’m 28 years old, I have my bachelors in psychology(kind of useless I know) and I’ve worked in big box retail for 8 years, management for 5. I’m a mom of 2 little boys who are only 1 and 2 years old, they’re 18 months apart. I received my most recent promotion 3 months ago and I feel like it was a huge mistake. I’m taking the position behind someone who was very well liked but let a lot of things slide that hurt the business and I’m cleaning up their mess, not to mention Christmas in retail is emotionally scarring for everyone involved. I’m a salaried manager with 3 leaders under me and probably about 80 team members. I’m required to work a minimum of 50 hours a week and almost all of my peers at other stores do more than that. \n\nMy first huge issue is the work/life balance, it’s not there. If I’m sick, I’m expected to be there, not to mention anything involving the kids. You’re judged hard for taking any kind of sick or personal day, but the worst part is that if I do it really details my business due to payroll allocation being so bad in January. They literally need bodies in the building. \n\nMy second huge issue is how powerless I feel as a manager. When I took the job, one of my subordinates told me they wanted to be fired so they could collect unemployment. They talk loudly and frequently about how much they hate the job, but the company is SO afraid of being sued that I have no ability to fire at will. I have to go through a loooong grueling performance management process, and it has to be perfectly in line with company expectation(that I was barely trained on) or I can’t even write them up. I also recently had an employee call out corporate HR and tell them I’m racist with completely and entirely made up examples of me being racist, outright made up. I know it’s hard to believe people in the internet when they say this, but they’re lying. And the higher ups know they’re lying, but again I cannot do anything about this, their recommendation is that I never speak to this person in private even as they spread lies to people about me. I’m very upset about not being able to defend my character. I’m literally in a mixed race relationship, which I know doesn’t automatically mean I’m not racist but still. \n\nAs for the job, I lead our entire salefloor operations: inbound, general merchandise, food, and in store fulfillment. I run a $30M process. I am wildly passionate about team development and have helped get a few of my employees promoted, I’m also very results driven and skilled in finding stopgaps in processes. \n\nI’m looking for something with more work life balance, less office politics, and maybe something that doesn’t require me to work every weekend.",
    "title": "How do you get out of retail management?",
    "subreddit": "careerguidance",
    "timestamp": 1609906610,
    "score": 9,
    "keyword": "mixed race judge"
  },
  {
    "text": "I feel like I'm not passionate enough about anything to make it my career. What should I do? Hello everyone. I'm 20 years old currently studying Computer Engineering. It may be an effect of the pandemic and quarantine, but recently I've been struggling with and somewhat depressed/anxious about my path in life. This is a bit of a rant so it might be an incoherent mess but it's also an earnest request for help.\n\nI'm not really passionate about computer engineering or computer science. I enjoyed taking a Java course in my freshman year, but now I'm taking a course in C and am really not enjoying it as well as on the brink of failing. More and more, I'm beginning to think that computer engineering is not what I want to do as a career. In fact, from the start, I only chose this major because I wanted to use it as a sort of backup in case another path I pursue doesn't really work out.\n\nMy parents are supporting me financially, and although I have some scholarships, they are still paying for a portion of my tuition/housing fees. I'm very grateful to them but I feel like I'm letting them down because I'm not properly learning. I want to become financially independent so that I'm not a burden to my family, since we are not very wealthy. I want my choices to not affect my family, and also not be judged by my family. It's really hard because I still need to learn how to drive and get a job.\n\nAs of late, since I've been thinking about my lack of passion for computer engineering, I've also been thinking about what I am passionate about. I realized that I'm not really passionate about anything other than playing video games. And even that has been lost. So, I'm sorta stuck on what I want to do.\n\nAs for what I am interested in, it's a strange mix. I think one of the top things that I'd like to do is write a web serialization. I read a lot of webnovels, which are basically just long fiction novels that are updated daily until completion. I noticed how much joy and entertainment that they bring me and I wanted to do the same thing for others. I've begun writing one but haven't truly dedicated any time to writing it. Ideally, I'd want to make a living writing.\n\nAnother thing is that I'm also interested in game design. Since I've loved video games since a young age, I think it'd be cool to make a career out of video game design. I know that it involves a lot of programming though which somewhat discourages me since I'm not very good at it.\n\nAnother thing, strangely enough, is web development. I think that developing websites is interesting, and I had begun a Youtube course on that but didn't progress super far because of a combination of school stress and laziness.\n\nFinally, I also enjoy cooking but I don't even know where I'd start in terms of making a career out of it.\n\nThese four are my interests, but I don't even really passionately do any of them. Writing is probably the one that I've done the most of, but even that I haven't invested a huge amount of time into.\n\nSomething else is that I have a close friend who is my age. He is currently taking a break from school for a year to work on his website which is basically part of his startup. He doesn't have classes to worry about and lives independently with a few friends. He has a thing where he earns just enough money to pay rent and groceries each month. Everyday he just works on his website and spends time doing what he wants to do. This really affected me because it sounds like a life that I'd really like to live. Just doing what I want to do, not worrying about money. I'm not a very materialistic person either. I rarely buy stuff other than video games occasionally. Even though I am financially dependent, I like to think that I won't ever just splurge money randomly. I'm content with just having a little extra savings for the occasional video game or a nice dinner.\n\nIt's a bit hard to get my thoughts in order, as I'm writing this at 4 in the morning after frying my brain trying to finish a programming project, but I guess what I wanted to ask this subreddit is: What should I do to illuminate my path? How do I figure out what I really want to do while working towards becoming independent? Is it okay to just finish my Computer Engineering degree but not go into a Computer Engineering career?",
    "title": "I feel like I'm not passionate enough about anything to make it my career. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1619597944,
    "score": 9,
    "keyword": "mixed race judge"
  },
  {
    "text": "I want to be an illustrator, is teaching English abroad a good temporary option? I'm 20 and I want to be a professional illustrator, that is the only career I'm interested in. For this you need a very competitive portfolio to land jobs and honestly I'm nowhere near skilled enough. I'm currently a junior in college studying design and have no loans. There is a 6 month art course in China I plan to take after college in 2022 (if the pandemic allows it). I have 15k USD in savings; the art course costs 5k USD and with plane tickets and living expenses it'll most likely be wiped out. I do also have 10k USD in investments but don't want to touch that. I know there are cheaper art courses and I could learn by myself for free, but my favorite artist of all time is a teacher there and it's also like a vacation.  \n\nHopefully I'll improve and add pieces to my portfolio from the art course, but realistically I may still not be good enough to be hired as an artist afterwards. I'm a native English speaker and decent at Mandarin. I was thinking of getting a teaching certificate to teach English in China to sustain myself longer. The certificate programs cost anywhere from a few hundred to a couple thousand USD. English teachers in China are in high demand, the pay is around 1.5k to 2k USD a month, and free housing is usually provided. The pay is relatively low, but I heard from the low cost of living and no rent most people are able to save a few hundred each month. The hours are also part-time so I would have time to draw. \n\nI could teach while taking the art course in China and have the option to continue teaching if I am not able to find work as an artist right away. However this it would also distract me from drawing. Would it be better to have teaching as a back up plan or should I focus solely on art these next two years? I don't exactly want to be a teacher but I don't think I would mind it either, and I could travel and teach English in other countries which is appealing to me. If I can stay longer in China I can also improve my Mandarin which is nice. In addition the teaching job would get me a work visa. I have family living in China so I think I could get a longer visa for visiting family but I'm not too sure.  \n\nWhat worries me though is that I've heard that many foreign English teachers tend to be alcoholics or 'losers.' I can't judge too harshly since my own career prospects don't look too good, but I don't to mix with the wrong crowd. I would prefer hanging out with locals and making friends at the art school in China anyways. \n\nI do have the option of moving back to the US and living with my parents temporarily after depleting my savings. The jobs I find here would most likely be low paying too with a design degree and I do want to be more independent. Any insight is appreciated.",
    "title": "I want to be an illustrator, is teaching English abroad a good temporary option?",
    "subreddit": "careerguidance",
    "timestamp": 1614968316,
    "score": 2,
    "keyword": "mixed race judge"
  },
  {
    "text": "Chemists and Environmental Scientists of Reddit, what should I do to achieve these goals?  There's a lot to unpack here so I'll divide it:\n\n1. **Who am I** \\- I'm a 24 yo Spaniard who is studying a double undergraduate degree in environmental sciences and chemistry\n2. **Goals -** I want a job that actually **helps society**. One thing that really scares me is to have a job where I have to pretend that what I do matter in order to get paid. There are many problems in the world and science can help us. I want to be part of the help, to the degree that my limited intellect allows me to get.\n\nA job that allows me to **make money** nothing crazy but enough to sustain myself. Money is only a concern for the future, one day I will want to have kids and then I want to have money to support a family, obviously to live without rommates, etc.\n\nA job that does **not exploit me.** I believe most people work too many hours and do a very inefficient job. I want to work hard but little each day. 4-6 hours a day, not more. I want to have free time not just to waste it, but to learn about different stuff, learn scientific books, languages or art. And who knows especially reading and learning about other fields can help me in my career. I think time to discover new things is highly important.\n\n3) **Obstacles** first off I'm Spaniard, I think the **job mentality here** is very harmful, people are judged by the numbers of hours they work not their product. They want you to suffer and to see you grinding, evne if it's completley inefficient.\n\nSecondly, **that applies to my education**, it has the same fault and I totally hate it. My classmates know so little. **So little you wouldn't believe** , 70% of them don't know who Elon Musk or Spacex or Tesla are. They don't know English. They don't have an interest for any topic like climate change, geoengineering, etc. They just study to pass exams, memorize information and regurgitate it on the exam paper\n\nI went to **Norway** as an exchange student and my average grade passed from a 6/10 to an 8/10. Granted I mostly took environmental courses there, I started chemistry this year, in Spain, and I hate not knowing how chemistry was taught there. But at least environmentals, it was completely different, way less hours, way less suffering and still I ended up learning more. I was motivated, I could discuss my ideas with classmates (they knew who Elon Musk is!), etc. So I would **want to move out and work abroad**, either Scandinavia, the US, Canada, the UK or Australia\n\nBecause of all those obstacles, **I want to not study more in university**, because I make no money, I'm too old to be studying, I'm not learning anything since it's Spain. If I was in Norway, I would try to get a master degree. And the reason why I went for a double major (undergraduate) was to compensate however much I could, not getting a Master's degree\n\n&#x200B;\n\n**4) Conclusion**\n\nI am not the brightest guy in the world, I haven't received the best education and I know I'm aiming high. But I'm also trying to be rational and humble. I know I won't be the next Elon Musk, but there's a range of possibilities and depending on my choices I can end up with a worse life and not helping humanity. Or as a smarter guy , living a satified life and helping the world as much as I can.\n\n(I'm not sure if this matters, but I'm interested about teaching people science, how science and religion don't mix. I'm into Bjorn Lomborg, although he has received so much criticism that I'm a bit skeptical, I really can't find flaws in his arguments and I really admire him)\n\nI'm willing to work hard (but efficiently! Allowing me to work out, have a family and well be happy), I'm willing to wait until I'm older to make more money. I'm trying to not act spoiled or like I'm above any jobs. **I just want to do what I ought to be doing.**",
    "title": "Chemists and Environmental Scientists of Reddit, what should I do to achieve these goals?",
    "subreddit": "careerguidance",
    "timestamp": 1617544771,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance! I'll try to keep this as short I as can...\n\nI am a 26-year-old male, Canadian citizen, with a BFA in dance from a liberal arts college in NYC. I've always been keen on education and specifically returning to school after my Bachelor's. I feel like I am on the pathway to figuring out what I would like to study but I am also very lost.\n\nTo provide some context, I am attended school in NYC from 2014-2018, during that time I struggled a lot with my mental health (anxiety, depression, bulimia). Unfortunately, the dance world was too overwhelming for me at the time, and it did not seem like a career that I have fully invested in anymore. I then had to return to Canada summer of 2019 due to the end of my student visa, and since then I've spent almost every day thinking about getting back on track and discovering myself again.\n\nI struggle with weighing my desires and dream life, and also considering the practicality of it all, especially amidst Covid restrictions. I am firm in that I would like to return to school in NYC—it's pretty much my home and where I feel most myself. Beyond that, I have little idea about what I would like to study. At first, I wanted to backtrack and complete a PostBacc so that I could move into the Nutrition & Dietetics field, which stemmed from my past with eating disorders and my drive to be a person to help those in need as I didn't receive that help when I needed it most and to also challenge my brain in a different way than I had used it during my undergrad. I realized that backtracking to fulfill the academic courses, whether in Canada or the US, requires me either finishing high school level courses in Canada and then moving to college/university level courses, or following the international student requirement PostBacc in the US in only one year. At that point, I realized my passion for the subject wasn't fully present, and that the urge to move into sciences came from low self-esteem as my BFA is often viewed as worthless.\n\nSince then, I've been attempting to do a lot of introspective work, which may also be a disadvantage because I am constantly in my head, to figure out my values, goals, desires, interests, etc. As much as I've been focusing on the things that I don't like or may not seem suitable for me, here are some **things I do know**:\n\n* I am queer and I would like to study/work in a space that allows me to investigate the insections of queerness in today's society\n* I am mixed race. I am Black and Japanese and I am interested in incorporating my background as a part of my studies and further into the political and social climate right now\n* I am creative- as much as I've moved away from my dreams of performing, I am still a creative-minded person. I would love to work with dancers, movers, other likeminded people\n* I am interested in fashion, specifically fashion marketing. I would love to study something along the lines of fashion marketing that includes an emphasis on race, inclusivity of models (dancers)\n\nI have other interests, but I guess those are my main focuses right now. With my job history since graduation including working in the admin fitness industry and short-lived receptionist jobs, I have little work experience that would suffice for a grad school application.\n\nTLDR; I guess I'm wondering, how can I figure out my passions and what to study in grad school considering the pandemic and being an international student determined to live in NYC\n\nThank you to anyone who has made it this far\n\nMuch love",
    "title": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance!",
    "subreddit": "careerguidance",
    "timestamp": 1619471969,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Please don't neglect your communication skills in favor of improving your leetcode skills One thing I found that doesn't appear enough on this SR is communication. I tend to see any variation of \"Is this offer good?\" or, \"Why do I have to grind leetcode?!\". Most of the on-the-job posts consist of \"I am in a toxic environment\" or \"Should I change jobs?\"\n\nI have a piece of career advice for anyone who is fairly new to the field that I think could prove helpful. \n\nFirst, a little about me as while I'm not going to hinder my anonymity I do feel I'm in a position where I can rightly prescribe advice to newer SE's / grads / those still school: I'm a Principal Engineer, and have a wide array of experience across operations (including release / implementation) as well as experience developing user-facing code, and internal tooling used organization-wide. I've worked in the DOD, networking space, e-commerce, and fin-tech. \n\nJobs I've held include:\n\n* Software engineer (senior/staff/principal)\n* DevOps Engineer\n* Lead DevOps engineer\n* Lead Site Reliability Engineer\n* Tech Lead\n* Software Development Manager\n* Director of Operations\n\nOne of the greatest skill deficiencies I see in engineers has always been communication. Communication is a very important part of our job. It allows us to promote our ideas, defend our solutions, play the Devil's Advocate, request help, refuse help, patronize others as well as compliment them. We can use communication to self-promote or self-deprecate. Communication literally sets us apart from every other species on this planet; that's not to say other species can't communicate, but that you won't see one chimpanzee explaining to another what the functional use of a blow-hole in Blue Whales is after explaining the nuances in their childrens' respective behavior while foraging for food. \n\nHere is a hard reality for many engineers: ***Even if you are the best software developer at your entire company, getting others (employees, external customers, internal customers) to actually use what you wrote is a different beast than writing a tool.***\n\nHere is another hard reality: ***Many tasks rely on others to \"un-block us\". There are of course times when the blocker is stubborn enough that solid communication doesn't help, but solid communication never hurts.*** \n\nIt's not uncommon for a developer to feel like a priority queue that relies on other priority queues which are poorly optimized, and plagued with race-conditions. \n\nBelow are some points I'd like to make on the subject of communication:\n\n**Being direct is not mutually exclusive with being polite**. I often find overtly rude people fall on the \"I'm just direct and straightforward!\" excuse as though it actually is an excuse for their rudeness. Consider different ways to say the same thing. This SR, and many others, while not inherently controversial (rudeness is often derived from controversial topics), is plagued with what I'd call \"direct rudeness\". Most of us who have posted here at one point or another have been faced with someone who disagreed but failed to do so in a way that made us feel any productive discussion was possible. \n\nConsider the following two versions of the same sentence (email threads I've actually witnessed, redacted of course):\n\n>Hello \\_\\_\\_\\_\\_, you are writing a tool that duplicates work done in a tool I've already written. You need to do a better job of communicating what you're working on so we aren't constantly creating duplicate work and wasting time.\n\nHowever, consider had it been structured slightly differently:\n\n>Hello \\_\\_\\_\\_\\_, I noticed you're contributing to a tool which I found here(assume a link to source). I'd like to learn more about your specific needs and perhaps discuss whether $TOOL\\_I\\_ALREADY\\_WROTE would fit them, and if not perhaps we could discuss continuing your thread of work towards enhancing the existing tool-set by adding any features you find it's lacking, as there is certainly some overlap. It'd be great if we could avoid duplicate efforts and enhance a tool that's already in use by the organization. Let me know your thoughts.\n\nBoth sentences communicate the same message, but the former puts the recipient on the defensive and immediately raises a few barriers in their mind. Upon receiving it they will be texting / chatting most of their close-colleagues about what a jerk you were. You turned your potential meeting on the topic into a street brawl instead of a discussion. Sometimes it can work out, but why cause additional stress? \n\nI'd argue that the second version of the sentence still gets the point across but puts the recipient and relative ease and opens a dialogue. To expand upon it a bit more in the second version we acknowledge that the recipient is writing a tool, and raise the concern on the overlapping functionality of that tool with an existing one. The purpose of the email is clearly stated as a goal; avoiding overlap. It's not an accusation but a goal and the use of 'we' puts a collective goal in the recipient's mind. Closing with \"Let me know your thoughts.\" opens a dialogue whereas the over-directness of the first version never actually indicates any interest in a dialogue or common goal.\n\n**Everyone is busy, even when they aren't.** We all need things from colleagues, and some colleagues are naturally more busy than others, and some seem like they're never actually working on anything. It's not our job as developers / individual contributors to judge another's workload (and if it is you should evaluate your company's situation). Many things are cyclical and you may be faced with situations where you need a thing done by someone you do not particularly enjoy working with. I have found strategies in communicating with such people that have been effective, for the most part. \n\nPeople love when you acknowledge \"how busy they are\" even when they aren't ever really busy from your perspective. Consider two people asking you for help:\n\n>Hey \\_\\_\\_\\_, can you please do \\_\\_\\_\\_ for me? This is very urgent and blocking $IMPORTANT\\_THING.\n\nConsider that your $IMPORTANT\\_THING isn't always their $IMPORTANT\\_THING. Your emergency isn't always theirs. In a company that is unified it certainly should be, and we should all be empathetic and helpful when we can and have the bandwidth, but it's not always the hand we're dealt. Consider this slight change:\n\n>Hey \\_\\_\\_\\_, I know you're really busy and I'm sorry to bother you! We have an urgent ongoing issue and I'd really, really appreciate it if you could take some time to look!\n\nKeep in mind these are all suggestions and things that have worked for me, but I've had much better luck with using the second version over the first. To reiterate: People love to appear busy. Especially at work. I don't know what it is about perpetually being busy, but it's a badge of honor in our work culture and to not be busy is to not be relevant. ***Also keep in mind that you yourself are not a metric by which to judge people. If you put in 80 hours a week at your salaried job, that's your prerogative. Do not hold that expectation of others.***\n\n**Strong opinions are still opinions.** This one is very relevant in our field as there are many subjects which are inherently based on opinions which draw a lot of controversy. Spaces vs tabs, programming syntax, which language to use, which tools to use, log formatting, etc.. Sometimes we're opinionated about the problems that need to be solved. Do they need to be solved? What's the reason we're solving it?\n\nAlways be self-aware of when you're prescribing your opinion vs. when you're prescribing factual-based information. Pick your battles. If you like tabs, and the project uses spaces, that is not the battle to pick. It's not even really worth a mention unless you can do it without being a jerk. If you want to prescribe your strong opinions onto others then be prepared to back up why you wish to do so.\n\nI recommend being objective, always. Do not make statements that cannot be backed up with other objective statements and explanations.\n\nIdentify why you're so strongly opinionated. Can you present your opinion in a way which shows it derives some mutual benefit?\n\nSometimes one opinion can be stronger than another opinion but this is usually rooted in **facts or history.** For example, the spaces vs. tabs talk is inherently based on opinion. If you walk into a project which uses tabs, and you are a spaces person, you ***do not just reformat the whole project to spaces. This will only make you appear to be an asshole.*** This is also a case where your ***opinion is wrong. Not in that one is superior to the other, but the fact that now when I run a diff in SCM across to revisions, you just created a shit-ton of change where there actually was none, making debugging harder and all because you felt your opinion was superior.*** \n\n**In closing -** I just wanted to possibly help some others in their communication style by providing some examples where I saw what I'd consider communication miss / failure, and examples that have personally worked wonders for me. I'm open to any additional input / advice / suggestions that could help others, as well, including if you want to indicate anywhere you disagree with the things I've said and make suggestions I might not have considered.\n\nJust always be aware that if you aren't communicating at your job, something is wrong. If you aren't communicating ***effectively*** then you are going to hit unnecessary hurdles in your career; a career that is inherently difficult to navigate given the constant churn on technological advancement / changes. I highly recommend any new engineer to host as many lunch and learns, and project demos as they can (code you wrote, tools you wrote, etc..) to improve these skills early in their career, as it will pay massive dividends in the years to come. As for written communication, if you are communicating something that feels edgy / difficult, then sit on it for a bit and proof-read / reread it. Pretend you're the recipient and how you'd respond if you received it from yourself. Consider your relationship with the person you're sending to, and how they respond to and consume various types of communication. Always be learning about your peers and learn how to navigate their personalities in ways that increases your success without inhibiting theirs.\n\n&#x200B;\n\nThanks for reading.",
    "title": "Please don't neglect your communication skills in favor of improving your leetcode skills",
    "subreddit": "cscareerquestions",
    "timestamp": 1634747902,
    "score": 2986,
    "keyword": "mixed race judge"
  },
  {
    "text": "How do you plan for a long, technical-focused careeer in CS? >**TL;DR**: How to age into an old fart (but young at heart and brain) in a technical, CS-related career?\n\n(long post ahead)\n\nHi,\n\nAs the title says, I'm curious about what others in this sub would do to build a long career in tech.\n\nThere are two articles mentioning that a CS career could be long-winded:\n\n* [Teach Yourself Programming in Ten Years (Peter Novig)](https://norvig.com/21-days.html)\n* [A forty year career (Will Larson)](https://lethain.com/forty-year-career/)\n\nFrom this post, I want to learn more about different \"paths\" one can take for a \\~30-year++ career in 2021. In addition, tips on how we could get more out of a long career will be great additions, too.\n\n*To start, I 'll share my take later in the post.*\n\n========================================\n\nIt is definitely welcome to hear from a wide range of experiences. But if you want to focus the discussion, I'm interested in \"paths\" with these traits:\n\n## Lean more towards the technical side (vs people management)\n\nI tend to enjoy concrete work, e.g: writing code, running system, etc. However, things that fall under the \"soft-skill \" umbrella is also OK. I'm just not fond of roles where you end up a meeting-goers every day, letting your technical chop get rusty.\n\n## Reward you for technical \"expertise\"\n\nHere, \"expertise\" means the  ability to solve and understand complex problems in your field.\n\nSome older engineers I know are very good in their field of choice. They also get paid well for it. For example, these fields are: data-center networking, software performance engineering, designing high-availablilty system, writing formally-verified software, etc.\n\nIMO, having expertise in these areas seems like a good way to build your advantage as we age. This is important to not become redudant when faced with hard-working junior colleagues. (It's a sad world like that...).\n\n&#x200B;\n\n&#x200B;\n\n========================================\n\n**A blurb about myself (for context)**\n\n* Graduated with a Bachelor in Computer Engineer => background in hardware, low-level software.\n* Self-learnt CS and more trendy industry topics since.\n* Worked as \"full-stack\", then backend dev (APIs, payment, data warehouse/pipelines, IoT).\n* Recently took on devops role for a decently-sized company, running Kubernetes in data centers and clouds.\n* Worked at various company sizes (<50 => 3000+) .\n* Also worked in various industries (video streaming, electrical/utilities, gaming).\n* Have been both individiual contributor and led small teams (3-5 people) unofficially.\n* Above average ToC (\\~130k++ cash in Canada, \\~6 YoE) but nothing too fancy.\n* Generally enjoy CS-related work, but also open about utilizing tech in other industries.\n\n## Thoughts on \"having a long career\"\n\nIn general, I believe it's possible to have a long career in tech (having seen some old and wise engineers myself). Yet, it seems a long career requires good techincal chops and other complimentary skillsets. For example, besides asking hard coding/system design questions, people also expect you to show leadership + communication skills in interviews/day-to-day work.\n\nIMO, the ideal role for me at 10 YoE (mid-30s) would be a Principal/Staff (software) engineer.\n\nIf these [archetypes of staff engineers](https://staffeng.com/guides/staff-archetypes) are indicative, I aim to be a mix of Tech Lead + Architect + Solver. For example, leading a small team to solve a business-impacting problem would be something interesting.\n\nPast 10 YoE, I don't really know what's else there would be.\n\n**Industry/area of focus**:\n\nI plan to stay in the \"computing infrastructure\" space.\n\n* My experiences are mostly with backends, data-intensive systems right now. This helps build up familiarity with the space.\n* I plan to expand my knowledge in networking, performance engineering soon. In the future, maybe some kernel-related work would be great.\n\nThere's some tenative paths for this area, IMO:\n\n* More **DevOps/SRE** work, hopefully with increasing scale.\n* Specialize in **data-center**: deeper work underneath the \"clouds\". This will need much better networking knowledge, though.\n* Specialize in **kernel/embeded software**. There is transferable knowledge on operating system. But there's a lot more to learn once you are outside the Linux kernel.\n* Specialize in **infra-related areas**: database, data warehouse/pipelines, etc.\n\n**To build up advantages**\n\nThis is what I have been doing so far:\n\n* Keep a hands-on approach to problem solving. For example: participate in on-call rotation, write code and deals with technical debt (mine and others). I also run a home computing lab for experiements.\n* Keep reading/learning. Nowadays, instead of jumping on the industry's latest, I am biased towards more researchy materials. For example books, CS research journal/[the morning paper](https://blog.acolyer.org/), etc.\n* Attempt to acquire novel work-like experiences outside of my dayjob. For example, I help some friends in an NGO with their software-related need.\n* Occasionally crunch some LeetCode to stay fit for medium+ problems.\n* Maintain a light professional network/connections to spot new opportunities.\n\n**On the $$ side**\n\n* Haven't pushed hard for compensation yet, but will start scheduling interviews towards late-2021.\n* I am more concerned about finding a company with good potential (thus problems + money to spend on them). Certain team dynamics/values are also important to me (e.g: value quality work, trusting each other, etc).\n\n==>\n\nIn short, I am betting that \"computing infrastructure\" is not going away soon. Hence, a solid foundation in the field would mean above-average financial outcome. And I get some happiness while being immersed in the area as well.\n\nI am hopeful that this plan will workout. However, sometimes there's a little bit of FOMO on other paths (e.g: AI/Deep learning). Also I see lots of gaps to fill and no quick way out of the rat race :)\n\nHow about you? What are you planning for your career path?",
    "title": "How do you plan for a long, technical-focused careeer in CS?",
    "subreddit": "cscareerquestions",
    "timestamp": 1614244988,
    "score": 57,
    "keyword": "mixed race judge"
  },
  {
    "text": "Out of all the cases you've read so far, which one(s) pissed you off the most, and why? &nbsp;Have y'all ever read a case that boils your blood and ruins your day even just thinking about it? We all have those specific decisions that make us feel some kind of way, and I'd love to know which ones have affected you the most. I can't tell you how many times so-called jurisprudence made my jaw drop by irrationally legitimizing some serious bullshit. This might sound silly, but sometimes I'll get seriously pissed off thinking about judges who've a mockery of the law by perverting the very institution protecting our rights into promulgating injustices. Here's my list of the some of the cases I consider to be among the most egregious examples of this. Let's get the most obvious one out of the way. You already know which one it is without me even having to say it:\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n***Dred Scott v. Sandford.*** Universally regarded as the worst Supreme Court decision of all time, and rightfully so. The ghost of Roger Taney can catch these fucking hands any day of the week. The institution of American chattel slavery was an abomination to both God and mankind, a crime so unbelievably heinous that even those who tacitly endorse it are profoundly evil. But a man who abuses his immense power attempting to perpetuate that horror forever, well, he's cast himself down to the very bottom of the lowest circle of hell and started digging. Not only did it deprive African Americans of the basic rights even the racist Founding Fathers allowed them, it became a catalyst for the bloodiest war in our country's history. This smug piece of shit, believing he'd settled the slavery question forever, wrote words that killed hundreds of thousands of people and dehumanized even more.\n\n\n\n&nbsp;\n\n\n\n Yet **even someone who'd actually agree with dooming an entire race to lacking any rights whatsoever** couldn't even justify effectuating it the way the Court did, because this unbelievable asshole not only wrote his opinion *after* dismissing Scott's claim on standing grounds, he also attached a completely unrelated coda invalidating the Missouri Compromise when he had absolutely no authority to do so. Anyone with even cursory knowledge of the law can see his violation of the separation of powers in effectively legislating from the bench. The Chief Justice is supposed to be the brightest legal mind we have, so that bastard knew exactly what he was doing. His disgusting attack on the Compromise was, in effect, an advisory opinion masquerading as \"jurisprudence\" comparable to a five-year-old's crayon drawing of a swastika. Even worse, six other Justices participated in this gang-rape of the very rights our country was founded on. It was not only substantively unjust but procedurally unjust as well. The only two men with any sort of backbone in this story are Dred Scott himself and Justice Robbins (the only Supreme Court justice to resign on principle.) The rest of them deserve to burn (and yes, that includes McLean too).  \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n***McClesky v. Kemp.*** What do you get when you combine racism, injustice, and denial of not only factual proof but basic mathematics itself? You get an extraordinarily tragic and infuriating example of how courts have continued to deprive African Americans of their voice in the judicial process even almost a century and a half after the Dred Scott decision. The abolition of the pre-Furman framework for capital punishment was in large part due to systematic racial disparities in the imposition of death sentences. Our current post-Gregg framework, in contrast, was partly born from Georgia's desire to absolutely kill the shit out of Troy Gregg, as one of five states providing a template for the reintroduction of capital punishment. To do so, they convoluted their process in a way that addressed every concern in *Furman* to comply with the Eighth Amendment, and quickly extinguished any other lingering constitutional issues (e.g. Coker v. Georgia). This case directly exposed the post-Gregg framework as the charade it always was; a continuation of the policy of certain death for black defendants alleged to have committed **any** sort of crime against a white victim. \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThe disparity was always odious and obvious; black men accused of raping white women were almost always executed, with very few exceptions, if they even had the chance to make it the gallows before they were lynched by a mob. In contrast, the execution of white defendants for rape was very rare, and almost all of these cases involved defendants convicted of raping a child. McClesky's thorough, comprehensive, scientific analysis of every single Georgia death sentence statistically proved that black defendants accused of killing white victims were **TWENTY-TWO TIMES MORE LIKELY TO RECEIVE A DEATH SENTENCE THAN BLACK DEFENDANTS ACCUSED OF KILLING BLACK VICTIMS**, and more than seven times more likely to be sentenced to death than white defendants convicted of killing a black victim. The denial of such empirical and objective data can't be adequately explained by anything other than the majority advocating, or at the very least actively condoning systematic racism. \n\n\n\n\n&nbsp;\n\n\n\n\n\nThis alone is already unconscionable from the highest court in the land, but the most egregious part of this case is Powell's inexplicable and unconstitutional assertion that **even if Georgia's sentencing policy being racist were taken as true** (remember, their pledged avoidance of this was the whole basis they were allowed to bring it back)  McClesky had no recourse because no racial bias could be proven **in his specific case.** I can't even explain how wrong that is, on so many different grounds. The granting of rights to everyone through the granting of rights to an individual plaintiff has long been one of the most basic cornerstones of judicial function, and denying that to McClesky was, in effect,  a denial of rights to all African Americans, and it killed him. Even Powell himself admitted years later that he wished he could go back and change his vote. Unfortunately, McClesky had already been executed by then.\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n***Ashcroft v. Iqbal.*** This is an example of a recent case that makes scholars throw up their hands and go, \"yeah, I get it, but... come on, seriously?\". It's the legal equivalent of what happens when an unstoppable force (Iqbal's claims) meets an immovable object (the US government's storied commitment to covering its own ass when committing human rights abuses.) The extraordinary lengths the government went to in order fuck over just one guy over were so extensive that they irreversibly changed the way the ENTIRE AMERICAN LEGAL SYSTEM WORKS, FOR EVERYONE, disadvantaging every single civil plaintiff in the the past thirteen years, just to deny this one guy his basic rights. The Court's complete disregard for the well-settled logic behind the doctrine of respondeat superior and vicarious liability is already bad enough, but its extraordinary far-reaching consequences for civil procedure have irreparably harmed the whole idea of what litigation actually exists for, and will most likely continue to do so for a very long time. \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThis completely unwarranted, arbitrary imposition of the plausibility standard infected a mostly-objective process with an extremely dangerous element of subjectiveness. Who's to say what's actually \"plausible\"? The previous framework was imperfect but far more just: claims were dismissed immediately if they were obviously factually impossible, vexatious, malicious, 12(b)(6)'d, or otherwise unacceptable for litigation. these standards are not only very clear, but necessarily mostly or completely dependent upon consideration of objective facts. Plausible? I'll tell you what's fucking plausible. It's plausible that the Supreme Court secretly conspired with the executive branch to change the way the whole game is played, just to excuse its abuse and arbitrary detention of Arab Muslims in the aftermath of 9/11. It's plausible that they were looking for the a perfect test case to come along and serve as the excuse to introduce this plausibility standard, and this one just happened to be the right fit. And it's *extremely* plausible that everyone responsible for this decision can suck my nuts, because the last thing on Earth I ever needed as a manic 1L was a few dozen more pages of Civil Procedure reading than I otherwise wouldn't have had. Thanks a lot!\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n***Bank Markazi v. Peterson.*** Iran, Iran, Iran. How many times have we seen the incredible lengths our judiciary has gone to in order to break the fundamental rules of our own laws? They love to carve convenient exceptions out of the very concept of what laws and precedents mean, just to get back at them for the 1979 hostage crisis. That's the only explanation for all these similar rulings involving Iran -- far too many to list here -- that completely defy any logical justification and contradict everything the separation of powers stands for. The prohibition on legislative meddling in the specific outcomes of individual cases is, and always has been, one of the most important protections of the separation of powers, without which judicial power becomes completely meaningless, I mean like seriously  on some pre-Marbury shit, so it's one of the most important safeguards we have against violating that separation. Allowing the legislature to influence cases this way is downright incestuous, a distant and obviously legally different kissing cousin to the idea behind double jeopardy as well, if the legislature truly wants to play house like that and act as a quasi-judiciary (although not everyone would agree with this comparison, I know that's kind of a stretch.) \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThe judiciary means absolutely nothing without the absolute assurance of its finality. The judiciary interprets the legislature, and allowing the legislature to have any control at all over a pending judicial action would in effect allow the legislature to interpret itself. I don't have to expound on how dangerous that is. Justifying this decision on the argument that this law is acceptable because it applies only to a specific pending trial rather than its outcome, or other unrelated trials, and only eliminates all of one party's defenses rather than deciding their fate entirely, has the ultimate effect of arbitrarily giving Iran a snowball's chance in hell of exercising the same rights any other defendant would have. It's the legal equivalent of a boxing match where one of the fighters has both of his hands tied behind his back. Not only was this decision an egregious denial of due process to one defendant under a certain docket number, this was done with FIFTEEN OTHER DOCKET NUMBERS. I know they're still salty about the hostage crisis, but opening up a portal between two sources of power designed to be eternally immiscible creates the possibility of applying it to cases involving Americans as well, or really, anyone. The fact that Justice Ginsburg, of all people, wrote the majority opinion is shocking to say the least.\n\nAnyway, what cases have pissed you off the most, and why?",
    "title": "Out of all the cases you've read so far, which one(s) pissed you off the most, and why?",
    "subreddit": "LawSchool",
    "timestamp": 1618680250,
    "score": 38,
    "keyword": "mixed race judge"
  },
  {
    "text": "I've somehow let go of anxiety in terms of finals and idk if it's a good thing or a bad thing (long post srry) **TW: SERIOUS mental health talk (suicide)**\n\nI'm gonna be honest...my first semester of law school has was...not great. I had really severe mental health problems and missed lots of class/haven't read much. I haven't properly prepared for finals either (trying my best though). I haven't got accommodations for my ADHD/physical disability that I'm realizing I need now (fingers crossed for next semester). Everyday I went to class wracked with anxiety because of an overwhelming feeling of not fitting in, of not having any friends, but really my anxiety and insecurities just cause me to self-isolate further.\n\nI realized that with the school I'm at, and with my newly realized career goals (wanted fed gov but DEF don't want it now; goal is labor law/general public defender) that poor first semester grades won't break me. My scholarship is not conditional, so there's another good thing.  I used to have this incessant need to be at the top because I felt inferior because of my ADHD. But I'm realizing that good grades never made me happy, they just made me feel adequate. I never celebrated any of my accomplishments because I just saw those things as expected. While that mentality got me to where I am now, it no longer gives me anything but break-downs. I'm so done with the rat race. I just wanna graduate and help people. I've only wanted to make positive changes in other's life. I just happened to choose law to do that. \n\nI've let go of all idea of \"prestige.\" In placing my own value in my grades and academic prestige, I unconsciously judged others on the same scale. I was horrified when I realized this, and have rejected this mindset ever since. My happiness comes from my fiancée, my cats, my video games, my art, my self-expression through fashion. And I'm gonna be okay even if I'm at the bottom of the curve. I'm gonna be okay. I think this attitude has made my lack of studying worse. But at this point I only have 2 days till my first final. All I can do is cram and hope for the best, and do better next semester.\n\nThis attitude is obviously going to negatively affect my academic performance, at least this semester. But I just can't survive with how I used to think. Not if I want to be happy.  This semester almost killed me multiple times :( I'm grateful that it didn't though. I'm now in therapy, and on new meds, which has made such a difference. This has been a long time coming, and I guess law school was the breaking point. I don't know if I'll be able to keep up this mentality, I've only thought like this for a week lol.\n\nAnyway I guess I just wanna say to everyone that nothing is worth sacrificing your mental health. I just needed to let this out somewhere. \n\nNow I'm gonna go study property byeeee",
    "title": "I've somehow let go of anxiety in terms of finals and idk if it's a good thing or a bad thing (long post srry)",
    "subreddit": "LawSchool",
    "timestamp": 1638845594,
    "score": 17,
    "keyword": "mixed race judge"
  },
  {
    "text": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?) The reactions of black women to this whole Meghan Markle ordeal on this subreddit and Twitter, and on News media have been fairly interesting to me. Would be interested to hear the perspectives of other black women as my opinion might be unpopular going by the views expressed on this subreddit. Personally, whilst I sympathize with Meghan for the racism and blatant discrimination she has faced, I find myself feeling sort of consciously detached to her plight. As a woman of African/Caribbean descent, I find it difficult to wrap my head around as to why any woman of recent African ancestry, or any black woman, would want to marry or be otherwise intricately involved in an institution as racist and colonialist as the British Royal Family. Colonial England, and the BRF, are almost single-handedly responsible for the decimation of African regions and Caribbean countries, which are now part of the Commonwealth and hindered in many ways by this. These people’s ancestors have the blood of her mother’s lineage on their hands. \n\nWhilst I think Meghan is an intelligent woman, I do believe that she was being disingenuous when she relayed her supposed limited knowledge of the royal family, and I believe some of her claims have been disputed by her own friends. Operating under the assumption that what she said is true however, I don’t understand why she didn’t do more research into their colonial heritage and history. The British monarchy, including Harry himself,  are very racist and are symbolical remnants of white supremacy. Price Harry is the man who wore a nazi costume and allegedly denigrated his fellow army-men of color. I find this to be hypocritical and I don’t buy his reasoning that he wasn’t aware of the depths of racial discrimination before meeting Meghan given his family’s history.\n\nI walked away from the interview feeling sorry for Meghan, but feeling that she was very naive and thought that her being biracial/white-passing would somehow aid her. Had Meghan been a fully black, unambiguous black woman of a darker complexion, I seriously think she would not have even been allowed to marry him.\n\nI also take issue with people on here referring to Meghan as black, when she has repeatedly stated that she is biracial, and her experience reflects that of her phenotypically mixed heritage and not that of mono-racial black women. Before I knew of her background, I actually thought she was white. Even Harry thought she was only white when he met her. I’m trying to be open-minded on this point, because I realize that America has a different racial classification system than the rest of the world. I don’t want to be accused of “policing blackness” (although I find it weird that all races but black people can exercise some sort of racial exclusivity) but I do find it slightly bewildering as Meghan, who is ambiguous and white-passing, would be categorized as exactly what she is-mixed/biracial- anywhere else in the world, especially in Africa and the Caribbean. I also take larger particular issue with this as I find that what constitutes a black woman these days are blurred, but not so for our male counterparts. Everyone seems to agree on what a black man can look like, and they are thus aptly represented in the media, but there is a curious leeway for black woken in the media, and I’m starting to see more biracial instead of monoracial media representation for black women and I feel like claiming Meghan as black plays into this. \n\nThis idea that Meghan was going to modernize the BRF is delusional to me and this is exactly the outcome that I expected. Why any black or biracial woman would need to modernize this institution in the first place or add “a splash of melanin” or whatever ridiculous phrase some people are using is lost on me. Why would we need to modernize an institution that oppressed our ancestors? I was surprised that she and Harry stated that after everything, they were still open to working for the Queen and Meghan “representing the commonwealth” (what even...?).\n\nAlso, I find black women claiming Archie is “black” astounding tbh. I hope this is a minority opinion because it makes zero biological sense and is very embarrassing . I have also noticed some BW living vicariously through her, and this has me slightly worried. The majority of women defending Meghan look nothing like her and the people fetishizing this relationship (especially because it may be/is considered interracial) need to stop.\n\nI hope I wasn’t too harsh with my commentary and would be willing to her criticisms/thoughts.\n\nAddition: (unrelated) We may take issue with some things black men do as a collective but some of the black women on Twitter (I see you Monique Pressly) accusing black men of not being supportive enough of Meghan/being the most disrespectful towards her is ridiculous to me. Seriously?",
    "title": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?)",
    "subreddit": "blackladies",
    "timestamp": 1615349273,
    "score": 316,
    "keyword": "mixed race judge"
  },
  {
    "text": "How Black Men Are Discussed on This Subreddit Is Toxic af I am not trying to dismiss what people have experienced. Me myself many times have been put down by black guys which was racist, colorists, or sexist things. It is an experience being both black and a woman and there is intersectionality ignored by feminism, by media, by the LGBT community, and even BLM.\n\nThe thing is I’m confused a lot of the time people dogpile on black men on this subreddit for things when I have experienced much of the same from black women. Are you really telling me colorism, racism, misogyny, and homophobia is one sidely expressed by black men? \n\nI don’t understand about how black men are colorist where Black women can’t be, some of the first colorist things I heard were from my aunt and other black girls. One of my biracial best friends mother told her not to date black men because she does not want nappy headed grandchildren. This is from a dark-skinned black womenI have heard many black girls say they want mixed race kids or someone non-black. But nooo this is just black men right? And not only that it’s weird how Black women in interracial relationships is either promoted on r/Blackladies or side eyed but black men doing are always self-hating and colorist. And their kids aren’t black, relate to black people, they’re mixed not black, that sentiment is not isolating at all to mixed race black people.\n\nWith black men treating black women badly in professional spaces or predominantly white spaces I won’t deny any experiences . There are definitely Black people that purposefully avoid and demean black peoples to gain acceptance in these environments. The thing is are we really going to generalize and say all black men are like this? I have definitely experience reaching out to Black women at professional spaces and being treated rudely in return, but I know not to generalize. Many times it has been easier to befriend women of other races before someone black but ultimately black people are just people to have the chance to be anything, race doesn’t guarantee a friendship from that person or respect.\n\nIt’s so hateful and negative that I feel like unsubbing. It’s weird how a lot of the times people posting about their negative experiences never account for how they chose their relationships or how they come off. A lot of the time they could aloof and uninterested , self-pitying, condescending, and never take responsibility.\n\nIt’s weird how a lot of the people comment that they hate when people generalize black women into stereotypes and we are the most educated and this...but it’s completely okay to avoid black men and stereotype them. Please.",
    "title": "How Black Men Are Discussed on This Subreddit Is Toxic af",
    "subreddit": "blackladies",
    "timestamp": 1636327736,
    "score": 313,
    "keyword": "mixed race judge"
  },
  {
    "text": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media? How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?\n\nOn the bachelor contestants, Taylor Nolan's recent Instagram live, her and Pieper touched on colorism and the mixed race experience. Pieper talked about how being a lighter skinned black woman, racism affects her differently. She talked about how there are nuanced and different levels of racism.\n\nTaylor says she and other light black women (like Pieper) have been portrayed as angry black women. She also talks about how her and other light skinned black people were light enough to get onto the show and be the token black person.\n\nIn my own experience, as a mixed black woman, I think colorism can sometimes allow me to get my foot in the door in white spaces like jobs but I am still watched suspiciously because they assume I will do black stereotypes because of racism (like steal, get angry, be late, be uncivilized and abuse/attack). I remember growing up in the white conservative suburbs and feeling ignored and not considered for dating by white and poc/black boys because I was not white and having a lot of trauma from that. I remember a racist white nurse dismissing my pain and assuming I went in her office to skip class. I remember some white teachers treating me poorly, assuming I had an attitude and not giving me the benefit of the doubt. As a woman, I avoid being in all white spaces... But when I have been, now I have to worry about being hyper sexualized by white men. In liberal white spaces, I worry about being fetishized. When I call a white person out for racism, ask for my needs, am quiet or angry, I am seen as a threat and Intimidating by white people because I am challenging the status quo and not appeasing them. So I definitely have experienced the angry black woman stereotype projected onto me. I also know being a lighter mixed black women other stereotypes may be projected at me such as being seductive, sexual, soft, attractive, intelligent, etc. But that isn't always the case. Sometimes I'm thrown the black stereotypes and other times the mixed race stereotypes, often both.. that's why the experiences overlap for me and I call myself a black mixed woman.\n\n\nHow do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the white media/shows? Do you see any differences in portrayal? Do you think mixed/lighter skinned black women are often portrayed as angry?",
    "title": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?",
    "subreddit": "blackladies",
    "timestamp": 1613577841,
    "score": 122,
    "keyword": "mixed race judge"
  },
  {
    "text": "\"I'm a mixed girl. I just want to be normal.\" If you haven't noticed it, there's a post up on /r/offmychest right now that's gaining quite a bit of karma with the same title. This isn't word play or satire, it's quite literal. Apparently, she really is a \"mixed girl\" who simply wants to be perceived as \"normal\".\n\nOk, I'll admit. I rolled my eyes. I read the title and I immediately rolled my eyes. Even though I'm mother of mixed race children and come from a mixed lineage myself I rolled my eyes.\n\nBut then I took off the Petty Crown, scolded myself for being judgemental, opened the link and got to reading. \n\nI heard her out. I thought about how I would feel if one of my kids were upset because they felt \"abnormal\" and I heard her out. And now I'm struggling, desperately to RESPECTFULLY pen my reaction. I'm not sure if I'm going to succeed, but here goes. \n\nI'll start with a few points I've gathered from her post:\n\n1. \"Normal\" is White. Or at the very least, not Black.\n\n2. She believes cultural appropriation is a myth. \n\n3. The feeling of \"normalcy\" she apparently craves reads much more like \"acceptance from 6f people who don't see color and have lots of \"ethnic\" (abnormal) friends. \n\n4. She is completely removed from her Black side of her family and has no contact with them. I'm not sure if her Black parent abandoned her but she's expressed that she has no ties to them and therefore is frustrated at the fact that she (at times) is percieved as a part of their ethnic group. \n\n5. She seems to have a disdain for African American culture in general. \n\n6. She believes her perceived Blackness is negatively affecting her artwork and how it is recieved. \n\nThere is so much more, I'm just already exhausted with this list.\n\nAt the beginning of her dissertation she recalls an incident where a guy accuses her of \"Looking like the type of person that would accuse someone of appropriation for copying her rat's nest of a hairstyle\". Her disdain isn't aimed at the guy that called her hair a \"rat's nest\". Nor is it aimed at the way he trivialized cultural appropriation (She doesn't belive it exists, remember?) Her disdain apparently stems from being grouped with... us. The audacity. \n\nShe goes on to explain how tired she is of being made to feel that she should have to identify as one of us and research our culture. \n\nIn her own exact words:\n\n\"I am not my race. I am tired of being boiled down to my race by others. I hate having personality traits assigned to my perceived ethnicity.\n\nI wish I was normal and my ethnicity wasn’t a freaking talking point and a major part of my being. It sucks, honestly.\n\nI hate how some people assume I’m some sort of pity seeking, race-baiting asshole because of how I look. I’m just a person, with my own personality. I’m not a statistic.\"\n\n\nHave you ever read something so audacious and absurd that you just placed your phone down and blinked silently at the cosmos?  \n\nHow does one begin to unpack this level of self hatred and dissonance?\n\nIf this sentiment was ever expressed by my own kid I would feel like a complete failure as a mother. I'm talking cry in the shower, 'how could I have let this happen to my baby' type of failure. \n\nI don't really see a point in dissecting this any further or even criticizing her mentality because I don't see that making a difference. Instead, I'd rather make this post a  cautionary tale; to biracial people and parents of biracial children who are half Black. \n\nDon't. Be. This. Guy. \n\nI implore you, if you feel even a smidgen of this sentiment, talk to someone. Talk to your Black parent or a trusted Black relative. Talk to somone educated on Black issues. Talk to someone here. Hell, talk to me if you have no one else... I'll listen. But for the love of cocoa butter, do not DO NOT let yourself sink into the sunken place by relying on mainstream reddit to comfort you in your time of ~~ashiness~~ need.\n\nDammit. I tried.",
    "title": "\"I'm a mixed girl. I just want to be normal.\"",
    "subreddit": "blackladies",
    "timestamp": 1618017484,
    "score": 116,
    "keyword": "mixed race judge"
  },
  {
    "text": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota) It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)\n\nI just saw this picture showing Minnesota is one of the most racist states in the country---so validating (see link below). I knew MN racism was really bad at my core but you get gaslighted so much here that you start questioning your reality. People act like there is no racism here because \"people are so nice.\" White fragility is real here... like narcissists, white people act racist, deny it, make themselves the victims, then put the blame on you. They are so passive aggressive that the racism is so subtle, ex: moving away from you out of fear like you are this big threat. I am a woman and I've learned to keep a lot of physical distance from white women and to not make eye contact---which by the way, is super offensive as a feminine woman. If you aren't going out of your way to be super friendly and make them comfortable, you are a threat. I have had my own white relatives act suspicious of me for visiting and trying to get to know  them. I have always felt so isolated being a higher educated middle class black mixed woman. I've been treated as a criminal by my own employers. One time I walked into my first therapy job and the co-workers spoke to my white supervisor instead of me---they were so shocked and uncomfortable when they found out I was the therapist. The social class and job discrimination is so strong here, they are shocked to see professional black people. Being around all this white supremacy makes you question yourself and internalize their messages... You question your sanity, if you are bad, the problem.. when really they are the problem. They have the history of stealing and killing all groups of people for centuries but somehow they see themselves as the victims. White narcissistic delusion.\n\nThere also isn't much of a community of black professionals. From my experience, there are a lot of black (especially mixed) people who are in denial and will gaslight you about racism, too. I have had a lot of bad experiences with mixed black people who are in denial of their blackness, talk about how they pass for other races, and allign with whiteness. They distance themselves from their blackness and some seem delusional because they do not see that they do look part black.\n\nIt seems like the black/mixed people who make it to the top are the ones who have assimilated, have internalized racism, are not unified with other black people, and have had to swallow the racism they have had to experienced. I could not do that for long without it eating me up. I spoke up for myself and others. As humans, we are not supposed to be abused and just take it.. but somehow as black people, white people see us as less than human and think we are immuned and should just take it.\n\nI am burnt out. I barely leave the house. White people are everywhere here and I don't trust most. When I am around them, I dissociate to avoid feeling the pain of all of their violent \"microaggressions.\" Thankfully for now, I work at a black business. Moving out of this state is mandatory for my sanity. I wish all black people could leave as well. It is hard to succeed and progress here without losing a part of yourself. At least I know I managed to survive (and suceeded educationally and built resiliency) one of the most racist states, it can only get better from here as I move on to a more equitable state.\n\n[Racial Disparity MN pic](https://www.zippia.com/wp-content/uploads/2020/02/racial_disparity_map_worst_states.jpg)",
    "title": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)",
    "subreddit": "blackladies",
    "timestamp": 1620570249,
    "score": 70,
    "keyword": "mixed race judge"
  },
  {
    "text": "I need to vent to other parents of mixed race children As a person of color in a very white, old fashioned, trump loving town, I’ve just had it. I’m leaving this town soon enough, thank god, but it’s been hell. I’ve learned to avoid all other moms by this point. My daughter is in kindergarten and she looks almost completely white. I’m asian. People treat me like I don’t exist. They will talk to my FIVE year old before they even talk to me. After school, the moms gather and arrange their play dates and they treat me like I’m some random nanny. There have been times when assistant teachers greet every single mom and then they don’t even look at me, or they look at me and then proceed to take my daughter from my hand without saying a word to me. \n\nI’ve been to play centers where some people just stare at me until I stare back at them and they make some stupid excuse like “omg your daughter looks just like you.” someone literally said that and I had to pretend I actually believed that horseshit. Even if it were true, like way to point out how strange you thought it was that an Asian woman could look like her mixed race daughter?\n\nI’ve tried to avoid any social interaction whatsoever at this point. But I have to take my daughter to a bus stop where this white lady keeps trying to make conversation with my child who does not have any interest in talking to her. I try to make it less awkward by talking whenever my daughter doesn’t respond but I’ve noticed that this lady doesn’t want to talk to me. She specifically only talks to my daughter. Don’t you think this is just weird? Most moms talk to one another other in these scenarios while the kids play. \n\nI honestly did not even want to believe that this shit was happening. But it happens all the time. I’ve lived in this town for 4 years and I’ve had enough. I have never considered myself different from my own child in any way but this town has made me see the difference.",
    "title": "I need to vent to other parents of mixed race children",
    "subreddit": "asianamerican",
    "timestamp": 1632799843,
    "score": 223,
    "keyword": "mixed race judge"
  },
  {
    "text": "Asian Americans Who Fought During the U.S. Civil War Did you know that 58 Asians fought in the U.S. Civil War?\n\n&#x200B;\n\n[Private Felix Balderry of the 11th Michigan](https://preview.redd.it/4smau7ank1q61.jpg?width=336&format=pjpg&auto=webp&s=0d39e63c5f600e9f381bdf6c5534cae23f344ce7)\n\nPictured here (above and below) is Private Felix Cornelius Balderry. He was a Filipino who came to the United States as a sailor aboard a ship commanded by Captain Joseph Foster of Leonidas, Michigan. After Captain Foster retired from the sea and settled on a Michigan farm, Felix joined him as a farmhand. In December of 1863, he joined the 11th Michigan Regiment just in time to take part in General William Tecumseh Sherman's Atlanta Campaign. As part of this campaign, the Union Army followed a scorched earth policy. They burned fields and houses, razed businesses, and destroyed railroad tracks in an effort to destroy the South's will to fight along with their ability to resupply the Confederate forces. The 11th Michigan was involved in several skirmishes and battles throughout this campaign.\n\n&#x200B;\n\nhttps://preview.redd.it/j5pob2tpk1q61.jpg?width=445&format=pjpg&auto=webp&s=00ee409d82fdb17c11ee56f976973fd03386eb37\n\nPrivate Balderry served through the end of the war and was mustered out of service in September of 1865. He subsequently returned to Michigan where he worked as a tailor. In 1885 at the age of 39, he married a 16 year old girl named Ada May Barns in Constantine, Michigan.  He died of  tuberculosis in 1895 at the age of 49.\n\nThis is Corporal Joseph Pierce of the 14th Connecticut. At the age of ten, his father sold him into slavery to Amos Peck, a sea Captain. He was nicknamed \"Joe\" by the crew. The Captain later gave him the family name of \"Pierce\" in honor of President Franklin Pierce. Although he was technically a slave, after the two month sea voyage from Canton, China to Hartford, Connecticut, he was raised as a family member of the Peck household.\n\n&#x200B;\n\nhttps://preview.redd.it/golha4brk1q61.jpg?width=385&format=pjpg&auto=webp&s=7b29fff77eaac2c588e8224527746bafa846aad3\n\nIn 1862 he enlisted in the 14th Connecticut Regiment. The 14th was part of the Second Army Corps in the Army of the Potomac. Joseph Pierce has the distinction of being the only Asian to have fought at Gettysburg. During his time in the Union's service, Joseph Pierce fought in 34 battles and skirmishes.\n\nAs a result of his bravery at Gettysburg which included voluntarily joining a skirmish line that had advanced on the Confederates, he was promoted to Corporal on November 1, 1863. While this rank may not be considered very high, it should be remembered that the Union had a segregated army. Black men served in black regiments that were commanded by white officers. Since Asians were largely unknown in the United States, people didn't know how to classify them. Some thought that Asians were mulattos (of mixed race ancestry). Others thought that they might be Native Americans. The fact that Corporal Pierce was actually given rank over subordinate white privates was really quite astounding given the time period.\n\nCorporal Pierce served with the 14th Connecticut until the end of the war and marched with his regiment during the \"Grand Review\" in Washington, DC on May 23. He was mustered out of the army on May 31, 1865.\n\nAfter the war he returned to Connecticut where he worked as an engraver for a silver company. In 1876 he married a woman named Martha Morgan from Portland, Connecticut.\n\nHe died on January 3, 1916 at the age of 73 in his home.\n\nAnother Chinese who served in the Civil War was Edward Day Cahota. At the age of 4, he was found with an older 6 year old boy as stowaways on an American merchant vessel that was commanded by Captain Day. The children were starving and did not know their names. The older boy died just two days later and was buried at sea. The Captain named the younger child Edward and in time Edward became a cabin boy.\n\n&#x200B;\n\n[Edward Day Cahota](https://preview.redd.it/rptamw4tk1q61.jpg?width=147&format=pjpg&auto=webp&s=10f42c86cdf3339b46d1f3f1e2a63d789b8f1f05)\n\nWhen Captain Day retired, he brought his cabin boy home with him to  Gloucester, Massachusetts . When Edward insisted upon having a third name, he took the name Cahota which was the name of the ship that he had served upon.\n\nIn 1864, Edward Day Cahota joined the 23rd Massachusetts Infantry. After mustering out of the army at the end of the Civil War, he reenlisted in 1866 and fought in the Indian campaigns. One of the more memorable experiences he had during his time in the western service was when he stood guard over Chief Sitting Bull. He told his family that the chief was really quite friendly. It should be noted that Chief Sitting Bull led the Western and Northern Cheyenne at the Battle of Little Bighorn in which General George Armstrong Custer and the 7th Cavalry were surrounded and slaughtered in 1876.\n\nEdward Cahota died on November 18, 1935 and was buried two days later at Mt. Hope Cemetery in Valentine, Nebraska. One of his dreams that was never realized was to become a citizen of the United States. Despite having served in the Army, he was ineligible to become a citizen after the Chinese Exclusion Act was passed in 1882.\n\nIt's estimated that 58 Asians fought in the U.S. Civil War. While most of them fought for the union, at least two fought for the Confederacy. Picture below are Chang and Eng Bunker. They were Siamese twins who came to the United States to join the PT Barnum Circus. After leaving the circus they settled in North Carolina where they married two white sisters. They lived on a farm and were slave owners.\n\n&#x200B;\n\n[Chang and Eng Bunker](https://preview.redd.it/q067sopvk1q61.jpg?width=406&format=pjpg&auto=webp&s=9e034a2eff384795d3187e3187be0b3c9aa419ff)\n\nWhen the Civil War began, two of their sons, Christopher and Stephen joined the Confederate Army. Since they each had horses and all of the associated gear, they served in the 37th Virginia Cavalry.\n\nIn 1864, Christopher Bunker was wounded and captured in a skirmish at  Moorefield, West Virginia. He was sent to Camp Chase which was outside Columbus, Ohio. Camp Chase was the largest Federal POW camp in the United States.\n\nThe Union didn't spend much money on Confederate POWs. Christopher was housed in a crowded barrack with 197 other prisoners. The union's rations were so meager that at one point, Christopher and his fellow prisoners were reduced to eating cooked rats. On March 4, 1865 he was freed as part of a prisoner exchange between the Union and Confederate forces.\n\nAfter the war, he and his cousin Stephen returned to North Carolina where they resumed farming albeit without slaves since all slaves had been emancipated during the war.",
    "title": "Asian Americans Who Fought During the U.S. Civil War",
    "subreddit": "asianamerican",
    "timestamp": 1617057006,
    "score": 24,
    "keyword": "mixed race judge"
  },
  {
    "text": "#WeArePeopleToo: A Proposal for a New Movement Hi everyone, this is my first post ever on Reddit despite being an avid Redditor. I apologize if I lack any specific Reddit-based decorum when it comes to making a post. I will definitely get better with time!\n\nMy name is Dae and I'm an NYC public school educator in my late 20s. I am a mixed race male and would like to share my story as well as establish my thoughts on a movement to better represent us as mixed-raced humans of the world.\n\n**My Story**\n\nI was born to a Trinidadian mother and a Korean father. As a result of their marriage, my father's side of the family became estranged and cut ties with us. As a result, I have only managed to forge a relationship with the Trinidadian side of my family. I grew up in a fairly Republican/Conservative area of NYC (Staten Island) in which white people were the majority.\n\nMy parents loved me but they had no idea how to deal with raising a multiracial son. They were stern and strict and did not believe in a coddling love. They did, however, believe in the merits of education and made sure that I knew to bring the best grades home. In school, other students stayed away from me. They were polite as young children but they often ostracized me and left me out of activities. At the time I didn't know it was because of how I looked but with time I began to see the relationship. I learned the power of being a fool, of being self-depreciating. As people laughed at me, I saw it as their acceptance. What I had actually done was prime them to note my difference, my mixed-race status, as being something comical, something to decry, deride, and deplore.\n\nI became the class clown and stood to make problems for the sake of other's entertainment. Teachers began to hate me and associate me as a problem child. They suggested mental and learning disabilities despite my high grades due to my parents and their iron fist approach to education. With every letter home, phone call, parent-teacher conference, I would receive a beating from my parents. Slaps in the face, beatings with belts, name calling, screaming in a child's face, bruises on my body. All done for the sake of being accepted by my peers. All for the sake of being loved by someone. I learned that people who love you are allowed to do whatever they want to your body so I let others do what they wanted to me. Friends treated me like a punching bag. At the age of 8 my 13 year-old babysitter blackmailed me into allowing her to rape me. I said nothing, scared more at the idea that I would be in trouble if people knew I had sex because I knew enough to know sex was wrong.\n\nBy the time I was 12 in middle school, I had tried to hurt myself for the first time. I was taken to the guidance counselor because I had told a friend who, doing the right thing, told an adult. In the process, I was treated like I was crazy. I was threatened to be committed because I was a danger to myself. All of this made me feel *different* and I already knew *different* was bad. I knew because of how I felt when people told me I was different. \"What are you?\" \"Who is black?\" \"How did that happen?\" \"Are you \\_\\_\\_\\_\\_\\_\\_\\_?\" The looks of confusion. Even worse was the looks of incredulity, like the fact that I existed couldn't be real. People, regardless of their own race, made me feel so ugly. Ugly because I was different, unique, and beautiful because of my uniqueness.\n\nI knew my parents' union was odd because people told me that. But I didn't know the history of miscegenation in America. I did not know that it was once a crime to be us or to engage in a union that results in the creation of one of us. What I did experience, however, was fetishization as I grew up and became sexually active again. I had a hard time finding someone who thought we had enough of a connection to date one another. When I did, I immediately agreed to date them, I was thirsty for love and affection. But this love was ugly too because it was different. This was even present in friendships. I had friends who told me they would only date black girls because they were black and wanted to have black babies. I had friends who told me I was smart because I was Asian and knew some rap and had rhythm because my mom was Black.\n\nMy girlfriends never, ever brought me home. I was a secret, forever to be hidden. I grew attached to a concept that white girls were the most beautiful. This was partially because of where I grew up but also out of jealousy. White people had such an ownership of their heritage. They knew what they were and forged relationships based on those identities. I wanted so badly to be white. I told my mother that I liked white girls and that in my next life I'd like to be white because they rule the world. My hatred of my blackness stemmed from the fact that society deemed black inferior which led me to believe that my blackness was probably why my interactions with society were so awful. If only I were fully Asian or White and had no blackness to me. I didn't realize it was just because I was mixed. The one girlfriend who took me home only told her family I was Asian. During the death of Eric Garner on Staten Island as racial tensions spilled out onto the streets, I visited her family and had to grimace as they joked about, \"Hands Up, Don't Shoot\". She said nothing. She did nothing. I didn't expect her to.\n\nMy life spiraled out of control as I got older and race became more important as a qualifier in making connections with people. I fell in deep love with a girl from a family who practiced the Islamic faith. She had difficulties accepting her role in the religion and found solace in me, a person with no ties to any culture because my culture was so shattered by my being multiracial. She would often tell me how \"cool\" it was that I was Black and Asian. How \"attractive\" it was. I didn't know what she was doing was fetishizing me, I was desperate to believe she loved me. After a few years, the relationship fell apart and, again, it was because I was different. This time, however, I knew it was because of my race. I never hated myself so much in my life. I cursed myself and my family, I wished I could be one thing.\n\nI drank a lot after the breakup. I wanted to die. I woke up face down in the gutter one night after binge-drinking. I tried to slice my wrists in my backyard, then I tried to fall on the knife. I tried to jump off the overpass by my house into traffic. I wanted my death to be certain. I gained so much weight my heartbeat became erratic. I was smoking a pack a day and developed a wheeze. I hated myself, I needed to punish myself. I fought my father, I ran away from home and became homeless. I hurt and hurt and hurt because love seemed impossible because acceptance was impossible.\n\nI became a teacher. First in Bed-Stuy, Brooklyn where my students, forever ready to curse me out and let me know when I wasn't being \"fair\", accepted me. Almost instantly. They asked what I was, were relieved when they heard \"Black\" because they knew we shared something common, and then made me one of their own. They joked with me, told me gossip, shared their fears, shared their dreams and their emotions. They asked me to share my stories and for the first time, **ever**, someone wanted to truly know me. Now I teach in the South Bronx where my students have yet to ask me what I am. Because it does not matter to them.\n\nI began a journey to heal. I lost weight though exercise, something I was so hesitant to do because I hated myself and wanted to die. I took a road trip from NY to Georgia, across to New Orleans, Louisiana then to Texas, then Cali. I got to see the Pacific Ocean and looked across to imagine my father's country. We drove back and I was refreshed with a new look on life. I educated myself on race relations in America as BLM became a massive presence following the death of George Floyd and learned to love my blackness. I attended my first protest on Staten Island with BLM and learned the importance of being outspoken. I learned to love myself and I learned how to share that love with others. I challenged my perceptions of education and decided to dedicate my life towards bringing a sense of ownership when it comes to science for BIPOC students. By providing students with a more hands-on experience, they learn that science is a gift for all humanity in the form of a community, one that it is honorable to be a part of. I have since been selected to work on a committee that brings more diversity toward l\n\n**The Movement**\n\nThrough my research, I have become extremely disillusioned with the lack of support provided to people of mixed race. I grew up with no one to turn to, no one to help me unpack the burden of being an oddity to society. I left social media, angry, vowing to never use it again because I didn't want to interact with a society that could not accept me. I likened it to being desperate, to chasing the desire to belong to something that has no desire to accept me.\n\nI fell upon Beverly Daniel Tatum's national bestseller, \"Why Are All The Black Kids Sitting Together In The Cafeteria?\" and noted that it was revised and updated. I had never had interest in reading this book before, despite it being mentioned in conversations with friends, teachers, etc. I did not belong to the black culture and so social issues of segregation were particularly damning to me. How could I sympathize with a culture that told me I wasn't black or black enough? At least they had one another in their culture to lean on. I had no one, I felt. In the revised edition, Dr. Tatum places attention to the role that Multiracial families bring to a discussion of race relations in America. Yet, in one fell swoop, she manages to disenfranchise me and other mixed-raced people, \"Given the unique historical and contemporary context, it is the biracial identity development of children of Black and White parents that I will focus on here.\" (Tatum, 304) I was not even enough to garner attention by a champion of Civil Rights and Equality in a book that was groundbreaking in its ability to unpack race relations in my country. I began to wonder how many other mixed-race people felt this way.\n\nI realized that we are under-represented and our lack of support allows us to be targets for confusion. It is this confusion to what we are, to how people treat us, that results in self-hatred, self-depreciation, self-loathing, and self-harm. And we cannot wait for others to be our voice because we are in need. As more attention is being placed towards identifying racism throughout the world, we need to be vocal, we need to stand to let people know: WE ARE THE DISENFRANCHISED TOO. WE ARE PEOPLE TOO.\n\nAnd that has been the movement I've been slowly pushing over social media. I want it to take off. I want us to unify and represent a community that has lacked a true community for so long. #wearepeopletoo\n\nAs people, we deserve to be treated like others. This means we deserve the freedom to be equals in society. We deserve to walk down the street or to make a new friendship without being asked for our race or ethnicity because #wearepeopletoo. We deserve to love and be loved not fetishized because #wearepeopletoo. We deserve to feel like we belong in our families, in our schools, in our government, in our country because #wearepeopletoo.\n\nRight now, the movement is just a hashtag. But even the largest movements begin somewhere. I will not pretend to know what I am doing. I will not pretend to be a leader or to stand as someone to look up to. I believe that this movement needs to be decentralized. No single leader, just a group of people, human beings, who see the need for a change. Right now I am using IG to push the hashtag but I want to begin moving to other platforms, putting out writing, establishing a website. I hoped we could establish [r/mixedrace](https://www.reddit.com/r/mixedrace) as a basis for a headquarters or begin to discuss a place to brainstorm. I stand with all people of the world and I want them to begin to see us as people too. #wearepeopletoo I know I need help, I need teammates and a community to support and be supported by. Even now as I tell people my idea for this movement they tell me I am being divisive, that I am causing more division in the world. But this was division that was forced on me, not one that I created. My goal is to end this division. I share that belief, that one they call utopic, that the world will be better when we see ourselves as one race: the human race.\n\nThank you for hearing me out,\n\nDae",
    "title": "#WeArePeopleToo: A Proposal for a New Movement",
    "subreddit": "asianamerican",
    "timestamp": 1614137067,
    "score": 13,
    "keyword": "mixed race judge"
  },
  {
    "text": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "title": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "subreddit": "MensRights",
    "timestamp": 1636492585,
    "score": 383,
    "keyword": "mixed race judge"
  },
  {
    "text": "Katty Perry kisses a boy in the lips without consent, no-one cares about the boy thoughts. I saw this post in Quora, with 164k upvotes, and it really gave me faith in men's rights. Credits to Zee Hamid - Quora.  \n\nReally worth the read. \n\n\n\"A teen girl tells an older man in power she has never been kissed. “I want it to be meaningful and am saving it for a real relationship,” she adds. \n\nShe is from a conservative family and the first kiss carries a lot of significance for her. \n\nThe man ignores it and puts the girl in an uncomfortable position by asking for a kiss. The girl, pressured, goes to kiss the cheek but the man turns his face last second to kiss her on the lip without her consent. \n\nThe girl, shocked, literally falls back to the ground. The man laughs. \n\n**Sorry, I mixed up genders.**\n\nThis 19-year-old American Idol contestant, Benjamin Glaze, comes from a conservative family. He tells judges he has never had a kiss because he is saving it for the first meaningful relationship. \n\nBenjamin Glaze actually has a girlfriend, but he doesn’t feel it’s a real enough relationship yet, and he has chosen to wait. \n\n“I have never been in a relationship and I can’t kiss a girl without being in a relationship.” \n\nThat should’ve been the end of it, but Katy Perry calls him up for a kiss. \n\nHe is obviously uncomfortable. He hesitantly comes up. \n\n“On the cheek?” \n\nHe uncomfortably kisses her on the cheek and she mocks him saying it was not a real kiss. She asks for another. \n\nAnd as he goes up, she turns her face to kiss him on the lip after he has explicitly told her that he does not want to be kissed unless he is in a relationship. \n\nDo other judges call her out? Hell no. They laugh and she cheers. \n\nRecap:\n\nThe contestant has just been sexually assaulted. His boundaries were violated. His wishes were ignored. He was tricked into kissing when he explicitly said he wasn’t ready. His consent wasn’t taken.\n\nAnd people laughed like it was a joke.\n\nNot understanding or respecting people’s boundaries, and not seeking consent, is what’s wrong with society today. Laughing about it, esp. when it’s something that happens to a man, makes it worse. Sexual assault isn’t a problem when it happens to women, it’s a problem when it happens to anyone (male, female, trans, whoever).\"\n\nOriginal post (with pictures): https://www.quora.com/What-is-wrong-with-our-society-today/answer/Zee-Hamid-2?ch=10&oid=76417423&share=55b4f509&srid=h5l9iu&target_type=answer",
    "title": "Katty Perry kisses a boy in the lips without consent, no-one cares about the boy thoughts.",
    "subreddit": "MensRights",
    "timestamp": 1637057917,
    "score": 331,
    "keyword": "mixed race judge"
  },
  {
    "text": "Men on the receiving end of obnoxious mixed messages in the dating world This is a longish and not particularly original rant.\n\nClearly some of us just aren't cut out to take on the masculine role, but at the same time much of the problems  awkward men's are facing with dating are because the insane mix of expectations affecting all men in general.\n\nWe're expected to initiate, every goddamn time,  be assertive and act on desires that are simultaneously considered  'problematic' or threatening if they happen to be unreciprocated.\n\nForced into making moves within the narrow schedule women expect,  without hesitation or hint of insecurity. Any misstep judged in the harshest manner possible. Ask women out too early and you're a creep who \"objectify\" them by focussing too much on appearance; too late and you're a creepy Nice Guy faux friend who tried to get in close proximity through feigning friendship.\n\nAnd worst of all: Expected to 'just know' when to escalate things physically without any clear rules around when to seek verbal permission or what counts as permission in its absence. Surprise... it turns out many women don't actually like to be asked all the time, or think it's lame, submissive beta type behaviour.  Then there's the opposites for whom there are no innocent mistakes. So you have this bizarre mix of values were women describe how they stopped dating  some guy because he tried to hold their hand too soon, while others complain about men being too passive and not aggressively pushing for sex.\n\nSame goes for feminist subs.  Odd how the particular gender role of who approaches is never questioned.  Real Men get over their issues, we're told,  learn how to talk to women and play the masculine role perfectly while still respecting  (vaguely articulated) boundaries at every point.\n\nAdd to this, almost no consensus beyond the obvious (assaulting someone incoherent drunk, unconscious, clearly not into it. etc) No guidelines, only context based judgements that vary  between individuals.   And no one willing to acknowledge the large numbers of women who don't give a damn about enthusiastic consent as a standard and would prefer men be exciting and unpredictable.\n\nI've come across women who won't judge for minor faux pas and generally sympathize with what it must be like to initiate, but they don't control the narrative.\n\nWho needs it.  That's the attitude I'm getting from guys now.\n\nIn my workplace (university campus) I see this group of them in their mid-late 20s, some with Master's degrees, spending what remains of their youth in low stress casual positions. I tried talking to a couple of them about why exactly they're coasting, why they're still single etc. and the answer usually goes: something.. something.. too much hassle.\n\nI mean why would you serve yourself up to be judged by someone  with obvious issues of their own? Many women have a  tendency to lash out at and pillorize men they aren't attracted to, to make them  somehow symbolic of the  bad experience they had in the past with other men.  It's  become  a  too risky proposition  for those who aren't blessed with  appearances and confidence.\n\nThey'll be a largish group of them getting to their 30s without a lick of experience and all sorts of downstream consequences with depression and people ditching career goals. Think incels are a problem now?",
    "title": "Men on the receiving end of obnoxious mixed messages in the dating world",
    "subreddit": "MensRights",
    "timestamp": 1619255065,
    "score": 176,
    "keyword": "mixed race judge"
  },
  {
    "text": "\"Promiscuous women are labeled as sluts but promiscuous men are called studs\" debunked. The myth of the sexual double standard. There's this common misconception that many people: they believe that promiscuous women are called sluts and promiscuous men are called studs. This isn't really that true. It's mostly a myth. It's just something society says is true but society isn't right about everything. The best evidence people have for this is anecdotal evidence (and anecdotal evidence is NOT evidence because anecdotes can vary and aren't generalizable).\n\nEmpirical evidence research has been conducted for whether this double standard exists or not. Although some empirical evidence shows there's indeed a double standard, a lot of empirical evidence, more often than not, shows there isn't any double standard at all. Both are stigmatized.\n\nAccording to \"[Sexual History and Present Attractiveness: People Want a Mate With a Bit of a Past, But Not Too Much](https://www.researchgate.net/profile/Steve-Stewart-Williams/publication/306518734_Sexual_History_and_Present_Attractiveness_People_Want_a_Mate_With_a_Bit_of_a_Past_But_Not_Too_Much/links/59e160990f7e9b97fbe2bd29/Sexual-History-and-Present-Attractiveness-People-Want-a-Mate-With-a-Bit-of-a-Past-But-Not-Too-Much.pdf?origin=publication_detail)\":\n\n>Other research has addressed the issue of whether there is a weaker form of the sexual double standard in the west, such that some past sexual activity is acceptable for both sexes but promiscuity acceptable for men only. Again, the evidence is mixed, with some studies finding evidence for this asymmetry but others finding none. O’Sullivan (1995), for instance, pre- dicted that women with high numbers of casual sexual partners would be evaluated more negatively than men but did not find any such difference. Similarly, Allison and Risman (2013) found that around 48% of college students lost respect for both sexes equally if they hooked up “a lot,” 27% lost respect for neither sex, 12% held a traditional double standard, and 13% held a reverse double standard (i.e., lost more respect for men than for women; see also Kreager & Staff, 2009; Mark & Miller, 1986; Marks & Fraley, 2005).\n\nIn a [2005 study](https://link.springer.com/article/10.1007/s11199-005-1293-5) of 144 undergraduate college students and 8,080 online users, participants looked at experimental targets described as either male or female and as having a variable number of sexual partners. Targets were more likely to be viewed negatively as the amount of sexual partners increased, and this was the case for both male and female targets. In the abstract of [*The Sexual Double Standard*](https://sci-hub.st/https://doi.org/10.1111/j.1471-6402.1998.tb00173.x) (1998) by Margaret Gentry, Gentry wrote:\n\n>The sexual double standard posits that men have greater sexual freedom than women, and that society accepts and tolerates from men certain sexual behaviors, such as premarital or extramarital sex, that it does not from women. After predicting the demise of the sexual double standard following liberalization of sexual attitudes and behaviors in the 1960s and 1970s, researchers are still debating the status of the sexual double standard. Has the sexual double standard disappeared in the United States? If it continues to operate, does it do so in its traditional form or in a more subtle form? Empirical support can be found for a variety of answers to these questions; however, most of the studies have failed to provide strong evidence for the operation of a traditional sexual double standard.\n\nGentry's research of 111 undergraduate college men and 143 undergraduate women revealed ***no*** proof of a sexual double standard where promiscuous men are viewed positively but promiscuous women are viewed negatively.\n\nAccording to a [1996 Spokesman-Review article](https://www.spokesman.com/stories/1996/feb/18/double-standard-myths-debunked/):\n\n>Lucia F. O’Sullivan surveyed 256 young men and women on their attitudes toward men and women with varying levels of sexual experience. Both men and women described as having more sex partners were judged as being significantly less well-adjusted, less moral, more aggressive, “less desirable as a dating partner and less desirable as a spouse” than people with less sexual experience, O’Sullivan wrote in the journal Sex Roles.  \n>  \n>Her research is just the latest in a series of studies that cast a skeptical eye on notions of a sexual double standard. It echoes, for example, the results of another study. In this one, of 750 students at three universities, it was found that men and women rated sexually experienced men as being less desirable as friends or potential husbands than those who had fewer lovers. Likewise, both sexes rated more promiscuous women as poorer bets as pals or wives.\n\nAccording to \"[The Sexual Double Standard: Cultural Myth or Influential Script in Relation to the Sexual Assertiveness of Men and Women in Two Generational Cohorts?](https://curve.carleton.ca/system/files/etd/ef7e7927-7ded-4f80-9a10-fa1165050bcb/etd_pdf/348e02fe1ff005eeedd4e0347fdd130a/austin-thesexualdoublestandardculturalmythorinfluential.pdf)\" by Carol Anne Austin:\n\n>According to the sexual double standard (SDS), men and women are scripted to express differing levels of sexual assertiveness (SA). However, the effects of this script may be changing with fewer individuals directly implementing the SDS when making judgments about the sexual behaviour of others; yet most still believe in a societal SDS. Analysis was conducted on 339 heterosexual men and women of two age cohorts (18-25 and 35- 42). Consistent with past findings, rates of belief in the SDS were higher than rates of implementation. Belief in the SDS predicted higher levels of SA in women of the older cohort only and implementation of the SDS did not predict levels of SA in any of the groups. The continued impact of the SDS on sexual behaviour is of interest to sex therapists and educators, as it has been known to influence sexual coercion, safer sex practices, and sexual satisfaction.  \n>  \n>Individuals' belief in a societal sexual double standard is thought to be independent of the way people actually evaluate one another, thus implement the sexual double standard (Marks & Fraley, 2005). Rates of belief in a societal sexual double standard are high, yet observed implementation of the sexual double standard is lower now than in the past (Marks & Fraley, 2005). That is to say, individuals themselves still believe in a societal sexual double standard (i.e. perceptions of others in society endorsing the sexual double standard), however they no longer seem to implemented the sexual double standard when making judgments on others (Milhausen & Herold, 1999, 2001).  \n>  \n>The purpose of this investigation was to explore how belief in a societal sexual double standard, and direct implementation of the sexual double standard when making judgments on the sexual behaviours of others, uniquely influence the sexual assertiveness of men and women of differing generational age cohorts. Belief and implementation of the sexual double standard were determined to be distinct constructs that vary independently. This means that an individual can believe a sexual double standard to exist in current culture, yet not use such double standards themselves. Consistent with past findings, rates of belief in the sexual double standard were found to be higher than rates of implementation.  \n>  \n>Overall, little evidence of implementation of the sexual double standard was observed in the study. Mean responses to the BI scale supported minimal implementation as the average response on the BI-implementation subscale was 'disagree' to statements regarding the participants' perception of their own implementation of the sexual double standard. This is consistent with past research that found low rates of implementation of the sexual double standard (Marks & Fraley, 2005; Milhausen & Herold, 1999). This finding is in line with newer experimental research on the sexual double standard which consistently finds little evidence of continued implementation of this script.\n\nAccording to \"[The Effects of Sexual Permissiveness, Target Gender, Subject Gender, and Attitude Toward Women on Social Perception: In Search of the Double Standard](https://sci-hub.se/https://link.springer.com/article/10.1007%2FBF00288320)\":\n\n>The primary purpose of this research was to probe the existence of a sexual double standard, by which perceivers give more negative evaluations to female than to male targets at equal levels of sexual permissiveness. In general, little evidence was found for a double standard of this sort. While sexual permissiveness affected ratings, it generally affected the ratings of male and female targets similarly. The only possible evidence for a double stan- dard in social perception came on the sexual and agreeable scales, and here the evidence was somewhat equivocal.\n\nMany people might argue that because participants might hear that there's a double standard, many might not admit to having a double standard favoring promiscuous men due to social desirability response bias. Some of the empirical research used methods that deter this limitation:\n\n>Another possible explanation for the low rates of implementation of the sexual double standard found in this study may be that the participants answered the surveys in a biased manner due to social desirability effects. That is, the participants may have attempted to answer in a fashion they considered to be socially desirable (i.e., not using double standards in the evaluation of the sexual behaviour of men and women). Social desirability is a common limitation to survey research (Philips & Clancy, 1972); however measures were taken to attempt to reduce the social desirability effects in this research. It was thought that the use of online survey for data collection in sexuality research reduces social desirability effects due to the increased anonymity of the participants (Bowen et. al., 2008). Additionally, the Implementation of the SDS scale (Donald, 1985) was a covert measure of the sexual double standard to conceal the purpose of the questionnaire and reduce response bias. Even as such, it is possible that some of the participants answered the items with bias, potentially swaying the results. Even with these possible limitations considered the results of this study, in combination with the results of past research (e.g., Milhausen & Herold, 1999; Marks & Fraley, 2006), suggest little evidence of continued implementation of the sexual double standard.\n\nAustin found some evidence for a reverse double standard:\n\n>Consistent with the analysis of the Bl-implementation subscale, as well as past findings (e.g., Milhausen & Herold, 1999; Marks & Fraley, 2006), minimal evidence of implementation of the traditional sexual double standard was supported in the analysis of the Implementation of the SDS scores. The older males and the younger females made the most differential judgments between the sexual behaviors of men and women. However, unexpectedly, they rated the sexual behaviour of men more harshly to women, opposite to the traditional sexual double standard. This is of interest because it is the exact reverse to what would be expected given the literature on traditional sexual scripting and the sexual double standard.  \n>  \n>Similar results to these were reported by Milhausen and Herold (2001), who observed evidence of a reverse double standard. When both male and female participants were asked if they would encourage a female friend to date a highly sexually experienced male target, they said they would warn a female friend about the sexual history of the male target, yet would not offer the same warnings if the genders were reversed (Milhausen & Herold, 2001). The researchers attributed these results to recent social trends that view highly sexually experienced men as 'exploiters' of female sexuality. They suggested that this negative view of permissive male sexuality may be due to extensive media coverage and publicity of sexual assault and harassment where men are perceived as sexual predators (Milhausen & Herold, 2001). It may be that the groups of older men and younger women are most aware of these scripts of men as predators thus judge the sexual behaviors of men more harshly to women.\n\nOnto evidence of a reverse double standard, while there might be some people out there who support the traditional double standard, there are some people out there who support a reverse double standard. Women are more likely than men to support the reverse double standard. In this 2001 study \"[Reconceptualizing the sexual double standard](https://sci-hub.se/https://doi.org/10.1300/J056v13n02_05)\":\n\n>This study analyzes the prevalence of the sexual double standard using a diversity of measures. It distinguishes between the perception of the double standard at the societal level and one's personal acceptance of it. Young people (N = 413), ranging in age from 18 to 28, from three university classes and two community-based dating bars in Canada were surveyed to determine their attitudes and behaviors regarding the double standard. The majority of the participants perceived the double standard to exist with more women than men perceiving this, especially with regard to the issue of sexual freedom. On a personal level, however, most men and women held a single standard. There was a significant gender difference as men were more likely to endorse a double standard, whereas women were more likely to endorse a reverse double standard, in which men's sexual behavior was evaluated more harshly than that of women's. This study indicates that the double standard is more complex in nature than has previously been thought.\n\nAccording to the study, of 409 men and women, they typically did NOT hold a double standard for things like casual sex, one night stands, sex at age 16, watching porn, visiting strip clubs, etc. A majority didn't have any double standard. Men who held a double standard, although a minority, usually held the traditional double standard instead of the reverse. Women were less likely to hold any double standard, and when they did, they typically held a reverse double standard and rarely held a traditional double standard.\n\nAccording to the study, of 365 men and women (***with multiple responses allowed***), only 25% of men viewed promiscuous men as a stud or \"the man\" and only 11% viewed him as sexually liberated. 38% viewed him as a womanizer/sexual predator/player and 40% viewed him as promiscuous/slutty/dirty. 10% viewed him as psychologically damaged, desperate or insecure. 37% of women viewed promiscuous men as a womanizer or predator, 30% viewed him as slutty or dirty or promiscuous, 3% viewed him as psychologically damaged, and only a mere 8% viewed him as a stud. Only 5% view him as sexually liberated. Zero men and women viewed promiscuous women as predators. 75% of men and 66% of women viewed her as slutty or dirty. 7% and 9% of men and women respectively viewed her as psychologically damaged, 0 called her a stud, and 8% and 16% of men and women respectively called her sexually liberated. The total percentage for each category exceeds 100% due to being allowed multiple responses.\n\nHere's another noteworthy quote:\n\n>Difference scores were calculated to assess the proportion of men and women who endorsed a double standard, a reverse double standard, or a single standard for discouraging one’s friends from dating someone with many sexual partners. The majority of women (75%) and men (68%) endorsed a single sexual standard on these items indicating they were equally likely to discourage a male or female friend from dating a highly experienced other. More respondents (23% women, 26% men) supported a reverse double standard than a double standard (2% women, 6% men) as they evaluated the sexual behavior of potential male dates more negatively than that of potential female dates for both items. Therefore, contrary to our expectations, the genders were not sig- nificantly different from one another (χ2 = 5.65, *p* = .06). In fact, both genders were more likely to support a single standard with a solid mi- nority supporting a reverse double standard.\n\nAlso, although feminists believe only men consider promiscuity a dealbreaker when it comes to looking for a relationship, studies actually show that women also consider promiscuity a dealbreaker. Many women won't date a promiscuous man. Although virginity is a dealbreaker to many women, many women consider a promiscuous man a dealbreaker. [In fact, women are less willing than men to date a promiscuous person](https://www.researchgate.net/profile/Steve-Stewart-Williams/publication/306518734_Sexual_History_and_Present_Attractiveness_People_Want_a_Mate_With_a_Bit_of_a_Past_But_Not_Too_Much/links/59e160990f7e9b97fbe2bd29/Sexual-History-and-Present-Attractiveness-People-Want-a-Mate-With-a-Bit-of-a-Past-But-Not-Too-Much.pdf?origin=publication_detail). Women's cutoff point for a maximum acceptable number of previous partners in a significant other was slightly more strict than a man's cutoff point.\n\n&#x200B;\n\n[Men and women's willingness to engage in a relationship with someone based on their sexual history. Average age of male participants was 22 and the average age of female participants was 20.](https://preview.redd.it/psgw42jqpdj71.png?width=837&format=png&auto=webp&s=faa7461cc0991c60fc54e62dfa71fff5ae1a0902)\n\nAlthough society puts pressure on men to have more than just a couple sex partners, they don't put pressure on them to have 20 or 30 partners. If he has 10 sex partners or something, he probably would be viewed as adequate. But if he had 15 or 20 or 30, at that point he's just going to be viewed as a womanizer or a fuckboy. Women typically would never view him as a stud. As for men, only a minority of men would view him as a stud (not a tiny minority but a minority). And honestly, the only men who view him as a stud for sleeping with 20 women are usually those macho guys you see in your teens/early-mid 20s. Hypermasculine men would be more likely to view him as a stud. Men in hypermasculine environments such as fraternities, delinquent gangs, or athletics might be more likely to view him that way. Men in general, however, might view him as dirty or view him as a womanizer. Many women would view him as a womanizer who objectifies women and cheats.\n\nVirgin men are definitely stigmatized but so are promiscuous men. There's also this myth that virgin women are viewed as angels. They're not, or at least not anymore. That may have been true a century ago, but nowadays, even virgin women are stigmatized once a woman reaches her mid-20s as a virgin (I think men will be stigmatized for being a virgin at any age). Even if a woman says she's waiting until marriage, people might just view her as a prude or a cocktease. If a man says he's waiting until marriage, people might view him as unmanly or some might even assume he's gay.\n\nSure there's people out there who think promiscuous men are studs, but many might say he's a womanizer who objectifies women. It depends on who you ask. And there's some people out there who hold a reverse double standard favoring promiscuous women over promiscuous men.",
    "title": "\"Promiscuous women are labeled as sluts but promiscuous men are called studs\" debunked. The myth of the sexual double standard.",
    "subreddit": "MensRights",
    "timestamp": 1629843092,
    "score": 119,
    "keyword": "mixed race judge"
  },
  {
    "text": "Men’s mental health: why are we are trying to change masculinity rather than create male-friendly services? - British Holistic Medical Association [https://bhma.org/mens-mental-health-why-are-we-are-trying-to-change-masculinity-rather-than-create-male-friendly-services/](https://bhma.org/mens-mental-health-why-are-we-are-trying-to-change-masculinity-rather-than-create-male-friendly-services/)\n\nArticle above, but I recommend watch the video if you have time:\n\n[https://www.youtube.com/watch?v=vgHVkA2\\_hI8](https://www.youtube.com/watch?v=vgHVkA2_hI8)\n\n[https://www.youtube.com/watch?v=LHYRYKCIDxk](https://www.youtube.com/watch?v=LHYRYKCIDxk)\n\nBackground:\n\nFeminism had success worming its way into life via entering academia (and also via the domestic violence industry, that was another early area it got its money from and were feints gathered). People dont know that patriarchy theory in its modern form was basically invented in 1970 by Kate Millet and then intersectionality in 1990.... by setting up in gender studies deirptments, it created activists, journalists, bloggers, lawyers, judges etc..... from there all these feminise terms such as patriarchy and male privilege ended up in government policies\n\nThis is the start of MRA doing its own theories etc.\n\nThis is real MRA - \"construction\" not \"deconstruction\"\n\nGuys this is real MRA - construction. Talking about how bad things are e.g. misandry, negative options of men, falsely using toxic masculinity, to complaining about feminsim etc is \"DECONSTRUCTION\" and its just talking in an echo chamber to people who already agree with you. \"CONSTRUCT\" something instead. These guys above ARE CONSTRUCTING i.e. they are creating alternative research, ideas, theories to toxic masculinity \"man bad\" \"man patriarchy\" nonsense and menslib style bullshit. (read below what the amazing work they are doing) So SUPPORT THESE GUYS. Find them on social media, they have great accounts, share their work, buy their books, donate, send them emails of thanks. Do something useful for MRA, in terms of CONSTRUCTION. Deconstruction is being done by the anti-feminists. Don't mix up MRA with anti feminism at every turn when there is no point and it becomes a distraction. The main MRA reddit is becoming to look like Buzzfeed, there's like 100 anti feminist articles and 1 about improving mens issues.... im not saying dont post it, im saying post about mens issues, and just that too! For example post something useful about anti circ, not just rants about feminism and circucmsion.\n\nWho are these guys?\n\nMale Psychology Network - an amazing development in MRA, literally one of the biggest ones I think in the entire movement in recent times! Male Psychology Network actually produce proper male positive, non feminist publications, conferences, etc on men and masculinity. They are trying to get therapy to be tailored to men, and not this current anti male bullshit, toxic masculinity stuff... ([https://www.youtube.com/watch?v=fdQntHZSMWA](https://www.youtube.com/watch?v=fdQntHZSMWA)) They are very much pushing the agenda of stop male bashing and misandry in media, society, uni, academia. This is not of the menslib nonsense, and it is not idealogical. It is science based, and not agenda driven (ughhh man bad masculinity bad). The amazing thing is this is getting into universities. The book by the author (interview here: [https://www.youtube.com/watch?v=VB-Gpq7h9cs](https://www.youtube.com/watch?v=VB-Gpq7h9cs))\n\nhas been download over 5.5k (probably more now) times so is getting into universities. They set up UKs first male psychology module which is led by fantastic pro men non feminist professor.\n\nHere is interview with said professor at the International Mens Conference, which was online this year due to COVID:\n\n[https://www.youtube.com/watch?v=Lz9lfrJR2EM](https://www.youtube.com/watch?v=Lz9lfrJR2EM)\n\nThey are about to produce another book.... again this means actual proper mens psychology and gender issues that is not feminist, so something academic that can be used.\n\nAnother good development, you will be pleased to hear is there is a whole raft of psychologists and professors who are looking at male victims of DV in the UK... I've vetted these guys throughly, listened to dozens of hours of them speaking, this is the real deal, pro male approach none of this menslib style fake MRA stuff.... they get it, and they are flat out not feminists and go after feminism HARD for LYING about male DV. This is not some obscure stuff, its senior professors, heads of department etc. and they've even been published in anti male Guardian and can get mainstream attention. Look out next year as a lot of their research will be released next year. These guys are loud too, they will be all over social media, interviews, newspapers, doing conferences, podcasts, video etc. its not little obscure research papers that get forgotten about.\n\nHere is the blurb of the book:\n\n>Male Psychology is a new field. In August 2018, the membership of the BPS voted for a Male Psychology Section of the BPS. This means there are already around 2,800 BPS members who support what we are doing. However, there is, as yet, only one textbook on this topic (The Palgreave Handbook of Male Psychology & Mental Health, 2019) edited by Barry et al. This was released in March 2019 and has already had almost 5.5k chapter downloads from universities. As the interest in Male Psychology continues to grow, there will be an expanding need for further academic and practical knowledge on the subject. This new series, Perspectives in Male Psychology, will fill the gap that exists, and be the seminal book on this subject.",
    "title": "Men’s mental health: why are we are trying to change masculinity rather than create male-friendly services? - British Holistic Medical Association",
    "subreddit": "MensRights",
    "timestamp": 1610042417,
    "score": 98,
    "keyword": "mixed race judge"
  },
  {
    "text": "I hate my woke school board My friend showed me this sub and I've been really tempted to post on it, so here I am. This is just a throwaway account because I'm scared of what would happen if I posted this on my main. I hate the fact that now people need to be careful about sharing their real opinions.\n\nI'm a 15-year-old girl in grade 10 and I'm fed up with this feminism shit in school. (and before you point it out, yes I know it's ironic that I'm making this post as a female). A lot of the subjects in my school are dominated with social justice and I hate it. English is the worst of all because my teacher is a social justice warrior and always talks about feminism and race insensitively (also making racist remarks about her fellow white people lol) in front of the whole class. EVERY single start of the class she talks about feminism and how girls are poor little victims, their rights are being disrespected, blah blah blah. I fucking hate it. I'm someone who's victimized for both my race and my gender and I hate it so much.\n\nLast month we started reading books. ALL of the options were about social justice. She was like \"It's better if I let you chose a book, rather than if I just handed you a book by an old dead white guy\" (yes, she really said that). Pretty much all the books had an \"important message\" in them, so I chose a book that seemed to be the least like it would be full of social justice. Turns out the entire fucking book is a message about feminism (as well as racism), the two subjects that bother me more than anything. (The book is called \"Monday's Not Coming\" if you dare to touch it)\n\nWell anyway, I was reading a part of a section today for my school work and so basically some girl is invited to a sleepover with other girls. The sleepover takes an unexpected turn that the main character didn't expect and she ends up going to a party and getting drunk. I PREDICTED what would happen next, and I hate that. Some guy sexually assaults her, of course. Fuck that book. Fuck my life. Fuck everything.\n\n&#x200B;\n\nI can't even express my anger in words. I don't even know how to properly end this post but it's just great being victimized for your gender and your race :) (I'm mixed by the way). I hate it how the sjws portray women as \"poor little victims aww omg r u ok :'''( oJHDJGSHJVD ARWJKUD GUSKDBM HJKFWSGJdb,hgajfuckingshootme\"\n\na\n\nwxdquodhkfjvsgfxe\n\nd d\n\necfwd\n\nfwxv\n\n&#x200B;\n\nI am going to have a meltdown\n\nOkay, that's my vent. Bye.",
    "title": "I hate my woke school board",
    "subreddit": "MensRights",
    "timestamp": 1619114505,
    "score": 39,
    "keyword": "mixed race judge"
  },
  {
    "text": "Father in United Kingdom hasn't seen his daughter in a year, and complains of pattern of bias. Suggestions for making a judicial complaint. A father from the United Kingdom alleged that he had spent many hearings wasting time. The judge in his case cancelled fact finding hearings and gave him ten minutes where the the judge told him he could not grant him a PR and could not do anything about his lack of contact with his child. He told her to work it out with the mother who has denied him child access for over a year without considering the evidence he wished to present. He expressed frustration.\n\nWhat follows is my reply, which may help other fathers in the United Kingdom who feel they are facing a judge who exhibits a pattern of bias.\n\nI am not a lawyer and this is not legal advice.\n\nIf I were you I would consider a complaint. It seems like you are may be alleging the judge has exhibited bias sufficient to disqualify himself. Allegations suggest the judge has dismissed and ignored you and has failed to be \"courteous, patient, tolerant and punctual and to respect the dignity of al\". In particular the judge has ignored your status as a victim of domestic violence who has been denied child access as a form of abuse, and your child's status as a victim of child abuse who has been denied a loving father child relationship as a form of child abuse. The judge may have done this because the judge is sexist and the judge has by \"words or conduct, show any bias against or preference towards any person or group on any such ground\", including women and mothers, and against fathers and children. The judge's claims that he can't do anything about these acts of child abuse and domestic violence show that he's either unwilling or not competent to apply the appropriate laws to protect the child and father and is not equipped to discharge his ethical duties. Constant delays and failures to perform simple duties to protect victims of domestic violence and child abuse, with evidence of gender bias, are sufficient to show that any \"fair minded and informed observer\", having considered the facts, would conclude that there was a \"real possibility\" of bias\n\n> Bias and the appearance of bias\n\n> 3.7 The question whether an appearance of bias or possible conflict of interest is sufficient to disqualify a Justice from taking part in a particular case is the subject of United Kingdom and Strasbourg jurisprudence which will guide the Justices in specific situations. Leading UK cases include Porter v Magill [2002] 2 AC 357, Locobail (UK) Ltd v Bayfield Properties Ltd [2002] QB 451, Re Medicaments and Related Classes of Goods (No.2) [2001] 1 WLR 700, Helow v Secretary of State for the Home Department [2008] 1 WLR 2416 and Stubbs v The Queen [2018] UKPC 30.\n\n> 4 INTEGRITY\n\n> 4.3 In Court, the Justices will seek to be courteous, patient, tolerant and punctual and to respect the dignity of all.\n\n> 6 EQUALITY\n\n> 6.1 A Justice should be aware of, and understand, diversity in society and differences arising from matters such as gender, race, ethnicity, colour, national origin, religion, caste, disability, birth or marital status, sexual orientation, socioeconomic or educational or occupational background, and the like. A Justice will not, by words or conduct, show any bias against or preference towards any person or group on any such ground\n\n> 7 COMPETENCE AND DILIGENCE\n\n> 7.1 As Lord Bingham of Cornhill stated in his 1993 lecture to the Society of Public Teachers of Law, entitled Judicial Ethics:\n\n> \"It is a judge's professional duty to do what he reasonably can to equip himself to discharge his judicial duties with a high degree of competence.\"\n\n> https://www.supremecourt.uk/docs/guide-to-judicial-conduct.pdf\n\n> Under English law, the test for establishing bias was set out in Porter v Magill – whether a \"fair minded and informed observer\", having considered the facts, would conclude that there was a \"real possibility\" of bias\n\n> https://en.wikipedia.org/wiki/Porter_v_Magill\n\n> Any action that amounts to misconduct. Some examples include:\n\n> The use of racist, sexist or offensive language\n\n> Delayed judgment (usually considered to be in excess of three months)\n\n> https://www.complaints.judicialconduct.gov.uk/what_can_i_complaint_about/\n\nTweet with me to seek justice:\n\n> Father in United Kingdom hasn't seen his daughter in a year, and complains of pattern of bias.Fix @10DowningStreet @Conservatives @UKParliament @UKSupremeCourt @UKSupremeCourt @HouseofCommons #FathersRights #GenerationEquality #DomesticViolence #ChildAbuse https://www.reddit.com/r/MensRights/comments/nsvsq3/father_in_united_kingdom_hasnt_seen_his_daughter/\n\nEnd.",
    "title": "Father in United Kingdom hasn't seen his daughter in a year, and complains of pattern of bias. Suggestions for making a judicial complaint.",
    "subreddit": "MensRights",
    "timestamp": 1622899871,
    "score": 37,
    "keyword": "mixed race judge"
  },
  {
    "text": "Huge feminist protests erupt across Caribbean island Trinidad and Tobago in light of the recent rape and murder of a 23-year-old girl, Andrea Bharatt. [https://www.newsamericasnow.com/caribbean-news-andrea-bharatt-murder-trinidad-and-tobago/](https://www.newsamericasnow.com/caribbean-news-andrea-bharatt-murder-trinidad-and-tobago/)\n\nTens of thousands of men and women are protesting against the government of Trindad to do something to improve the safety of our women. Dozens have gone missing and have most likely been raped and murdered.\n\nAfter the recent (Jan kidnapping, murder and suspected rape of Andrea Bharatt, enough is enough!\n\n[https://newsday.co.tt/2021/01/30/arima-woman-kidnapped-ransom-demanded/](https://newsday.co.tt/2021/01/30/arima-woman-kidnapped-ransom-demanded/)\n\n**She was an innocent sweet, university educated, 23-year-old girl who worked as a clerk at a Magistrates court.** She was was abducted in a 'fake taxi' on January 29th. After several massive manhunts, her body was eventually found 7 days later. From all accounts, she had been killed the same day she was taken.\n\n**About Trinidad -** The southernmost Caribbean Island and 3rd richest country in the Western Hemisphere per capita, the oil-rich Trinidad who invented Steelpan music, Soca and Calypso and has the world's second-biggest carnival, is no stranger to violence and crime.\n\nWe are a uniquely cosmopolitan island (40% Indian, 40% Black, 20% mixed/white/Venezuelan/Syrian) country of 1.5M people that has surprisingly little racial tension but has been plagued over the last 2 decades with increasing gang violence.\n\nHowever, despite having near 500 murders annually for the last 20 years (10,000 people murdered) one recent murder shook the nation to its core (after years of several women going missing or murdered/raped).\n\n**Andrea Bharatt was possibly raped, murder and then dumped over a ledge along a mountainous road in Aripo.**\n\nPolice were able to hold two suspects, one was found with her bank card who later sold out his accomplice.\n\n**The main suspect was well known to the police.** In fact, he had 70 charges and numerous criminal cases against him, yet for some reason, **he was not in jail.** On 5 occasions shoddy (or bribed) police work resulted in cases being dropped. Other cases were still pending, but judges saw it fit for some reason to grant him bail.\n\n**The lack of urgency, complacency, incompetence, corruption and ownership of these issues by authorities has ANGERED an entire nation, a nation where women are feeling increasingly unsafe.**\n\nIt has been met with silence, and politicking by the government who refuses to take responsibility and attempt to pass the blame.\n\nProtestors and feminists are taking to the streets to bring attention to this issue, but we need this to go international to pressure our government to take responsibility and weed out corruption.\n\n&#x200B;\n\nThe two suspects later died in police custody with the police claiming one 'fell off his chair' and the other got injured in an escape attempt.\n\nNo doubt police who were complicit in these guys not being in jail and were trying to shut them up,\n\n&#x200B;\n\n**This is reminiscent of what happened in Delhi with the brutal bus gang rape in 2012.**\n\nHowever, we need your help. We have a condescending out of touch government that caters only to the needs of the richest in the island and not the average citizen.\n\n&#x200B;\n\nThe victim - [https://s1.stabroeknews.com/images/2021/02/andrea-b2.jpg](https://s1.stabroeknews.com/images/2021/02/andrea-b2.jpg)\n\nA video project by the victim - [https://youtu.be/lqaJDOxfeFg](https://youtu.be/lqaJDOxfeFg)\n\nThe headlines - [https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p180x540/148357699\\_10158003590655814\\_4702965862099867631\\_o.jpg?\\_nc\\_cat=108&ccb=2&\\_nc\\_sid=730e14&\\_nc\\_ohc=OOPzySAt6sgAX\\_zfXSE&\\_nc\\_ht=scontent.fpos1-1.fna&tp=6&oh=6f657382c1bda4f7523dc0c0e170a079&oe=60483DD0](https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p180x540/148357699_10158003590655814_4702965862099867631_o.jpg?_nc_cat=108&ccb=2&_nc_sid=730e14&_nc_ohc=OOPzySAt6sgAX_zfXSE&_nc_ht=scontent.fpos1-1.fna&tp=6&oh=6f657382c1bda4f7523dc0c0e170a079&oe=60483DD0)\n\nThe essence of the government's response - [https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p526x296/147852653\\_10159315695791119\\_866468936050134841\\_o.jpg?\\_nc\\_cat=103&ccb=2&\\_nc\\_sid=730e14&\\_nc\\_ohc=LBTXQi4pP3QAX8aOWi9&\\_nc\\_ht=scontent.fpos1-1.fna&tp=6&oh=b11bf5728cd0266c4a99a6b505897f16&oe=604959CF](https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p526x296/147852653_10159315695791119_866468936050134841_o.jpg?_nc_cat=103&ccb=2&_nc_sid=730e14&_nc_ohc=LBTXQi4pP3QAX8aOWi9&_nc_ht=scontent.fpos1-1.fna&tp=6&oh=b11bf5728cd0266c4a99a6b505897f16&oe=604959CF)\n\nVideo of our Government's nonchalance and condescending attitude here - [https://www.facebook.com/100001952421497/posts/5106469866094710/?sfnsn=wa](https://www.facebook.com/100001952421497/posts/5106469866094710/?sfnsn=wa)\n\nAll the women killed/missing over the last decade or so - [https://scontent.fpos1-2.fna.fbcdn.net/v/t1.0-9/144741275\\_747508228171\\_652795971916147088\\_o.jpg?\\_nc\\_cat=105&ccb=2&\\_nc\\_sid=8bfeb9&\\_nc\\_ohc=WuQiiDTRauoAX\\_WtmhP&\\_nc\\_ht=scontent.fpos1-2.fna&oh=5e3cba222c8379d1a2e61bcd1df47fce&oe=60466014](https://scontent.fpos1-2.fna.fbcdn.net/v/t1.0-9/144741275_747508228171_652795971916147088_o.jpg?_nc_cat=105&ccb=2&_nc_sid=8bfeb9&_nc_ohc=WuQiiDTRauoAX_WtmhP&_nc_ht=scontent.fpos1-2.fna&oh=5e3cba222c8379d1a2e61bcd1df47fce&oe=60466014)\n\nPetition (one of many) - [https://www.change.org/p/minister-of-national-security-protect-our-women-in-t-t?recruiter=false&utm\\_source=share\\_petition&utm\\_medium=facebook&utm\\_campaign=psf\\_combo\\_share\\_initial&utm\\_term=psf\\_combo\\_share\\_abi&recruited\\_by\\_id=150ab800-67ce-11eb-a39e-db9fdf139296&utm\\_content=fht-27200205-en-gb%3A0](https://www.change.org/p/minister-of-national-security-protect-our-women-in-t-t?recruiter=false&utm_source=share_petition&utm_medium=facebook&utm_campaign=psf_combo_share_initial&utm_term=psf_combo_share_abi&recruited_by_id=150ab800-67ce-11eb-a39e-db9fdf139296&utm_content=fht-27200205-en-gb%3A0)\n\n&#x200B;\n\nWe want this to go viral, this needs to reach CNN, MSNBC, BBC, even FOX or OAN (we really don't care at this point).",
    "title": "Huge feminist protests erupt across Caribbean island Trinidad and Tobago in light of the recent rape and murder of a 23-year-old girl, Andrea Bharatt.",
    "subreddit": "Feminism",
    "timestamp": 1612830730,
    "score": 70,
    "keyword": "mixed race judge"
  },
  {
    "text": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari Excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari\n\nhttps://www.amazon.com/Sapiens-Humankind-Yuval-Noah-Harari/dp/0062316095\n\n***\n\n\"Different societies adopt different kinds of imagined hierarchies. Race is very important to modern Americans but was relatively insignificant to medieval Muslims. Caste was a matter of life and death in medieval India, whereas in modern Europe it is practically non-existent. One hierarchy, however, has been of supreme importance in all known human societies: the hierarchy of gender. People everywhere have divided themselves into men and women. And almost everywhere men have got the better deal, at least since the Agricultural Revolution.\n\nSome of the earliest Chinese texts are oracle bones, dating to 1200 BC, used to divine the future. On one was engraved the question: ‘Will Lady Hao’s childbearing be lucky?’ To which was written the reply: ‘If the child is born on a ding day, lucky; if on a geng day, vastly auspicious.’ However, Lady Hao was to give birth on a jiayin day. The text ends with the morose observation: ‘Three weeks and one day later, on jiayin day, the child was born. Not lucky. It was a girl.’4 More than 3,000 years later, when Communist China enacted the ‘one child’ policy, many Chinese families continued to regard the birth of a girl as a misfortune. Parents would occasionally abandon or murder newborn baby girls in order to have another shot at getting a boy.\n\nIn many societies women were simply the property of men, most often their fathers, husbands or brothers. Rape, in many legal systems, falls under property violation – in other words, the victim is not the woman who was raped but the male who owns her. This being the case, the legal remedy was the transfer of ownership – the rapist was required to pay a bride price to the woman’s father or brother, upon which she became the rapist’s property. The Bible decrees that ‘If a man meets a virgin who is not betrothed, and seizes her and lies with her, and they are found, then the man who lay with her shall give to the father of the young woman fifty shekels of silver, and she shall be his wife’ (Deuteronomy 22:28–9). The ancient Hebrews considered this a reasonable arrangement.\n\nRaping a woman who did not belong to any man was not considered a crime at\n\nall, just as picking up a lost coin on a busy street is not considered theft. And if a husband raped his own wife, he had committed no crime. In fact, the idea that a husband could rape his wife was an oxymoron. To be a husband was to have full control of your wife’s sexuality. To say that a husband ‘raped’ his wife was as illogical as saying that a man stole his own wallet. Such thinking was not confined to the ancient Middle East. As of 2006, there were still fty-three countries where a husband could not be prosecuted for the rape of his wife. Even in Germany, rape laws were amended only in 1997 to create a legal category of marital rape.\n\nIs the division into men and women a product of the imagination, like the caste system in India and the racial system in America, or is it a natural division with deep biological roots? And if it is indeed a natural division, are there also biological explanations for the preference given to men over women?\n\nSome of the cultural, legal and political disparities between men and women reject the obvious biological differences between the sexes. Childbearing has always been women’s job, because men don’t have wombs. Yet around this hard universal kernel, every society accumulated layer upon layer of cultural ideas and norms that have little to do with biology. Societies associate a host of attributes with masculinity and femininity that, for the most part, lack a rm biological basis.\n\nFor instance, in democratic Athens of the fifth century BC, an individual possessing a womb had no independent legal status and was forbidden to participate in popular assemblies or to be a judge. With few exceptions, such an individual could not bene t from a good education, nor engage in business or in philosophical discourse. None of Athens’ political leaders, none of its great philosophers, orators, artists or merchants had a womb. Does having a womb make a person un t, biologically, for these professions? The ancient Athenians thought so. Modern Athenians disagree. In present-day Athens, women vote, are elected to public office, make speeches, design everything from jewelry to buildings to software, and go to university. Their wombs do not keep them from doing any of these things as successfully as men do. True, they are still underrepresented in politics and business – only about 12 per cent of the members of Greece’s parliament are women. But there is no legal barrier to their participation in politics, and most modern Greeks think it is quite normal for a woman to serve in public office.\n\nMany modern Greeks also think that an integral part of being a man is being sexually attracted to women only, and having sexual relations exclusively with the opposite sex. They don’t see this as a cultural bias, but rather as a biological reality – relations between two people of the opposite sex are natural, and between two people of the same sex unnatural. In fact, though, Mother Nature does not mind if men are sexually attracted to one another. It’s only human mothers steeped in particular cultures who make a scene if their son has a fling with the boy next door. The mother’s tantrums are not a biological imperative. A significant number of human cultures have viewed homosexual relations as not only legitimate but even socially constructive, ancient Greece being the most notable example. The Iliad does not mention that Thetis had any objection to her son Achilles’ relations with Patroclus. Queen Olympias of Macedon was one of the most temperamental and forceful women of the ancient world, and even had her own husband, King Philip, assassinated. Yet she didn’t have a t when her son, Alexander the Great, brought his lover Hephaestion home for dinner.\n\nHow can we distinguish what is biologically determined from what people merely try to justify through biological myths? A good rule of thumb is ‘Biology enables, Culture forbids.’ Biology is willing to tolerate a very wide spectrum of possibilities. It’s culture that obliges people to realise some possibilities while forbidding others. Biology enables women to have children – some cultures oblige women to realise this possibility. Biology enables men to enjoy sex with one another – some cultures forbid them to realise this possibility.\n\nCulture tends to argue that it forbids only that which is unnatural. But from a biological perspective, nothing is unnatural. Whatever is possible is by definition also natural. A truly unnatural behaviour, one that goes against the laws of nature, simply cannot exist, so it would need no prohibition. No culture has ever bothered to forbid men to photosynthesise, women to run faster than the speed of light, or negatively charged electrons to be attracted to each other.\n\nIn truth, our concepts ‘natural’ and unnatural’ are taken not from biology, but from Christian theology. The theological meaning of ‘natural’ is ‘in accordance with the intentions of the God who created nature’. Christian theologians argued that God created the human body, intending each limb and organ to serve a particular purpose. If we use our limbs and organs for the purpose envisioned by God, then it is a natural activity. To use them differently than God intends is unnatural. But evolution has no purpose. Organs have not evolved with a purpose, and the way they are used is in constant ux. There is not a single organ in the human body that only does the job its prototype did when it first appeared hundreds of millions of years ago. Organs evolve to perform a particular function, but once they exist, they can be adapted for other usages as well. Mouths, for example, appeared because the earliest multicellular organisms needed a way to take nutrients into their bodies. We still use our mouths for that purpose, but we also use them to kiss, speak and, if we are Rambo, to pull the pins out of hand grenades. Are any of these uses unnatural simply because our worm-like ancestors 600 million years ago didn’t do those things with their mouths?\n\nSimilarly, wings didn’t suddenly appear in all their aerodynamic glory. They developed from organs that served another purpose. According to one theory, insect wings evolved millions of years ago from body protrusions on flightless bugs. Bugs with bumps had a larger surface area than those without bumps, and this enabled them to absorb more sunlight and thus stay warmer. In a slow evolutionary process, these solar heaters grew larger. The same structure that was good for maximum sunlight absorption – lots of surface area, little weight – also, by coincidence, gave the insects a bit of a lift when they skipped and jumped. Those with bigger protrusions could skip and jump farther. Some insects started using the things to glide, and from there it was a small step to wings that could actually propel the bug through the air. Next time a mosquito buzzes in your ear, accuse her of unnatural behaviour. If she were well behaved and content with what God gave her, she’d use her wings only as solar panels.\n\nThe same sort of multitasking applies to our sexual organs and behaviour. Sex first evolved for procreation and courtship rituals as a way of sizing up the fitness of a potential mate. But many animals now put both to use for a multitude of social purposes that have little to do with creating little copies of themselves. Chimpanzees, for example, use sex to cement political alliances, establish intimacy and defuse tensions. Is that unnatural?\"",
    "title": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari",
    "subreddit": "Feminism",
    "timestamp": 1627323647,
    "score": 29,
    "keyword": "mixed race judge"
  }
]