[
  {
    "text": "Was the interviewer bringing up my race and gender illegal? I went through three interviews with a government agency. During the third one, the hiring director decided to have \"an honest conversation\" with me. She noted that hiring a white male for the position would be poor optics and wondered how I would react to that. She insisted that our conversation \"was not an interview\" but that she was just giving me intel about the atmosphere to help me make a decision. She also said that she'd get back to me with a formal job offer the following Monday leading me to believe that I was not in fact being (at least formally) evaluated for my conduct during the conversation. However, the interviewer got back to me several days after she said she would and informed me that they decided to go with someone else. The whole experience left a bad tase in my mouth. They told me they would make me an offer and decided not to, it seems to me, clearly based on my responses to questions about my race and gender. And it's not like I said anything abrasive, I just gave a standard PC milquetoast response that I imagine most people in my position would give. I am not trying to play the victim card--I don't think white men are systematically discriminated against in the job market--but I found the whole thing very unprofessional and am wondering now if they crossed a line legally.",
    "title": "Was the interviewer bringing up my race and gender illegal?",
    "subreddit": "jobs",
    "timestamp": 1626745137,
    "score": 83,
    "keyword": "mixed race director"
  },
  {
    "text": "Is it worth taking a pay cut to leave toxic work environment? Hi everyone!\n\nI have worked in my job for 6 years. It is 10 minutes from home. I have an amazing team and director. It is a government role.\n\nRecently, elected officials amysteriously got rid of our county manager. They also placed another official on leave. No reasons given. They appointed an interim county manager who is just awful. He is rude, demoralizing, and throws staff under the bus at any given chance to save face. He is not a manager...no management experience. They just named him permanent for the role despite not reviewing any other candidates.\n\nMy job frequently involves politics but this is just out of hand lately. My supervisor is the best but is actively job hunting. I know he will leave once he finds a good opportunity. When he leaves, I will be in his position and have to deal with the brunt of new management.\n\nIf I leave I would still work in government but I'd lose my 14 days of vacation saved up and would likely take a 10k paycut. We have no debt excwpt our house so i could manage but it would suck. The position i take would be entry level so id have to climb the ladder again.. I would also be adding a 45 min commute to my life. \n\nI love my colleagues but when I come home I just feel down. This was my worst fear come true. My heart has been racing constantly for the past couple days and I feel like I am having panic attacks at times. I've never had these issues before.\n\nAnyways... for those who took pay cuts to leave toxic work environments was it worth it? Any regrets?\n\nMy biggest fear is that it will be the same wherever I go given the politics with my job. But my supervisor and others have told me it is not supposed to be this corrupt and bad.",
    "title": "Is it worth taking a pay cut to leave toxic work environment?",
    "subreddit": "jobs",
    "timestamp": 1609848380,
    "score": 29,
    "keyword": "mixed race director"
  },
  {
    "text": "Company actively says they need and value me, but I'm getting mixed signals and it's overwhelming me I \\[27F\\] have been working for my current company since 2017. I’m a multimedia editor, meaning I work with everything online be it shooting or editing videos, animations, and photos as well as writing copy. I also work as a Web/UI designer, which is my favorite part of the job. I started out as an intern through my University, got hired with a pretty good contract at the time, taught myself everything I do now and eventually dropped out of my uni degree (which I was already struggling with since it was in a completely different field I did not like) and focused 100% on my job. Over the past few years I’ve had to deal with my own Imposter Syndrome (I suppose dropping out only made it worse) and took up many courses to learn more and do better.\n\nMy supervisor has been telling interns I’m a “genius” and that I can do anything, and I’ve been told she exploded during a meeting with higher-ups a few months ago when someone hinted they could ask for my help - saying that I was doing too much, that I’m too valuable for the company and that they can’t afford to lose me. That if only I tried I’d have a queue of recruiters knocking at my door soon enough. I’ve had the Director of Marketing calling me up in his office and basically telling me I could work with any department I wanted to, that multiple people had been asking to work with me.\n\nAt the same time, there have been multiple occurrences when I’ve felt like my work and input wasn’t valued by managers (who have never been in the designing/editing field), as if they assumed they knew more and that my job wasn’t exactly thought-out or that their personal preferences were more important than my research and knowledge simply because they’re in a higher position, or that they’re the only ones who can have a saying in scheduling deadlines (usually at the last minute) even though they don’t actually know how much time a task takes. I’ve also worked hard on difficult motion graphics projects with a strict deadline only to never actually see it go live - whereas a video shot in 2 minutes and edited via TikTok by an intern was turned into a paid ad right away.\n\nI feel like they take creative work like something you can tweak to your liking and that doesn’t have any special meaning, and I’m merely the person who knows how to use the software they don’t. As a result, I’ve been ending up going over any single project multiple times to the point where I just give up and feel sick with the end product AND feel sick with myself because I “care too much” in doing a good job when managers don’t seem to mind anyway. HR administration is even worse and it’s basically like it’s not even there.\n\nCherry on top - even though life is kinda cheaper in my country than compared to the US - I get paid the equivalent of 13$/h.  \n\n\nI really don’t know what to do and what to think, I’m getting mixed signals and I’m overwhelmed by this. It’s like they have huge expectations in me, but don’t actually care about what I do or think anyway.\n\nIn the meantime, I just stress myself out daily because my decrease in motivation obviously meddled with my productivity. My mental health is not the best either, so I always end up doubting myself and my actual skills, probably taking everything more personal than needed and thinking about it 24/7, thus never actually getting and “mind rest” from my job. I’d like to update my portfolio and look for new opportunities, but that takes energy I currently can’t find and, more importantly, makes me clash with my ever-present self-doubt. \n\nAm I just overreacting? Is there anything you would advise me to do to try and improve this situation?",
    "title": "Company actively says they need and value me, but I'm getting mixed signals and it's overwhelming me",
    "subreddit": "jobs",
    "timestamp": 1638375464,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "Did this company reject me [25F] without saying outright that they rejected me? I'd agreed to take a 6-hour test and am irritated by their behavior. I applied to an analyst position at a registered investment advisor on LinkedIn and went through multiple rounds of Zoom interviews. They were supposedly interested in me because they then also asked me to take a 6-hour exam, which I then took.\n\nI didn't know if I did well on it or not, but then they also asked me to grab lunch with 4 directors and the chief investment officer. The lunch was pretty bizarre because I was this 25-year old Asian American woman eating with five Caucasian men who were all 35-60 years old. I struggled to insert myself into their conversations, which were 80% about their kids. I think I screwed up my chances after asking a question about their company's diversity initiatives - I was pretty concerned about potentially being on a team of 15 men (not to mention they were all Caucasian and extremely tall/attractive) and no women.\n\nAfter the lunch, HR emailed me to tell me that they would get back to me extremely soon. Well, a week went by and they didn't get back to me! I'd emailed one of the directors in the meantime to thank him for lunch but didn't get any information about next steps. Then I noticed that they'd recently posted an analyst position on LinkedIn (whether or not it was the same one as the one I'd interviewed for, I couldn't tell), and within 24 hours it'd gotten 200+ applications.\n\nI then applied to the company's newly posted job on LinkedIn just to alert them that I'm aware, and HR called me an hour later to tell me that I didn't get the job, but that I was being considered for this \"new\" job and that they'd throw my application into the mix. I talked to someone who'd vacated this position and he'd said that there's only ONE open spot. Did this company reject me \\[25F\\] without saying outright that they rejected me? I'm tired of not just being rejected outright.",
    "title": "Did this company reject me [25F] without saying outright that they rejected me? I'd agreed to take a 6-hour test and am irritated by their behavior.",
    "subreddit": "jobs",
    "timestamp": 1628212854,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Should I leave my current job at a commercial construction GC for this offer in construction/PM consulting? Giving up 9k in 401k as well. Hi all, \n\nI recently received an offer for another job. I just need a gut check from some unbiased perspectives. For reference, both positions are based in NYC and I am looking to leave my first job out of college after 2 years (I am 23M). \n\n**Financials**\n\n* Checking/Savings: $5k \n* E-Fund HYSA: $25k \n* 401k: $25k (Only $16k vested - fully vests in Sept. 2022) \n* Roth IRA: $13k \n* Taxable Brokerage: $16k \n\n* Debt: $1k on CCs \n* Housing/Monthly Expenses: $2k\n\n**Current job (commercial construction management/general contractor)** - Field Engineer \n\n* Base: $70,800 \n* OT: Approx. $3,500\nNote: Overtime will go away when I reach the next pay band. I can expect my base to increase to about $80k at the next title tier later this year. \n* Bonus: $2,750 \n* 401k Match: Half of first 5% contribution + profit sharing \n\nAs an example, last pay period I contributed $355 and my employed contributed $150 (every 2 weeks). \n\n* PTO: 15 days vacation, essentially unlimited sick/personal, 11 holidays\nNote: I can barely ever take PTO or holidays in reality. \n\n* Work/Life Balance: 7:30-6pm, 1hr commute (WFH is impossible), barely any holidays, hard to take time off, email on nights and weekends are regular, weekend work expected the higher you go in the company. \n\nIn other words, pretty bad work life balance which is making me miserable. The work itself is incredibly stressful and tedious. Managers are toxic and demanding. Lower level employees are awesome though. \n\n**New job (construction consulting firm)** - Cost Manager\n\n* Base: $102,000\n* OT: None\n* Bonus: None \n* 401k Match: 25% of all contributions \n\n* PTO: 10 days vacation, 5 sick days, 8 holidays \n* Work/Life Balance: 8-5pm, 1hr commute (WFH is possible 1-2X a week). \n\nI’m not too sure of how the work life balance will translate practically though because my current job also told me 8-5 in the offer letter. I was under the impression consulting is less stressful than operations and colleagues of mind at construction/PM consulting firms have told me mixed feedback depending on the company. This company did stress that work life balance is incredibly important during the interview and directly compared themselves to another similar consulting firm that I’m aware of that is notorious for overworking their staff. \n\nOverall, my gut says it’s a no brainer but a few things are making me second guess myself. I’ve been looking for another job actively for about a month and this offer is the first I’ve gotten. The company seems fantastic and has a good reputation in the industry. \n\nThe main things causing my hesitation are:\n\n1) Losing about $9k in my 401k due to the vesting timeline \n* Friends of mine are telling me to ask the new company to consider a sign-on bonus to soften the blow but I’m reluctant to do this. It feels greedy and I would hate to lose the offer over this. Has anyone had any luck negotiating this? \n\n2) Significantly less PTO on paper. I have decent PTO for my age at my current company but on the other hand it’s tough to actually use it. I have to constantly make up excuses to get my bosses off my back when I request PTO due to the demanding/fast paced nature of the work. Even with the less amount of PTO/holidays perhaps this could be offset by the ability to actually take my days off with less fuss? \n\n3) No bonus until the associate director level which is probably 10 years down the line if I even stay that long. This is offset by the substantially higher base salary though. New company HR has told me that I can expect 5-10% yearly raises as well. My current company has given me 2 annual raises so far, both sub-2% (aka losing money to inflation - they blamed it on COVID). I fought both my raises and annual reviews and was basically told to go fuck myself both times. \n\nGenerally, I am looking to make to jump for obviously the higher pay but also importantly a better work life balance. I would appreciate your thoughts on my situation and would be happy to answer any specifics! \n\nThanks!",
    "title": "Should I leave my current job at a commercial construction GC for this offer in construction/PM consulting? Giving up 9k in 401k as well.",
    "subreddit": "jobs",
    "timestamp": 1626141180,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "[US] Recovering from rejection, but rallying for future positions with them! Before anyone jumps down my throat, I know I can't be sure if the position was \"dream\" since every company/position has their negatives, but I've had plenty of experience interacting with company and position supervisor so just roll with me!\n\nI recently applied for, interviewed twice and was ultimately rejected from dream job with dream company. Said company is a national governing body (NGB) focused on adolescent athletics in X sport.  About 25 F/T National employees across the US, with 30 different leagues that have 1-3 FT employees each. Then each league has dozens of teams, each with team director and volunteer coaches, etc. \"Dream job\" was focused on increasing female participation in said sport, something near and dear to my heart. \n\nI presume that I did not get the job since I am young (24, with 3 yrs professional experience, but at a management level with growing scope of responsibility, $120k budget that is directly mine, another $160k that I have heavy control over, 2 F/T and 2-15 seasonal staff that report to me, and 8 P/T \"Commissioners\" that my job does the leg work for) and my experience has mostly been on a local (county) level rather than national level.\n\nThat being said, when I got the rejection email from HR, they said that they would be advertising more positions in the upcoming month, they encouraged me to apply again. \n\nDream position was dream position, but I honestly dream company is still dream company and I would be THRILLED to work there. \n\n**So, how do I recover from this rejection with the aim of working there in the future?** I intend to apply for any future (applicable) positions with said company, some opening in the next month.\n\n* Will HR just throw out said future applications knowing that I really wanted dream position and I'd presumptively be less enthusiastic about a second choice position ? There's only 1 HR person, and clearly she knows my name now.\n* I am planning on reaching out to the supervisor that dream position would have reported to and ask what I can do to best prepare for future positions with NGB. What questions should I ask?\n\nAnd if you want more details:\n\nI participated in said sport under NGB for my senior year of high school, and it changed my life, and at the time I made up this dream position (as it didn't actually exist) and made that my goal. I chose a college degree at a well-respected university (ranked 3rd in nation for this degree) that was directly relevant to said NGB and associated work. Wrote my undergrad thesis on NGB's risk management procedures. Chose a job after grad in same industry that complimented NGB's work. In March, NGB actually created dream position, and I applied.\n\nI felt like I had a few things going for me:\n\n* Internship after grad with one of NGB's close partners, who gave them a positive word for me\n* Current job that is compliments NGB's job, (but on a more local scale). \n* Have been coaching as a volunteer (4 seasons) for NGB, on our team's leadership board the past year.\n* Dream position reported to a woman I have interacted quite a bit with (she volunteer coaches said sport for another school in my league and works for the NGB). She immediately knew who I was from seeing me at races, and it sounds like contacted my team director to find out more about me. \n* Former President/current board member gave NGB HR a good word for me at the request of my former internship director. \n\nThanks!",
    "title": "[US] Recovering from rejection, but rallying for future positions with them!",
    "subreddit": "jobs",
    "timestamp": 1620775150,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Reduced from trained official to stubborn woman in a single comment I’m a volunteer at the race track in my city and I’m working here this weekend with quite the sexist race director (the big boss for the weekend). He has made several problematic sexist comments which I have called out each time, but he’s just taken the cake with his last one. \n\nThere was a crash between two cars on the race track in the first hour of a four hour race. It’s my job to coordinate recovering these cars from the race track. I instructed my team to do so and they removed the cars. I was then asked by another guy to have the two cars returned to their garage. \n\nTo do this, I would have to move my team away from their positions for more than an hour. I was uncomfortable doing this and refused the request, saying I would return the cars at the end of the four hour race. (They were pretty bashed up, it’s not like they were going to rejoin the race even within the four hour period) \n\nThis man was very unhappy and complained about me to the race director. The race director looked at me and said:\n\n“I have three of them at home; you can’t argue with women.” \n\nIn one sentence, I was reduced to a stubborn woman from the trained professional I am, making a considered and prudent decision. I’m fortunate that this is the first time I’ve ever been so dismissed and I recognise that but holy fuck. The emotions are insane, ranging from frustration that it happened to frustration that I feel stupid for being upset by it. \n\nI just cannot with this kind of sexism rampant in motorsport - no wonder you have so few women here!",
    "title": "Reduced from trained official to stubborn woman in a single comment",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613830515,
    "score": 926,
    "keyword": "mixed race director"
  },
  {
    "text": "Trying to be friends with men can get so exhausting For some background context, I was working in facilities at a tech company for the past 10 years, so working with lots of men in all sorts of capacities.\n\n\nI was harassed pretty relentlessly in ways both subtle and very covert, and I just recently left the company to move to a different role in a different sector, in an office with a lot more women in general, as well as in leadership positions.  \n\n\nTowards the beginning of this year, after one too many of my 'friends' confused their loneliness from covid isolation with feelings for me, I made the decision to stop hanging out with men altogether.  I have very small handful of men that got grandfathered in, but I've been careful to hang out with them only in mixed groups as well.  It has been so awesome, my female friends are so wonderful, and my mental health really improved. \n\n\nLast night some ex coworkers reached out and mentioned they'd be at a bar near my new gig and asked if I'd want to meet up and catch up.  I would be the only woman in this situation. I decided to go because I'm removed enough from the situation, I felt it would be fine. \n\n\nIt was such a wild ride to find myself back in that situation. So for context, when I started my new role, I decided to go in with a fake wedding ring right off the bat to just start setting super hard clear boundaries so I would hopefully not run into the same issues I did with my last job.  Since I came from work, one of my old coworkers noticed and commented on it, and I just said 'Yeah, I was harassed so much at [old job] that I decided to go on the defense at new job.' \n\n\nThat was literally all I said, in a neutral, calm, matter of fact way, but I couldn't even get through that very short sentence without one of them making fake crying faces at me, (implying I was whining) and another one jumping in before I was done speaking to talk about the one time he was sexually harassed at work by a woman.  \n\nIn that coworker's story, he worked with a woman who was, in his words, 'very busty' and used to wear low cut shirts to the office/around him.  At one point he pointed out to her that if he came in dressed that way, that HR would be talking to him.  Supposedly, this enraged his coworker so much that she went to HR to complain, and HR took his side, and told the woman she was harassing him.\n\n\nIn my stories, (which I never got the chance to tell because these guys were mansplaining harassment to me) I was subjected to: \n\n\n1) A director who sent me an unsolicited dick pic and demanded I send him one in return to make it 'fair.' When I refused, he started threatening to get me fired, and would stalk me at work, and threaten me every time I was even near HR's office for unrelated reasons. \n\n\n2) An HR generalist rep who grabbed both my boobs and my ass, at a company party, in front of coworkers.  When I told her not to, she loudly insisted that I liked it.  She later got promoted. \n\n\n3) Another director who pursued me heavily for years. He also grabbed my boobs and my ass, and at one point grabbed the back of my head and forcibly kissed me. He was roughly 3 times my size, very tall and very broad.  When I tried to talk to him about it, he kept insisting I was giving him mixed messages.  He spent years trying to 'neg' me into dating him, constantly bringing up how 'old' or 'fat' or 'wrinkly' I was getting, taunting me that I better settle down soon before I hit a wall. He would regularly say these things in front of coworkers as well. He later went on to date one of the women that reported to him, he is 43 and she is 26. \n\n\n4) A guy who regularly harrassed me to go to a local strip club with him and would insult me loudly when I declined.  He did this almost weekly for about 3 years.  He also found some pictures of one of our 23 year old interns and in a bikini on her instagram and passed it around our office, calling her a slut.  He was 45. \n\n\n5) a coworker who was a peer (middle management) constantly comparing me to his wife or pubescent daughter, and constantly trying to interrupt my work, for example, if I was carrying a ladder, he would try to wrestle it out of my hands while saying he would want someone to do the same for his 12 year old daughter.  I was 34 and his peer, and carrying the ladder was a function of my job. He was later promoted. \n\n\nOur HR director NEVER helped me with a single one of these instances.  She would regularly ask me if the men had 'meant it as a compliment' and tell me I probably 'didn't make it clear enough I didn't want them to treat me that way.'  My reputation at the office is for being very direct and take no shit, but somehow that impression of me didn't extend to telling coworkers not to touch me or harass me? \n\n\nAnyway, that one simple sentence I managed to get out prompted the long story from my ex coworker, the single time he was harassed, over twenty years ago, and HR took his side without him even being present for the complaint, and he honestly thought that was a comparable, relevant story.  \n\n\nHe then transitioned to telling us about all the fun times he used to take his coworkers to strip clubs, and they would try to guess 'which ones were dudes,' which he referred to as 'it' as a pronoun.  He also regaled us with a fun story about a game he used to play with coworkers where they had to call a 'hot' woman they saw first, and if their other coworkers agreed she was hot, they won a point.  If their coworkers didn't agree she was hot, they lost a point.\n\n\nNot a single one of the other men there batted an eye at how the conversation went down, and laughed at his stories.  Fun fact, each of these men agree that our old workplace isn't sexist, because they've 'never seen it.'  \n\n\nI drove home not feeling exactly depressed or anxious, but I definitely left feeling... not great about how I spent my time in the pit of my stomach.  I don't know why I typed this all out, I guess to vent because I didn't feel heard or understood at all last night. \n\n\nI do feel really validated in my decision to limit how much time I spend with men though, which is a little depressing.",
    "title": "Trying to be friends with men can get so exhausting",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1631807029,
    "score": 384,
    "keyword": "mixed race director"
  },
  {
    "text": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us? It kinda hurts a bit. I'm already an awkward kinda person, and I do know stats say black women and Asian men are the least desirable in the dating world. But it's like, a punch in the face when there's black men out there who refuses to even consider someone looking like you, while in the same breath want to be treated fairly, not judged and have their skin color not be an issue to the world.\n\nAnd then there's the colorism in it. \"I only go for light skinned girls/mixed.\" Everyone has preferences, but this is on par with racists who particularly don't date a specific race because [bigoted racist reason] if not worse because like.... These dudes *know* the struggle of being discriminated on and are actively doing it.\n\nI guess it's something that's been bothering me and I dunno how much it gets discussed. It just makes me feel ugly because I haven't done anything yet, black men already cross me and many women off just based off stereotypes. So much shit gets thrown in about us just by appearance alone without even saying a hi.\n\nNot quite the same, but it made me think of when I was inpatient at a hospital. Young gay black man assumed all this stuff about me just due to my appearance (dunno how because we all look beat up coming into the hospital at all times in the day) and when he actually got to know me, whole new opinion. Thought I was loud, \"ghetto\" etc while uh, I wasn't? But I know he wouldn't like it if people assumed he was in a gang, drug dealer, and likes to watch grab dicks for fun. It's a real slap in the face. But, it's nothing new for me and many other black women out there.",
    "title": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625608005,
    "score": 134,
    "keyword": "mixed race director"
  },
  {
    "text": "People are not teaching experiences! No one owes respect and patience to someone who gives them none. I'm so so sick of being harassed and insulted by prejudiced people, only for mutual friends to turn around and tell me I should let them so that they learn. I'm pretty sure we all are.\n\n \\- At a friend's birthday party this guy silently stared at my chest all night, and touched me inappropriately. The response from my friend when I told him? \"Oh, he's not used to women. Sorry about that, but it would be really good for him if you guys hung out so he could practice talking to women!\"\n\n \\- When my boyfriend had a couple people over for drinks, a new acquaintance of his decided that that was the perfect time to tell our trans friend that when he first met her, he didn't see her as a person, and to tell her all of the disgusting things he still thinks when he sees her. Afterwards, I overheard someone \"comforting\" her by telling her he's just not used to trans people and she should cut him some slack.\n\n \\- Another friend of mine goes to Oxford University (for non-UK: very very prestigious, very white, elitist and rich) she's mixed race and working class. When her intelligence and legitimacy is questioned, when she is made to feel less-than, she has been told things like \"He hasn't met many people like you before! You should give him a chance to see what you're really like!\"\n\nAll of the people telling us this have been men who were our friends and \"allies\". If you feel like these are the kinds of things that you would say to excuse the offensive behaviour of a friend, I understand the impulse to defend someone you care about but please stop! Women, especially minorities, are not anyone's teacher, training wheels or learning experience! We do not owe anyone our patience and understanding when they treat us with contempt. If you are friends with someone that degrades or harasses, YOU should let them know how to change, not the people they're degrading! \n\nNo one is perfect, and we all have work that we need to do, but please take the time to consider if this is something you might need to think about.",
    "title": "People are not teaching experiences! No one owes respect and patience to someone who gives them none.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616525876,
    "score": 42,
    "keyword": "mixed race director"
  },
  {
    "text": "Pissed off and looking for examples of women/BIPOC owned companies I’m female, millennial, and mixed race, which are all relevant to my story. I recently attended a three-hour marketing seminar as part of a larger business conference event. From the very beginning of the conference, I was shocked to be surrounded by 90% white men, very few women, and even fewer people of color. \n\nThroughout the three-hour seminar, the speaker (white male, in his 40s) showed numerous examples of what he deemed to be successful marketing, including a series of three video commercials back-to-back, each featuring a white, male CEO (or a pair of white, male CEOs), sharing the story of their company. They met in college! They were outsiders to the industry! They took the world of [razors, socks, deodorant] by storm! Immediately after showing these three videos, the presenter said, “When customers can see themselves in your product, that’s when they'll feel a connection with you.” \n\nEvery example in his presentation featured white men as CEOs or in positions of leadership. With each example, it felt increasingly ridiculous. Three hours is a loooong time. The only mention of women was their potential as a customer base, an audience to be marketed to. He spent a cringey amount of time discussing “Millennial Moms,” which he kept referring to as “The Birth of Karen.” Every comment about women and/or millennials was derogatory. No notice that there were actual millennial moms in his audience (leaders in their businesses!) among all the white men present. \n\nAfter the seminar, I went to the front of the room to speak with the presenter. I pointed out the irony of what he said about customers making connections if they can see themselves in a company’s product, when I didn’t see myself represented in any part of his presentation. His response was, “I didn’t choose these companies as examples because they were founded by white men, I chose them because they are great examples of marketing.” I told him to try looking harder. \n\nRedditors, would you please comment with links of amazing women and BIPOC owned companies so I can fill this guy’s inbox with examples for his future presentations? Please and thank you.",
    "title": "Pissed off and looking for examples of women/BIPOC owned companies",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626464187,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "I took the opportunity to raise concerns about staffing levels with a higher up (on my day off) So our one higher up who used to be a nurse comes in for semi-regular \"drop in\" sessions to discuss any concerns we have. For months myself and others have been complaining about how our staffing levels (4 people in the afternoon with 1 x 1:1 eyesight incorporated into this number for a 16 bed male acute mental health ward) I identified it as a main reason for me going off with stress, and I knew if I didn't take the opportunity to talk about this I would be annoyed at myself.\n\nThe director listened to my concerns, and actually appeared to take them on board. He agreed that from my lived experience of the ward, and the others in the session backing me up, that there needed to be a discussion with the ward managers about the fact that they are allowed to go over budget as long as they can justify it, and the reasons given in the discussion with myself and the others in the room were cause for concern. Myself and a HCA expressed that there were lots of times we felt scared or vulnerable (the HCA has been in the trust for like 30 years, he knows his shit)\n\nI did repeatedly express that my own manager is really supportive of the ward, me personally and that our team is excellent, with a great mix of skills. In fact my manager had the ward operating on a higher number of staff before she felt increasing pressure to reduce costs. One of my concerns is that we weren't utilising the teams potential as more specialist/auxillary team members were called in to do nursing team work which was also considered.\n\nOverall it was actually a really positive experience and I'm glad I did it, although my avoidant PD traits and anxiety were pretty high leading up to it (pulse went from 58 to 134 lol). He stated that our new COO has already asked for an emergency meeting about staffing levels for inpatient ward, and asked for my consent to use my experience (anonymously) as an example of the atmosphere on acute wards. Soz if anyone has a director/higher up that at least tries to appear to care, I would recommend getting a few people together to discuss concerns.",
    "title": "I took the opportunity to raise concerns about staffing levels with a higher up (on my day off)",
    "subreddit": "nursing",
    "timestamp": 1623338512,
    "score": 27,
    "keyword": "mixed race director"
  },
  {
    "text": "Nursing Orientation frustrations BACKGROUND: I am a new rn grad with very little experience as an agency where I worked per diem as a school rn and nursing home rn. During this time I also kept my part time job as an ICU clerk of 10 years since I was waiting to get a position within. I kept applying to various positions for 5 months until I decide to go with another hospital overall. That same day I told my manager I was going to leave, I was offered a position that I didn't not apply for. I never applied because that unit is notoriously known for how horrible it is. This particular unit got new management and 13 staff members left within 1 year. But I was happy to be offered anything and I took it anyway because I figured I'll stay positive and make my own experience out of it. Orientation for new grads is 8-9 weeks as I was told, first 3-4 weeks is classes mixed in with actual floor time. \n\nPROBLEM: at this moment I'm on week 10 of orientation (an extention was granted) and I had 11 different preceptors. I only had a solid 3 weeks of the same preceptor and for my last week she's on vacation. So now on my last week I am supposed to precept with another person but at least I precepted with her 2x already. This unit is tele/dementia, it is the only unit to have roam alerts. The ratio is 1:8. Acuity means nothing here. I cannot seem to get a flow down because I'm constantly changing preceptors and I also train on a different unit every once in a while in case I get floated there. The other unit is amazing to work on because it's Tele only and the ratio there is 1:6. So I have an issue w/ time management, a big one. Everyone teaches differently and as much as I love taking in different approaches and styles, I just can't do it with 11 people and never getting chance to follow their flow. So the 1 steady preceptor I have, is really nice but I know she's anxious and wondering why I am always late w/ things. A few preceptors have told me I do too much PCA work and do not delegate enough. But how can I delegate tasks w/o knowing how to do it myself? Some things like changing colostomy bags, blood draws, etc I need to learn how to it myself. But its only now that I'm figuring out how  I have to learn this on my own time and not on my preceptors time. \nEveryone sees me running around like crazy trying to do things on time and that made it's way to my current manager. I also vented to educator how horrible of an orientation this is and I felt like quitting at the moment because it just keeps falling on deaf ears. Even our director told me she know \"we are having a hard time with preceptorship but just hang in there and keep learning from everyone.\"\n\nI have cried endlessly going to work and coming from work and just on my days off in general. I'm pissed off that my manager had audacity to tell me that I have to bring my A game next week because it's my last week of orientation and I will not be getting an extension. Not that even want an extension at this point because I find it useless but why am I being blamed for this? I feel like I'm just starting to get flow because I finally had consistency with 1 preceptor for 3 weeks. My first 2 days on the floor I was shadowing a preceptor that barely taught, was 3 months pregnant, pissed off about having me unexpectedly (originally assigned preceptor switched shifts), pissed off about her assignment and had an injury and went home in the middle of shift. The first day we had a rapid that turned into a code blue x3 that lasted nearly 2 hours. I truthfully cannot say that I learned anything that day or the next day. Legit waste of my time. I feel like I had to learn everything in 3 weeks. And I just don't understand if this is an expected experience. I knew orientation would suck, especially on that unit but this is not what I bargained for. Am I going nuts here? I shall see what next week holds for me. Anyone experience anything like this or have something to add?",
    "title": "Nursing Orientation frustrations",
    "subreddit": "nursing",
    "timestamp": 1631343333,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "PLS HELP RESTORE MY FAITH IN HUMANITY I just finished my first year as a bilingual Kindergarten teacher. I know what you're thinking... \"you signed up for hell when you chose Kindergarten\" but those sweet little psychos and their families are the only thing that kept me going this year.  \n\nThere are a lot of people involved in this so here is a key for who they are. \n\nU = other bilingual teacher \n\nP = director of human resources\n\nA = executive director of human resources\n\nG = superintendent\n\nK = principal\n\nB = vice principal \n\nJ = ESL specialist\n\nHere we go...\n\nAugust 2020 I thought I had found my dream job. I had moved back to my hometown where my parents have taught for as long as I could attend school. It was my dad's dream to one day get ready with his wife and daughter in the morning to all go to school to teach. So when he heard I got a job in the same district they teach in, he literally got tears in his eyes. (He was a computer teacher...so, he doesn't cry much. Lol) I had been collecting bilingual books since college and I wanted to teach at a Title I school where I could help where the most help was needed. So.... literally my dream job. \n\nSkip to October 2020, the kids have now been in school about a month. I was loving it..masks, desk shields, and all. October 14th was one of my students' birthdays; one day before mine. We celebrated and I had let the birthday boy pass out his cupcakes WITHOUT A MASK UGHHH. (Later, they asked people in charge of COVID stuff if my class had to quarantine and they said no bc it wasn't long enough of an interaction) Anyways... It's October 15th, 6:00am and I get an email from birthday boy's mom that he has COVID. rip. I come rushing into school asking what I'm supposed to do, contact tracing, etc. The nurse asks if we followed protocols & I responded yes except for the cupcake incident. But I told her to check with U , the other bilingual teacher, because she posted a video of the kid with two other kids sitting together without a mask on Seesaw. (We switched classes and taught each other's classes daily)  I go tell U to expect the nurse because my student has COVID and she freaks out bc she never has her mask on either. \n\nThen, I get called to a meeting with the nurse, U, and K (the principal). K tells us that two of my students will have to quarantine because U could not confirm that she asked the students to put the masks on within 15 minutes. We're sent back to class and I get an email about another meeting with K and U during my planning time. I go and K lets me know that U has concerns. Apparently, U has been feeling for a while that our students' parents are comparing us and that I am purposely trying to make her look bad. I tell her that I was just trying to give the kids as much resources as possible and didn't mean to make her look bad. She loses her shit and yells that she can't trust me and that I just want to be better than everyone. K tries to calm her down and then it's time to go pick up the kids from specials. I finish my day feeling really freaking confused and get an email about AN AFTERSCHOOL MEETING. I sit throught another meeting where U compares me to a 17 yo highschool girl (I am 22 and she was in her 50s). I am not exaggerating when I tell you that this woman stalked my SEESAW ACCOUNT to see if anyone had their masks off and was ready to show a file-folder portfolio of it and then proceeded to SCREAM that I'M a traitor. I couldn't get a word in because K proceeded to YELL AT HER to be quiet and stop talking ...no college program or professional development could have prepared me for what was happening before my eyes. Then, the lord answered my prayers and K told me that I could go so that her and U could have a private conversation. \n\nEventually, K tells me to try to be considerate about how my relationship with parents could be hurting U. Despite my own morals, I stop sending as much resources out. Meanwhile U has been at work on the other 4 Kindergarten teachers on the team. She tells them how I'm a traitor and that I think I'm better than all of them. I try to still interact with them but they start leaving me out of things and eventually have their own group chat without me. \n\nA few weeks later, I share with a colleague that I have known since I was 5 that I feel like I'm being bullied. That colleague shares it with K, the principal. The kindergarten team has to have a meeting with K because two other teachers were verbally fighting in the hallway. But, they had already beefed it out so the attention turns to me. Except I had NO IDEA we were about to talk about why I felt bullied. This was basically an opportunity for the other teachers to openly shit on me for having a \"communication problem with my teammate\" and for not \"socializing enough\". \n\nAt this point, my anxiety (which is usually controlled by medication) was off the rail and I felt completely alone. I went to see my doctor and she upped my dose and gave me additional meds which gave me KILLER side effects. I had to absent a few days. Because of the shortage of substitutes, the teachers had to split my kids up and this gave them more reason to hate me. FML. I come back and K has a meeting with me to tell me my team was upset with me because of my absences. I explained that I was having major side effects from the meds and I told her why I was anxious lately. She said she would push my eval date to later because she wasn't sure if I would be ready.  A week or so later I get a \"coin of excellence\" from  superintendent G because my students' parents are writing him emails about how happy they are. Soon enough, K calls me into her office and tells me she doesn't think she will consider me for rehire. I tell her that I would love to work on whatever it is she wants but I need specific examples of what she wants me to do. THESE WORDS WOULD COME BACK AND BITE ME IN THE ASS.  \n\nIt's now the day of the holiday party (right before our Thanksgiving/Christmas break). Our class is supposed to watch the Polar Express and I've created the cutest lesson to go with it where the kids create a book of tickets with a kind word for each of their classmates. One of the other teachers got sick and left so I had 5 of her kids come into my classroom that had no more chairs left. I get them settled and the kids continue working on the activity and watching the movie.  Then K and B (vice principal) come busting in. K tells me that B will watch my class and that I'm going to follow her. K tells me to take a look at my class and then she walks me outside of the room. She then proceeds to walk me to the other monolingual kindergarten teachers rooms and audibly says, \"THAT'S what I want you to do. That's what I want your class to look like\". The teacher was sitting at her desk on her laptop, the kids were all silent in their desks and watching the movie. She took my to the other classroom where it looked the exact same.. teacher at desk, silence, kids in chairs watching the movie. I tried to explain to her that I created an activity to go along with the movie but she told me to stop either the activity or movie immediately. We go back into my classroom where my students are literally rolling around the floor even though the vice principal was supposed to be \"watching them\". I get them to settle down and turn off the movie. K walks me around the room and points out everything that's wrong. Literally the definition of a Party Pooper. \n\nI've had enough at this point so I go to HR. My mom knew P (the director of HR) and assured me she would help. She was wrong. P listened and told me to sit down and have a talk with K after we return from the break. She also said she'd get me some district support since it sounded like I didnr have support at school. \n\nAfter break (January 2021) we have professional development before the kids come back. Things seemed fine with K and I was worried of stirring things up further. Things were NOT fine with K. She told me that J would now be in my class daily for about an hour to help me out. I thought this was for support until J ends up trying to boss me around and telling me that I'm not doing my job. That day I tell her to get out of my classroom because she is being a huge distraction to my students. If things aren't bad enough... I start getting a terrible cough. Eventually I have to leave early on a Friday because I feel really sick and completely lost my voice. Over the weekend, I have to go to urgent care and get a COVID test. The test comes out negative but the doctor is convinced it's a false negative...so, they write me a note and tell me I need to quarantine. I tell K, my team, and HR. HR then responds and tells me that my note doesn't qualify and that I will be docked after my remaining absences are used. I tell them that, in that case, I will be returning Monday. They then state that they will not allow me to return until I feel better... But, I will still be docked. That sounded like a bunch of balogna so I contacted my teacher union and she managed to get them to agree that if I can get a \"clearer note\" that I will get paid COVID leave. Please keep in mind that I'm dying of a fever and fighting off possible COVID. I call the urgent care enough to get them to pity me and they write \"due to covid symtoms\" on my note. Suddenly, those 4 magical words made my note \"qualify\". They give me the paid leave and I have about a weekend to recover until I have to go back. \n\nI get back to my classroom and someone has taken down all my students work in the hallway.     It's my first day back and K comes back \"for an observation\" and tells me how \"out of control\" my kids were while I've been gone. She tells me she'll need to meet for conference. During my conference time, she tells me how out of control my students have been while I've been gone. (Which hadn't been the case as evident by all the days that I had been texting with the substitutes) She then hits me with the, \"do you even want to teach kindergarten? Do you even want to be a teacher?\". I say, \"yes...I love teaching\". She responds, \"then you need to get better at it. It's not working out for you.\" She doesn't get enough time to shit on me because my students end up banging at my door because I was late to pick them up from specials. So, she tells me I need to meet after school. She tells me more BS and how she's not the only person that thinks I'm a terrible teacher. She says that my colleagues can never teach anything because of me, etc. \n\nI email superintendent G as soon as I leave the meeting and tell him to call me. He calls me that evening and I tell him everything. I'll give him props... He really had me thinking that he was going to \"fix\" this. He says that he wants me to continue in this district and that he would get A (executive director of HR) to give me a call and help me out. I tried to tell him that A was already biased because she was pissed about the COVID teacher union incident but he said it was fine. It was not fine. \n\nA ends up calling me eventually and tells me that she is going to tell me the exact same thing that P told me in November... To just sit down and talk to K about my feelings. I tell her I've tried but K is always aggressive and so she tells me to just try again. I email K at ungodly hours (because I'm not sleeping anyway) and tell her in the most professional way to please leave me alone so I have time to practice what she wants from me. So, she says that it's fine but proceeds to send in J to spy on me. \n\nI'm not taking that for an answer so I email superintendent G and tell him that I appreciate him sending me to A but K is now, by definition, harrasing me. He tells me to keep working with HR on the matter... But, he gets nervous so tells A to send me a discrimination and harrasment form so it can be investigation. Despite me telling him I'm uncomfortable with A doing the investigation, she is in charge of it anyway. \n\nIt is now mid February and have lost 20 pounds  (making me underweight), I have developed insomnia and the anxiety has turned into depression. Everytime the door to my classroom opens or I hear a knock, my heart races and I cry on the way to school every morning. I tell A that until she can assure me that I will not have contact with K, I am not returning to campus because I don't feel safe. She eventually agrees for B to be my \"point of contact\" instead of K while the investigation is going on. Those couple of weeks, I had to sit through meetings with B and U where U would just scream at me the entire time and B would try to calm her down.. but, they were the most peaceful I had ever had that school year because K was no longer harassing me. \n\nBut good things don't last, so A tells me that she has concluded her investigation and has found that all the adverse actions I have faced is due to my lack of success as a teacher. What did I expect? Soon, time for resignation approaches and I choose to resign for the upcoming school year. But, I'm still seeking justice bevause I cannot imagine another teacher (especially someone who doesn't have anyone experienced in their family) going through this hell. I talk to my teacher union but the dates of my membership makes them unable to help me with the situation so they refer me to the EEOC. I also get in touch with Workers Comp (who later calls me back and tells me that my principal was only trying to help and now I'm retaliating). But, EEOC tells me to continue documenting everything and to contact them again at the end of the school year. \n\nSkip to the last 3 weeks of school... K and B come down and tell me that I haven't scheduled my final appraisal so I'll have to do it now. I tell them I refuse because I've been asking for a different appraiser all year. They tell me that they will call HR and get it figured out. Later, B comes back and tells me that HR will also be at the meeting as witness and that we are meeting after school. I show up and managed to get all my ratings moved up  on the appraisal because of the evidence I present and K feels pressured since there are 2 witnesses. Then, A tells me that there are district employees that feel threatened by me so they are placing me on paid leave for the last 2 weeks. They take my keys, laptop, and that's it. I have to come pick up all my things about a week or so later and I'm not allowed to talk to anyone other than A (according to the letter the \"superintendent\" sent). I also talked to a school board member who says that what I went through was awful but there's nothing he can do. \n\nI can't get in touch with EEOC in my area but I have time for that... I still plan on bringing ally evidence to them as well. My current issue is that I just got 2 job offers and accepted one. However, when the new principal called K, she spewed all the same BS about me. So much for starting over... Like it wasn't bad enough she harassed me and ruined the year before. The principal wants to risk hiring me... But she admits that now she feels the need to have her eye on me. \n\nSo, that's why I'm here. All school year and summer I've been trying to advocate for this type of situation and show that WE DONT HAVE ROOM FOR THIS. There is already a HUGE teacher shortage... Why are you trying to get rid of the ones willing to come in and take the challenge?? And you wonder why retention rates are so high??? \n\nI am still being bullied by the district I grew up in and that my parents have served in for years and they're getting away with it. This is a shot in the dark... But I need help. What do you do when no one will listen? I have recordings of almost all of this...even when she said the infamous, \"Do you even want to be a teacher?\". And yes... I've showed this to everyone involved but they chose to ignore it. \n\nPlease help. \n\nLove,\n\nA heartbroken kindergarten teacher",
    "title": "PLS HELP RESTORE MY FAITH IN HUMANITY",
    "subreddit": "Teachers",
    "timestamp": 1626837564,
    "score": 22,
    "keyword": "mixed race director"
  },
  {
    "text": "What’s worse than an entitled sports parent? Working with one. I still cannot believe that this interaction took place between me and one of my coworkers today…\n\nLong story short, I mixed up the days that I thought eligibility grades were being pulled. I thought it was last week, and that most of my student athletes would be good to go, however the grade check was actually today. So I updated grades this weekend, with zeros entered for an assignment a lot of students forgot to turn in. My gradebook is fairly new, and the assignment was part of a new weight category, so those who did not turn it in took a huge hit.\n\nCue panicked/angry athletes and sports parents who are now worried about being able to play this week. Most of the kids were understanding and accepted my apologies and communicated with me on how to fix things for next time.\n\nHowever, I had this one football parent email me multiple times throughout my prep, asking why only one assignment was causing his son to fail when he had an A in the previous week. I explained the situation to him and apologized for my mistake in entering the grades at the wrong time. He replied saying that he was just disappointed that his kid wasn’t going to get to play this week and that he thought it wasn’t fair that he was failing because of one assignment. I thought that was the end of it.\n\nNope.\n\nDuring one of my passing periods, I had a man come into my classroom and request to speak with me. It was the football dad. Come to find out, HE IS A COACH AND PE TEACHER AT OUR SCHOOL. He all but demands that I change his son’s grade and email the athletics director and ask that he be allowed to play. He kept saying that he “didn’t want to pressure” me but at the same time kept dropping hints that I’m the past he complained to the principal about teachers who wouldn’t change grades for his child and that the principal would usually be “very unhappy” with those teachers.\n\nI told him that I would do what he asked just to get him to leave me alone so I could start my class in peace. I later emailed the athletics director asking if the kid could play… with a prompt follow up email with all admin CCed detailing the circumstances that led me to making the request; that a staff member chose to interrupt my class not only to pressure me into changing an athlete’s grade for elligibility (which they explicitly forbid), but that it was also done solely for personal interest. The absolute inappropriateness of the situation still has me baffled. I’m making popcorn while I wait for what happens next.",
    "title": "What’s worse than an entitled sports parent? Working with one.",
    "subreddit": "Teachers",
    "timestamp": 1630389746,
    "score": 11,
    "keyword": "mixed race director"
  },
  {
    "text": "Admin Overhauls Leads to Restructure Looking to vent and see if anyone else has dealt with a similar experience to mine. \n\nContext: I just completed my fourth year of teaching, this being my first year completed at a new school. I currently work at an elementary school in a suburban town in a small state. My position was Inclusion Teacher, which basically meant case manager and direct instructor for students with significant disabilities, including EBD for grades K-4. This meant I had about 7 students on my caseload who have very heavy IEP services from speech, to OT, to PT, to direct special Ed for all academic subjects. \n\nSituation: This summer my school district had some significant administration changes (broke off from previous SAU, new superintendent, new special ed director, new principal and VP). Now, 3 weeks before school starts, the special ed team received an email stating the structure of the program is going to change. My position no longer exists and I am now being told I will be the Kindergarten case manager. This means all the \"heavy hitter\" students will now be mixed in with all the other special ed students. My previous students now will have less access to a case manager and private work space. Additionally, my caseload is going to skyrocket. \n\nAside from the technicalities of the change system-wide for the school, I'm mostly upset that now I'm starting from square one again. I had made connections with all my families, built trust with my students, and learned the ropes. Now I've been given a new position with little prep time that I didn't ask for. I took the inclusion job because my specialty is individuals with significant needs and/or multiple disabilities, and now I'm back to being a general special educator (the job I left prior to this position). \n\nThanks for giving me a space to vent, and any feedback is much appreciated. \n\nTldr: Got an email today saying my position no longer exists and instead I'll be a kindergarten case manager, when I'm only on my second year at the school where I took a position for intensive needs students.",
    "title": "Admin Overhauls Leads to Restructure",
    "subreddit": "Teachers",
    "timestamp": 1628117085,
    "score": 5,
    "keyword": "mixed race director"
  },
  {
    "text": "I teach at a hybrid school that caters to homeschool students/alternative education. The school has a no mask policy...I'd like advice. I teach middle school English and middle and high school student government at a private school that runs a hybrid program (think 2-3 days per week, depending on age and subject matter), the rest of the days are \"at home.\" The directors are extremely conservative, Trump supporting, anti-mask, religious/evangelical, closed-minded individuals. For example, three weeks into the Covid situation (beginning of April 2020), their families stopped wearing masks, got together for parties, etc. Their policy was that if everyone just caught Covid, then we'd all be immune. Their families all got Covid, and they believe they're fully immune and that Covid was nothing more than a sniffle, and so there's no need to take precautions. They've decided, since our city has a mask-mandate indoors, to hold all classes outside, mask-free. A lot of the students' families are also anti-maskers. Also anti vaxers. \n\nMy issue is that, with cases rising, I no longer feel very safe holding classes. Further, we routinely have 90-100 degree weather, bad air-quality (forest fires each fall), so I don't know how logical it is to hold an English class in a field or in the outdoor lunch space. My second biggest issue is that, if Covid were to get a lot worse in say, a month from now, I don't have faith in the directors to have my best interests at heart. I feel like it's time to quit. I teach part-time, and I don't make much, and I don't need the money. \n\nI'm looking for advice. I know that I can get carried away and am prone to reacting to fear (I have a diagnosed anxiety disorder, OCD, and bipolar disorder...needless to say, stress and I don't mix well...). I want to make a logical decision, based on facts and not fear, and do what's best for me, my family, and ultimately my students. What would you do were you in my shoes? And what would you say to/request from the directors of the school?",
    "title": "I teach at a hybrid school that caters to homeschool students/alternative education. The school has a no mask policy...I'd like advice.",
    "subreddit": "Teachers",
    "timestamp": 1628450071,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Afterschool care--Child feeling underrepresented? Hi all! I'm hoping to get some advice or directions to resources to help me talk to a specific student about race. For context, I am White and the student is Black/mixed, so I want to make sure I can answer her questions in a manner that is situational appropriate, knowledgeable, and sensitive, so that she feels supported.\n\nFor context, I am currently working at an elementary afterschool program in a \\*heavily\\* White state. We are one of the most diverse schools in the state, and there are many BIPOC children in the program, but in the Kindergarten group where I work, of the everyday students, only this one girl is mixed, and the rest are White. One of the directors of the program is Black; but other than that, all of our staff is White, and I believe most if not all of the regular school staff is as well.\n\nThe one girl I mentioned has started asking questions about \"Why aren't there any Black teachers?\" and the like, and I want to give her solid, age appropriate answers, but have been finding myself somewhat unsure of what to say. My instinctive internal answer is along the lines of \"there is still inequality and discrimination, and although this program tries to address this by incentivizing applicants of different identities and backgrounds, there just aren't many BIPOC people in the area\" but that seems a bit discouraging/like its never going to happen, and I feel like telling a 5 year old \"this is just how it is\" is a bad approach on several levels. Because of that, I've kept more to just validation, saying \"you're right, there aren't many Black teachers here and we should have more\" but she doesn't seem satisfied with that answer (considering she keeps asking) and I am not entirely sure what else to say. I've also tried to help her feel represented in other ways--the district \\*does\\* try with diversity, so we have plenty of books with Black characters and written by Black authors, coloring pages with popular characters from those books, etc, which I have been making an effort to request as afterschool materials we can use. \n\nHowever, I still feel like there must be ways to answer her questions at least a little more directly, instead of always deflecting. She's very smart and very self-aware, so my inclination is to try and give her a real answer, but she's also five, and one student among around 10 that I am responsible for, and we are only together for a few hours every week. I don't want to oversimplify a complex situation, but I don't know that I have the time or ability to really get into it. I have also passed all of this on to my director, who clearly sympathizes very closely and personally, but does not have the time to do much more than pick out some books for us to read together. \n\nSorry this post turned into something so long and rambly--TLDR; White afterschool staff, Black Kindergartener, how to talk to her about the lack of diversity she sees at school.",
    "title": "Afterschool care--Child feeling underrepresented?",
    "subreddit": "Teachers",
    "timestamp": 1621387740,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Found out I am the lowest paid in my department, asked for a raise and got ignored, what should I do? I did my graduate internship at a very large company and after that I got offered a very good position.\nI didn't have any previous experience but all my supervisors were very happy with my performance and even the VP of the company congratulated me on the job offer. I am 23 years old and my position is Junior Manager.\n\nWhen I got offered the job it was in the middle of Covid and I didn't negotiate my salary, just accepted what they gave me.\nAfter 1 year I decided to talk to my supervisor, I had already received a personal email from the VP of the department and my Area Director congratulating me for the great performance I was having and I had found out that previous people with my position used to get paid 5k more than I am currently getting paid.\n\nI also found out that people in the same department but with different (less important) job functions (where I did my internship) where getting paid around 2/3k more than I was.\n\nMy next position in the rat race would be manager, and the only difference really is the title. Apparently before Junior were managing only 2 accounts, and there weren't really big or important accounts, yet still they were getting paid 5k more.\nWhen they hired me I guess due to staffing shortage they gave me the same workload as the managers, I have been managing 5 accounts 3 of them big and important and I have been doing an excellent job. The same number of accounts and with an overall similar portfolio value than the people with the manager position are managing. \nTake into account that managers are making minimum 8/9k more than I currently make.\n\nKnowing all this and that my results were very good I went to ask my supervisor for a raise.\nMy strategy was the following, instead of directly asking for a raise, I asked him what did he thought I could improve in order to get the promotion.\n\nHe admitted that I have been doing an awesome job and that the job I have been doing is the exact same as of the managers so he sees me already as one, but that due to my age I may need to wait a bit longer to get that promotion.\nI said okay I understand and I am not trying to be pushy but in anyway I would like a salary increase, I told him look I know I am being underpaid and I love this company  I am not trying to leave or anything but I am scared that given that I already started with a below the average salary even if I get a promotion next year I am always earning behind what the range for the position is, in order to reduce this risk and because as you said I have been doing the same work as the managers I would like a 5k increase.\n\nHe said that he would talk with my direct boss but that maybe it's better to wait a bit longer before asking and that I shouldn't ask him because he will talk to him (they are personal friends).\nNow my supervisor is leaving, and I don't know what to do, should I just go talk to the area director and ask him for the raise? I like the company and my colleagues but I am getting very burned out knowing that they are basically taking me for an idiot and not paying me what I deserve, I mean there are fucking morons that are doing shit that are getting paid more than me, while me on the other hand I can't even move out of my parents house with the money they pay me",
    "title": "Found out I am the lowest paid in my department, asked for a raise and got ignored, what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1640351806,
    "score": 265,
    "keyword": "mixed race director"
  },
  {
    "text": "Career ideas if I like puzzles and challenges? Right so I realise the title kind of makes it seem like I enjoy racing against the clock to do jigsaws but hear me out.\n\nWhen I say I like puzzles I mean I enjoy basically anything where I have to figure out what the problem is, why something isn't working, how to fix/solve it, how to improve efficiency.\n\nI pretty much can't stand any work where there isn't a challenge, but I can also make a challenge out of almost anything. I worked in a factory for 2 summers packing 25 mini packets into a bag, then 10 bags into a box and stacking it onto a pallet. I broke the company record for most packing done in a day (several times), reshuffled my tasks to make it more efficient, and found a way to stack the (slightly wrong shape/size) pallets that was more stable. It was boring and I really, really want more variety in career work, but I'm pretty good at creating challenges, as long as there's some quantitative measure I can use.\n\nI'm decent at working with other people but previous jobs have taught me that I'll be miserable if I'm always working with customers. \n\nI'll be graduating in the summer with at least a 2:1 in law + Spanish from a decent uni, I've done temp jobs and have a year running a charity project at uni that involved managing a group of volunteers and coordinating with funding providers, directors, etc.\n\nRight now I'm just applying for random jobs but I'd love to have a bit more direction. Any ideas?",
    "title": "Career ideas if I like puzzles and challenges?",
    "subreddit": "careerguidance",
    "timestamp": 1618398994,
    "score": 9,
    "keyword": "mixed race director"
  },
  {
    "text": "How do you get out of retail management? Trying this out because I’m feeling desperate, any advice is appreciated. I’ll try to be as specific as possible as to get the best advice. \n\nI’m 28 years old, I have my bachelors in psychology(kind of useless I know) and I’ve worked in big box retail for 8 years, management for 5. I’m a mom of 2 little boys who are only 1 and 2 years old, they’re 18 months apart. I received my most recent promotion 3 months ago and I feel like it was a huge mistake. I’m taking the position behind someone who was very well liked but let a lot of things slide that hurt the business and I’m cleaning up their mess, not to mention Christmas in retail is emotionally scarring for everyone involved. I’m a salaried manager with 3 leaders under me and probably about 80 team members. I’m required to work a minimum of 50 hours a week and almost all of my peers at other stores do more than that. \n\nMy first huge issue is the work/life balance, it’s not there. If I’m sick, I’m expected to be there, not to mention anything involving the kids. You’re judged hard for taking any kind of sick or personal day, but the worst part is that if I do it really details my business due to payroll allocation being so bad in January. They literally need bodies in the building. \n\nMy second huge issue is how powerless I feel as a manager. When I took the job, one of my subordinates told me they wanted to be fired so they could collect unemployment. They talk loudly and frequently about how much they hate the job, but the company is SO afraid of being sued that I have no ability to fire at will. I have to go through a loooong grueling performance management process, and it has to be perfectly in line with company expectation(that I was barely trained on) or I can’t even write them up. I also recently had an employee call out corporate HR and tell them I’m racist with completely and entirely made up examples of me being racist, outright made up. I know it’s hard to believe people in the internet when they say this, but they’re lying. And the higher ups know they’re lying, but again I cannot do anything about this, their recommendation is that I never speak to this person in private even as they spread lies to people about me. I’m very upset about not being able to defend my character. I’m literally in a mixed race relationship, which I know doesn’t automatically mean I’m not racist but still. \n\nAs for the job, I lead our entire salefloor operations: inbound, general merchandise, food, and in store fulfillment. I run a $30M process. I am wildly passionate about team development and have helped get a few of my employees promoted, I’m also very results driven and skilled in finding stopgaps in processes. \n\nI’m looking for something with more work life balance, less office politics, and maybe something that doesn’t require me to work every weekend.",
    "title": "How do you get out of retail management?",
    "subreddit": "careerguidance",
    "timestamp": 1609906610,
    "score": 9,
    "keyword": "mixed race director"
  },
  {
    "text": "Job offers in which the title is lower than previous title but the work is a little different? What is your opinion about accepting a job with a lower level of seniority than your current or previous job?\n\nI received a job offer from a large company in which I like the team and the work but the only negative thing is that I am being given a lower title. Previously, I was at the principal level in a company that is in the same industry and similarly sized. For this new company, I had interviewed for \"senior product manager\" but the recruiter said they chose someone else for that position and that the hiring manager feels the regular product manager position is more appropriate for me. \n\nThe one thing that might be working against me is that my previous jobs did not have a formal product manager title but a \"principal consultant\" title and my work experience has been a mix of program management and product management.  Regardless, it feels like I am getting a lower title. The salary is also lower by approximately $5-10k.  Also, this company doesn't appear to have a principal level. I think it goes from senior to senior manager or director. So, the hierarchy of titles might be a little different overall. \n\nAny thoughts or advice? Would accepting such a position be a negative hit on my overall resume for any potential future interviews with future companies?",
    "title": "Job offers in which the title is lower than previous title but the work is a little different?",
    "subreddit": "careerguidance",
    "timestamp": 1623369190,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "Quarter-life crisis - what are options transitioning out of R&D? Hi guys,\n\nI'm currently having a quater-life crisis (or third-life I guess) working in R&D as a chemist and would like any advice on other career options that I can transition into with background in R&D.\n\nBackground info: total YOE \\~6 years. Majored in biomed engineering at one of top 10 US schools and have been working in R&D in the CPG sector as a chemist/product development, and project manager. I've been in R&D throughout, with my most recent being a mix of both but more project management. Caveat is, I don't do anything related to medical device, but work on personal care and household products (P&G, J&J, Clorox, Unilever, etc. would be examples) \n\nHaving second thoughts due to dissatisfaction with pay, slow upward mobility, low ceiling (seems like manager/director level is the highest you can go). Also R&D being considered \"lower\" between other departments such as marketing, makes it depressing :(\n\nI've explored other options but have found it difficult due to below reasons\n\n1. Going into full project manager: I don't have PMP certificate (and it seems like only people officially working as project manager can apply for it?) and the company is not willing to sponsor since I'm technically not a project manager\n2. Pharma/Healthcare Industry: I don't have too many relevant pharma experience (such as FDA knowledge)\n3. Management Consulting: really considering this, but will need to prepare for MBA (and that takes couple of years + $$$). I've seen some positions for experienced hires but it seems like you either need PhD/MD or some kind of very niche expert knowledge. Also, heard going into consulting in your 30s might be considered too late.\n4. Equity Research: same as #3, unless you're from finance background, it seems like they're only looking for PhD/MD\n\nAppreciate any further insights from the ones I've listed above, or any suggestions aside from them. Thank you!!!",
    "title": "Quarter-life crisis - what are options transitioning out of R&D?",
    "subreddit": "careerguidance",
    "timestamp": 1625779925,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "How to get on the fast track? I’m a bioengineer in big pharma and don’t have anyone to ask for help. I’ve been looked over several times for promotion and feel that part of the reason might have been discriminatory. I’ve applied numerous times and feel that I’m honestly just not getting anywhere. My metrics are all pristine, and I’ve even been heavily involved in employee resource groups at my job. \nOthers I’ve helped train in my role succeed and even get promoted over me and its very frustrating. I have the same degree’s and qualifications as others and since my company is growing at such a rapid pace I’ve seen this happen numerous times. \n\nPart of it seems like its routed in office politics, but its getting to the point where it feels blatantly insulting and noticed by other colleagues who aren’t involved. I’ve applied 4 times and not received this management position. Hiring Managers have given me feedback, and we’ve generated plans together with goals that i have since achieved. However despite accomplishing these goals I’ve still not been chosen for a promotion. \n\nWe have a black employee resource group at my job and it even feels weird to bring up there. I don’t want to branded as the employee that cried/ pouted when he didn’t get what he wanted. I’m currently studying for the GMAT and hope to find employment elsewhere or go back to school in the next year. I know getting a managerial role will only look better on applications so I feel that I cannot leave.  \n\nI’ve always heard my parents stories of how handicapping race can be in America, however this is genuinely the first time I’ve felt it to this scale. Not getting promoted in the last few years has dictated my purchasing of a house. What should I do?\n\nUPDATE: Just wanted to send out an update. I spoke with a director in our Black erg and she recommended that i speak with a couple of directors of color and meet with them monthly to plan out career goals and eventually meet our new cheif diversity & inclusion officer. I’m not entirely sure whats going on but honestly having people in the company to talk to this about who seem interested in progressing my career feels so much better. I’ll speak with them and let you guys know how it goes.",
    "title": "How to get on the fast track?",
    "subreddit": "careerguidance",
    "timestamp": 1617997833,
    "score": 3,
    "keyword": "mixed race director"
  },
  {
    "text": "2020 was a career defining year. How should I proceed?  Warning: it's quite long.\n\n**Context.**\n\nIn Montreal, Canada.\n\nAm  a business systems analyst. More precisely, an ERP consultant. Bachelor  of Computer Science, started consulting in 2015, but have been in the  Microsoft environment since 2012. I actually do both ERP and CRM  consulting - to a degree - which is a rarity in the industry. My  employer is a single-owner shop, family-business type of deal. We have 2  types of resources: functional and technical consultants. While  functional consultants mostly do the same, there's two of us that stand  out and project lead, me and our household engineer. Fairly flat  structure. There's the boss, and everyone else is flat underneath.  There's a few resources lower than that, but we're talking interns and  the occasional junior resource we put on trial. Interns, which I'm also  officially-unofficially in charge of.\n\n**2020**\n\nWhen  the pandemic went into full lockdown, we went into full overtime. While  some projects were pushed forward a few months, some other customers  went into overdrive. Since my major delivery for 2020 was pushed from  march to september, I was reassigned a perpetual improvement and support  customer to offload a colleague. That customer turned out to be our  largest customer (in customer revenue) to date, and 2nd largest project  (in billables hours/amounts) in the history of the company. Close to  $1Bn in revenue with a world-wide presence. In contrast, we're a shop of  20-ish guys breaking the $1m revenues for the first time in 3 years. I  had the presence of mind to push questioning and opened up major work on  their system, including R&D on our own Intellectual Property (IP).\n\nParallel  to that, when my initially postponed project came back to life, it went  sour. Go live was a mess, and the customer put every effort on hold  while challenging about 100k worth of invoice. Totally killed my  confidence in myself and almost sent me on a burn out, as I had wored  8AM-3AM shifts about a dozen nights in a row to get them live on time.\n\nWhen  they came back with the challenge, I was waiting for them with the  receipts. Destroyed every single arguments about project control and  finances they came up with. Fast forward to today, they're now a  reference customer and bringing us references. So, I must have done  something right.\n\n**2021**\n\nThis is when this gets complicated.\n\nWhile  dealing with the previously mentioned challenge, my major customer went   into full production. Had 3 projects running parallel, plus daily  support. Had anywhere from 2 to 6 devs working with me at any given  time, and it was rarely enough.\n\nWe  had a situation during most of the first half of 2021 where we had  technical resource shortage, mixed with poor global production planning.  This lead us to have multiple issues simultaneously where projects were  due at the same time, with not enough work time on the calendar to  deliver it all. Remember my colleague I took workload off from, well  he's my  engineer. Well, his projects always appeared more important  than mine, even if they were clearly smaller than mine, and my dev time  always passed second to the point I would regularly do multiple tasks on  multiple projects simultaneously with a dedicated dev. Not an ideal  situation, but it got shit done. Late, but done.\n\n**Now.**\n\nNow, I'm on parental leave.\n\nBefore  leaving, we had another little mess with workload. Again, I was not  able to get my workload properly into the devgroup's calendar. All the  time was allocated to my engineer friend. Moreover, my last work week, I  was stuck doing support instead of working on passing knowledge to  assume transition. Meaning the last week I had prior the baby's arrival,  instead of focusing on getting things ready, I winded up working 60-ish  hours. Worst - out of professionalism and respect toward my major  customer, I accepted to make myself available a few times a week for  schedules calls. Turns out, instead of 1-2 hours a week, I'm doing more  8-9 hours because I was not allocated enough time to document and pass  knowledge to my team.\n\nI'm going back to the office in a few of weeks, and my annual revue is within weeks of my return.\n\n**Redefining my position**\n\nThis is where I need your help.\n\nMy title right now is some half ass bullshit that means nothing.\n\nI've  been spending time thinking on how to best define my position/role, in  case I have to move on. Here a more or less exhaustive list of what I  do: (order is meaningless)\n\n* Business analysis\n* Functional design\n* User training/support\n* Project management\n* Area  of knowledge: accounting (advanced), project accounting/management  (advanced), warehousing (not perfect), discreet manufacturing (not  perfect), process manufacturing (basic understanding)\n* Presale proposal writting\n* Presale discovery/presentation\n* Change request production\n* Mentorship/coaching\n* Workload management (individual, team and global)\n* Team lead/management\n* Technical jargon\n\nI've  been talking with contacts in the corporate/institutional IT scene, and  was told I might be becoming \"too versatile\" for that part of the  industry.\n\nHere's what I know I'm not.\n\nWhile  I'm good at presale, I dislike it. But, I'm able to adjust my lingo and  presence for any audience from C-Suite down to the ground floor worker.  (for project delivery as well - btw)\n\nWhile  I'm a great solution designer and BA, I'm not technical enough to  warrant the solution architect label. I produce great designs that are  simple enough for end user to understand, decision makers to approve and  dev to work from, but I know the requirements of a architecture label  and I'm not it.\n\nI know I'm not a true PM. I've read the PMBOK, but I'm not certified and have no intention of focusing only on this.\n\nI  want to move away from pure, executing, functional consulting. I'm good  at it, not the best, but top tier. But it sometimes bore me.\n\nWhile  I do know how to code, I haven't done it in years. Parts due to  laziness, parts due to the fact that I have people that are far better  developers than I am. So I focus on other parts. On the other hand, I'm  far more technical than most functional consultants.\n\n**So what am I?**\n\nI've  heard the term \"Project Delivery Manager\", which could be fitting, but  the problem with a small organization is that manager labels cause  problem. We have a few guys, including myself, lining up for management  role. I regularly bring up the role versus position versus tasks  conversation.\n\n**What should I do?**\n\nWhile  things have been rough lately, my job is like an old pair of shoes.  Comfortable, accommodating, and while there's better-nicer shoes, I  don't want to toss them away. I plan on staying, but the last 6 months  have challenged my long term faith.\n\nFor  sure, I'll be asking for a considerable raise during my upcoming  evaluation. Traditionally, I don't even have to ask as my boss knows our  value and is quite forthcoming. On the other hand, a small business as  limited potential.\n\nI know for a  fact I'm not corp material. While not unruly, I know my way can get shit  done better and faster than waiting on corp to act. So public sector,  banks, major establishments are out of the question. My career goal  would be IT Director. I don't think considering CTO or VP IT would be  reasonable considering my current path and education. Also, got kids at  home with a career driven SO. I have the potential to slow down my  career at some point too to stay home.\n\nI'm  actually on the fence about accelerating or slowing down my career. The  work/life balance for me is quite critical. Which I had before 2020.  Had a good beat, maybe too slow. But 2020 was an absolute insanity, and  the compensation didn't feel appropriate.\n\nI would in no way change for another ERP vendor. No point in changing four quarters for a dollar.\n\nThank you for bearing with me.",
    "title": "2020 was a career defining year. How should I proceed?",
    "subreddit": "careerguidance",
    "timestamp": 1625838465,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance! I'll try to keep this as short I as can...\n\nI am a 26-year-old male, Canadian citizen, with a BFA in dance from a liberal arts college in NYC. I've always been keen on education and specifically returning to school after my Bachelor's. I feel like I am on the pathway to figuring out what I would like to study but I am also very lost.\n\nTo provide some context, I am attended school in NYC from 2014-2018, during that time I struggled a lot with my mental health (anxiety, depression, bulimia). Unfortunately, the dance world was too overwhelming for me at the time, and it did not seem like a career that I have fully invested in anymore. I then had to return to Canada summer of 2019 due to the end of my student visa, and since then I've spent almost every day thinking about getting back on track and discovering myself again.\n\nI struggle with weighing my desires and dream life, and also considering the practicality of it all, especially amidst Covid restrictions. I am firm in that I would like to return to school in NYC—it's pretty much my home and where I feel most myself. Beyond that, I have little idea about what I would like to study. At first, I wanted to backtrack and complete a PostBacc so that I could move into the Nutrition & Dietetics field, which stemmed from my past with eating disorders and my drive to be a person to help those in need as I didn't receive that help when I needed it most and to also challenge my brain in a different way than I had used it during my undergrad. I realized that backtracking to fulfill the academic courses, whether in Canada or the US, requires me either finishing high school level courses in Canada and then moving to college/university level courses, or following the international student requirement PostBacc in the US in only one year. At that point, I realized my passion for the subject wasn't fully present, and that the urge to move into sciences came from low self-esteem as my BFA is often viewed as worthless.\n\nSince then, I've been attempting to do a lot of introspective work, which may also be a disadvantage because I am constantly in my head, to figure out my values, goals, desires, interests, etc. As much as I've been focusing on the things that I don't like or may not seem suitable for me, here are some **things I do know**:\n\n* I am queer and I would like to study/work in a space that allows me to investigate the insections of queerness in today's society\n* I am mixed race. I am Black and Japanese and I am interested in incorporating my background as a part of my studies and further into the political and social climate right now\n* I am creative- as much as I've moved away from my dreams of performing, I am still a creative-minded person. I would love to work with dancers, movers, other likeminded people\n* I am interested in fashion, specifically fashion marketing. I would love to study something along the lines of fashion marketing that includes an emphasis on race, inclusivity of models (dancers)\n\nI have other interests, but I guess those are my main focuses right now. With my job history since graduation including working in the admin fitness industry and short-lived receptionist jobs, I have little work experience that would suffice for a grad school application.\n\nTLDR; I guess I'm wondering, how can I figure out my passions and what to study in grad school considering the pandemic and being an international student determined to live in NYC\n\nThank you to anyone who has made it this far\n\nMuch love",
    "title": "Redditors who have their Master's degree, how did you decide what to study? Looking for some academic/career guidance!",
    "subreddit": "careerguidance",
    "timestamp": 1619471969,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "Please don't neglect your communication skills in favor of improving your leetcode skills One thing I found that doesn't appear enough on this SR is communication. I tend to see any variation of \"Is this offer good?\" or, \"Why do I have to grind leetcode?!\". Most of the on-the-job posts consist of \"I am in a toxic environment\" or \"Should I change jobs?\"\n\nI have a piece of career advice for anyone who is fairly new to the field that I think could prove helpful. \n\nFirst, a little about me as while I'm not going to hinder my anonymity I do feel I'm in a position where I can rightly prescribe advice to newer SE's / grads / those still school: I'm a Principal Engineer, and have a wide array of experience across operations (including release / implementation) as well as experience developing user-facing code, and internal tooling used organization-wide. I've worked in the DOD, networking space, e-commerce, and fin-tech. \n\nJobs I've held include:\n\n* Software engineer (senior/staff/principal)\n* DevOps Engineer\n* Lead DevOps engineer\n* Lead Site Reliability Engineer\n* Tech Lead\n* Software Development Manager\n* Director of Operations\n\nOne of the greatest skill deficiencies I see in engineers has always been communication. Communication is a very important part of our job. It allows us to promote our ideas, defend our solutions, play the Devil's Advocate, request help, refuse help, patronize others as well as compliment them. We can use communication to self-promote or self-deprecate. Communication literally sets us apart from every other species on this planet; that's not to say other species can't communicate, but that you won't see one chimpanzee explaining to another what the functional use of a blow-hole in Blue Whales is after explaining the nuances in their childrens' respective behavior while foraging for food. \n\nHere is a hard reality for many engineers: ***Even if you are the best software developer at your entire company, getting others (employees, external customers, internal customers) to actually use what you wrote is a different beast than writing a tool.***\n\nHere is another hard reality: ***Many tasks rely on others to \"un-block us\". There are of course times when the blocker is stubborn enough that solid communication doesn't help, but solid communication never hurts.*** \n\nIt's not uncommon for a developer to feel like a priority queue that relies on other priority queues which are poorly optimized, and plagued with race-conditions. \n\nBelow are some points I'd like to make on the subject of communication:\n\n**Being direct is not mutually exclusive with being polite**. I often find overtly rude people fall on the \"I'm just direct and straightforward!\" excuse as though it actually is an excuse for their rudeness. Consider different ways to say the same thing. This SR, and many others, while not inherently controversial (rudeness is often derived from controversial topics), is plagued with what I'd call \"direct rudeness\". Most of us who have posted here at one point or another have been faced with someone who disagreed but failed to do so in a way that made us feel any productive discussion was possible. \n\nConsider the following two versions of the same sentence (email threads I've actually witnessed, redacted of course):\n\n>Hello \\_\\_\\_\\_\\_, you are writing a tool that duplicates work done in a tool I've already written. You need to do a better job of communicating what you're working on so we aren't constantly creating duplicate work and wasting time.\n\nHowever, consider had it been structured slightly differently:\n\n>Hello \\_\\_\\_\\_\\_, I noticed you're contributing to a tool which I found here(assume a link to source). I'd like to learn more about your specific needs and perhaps discuss whether $TOOL\\_I\\_ALREADY\\_WROTE would fit them, and if not perhaps we could discuss continuing your thread of work towards enhancing the existing tool-set by adding any features you find it's lacking, as there is certainly some overlap. It'd be great if we could avoid duplicate efforts and enhance a tool that's already in use by the organization. Let me know your thoughts.\n\nBoth sentences communicate the same message, but the former puts the recipient on the defensive and immediately raises a few barriers in their mind. Upon receiving it they will be texting / chatting most of their close-colleagues about what a jerk you were. You turned your potential meeting on the topic into a street brawl instead of a discussion. Sometimes it can work out, but why cause additional stress? \n\nI'd argue that the second version of the sentence still gets the point across but puts the recipient and relative ease and opens a dialogue. To expand upon it a bit more in the second version we acknowledge that the recipient is writing a tool, and raise the concern on the overlapping functionality of that tool with an existing one. The purpose of the email is clearly stated as a goal; avoiding overlap. It's not an accusation but a goal and the use of 'we' puts a collective goal in the recipient's mind. Closing with \"Let me know your thoughts.\" opens a dialogue whereas the over-directness of the first version never actually indicates any interest in a dialogue or common goal.\n\n**Everyone is busy, even when they aren't.** We all need things from colleagues, and some colleagues are naturally more busy than others, and some seem like they're never actually working on anything. It's not our job as developers / individual contributors to judge another's workload (and if it is you should evaluate your company's situation). Many things are cyclical and you may be faced with situations where you need a thing done by someone you do not particularly enjoy working with. I have found strategies in communicating with such people that have been effective, for the most part. \n\nPeople love when you acknowledge \"how busy they are\" even when they aren't ever really busy from your perspective. Consider two people asking you for help:\n\n>Hey \\_\\_\\_\\_, can you please do \\_\\_\\_\\_ for me? This is very urgent and blocking $IMPORTANT\\_THING.\n\nConsider that your $IMPORTANT\\_THING isn't always their $IMPORTANT\\_THING. Your emergency isn't always theirs. In a company that is unified it certainly should be, and we should all be empathetic and helpful when we can and have the bandwidth, but it's not always the hand we're dealt. Consider this slight change:\n\n>Hey \\_\\_\\_\\_, I know you're really busy and I'm sorry to bother you! We have an urgent ongoing issue and I'd really, really appreciate it if you could take some time to look!\n\nKeep in mind these are all suggestions and things that have worked for me, but I've had much better luck with using the second version over the first. To reiterate: People love to appear busy. Especially at work. I don't know what it is about perpetually being busy, but it's a badge of honor in our work culture and to not be busy is to not be relevant. ***Also keep in mind that you yourself are not a metric by which to judge people. If you put in 80 hours a week at your salaried job, that's your prerogative. Do not hold that expectation of others.***\n\n**Strong opinions are still opinions.** This one is very relevant in our field as there are many subjects which are inherently based on opinions which draw a lot of controversy. Spaces vs tabs, programming syntax, which language to use, which tools to use, log formatting, etc.. Sometimes we're opinionated about the problems that need to be solved. Do they need to be solved? What's the reason we're solving it?\n\nAlways be self-aware of when you're prescribing your opinion vs. when you're prescribing factual-based information. Pick your battles. If you like tabs, and the project uses spaces, that is not the battle to pick. It's not even really worth a mention unless you can do it without being a jerk. If you want to prescribe your strong opinions onto others then be prepared to back up why you wish to do so.\n\nI recommend being objective, always. Do not make statements that cannot be backed up with other objective statements and explanations.\n\nIdentify why you're so strongly opinionated. Can you present your opinion in a way which shows it derives some mutual benefit?\n\nSometimes one opinion can be stronger than another opinion but this is usually rooted in **facts or history.** For example, the spaces vs. tabs talk is inherently based on opinion. If you walk into a project which uses tabs, and you are a spaces person, you ***do not just reformat the whole project to spaces. This will only make you appear to be an asshole.*** This is also a case where your ***opinion is wrong. Not in that one is superior to the other, but the fact that now when I run a diff in SCM across to revisions, you just created a shit-ton of change where there actually was none, making debugging harder and all because you felt your opinion was superior.*** \n\n**In closing -** I just wanted to possibly help some others in their communication style by providing some examples where I saw what I'd consider communication miss / failure, and examples that have personally worked wonders for me. I'm open to any additional input / advice / suggestions that could help others, as well, including if you want to indicate anywhere you disagree with the things I've said and make suggestions I might not have considered.\n\nJust always be aware that if you aren't communicating at your job, something is wrong. If you aren't communicating ***effectively*** then you are going to hit unnecessary hurdles in your career; a career that is inherently difficult to navigate given the constant churn on technological advancement / changes. I highly recommend any new engineer to host as many lunch and learns, and project demos as they can (code you wrote, tools you wrote, etc..) to improve these skills early in their career, as it will pay massive dividends in the years to come. As for written communication, if you are communicating something that feels edgy / difficult, then sit on it for a bit and proof-read / reread it. Pretend you're the recipient and how you'd respond if you received it from yourself. Consider your relationship with the person you're sending to, and how they respond to and consume various types of communication. Always be learning about your peers and learn how to navigate their personalities in ways that increases your success without inhibiting theirs.\n\n&#x200B;\n\nThanks for reading.",
    "title": "Please don't neglect your communication skills in favor of improving your leetcode skills",
    "subreddit": "cscareerquestions",
    "timestamp": 1634747902,
    "score": 2983,
    "keyword": "mixed race director"
  },
  {
    "text": "How do you plan for a long, technical-focused careeer in CS? >**TL;DR**: How to age into an old fart (but young at heart and brain) in a technical, CS-related career?\n\n(long post ahead)\n\nHi,\n\nAs the title says, I'm curious about what others in this sub would do to build a long career in tech.\n\nThere are two articles mentioning that a CS career could be long-winded:\n\n* [Teach Yourself Programming in Ten Years (Peter Novig)](https://norvig.com/21-days.html)\n* [A forty year career (Will Larson)](https://lethain.com/forty-year-career/)\n\nFrom this post, I want to learn more about different \"paths\" one can take for a \\~30-year++ career in 2021. In addition, tips on how we could get more out of a long career will be great additions, too.\n\n*To start, I 'll share my take later in the post.*\n\n========================================\n\nIt is definitely welcome to hear from a wide range of experiences. But if you want to focus the discussion, I'm interested in \"paths\" with these traits:\n\n## Lean more towards the technical side (vs people management)\n\nI tend to enjoy concrete work, e.g: writing code, running system, etc. However, things that fall under the \"soft-skill \" umbrella is also OK. I'm just not fond of roles where you end up a meeting-goers every day, letting your technical chop get rusty.\n\n## Reward you for technical \"expertise\"\n\nHere, \"expertise\" means the  ability to solve and understand complex problems in your field.\n\nSome older engineers I know are very good in their field of choice. They also get paid well for it. For example, these fields are: data-center networking, software performance engineering, designing high-availablilty system, writing formally-verified software, etc.\n\nIMO, having expertise in these areas seems like a good way to build your advantage as we age. This is important to not become redudant when faced with hard-working junior colleagues. (It's a sad world like that...).\n\n&#x200B;\n\n&#x200B;\n\n========================================\n\n**A blurb about myself (for context)**\n\n* Graduated with a Bachelor in Computer Engineer => background in hardware, low-level software.\n* Self-learnt CS and more trendy industry topics since.\n* Worked as \"full-stack\", then backend dev (APIs, payment, data warehouse/pipelines, IoT).\n* Recently took on devops role for a decently-sized company, running Kubernetes in data centers and clouds.\n* Worked at various company sizes (<50 => 3000+) .\n* Also worked in various industries (video streaming, electrical/utilities, gaming).\n* Have been both individiual contributor and led small teams (3-5 people) unofficially.\n* Above average ToC (\\~130k++ cash in Canada, \\~6 YoE) but nothing too fancy.\n* Generally enjoy CS-related work, but also open about utilizing tech in other industries.\n\n## Thoughts on \"having a long career\"\n\nIn general, I believe it's possible to have a long career in tech (having seen some old and wise engineers myself). Yet, it seems a long career requires good techincal chops and other complimentary skillsets. For example, besides asking hard coding/system design questions, people also expect you to show leadership + communication skills in interviews/day-to-day work.\n\nIMO, the ideal role for me at 10 YoE (mid-30s) would be a Principal/Staff (software) engineer.\n\nIf these [archetypes of staff engineers](https://staffeng.com/guides/staff-archetypes) are indicative, I aim to be a mix of Tech Lead + Architect + Solver. For example, leading a small team to solve a business-impacting problem would be something interesting.\n\nPast 10 YoE, I don't really know what's else there would be.\n\n**Industry/area of focus**:\n\nI plan to stay in the \"computing infrastructure\" space.\n\n* My experiences are mostly with backends, data-intensive systems right now. This helps build up familiarity with the space.\n* I plan to expand my knowledge in networking, performance engineering soon. In the future, maybe some kernel-related work would be great.\n\nThere's some tenative paths for this area, IMO:\n\n* More **DevOps/SRE** work, hopefully with increasing scale.\n* Specialize in **data-center**: deeper work underneath the \"clouds\". This will need much better networking knowledge, though.\n* Specialize in **kernel/embeded software**. There is transferable knowledge on operating system. But there's a lot more to learn once you are outside the Linux kernel.\n* Specialize in **infra-related areas**: database, data warehouse/pipelines, etc.\n\n**To build up advantages**\n\nThis is what I have been doing so far:\n\n* Keep a hands-on approach to problem solving. For example: participate in on-call rotation, write code and deals with technical debt (mine and others). I also run a home computing lab for experiements.\n* Keep reading/learning. Nowadays, instead of jumping on the industry's latest, I am biased towards more researchy materials. For example books, CS research journal/[the morning paper](https://blog.acolyer.org/), etc.\n* Attempt to acquire novel work-like experiences outside of my dayjob. For example, I help some friends in an NGO with their software-related need.\n* Occasionally crunch some LeetCode to stay fit for medium+ problems.\n* Maintain a light professional network/connections to spot new opportunities.\n\n**On the $$ side**\n\n* Haven't pushed hard for compensation yet, but will start scheduling interviews towards late-2021.\n* I am more concerned about finding a company with good potential (thus problems + money to spend on them). Certain team dynamics/values are also important to me (e.g: value quality work, trusting each other, etc).\n\n==>\n\nIn short, I am betting that \"computing infrastructure\" is not going away soon. Hence, a solid foundation in the field would mean above-average financial outcome. And I get some happiness while being immersed in the area as well.\n\nI am hopeful that this plan will workout. However, sometimes there's a little bit of FOMO on other paths (e.g: AI/Deep learning). Also I see lots of gaps to fill and no quick way out of the rat race :)\n\nHow about you? What are you planning for your career path?",
    "title": "How do you plan for a long, technical-focused careeer in CS?",
    "subreddit": "cscareerquestions",
    "timestamp": 1614244988,
    "score": 53,
    "keyword": "mixed race director"
  },
  {
    "text": "Engineering Manager career advice I've been in the tech industry in various forms for about 13 years now (I'm in my late 30s). I've done just about every kind of job other than DevOps (don't really enjoy it) - QA, SDET, UI/UX Design, Front End and Back End Development, Project Management, etc, but the role I enjoyed the most was Front End Development. Those experiences have made me very good at communicating across disciplines and gives me unique insight into the whole SDLC. I have been working at a fortune 500 company for about 7 years now in engineering roles (1.5 as a contractor, the rest as full time employee) and I've been working my way up the corporate ladder. That's the basic context for the story ahead.\n\nA little over 3 years ago I was promoted to an Engineering Manager position, responsible for the development of 5 products. I got to grow my team and we were tight. We all loved working together and it was great. I was reporting to a Director of Engineering at the time, but the senior engineering manager of the org was promoted into his role from a QA manager role. He had no engineering background and no experience leading development teams. He was promoted into that role because there was \"nobody else\" senior enough to fill it, and he was confident and good at talking bullshit to non-technical people in order to come across as though he knew what he was talking about. The Director was basically desperate with that promotion. This guy was a terrible communicator (often got into conflicts with partners and stakeholders that resulted in nothing getting done). I frequently had to step in and basically do his job for him. All of our stakeholders refused to work with him and instead wanted to work with me. The work involved setting the direction for the entire automation team of some 25-40 SDETs (a mix of RFT and contractors that fluctuated over time).\n\nEventually, the Director decided to move on to a new role within the company, and part of that transition plan was that the Senior EM would move to a new org under a new manager and continue his own thing, and I would report to the Head of QA within our partner team with the intention that I would get promoted to Senior EM and be the technical director for the whole quality engineering team. The role was basically an Automation Engineering Manager. The promotion was supposed to happen in the next performance review cycle a little less than a year later.  I took the role thinking it would lead to a promotion, but 2 years later it still hasn't happened despite meeting all of the criteria and getting exemplary performance reviews (in my last PR, I got a 7% raise, a 200% bonus, and $60K in RSUs for the next 3 years with no negative feedback). \n\nMy current manager has only promoted 2 engineers (both from level 1 to level 2) in the past 3 years, with all of the promotions going to her QA staff. The team I built before got absorbed into the QA manager's org, and almost everyone has since left out of frustration. The QA manager (my boss) basically has no idea how to lead engineers because she has never been one, but she is horrible at taking any form of feedback. Last time I tried, she gaslit me and basically dumped a whole bunch of negative feedback on me to make me feel like I was the problem. She talks shit about me behind my back to my peers (and does the same to them with me) whenever they do something she doesn't like, and every decision we make has to go through her. After doing some reading, I figure she's a textbook narcissist. To top it off, she got promoted in the last promotion round, while telling me that it will still be 12-18 months before I'll get one.\n\nI now believe she never had any intention of promoting me (the goalpost keeps moving) and I'm ready to exit the company and find something else. This is where I'm looking for advice. I've been an engineering manager for a large team of Quality Engineers for 2 years, and there aren't a lot of Engineering Manager jobs in that space. I know I can be an Engineering Manager for devs, but I'm worried that my skills have atrophied. I got into engineering as a Front End Developer, but the FE world moves so fast that I'd basically be starting from scratch again. I don't have a CS degree, so I never really learned the whole algorithm and data structures thing, so I'm not particularly good at those LeetCode tests. I've also got 2 young kids, so my spare time is limited. My boss has sapped my morale and its hard to motivate myself to pick up coding again in my spare time (but I know I should).\n\nI'm really good at leading teams (I'm a better leader than an engineer, but I'm still good at the engineering side), so I'd like to continue down the management path. However, Engineering Manager jobs seem to vary wildly in the scope of the job (many seem to require some actual hands on coding, which I haven't done in over 2 years due to having to lead 25+ engineers). \n\nMy questions are: What should I focus on learning in order to land a new Engineering Manager (or Senior Engineering Manager) job? Should I be focused on an EM role or something higher? I feel like my current position has ill-prepared me for positions in other companies.",
    "title": "Engineering Manager career advice",
    "subreddit": "cscareerquestions",
    "timestamp": 1631914755,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "Looking for advice on how to best get out of my current situation Hi, Reddit; I really could use some advice - I don't think I have anyone to talk to about this.\n\nI moved to the US almost 2 years ago, on a work visa. My family situation was the main reason for the move, my child is autistic, and I could not arrange for services good enough for him back home.\n\nI was supposed to report to a VP-level person of our company, right before the move, that changed and effectively I reported into director 1 level lower.\n\nI was not very happy about that, but my priorities were straight - I wanted to move my kid to a place where necessary services could be arranged.\n\nUpon my move, I realized how bad the situation was with my new boss. They only thought about getting more profit for themselves (sales role) and had zero interest in any of the initiatives that I brought to the table. I tried bringing my initiatives to the management. Still, they looked at me stunned as even though my role was new to the organization, nobody expected me to innovate and implement anything. This is not to mention that my boss at the time, yelled at me, lied at group meetings that they were spending a lot of the time teaching me to do things, while in reality, I have not spoken with them in a couple of weeks.\n\nAbout a year in, another person (Jane) gets hired for the same role, but at this time, the management sets the expectation that they will be structuring this unit, and I will effectively report to them. I had mixed feelings about that change since I initially expected to take that position, but I was happy to stop working with my current boss.\n\nJane implemented 90% of my initiatives that were previously blocked. I never took explicit credit for any of those.\n\nAbout a year later - another person (Joe) was hired to join our team. About 6 months after that - I feel the winds change - suddenly, Jane is no longer open during our joint meetings.\n\nA couple of weeks later, Joe gets promoted to take Jane's position.\n\nI am super unhappy about the situation; I don't know who to talk to about this. I'm still on my work visa, so I don't want to be fired for not being a team player, but I get triggered every time Joe sends me a message.\n\nDo I talk to HR? Will it get me in trouble?\n\nDo I talk to the VP who effectively hired me? What do I say?\n\nDo I ask them to change my role in its entirety, not to work as a part of this team altogether?\n\nDo I hire myself a career coach and talk to them? Any recommendations?\n\nEdit: To add color - don't get me wrong, my role is far from entry-level. I'm responsible for a multi-million chunk of business and am very well compensated. It's that significant growth limitation that I am witnessing that is currently bugging me that much.",
    "title": "Looking for advice on how to best get out of my current situation",
    "subreddit": "cscareerquestions",
    "timestamp": 1637351153,
    "score": 4,
    "keyword": "mixed race director"
  },
  {
    "text": "Two Years Into First Job as SE, Haven’t Done Any Serious Programming - Need Advice TL/DR - sales background, went back to school for CS, got SE job, didn't really program... needing some career advice asap. \n\nThrowaway because not trying to make my life harder here. (Sorry in advance if I’m using the wrong flair.)\n\nI'm a computer science major (math and physics minors) that started working in the field almost two years ago. My goal was/is to get more programming / data experience then start a software company. However, because I'm married with two babies and a third one on the way, a higher priority is now to rapidly accelerate my salary to better my family's financial situation. \n\nWhen I joined my current employer (fortune 500) as an entry level software engineer I was to work on their AI team, which was expanding at the time. This seemed perfect for me. Shortly after I was hired I got pulled in by what turned out to be a manager in a different group, who was higher up in the company (senior director). He kept talking to me about working with data and these exciting new projects using ML and AI; and he in turn was recently recruited by - and working directly for - a board member to be the point man for the company's data strategy. All seemed very fortuitous.\n\nHowever, since I started working I've never worked on any 'hard' programming, and spent the majority of the first year just kind of being his assistant. I've never touched ML or AI or Python or Java or R or... He's jumped me from project to project, and vacillated between one thing and another. I've done everything from PPT's to setting meetings to BI development. For about 8 months I did end-to-end reporting; since about a year ago I've been primarily focused on requirements gathering and documentation, business and data analysis, stakeholder-developer management and communications, project management; the only dev I'm doing is sql. Last summer he was really pushing me to be a business analyst with a focus on bridging the gap between the business and the developers; currently I'm doing essentially a mix of all.\n\nThis might partly be because I'm older than your typical newly minted graduate (though I don't look it - I've been told lol), having worked in sales for many years and previously co-owned a small business (completely unrelated field) before going back to school full-time. He has said to me multiple times that he sees me more as a BA or Product Owner than as a programmer, despite having never assigned me a programming task; I think my experience/people skills/maturity might be why. For the record I've asked numerous times and made it explicitly clear that this is what I want to do, to no avail.\n\nThere's something else. He's a good guy and means well, but isn't a very skilled leader. When I first got hired he would regularly put down people on conference calls and get into shouting matches with external resource managers. He would often attack us - including more senior technical resources - as not working (despite them being overworked); he has threatened our jobs pretty explicitly. I've been on many calls where (with 10-20+ people on) he would say a developer wasn't doing anything, insist the work the developer did 'only takes ten minutes', interrogate the developer on what he was doing and why, pull in the developer's manager and the manager's manager to explain why they aren't doing their job, and have no problem spending 10-20 minutes of a 30 minute daily 'standup' doing this (meetings are always extended and derailed). His primary focus was extracting as much work as possible from people; he's told me many times that if a person can do x work his philosophy is to give them 3x or 5x; when they achieve that, increase it again. I've watched our offshore team (I'm the only onshore SE) go from pulling all-nighters to complete 'emergency' work by given deadlines, to becoming experts at delaying, deflecting, and padding. He thinks everything takes a few hours, and we should already know everything; discussing an issue or getting clarification on a topic is next to impossible.\n\nWhile I've worked my whole life, I've never had a position in a truly corporate environment before. Additionally, my personal philosophy is if something goes wrong it's my fault and and my responsibility to fix; my father was tough, and took no excuses - when he said jump I said how high. This meant though I knew my manager's leadership skills were lacking, when he berated me I just assumed I must be wrong and tried to work harder and better. That's not a bad thing per se, until I started consistently working 12+ hour days as an entry level developer without doing any development. \n\nWe recently had an experienced leader join our team under my manager, and this experienced leader is having the same challenges I have. Honestly, hearing these same concerns from someone else validated what I felt and let me know I'm not crazy.\n\nAll this is fine and I'll handle it without complaint, but it does take excess time, energy, and causes stress. It also means that I'm not really happy in my position; I'm neither doing what I went to school for nor do I feel like I'm moving towards my goals (although I could be wrong?). I've put my head down and made it work so far, but I also want to evaluate my position and future, being that I'm coming on to the two-year mark. Also, I went to school so I can have a less stressful career with consistent and good money - and currently I'm stressed and broke.\n\nThe pressure has lately eased a bit as his responsibilities have increased, and consequently his attention has been diverted. My two year review is upcoming and my manager has been promising to give me and a co-worker a big promotion. However, I'm not sure that's coming based on things I've heard. I'll give him the benefit of the doubt and I'll wait and see what he does, but I can't afford not to get it. My wife lost her job last year, so our salary had been cut significantly. Other medical/ financial challenges have lead to credit card bills that are through the roof (never had a credit card bill until this job!). \n\nMy problem is - I want to apply to other jobs, but I'm not sure what am I qualified for. I've been working for almost two years with the title of software engineer (entry level), but my primary development experience has been reporting and BI. Does this even count as programming? How do I represent this? What kind of jobs would I qualify for?\n\nTo better explain my duties - essentially, I took over for a senior reporting resource who was responsible for hundreds of client-facing reports end to end (some dating back to the 90's); they all became my responsibility and I managed, fixed (they broke often) and delivered them on time without issue (except sleepless nights). The primary technologies used were SSRS, MS Report Builder, SQL/SSMS, with a smattering of others, such as windows batch files. When that was done, I was given more responsibilities; currently I'm managing 35+ different ongoing responsibility-threads with numerous sub-threads (I have an excel sheet). This includes everything from creating requirements documents, to report delivery issues, to resolving developer-stakeholder communication issues, resolving data and business logic issues, to access issues, to data procurement to, to, to... I'm technically the 'throat to choke' on two products plus one project, and I'm the secondary on a second project. It's very time consuming and not very rewarding as my position is such that I'm often in the middle - don't have the authority to move people, but will get yelled at if things don't go right; plus it's too much to do at the pace expected.\n\nTo be clear, my title has never changed (still an entry level Software Engineer).\n\nAgain, I don't have a problem with the responsibility - I actually would rather be responsible end-to-end. My main concern - aside from the pressing financial issues - is that I don't know where this is heading and I'm not clear if this is a good career path or not. On the one hand I imagined a career path starting with building programming experience first, then using that to build a product and a company. On the other hand my manager has been telling me that the ability to effectively bridge the gap between developers and stakeholders is a great skill and potentially lucrative, plus he has pushed the idea that what I'm doing is the next step after programming and that this will better assist me if I start a software company. I'm not sure if this is true or if he's just saying this to motivate me to keep working.\n\nMy most immediate goal is to increase my salary so I can take care of my family and stop struggling to make bills. Working on a side project has been impossible between the children, frazzled wife, and 12+ hour days.\n\nWhat well-paying jobs can I apply for with the above skillset? Is this idea that skipping over programming to focus on requirements gathering, etc., a good move? What positions should I apply or study for?\n\nAny career advice would be welcome.",
    "title": "Two Years Into First Job as SE, Haven’t Done Any Serious Programming - Need Advice",
    "subreddit": "cscareerquestions",
    "timestamp": 1616642489,
    "score": 2,
    "keyword": "mixed race director"
  },
  {
    "text": "Career Advice I don't know how to start it, it's been quite hard for me for the past year.\n\nSo, before working for this job, I was managing small team for a new company. I'm starting at junior position with permission to take another job since my job desk was pretty easy. talking to customers, find user requirement, looking for the big picture of the projects and etc. then I present it to the developers.\n\nI know pretty sure that the senior developer in that company at the time doesn't have a lot of experiences, but I choose to stay quite since I'm new. I was quite shocked with the decision that he made, and I preparing to leave since all of the tasks are impossible. Before that happened, he was disappear since he unable to kept his words, but our CEO met him personally and made him finish the job.\n\nOne day the directors gimme a chance to delivering a project and I'm giving my best, I even make some friend with our client and they always using our services. Then I'm moving to another project, create a lot of proposal and suddenly we need more people so I was assigned to manage the developer and getting my salary doubled. At the time I'm still working for both company. It was fine until we got a lot of projects, and mostly my job was keeping the project on schedule. my workflow was quite stressful since I'm moving from project to project that I flagged danger, so all the project is kept progressing but I had feeling that our clients doesn't really like that since the pace starting get faster when I'm focused on them. that make me sad but I need to continuing doing that. I even doesn't have time even on weekend and a lot of meetings after working hours and sometimes I got called at 2 am or 4 am since we are supporting networking things too.\n\nThen I realize I need to chose one job and I chose this company instead the remote job since I can't perform well on my remote job. the remote job was good, the people, the stacks, the tasks, the salary, but their application is complex since they're using old application and lot of refactoring need to be done. the good thing is they had the automation tests so it's good for me to refactoring. And from this company too I know what agile development process and code standards are. I implement all the stuff that I learnt when I managing my developers as well. until I got burnt out and leave that company when I got feeling my ceo getting more greedy and don't like to recruiting when the project number is increasing. I left when all of the projects are in healthy condition and joined my first client that I handled, that i thought might be better.\n\nI'm starting at the lowest level again. But I can see there are lot of strange things at the company. I told to them the way of doing it, but it takes monthly to changes it, even a small changes like daily standup takes 3-4 hours finally cut down just recently when disaster finally happened. there are lot of things that I learnt before doesn't exists in this company, and it's stressing my at the beginning and i'm starting to ignore it since I've told them many times. People just doesn't care and as long as the development progressing, and they don't mind it. but in reality. I know these application are hard to maintain and doesn't have standard code at all. mixed pattern used, no tests, bugs and bugs, break changes makes delivery teams crying since no migration script provided and everyone just code with their own knowledge level without proposing, architecting or design process, so just code without anyone concern.\n\nI was protesting hardly on that and I ready to leave as well since I can't take it anymore. but after talking to my CEO and manager, i chose to stay since i care with these people and want to learn more complex computing at cpu level since that what this company doing. at the time, I got better offer from my last remote job and they ready to compete with my current company which i think that's cheating since they'll win anyway because of  concurrency level. But I'm too greedy, and I'm taking the double job again without my current  company knowledge.\n\nit's quite good at the beginning until my current company asking me for overtimes without being paid for weeks. I'm starting to unable to perform on remote job and I can't working more hours since I'll get headaches pretty bad in the afternoon. so I'm starting to ghosted them(manager remote company), and suddenly it's been two months. I don't know why they didn't kicked me yet from github and slacks and still contacting me last month. this is too embarrassing for me to say hello again to them and I dont know how to handle it. because I'm not professional and I think i'm worthless to them.\n\nThen the disaster starting, one by one developers starting to leaves the this company, until one fully team resigned, and they made really bad code legacy that gonna take times to refactor it, and the remaining developers need to continue that smelly projects while more developers are resigning, we got half developers and no more recruitment since there is an \"office politic\".\n\nMy manager tried his best to maintain the project but, backend and frontend development are two different things. and I can see that clearly since I've experience developing with that fully opinionated framework(Angular :) ) and mistakes are made, if he continue to doing that, I just thinking nothings gonna changes, just how previous and current developer preferences.\n\ni think most of our developers doesn't have experience writing with opinionated frameworks since there are lot of owned style with strange pattern and no lacks of communication in designing process. I don't wanna follow that path, but I'm starting to give up. I love and respect my manager, he is humble and good person. and writing code with cache friendly is his things, but when working and follow framework pattern are different things. I'm not saying I'm so expert but, I always thought at my current level I'm able to see the mistakes made me uncomfortable and not enjoy writing codes.\n\nRecently I got pay rise and an \"award\" since I'm still staying even lot of developers are resign. I think this as a damage control and I know my managers and CEO trying their best to kept me staying at this company and I respected that.  I've been thinking to stay little longer until next middle year, but I can't enjoy to code at this company anymore and the office politics getting more crazier. I'm confused if I need to continue, or taking back and saying sorry to my remote job manager and get back to him, or looking for a new job. if you're at my positions, what're you gonna do?",
    "title": "Career Advice",
    "subreddit": "cscareerquestions",
    "timestamp": 1635686347,
    "score": 1,
    "keyword": "mixed race director"
  },
  {
    "text": "This was just sent to the entire US team at PwC.  \n\nDear friends and colleagues,\n\nUnfortunately, today is my last day at the firm. Many of you have reached out to me over the past few months, but I have not responded to your notes. This is not because I have fallen out of our friendship, but because I have lost faith in what our firm stands for. And here is why. Our firm discriminated against me by repeatedly denying me a promotion because I am a Black woman who was not born in the US. When I complained about this discrimination, the firm retaliated against me which culminated in my termination today. I have shared my story below and hope you will take the time to read it.   \n\nAbout 12 months ago, as our country and the world experienced a social movement and reckoning over racism, our leaders seized every opportunity to tell us that they were rallying behind the end of race discrimination, in particular in the workplace. At the same time, however, they were also denying me the promotion to Director for the third time because of my race, color, national origin, and sex.\n\nThe Partners and Directors team that helped me prepare my case worked with me to escalate this injustice at top levels of our firm. Every single leader - FS Diversity & Inclusion Leader, FS Leader, Strategy& Leader and a few more - chose to look the other way and protect the other few Partners who had been using untruthful facts to misrepresent my performance and relationships with clients during CRTs in May 2019, November 2019, and May 2020.\n\nBehind the façade of its outward messaging regarding diversity, inclusion, and antidiscrimination, PwC fosters a work culture that stifles the development of Black, female, and non-native born employees, preventing them from achieving promotions and advancing within the Firm. This comes as no surprise when we look at the composition of the PwC leadership team, which fosters a discriminatory culture.\n\n* The U.S. leadership team, comprised of 19 members, is staffed with only one Black woman and two Black men. \n* The U.S. Board of Partners, comprised of 22 members, has only one Black man among its members. \n* As for Strategy&, there is only one Black man and not a single woman amongst 23 global leaders. \n\nAren’t we religiously telling our clients that effective diversity and inclusion starts at the top? Aren’t we telling our executive clients that they have to walk the talk to lead real cultural change? So why is it that we keep talking the talk and placing our “efforts” in programs that do not drive any real change in the status of Black people at this firm?  As someone who specializes in culture and gives this very advice to our clients, I find myself unable to escape this dissonance between what I tell them to do and what I know PwC has failed to do internally.\n\nAs of the third discriminatory denial of my promotion, I was the only Black left within FS Strategy&’s non-leadership team. As one Partner put it at the time “you are the last one standing”. Why is it that being Black at this firm has to be a constant uphill battle to prove that you deserve your seat? Why is it that I have had to consistently wait 1-2 more years on average to get the acknowledgements and promotions that my peers have gotten, when I keep bringing stellar performance reviews into CRTs?\n\nThis is to say that discrimination has been a reality for me for a long time, and has simply reached the point where my constant optimism can no longer make sense out of it. It has been a toxic force that does everything it can to:\n\n* Take away your dignity\n* Make you feel weak\n* Portray you as a poor performer and third-class consultant\n* Prevent you from bringing your authentic self to work; it’s not enough to be a great team player and high performer, you have to put “who you are” to the side - remind me what D&I is again?!\n* Push you out of the firm, because not even our leaders would stand up to do the right thing\n\nDuring the May 2020 social movement, one Partner reached out to me, after being summoned to, saying “(Name removed), I read Maya Angelou’s Caged Bird”. What?! To every non-Black Partner and staff at this firm, we do not need you to tell us about the Black stories or authors that you’re reading or the Black friends that you have or the African countries you have visited. What we need is for you to demonstrate true empathy when you see unfairness being done to a Black employee. STAND up, SPEAK up, CALL out. Call out colleagues on the offenses they’re perpetrating. I would not be in this position, feeling I must speak up and call out PwC’s hypocrisy to all of you, if the Partners in the CRT room had spoken up and called out their peers when they saw them derail the process for my CRT reviews which led to a biased outcome.\n\nThat offenders rarely get held accountable goes beyond the fact that our Partners and leaders sadly do not speak up when they should. The Firm continuously protects those offenders, leaving more Black, female, and other minority employees at their mercy. How, you may wonder? Go take a look at the contract PwC made you sign.\n\nPwC forces employees to sign binding arbitration agreements that rob them of their ability to have their day in court and to publicly call out PwC’s discriminatory, retaliatory, and other unlawful conduct. As a result, it is no surprise that PwC makes little to no change to its policies, procedures, and practices despite the multiple cases that have been filed for discrimination and retaliation. \n\nI will leave you with this. Sexual harassment used to be hidden under such “keep it secret” arbitration agreements until the MeToo movement. Many leading companies, including Google and PwC, excluded it from the arbitration agreement as a result of social pressure. This being said, Google also excluded “Race Discrimination” from its arbitration agreements, recognizing how much hiding discrimination at work behind the veil of confidential arbitration hindered the career advancement of Black employees. Why is it that our firm, a leader in its own territory, claiming to be a leader for our cross-industry national and global clients, cannot take the same simple step when it comes to ending racism and discrimination in the workplace? How much longer would our leaders turn away from doing the right thing to protect themselves if they knew they could be held publicly accountable? When will they finally do something that actually moves the needle and makes this firm a place where Black and other minorities don’t have to do three times more to prove their worth?\n\nDear colleagues and friends, I have enjoyed working with many of you and wish you the best of luck. Hopefully we can stay in touch.  \n\nIn good hope,\n\n(Name removed)\n\n—————-\nUPDATE - Ethics & Compliance has responded:\n\nEvening all--\n\nI am writing about an email which you may have received today from a former PwC US employee regarding her time at the firm that was sent to an internal distribution list. We are aware of the former employee’s concerns and we are addressing them.  Please know we take all allegations of firm policy violations seriously. \n\nOut of respect for the privacy of all parties involved, we are unable to discuss specific details of this matter.  However, we continue to encourage our employees to raise any concerns that they may have by speaking with a member of our People team or by contacting our confidential Ethics HelpLine, anonymously if preferred. PwC strictly prohibits retaliation against anyone for raising concerns in good faith.\n\nIf you have any questions regarding this matter, please contact the Ethics HelpLine.  Thank you.",
    "title": "This was just sent to the entire US team at PwC.",
    "subreddit": "Accounting",
    "timestamp": 1627334457,
    "score": 1572,
    "keyword": "mixed race director"
  },
  {
    "text": "My path to CFO (of a company with 75 employees) I've been a member of this subreddit since before my accounting career started. It was a highly valuable tool for gaining insight into the industry. The broad access to information that this subreddit facilitates is helping members of the community regain some control over their careers and lives. This community helped me, and now I want to share my story in hopes that it helps someone else here.\n\nAccounting was a career change for me. I came out of undergrad into the worst recession since 1929, and I am still making up ground, recovering from it. People weren't hiring. But I had a friend who went to work drilling for mining operations underground and was making over $100k/yr in the middle of this recession. So, I swallowed some pride and became an underground driller as well. Despite feeling like I had failed by reason of accepting my new lot in life as a driller, I enjoyed that work quite a lot. It was honest, hard work, and I made good money. But, somewhere down the line I got sent to drill in Mexico in a mine that had two owners-- one was on paper, and the other was a faction of the Sinaloa cartel. It was the second time that the cartel, armed with pistols, directed my crew to change the location of our drilling, so they could extract from an area with super-rich ore that I decided it was no longer in my best interest to continue on in this career. Surreptitiously, I boarded the Cessna 182 that taxied miners between the mine and civilization. My foreman was an alcoholic cokehead that I didn't trust not to sabotage my plans to escape. So, I made my way from the mine to the San Ignacio landing strip and hitched a ride from there back to Mazatlan where I booked a room and a flight home the next day. It was that night in the hotel that I jotted down several career alternatives, what it would take in terms of debt and time to get financial parity with my drilling job. I arrived at the conclusion that it would take seven years going down the accounting path. Two years to get my Master's, and five years to get to $100k.\n\nFortunately, I had been a good saver with about $30k in the bank. I lived off savings and financed my tuition while I earned a Master's in accounting from a non-target school. Upon gaining the requisite number of accounting credits, I signed up to begin taking the CPA exams. I took the exams very seriously because I viewed passing as my only shot at credibility due to earning my Master's degree from an awful school. I studied 10-12 hours per day and knocked out the exams in seven weeks, miraculously passing the four sections (not sure how many sections there are now) on the first go-around. This got my foot in the door of a small local CPA firm in a large metro area ($49k/yr). I stayed there for a year, auditing non-profits and small local governmental entities. There was no joy in this. After I'd been there a year, I applied for an experienced auditor position (private industry) with a Top 10 national firm ($54k/yr I think). I got the job. After 1.5 years at the larger firm ($60k) and a promotion to SR, I fought and clawed my way into the financial due diligence group (which my office did not have, and for which I was the first person from my office to join). I spent a year in the FDD group ($62.5k/yr)and loved the work, learning incredibly valuable information about how businesses really work and what creates enterprise value. But, as you saw, the pay was dogshit. Because the MPO was out of touch with the work I was doing, I was unable to get a satisfactory raise ($64.5k/yr at the end) without moving to another city. At this point, I jumped ship to go to industry, in financial services ($80k salary, 15% bonus). This job was not for me. I think there were about 16 accountants in the department, and I felt a mix of me not understanding the business, and boredom. I lasted 6 months. Next, I went to a national consulting firm ($80k/yr salary + $30-40k bonus) where we consulted for attorneys with clients in litigation. Essentially, we were tasked with limiting damages when our attorney's client was being sued, or the opposite when our attorney's client was the one doing the suing. Our firm was a top tier firm, in this particular field, so our rates started around $300/hr for associates up to $800/hr for Managing Directors. I lasted about 6 months. My supervisor, for whatever reason, did not like me. It was a new line of work for me, I didn't know what I was doing, and I got talked to because when they reviewed my work, there were mistakes. At this firm, mistakes were not well-tolerated. I accept that I may not have been up to the task for this work. I also know that I would have been very good at the job if training were anything like public accounting. At any rate, I left without having the next job lined up, for the first time in my career.\n\nAt this point, the pandemic was just starting. I spent several months looking at businesses for sale, brainstorming ideas on how to start my own small business. But by mid-March, it appeared we were shutting down the economy and the stock market was taking a nosedive. Like so many others, I started trading stocks and was making money quickly. The housing market was heating up and nobody understood why at the time. I sold my house because it looked like an opportunity to make a little money before the economy collapsed. By late August, it appeared the housing market was going to continue heating up, so I used the money from the sale of my house to buy some land in my small hometown with the intent of developing it into residential building lots. This was a convergence of luck, opportunity and necessity. There were very few building lots available in my hometown, and at the beginning, there were no developers planning on creating new lots. I got a great deal on the land I bought. By May of 2021, all of the subdivision improvements had been made and the city signed off on the project allowing me to sell the lots. I have one buyer who has taken down 11 lots so far, and my debt is being paid down quickly on the project. The first phase of the development looks like it will be sold out by the end of this year, and this project is looking like it's going to be a homerun.\n\nAfter completing the improvements to the subdivision, I took a mini-vacation. On this vacation, I decided I wanted to start a small accounting consulting business to both fill-up my time, and to help with income when developing inevitably slows down and we come into the off-cycle for housing starts. I reached out to my banker to ask that he keep me in mind should any of his clients (heavy construction) mention needing a bookkeeper or consultant. I got a response that he knew someone that I should meet with. We set up a lunch meeting for the next week. The banker showed up first, me second. While waiting for the prospective client to arrive, the banker tells me he thinks they're actually looking for a CFO. I tell him that's probably out of reach for me, and I'm probably a good five years of accounting experience away from being a strong candidate. The banker tells me to hear out the client anyway. So the client arrives, tells me about the business, tells me he needs a CFO. I let him know I took the meeting under a different assumption and did my best to be honest about not having the skills/experience a CFO should have. This apparently enticed him even more. We met for beers, had multiple late night phone calls just talking about business and life. Each time we'd talk, he'd ask \"what do you think?\". I'd tell him it was very appealing, but that I had reservations about my ability to provide the value he needed. Eventually, that turned into me telling him that if he believed I could do it, I'd take the chance ($120k/yr + 30% bonus). I've been the CFO nearly three months now and I absolutely love it. Also, I'm being groomed to become the COO in another 1-2 years.\n\nWhy did they hire me to be CFO? I think it's pretty clear that in less populated areas, the skills and experience that I have are almost non-existent. I benefited tremendously going to a rural market with skills you only learn in metro areas. Shallow talent pools in LCOL areas may be your key to a better career.\n\nI may check back to respond to questions/comments, or I may not. I just wanted to share this story and add to the knowledge base here in this community. I hope you found it to be of some benefit.",
    "title": "My path to CFO (of a company with 75 employees)",
    "subreddit": "Accounting",
    "timestamp": 1633545678,
    "score": 34,
    "keyword": "mixed race director"
  },
  {
    "text": "Students! Interested in exploring a Federal career? The GAO is hiring interns for Summer 2022. Details + AMA inside. The U.S. Government Accountability Office is the supreme audit institution of the U.S. We audit the annual financial statements of agencies such as the IRS, SEC, FDIC, and CFPB, with lots of DoD work mixed in as well to name a few. \n\nI've been an auditor with the GAO for a few years and a reader of this sub since college. Here is my candid take on the agency, feel free to AMA as well.\n\nThe PROs:\n\n1) Work life balance is incredible. 40 hour weeks. Telework 4 days/week (before Covid). Flexible work schedules. Overtime (very rare) is paid at 1.5x or you get an hour of PTO for every OT hour you work - your choice. etc. etc.\n\n2) Solid salary. For DC, the current *minimum* fulltime starting salary is $69,977. New hires who meet performance expectations will get an approximately 7% raise every 6 months for the first two years. That will put you at ~$92k after two years of work. The Senior I salary minimum for DC is ~$97k and the Senior II salary minimum for DC is ~$108k. Assistant Director (think Manager/S. Manager) minimum is ~$137k.\n\n3) Variety of work. You can choose if you want to work on Financial Statement audits, Performance audits, or do Standards work (updating audit guidelines). There are many choices of engagement under each category and the agency makes it a priority to assign people to their preference whenever possible.\n\n4) We're actually proud of the work that we do. We play a big role in efforts to improve federal financial management and reducing fraud, waste, and abuse. Our performance audits last year resulted in about $77 Billion saved in federal spending.\n\n5) Job stability. Accounting is a stable career. Government is a stable employer. When you combine the two you get one of the most stable job opportunities possible. I have no concerns about my job counting to exist, even in a 2008 style downturn.\n\n6) Government benefits. The TSP is considered one of the best 401(k) plans due to its minuscule fees and good fund options. Lots of healthcare plans to choose from. etc.\n\nThe CONs:\n\n1) If you want to be a B4 partner this is not the career for you. Not that we haven't had people leave to take high up positions in public accounting, this just isn't the way to fast track that.\n\n2) Slower career advancement. You almost certainly won't make senior in 2 years like you would in public accounting. You'll probably be making more $ than that senior for not-insane job responsibilities though so ¯\\\\\\_(ツ)_/¯. 3-6 years is a more common promotion schedule to Senior I here.\n\n3) Lower salary cap. People 15 years into their career here are making around $120-130k. Could you be making more in public or going public and then jumping to industry? Absolutely. I personally don't think the trade-off is worth it when you consider how many long nights and weekends it takes to get there. It's a personal choice though. If you want to make the most money possible this isn't the career for you. $120k mid-career for 40 hours/week is enough for me though.\n\nFeel free to ask me anything. I'll to try respond throughout the day. Throwaway account because I don't want my usual account tied to my agency.\n\nIntern postings:\n\nUndergrad: https://www.usajobs.gov/GetJob/ViewDetails/613130900\n\nGraduate: https://www.usajobs.gov/GetJob/ViewDetails/613130700",
    "title": "Students! Interested in exploring a Federal career? The GAO is hiring interns for Summer 2022. Details + AMA inside.",
    "subreddit": "Accounting",
    "timestamp": 1630684786,
    "score": 27,
    "keyword": "mixed race director"
  },
  {
    "text": "This was just sent to the entire US team at PWC Dear friends and colleagues,\n\nUnfortunately, today is my last day at the firm. Many of you have reached out to me over the past few months, but I have not responded to your notes. This is not because I have fallen out of our friendship, but because I have lost faith in what our firm stands for. And here is why. Our firm discriminated against me by repeatedly denying me a promotion because I am a Black woman who was not born in the US. When I complained about this discrimination, the firm retaliated against me which culminated in my termination today. I have shared my story below and hope you will take the time to read it.   \n\nAbout 12 months ago, as our country and the world experienced a social movement and reckoning over racism, our leaders seized every opportunity to tell us that they were rallying behind the end of race discrimination, in particular in the workplace. At the same time, however, they were also denying me the promotion to Director for the third time because of my race, color, national origin, and sex.\n\nThe Partners and Directors team that helped me prepare my case worked with me to escalate this injustice at top levels of our firm. Every single leader - FS Diversity & Inclusion Leader, FS Leader, Strategy& Leader and a few more - chose to look the other way and protect the other few Partners who had been using untruthful facts to misrepresent my performance and relationships with clients during CRTs in May 2019, November 2019, and May 2020.\n\nBehind the façade of its outward messaging regarding diversity, inclusion, and antidiscrimination, PwC fosters a work culture that stifles the development of Black, female, and non-native born employees, preventing them from achieving promotions and advancing within the Firm. This comes as no surprise when we look at the composition of the PwC leadership team, which fosters a discriminatory culture.\n\nThe U.S. leadership team, comprised of 19 members, is staffed with only one Black woman and two Black men. \n\nThe U.S. Board of Partners, comprised of 22 members, has only one Black man among its members. \n\nAs for Strategy&, there is only one Black man and not a single woman amongst 23 global leaders. \n\nAren’t we religiously telling our clients that effective diversity and inclusion starts at the top? Aren’t we telling our executive clients that they have to walk the talk to lead real cultural change? So why is it that we keep talking the talk and placing our “efforts” in programs that do not drive any real change in the status of Black people at this firm?  As someone who specializes in culture and gives this very advice to our clients, I find myself unable to escape this dissonance between what I tell them to do and what I know PwC has failed to do internally.\n\nAs of the third discriminatory denial of my promotion, I was the only Black left within FS Strategy&’s non-leadership team. As one Partner put it at the time “you are the last one standing”. Why is it that being Black at this firm has to be a constant uphill battle to prove that you deserve your seat? Why is it that I have had to consistently wait 1-2 more years on average to get the acknowledgements and promotions that my peers have gotten, when I keep bringing stellar performance reviews into CRTs?\n\nThis is to say that discrimination has been a reality for me for a long time, and has simply reached the point where my constant optimism can no longer make sense out of it. It has been a toxic force that does everything it can to:\n\nTake away your dignity\n\nMake you feel weak\n\nPortray you as a poor performer and third-class consultant\n\nPrevent you from bringing your authentic self to work; it’s not enough to be a great team player and high performer, you have to put “who you are” to the side - remind me what D&I is again?!\n\nPush you out of the firm, because not even our leaders would stand up to do the right thing\n\nDuring the May 2020 social movement, one Partner reached out to me, after being summoned to, saying “(Name removed), I read Maya Angelou’s Caged Bird”. What?! To every non-Black Partner and staff at this firm, we do not need you to tell us about the Black stories or authors that you’re reading or the Black friends that you have or the African countries you have visited. What we need is for you to demonstrate true empathy when you see unfairness being done to a Black employee. STAND up, SPEAK up, CALL out. Call out colleagues on the offenses they’re perpetrating. I would not be in this position, feeling I must speak up and call out PwC’s hypocrisy to all of you, if the Partners in the CRT room had spoken up and called out their peers when they saw them derail the process for my CRT reviews which led to a biased outcome.\n\nThat offenders rarely get held accountable goes beyond the fact that our Partners and leaders sadly do not speak up when they should. The Firm continuously protects those offenders, leaving more Black, female, and other minority employees at their mercy. How, you may wonder? Go take a look at the contract PwC made you sign.\n\nPwC forces employees to sign binding arbitration agreements that rob them of their ability to have their day in court and to publicly call out PwC’s discriminatory, retaliatory, and other unlawful conduct. As a result, it is no surprise that PwC makes little to no change to its policies, procedures, and practices despite the multiple cases that have been filed for discrimination and retaliation. \n\nI will leave you with this. Sexual harassment used to be hidden under such “keep it secret” arbitration agreements until the MeToo movement. Many leading companies, including Google and PwC, excluded it from the arbitration agreement as a result of social pressure. This being said, Google also excluded “Race Discrimination” from its arbitration agreements, recognizing how much hiding discrimination at work behind the veil of confidential arbitration hindered the career advancement of Black employees. Why is it that our firm, a leader in its own territory, claiming to be a leader for our cross-industry national and global clients, cannot take the same simple step when it comes to ending racism and discrimination in the workplace? How much longer would our leaders turn away from doing the right thing to protect themselves if they knew they could be held publicly accountable? When will they finally do something that actually moves the needle and makes this firm a place where Black and other minorities don’t have to do three times more to prove their worth?\n\nDear colleagues and friends, I have enjoyed working with many of you and wish you the best of luck. Hopefully we can stay in touch.  \n\nIn good hope,\n\n(Name removed)",
    "title": "This was just sent to the entire US team at PWC",
    "subreddit": "consulting",
    "timestamp": 1627343458,
    "score": 1243,
    "keyword": "mixed race director"
  },
  {
    "text": "Advice for exiting tech consulting at Director/ Junior Partner level Looking for some advice on which path to take and whether there's anything I haven't considered in my thinking, thanks Reddit community in advance for your advice.\n\nTl;dr: Currently Director/ Junior Partner level looking for lifestyle change, is it a good idea to get off the rat race and work for a Vendor?\n\nMy situation:\n\n* 10 years tech consulting\n* First 7 years in larger firms, got to Senior Manager, last 3 years in a small boutique where I am a partner - it's small, so I would consider myself junior partner level where I don't have a $x mil budget all on my own, but rather sell work on top of other relationships/ work within the organisation\n* Current pay very variable, but \\~$250k to $300k. I have a mortgage and commitments, so need to get as close to this as I can on an exit.\n* Recently started a family and want a more consistent working schedule, less travel once COVID lockdowns lift, and to get off the rat race and into a role I can see myself in for the next 10 or 20 years and not burn out.\n\nOptions - ranked in order of preference:\n\n1. Working for a Cloud or other Vendor:\n   1. Pros: Always a new technology to learn (I really enjoy this part), different clients to keep it interesting, more decent pay ($200 to 230k), potential to move up within the organisation (I find this more exciting prospect to be an exec in Big Tech vs. a operational exec in a corporate)\n   2. Cons: It's an unknown for me to work for a Vendor, potentially zero progression if I do, potential without the ability to go back into consulting.\n2. Corporate:\n   1. Pros: Consistent hours, semi-decent pay (\\~$180k to $200k), nice colleagues (obs depends on corporate)\n   2. Cons: Generally behind on the tech curve, slow pace, and you're always a back office, operational function rather than a front office function, slow progression\n3. Contract roles: This is basically posh \"temping\"\n   1. Pros: Proper 9-5pm, low stress, high pay ($200k to $250k).\n   2. Cons: Zero progression, frustrating projects\n4. Go into a boutique consultancy with a \"lifestyle\" focus\n   1. I feel like this option gives me the worst of both worlds, where I'll still be doing consulting, but with less pay and a bit more \"flexibility\". Pay \\~$200k to $250k.",
    "title": "Advice for exiting tech consulting at Director/ Junior Partner level",
    "subreddit": "consulting",
    "timestamp": 1628996454,
    "score": 11,
    "keyword": "mixed race director"
  },
  {
    "text": "Internal consulting team led by someone who doesn't know consulting. What can I do to change team culture and make this a rewarding experience? 10+ years of experience, 8 years in big 4 tech/management consulting.  I joined an industry position recently as an individual contributor. The role/team was pitched to me as \"small group of internal consultants\" who work with the R&D technical experts to launch new initiatives.  It sounded great on paper.\n\nI've only been here a short time but it's already evident to me that this group doesn't have the respect or leadership to live up to its mission.\n\n1. Talent recruitment is inconsistent.  The hiring manager recently brought on two new members: me (ex-consulting, prior strategy projects), and another girl (purely project management experience).   The team is a mix of very capable ex-consultants and project managers who have been at the company forever.\n2. Comp was good but non-negotiable (should have been a red flag that they weren't going to go the extra mile for stand-out talent)\n3. The team recently got passed over for a serious piece of top-level strategy work, with leadership opting to hire external consultants instead.\n4. My manager has 20+ years at the company but is only a few years into this position, with no prior experience in consulting or strategy & operations work.  In fact, his past experience was purely in project management.  Even now, as a director leading our group he's doing administrative tasks like taking meeting minutes at the leadership meetings.\n5. He is very hands-off on our projects. Doesn't have any targets/metrics for us. He might ask how we're doing but otherwise has no opinions on how well or quickly the work is delivered.  I asked him recently about setting some OKRs /KPIs for the group and he said he would \"do some homework\" (read: google it) and come back next week to talk about it.\n6. The more capable team members leave after 1-2 years, they get \"bored out\" instead of burned out by the job.  On the flip side, work is very very chill, with low expectations, but low potential to grow (personally, professional, or in comp)\n\nIt's clear to me that my manager just doesn't know what \"good\" looks like.  As our effective \"managing director\" he should be out there finding high-visibility work, talking about the team to leadership and selling our capabilities, should have enough of a strategy mindset himself to be able to uphold a standard of quality in his team's outputs.\n\nI just started at the company and feel like I need to put in a good year before I leave. In the meantime, I have a soft spot for tackling organizational challenges and I'd like to help turn this team into the consulting team it was promised to be.  What are some moves I can make this year to effect change?  Is it worth trying to educate my manager to step up to his role?\n\nTL;DR - internal consulting team led by someone who doesn't know consulting.  What can I do to change team culture and make this a rewarding experience?",
    "title": "Internal consulting team led by someone who doesn't know consulting. What can I do to change team culture and make this a rewarding experience?",
    "subreddit": "consulting",
    "timestamp": 1625242774,
    "score": 7,
    "keyword": "mixed race director"
  },
  {
    "text": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?) The reactions of black women to this whole Meghan Markle ordeal on this subreddit and Twitter, and on News media have been fairly interesting to me. Would be interested to hear the perspectives of other black women as my opinion might be unpopular going by the views expressed on this subreddit. Personally, whilst I sympathize with Meghan for the racism and blatant discrimination she has faced, I find myself feeling sort of consciously detached to her plight. As a woman of African/Caribbean descent, I find it difficult to wrap my head around as to why any woman of recent African ancestry, or any black woman, would want to marry or be otherwise intricately involved in an institution as racist and colonialist as the British Royal Family. Colonial England, and the BRF, are almost single-handedly responsible for the decimation of African regions and Caribbean countries, which are now part of the Commonwealth and hindered in many ways by this. These people’s ancestors have the blood of her mother’s lineage on their hands. \n\nWhilst I think Meghan is an intelligent woman, I do believe that she was being disingenuous when she relayed her supposed limited knowledge of the royal family, and I believe some of her claims have been disputed by her own friends. Operating under the assumption that what she said is true however, I don’t understand why she didn’t do more research into their colonial heritage and history. The British monarchy, including Harry himself,  are very racist and are symbolical remnants of white supremacy. Price Harry is the man who wore a nazi costume and allegedly denigrated his fellow army-men of color. I find this to be hypocritical and I don’t buy his reasoning that he wasn’t aware of the depths of racial discrimination before meeting Meghan given his family’s history.\n\nI walked away from the interview feeling sorry for Meghan, but feeling that she was very naive and thought that her being biracial/white-passing would somehow aid her. Had Meghan been a fully black, unambiguous black woman of a darker complexion, I seriously think she would not have even been allowed to marry him.\n\nI also take issue with people on here referring to Meghan as black, when she has repeatedly stated that she is biracial, and her experience reflects that of her phenotypically mixed heritage and not that of mono-racial black women. Before I knew of her background, I actually thought she was white. Even Harry thought she was only white when he met her. I’m trying to be open-minded on this point, because I realize that America has a different racial classification system than the rest of the world. I don’t want to be accused of “policing blackness” (although I find it weird that all races but black people can exercise some sort of racial exclusivity) but I do find it slightly bewildering as Meghan, who is ambiguous and white-passing, would be categorized as exactly what she is-mixed/biracial- anywhere else in the world, especially in Africa and the Caribbean. I also take larger particular issue with this as I find that what constitutes a black woman these days are blurred, but not so for our male counterparts. Everyone seems to agree on what a black man can look like, and they are thus aptly represented in the media, but there is a curious leeway for black woken in the media, and I’m starting to see more biracial instead of monoracial media representation for black women and I feel like claiming Meghan as black plays into this. \n\nThis idea that Meghan was going to modernize the BRF is delusional to me and this is exactly the outcome that I expected. Why any black or biracial woman would need to modernize this institution in the first place or add “a splash of melanin” or whatever ridiculous phrase some people are using is lost on me. Why would we need to modernize an institution that oppressed our ancestors? I was surprised that she and Harry stated that after everything, they were still open to working for the Queen and Meghan “representing the commonwealth” (what even...?).\n\nAlso, I find black women claiming Archie is “black” astounding tbh. I hope this is a minority opinion because it makes zero biological sense and is very embarrassing . I have also noticed some BW living vicariously through her, and this has me slightly worried. The majority of women defending Meghan look nothing like her and the people fetishizing this relationship (especially because it may be/is considered interracial) need to stop.\n\nI hope I wasn’t too harsh with my commentary and would be willing to her criticisms/thoughts.\n\nAddition: (unrelated) We may take issue with some things black men do as a collective but some of the black women on Twitter (I see you Monique Pressly) accusing black men of not being supportive enough of Meghan/being the most disrespectful towards her is ridiculous to me. Seriously?",
    "title": "The reaction to Meghan Markle has been....interesting. (Unpopular opinion?)",
    "subreddit": "blackladies",
    "timestamp": 1615349273,
    "score": 316,
    "keyword": "mixed race director"
  },
  {
    "text": "How Black Men Are Discussed on This Subreddit Is Toxic af I am not trying to dismiss what people have experienced. Me myself many times have been put down by black guys which was racist, colorists, or sexist things. It is an experience being both black and a woman and there is intersectionality ignored by feminism, by media, by the LGBT community, and even BLM.\n\nThe thing is I’m confused a lot of the time people dogpile on black men on this subreddit for things when I have experienced much of the same from black women. Are you really telling me colorism, racism, misogyny, and homophobia is one sidely expressed by black men? \n\nI don’t understand about how black men are colorist where Black women can’t be, some of the first colorist things I heard were from my aunt and other black girls. One of my biracial best friends mother told her not to date black men because she does not want nappy headed grandchildren. This is from a dark-skinned black womenI have heard many black girls say they want mixed race kids or someone non-black. But nooo this is just black men right? And not only that it’s weird how Black women in interracial relationships is either promoted on r/Blackladies or side eyed but black men doing are always self-hating and colorist. And their kids aren’t black, relate to black people, they’re mixed not black, that sentiment is not isolating at all to mixed race black people.\n\nWith black men treating black women badly in professional spaces or predominantly white spaces I won’t deny any experiences . There are definitely Black people that purposefully avoid and demean black peoples to gain acceptance in these environments. The thing is are we really going to generalize and say all black men are like this? I have definitely experience reaching out to Black women at professional spaces and being treated rudely in return, but I know not to generalize. Many times it has been easier to befriend women of other races before someone black but ultimately black people are just people to have the chance to be anything, race doesn’t guarantee a friendship from that person or respect.\n\nIt’s so hateful and negative that I feel like unsubbing. It’s weird how a lot of the times people posting about their negative experiences never account for how they chose their relationships or how they come off. A lot of the time they could aloof and uninterested , self-pitying, condescending, and never take responsibility.\n\nIt’s weird how a lot of the people comment that they hate when people generalize black women into stereotypes and we are the most educated and this...but it’s completely okay to avoid black men and stereotype them. Please.",
    "title": "How Black Men Are Discussed on This Subreddit Is Toxic af",
    "subreddit": "blackladies",
    "timestamp": 1636327736,
    "score": 311,
    "keyword": "mixed race director"
  },
  {
    "text": "The Colorism in Media Needs to Stop. *Rant* I just saw this post in Twitter and I feel like most shows and movies nowadays is only showing mixed women or lightskin black women. The BIGGEST offender is Netflix in which all of their new stuff is just that. Brown and dark skin women aren't even being represented anymore. How is it that the 90's had better representation?\n\nIt's even more fucked up that these casting directors will cast someone lighter when the original character is canonically darker (the hate u give, raising dion, etc). Or even worse in the film, The Harder They Fall. Taking a real dark skin, black, plus sized woman and making her a young, biracial , skinny girl?? This isn't okay especially when there's so many actresses that could have played the part and that looks like Mary Fields.\n\nWe also need to hold the actresses accountable too. Why are you auditioning for roles that was meant for darkskin women? Its already hard for darkskin women to get roles but now you want to take roles that's not even meant for you? It's also very irritating that these actresses always make these statements of 'I understand my privilege...I know Colorism exist'. If you get all that, stop being complicit in the problem. The only lightskin actress I know that is actually trying to not be involved with stealing roles is Zendaya. \n\nhttps://twitter.com/chaoticblkgirl/status/1458258476443054094?s=21",
    "title": "The Colorism in Media Needs to Stop. *Rant*",
    "subreddit": "blackladies",
    "timestamp": 1636721100,
    "score": 207,
    "keyword": "mixed race director"
  },
  {
    "text": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media? How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?\n\nOn the bachelor contestants, Taylor Nolan's recent Instagram live, her and Pieper touched on colorism and the mixed race experience. Pieper talked about how being a lighter skinned black woman, racism affects her differently. She talked about how there are nuanced and different levels of racism.\n\nTaylor says she and other light black women (like Pieper) have been portrayed as angry black women. She also talks about how her and other light skinned black people were light enough to get onto the show and be the token black person.\n\nIn my own experience, as a mixed black woman, I think colorism can sometimes allow me to get my foot in the door in white spaces like jobs but I am still watched suspiciously because they assume I will do black stereotypes because of racism (like steal, get angry, be late, be uncivilized and abuse/attack). I remember growing up in the white conservative suburbs and feeling ignored and not considered for dating by white and poc/black boys because I was not white and having a lot of trauma from that. I remember a racist white nurse dismissing my pain and assuming I went in her office to skip class. I remember some white teachers treating me poorly, assuming I had an attitude and not giving me the benefit of the doubt. As a woman, I avoid being in all white spaces... But when I have been, now I have to worry about being hyper sexualized by white men. In liberal white spaces, I worry about being fetishized. When I call a white person out for racism, ask for my needs, am quiet or angry, I am seen as a threat and Intimidating by white people because I am challenging the status quo and not appeasing them. So I definitely have experienced the angry black woman stereotype projected onto me. I also know being a lighter mixed black women other stereotypes may be projected at me such as being seductive, sexual, soft, attractive, intelligent, etc. But that isn't always the case. Sometimes I'm thrown the black stereotypes and other times the mixed race stereotypes, often both.. that's why the experiences overlap for me and I call myself a black mixed woman.\n\n\nHow do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the white media/shows? Do you see any differences in portrayal? Do you think mixed/lighter skinned black women are often portrayed as angry?",
    "title": "How do you think colorism/texturism/featurism has impacted the way lighter and darker skinned black women have been portrayed in the media?",
    "subreddit": "blackladies",
    "timestamp": 1613577841,
    "score": 121,
    "keyword": "mixed race director"
  },
  {
    "text": "\"I'm a mixed girl. I just want to be normal.\" If you haven't noticed it, there's a post up on /r/offmychest right now that's gaining quite a bit of karma with the same title. This isn't word play or satire, it's quite literal. Apparently, she really is a \"mixed girl\" who simply wants to be perceived as \"normal\".\n\nOk, I'll admit. I rolled my eyes. I read the title and I immediately rolled my eyes. Even though I'm mother of mixed race children and come from a mixed lineage myself I rolled my eyes.\n\nBut then I took off the Petty Crown, scolded myself for being judgemental, opened the link and got to reading. \n\nI heard her out. I thought about how I would feel if one of my kids were upset because they felt \"abnormal\" and I heard her out. And now I'm struggling, desperately to RESPECTFULLY pen my reaction. I'm not sure if I'm going to succeed, but here goes. \n\nI'll start with a few points I've gathered from her post:\n\n1. \"Normal\" is White. Or at the very least, not Black.\n\n2. She believes cultural appropriation is a myth. \n\n3. The feeling of \"normalcy\" she apparently craves reads much more like \"acceptance from 6f people who don't see color and have lots of \"ethnic\" (abnormal) friends. \n\n4. She is completely removed from her Black side of her family and has no contact with them. I'm not sure if her Black parent abandoned her but she's expressed that she has no ties to them and therefore is frustrated at the fact that she (at times) is percieved as a part of their ethnic group. \n\n5. She seems to have a disdain for African American culture in general. \n\n6. She believes her perceived Blackness is negatively affecting her artwork and how it is recieved. \n\nThere is so much more, I'm just already exhausted with this list.\n\nAt the beginning of her dissertation she recalls an incident where a guy accuses her of \"Looking like the type of person that would accuse someone of appropriation for copying her rat's nest of a hairstyle\". Her disdain isn't aimed at the guy that called her hair a \"rat's nest\". Nor is it aimed at the way he trivialized cultural appropriation (She doesn't belive it exists, remember?) Her disdain apparently stems from being grouped with... us. The audacity. \n\nShe goes on to explain how tired she is of being made to feel that she should have to identify as one of us and research our culture. \n\nIn her own exact words:\n\n\"I am not my race. I am tired of being boiled down to my race by others. I hate having personality traits assigned to my perceived ethnicity.\n\nI wish I was normal and my ethnicity wasn’t a freaking talking point and a major part of my being. It sucks, honestly.\n\nI hate how some people assume I’m some sort of pity seeking, race-baiting asshole because of how I look. I’m just a person, with my own personality. I’m not a statistic.\"\n\n\nHave you ever read something so audacious and absurd that you just placed your phone down and blinked silently at the cosmos?  \n\nHow does one begin to unpack this level of self hatred and dissonance?\n\nIf this sentiment was ever expressed by my own kid I would feel like a complete failure as a mother. I'm talking cry in the shower, 'how could I have let this happen to my baby' type of failure. \n\nI don't really see a point in dissecting this any further or even criticizing her mentality because I don't see that making a difference. Instead, I'd rather make this post a  cautionary tale; to biracial people and parents of biracial children who are half Black. \n\nDon't. Be. This. Guy. \n\nI implore you, if you feel even a smidgen of this sentiment, talk to someone. Talk to your Black parent or a trusted Black relative. Talk to somone educated on Black issues. Talk to someone here. Hell, talk to me if you have no one else... I'll listen. But for the love of cocoa butter, do not DO NOT let yourself sink into the sunken place by relying on mainstream reddit to comfort you in your time of ~~ashiness~~ need.\n\nDammit. I tried.",
    "title": "\"I'm a mixed girl. I just want to be normal.\"",
    "subreddit": "blackladies",
    "timestamp": 1618017484,
    "score": 119,
    "keyword": "mixed race director"
  },
  {
    "text": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota) It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)\n\nI just saw this picture showing Minnesota is one of the most racist states in the country---so validating (see link below). I knew MN racism was really bad at my core but you get gaslighted so much here that you start questioning your reality. People act like there is no racism here because \"people are so nice.\" White fragility is real here... like narcissists, white people act racist, deny it, make themselves the victims, then put the blame on you. They are so passive aggressive that the racism is so subtle, ex: moving away from you out of fear like you are this big threat. I am a woman and I've learned to keep a lot of physical distance from white women and to not make eye contact---which by the way, is super offensive as a feminine woman. If you aren't going out of your way to be super friendly and make them comfortable, you are a threat. I have had my own white relatives act suspicious of me for visiting and trying to get to know  them. I have always felt so isolated being a higher educated middle class black mixed woman. I've been treated as a criminal by my own employers. One time I walked into my first therapy job and the co-workers spoke to my white supervisor instead of me---they were so shocked and uncomfortable when they found out I was the therapist. The social class and job discrimination is so strong here, they are shocked to see professional black people. Being around all this white supremacy makes you question yourself and internalize their messages... You question your sanity, if you are bad, the problem.. when really they are the problem. They have the history of stealing and killing all groups of people for centuries but somehow they see themselves as the victims. White narcissistic delusion.\n\nThere also isn't much of a community of black professionals. From my experience, there are a lot of black (especially mixed) people who are in denial and will gaslight you about racism, too. I have had a lot of bad experiences with mixed black people who are in denial of their blackness, talk about how they pass for other races, and allign with whiteness. They distance themselves from their blackness and some seem delusional because they do not see that they do look part black.\n\nIt seems like the black/mixed people who make it to the top are the ones who have assimilated, have internalized racism, are not unified with other black people, and have had to swallow the racism they have had to experienced. I could not do that for long without it eating me up. I spoke up for myself and others. As humans, we are not supposed to be abused and just take it.. but somehow as black people, white people see us as less than human and think we are immuned and should just take it.\n\nI am burnt out. I barely leave the house. White people are everywhere here and I don't trust most. When I am around them, I dissociate to avoid feeling the pain of all of their violent \"microaggressions.\" Thankfully for now, I work at a black business. Moving out of this state is mandatory for my sanity. I wish all black people could leave as well. It is hard to succeed and progress here without losing a part of yourself. At least I know I managed to survive (and suceeded educationally and built resiliency) one of the most racist states, it can only get better from here as I move on to a more equitable state.\n\n[Racial Disparity MN pic](https://www.zippia.com/wp-content/uploads/2020/02/racial_disparity_map_worst_states.jpg)",
    "title": "It is so validating to confirm my experience of living in one of the most racist gaslighting states (Minnesota)",
    "subreddit": "blackladies",
    "timestamp": 1620570249,
    "score": 71,
    "keyword": "mixed race director"
  },
  {
    "text": "I need to vent to other parents of mixed race children As a person of color in a very white, old fashioned, trump loving town, I’ve just had it. I’m leaving this town soon enough, thank god, but it’s been hell. I’ve learned to avoid all other moms by this point. My daughter is in kindergarten and she looks almost completely white. I’m asian. People treat me like I don’t exist. They will talk to my FIVE year old before they even talk to me. After school, the moms gather and arrange their play dates and they treat me like I’m some random nanny. There have been times when assistant teachers greet every single mom and then they don’t even look at me, or they look at me and then proceed to take my daughter from my hand without saying a word to me. \n\nI’ve been to play centers where some people just stare at me until I stare back at them and they make some stupid excuse like “omg your daughter looks just like you.” someone literally said that and I had to pretend I actually believed that horseshit. Even if it were true, like way to point out how strange you thought it was that an Asian woman could look like her mixed race daughter?\n\nI’ve tried to avoid any social interaction whatsoever at this point. But I have to take my daughter to a bus stop where this white lady keeps trying to make conversation with my child who does not have any interest in talking to her. I try to make it less awkward by talking whenever my daughter doesn’t respond but I’ve noticed that this lady doesn’t want to talk to me. She specifically only talks to my daughter. Don’t you think this is just weird? Most moms talk to one another other in these scenarios while the kids play. \n\nI honestly did not even want to believe that this shit was happening. But it happens all the time. I’ve lived in this town for 4 years and I’ve had enough. I have never considered myself different from my own child in any way but this town has made me see the difference.",
    "title": "I need to vent to other parents of mixed race children",
    "subreddit": "asianamerican",
    "timestamp": 1632799843,
    "score": 226,
    "keyword": "mixed race director"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 33,
    "keyword": "mixed race director"
  },
  {
    "text": "Asian Americans Who Fought During the U.S. Civil War Did you know that 58 Asians fought in the U.S. Civil War?\n\n&#x200B;\n\n[Private Felix Balderry of the 11th Michigan](https://preview.redd.it/4smau7ank1q61.jpg?width=336&format=pjpg&auto=webp&s=0d39e63c5f600e9f381bdf6c5534cae23f344ce7)\n\nPictured here (above and below) is Private Felix Cornelius Balderry. He was a Filipino who came to the United States as a sailor aboard a ship commanded by Captain Joseph Foster of Leonidas, Michigan. After Captain Foster retired from the sea and settled on a Michigan farm, Felix joined him as a farmhand. In December of 1863, he joined the 11th Michigan Regiment just in time to take part in General William Tecumseh Sherman's Atlanta Campaign. As part of this campaign, the Union Army followed a scorched earth policy. They burned fields and houses, razed businesses, and destroyed railroad tracks in an effort to destroy the South's will to fight along with their ability to resupply the Confederate forces. The 11th Michigan was involved in several skirmishes and battles throughout this campaign.\n\n&#x200B;\n\nhttps://preview.redd.it/j5pob2tpk1q61.jpg?width=445&format=pjpg&auto=webp&s=00ee409d82fdb17c11ee56f976973fd03386eb37\n\nPrivate Balderry served through the end of the war and was mustered out of service in September of 1865. He subsequently returned to Michigan where he worked as a tailor. In 1885 at the age of 39, he married a 16 year old girl named Ada May Barns in Constantine, Michigan.  He died of  tuberculosis in 1895 at the age of 49.\n\nThis is Corporal Joseph Pierce of the 14th Connecticut. At the age of ten, his father sold him into slavery to Amos Peck, a sea Captain. He was nicknamed \"Joe\" by the crew. The Captain later gave him the family name of \"Pierce\" in honor of President Franklin Pierce. Although he was technically a slave, after the two month sea voyage from Canton, China to Hartford, Connecticut, he was raised as a family member of the Peck household.\n\n&#x200B;\n\nhttps://preview.redd.it/golha4brk1q61.jpg?width=385&format=pjpg&auto=webp&s=7b29fff77eaac2c588e8224527746bafa846aad3\n\nIn 1862 he enlisted in the 14th Connecticut Regiment. The 14th was part of the Second Army Corps in the Army of the Potomac. Joseph Pierce has the distinction of being the only Asian to have fought at Gettysburg. During his time in the Union's service, Joseph Pierce fought in 34 battles and skirmishes.\n\nAs a result of his bravery at Gettysburg which included voluntarily joining a skirmish line that had advanced on the Confederates, he was promoted to Corporal on November 1, 1863. While this rank may not be considered very high, it should be remembered that the Union had a segregated army. Black men served in black regiments that were commanded by white officers. Since Asians were largely unknown in the United States, people didn't know how to classify them. Some thought that Asians were mulattos (of mixed race ancestry). Others thought that they might be Native Americans. The fact that Corporal Pierce was actually given rank over subordinate white privates was really quite astounding given the time period.\n\nCorporal Pierce served with the 14th Connecticut until the end of the war and marched with his regiment during the \"Grand Review\" in Washington, DC on May 23. He was mustered out of the army on May 31, 1865.\n\nAfter the war he returned to Connecticut where he worked as an engraver for a silver company. In 1876 he married a woman named Martha Morgan from Portland, Connecticut.\n\nHe died on January 3, 1916 at the age of 73 in his home.\n\nAnother Chinese who served in the Civil War was Edward Day Cahota. At the age of 4, he was found with an older 6 year old boy as stowaways on an American merchant vessel that was commanded by Captain Day. The children were starving and did not know their names. The older boy died just two days later and was buried at sea. The Captain named the younger child Edward and in time Edward became a cabin boy.\n\n&#x200B;\n\n[Edward Day Cahota](https://preview.redd.it/rptamw4tk1q61.jpg?width=147&format=pjpg&auto=webp&s=10f42c86cdf3339b46d1f3f1e2a63d789b8f1f05)\n\nWhen Captain Day retired, he brought his cabin boy home with him to  Gloucester, Massachusetts . When Edward insisted upon having a third name, he took the name Cahota which was the name of the ship that he had served upon.\n\nIn 1864, Edward Day Cahota joined the 23rd Massachusetts Infantry. After mustering out of the army at the end of the Civil War, he reenlisted in 1866 and fought in the Indian campaigns. One of the more memorable experiences he had during his time in the western service was when he stood guard over Chief Sitting Bull. He told his family that the chief was really quite friendly. It should be noted that Chief Sitting Bull led the Western and Northern Cheyenne at the Battle of Little Bighorn in which General George Armstrong Custer and the 7th Cavalry were surrounded and slaughtered in 1876.\n\nEdward Cahota died on November 18, 1935 and was buried two days later at Mt. Hope Cemetery in Valentine, Nebraska. One of his dreams that was never realized was to become a citizen of the United States. Despite having served in the Army, he was ineligible to become a citizen after the Chinese Exclusion Act was passed in 1882.\n\nIt's estimated that 58 Asians fought in the U.S. Civil War. While most of them fought for the union, at least two fought for the Confederacy. Picture below are Chang and Eng Bunker. They were Siamese twins who came to the United States to join the PT Barnum Circus. After leaving the circus they settled in North Carolina where they married two white sisters. They lived on a farm and were slave owners.\n\n&#x200B;\n\n[Chang and Eng Bunker](https://preview.redd.it/q067sopvk1q61.jpg?width=406&format=pjpg&auto=webp&s=9e034a2eff384795d3187e3187be0b3c9aa419ff)\n\nWhen the Civil War began, two of their sons, Christopher and Stephen joined the Confederate Army. Since they each had horses and all of the associated gear, they served in the 37th Virginia Cavalry.\n\nIn 1864, Christopher Bunker was wounded and captured in a skirmish at  Moorefield, West Virginia. He was sent to Camp Chase which was outside Columbus, Ohio. Camp Chase was the largest Federal POW camp in the United States.\n\nThe Union didn't spend much money on Confederate POWs. Christopher was housed in a crowded barrack with 197 other prisoners. The union's rations were so meager that at one point, Christopher and his fellow prisoners were reduced to eating cooked rats. On March 4, 1865 he was freed as part of a prisoner exchange between the Union and Confederate forces.\n\nAfter the war, he and his cousin Stephen returned to North Carolina where they resumed farming albeit without slaves since all slaves had been emancipated during the war.",
    "title": "Asian Americans Who Fought During the U.S. Civil War",
    "subreddit": "asianamerican",
    "timestamp": 1617057006,
    "score": 23,
    "keyword": "mixed race director"
  },
  {
    "text": "#WeArePeopleToo: A Proposal for a New Movement Hi everyone, this is my first post ever on Reddit despite being an avid Redditor. I apologize if I lack any specific Reddit-based decorum when it comes to making a post. I will definitely get better with time!\n\nMy name is Dae and I'm an NYC public school educator in my late 20s. I am a mixed race male and would like to share my story as well as establish my thoughts on a movement to better represent us as mixed-raced humans of the world.\n\n**My Story**\n\nI was born to a Trinidadian mother and a Korean father. As a result of their marriage, my father's side of the family became estranged and cut ties with us. As a result, I have only managed to forge a relationship with the Trinidadian side of my family. I grew up in a fairly Republican/Conservative area of NYC (Staten Island) in which white people were the majority.\n\nMy parents loved me but they had no idea how to deal with raising a multiracial son. They were stern and strict and did not believe in a coddling love. They did, however, believe in the merits of education and made sure that I knew to bring the best grades home. In school, other students stayed away from me. They were polite as young children but they often ostracized me and left me out of activities. At the time I didn't know it was because of how I looked but with time I began to see the relationship. I learned the power of being a fool, of being self-depreciating. As people laughed at me, I saw it as their acceptance. What I had actually done was prime them to note my difference, my mixed-race status, as being something comical, something to decry, deride, and deplore.\n\nI became the class clown and stood to make problems for the sake of other's entertainment. Teachers began to hate me and associate me as a problem child. They suggested mental and learning disabilities despite my high grades due to my parents and their iron fist approach to education. With every letter home, phone call, parent-teacher conference, I would receive a beating from my parents. Slaps in the face, beatings with belts, name calling, screaming in a child's face, bruises on my body. All done for the sake of being accepted by my peers. All for the sake of being loved by someone. I learned that people who love you are allowed to do whatever they want to your body so I let others do what they wanted to me. Friends treated me like a punching bag. At the age of 8 my 13 year-old babysitter blackmailed me into allowing her to rape me. I said nothing, scared more at the idea that I would be in trouble if people knew I had sex because I knew enough to know sex was wrong.\n\nBy the time I was 12 in middle school, I had tried to hurt myself for the first time. I was taken to the guidance counselor because I had told a friend who, doing the right thing, told an adult. In the process, I was treated like I was crazy. I was threatened to be committed because I was a danger to myself. All of this made me feel *different* and I already knew *different* was bad. I knew because of how I felt when people told me I was different. \"What are you?\" \"Who is black?\" \"How did that happen?\" \"Are you \\_\\_\\_\\_\\_\\_\\_\\_?\" The looks of confusion. Even worse was the looks of incredulity, like the fact that I existed couldn't be real. People, regardless of their own race, made me feel so ugly. Ugly because I was different, unique, and beautiful because of my uniqueness.\n\nI knew my parents' union was odd because people told me that. But I didn't know the history of miscegenation in America. I did not know that it was once a crime to be us or to engage in a union that results in the creation of one of us. What I did experience, however, was fetishization as I grew up and became sexually active again. I had a hard time finding someone who thought we had enough of a connection to date one another. When I did, I immediately agreed to date them, I was thirsty for love and affection. But this love was ugly too because it was different. This was even present in friendships. I had friends who told me they would only date black girls because they were black and wanted to have black babies. I had friends who told me I was smart because I was Asian and knew some rap and had rhythm because my mom was Black.\n\nMy girlfriends never, ever brought me home. I was a secret, forever to be hidden. I grew attached to a concept that white girls were the most beautiful. This was partially because of where I grew up but also out of jealousy. White people had such an ownership of their heritage. They knew what they were and forged relationships based on those identities. I wanted so badly to be white. I told my mother that I liked white girls and that in my next life I'd like to be white because they rule the world. My hatred of my blackness stemmed from the fact that society deemed black inferior which led me to believe that my blackness was probably why my interactions with society were so awful. If only I were fully Asian or White and had no blackness to me. I didn't realize it was just because I was mixed. The one girlfriend who took me home only told her family I was Asian. During the death of Eric Garner on Staten Island as racial tensions spilled out onto the streets, I visited her family and had to grimace as they joked about, \"Hands Up, Don't Shoot\". She said nothing. She did nothing. I didn't expect her to.\n\nMy life spiraled out of control as I got older and race became more important as a qualifier in making connections with people. I fell in deep love with a girl from a family who practiced the Islamic faith. She had difficulties accepting her role in the religion and found solace in me, a person with no ties to any culture because my culture was so shattered by my being multiracial. She would often tell me how \"cool\" it was that I was Black and Asian. How \"attractive\" it was. I didn't know what she was doing was fetishizing me, I was desperate to believe she loved me. After a few years, the relationship fell apart and, again, it was because I was different. This time, however, I knew it was because of my race. I never hated myself so much in my life. I cursed myself and my family, I wished I could be one thing.\n\nI drank a lot after the breakup. I wanted to die. I woke up face down in the gutter one night after binge-drinking. I tried to slice my wrists in my backyard, then I tried to fall on the knife. I tried to jump off the overpass by my house into traffic. I wanted my death to be certain. I gained so much weight my heartbeat became erratic. I was smoking a pack a day and developed a wheeze. I hated myself, I needed to punish myself. I fought my father, I ran away from home and became homeless. I hurt and hurt and hurt because love seemed impossible because acceptance was impossible.\n\nI became a teacher. First in Bed-Stuy, Brooklyn where my students, forever ready to curse me out and let me know when I wasn't being \"fair\", accepted me. Almost instantly. They asked what I was, were relieved when they heard \"Black\" because they knew we shared something common, and then made me one of their own. They joked with me, told me gossip, shared their fears, shared their dreams and their emotions. They asked me to share my stories and for the first time, **ever**, someone wanted to truly know me. Now I teach in the South Bronx where my students have yet to ask me what I am. Because it does not matter to them.\n\nI began a journey to heal. I lost weight though exercise, something I was so hesitant to do because I hated myself and wanted to die. I took a road trip from NY to Georgia, across to New Orleans, Louisiana then to Texas, then Cali. I got to see the Pacific Ocean and looked across to imagine my father's country. We drove back and I was refreshed with a new look on life. I educated myself on race relations in America as BLM became a massive presence following the death of George Floyd and learned to love my blackness. I attended my first protest on Staten Island with BLM and learned the importance of being outspoken. I learned to love myself and I learned how to share that love with others. I challenged my perceptions of education and decided to dedicate my life towards bringing a sense of ownership when it comes to science for BIPOC students. By providing students with a more hands-on experience, they learn that science is a gift for all humanity in the form of a community, one that it is honorable to be a part of. I have since been selected to work on a committee that brings more diversity toward l\n\n**The Movement**\n\nThrough my research, I have become extremely disillusioned with the lack of support provided to people of mixed race. I grew up with no one to turn to, no one to help me unpack the burden of being an oddity to society. I left social media, angry, vowing to never use it again because I didn't want to interact with a society that could not accept me. I likened it to being desperate, to chasing the desire to belong to something that has no desire to accept me.\n\nI fell upon Beverly Daniel Tatum's national bestseller, \"Why Are All The Black Kids Sitting Together In The Cafeteria?\" and noted that it was revised and updated. I had never had interest in reading this book before, despite it being mentioned in conversations with friends, teachers, etc. I did not belong to the black culture and so social issues of segregation were particularly damning to me. How could I sympathize with a culture that told me I wasn't black or black enough? At least they had one another in their culture to lean on. I had no one, I felt. In the revised edition, Dr. Tatum places attention to the role that Multiracial families bring to a discussion of race relations in America. Yet, in one fell swoop, she manages to disenfranchise me and other mixed-raced people, \"Given the unique historical and contemporary context, it is the biracial identity development of children of Black and White parents that I will focus on here.\" (Tatum, 304) I was not even enough to garner attention by a champion of Civil Rights and Equality in a book that was groundbreaking in its ability to unpack race relations in my country. I began to wonder how many other mixed-race people felt this way.\n\nI realized that we are under-represented and our lack of support allows us to be targets for confusion. It is this confusion to what we are, to how people treat us, that results in self-hatred, self-depreciation, self-loathing, and self-harm. And we cannot wait for others to be our voice because we are in need. As more attention is being placed towards identifying racism throughout the world, we need to be vocal, we need to stand to let people know: WE ARE THE DISENFRANCHISED TOO. WE ARE PEOPLE TOO.\n\nAnd that has been the movement I've been slowly pushing over social media. I want it to take off. I want us to unify and represent a community that has lacked a true community for so long. #wearepeopletoo\n\nAs people, we deserve to be treated like others. This means we deserve the freedom to be equals in society. We deserve to walk down the street or to make a new friendship without being asked for our race or ethnicity because #wearepeopletoo. We deserve to love and be loved not fetishized because #wearepeopletoo. We deserve to feel like we belong in our families, in our schools, in our government, in our country because #wearepeopletoo.\n\nRight now, the movement is just a hashtag. But even the largest movements begin somewhere. I will not pretend to know what I am doing. I will not pretend to be a leader or to stand as someone to look up to. I believe that this movement needs to be decentralized. No single leader, just a group of people, human beings, who see the need for a change. Right now I am using IG to push the hashtag but I want to begin moving to other platforms, putting out writing, establishing a website. I hoped we could establish [r/mixedrace](https://www.reddit.com/r/mixedrace) as a basis for a headquarters or begin to discuss a place to brainstorm. I stand with all people of the world and I want them to begin to see us as people too. #wearepeopletoo I know I need help, I need teammates and a community to support and be supported by. Even now as I tell people my idea for this movement they tell me I am being divisive, that I am causing more division in the world. But this was division that was forced on me, not one that I created. My goal is to end this division. I share that belief, that one they call utopic, that the world will be better when we see ourselves as one race: the human race.\n\nThank you for hearing me out,\n\nDae",
    "title": "#WeArePeopleToo: A Proposal for a New Movement",
    "subreddit": "asianamerican",
    "timestamp": 1614137067,
    "score": 11,
    "keyword": "mixed race director"
  },
  {
    "text": "Most prison rape is committed by women I think it's fair to say that the majority opinion of prison rape is that it's something that happens between criminals, and hence is less serious and possibly even comedic. There are some very victim blaming attitudes around it.\n\nThese sources, and there are plenty of others, paints a different picture:\n\n* Most sexual abuse in secure facilities housing male inmates is committed by staff, not criminals, and mostly by female staff.\n* These facts also hold true for juvenile inmates, most sexual victimisation of juvenile male inmates being conducted by female staff.\n* Inmates in female facilities are more likely to be abused by other female inmates than by staff.\n\nSo basically the opposite of the stereotype, but the stereotype still drives a lot of policy decisions and media representation.\n\nI think there are parallels here with domestic violence. Female-perpetrated violent crime is mostly not aimed at strangers, as violent crime committed by men is, but mostly against people over whom those women have power: intimate partners, children, elders, people in institutional settings.\n\nhttps://journals.sagepub.com/doi/abs/10.1177/1525107115580785?journalCode=jrxa\n\n>Although the surveys conducted by the Bureau of Justice Statistics over the last decade in response to the 2003 Prison Rape Elimination Act are unable to speak to the motivations of the victims or the perpetrators, they provide an assessment of the magnitude of the problem and offer extensive detail on the circumstances surrounding female staff sexual misconduct. The findings indicate that female staff members are overrepresented among perpetrators of staff sexual misconduct in prisons, jails, and juvenile facilities.\n\nhttps://en.wikipedia.org/wiki/Prison_rape_in_the_United_States\n\n> Male sexual victimization was more frequently perpetrated by the staff, whereas the perpetrator for female inmates was more frequently another inmate.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/\n\n> Not only does the traditional sexual victimization paradigm masks male victimization, it can obscure sexual abuse perpetrated by women as well as same-sex victimization. We offer a few counterparadigmatic examples. One multiyear analysis of the NCVS household survey found that 46% of male victims reported a female perpetrator.23 Of juveniles reporting staff sexual misconduct, 89% were boys reporting abuse by female staff.\n\nhttps://www.uclalawreview.org/pdf/59-6-6.pdf\n\n> When surveyors uncover surprising data suggesting that women staff are more likely than men to sexually abuse men and boys in their custody, they tend either to ignore the counter-stereotypical findings, or to reinterpret them in accordance with conventional gendered expectations: Could male inmates be misinterpreting women guards’ authorized physical searches31 as sexual assault? Another form of stereotype reconciliation is to redefine staff–inmate sex as consensual, “romantic,” or even as sexual exploitation of the female guard by the incarcerated man or boy. ... A second interpretive impulse that tends to reconcile unexpected findings with gendered expectations is to doubt the survey results. The BJS’s initial response to its counter-stereotypical findings about staff sexual abuse was to question them. It reported on the 2007 NIS: Nearly 62% of all reported incidents of staff sexual misconduct involved female staff with male inmates; 8% involved male staff with female inmates. Female staff were involved in 48% of incidents reported by male inmates who said they were unwilling and in 79% of incidents with male inmates who said they were willing. In an effort to better understand the allegations of staff sexual misconduct, the 2008 NIS will include questions to determine how often sexual contact reported as unwilling occurred in the course of pat downs or strip searches.170 Could male prisoners be reporting routine physical or strip searches as sexual misconduct?171 The results of the most recent BJS survey suggest that this does not account for the unexpected findings. In the second NIS, as in the first, male inmates continued to report disproportionate rates of sexual misconduct by female staff, and it was not confined to authorized physical searches. While about 40 percent of male and female victims reported that staff had touched them sexually during a “pat down” (physical search) or strip search, 86 percent of male victims (and 91 percent of female victims) reported sexual touching by staff outside the context of strip or physical search.172 The BJS reported these findings without comment, but presented them under the heading, “Reports of staff sexual misconduct were linked to strip searches and pat downs.”173\n\n> Similarly, Dyan McGuire acknowledged the BJS finding that “male inmates are at substantial risk of sexual exploitation by female correctional personnel,”174 but she reframed the findings in accordance with conventional gender expectations that sexual abuse of men by women is neither likely nor harmful. She cautions that it would be “misleading” to read the BJS data as “impl[ying] that the abuse of male inmates by female guards is a larger or more serious problem than the abuse of female inmates by male guards.”175 She characterizes women guards’ sexual abuse of male inmates as “qualitatively different” and less serious than sexual abuse of women inmates by male guards, which she characterizes as “confirmed instances of serious rape or forcible sexual assault.”176 She speculates that sexual abuse by women staff may be overreported,177 and she claims that male inmates allege minor indignities such as “inappropriate viewing and other ‘passive’ sexual impositions” (even though the BJS surveys ask only about sexual abuse that involves touching).17\n\nhttps://repository.law.umich.edu/cgi/viewcontent.cgi?article=1073&context=mjgl\n\n> The Prison Rape Elimination Act (\"PREA\") of 2003 mandated that the Bureau of Justice Statistics (\"the Bureau\") undertake new studies of sexual violence in prisons.8 Accordingly, the Bureau released a report in July 2006 revealing some groundbreaking data. Of the 344 substantiated allegations of staff-on-inmate sexual violence made in federal, state,and private prisons9 in 2005, 67% of the overall victims were male inmates and 62% of the overall perpetrators were female staff.1 \" The data contradicts the deeply entrenched perception that, in cross-gender interactions between prison staff and inmates, men are the perpetrators of sexual violence and women are the victims.11\n\nRegarding cases of rape against confined children, we have this:\n\nhttps://www.propublica.org/article/boys-in-custody-and-the-women-who-abuse-them\n\n>Reggie Wilkinson, the former director of the Ohio Department of Rehabilitation and Correction, said that consensual sex between a corrections officer and an inmate is impossible given the power imbalance between the two.\n\n> But he also said that, in some cases, both female guards and the boys they molest share some responsibility.\n\n> “There’s no such thing as consensual sex when you are supervising someone, regardless of their age, but the reality of it is that some of the guys in prison are very persuasive and some of the women are very persuasive,” Wilkinson said.\n\n> “I’m not sure anybody has got a real handle on why the Bureau of Justice Statistics is finding these kinds of numbers, but it’s on the radar screen of a lot of people.”\n\n> Wilkinson and Stannow agree that it is important to keep women as detention facility personnel. They often do great work. But the predators, they say, must be identified, halted and prosecuted.\n\n> “I think in many cases female staff are better suited than males,” Wilkinson said. “A good mix of staff is what we always want. That so-called motherly impact is a big deal and women who are stern but fair with the inmates I think can perform that job as well as any male could.”\n\nTheir response to most rapists of confined children being women is to remark on how women are better than men, and hiring them is really important, while their victims are \"very persuasive\". \n\nMost offenses in juvenile facilities are female staff on male children:\n\nhttps://bjs.ojp.gov/library/publications/victim-perpetrator-and-incident-characteristics-sexual-victimization-youth\n\n> * A higher percentage of male (6.1%) than female (2.9%) youth reported staff sexual misconduct.\n- A higher percentage of female (4.7%) than male (1.6%) youth reported youth-on-youth victimization.\n- In most-serious incidents of staff sexual misconduct, an estimated 91% of incidents involved only female staff, while 6% involved only male staff.",
    "title": "Most prison rape is committed by women",
    "subreddit": "MensRights",
    "timestamp": 1640117993,
    "score": 830,
    "keyword": "mixed race director"
  },
  {
    "text": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "title": "Mixed Race Wife of Fired Eaton Teacher defends his controversial video: 'He created that lecture because he sees the rising suicide rate in young men. We, as a society, are overwhelmed by the idea that men are toxic, useless and unnecessary and telling that to teenage boys on repeat is dangerous.'",
    "subreddit": "MensRights",
    "timestamp": 1636492585,
    "score": 384,
    "keyword": "mixed race director"
  },
  {
    "text": "Feminist gaslighting and shaming tactics against men. #Feminist Gaslighting\n\nFeminists whom we very well know are very good in their means of language games and fallacies in perpetuating different myths and misandry like patriarchy, men can't be raped etc. etc. \n\nOne of them is their gaslighting tactic by virtue of which they guilt trip men and make them join feminism or take higher/dominant emotional ground to take control over men and use them for their own benefits. **Male feminists** are one of examples of such men, they in my opinion are made by such gaslighting for sure.(no misandric intent)\n\n*Men are inherently toxic and they create all the worldly problems by structures made by them like patriarchy and toxic masculinity, so this means there's some problem in men themselves and this is why all men should be feminist or women should rule. Men are in power and this creates almost all problems in society, everything will be alright if men will be given less power because men always and always carry harmful tendencies with themselves like over competence, violence, aggression etc. and they use all their power to oppress others*\n\nThis is how they basically gaslight men into thinking that they are inherently toxic and how by being feminist men's problem (which they mostly neglect) and all the wordly problems like sexism, violence, wars and others will be solved…..\n\nE.g. \n\nFirst let me talk about  FEMINISM IS FOR EVERYBODY, Bell Hooks\n\n>Males as a group have and do benefit the most from patriarchy,from the assumption that they are superior to females and should rule over us. But those benefits have come with a price. In return for all the goodies men receive from patriarchy, they are required to dominate women, to exploit and oppress us, using violence if they must to keep patriarchy intact. Most men find it difficult to be patriarchs. Most men are disturbed by hatred and fear of women, by male violence against women, even the men who perpetuate this violence. But they fear letting go of the benefits. They are not certain what will happen to the world they know most intimately if patriarchy changes. So they find it easier to passively support male domination even when they know in their minds and hearts that it is wrong.\n\nSee, how she guilt trips, manipulates and gaslights men and makes them look down upon themselves by saying things that men are inherently violent and how they uphold *patriarchy* by exploiting, oppressing and using violence on women. This is very basic rhetoric which actually holds no water and is the basis of gender biased laws too. None wants to do it because they want to gain some \"power\" and this theory totally shatters down when women themselves are abusive as men. If you think this is the end, ohh hell nah…\n\n>So they find it easier to passively support male domination even when they know in their minds and hearts that it is wrong. Again and again men tell me they have no idea what it is feminists want. I believe them. I believe in their capacity to change and grow. And I believe that if they knew more about feminism they would no longer fear it, for they would find in feminist movement the hope of their own release from the bondage of patriarchy. \n\nSee, as I said men are inherently toxic and they need to be free from toxicity by joining feminism (which actually is a man hating shit-hole), this is one of their main gaslighting techniques.\n\n>A mother who might never be violent but who teaches her children, especially her sons, that violence is an acceptable means of exerting social control, is still in collusion with patriarchal violence. Her thinking must be changed. Clearly most women do not use violence to dominate men (even though small numbers of women batter the men in their lives) but lots of women believe that a person in authority has the right to use force to maintain authority. A huge majority of parents use some form of physical or verbal aggression.\n\nAgain and again same bs\n\n>Initially feminist focus on domestic violence highlighted male violence against women, but as the movement progressed evidence showed that there was also domestic violence present in same-sex relations, that women in relationships with Women were and are oftentimes the victims of abuse, that children were also victims of adult patriarchal violence enacted by women and men.\n\nNow, women are abusive because of patriarchy which actually is straight reference to men ( *maleness in women* ) as patriarchy is a system upheld by men and this idea of violence to gain control is made by men too.. \n\nBasically **Anything bad happening in ideas created by men and men are one holding these ideas. So, men be feminist and make this world a better place** \n\nAlthough we know what feminism actually is.\n\nThis [article](https://m.tribuneindia.com/news/comment/both-men-and-women-need-to-be-feminists-90425) by tribune says\n\n>Boys have to be taught to have respect for women’s bodies. When girls are told they should dress a certain way so they don’t distract/tempt/make the imaginations of boys run wild, it’s sending a message to the boys that they have no control over themselves when it comes to females. The responsibility needs to shift to the boys, teaching them that no matter how a girl dresses, her body deserves complete and total respect. Boys must be made to realise that girls’ and women’s bodies are not for male entertainment and pleasure…… Teach the boys that equality is just as good for boys as it is for the girls. It allows both to reach their potential without limits being imposed on how they think or what they can be when they grow up. If we want to create an equitable society, one in which everyone can thrive, both men and women need to be ‘feminists’, as a feminist is simply someone who believes in the equality of males and females. \n\nAgain same bs, men are bad and need to be freed from this, this will be done by feminism so men should be feminist. Moreover, this article blamed expectations put on men on patriarchy and men themselves (which is just another gaslighting and victim blaming where women [prefer](https://www.google.com/amp/s/amp.theguardian.com/science/2017/dec/13/polish-up-your-pecs-women-prefer-strong-men-say-scientists) strong men themselves most and are a very big reason behind muscle dysmorphia in men) \n\nIn this [article](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html) titled \"Why can’t we hate men?\" feminist writer Suzanna Danuta Walters (Suzanna Danuta Walters is a Professor of Sociology and Director of the Women’s, Gender, and Sexuality Studies Program at Northeastern University where she also serves as Editor of the feminist journal Signs: Journal of Women in Culture and Society. Dr. Walters’ work centers on questions of gender, feminist theory and politics, sexuality, and popular culture and she is a frequent commentator on these issues for the media.) writes\n\n>These critics rightly insist on an analysis of male power as institutional, not narrowly personal or individual or biologically based in male bodies. Growing movements to challenge a masculinity built on domination and violence and to engage boys and men in feminism are both gratifying and necessary…...Women experience sexual violence, and the threat of that violence permeates our choices big and small. In addition, male violence is not restricted to intimate-partner attacks or sexual assault but plagues us in the form of terrorism and mass gun violence. Women are underrepresented in higher-wage jobs, local and federal government, business, educational leadership, etc.; wage inequality continues to permeate every economy and almost every industry… So, in this moment, here in the land of legislatively legitimated toxic masculinity, is it really so illogical to hate men? For all the power of #MeToo and #TimesUp and the women’s marches, only a relatively few men have been called to task, and I’ve yet to see a mass wave of prosecutions or even serious recognition of wrongdoing. On the contrary, cries of “witch hunt” and the plotted resurrection of celebrity offenders came quick on the heels of the outcry over endemic sexual harassment and violence. But we’re not supposed to hate them.\n\nAgain, men are violent. Either be feminist or allow us to hate you but but but **this doesn't stop just here** she says :\n\n>So men, if you really are #WithUs and would like us to not hate you for all the millennia of woe you have produced and benefited from, start with this: Lean out so we can actually just stand up without being beaten down. Pledge to vote for feminist women only. Don’t run for office. Don’t be in charge of anything. Step away from the power. We got this. And please know that your crocodile tears won’t be wiped away by us anymore. We have every right to hate you. You have done us wrong. #BecausePatriarchy. It is long past time to play hard for Team Feminism. And win.\n\nOhh, you pathetic creature…. this is just so ridiculous to even think of and she wrote a whole article about it and most probably is preaching this in her university/institution.\n\nBarack Obama also shares same views that men are toxic and create bad institutions and so women should be given power…\n\nSpeaking at a private event on leadership, Mr Obama said while in office he had mused what a world run by women would look like.\n\n\"Now women, I just want you to know; you are not perfect, but what I can say pretty indisputably is that you're better than us [men].\n\n\"I'm absolutely confident that for two years if every nation on earth was run by women, you would see a significant improvement across the board on just about everything... living standards and outcomes.\"\n\nWhen asked if he would ever consider going back into political leadership, he said he believed in leaders stepping aside when the time came.\n\n\"If you look at the world and look at the problems it's usually old people, usually old men, not getting out of the way,\" he said.\n\n\"It is important for political leaders to try and remind themselves that you are there to do a job, but you are not there for life, you are not there in order to prop up your own sense of self importance or your own power.\"  [BBC](https://www.google.com/amp/s/www.bbc.com/news/world-asia-50805822.amp)\n\nIn another [article](https://medium.com/@anthoknees/women-have-a-right-to-hate-men-df41b4de3842) by Anthony James Williams ([sociologist, feminist](https://soc.ucla.edu/grads/anthony-james-williams)) they argue:\n\n>Misandry — or the hatred of men — is completely understandable. In fact, I wouldn’t blame women for never wanting to interact with any man because of the fact that so many of us are trash. Like, it makes sense, doesn’t it? (And for the record, I am a queer man who has contributed to the reason why women might just hate us. We all have.)\n\nAgain we will hate you because you all just are bad… \n\nand how to be a better man? here we go\n\n>We begin to emulate what we see and what we know of what “manhood” is. This often means violence, hypermasculinity (an extreme form and/or performance of masculinity), and toxic masculinities (a particularly damaging form of masculinity). In order to unlearn what we were taught, we practice with women, and that right there is where the cycle begins.\n\nSo on our way to become “better men,” many marginalized groups have to deal with our learning process, bearing the brunt of the weight. In this case, it is most often women, femmes of all genders, nonbinary folk, and queer folks. Learning requires test subjects, and those test subjects are the recipients of all of the mistakes we have to make in order to unlearn the oppressive ways we interact with women and treat them as objects, not humans.\n\nOh, and btw you're still and your opinion doesn't matter, you're oppressing others and you need to be hated, there's no way for you… \nAlthough they argue that men are not born this way but still relate it to men being inherently wrong.\n\nThen comes Samantha Allen (very famous feminist) who on [tumblr](https://archive.ph/iITfR) writes \n\n>why do i have to answer the question “why do i hate men?” when men don’t even stop to ask why they have always hated women. I have to answer the question because men can’t tolerate for one second the sort of contempt they’ve had for women for thousands of years.\n\nAnd how can you be a better man?\n\n>I am friends with some men, yes. usually these are men who have some experience of marginalization (whether via their race, class, gender identity, sexual identity, what have you) or who have gone through the self-interrogation and relational deprogramming necessary to build meaningful community with women. you don’t just get to read a book and you’re golden. you have to get fucking baptized in menstrual blood as far as i’m concerned.\n\nYet again…… \n\nSame goes with Emma Watson she also men to be feminist to liberate women because it's men's duty to do so as men are one creating these problems. #heforshe is a perfect example of it.\n\nAnother feminist Evelyn who talked about how men who say \"not all men\" are \"pick me\" men in her BuzzFeed [article](https://www.buzzfeed.com/victoriavouloumanos/psychology-behind-not-all-men)  on her instagram [igtv](https://www.instagram.com/tv/CPi33qWD-TX/?utm_medium=copy_link) says\n\n>In other words, absent men's aggressions and problematic behaviors women are doing fine. That's why when a male ally shows up and he talks about how he wants to \"protect\" women in his life, and he cares about women in his life and that's what got him into feminism, I'm skeptical because you need to be concerned about your fellow men. Men are deeply harmed and they are in trouble because they are going around aggressing and not unlearning their sexist behavior. \"Men respect each other and men care for women\". I need that to be reversed.I need men to care for each other and really be concerned about what's going on with their fellow men and I need men to respect women\n\nAgain and again these are the same things repeating…\n\nWell, basically I thinks this is just plain gender stereotyping and a very bad move to take men into and harms in a lot of ways like gender specific/biased laws, they are made on same assumption and stereotyping of men that they're trying to uphold some dominant structure and trying to possess power by intimate partner (as by Ellen Pence, Renuka Chowdhury) and sexual violence (as by Marry P. Koss, Flavia Agnes) violence…. \n\nFeminist who claim to have been doing emorional liberation for men and freeing men from these emotional box do themselves ignore men's emotions by these stupif fallacies as excuse to hate men, generalize men and even if you're male feminist you will be accused of taking up women's spaces if you talk about men, you will have to \"recognise your privilege\" and keep shut up until asked to speak, you will be told your issue is not as big as theirs and what not.. this just goes on.\n\nThis is reason most male feminist when talk about other men they look like an apologists who have done something bad in past.\n\nThere are a lot more such tactics but this post was specifically for this one :)",
    "title": "Feminist gaslighting and shaming tactics against men.",
    "subreddit": "MensRights",
    "timestamp": 1624374426,
    "score": 167,
    "keyword": "mixed race director"
  },
  {
    "text": "I hate my woke school board My friend showed me this sub and I've been really tempted to post on it, so here I am. This is just a throwaway account because I'm scared of what would happen if I posted this on my main. I hate the fact that now people need to be careful about sharing their real opinions.\n\nI'm a 15-year-old girl in grade 10 and I'm fed up with this feminism shit in school. (and before you point it out, yes I know it's ironic that I'm making this post as a female). A lot of the subjects in my school are dominated with social justice and I hate it. English is the worst of all because my teacher is a social justice warrior and always talks about feminism and race insensitively (also making racist remarks about her fellow white people lol) in front of the whole class. EVERY single start of the class she talks about feminism and how girls are poor little victims, their rights are being disrespected, blah blah blah. I fucking hate it. I'm someone who's victimized for both my race and my gender and I hate it so much.\n\nLast month we started reading books. ALL of the options were about social justice. She was like \"It's better if I let you chose a book, rather than if I just handed you a book by an old dead white guy\" (yes, she really said that). Pretty much all the books had an \"important message\" in them, so I chose a book that seemed to be the least like it would be full of social justice. Turns out the entire fucking book is a message about feminism (as well as racism), the two subjects that bother me more than anything. (The book is called \"Monday's Not Coming\" if you dare to touch it)\n\nWell anyway, I was reading a part of a section today for my school work and so basically some girl is invited to a sleepover with other girls. The sleepover takes an unexpected turn that the main character didn't expect and she ends up going to a party and getting drunk. I PREDICTED what would happen next, and I hate that. Some guy sexually assaults her, of course. Fuck that book. Fuck my life. Fuck everything.\n\n&#x200B;\n\nI can't even express my anger in words. I don't even know how to properly end this post but it's just great being victimized for your gender and your race :) (I'm mixed by the way). I hate it how the sjws portray women as \"poor little victims aww omg r u ok :'''( oJHDJGSHJVD ARWJKUD GUSKDBM HJKFWSGJdb,hgajfuckingshootme\"\n\na\n\nwxdquodhkfjvsgfxe\n\nd d\n\necfwd\n\nfwxv\n\n&#x200B;\n\nI am going to have a meltdown\n\nOkay, that's my vent. Bye.",
    "title": "I hate my woke school board",
    "subreddit": "MensRights",
    "timestamp": 1619114505,
    "score": 37,
    "keyword": "mixed race director"
  },
  {
    "text": "Support NFL Cheerleaders, sign the petition to demand Roger Goodell to release the findings from the abuse allegations concerning the Washington Football Team I'm appealing to anyone reading to help to protect an entertainment segment that primarily concerns women in the male dominated NFL organization. I've been very encouraged to see posts in other subreddits amplifying the treatment the Washington Football Team's former cheerleaders were subjected to by leadership. I thought I would take some time to outline the context of this decision and provide an avenue for members to help the former cheerleaders against WFT leadership.\n\n**TL;DR NFL cheerleaders and NBA dancers shouldn't lose their jobs because of abusers or the potential for abuse, sign** [**the petition**](https://www.change.org/p/roger-goodell-nfl-washington-football-team-do-the-right-thing-for-women) **for accountability from the NFL.**\n\nThe first thing you should know is that this situation is not unique. The NFL has never offered cheerleaders within their ranks adequate respect and compensation for the labor they provide, which manifests into dancers being unceremoniously fired, forced into abusive situations without accountability or punishment for the abusers, and losing their voice to change things for the better. The most recent instance of this is with the [decision to do away with](https://www.fox5dc.com/sports/fox-5-exclusive-washington-football-team-cheerleaders-speaking-out-after-the-program-is-paused) the Washington Football team’s cheerleaders as a “solution” to [years of abuse they and other women suffered](https://au.sports.yahoo.com/nfl-2020-washington-redskins-sexual-harassment-employees-013235651.html) under leadership within the organization. [Here's a tiktok](https://www.tiktok.com/@hulia_c/video/6931037486932086022?sender_device=pc&sender_web_id=6914480104781399558&is_from_webapp=v2&is_copy_url=0) from a former cheerleader about the situation.\n\nUnfortunately, this is not an isolated incident with dance teams in sports. Many of these examples are from the NBA but they highlight a trend that is quickly spreading to the NFL.\n\n[All-female Milwaukee Bucks dancers disbanded](https://www.jsonline.com/story/entertainment/2019/07/24/milwaukee-bucks-dancers-being-replaced-gender-inclusive-414-crew-perform-games/1814423001/)\n\n[All-female Spurs Dancers disbanded](https://www.theguardian.com/sport/2018/aug/03/an-abrupt-firing-leaves-san-antonio-spurs-dance-team-hurt-and-suspicious)\n\n[All-female Sacramento Kings Dancers disbanded](https://www.sacbee.com/sports/nba/sacramento-kings/article230671294.html)\n\n[Podcast of former Kings dancers speaking out](https://www.procheerleadingpodcast.com/podcast/episode/3f2855a5/bonus-episode-fighter-protesting-the-elimination-of-nba-dance-teams)\n\n[All-female Cavalier Girls disbanded](https://www.cleveland.com/entertainment/2019/05/cavs-replacing-cavalier-girls-with-co-ed-dance-team-next-season.html)\n\n[All-female Dallas Mavs Dancers disbanded](https://sportdfw.com/2019/06/06/dallas-mavericks-dancers-the-truth-that-everyone-is-dancing-around/)\n\n[Buffalo Jills disbanded after attempts to unionize](https://buffalonews.com/sports/bills/the-nfls-cheerleader-problem-and-the-buffalo-jills-what-happened/article_35ef23b0-50bc-531d-8eb1-8db35647e919.html)\n\n[First Buffalo Jills unionization attempt in 1995](https://apnews.com/article/e47b1617a1c12a42bbc372f7110a237e)\n\n[It’s internationally an issue too](https://www.news.com.au/sport/nrl/hollywood-star-russell-crowe-blamed-for-nrl-cheerleader-controversy/news-story/7b555d31efc92465da9a223a5778de3d)! (Screw you Russell Crowe.)\n\nWhat these decisions demonstrate is a need to control the narrative of dancers' mistreatment by getting rid of them or adding men to the mix in lieu of treating them appropriately to begin with. The logic is if a team is male and female, other people will be less inclined to harass them. A mixed gendered group of dancers will be respected more than an all female group of dancers. Hopefully it's clear why this is a reductive way to combat gendered abuse. It supports the idea that it’s inherently sexual and wrong for a group of women to perform for fans. It tells women \"You know what? It's because you're women that people are creeping on you, let's add men to your group and now you'll be left alone and stop complaining.\" (I’m explicitly talking about teams that are completely losing the pom/jazz dance style that mainly women perform and replacing it with hip hop or something more gender neutral or entirely male, which is considered “appropriate.” [Case in point.](https://www.mavs.com/meet-the-maniaacs/)).\n\nOrganizations are internally forcing cheerleaders to withhold \"sexy\" aspects of their performance and presentation, the same ones that they've profited off  of and demanded from us for decades. They say it's to provide \"family-friendly\" entertainment, but in reality it is to protect themselves from having to be accountable for abuse and from doing the work necessary to provide cheerleaders a workplace with the respect and autonomy they are lawfully entitled to. Without internal checks and balances, cheerleaders could wear burlap sacks out on the field and still be subject to harassment. Plus, it's the laziest censorship in existence. They tell us to dance \"sassy\" instead of \"sexy,\" which in case you were wondering doesn't mean anything. They require us to work out just as much, wear the same amount of makeup and the same big hair and the same two pieces, but minus cleavage. No visible cleavage is all that is necessary to remove a woman's sex appeal. It's the sort of thing that makes sense only if you don't think about it.\n\nThere is nothing about this and other decisions that is for dancers’ protection and safety and the consequences of these decisions disproportionately affect women. While I am glad teams are normalizing having male dancers, the landscape enabling their inclusion has come at the expense of women who have been doing the work and labor they were told to do for years before being cast aside for all of a sudden being  too \"risque\" and/or for having the gall to ask for better treatment. Men  involved gives teams the power to no longer call mistreatment of the cheerleaders sexist because you can't be sexist to men (/s). All it does is cast a wider net for dancers to be taken advantage of. Now male cheerleaders can be underpaid too, how's that for equality? All NFL cheerleaders no matter the gender deserve better.\n\nThe zeitgeist is forcing the NFL to act, but instead of taking it upon themselves to gut the creeps and proactively enforce proper treatments of employees, they get rid of female cheerleaders permanently, usually in the most disrespectful manner they can muster. They make these decisions without input from cheer directors, many of whom were cheerleaders in the past. It's as if no one who has ever held poms has a right to suggest any ideas or share insight to determine what kind of  changes can be made to make things better. Ignoring women, getting rid of women, it's is the easy way out.\n\n*Let us do our jobs and foster an environment that allows cheerleaders to work and thrive without fear of abuse.* Don’t render the training, dancing, and presentation that brings us confidence and joy as shameful because other men can’t control themselves. Is it really asking too much in the year of our Lord 2021 to demand respect from people while presenting in a sexy way? No. To say it is demeans everyone involved. Forcing dancers to lose out on opportunities to perform and generate income, especially now in a pandemic where women and performer's work opportunities are dwindling each day, because harassers never learned the concept of consent is victim blaming and it’s not OK. Punish the abusers, not the survivors. If something needs to be changed about the cheerleaders' presentation, talk to them about it. You didn’t hire us because we were brainless airheads just shaking poms. We are educated, some of us are parents or work full time. Most importantly we are your employees. We have valuable input if you bothered seeking it out.\n\n**So what can you do?**  We need other people out there to help and amplify our demands. The  disbanded First Ladies have a petition that demands the details of the misconduct from the Washington Football Team’s organization to be made public for accountability. Women on that team and cheerleaders all throughout the league would appreciate your signatures and support. They have surpassed 35k signatures and now have [support from celebrities and notable activists from Time's Up](https://timesupfoundation.org/work/justice-for-survivors/washington-football-team/). Even with this, they still need all the support and attention they can get, so please consider signing.\n\n[https://www.change.org/p/roger-goodell-nfl-washington-football-team-do-the-right-thing-for-women](https://www.change.org/p/roger-goodell-nfl-washington-football-team-do-the-right-thing-for-women)\n\nIf you want to learn more beyond the articles I linked, I highly recommend streaming [A Women’s Work](https://www.awomansworkdoc.com/), an amazing documentary following women who have demanded better treatment from these teams and the process around that. Also has salient commentary on the experience of cheerleading from cheerleaders themselves and why we do it.",
    "title": "Support NFL Cheerleaders, sign the petition to demand Roger Goodell to release the findings from the abuse allegations concerning the Washington Football Team",
    "subreddit": "Feminism",
    "timestamp": 1615067835,
    "score": 22,
    "keyword": "mixed race director"
  }
]