[
  {
    "text": "Quitting your job. What's the best quit your job stories? I was there four long years, but I wish it would have been 4 hours. At first it wasn't that bad in my eyes because it was my first entry level job and I was making more money than I had my entire life. But after a few months and I was let loose so to speak, things got toxic as hell. First off, I had three bosses. All three were snarky, entilted,full of themselves, disrepsectful, perverted, vulgar, etc. I could go on and on. I started as a 22 year old male, and even I would literally cringe at the things they would say about women, politicians, other co-workers, or just anybody they felt deserved their ridicule. One manager in particular, who was my main boss, was the most repulsive. He made the other two look like angels dipped in pixie dust. He was short, fat, dipped snuff and typically had it all over his face, extremely loud, bullish, etc. Again, I could write a book on how awful this guy is/was. He would patronize the receptionist on a daily basis. And belittle anything and anybody. Any woman, and I mean any age or color, that walked in the door he couldn't help but judge her attractiveness in the most asinine way. Needless to say, I pretty much heard a grown tell me how he would fuck said woman every day of the week. He would plop his fat belly on top of his desk and imitate sex moves. It was disgusting and me and my co-workers had to sit through this and smile like we approved of what he was doing. It was awful. Not only did he do lewd acts like the mentioned, but he may have been the most judgemental/hypocritical human being I have ever been around. He would criticize people for not raising their kids right even though he didn't have any. He would make people feel like complete shit for taking their company issued vacations but he would miss four days in a row with no explaination. He mocked and made fun of an employee when he was going through a divorce, yet his wife had been wanting to leave him for months. He called another co worker worthless and a loser because he was struggling with an alcohol addiction, but he was a recovering alcoholic. He just flat out sucked to be around. Needless to say, he was a big part of the job being a toxic environment for everyone. But besides all that, they were extremely unfair with our work. We were in sales, and we had a damn good sales teams. We were breaking monthly and yearly sales records left and right. But none of that was good enough. We had weekly and in some cases daily meetings where we were threatened with our jobs if we didn't do this or do that. And anytime someone stood up for everybody, they would start their belittling train of garbage and try and make us feel 3 foot tall. We struggled to meet their impossible and unfair goals. At only 25, I had to check myself into the ER one night because of stress related palpitations. My BP was high and I was just burnt out. I tried my damnest to get out. I had a couple of interviews mixed in but nothing came about. I was ready to take a job shoveling poop just to get out of that God forsaken place. Well, one day...... shit hit the fan. I was working a customer and got him to commit, I went to my main bosses office to tell him what was going on. Well, he proceeded to tell me that he didn't like the way I handled the deal and I was awful at my job. (Keep in mind I have the deal SOLD) I slightly showed anger and told him I didn't appreciate him talking to me like that and that I've done nothing but work my ass off for him. He stands up and starts screaming in my face. Calls me a lazy piece of shit, a \"lazy millennial\", and that I should just go live off my dad's money (my dad is not rich). Welp, I shoved him. Shoved him as hard as I could against the wall and we go to tussling all over the place. Co workers break us up and as we are standing face to face I call him every name I've ever wanted to call him. It was the most relieving yet upsetting thing I have ever done. Of course, he says I'm fired. And I tell him great, I don't want to work for a fat, tea pot shaped fuck anyway (LOL). I go home that night and call everybody from the General Manager to the CEO and pour my soul into telling them what was going on at that store between me and everyone who works there. See, all they see is numbers, they had no idea what was going on inside. Well, the GM calls the next couple of days and is sucking up like crazy. Not only does he offer me to stay, he offers an extra week of vacation and he is willing to pay for it up front. They knew how pissed I was and I had ammo to turn their shit show into a PR nightmare. I accepted the offer and took the money and quit the day after. Best day of my life.",
    "title": "Quitting your job. What's the best quit your job stories?",
    "subreddit": "jobs",
    "timestamp": 1495228165,
    "score": 6,
    "keyword": "mixed race judge"
  },
  {
    "text": "Signing in at my local Planned Parenthood and an older man walks in... ...heading right towards the counter where I'm standing. \n\nI freeze. \n\nHe's not with a woman*, he's got on a heavy coat. My mind starts racing- all I'm trying to do today is get my lady bits checked out and a prescription for a NuvaRing. Not die in a clinic shooting. \n\nHe gets to the counter, and he hands the nurse an envelope, telling her \"Thank you for saving women's lives! That's what you're doing here. You're on the front lines helping these women and all I can do is say thank you.\"\n\nApparently he comes in at least once a month with a card and a donation. It was super awesome to see some support for them from my community- even if it was a little alarming!\n\n*I know that PP also helps men and that it was wrong of me to snap judge that way, but with the current climate towards reproductive rights I really was terrified for a second.",
    "title": "Signing in at my local Planned Parenthood and an older man walks in...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1483735426,
    "score": 533,
    "keyword": "mixed race judge"
  },
  {
    "text": "I was raped on Wednesday and I just needed to write about it a little Why am I so focused on insignificant things? Why am I so bothered that I have to leave my favorite pair of thrift store jeans on a piece of paper spread across the bathroom floor? They cost me less than ten dollars and they were starting to get loose around my hips anyway. Why do I care when the detective and her partner take my bedsheets away in a brown bag? I got them with a coupon at Bed, Bath, and Beyond and the thread count wasn't even that high. Why do I fear that my nurse will judge me when I mention to her I dyed my pubic hair purple a few weeks ago after she clips away several strands? Why do I worry that calling the strawberry Zofran tablet I dissolved under my tongue an antiemetic will make me seem too knowledgeable about a process I've never been through? Will they think I'm lying because I circled around the parking garage a couple times across from the police station instead of just parking in a handicap spot right out front? Will they tell me it's too gray to proceed with charges? I had told him ahead of time that I didn't want a relationship or sex. I told him that things were moving too fast and I was still in love with someone else and I wanted to be celibate for the next year. I told him all of this before we met and he agreed that we should just be friends. And still he came through my door and hugged me and later said on the phone that I gave him mixed signals because I sat down on my bed. I was wearing a t-shirt and jeans. I wasn't trying to send any signals. He started kissing me and I hadn't even looked at his face yet. So he kissed me and I kissed him back even though I didn't want to. And he slipped his hand under my shirt and grabbed my breast and asked me to take my shirt off and I did. And he gnawed on my left nipple piercing and I looked at him for the first time and felt disgusted. And my pants were off and I can't remember how they ended up down at my ankles. Did he do that? Did I? He's biting at my stomach and touching me and licking me and I don't want this. I keep turning away and he asks me why I won't look at him and why I'm hiding my face. I tell him I'm shy because I'm scared if I tell him I think he's repulsive he'll get mad and sometimes when men get mad they hit you. Sometimes when men get mad they kill you. So I just roll over and lift my comforter over my face like a child watching a horror movie. His pants are off and he's standing on my bed looking down at me and I feel small. I don't want to look at his body. He doesn't look like the person in the pictures he sent me. He doesn't even appear to be the nationality he claims to be. He wedges himself between my legs and tries to fuck me and I tell him no and I'm so proud of myself. And he's says \"ok\" and I'm relieved. I explain to him that earlier in the week that things got out of hand at a photoshoot and I slept with the other model and even though it was consensual it wasn't something I felt good about. And he seems like he understands and he says he's sorry about that and then he asks when I'd last been fucked prior to that. I keep turning away. He holds me, spoons me like we're some couple and not strangers that met less than half an hour earlier. And he's touching me again and I feel his fingers near my vagina and then suddenly his fingers are gone and his fucking dick is inside of me and my body slumps like a scruffed cat. I'm lying there, I'm a body, just a body, I'm frozen, he's thrusting into me and I can't believe this is happening and he tosses my body around like I'm not even a person underneath all this flesh. I don't know how much time passes. It feels like a minute or two. He doesn't ask me if I'm okay or if I like this or anything. It's like I'm not even there. And finally I'm able to speak again and I say \"I don't want to do this\". He says \"do you not like me?\" and I can still picture his fucking pathetic face when he asks me this and all of a sudden all I can do is cry and repeat \"I don't even know you I don't even know you\". He says sorry and asks if I want him to leave and I say yes and then he insists that he's going to take me somewhere and I tell him to leave. He asks to use the bathroom and I give him permission and he leaves my house and before I can even get up to lock my door he rings the bell and I realize his sunglasses are on my dresser. I'm wrapped in my comforter and I hold the glasses through the crack in the doorway. Why the fuck do I offer him such courtesy? I shut the door and run back into my room and cry and I want to scream but I don't because I think if I start I'll never be able to stop.\n\nYesterday, the day after, I bought a white pages account and looked up his phone number. He had never told me his last name, just his first name. It turns out it wasn't even his real fucking name. I thought he didn't look Spanish and it's because his name is Pakistani. And when you Google his name it looks like he got married a little over a month ago. He's a rapist and a liar and a piece of shit and I'm so fucking angry.",
    "title": "I was raped on Wednesday and I just needed to write about it a little",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1503108495,
    "score": 89,
    "keyword": "mixed race judge"
  },
  {
    "text": "Is mentioning you're a feminist on a date a huge \"nope\" that I just didn't know about? So my friend set me up on a blind date recently (yes, because I was gonna be alone on Valentine's Day and was desperate, judge me lol). She said the guy was nice and good socially and just a good guy all around so I agreed.\n\nThe date had been going fine and  we were just getting to know each other and he asked \"So what kind of woman are you, like a girly-girl or tomboyish or what?\" All I said was that I was a mixed bag and that I was a feminist and didn't really believe there is such a thing as a true girly girl or whatever. I wasn't preachy or anything. He just said \"oh yeah, I guess you're right\" or something like that but i could tell from then on he had lost interest in me and like ten minutes after he got the bill and we left and he didn't ask for my number...\n\nSo I told my friend how it went and she basically said \"have you never talked to a man before? Don't mention feminism!\" I explained the context and she said I should've just said I was a girly girl or else said I didn't know... \n\nSo is this a rule I just never learned? Admittedly I have little success with men and my friend has more so maybe she is right?",
    "title": "Is mentioning you're a feminist on a date a huge \"nope\" that I just didn't know about?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1487094520,
    "score": 87,
    "keyword": "mixed race judge"
  },
  {
    "text": "Can't we all just get along? (Long, and rambling, I apologize) Little bit of a rant, and I'm gonna own that I'm also whining a bit, so bear with me. I'm a cath lab nurse, former ICU, CVICU, & ED. Love, love, love my job! I get to make people happy every day: either we fix em and make em happy, or we get to tell them that their heart is perfect, and make em happy (for the most part, we have a few, very, very few sad endings). And NOTHING feels better than saving a STEMI pt in the middle of the night, and making such a huge difference for them! I wish more nurses would join us, we are always short staffed.  Frankly, I think most nurses are too smart to give up their 3-12s for 4 or 5-10s, plus call ;-) I get it, I really do. And when we do get a new nurse, and get her (or him) trained up, they usually leave to do travel assignments and make buckets of money, because cath labs across the country are short staffed and need travelers, it's a vicious cycle. \n\nI'm on call this weekend, and it never fails: we get called by that one nervous ED doc, and cancelled before we finish parking. No pay for our time traveling, no pay for dropping whatever we're doing at home to zoom into work within 30 minutes (I was in my pj's for 2 of my 3 calls so far this weekend, but I feel like it was a win because I remembered a bra). Again, I get it, that's the job I chose. But often, it feels like we're the unloved step children of the hospital. Or, the cardiologist basically says 'screw it, we're here, let's just do the damned thing', and we're doing a basic cath that could've waited until Monday. It might not be life-threatening, but this patient was labelled as a STEMI, and now the floor is getting nervous that they're going to have a STEMI patient that we refused to cath. Even though it wasn't even a NSTEMI, but instead, a guy going through a cardiac work up last week who got nervous waiting for his diagnostic cath next week and had an anxiety attack.  Ugh. But it's not like we can be mad. That's our job...but not really. \n\nHere's what really chaps my hide: we have been working 5 days a week since last summer, trying desperately to find RNs to replace the 4 who left. We're finally back down to 12 days of call a month, from the 20 we were doing, yay we got a traveler!  We're tired. When we get called in 3 times over the weekend, it's hard not to get frustrated by units who refuse to bring a bed to us for when we're finished, or bring the patient to us if they're in-patient, nurses who refuse to take report when we call, and House Supervisors who insist that we recover the STEMI patient because there are 'no beds'. Like, COME ON PEOPLE! \n\nWhether it's 3 am on a weeknight, or 3 pm on a Sunday, we're alone waaaaayyyy out in the cath lab area. There's just our team, and we don't all arrive at once. We have to set up the room and be ready as soon as the patient arrives, because we have a time limit to meet. 90 minutes, door to balloon, and we've already eaten up however much time it took in the ED or on the floor to get things in motion, 30 minutes getting to the hospital, another 15-20 minutes turning on equipment, setting up the room, calling for a quick report, pulling drugs, mixing meds, and throwing the table. That doesn't really leave time to transport, get the patient switched over to our table, and re-do the ekg/cuff/ETCO2/and defib patches, because it all has to be different so as not to be in the way of the xray/sine pics. At this point, the Dr might only have 20 minutes left to get access and maneuver a guide and wire into a tricky spot and balloon it before the stent goes in. 90 minutes seems like a long time, but it's not, especially when the patient's life is on the line. \n\nAfterwards, we still have to be at work the next day, 7 am as always. Or we go home to be on call for the rest of our overnight or weekend shift. When we get called in at 530 am or pm, I know we might get lucky and finish within 2 hours, and I'm sorry that you're going to change shift at 7, but when I call at 650, please don't refuse report and make me wait until 720. My patient is cold and miserable, the family is anxious, and we just want to go home! We still have to clean and mop the room and get it ready for the next STEMI, and we can't start that until the patient leaves. And the patient can't leave until I give report. I'm a good nurse and I do cate about my patient, but a STEMI is a true emergency, and I probably don't know much. I know that the pt is stable, I can tell you what meds I gave, where his IV is, where his stent is, and maybe his allergies. I will probably have to look to tell you the gauge of the IV, because shit was hitting the fan, and I only cared that the IV worked, I didn't notice the size. I can tell you that he collapsed while waiting to catch the train home, and a police officer who knows good CPR was standing right next to him, and his wife is frantic waiting to see him. That's all I got. That's all I can tell you. I won't take 2 minutes of your time, and I can transport the patient, tuck him in, and take your 1st set of vitals by the time you finish shift change. I'll even go over orders with you, and remind you how to handle a TR band if its been a while. Or, I'll ask the Dr to place a seal in the femoral artery, so you don't have to pull a sheath (and I won't get paged in 4 hours later, because you're too busy to pull it, grrrr).\n\nAnd please don't treat me, or my techs, like we're dumb. The techs in the cath lab aren't \"techs\" in the sense of the word that they're nurse helpers. No, they kinda run the cath lab world. They are highly trained in cardiology, with an RT or XRay degree, plus extra CVT training (Cardio-Vascular Technologist), or they graduated from a CVT school. They can make more money than RNs, lol, and they are often 'in charge' or the manager. They take the same credentialing test as RNs, the RCIS, which gives them the right to circulate patients. They don't do conscious sedation, that's the only difference. They can handle all the drips and meds the ICU deals with. They are ACLS certified. The Dr's rely on them to be an extra set of eyes and hands. In some facilities, they get access in the femoral artery, seal arteries, and pull or place catheters. They may even be allowed to perform most of a diagnostic cath, though that is rare these days, but that's a big ol political thing I won't get into. Just know, they are safe and smart and highly educated. They can run circles around most nurses. They don't \"assist\" me. Techs are my teammates and my equals, with more cardiovascular knowledge in their little fingers than most nurses will ever hope to have (including me, but I'm getting there, lol). And just because I couldn't give you a full head to toe report, please don't roll your eyes. I did my job with what I had. I'm not a bedside nurse anymore, and I often don't have access or time to look for any of the information you need. I think *YOU* are awesome. Please recognize that I'm still one of you, but with an extremely focused job that requires something very different from what you're able to do as a bedside nurse. \n\nSo, long story short: please recognize that while we understand the difficulty of taking a report right at shift change, or the frustration of getting another admission, my job is sometimes 24/7, and I'm ready to go home and eat my dinner 3 hours late, or see my kids, or get 2 hours sleep, before I get called in again.  I don't want to hold a patient, all alone with 1 other nurse, in a recovery area that's shut down and empty for the night or weekend, for any amount of time (yes, I have those bad-ass techs on my team, but they don't count as nurses, they can't monitor a patient after the procedure is over, only *during* a procedure. They have to clock out and leave). I came in and did my job, now I want to clock out and go home, too, before it starts all over again. I swear it's not a dump and run. We know you've got this, please take it from here asap!\n\nI'd really appreciate it if you could find a little empathy for your cath lab brothers and sisters. We don't mean to be grumpy, or pushy. We don't mean to come across as abrasive. We're probably just tired, and feeling a little bit misunderstood, unappreciated, and unloved. And I suppose we make you feel the same way, sometimes, too! As for myself, I'm the nurse who's always smiling and joking with you, because dammit, we're going to make a nursing connection whether you like it or not, and you're going to be my buddy who 'knows me', and knows that I won't ever screw you over, because I was once in your shoes, and I totally get where you're coming from! How the hell do you think I ended up in the cath lab? Became friendly with the cardiologist, one of my favorite people, became *his* go-to post-cath nurse in the ICU, then became the STEMI nurse in the ICU when we went interventional, got bamboozled by the funny, nice cath lab folks, and *boom*, let them lead me down a path straight into the cath lab. Darn them all to heck! And now I'm the CCL educator, getting new nurses from the floor who shadow me every Wednesday. (Don't even get me started on new RNs, I love them so much, getting them on-board the cath lab train, to bridge a greater team work and understanding in the years to come, is so much fun and makes me look forward to Wednesdays!)\n\nIf you're still with me, thank you for hanging in there and letting me vent and blow off a little steam. It probably didn't help that when I tried to call report today, for the 4th time, the day nurse forgot to put me on hold while she and the night nurse complained about the cath lab. I do feel a bit petty, because I was once that nurse, I hate to admit. Always feeling put upon by the specialty areas who just couldn't wait one damned minute (or 40) for me to get settled into my shift! Anyways, please understand that I just needed someone to listen, and not judge too harshly, and I'm keeping this up, though I probably shouldn't because I'm not trying to ruffle any feathers or throw shade (though maybe I did a tiny bit). I want us all to show some mutual respect, is that too much to ask? I'm going to start with me, and say that I know I couldn't do what I do, without the nurses in the ED who start the process and the nurses \"upstairs\" who take over where my job leaves off. Thank you for every time you've taken a cath lab patient, and know that you ARE appreciated for the great job you do!  :-)\n\n\n\n\n\nEdit: any patient scenarios are made up or exaggerated to protect identities, obviously ;-)",
    "title": "Can't we all just get along? (Long, and rambling, I apologize)",
    "subreddit": "nursing",
    "timestamp": 1487562397,
    "score": 14,
    "keyword": "mixed race judge"
  },
  {
    "text": "Why I Teach History (7th grade) I’m pretty routinely asked why I bother teaching.  Specifically, people almost always ask why I chose to teach Middle School History.  After all, it is in the past and the kids don’t really care any way.  To try and get to the bottom of that question, I gave an alternative prompt on our most recent large test.  It was inspired but stories from a long-time family friend’s favorite teacher.  The kids, if they wanted to, could write about “What they learned in 7th Grade World History.”  This isn’t supposed to be a humblebrag or back-patting session.  I was just so amazed by what some of my students wrote that I want to share it with all of you.  This is why teachers teach.\n\n\n\n**What I learned in 7th Grade World History – By an anonymous student who has been quiet all year.**\n\n\n   I learned a lot more in 7th grade history than just numbers and dates.  I learned how to think deeper about things, I learned more about why you shouldn’t judge someone by their race, and I learned that history happens all the time.\n\n\n   In 7th grade history, I learned to think deeper.  In the past, I never really thought about the meaning of some of the holidays or why history matters, but now I know that they actually have an important meaning.  I’ve also been way more interested in history.  I want to know about everything, especially when my parents are talking about stuff.\n\n\n   I learned a lot more about why people shouldn’t judge others by the color of their skin.  I learned that it is about more than because its racist and wrong, its also because were all equal.  No one is superior.  Some may think the Europeans are better and smarter than the Meso-Americans but that’s not true because the Meso-Americans also have amazing buildings and creations, such as temples and floating gardens.\n\n\n   History happens all the time.  I used to think that history was just people that changed the world but history also happens in my own life. History is being made everyday, even when we don’t know that it is.  There are also different types of history, such as personal history, world history, and even Internet history.  We probably see a piece of history everyday and we don’t even know it.\n\n\n   In 7th grade history, I’ve learned that you should think deeper, don’t judge people by their looks, and history is being made everyday.  History is importance because it teaches us what to do and what not do do.  It shows up past mistakes so we know to not repeat them.  Therefore, I have a lot more in 7th grade history than just dates\n\n\n\n**What I learned in 7th Grade World History – By an anonymous student who now comes during break to talk about history.**\n\n7th grade World History was one of the most importance experiences of my life.  This class taught me many things that I will remember forever.  It taught me how working hard has it’s benefits, how you should always think about things more carefully, and most importantly, it taught me one of the most important concepts that everyone should learn.\n\nIn this class, the teacher would always push us to do better and always made sure we were doing our best work.  At the beginning of the school year, I found this annoying because I didn’t think I would benefit from it.  I just thought the teacher was too strict about the quality of work.  Now I realize the benefits of this.  It will help me throughout the rest of my life because most things in life, especially when you get a job, need you to do your best and work your hardest to be successful.\n\nThe teacher also taught me the importance of thinking carefully about things.  He taught me this by tricking our classes to see if we would notice he was lying.  Almost every time I fell for his tricks and this taught me to think more closely about things.  Thinking more closely about things will help my everyday life just like always working my hardest will.\n\nLastly, this class taught me about why we care about African civilizations.  This was an important lesson because it showed me how biased our opinions of West African cultures are because they are influenced by European ideas.  This concept will help me educate others on this topic because many do not realize this.  It is the most important thing that I have learned so far in my school career.  Many others need to learn this too.\n\nThis year in 7th grade was very important to me.  It taught me so many important lessons that I will remember forever.  It taught me the importance of thinking closely and working my hardest.  It also taught me about why our opinions on the African cultures are biased and the importance of learning and teaching their true story.  This class will help me in so many ways for years to come.\n\n\n\n\n\n**What I learned in 7th Grade World History – An Anonymous student that sent 10-20 emails to me over the last two quarters, trying to solve the question of “Why we care?” with no points involved.**\n\n\n\nLearning of the Meso-American and African societies is part of the seventh grade standards, but it is often not told the way it really happened.  The takeover and destruction of these civilizations probes the importance of history and the complexity of people and their actions in history.  The reasons the horrendous actions of the Europeans are still accepted are guilt and faulty reasoning, the lack of purely good and bad people, and bias/lack of enthusiasm in history today.  The repetition of these issues in other situations, even slightly, happens over and over in history and the modern day.\n\n\n\nWhen the Europeans arrived and encountered Meso American or African civilizations, they were quick to declare superiority.  Their first reaction to the confusion of the other people was to assume that they were stupid and had no culture.  When it became apparent that they could use these people to their own advantage, they decided that the best way to relieve the guilt was to make the non-Europeans inhuman.  This creates the illusion that killing and enslaving people was much less cruel than it should be, as they were not people at all.  This idea is used over and over again by thousands of people.  Essentially making the victims of evil actions into people who shouldn’t be seen as victims, thus the actions are no longer evil.  It is seen in history and it is seen now, and being aware of it gives one the ability to properly understand the actions of others.\n\n\n\nThat being said, most who cover up what they are doing do not think they need to cover it up.  Most people legitimately believe that what they are doing is for the greater good, including the Europeans when doing their pillaging.  King Leopold infamously believed that what he was doing benefited the Africans.  It goes to show that humans are never purposely trying to be bad.  Even if they are aware of their cruel actions, they believe that their reasons are good and that what they are doing is just.  There is no such thing as a purely good or purely evil person.\n\n\n\nThe true story of the enslavement and slaughter of the Meso-Americans and the West Africans is often quieted or ignored for the same reasons as displayed above: guilt, excuses, and the honest belief that what the Europeans did was okay.  Without seeing every side of this incredibly complex story, one would be just as ignorant as the Europeans.  It is important to try as hard as possible to become unbiased and open-minded.  This sentiment applies to everything in life.  Surrounding oneself with diverse opinions and views of the world is the fastest way to eliminate ignorance.  One can’t just listen to whoever’s voice is the loudest.\n\n\n\nThe reason why we care about the Meso-American and African civilizations is complex on its own, but it connects to outside issues and the entirety of human nature.  It teaches one how to be an intelligent, less biased member of our society and most significantly, how important history is to achieve this.",
    "title": "Why I Teach History (7th grade)",
    "subreddit": "Teachers",
    "timestamp": 1496599461,
    "score": 125,
    "keyword": "mixed race judge"
  },
  {
    "text": "[Inner city] [US History/8th grade] - Black vs African-American? I'm white. For the past four years, I've been teaching 8th grade in a school where 90% of the students are black. I've only taught ELA, but when something comes up regarding race and I say \"black\", someone will cheekily say \"it's AFRICAN-AMERICAN!\", or when I say \"African-American,\" someone will cheekily say \"Just say BLACK, I'm not from Africa!\"\n\nIn reality, I just mix it up based on what sounds better in the given sentence. I probably say \"black\" more because African-American is hard to say with a lot of syllables. But I have some sensitive students that take themselves pretty seriously, so I'm trying to avoid angry parent phone calls this year.\n\nThis is my first time teaching U.S. history so race is going to come up a lot. I want to explain from the start what I just said here, but I really have no right to tell them \"You shouldn't be offended by black!\" or \"Most of you aren't even from Africa, so I'm not using African-American!\"\n\nAny advice? Should I just accept there will be complaints either way and ignore them like I do with most petty complaints?\n\nOther info if it matters:\n\n* In a major northeast city\n\n* Most teachers are white\n\n* Right on the border of a very white neighborhood, so most kids are pretty racially desensitized\n\n* About two kids a year will angrily call me a cracker, so racism is still there a bit",
    "title": "[Inner city] [US History/8th grade] - Black vs African-American?",
    "subreddit": "Teachers",
    "timestamp": 1502968943,
    "score": 13,
    "keyword": "mixed race judge"
  },
  {
    "text": "My Dad was a principle for 25+ years in the private system and the international system. He had some sage advise for me going through parent teacher interviews for the first time. Im posting because his advise to me as a new teacher was supper helpful I thought it would be helpful for others as well.  Posting my email to him as well to give his response some context.  \n\nMY EMAIL:\n\nI'm pretty taxed mentally trying to stay atop of teaching my courses and I'm now very emotionally and mentally taxed dealing with these parent teacher conferences. I had 1 hr today of meetings but tomorrow I have just under 4hrs of meetings.\n\nI'm just looking for some words of wisdom or some mantras to hold on to as I go through tomorrow.\n\nI'm taking notes in each meeting for follow up and am enjoying aspects of them.\n\nI also feel like I don't know the kids enough to properly judge or give advice to their parents on things that are more behavioural or psychological entrenched due to nurture. I should do more teacher student conferencing I think.  But yeah, the parents seem more concerned with \"how do I handle my child.\"  Some good parents thrown in the mix there too though who seem to be taking care of business.\n\nLooking forward to tomorrows challenge but nervous to remain in self control all the same.\n\n\nHIS RESPONSE:\n\nYeah, parent teachers can be a very trying time. Parents are always looking for some kind of a  magic bullet that will make parenting easier. I think in reality they know there is no magic bullet parenting is hard and they still hope to find that bullet. \n\nThe main thing for you to do is like you saying in you’re fourth paragraph. You don’t really have any answers for them because it is early in the year for you. Just remain positive  and remind them that you are both there to talk about their child’s academic progress in your subject area. That’s probably the best advice I can give you. It’s always good to affirm the parents That their concerns are valid and that you know they just want to be better parents. That’s where you can relate to them by saying I’m trying to be a better teacher too. Point out to them how you see their your child in the classroom and the good things you see there. Always encourage them to be consistant as much as possible. \n\nProbably the best mantras I can think of for parents is “let’s keep working at this together”. “this too shall pass” or “I will remain positive”.  It’s also good to remember that these parents are going to meet with three or four other teachers. You’re just one of the teachers that they’re going to dump on this afternoon. \n\n If you hear anything that really concerns you you might suggest that the parents set up an appointment with your school counsellor. \n\nJust enjoy them. You will learn a lot about the kids and the families they come from. That will help you  to be a better teacher.  Parent-teacher interviews can be trying time but it’s also a great learning experience. Don’t be too hard on your self and have fun with it. \n\n\nTL;DR “let’s keep working at this together”. “this too shall pass” or “I will remain positive”.  Don’t be too hard on your self and have fun with it.",
    "title": "My Dad was a principle for 25+ years in the private system and the international system. He had some sage advise for me going through parent teacher interviews for the first time.",
    "subreddit": "Teachers",
    "timestamp": 1509042356,
    "score": 11,
    "keyword": "mixed race judge"
  },
  {
    "text": "Mathematician considering industry jobs, how do I proceed? I originally wrote this post as a question on a thread for/r/math, but I thought it might do well here. Let me know if there are any bits that are unclear, as I was originally asking the question to an audience that had spent at least some time in academia, and as such some of the jargon might not translate so well. Thanks!\n\nBegin content:\n\nI just matriculated with my Ph.D. in pure math (combinatorics, graph theory) and an MSc.  in Computer Science. My career ambition was (is) research-y academia (think a 2-2 teaching load at a good 4 year school, with either the presence of master's students or a strong undergraduate research program). My CV is  good for someone in this phase in my career ( above average number of publications, diverse author group, a good mix of strong journals, some work with undergrads led  by me) along with a good teaching record. The search was a partial success, with a few tenure track interviews and short-listings for some research post docs. Ultimately, I wound up with a visiting assistant professor position (2-3 teaching load) which is quite nice. However,  it's a temporary position and my passion is research, ultimately. So I'm going to be on the market for the next few years, and it has occurred to me that I should broaden my search a bit this year to include jobs that are intellectually satisfying that might not be strictly math research. Otherwise, I might wind up 'settling for' a teaching job. I don't mean anything bad against teaching jobs, I just mean that I would prefer a job with more of a research component even if I get less creative control vs. a job where teaching consumes all of my time. \n\nThe last two particulars before my specific questions:\n\n1. ) My coding skills are not those of a software engineer. I've taught intro to java, but most of my experience on the grad level is coding to work on combinatorics problems (python/sage), a parallel processing class, some scientific computing (MATLAB), and a few courses that required some tough C coding (that I had to teach myself). It would be best to think of me as a good problem solver who is familiar with coding and is good at pounding his head on his keyboard until stackexchange helps. \n\n2.) I have a two body problem. My wife was pretty much willing to move wherever I got a post doc. Now that I have one, and her career is another year advanced, the standard for us packing up gets higher each year. I know how to apply for jobs on the academic market, but some of my questions below will discuss how to address this regarding the private sector. \n\n3.) Math is a small world. If you have recognized me, don't take this as a total departure from academia, or as bailing on my current position which is designed to have me on the market for the next 3 years! Just trying to broaden my horizons a bit in the smartest possible ways. \n\nMy specific questions about non-academic jobs:\n\n1.) What sorts of jobs are well suited for folks like me? I know the NSA, and there are national labs (but without an in with the scientific communities, I am skeptical about being mote competitive than I am on the academic market). I know words like 'tech' and 'data science' as industries, and I know a little about machine learning (more theory,  and I have seen applications that made sense), but if I contacted any of these places, I would be a little clueless about how to describe which jobs I would be interested in. In fact, I would probably need them to tell me what's what. This is starkly contrasted with my academic applications which are largely driven by my research statement where I very specifically outline my research program for the next few years. \n\n2.) There are a few cities that would be nice to live in (familiarity,  family and friends, etc.). How do you figure out those private industry jobs that have presences in those cities, and look for openings just there? For example, one such city is Charlotte, which has a Microsoft campus. But I don't know what they do there, and if they would need a mathematician. Given that each year my pass at the private market will be more and more thorough, being picky about location feels like at least a first pass while I stay on the academic market. A job offer in a desirable city might provide incentive for my wife to move, as well.\n\n3.) When do i apply these places if I'm looking to start May - August next summer? \n\n4.) Any good resources for converting a c.v. to a resume? How important is the cardinality and strength of my publications? Mine are not a problem, but in academia \"this many to these journals\" is how you sell it. What are the criteria by which these folks judge those things?\n\n5.) Are there any questions that I was too ignorant to even ask? Is there a more appropriate subreddit or FAQ for \"I wanted to do research and I'm slipping onto the teaching track\"? Any other general advise for early career mathematicians like me that might want a change of pace or who might have temporary positions with a need to broaden horizons?\n\n\nThanks! I hope this wasn't too much of a wall of text, I am traveling but saw this thread and had to post via mobile.",
    "title": "Mathematician considering industry jobs, how do I proceed?",
    "subreddit": "careerguidance",
    "timestamp": 1499341700,
    "score": 7,
    "keyword": "mixed race judge"
  },
  {
    "text": "Are you an Employment Seeker With a difference? On Social media sites it is common to find posts from persons seeking /or looking for references/recommendations to suitable employment opportunities  commensurate with qualification with/out experience. \n\n\nAt the expense of being labelled/judged (the only common trait amongst all human race on this earth) a cynic, I doubt whether such posts help most deserving {fresher's or people trapped in jobs mismatched with their qualification and skill-sets } get benefitted from such posts.\n\n\nIn a largely self obsessed and Self centered world such posts just get scanned and forgotten by most of readers.\n\n\nIn stead of requesting \"contacts\" on social media for references to jobs or recommendations for jobs, people in search of suitable jobs/recommendations , following steps can bring them more closer to the job they desires:\n\n\nJob seekers should keep on upgrading one's skills in line with market demand and highlight their competency in such in demand skills. Thus learning and adaptable mindset is asset for any employer.\n\n\nEmployment seekers should be prepared and ready to lower the bars of their expectations in terms of designation ,compensation,place of posting etc. Not everyone gets everything in this WORLD  SPOILT FOR CHOICE.\n\n\nLowering{tracing steps back} expectations is an approach for taking a long jump in such laid back expectation later on ,once one is back in employment on the basis of sterling professional performance.\n\n\nHighlight how their skills and experience or age can benefit the employers. The world obsessed with \"What is in it for me\", is bound to give at least second look to such candidates.\n\n\nIn nutshell be a SEEKER WITH A UNIQUE DIFFERENCE.\n\n\nThanks,\n\n\nMM",
    "title": "Are you an Employment Seeker With a difference?",
    "subreddit": "careerguidance",
    "timestamp": 1513496069,
    "score": 0,
    "keyword": "mixed race judge"
  },
  {
    "text": "Do I just suck at it? Disclaimer: I'm a bit pissed today, since it's friday and I will probably will have to work the all weekend to meet a deadline next week. So take anything I say with a grain of salt.\n\n**I can't understand If just really suck, or is my job that sucks.** \n\nI'm not one of those 10x coders. I'm just a regular guy that is in is last year of computer science and also works at a ~~software~~ technology company (we are a small (10-15) company people that gets outsourced to build 'solutions' for cheap to large enterprises that are to stupid and bureaucratic to change a config file in less then 15 days), but I really like coding, I read about code, and the industry, and the new frameworks, and follow the tweets and HN and I don't really see doing anything else.\n\nThe problem is that in the last months I was assigned to a new project, to make a mobile app to be the interface to one of those old database applications, in with the workflow was based on pen and paper, excel spreadsheets and a some client to insert the values into the database. \n\nFirst I was assigned to copy the UI/UX that the client wanted into to the app, all the time I was super pressured, and I was told that we were super late. Three days before the first milestone my boss realised that we didn't need all the UI done but just one workflow, but required more then just mock objects and data, so I had to work overnight in those days to deliver it. All of this time he complained that I was doing it way to slow, and if I was doing an all nighter It was my fault for working to slowly. So he went and presented it and they love, and praised us for how much we could do in so little time. \n\nAfter that I had to start integrating the application with our backend with I need to develop, using lots of technologies that I never worked before, and with I was told that was going to be explained, but no one ever had the time to, so I had to hack it together. And also with the client database, with was constantly changing, and was a job that need lots of inputs from my boss, to chose how to approach it but he was never available.\n\nAlso we never had a meeting just to design the application, and yet a didn't know the full requirements of the application, never talked directly to the client and was constantly told to just implement it. Yet I kept hearing how slow I was doing, with I can't even judge if i'ts true or not, because honestly I was stuck in problems that where rather easy and I got suck in them for days, but my boss never had the time to help me. Additionally I had lot's of problems with the framework that I had to work (ionic burn in hell), lot's of scripts that didn't run properly, and stuff not compiling, that also delayed my progress. And I know also my code wasn't really that clean and easy to maintain. I tried using not mixing responsibilities and using patterns, but maybe I was overwhelmed by being my first project in that programming language and my first solo project?\n\nI'm honestly don't know how can I improve, and I don't know if i'm just programming really slowly, our project had really tight deadlines or I just screw it up to much. Yet my boss keep complaining. I don't even earn that well, but I want to leave with a good legacy of being a great programmer, not some shitty tier programmer. \n\nHe might also have this impression of me because every time he seats on behind me to help me with something, he just yells all the time and complains with makes me nervous, and I try to work even faster, and a screw all the shortcuts up with makes him even more upset and is just a pity scene.  \n\n**TL;DR: I can't understand If I'm just really slow at my work, or the schedules are really tight, or I make to many mistakes. How do I self evaluate? And how to improve?**",
    "title": "Do I just suck at it?",
    "subreddit": "cscareerquestions",
    "timestamp": 1486775117,
    "score": 1,
    "keyword": "mixed race judge"
  },
  {
    "text": "Federal Judge Breaking Law in Her Clerkship Comment? Hey all,\n\nI am currently applying to clerkships, and I just came across this gem from Federal Judge Victoria Roberts: \"My preference is to hire clerks with ties to Detroit, to BALSA and to Just The Beginning.\" She posted this on Oscar.\n\nBALSA= Black American Law Students Association. So, she is actually saying: \"I prefer to hire black clerks.\" How is this legal? I understand how race can be looked up as a \"plus\" factor as a key to diversity, etc. But it seems highly unconstitutional/illegal for a person working in the federal government to flat out say: \"I prefer to hire black people\" for this government job. Thoughts?",
    "title": "Federal Judge Breaking Law in Her Clerkship Comment?",
    "subreddit": "LawSchool",
    "timestamp": 1500086159,
    "score": 0,
    "keyword": "mixed race judge"
  },
  {
    "text": "Does anybody here have a sibling who contributes to the Black dating issues? I mean the typical issues like the idea that non Black women/men are better than Black people. My brother is this way. He's 32 years old and single and has really low self esteem so I feel bad for him in that way and race issues towards black men bother him a lot. But when I'm with him, he stares at non Black women *nonstop* like his entire body and head will turn so he can check out a woman walking by but a Black female walks by and it's almost like he tries to look away. He proudly tells his friends (none of them are Black) that he's \"pickier with Black girls\" and that she'd have to be a perfect 10 for him to notice... but he's not exactly the perfect 10 type of guy, and his standards for other races are so low. He will date very homely, overweight or just bland looking White, Latina and Asian women. Even then, he doesn't attract many women because he doesn't take care of himself much, physically & that adds to his low self esteem. He also stares at couples who are interracial with a Black man a lot. I tried to hook him up with my friend but I felt bad because she was the one who asked and she's black/brown skinned and I knew he'd not like that.  I'm a Black female, it just feels disrespectful in a way, like his mind is so twisted when it comes to race and I don't understand it other than deep insecurity. \n\n&nbsp;\n\nHe also says the \"I think she's mixed\" thing when he finds a Black girl he finds attractive, which makes me cringe. Our mother is dark skinned, our dad is multiracial and very light but loves dark skinned women like my mom. My brother is darker like my mom but myself and my other siblings are all lighter tones. He seems the most affected by his race in a negative way. We also grew up in a majority white city but this issue seems beyond that. Should I just continue to ignore this? A part of me just wants to pick his brain and ask him *why* he seems to hate Black women so much... I've been reading up more on Black female issues, especially colorism and they're annoying me, so to have a brother who so openly adds to them is driving me insane. But then I feel like I can't change him, he's allowed to have his thoughts... idk. Anybody experience similar? Any suggestions?",
    "title": "Does anybody here have a sibling who contributes to the Black dating issues?",
    "subreddit": "blackladies",
    "timestamp": 1501346838,
    "score": 45,
    "keyword": "mixed race judge"
  },
  {
    "text": "Born and raised As-Am but I refuse to be ashamed of who I am. I'm Chinese - and China has been stereotyped as the world's sweatshop, people with weird eyes, dog eaters and other undesirable things. I also grew up an Asian American, who didn't see race until late high school, but before I could fully understand it, I went back home to China. \n\nMy mom used to microwave vegetable buns she bought from Chinatown for my lunch and I used to bring all sorts of Chinese food for lunch. It got to a point where even other Asians in class started blaming me whenever they smelled something funky. I never once assumed that the way I looked or the food I ate was weird because that's who I was, though luckily for me, nobody made a big deal out of it because I grew up in a diverse neighborhood.\n\nBut as I grew older and traveled beyond my racially diverse, lower-middle class coastal American city, I've noticed that I've slowly become the \"other\" in society. I've begun slight changes in the way people approached me, a certain coldness or strangers acting weirdly confident around me because they assumed or knew I wasn't a local.\n\nWell, I now live in China and I'm past the age where anger was my response to the world. I've accepted that this is the way things are, and all I can say is - it's made things a lot easier for me. I'm a Chinese person who speaks great English and that's who I am - no more dwelling on what my cultural identity is or how I should change who I am just so I can fit in with everyone else. I don't have to be sorry for being Chinese abroad or the fact that I speak great English in China, and I do feel sorry for anyone who doesn't agree. What's there to lose? They'll judge you anyway, do as you wish.\n\nEven though I live in China now, I am still a citizen of another country in the anglosphere, and through that I hope to retain my Westernized Asian identity to the best I can. I also hope I can make friends with other non-Asians who settle in China, but only if they show they have a basic respect of the local culture. I also hope that, through charitable organizations, I can support non-Chinese, non-Han minorities who are born and raised here but sadly isolated from the rest of our society. Is it only because of my experience as an Asian American do I understand what it means to be \"other\", and I am better because of it.\n\nI will respect you when I'm in your house, and you will too when you're in mine - but I will make no concessions regarding who I am, and that applies wherever I go. Place your two feet firmly on the ground and make the world move for you. \n\nIt's that simple.",
    "title": "Born and raised As-Am but I refuse to be ashamed of who I am.",
    "subreddit": "asianamerican",
    "timestamp": 1486668786,
    "score": 41,
    "keyword": "mixed race judge"
  },
  {
    "text": "Feminism is about equality, it's NOT a hate movement - “The price of clinging to the enemy [a man] is your life. To enter into a relationship with a man who has divested himself as completely and publicly from the male role as much as possible would still be a risk. But to relate to a man who has done any less is suicide. . . . I, personally, have taken the position that I will not appear with any man publicly, where it could possibly be interpreted that we were friends.” – Ti-Grace Atkinson [Ti-Grace Atkinson, Amazon Odyssey, Links Books, 1974, pp. 90, 91]\n\n- Janet Bajan, a member of the New York Radical Feminists, drew applause when she said that man hatred was “a protective reaction, a survival mechanism to change the situation in favor of women.” – Janet Bajan [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “[Rape] is nothing more or less than a conscious process of intimidation by which all men keep all women in a state of fear.” – Susan Brownmiller [Susan Brownmiller, Against Our Will: Men, Women and Rape, Secker & Warburg, 1975, p. 6]\n\n- “Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat.” – Hillary Clinton, [speech by Hillary Clinton, First Ladies’ Conference on Domestic Violence in San Salvador, El Salvador on Nov. 17, 1998\n\n- “If life is to survive on this planet, there must be a decontamination of the Earth. I think this will be accompanied by an evolutionary process that will result in a drastic reduction of the population of males. People are afraid to say that kind of stuff anymore.” Mary Daly [from a 2001 interview with What Is Enlightenment magazine [referencing] Mary Daly, Quintessence...Realizing the Archaic Future: A Radical Elemental Feminist Manifesto, Beacon Press, 1998, p. ?]\n\n- “MALE:...represents a variant of or deviation from the category of female. The first males were mutants...the male sex represents a degeneration and deformity of the female. – Elizabeth Gould Davis [Elizabeth Gould Davis, The First Sex, 1971, G. P. Putnam’s Sons; reprinted in: Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996]\n\n- “All men are scum and must die.” – Clementine Ford [Twitter, @clementine_ford, Nov. 15, 2016]\n\n- “All patriarchists exalt the home and family as sacred, demanding it remain inviolate from prying eyes. Men want privacy for their violations of women ... All women learn in childhood that women as a sex are men’s prey.” Marilyn French [Marilyn French, The War Against Women, Ballantine Books, 1992, p. 186]\n\n- “The proportion of men must be reduced to and maintained at approximately 10% of the human race.” – Sally Miller Gearhart [Sally Miller Gearhart, “The Future - If There Is One - Is Female,” in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982]\n\n- “Why have any men at all?” – Sally Miller Gearhart [Sally Miller Gearhart, “The Future - If There Is One - Is Female,” in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982, p. ?]\n\n - “I have a great deal of difficulty with the idea of the ideal man. As far as I’m concerned, men are the product of a damaged gene.: –Germaine Greer [Germaine Greer publicly speaking at a Hilton Hotel literary lunch, promoting her book, The Change: Women, Aging and the Menopause, Knopf, 1992, p. ? -- from a news report dated Nov. 14, 1991]\n\n- “Probably the only place where a man can feel really secure is in a maximum security prison, except for the imminent threat of release.” – Germaine Greer [Germaine Greer, in “Security,” The Female Eunuch, Mcgraw-Hill, 1971, p. ?]\n\n- “And if the professional rapist is to be separated from the average dominant heterosexual [male], it may be mainly a quantitative difference.” – Susan Griffin [Susan Griffin, “Rape: The All-American Crime,” Ramparts 10, September 1971, pp. 26-35]\n\n- “if this book leaves the impression that men have conspired to keep women down, that is exactly the impression I mean to convey; for I believe that men could not have succeeded as well as they have without concerted effort” [Ann Jones, Women Who Kill, Ballantine, 1981, p. xvii; quoted in Peter Vronsky, Female Serial Killers: How and Why Women Become Monsters, 2007, Berkeley Books, p. 16]\n\n- “I believe that women have a capacity for understanding and compassion which man structurally does not have, does not have it because he cannot have it. He’s just incapable of it.” – Barbara Jordan [Barbara Jordan, speaking at a women’s political symposium in Sep. 1991; quoted in Lawrence Wright, “Are Men Necessary,” Texas Monthly,  Feb. 1992, p. 84]\n\n- “MAN:...an obsolete life form... an ordinary creature who needs to be watched...a contradictory baby-man...” – original source? [Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996, p. ?]\n\n- “Men’s sexuality is mean and violent, and men so powerful that they can ‘reach WITHIN women to fuck/construct us from the inside out.’ Satan-like, men possess women, making their wicked fantasies and desires women’s own. A woman who has sex with a man, therefore, does so against her will, ‘even if she does not feel forced.” [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- “I feel what they feel: man-hating, that volatile admixture of pity, contempt, disgust, **envy**, alienation, fear, and rage at men. It is hatred not only for the anonymous man who makes sucking noises on the street, not only for the rapist or the judge who acquits him, but for what the Greeks called philo-aphilos, ‘hate in love,’ for the men women share their lives with--husbands, lovers, friends, fathers, brothers, sons, coworkers.” [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- “Man-hating marks a turning point in the movement. We have been defensive long enough. People often ask me how women can be man-haters. And I wonder, hoe can we be anything else.” – Pat Mainardi [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “The only way to win liberation is to make men miserable so they will have no peace until women are free. Married women invented man-hating.” – Pat Mainardi [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “We have a moral cause for hating men for they have taken away all our power.” – Barbara Mirnoff [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “I claim that rape exists any time sexual intercourse occurs when it has not been initiated by the woman, out of her own genuine affection and desire.” – Robin Morgan [Robin Morgan, Going too Far: The Personal Chronicle of a Feminist - Theory and Practice: Pornography and Rape, Random House, 1974, p. ?]\n\n- “...rape is the perfected act of male sexuality in a patriarchal culture -- it is the ultimate metaphor for domination, violence, subjugation, and possession.” – Robin Morgan [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Women’s Liberation Movement, Vintage, 1970, p. ?]\n\n- “I haven’t the faintest notion what possible revolutionary role white hetero-sexual men could fulfill, since they are the very embodiment of reactionary-vested-interest-power. But then, I have great difficulty examining what men in general could possibly do about all this. In addition to doing the shitwork that women have been doing for generations, possibly not exist? No, I really don’t mean that. Yes, I really do.” [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Women’s Liberation Movement, Vintage, 1970, p. ?]\n\n- “Man is but one of a million humble fertilizers. Nature intended woman to reign supreme.” – Marie Petti [William M. Sweets, “Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head,” syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- “Modern man, in his pose of superiority, is but a mere contemptible imposter, who must be subdued. Woman’s superiority has been scientifically established. At the beginning of organic life, woman, created man, and ruled him. He was a parasite, and a slave. At best, man is but an afterthought of nature.” – Marie Petti [William M. Sweets, “Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head,” syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- “I honestly have been reassessing the fact that I am giving care to these little future rapists, and what that says about me and my separatism. I know it is kinda going against my principles to support and care for these little f****rs.” [quoted in John the Other, “Feminists: demented, stunned or cultists: Why Do MRAs Keep Attacking Feminism?” A Voice for Men, Jan. 2, 2012]\n\n- “The male is a biological accident: the ‘y’ (male) gene is an incomplete ‘x’ (female) gene, that is, has an incomplete set of chromosomes. In other words, the male is an incomplete female, a walking abortion, aborted at the gene stage. To be male is to be deficient, emotionally limited; maleness is a deficiency disease and males are emotional cripples.” – Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- “[Males should] ...go off to the nearest friendly suicide center where they will be quickly and painlessly gassed to death.” – Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- “We are, as a sex, infinitely superior to men.” –  Elizabeth Cady Stanton (Nov. 12, 1815 – Oct. 26, 1902;  feminist; suffrage leader) (USA)\n\n- “Patriarchy requires violence or the subliminal threat of violence in order to maintain itself... The most dangerous situation for a woman is not an unknown man in the street, or even the enemy in wartime, but a husband or lover in the isolation of their home.” – Gloria Steinem [Gloria Steinem, Revolution from Within: A Book of Self-Esteem, 1992, Little, Brown & Co., pp. 259-61]\n\n- “Only men kill in anger.” [from: Gerald Caplan, “Battered Wives,” National Review, Feb. 25, 1991]\n\n- “Only when manhood is dead--and it will perish when ravaged femininity no longer sustains it--only then will we know what it is to be free.” – Andrea Dworkin [Andrea Dworkin, Our Blood: Prophecies And Discourses On Sexual Politics - The Root Cause, Harper & Row, 1976]\n\n- “Men love death. In everything they make, they hollow out a central place for death, let its rancid smell contaminate every dimension of whatever still survives. Men especially love murder. In art they celebrate it, and in life they commit it. They embrace murder as if life without it would be devoid of passion, meaning, and action, as if murder were solace, stilling their sobs as they mourn the emptiness and alienation of their lives.” –\nAndrea Dworkin [Andrea Dworkin, “Why So-Called Radical Men Love and Need Pornography,” in: Laura Lederer, ed., Take Back the Night, Morrow, 1980, p. 148]\n\n- “...[W]omen and men are distinct species or races ... men are biologically inferior to women; male violence is a biological inevitability; to eliminate it, one must eliminate the species/race itself ... in eliminating the biologically inferior species/race Man, the new Ubermensch Womon (prophetically foreshadowed by the lesbian separatist herself) will have the earthly dominion that is her true biological destiny. We are left to infer that the society of her creation will be good because she is good, biologically good. Andrea Dworkin, Letters From a War Zone - Take Back The Day - Biological Superiority: The World’s Most Dangerous and Deadly Idea, 1977, Dutton Publishing, 1989, p. 146]\n\nCredit to unknown misandry for compiling these.  \n\nEdit: I wanted to add one of my replies from the comments: \n\nThese \"certain people\" include the founder of the feminist movement in the United States, the founder of the first gender studies department, the most well known figures in the second wave, and the quasi-intellectuals who developed feminist theory.\n\nFeminism is rooted in the hatred of men. That's why they've only ever looked at ways in which females are supposedly disadvantaged by the system (ergo, nothing to do with equality). \n\nThat's also why it is absurd to claim that \"feminism helps men too.\" Why would you want to help the people you consider your oppressors and class enemies?",
    "title": "Feminism is about equality, it's NOT a hate movement",
    "subreddit": "MensRights",
    "timestamp": 1486569871,
    "score": 136,
    "keyword": "mixed race judge"
  },
  {
    "text": "Hooked on bell hooks, part 4: \"Sisterhood is still powerful\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n**\"Sisterhood is still powerful\"**\n\nWhen the slogan “Sisterhood is powerful” was first used, it was awesome. I began my full-fledged participation in feminist movement my sophomore year in college. Attending an all women’s college for a year before I transferred to Stanford University, I knew from firsthand experience the difference in female self-esteem and self-assertion in same-sex classrooms versus those where males were present. At Stanford males ruled the day in every classroom. Females spoke less, took less initiative, and often when they spoke you could hardly hear what they were saying. Their voices lacked strength and confidence. And to make matters worse we were told time and time again by male professors that we were not as intelligent as the males, that we could not be “great” thinkers, writers, and so on. These attitudes shocked me since I had come from an all-female environment where our intellectual worth and value was constantly affirmed by the standard of academic excellence our mostly female professors set for us and themselves.\n\n\n\nIndeed, I was indebted to my favorite white female English professor who thought I was not getting the academic guidance I needed at our women’s college because they did not have an intensified writing program. She encouraged me to attend Stanford. She believed that I would someday be an important thinker and writer.\n\n\n\nAt Stanford my ability was constantly questioned. I began to doubt myself. Then feminist movement rocked the campus. Female students and professors demanded an end to discrimination based on gender inside and outside the classroom. Wow, it was an intense and awesome time. There I took my first women’s studies class with the writer Tillie Olsen, who compelled her students to think first and foremost about the fate of women from working-class backgrounds. There the scholar and one-day biographer of Anne Sexton, Diane Middlebrook, passed out one of my poems in our class on contemporary poetry with no name on it and asked us to identify whether the writer was male or female, an experiment that made us think critically about judging the value of writing on the basis of gender biases. There I began to write my first book at the age of 19, Ain’t I a Woman: Black Women and Feminism. None of these incredible transformations would have happened without feminist movement creating a foundation for solidarity between women.\n\n\n\nThat foundation rested on our critique of what we then called “the enemy within,” referring to our internalized sexism. We all knew firsthand that we had been socialized as females by patriarchal thinking to see ourselves as inferior to men, to see ourselves as always and only in competition with one another for patriarchal approval, to look upon each other with jealousy, fear, and hatred. Sexist thinking made us judge each other without compassion and punish one another harshly. Feminist thinking helped us unlearn female self-hatred. It enabled us to break free of the hold patriarchal thinking had on our consciousness.\n\n\n\nMale bonding was an accepted and affirmed aspect of patriarchal culture. It was simply assumed that men in groups would stick together, support one another, be team players, place the good of the group over individual gain and recognition. Female bonding was not possible within patriarchy; it was an act of treason. Feminist movement created the context for female bonding. We did not bond against men, we bonded to protect our interests as women. When we challenged professors who taught no books by women, it was not because we did not like those professors (we often did); rightly, we wanted an end to gender biases in the classroom and in the curriculum.\n\n\n\nThe feminist transformations that were taking place in our coed college in the early ‘70s were taking place as well in the world of home and work. First and foremost feminist movement urged females to no longer see ourselves and our bodies as the property of men. To demand control of our sexuality, effective birth control and reproductive rights, an end to rape and sexual harassment, we needed to stand in solidarity. In order for women to change job discrimination we needed to lobby as a group to change public policy. Challenging and changing female sexist thinking was the first step towards creating the powerful sisterhood that would ultimately rock our nation.\n\n\n\nFollowing in the wake of civil rights revolution feminist movement in the ‘70s and ‘80s changed the face of our nation. The feminist activists who made these changes possible cared for the well-being of all females. We understood that political solidarity between females expressed in sisterhood goes beyond positive recognition of the experiences of women and even shared sympathy for common suffering. Feminist sisterhood is rooted in shared commitment to struggle against patriarchal injustice, no matter the form that injustice takes. Political solidarity between women always undermines sexism and sets the stage for the overthrow of patriarchy. Significantly, sisterhood could never have been possible across the boundaries of race and class if individual women had not been willing to divest of their power to dominate and exploit subordinated groups of women. As long as women are using class or race power to dominate other women, feminist sisterhood cannot be fully realized.\n\n\n\nAs more women begin to opportunistically lay claim to feminism in the ‘80s without undergoing the feminist consciousness-raising that would have enabled them to divest of their sexism, the patriarchal assumption that the powerful should rule over the weak informed their relations to other women. As women, particularly previously disenfranchised privileged white women, began to acquire class power without divesting of their internalized sexism, divisions between women intensified. When women of color critiqued the racism within the society as a whole and called attention to the ways that racism had shaped and informed feminist theory and practice, many white women simply turned their backs on the vision of sisterhood, closing their minds and their hearts. And that was equally true when it came to the issue of classism among women.I remember when feminist women, mostly white women with class privilege, debated the issue of whether or not to hire domestic help, trying to come up with a way to not participate in the subordination and dehumanization of less-privileged women. Some of those women successfully created positive bonding between themselves and the women they hired so that there could be mutual advancement in a larger context of inequality. Rather than abandoning the vision of sisterhood, because they could not attain some utopian state, they created a real sisterhood, one that took into account the needs of everyone involved. This was the hard work of feminist solidarity between women. Sadly, as opportunism within feminism intensified, as feminist gains became commonplace and were therefore taken for granted, many women did not want to work hard to create and sustain solidarity.\n\n\n\nA large body of women simply abandoned the notion of sisterhood. Individual women who had once critiqued and challenged patriarchy re-aligned themselves with sexist men. Radical women who felt betrayed by the fierce negative competition between women often simply retreated. And at this point feminist movement, which was aimed at positively transforming the lives of all females, became more stratified. The vision of sisterhood that had been the rallying cry of the movement seemed to many women to no longer matter. Political solidarity between women which had been the force putting in place positive change has been and is now consistently undermined and threatened. As a consequence we are as in need of a renewed commitment to political solidarity between women as we were when contemporary feminist movement first began.\n\n\n\nWhen contemporary feminist movement first began we had a vision of sisterhood with no concrete understanding of the actual work we would need to do to make political solidarity a reality. Through experience and hard work, and, yes, by learning from our failures and mistakes, we now have in place a body of theory and shared practice that can teach new converts to feminist politics what must be done to create, sustain, and protect our solidarity. Since masses of young females know little about feminism and many falsely assume that sexism is no longer the problem, feminist education for critical consciousness must be continuous. Older feminist thinkers cannot assume that young females will just acquire knowledge of feminism along the way to adulthood. They require guidance. Overall women in our society are forgetting the value and power of sisterhood. Renewed feminist movement must once again raise the banner high to proclaim anew “Sisterhood is powerful.”\n\n\n\nRadical groups of women continue our commitment to building sisterhood, to making feminist political solidarity between women an ongoing reality. We continue the work of bonding across race and class. We continue to put in place the anti-sexist thinking and practice which affirms the reality that females can achieve self-actualization and success without dominating one another. And we have the good fortune to know everyday of our lives that sisterhood is concretely possible, that sisterhood is still powerful.",
    "title": "Hooked on bell hooks, part 4: \"Sisterhood is still powerful\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1510565465,
    "score": 18,
    "keyword": "mixed race judge"
  },
  {
    "text": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n\"**Consciousness-raising: A Constant Change of Heart**\n\nFeminists are made, not born. One does not become an advocate of feminist politics simply by having the privilege of having been born female. Like all political positions one becomes a believer in feminist politics through choice and action. When women first organized in groups to talk together about the issue of sexism and male domination, they were clear that females were as socialized to believe sexist thinking and values as males, the difference being simply that males benefited from sexism more than females and were as a consequence less likely to want to surrender patriarchal privilege. Before women could change patriarchy we had to change ourselves; we had to raise our consciousness.\n\nRevolutionary feminist consciousness-raising emphasized the importance of learning about patriarchy as a system of domination, how it became institutionalized and how it is perpetuated and maintained. Understanding the way male domination and sexism was expressed in everyday life created awareness in women of the ways we were victimized, exploited, and, in worse case scenarios, oppressed. Early on in contemporary feminist movement, consciousness-raising groups often became settings where women simply unleashed pent-up hostility and rage about being victimized, with little or no focus on strategies of intervention and transformation. On a basic level many hurt and exploited women used the consciousness-raising group therapeutically. It was the site where they uncovered and openly revealed the depths of their intimate wounds. This confessional aspect served as a healing ritual. Through consciousness-raising women gained the strength to challenge patriarchal forces at work and at home.\n\nImportantly though, the foundation of this work began with women examining sexist thinking and creating strategies where we would change our attitudes and belief via a conversion to feminist thinking and a commitment to feminist politics. Fundamentally, the consciousness-raising (CR) group was a site for conversion. To build a mass-based feminist movement women needed to organize. The consciousness-raising session, which usually took place in someone’s home (rather than public space that had to be rented or donated), was the meeting place. It was the place where seasoned feminist thinkers and activists could recruit new converts. Importantly, communication and dialogue was a central agenda at the consciousness-raising sessions. In many groups a policy was in place which honored everyone’s voice. Women took turns speaking to make sure everyone would be heard. This attempt to create a non-hierarchal model for discussion positively gave every woman a chance to speak but often did not create a context for engaged dialogue. However, in most instances discussion and debate occurred, usually after everyone had spoken at least once.\n\nArgumentative discussion was common in CR groups as it was the way we sought to clarify our collective understanding of the nature of male domination. Only through discussion and disagreement could we begin to find a realistic standpoint on gender exploitation and oppression.\n\nAs feminist thinking, which emerged first in the context of small groups where individuals often knew each other (they may have worked together and/ or were friends), began to be theorized in printed matter so as to reach a wider audience, groups dismantled. The creation of women’s studies as an academic discipline provided another setting where women could be informed about feminist thinking and feminist theory. Many of the women who spearheaded the introduction of women’s studies classes into colleges and universities had been radical activists in civil rights struggles, gay rights, and early feminist movement. Many of them did not have doctorates, which meant that they entered academic institutions receiving lower pay and working longer hours than their colleagues in other disciplines. By the time younger graduate students joined the effort to legitimize feminist scholarship in the academy we knew that it was important to gain higher degrees. Most of us saw our commitment to women’s studies as political action; we were prepared to sacrifice in order to create an academic base for feminist movement.\n\nBy the late ‘70s women’s studies was on its way to becoming an accepted academic discipline. This triumph overshadowed the fact that many of the women who had paved the way for the institutionalization of women’s studies were fired because they had master’s degrees and not doctorates. While some of us returned to graduate school to get PhDs, some of the best and brightest among us did not because they were utterly disillusioned with the university and burnt out from overwork as well as disappointed and enraged that the radical politics undergirding women’s studies was being replaced by liberal reformism. Before too long the women’s studies classroom had replaced the free-for-all consciousness-raising group.\n\nWhereas women from various backgrounds, those who worked solely as housewives or in service jobs, and big-time professional women, could be found in diverse consciousness-raising groups, the academy was and remains a site of class privilege. Privileged white middle-class women who were a numeric majority though not necessarily the radical leaders of contemporary feminist movement often gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential.\n\nSuddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing. These careerbased changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate.\n\nWithout the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make CONSCIOUSNESS-RAISING 11ten gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential. Suddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing.\n\nThese career-based changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate. Without the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make one a “feminist.” Without confronting internalized sexism women who picked up the feminist banner often betrayed the cause in their interactions with other women.\n\nBy the early ‘80s the evocation of a politicized sisterhood, so crucial at the onset of the feminist movement, lost meaning as the terrain of radical feminist politics was overshadowed by a lifestyle based feminism which suggested any woman could be a feminist no matter what her political beliefs. Needless to say such thinking has undermined feminist theory and practice, feminist politics. When feminist movement renews itself, reinforcing again and again the strategies that will enable a mass movement to end sexism and sexist exploitation and oppression for everyone, consciousness-raising will once again attain its original importance. Effectively imitating the model of AA meetings, feminist consciousness-raising groups will take place in communities, offering the message of feminist thinking to everyone irrespective of class, race, or gender. While specific groups based on shared identities might emerge, at the end of every month individuals would be in mixed groups.\n\nFeminist consciousness-raising for males is as essential to revolutionary movement as female groups. Had there been an emphasis on groups for males that taught boys and men about what sexism is and how it can be transformed, it would have been impossible for mass media to portray the movement as anti-male. It would also have preempted the formation of an anti-feminist men’s movement. Often men’s groups were formed in the wake of contemporary feminism that in no way addressed the issues of sexism and male domination. Like the lifestyle-based feminism aimed at women these groups often became therapeutic settings for men to confront their wounds without a critique of patriarchy or a platform of resistance to male domination. Future feminist movement will not make this mistake. Males of all ages need settings where their resistance to sexism is affirmed and valued. Without males as allies in struggle feminist movement will not progress. As it is we have to do so much work to correct the assumption deeply embedded in the cultural psyche that feminism is anti-male. Feminism is anti-sexism. A male who has divested of male privilege, who has embraced feminist politics, is a worthy comrade in struggle, in no way a threat to feminism, whereas a female who remains wedded to sexist thinking and behavior infiltrating feminist movement is a dangerous threat. Significantly, the most powerful intervention made by consciousness-raising groups was the demand that all females confront their internalized sexism, their allegiance to patriarchal thinking and action, and their commitment to feminist conversion. That intervention is still needed. It remains the necessary step for anyone choosing feminist politics. The enemy within must be transformed before we can confront the enemy outside. The threat, the enemy, is sexist thought and behavior. **As long as females take up the banner of feminist politics without addressing and transforming their own sexism, ultimately the movement will be undermined**.\"",
    "title": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1507273110,
    "score": 8,
    "keyword": "mixed race judge"
  },
  {
    "text": "Ontological Commitments, Sex and Gender, by Mari Mikkola Excerpt from \"Feminist Metaphysics - Explorations in the Ontology of Sex, Gender and the Self\", edited by Charlotte Witt.\n\n***\n\n\n**Abstract**\n\n\nThis chapter develops an alternative for (what feminists call) “the sex/gender distinction”. I do so in order to avoid certain problematic implications the distinction underpins. First, the sex/gender distinction paradigmatically holds that some social conditions determine one’s gender (whether one is a woman or a man), and that some biological conditions determine one’s sex (whether one is female or male). Further, sex and gender come apart. Taking gender as socially constructed, this implies that women exist mind-dependently, or due to productive human social activities; thus, it should be possible to do away with them just by altering the social conditions on which gender depends. In addition, some feminists take gender to depend on oppressive social conditions. Changing our social environments, then, would not only unwittingly eradicate women; doing away with women should be feminism’s political goal. I argue that both implications are unacceptable. In response, I argue for a view that is more congenial to ordinary thinking and that doesn’t have the goal of eradicating women.\n\n**Introduction**\n\nThis chapter develops a model, which I will call “the trait/norm covariance model”, as an alternative for understanding the phenomena feminists usually discuss under the rubric of the sex/gender distinction. This well-known distinction gives rise to certain problems that motivate the formulation of my alternative model. Specifically, I have in mind here problems arising from the conventionalist and abolitionist implications that the distinction underpins. First, consider the conventionalist implications: paradigmatically, some social conditions must be met in order for one to count as a woman or a man because gender is (as the slogan goes) socially constructed. One need not satisfy any biological or anatomical conditions; they are relevant only for counting as female or male. On this understanding “woman” and “man” are used as gender terms, “female” and “male” as sex terms.  The implication is that women and men exist mind-dependently or due to productive human social activities: that there are women and men ontologically depends on some social institutions and agents, their beliefs, practices and/or conventions in that women and men could not exist unless the relevant institutions, practices and conventions (with conscious agents upholding them) existed. Women and men are akin to wives, husbands and US senators that also depend on us for their existence.  This being so, it should be possible to do away with women and men while leaving the individuals we call “women” and “men” otherwise intact–we simply alter those social conditions on which gender depends so that individuals no longer count as women and men. Consider a parallel to US senators: their existence depends on certain sociopolitical conventions so that were a political revolution to alter those conventions by abolishing the US Senate, US senators would literally vanish overnight. Those individuals who previously counted as US senators would no longer do so despite being otherwise physically intact (presuming the revolution were a bloodless one). Just as one need not execute US senators in order to eradicate them, the thought is, eradicating women and men does not require physically altering those individuals we think of as women and men. Second, consider the abolitionist implication: in addition to holding a conventionalist view, some feminists take gender to depend ontologically on oppressive social conditions. As a result, changing our social environments would not only unwittingly eradicate women and men: doing away with gender should be feminism’s political goal.  \n\n\nAs I see it, both implications are problematic and ones that many ordinary social agents are unwilling to accept. Ordinarily, women are thought to be human females, men human males. As a result, their existence is not thought to depend on productive human social conventions, practices and institutions so that we could abolish women and men leaving intact females and males simply by altering our social landscapes. Conventionalist implications, then, are unintuitive. Further, ordinary social agents often find the abolitionist implication that “after the revolution” women and men will no longer exist objectionable. Many of my students, along with other feminist philosophers, do not see being a woman or a man as problematic per se. Rather, the problem is how we are viewed and treated as women and men. For ordinary thinking, then, the idea that feminists should aim to do away with women and men harbors undesirable ontological commitments.\n\nThese problems are generated by a clash between the paradigmatic feminist and everyday conceptions of sex and gender. Ordinary thinking does not separate sex and gender in the way many feminists do, thus neither seeing the existence of women and men as mind-dependent nor holding that gender is something to be eradicated. We can avoid this clash in one of two ways: either feminists work hard to modify everyday conceptions of sex and gender so that they are in line with the conventionalist and abolitionist views, or feminists modify their conceptions of sex and gender so that they are closer to everyday thinking. Here I will endorse the latter option and propose a way to conceptualize the phenomena usually discussed under the sex/gender distinction to avoid the unintuitive and undesirable ontological commitments. I will do so by developing what I will call “the trait/norm covariance model” to replace the usual sex/gender distinction. My alternative model will involve redrawing the boundaries of the sets of gender and sex traits and dividing these traits into new sets: descriptive traits (traits of which there is “a fact of the matter”) and evaluative norms (norms that express judgments about descriptive traits). For instance, the paradigmatic gender trait of wearing make-up and the paradigmatic sex trait of having ovaries will both count as descriptive traits (one either has ovaries/regularly wears make-up or not). But, my model also acknowledges the influence of social norms: certain evaluations (like being judged to act, be or appear “feminine”) can be seen to covary with particular descriptive traits, which accounts for why some traits are supposedly appropriate for women and others for men.4\n\n \n\n\n4\nBy way of illustration, I will consider Sally Haslanger’s fascinating and innovative recent account of gender (“Gender and Race”; “Future Genders”; “Social Construction”), which has the conventionalist and abolitionist implications. Next, I will examine what precisely is problematic about these implications in order to motivate my alternative model. I will then outline my trait/norm covariance model, ending with a discussion of how it avoids the problematic ontological commitments considered.\n\n**Haslanger on Gender: An Example**\n\nHaslanger’s account of gender has conventionalist and abolitionist implications: it takes the existence of women and men to be mind-dependent in the sense of depending on human social practices and conventions, and it takes these conventions and practices to be oppressive—for her, since gender is a product of oppressive social forces feminists should aim to eradicate it. These implications are underpinned by a distinction between sex and gender that many feminists have historically endorsed. Paradigmatically: “sex” denotes human females and males depending on some biological features (like chromosomes, sex organs, hormones or other physical features to do with reproduction) whereas “gender” denotes women and men depending on some social factors (like social role, position, behaviour or identity). As is well known, the motivation for drawing the sex/gender distinction was to counter biological determinism that took some (supposedly) biological facts to explain behavioural and psychological differences between women and men. Instead, feminists argued that these differences have social causes. They distinguished biological and social/psychological differences and began using the term “gender” to denote the latter. For instance, Gayle Rubin (who was one of the first feminists to articulate this distinction) used the phrase “sex/gender system” in order to describe “a set of arrangements by which the biological raw material of human sex and procreation is shaped by human, social intervention” (165). For Rubin, although sex differences are fixed, gender differences are the oppressive results of social interventions that dictate how women and men should behave: women are oppressed as women and “by having to be women” (204). For her, gender is the social interpretation of sex and an oppressive one at that. However, women’s oppression is mutable by political and social reform that abolishes gender. As Rubin saw it, feminism should aim to create a “genderless (though not sexless) society, in which one’s sexual anatomy is irrelevant to who one is, what one does, and with whom one makes love” (204).\n\nFor Haslanger, gender is constitutively constructed: in defining it we must make reference to social factors (“Ontology and Social Construction” 98), and, in particular, we must make reference to unequal social positions (“Gender and Race” 37–43). In so doing, Haslanger aims to debunk the ordinary view that gender classification is a matter of anatomy. Commonly, being female is thought to be sufficient for womanhood; Haslanger, on the other hand, takes the conditions for satisfying “woman” to be social rather than biological. Her project involves showing that although the use of the term “woman” is thought to track a group of “individuals defined by a set of physical ... conditions [it] is better understood as capturing a group that occupies a certain ... social position” (“Social Construction” 318). And the social positions that our gendered classification scheme tracks and that make gender ascriptions apt crucially involve reference to subordination and privilege. For Haslanger, societies in general tend to “privilege individuals with male bodies” (“Gender and Race” 38) so that the social positions they subsequently occupy are better than the social positions of those with female bodies. And this generates sexist injustices. For her:\n\n>S is a woman if [by definition] S is systematically subordinated along some dimension (economic, political, legal, social, etc.), and S is “marked” as a target for this treatment by observed or imagined bodily features presumed to be evidence of a female’s biological role in reproduction.\n\n>S is a man if [by definition] S is systematically privileged along some dimension (economic, political, legal, social, etc.), and S is “marked” as a target for this treatment by observed or imagined bodily features presumed to be evidence of a male’s biological role in reproduction (“Future Genders” 6–7).\n\nThese are constitutive of being a woman or a man: what makes calling S a woman apt is not that S is female, but that S is oppressed on sex-marked grounds; what makes calling S a man apt is not that S is male, but that S is privileged on sex-marked grounds.\n\nHaslanger acknowledges that debunking projects like hers sometimes require a “radical change in our thinking” (“Social Construction” 319). After all, her proposal is counterintuitive: privileged females like, arguably, the Queen of England would not count as women on this view. But Haslanger’s project does not aim to capture what ordinary language users intuitively have in mind and her aim is not to illuminate our commonsense understandings of gender terms. Haslanger’s analysis is, in her terms, ameliorative: it aims to elucidate which gender concepts best help feminists achieve their legitimate purposes thereby elucidating those concepts feminists should be using (“Gender and Race” 33).  That is, endorsing her classification scheme is a pragmatic political choice. And (Haslanger holds) feminists should choose her account of gender since it will be helpful in feminist fights against sexist injustices enabling feminists to identify and explain persistent inequalities between women and men in terms of their social positions. Insofar as Haslanger takes being a woman to be a social matter crucially tied to oppression, she holds that “it is part of the project of feminism to bring about a day when there are no more women (though, of course, we should not aim to do away with females!)” (“Gender and Race” 46). Since what it is to be a woman is by definition tied to sexist oppression, gender justice would eradicate women by abolishing those social structures that are responsible for sex-marked oppression. Women and men could not exist, unless sexist oppression existed; that women and men exist is mind-dependent being the result of oppressive human social activities. And feminism’s goal should be to dismantle those social structures responsible for gender and, by extension, women and men.\n\nProblems with the Conventionalist and Abolitionist Implications\n\nEarlier I claimed that ordinary thinking finds the conventionalist and abolitionist implications of accounts like Haslanger’s problematic. I also claimed that these problems are underpinned by a clash between different conceptions of sex and gender. Let’s examine the worries in more detail.\n\nThe Conventionalist View Is Unintuitive\n\nFor Haslanger (among others) gender depends on something social and not on anything biological. This prima facie makes being a woman ontologically on a par with being a US senator, a wife or a landlord. And, it seems, just as one can cease to be a wife by changing one’s social relations (by getting a divorce), one should be able to cease to be a woman by changing those social relations constitutive of womanhood. But a closer examination suggests that being a woman is not ontologically on a par with (say) being a wife. To tease this out, consider the following claims:\n\n(1)\tFor a week last summer, James was a woman.\n\n(2)\tFor a week last summer, James was a US senator.\n\nThese statements take “woman” and “US senator” as social notions. The first takes womanhood to be about easily perceptible gender markers like clothing and appearance (James lived “as a woman” for a week last summer). The second takes James to have been treated in ways that enabled him to count as a US senator for a week (for instance, James was elected to the US Senate, but due to a political scandal lost his position very quickly). Now, consider:\n\n(3)\tAfter seeing John’s body, I realised that John is a woman.\n\n(4)\tAfter seeing John’s body, I realised that John is a US senator.\n\nThese claims are not about social factors. We can understand claim (3) and it makes sense to us, although we are clearly using “woman” as a biological term. However, when we substitute “woman” for “US senator” in (4), the statement no longer makes sense to us. After all, just by looking at one’s body, it’s not possible to know that one is a US senator. That is, when used as a social term, “woman” is on a par with “US senator”. But we can also use “woman” as a biological term, which makes “woman” and “US senator” come apart. The upshot of this is that “woman” is not a purely social term ; for ordinary thinking, then, being a woman is not on a par ontologically with what it is to be a member of some other social kind. And this suggests that it is not obviously true that women and men’s existence is minddependent in that one can cease to be a woman (or a man) just by altering one’s social environment. Because ordinary thinking does not see being a woman as a purely social matter, conventionalist implications (like the implication that we can eradicate women and men via change in our social environments) are hard to accept. The paradigmatic feminist distinction between sex and gender clashes with everyday thinking. Due to this, ordinary thinking doubts the possibility of eradicating gender via social change, because it ties sex and gender together.\n\nA defender of the conventionalist view might hold that claim (3) doesn’t really make sense either, but we are fooled into believing that it does precisely because ordinary thinking ties sex and gender together when it shouldn’t. So, if we thought about womanhood in the right way, we would see that (3) is also senseless. That would leave claim (1) where “woman” is a social notion making it akin to “US senator”. My worries about unintuitive ontological commitments are dispelled prima facie making it possible for one to cease to be a woman just by altering one’s social environment. But this raises some further questions that the defender of the conventionalist view must answer: Precisely what kind of social change would abolish women and men? Which beliefs, social conventions, linguistic practices and relations would have to be altered for one to no longer count as a woman or a man? And which social institutions, relations and structures would have to be dismantled so that women and men were to cease to exist wholesale? These questions cannot be answered in any intuitively obvious introspective manner. In fact, answering them is the stuff of feminist philosophy and a huge point of contention. Admittedly, this contention may be generated by gender being such an incredibly complex phenomenon that discerning the kind of social change that would eradicate it is extremely difficult; we may simply be ignorant of the kind of change needed, but it is possible to eradicate gender via social change. This may be so. But it may also be that feminists cannot agree on what social changes would do away with women and men because doing so just by altering one’s social environment is not possible. Bluntly put, perhaps it is just plain wrong to think that women and men’s existence ontologically depends on some social factors. I am not concluding that it is; I am merely making a strategic point. The issue of, on which social conditions the existence of women and men depends, is so intractable as to be unhelpful. If gender really is such a complex issue that it is hugely difficult (if not impossible) to articulate and agree on what sort of social change would eradicate it, the most useful move would seem to be to give up the quest. Pragmatically, feminists should not try to uncover which social factors are responsible for the existence of women and men, but, instead, should settle for the much less contentious view that human actions significantly shape the way we are as women and men. No feminist (to the best of my knowledge) denies this claim. The concerns I have raised here are not decisive and do not rule out conventionalism about gender altogether. But, as I see it, the less contentious view I have floated here is the one that feminists ought to endorse precisely because of its less contentious commitments. \n\n**The Abolitionist Implication Is Undesirable**\n\nOn views like Haslanger’s, gender is also a product of oppressive social conditions and, thus, something feminists should seek to abolish. But this abolitionist view may not be conducive to feminist interests since for ordinary thinking it harbours undesirable ontological commitments. To tease this out, contrast such abolitionist strategies with a different (what I will call) “re-evaluative” strategy. They both have the same starting point: feminism is about ending oppression that women as women face. But their ways of achieving this goal differ, which alters the strategies’ outcomes. Abolitionist accounts take womanhood to be by definition tied to oppression so that it is not possible to be a woman and not be (in some sense) oppressed. Reevaluative accounts do not take being a woman to be per se oppressive. Instead, they recognise that our social circumstances create environments where women are viewed and treated in ways that disadvantage them, perhaps by associating some traits with women and using this association to justify disadvantageous treatment. Nonetheless, by altering how women are viewed and treated it is possible to be a woman and yet not be oppressed. So, on the former view, gender justice would dismantle unjust social hierarchies thus doing away with women and men; on the latter, it would dismantle such hierarchies while retaining women and men (roughly) in a re-evaluated sense.\n\nThe strategy to follow comes down to a pragmatic political choice. But if ordinary social agents think that eradicating gender is undesirable, it may be strategically wrongheaded to endorse an account of gender that has abolitionist implications. Some anecdotal evidence supports this: my feminism students tell me time and again that they think the abolitionist strategy is aiming to eradicate something that need not be eradicated—the “feminist revolution” need not do away with gender and doing so would result in (at least some) good being unnecessarily lost. Many insist that the ways in which people are treated as woman and men is the problem feminists should focus on—being a woman or a man is not primarily the problem. And many claim to find their gender a source of positive value. After all, it is certainly true that, although one may be discriminated against due to one’s gender, it can still be something one values positively; in a similar sense, one can take pride in one’s racial group membership despite being socially disadvantaged by it. The everyday conception of gender clashes with feminist conceptions like Haslanger’s. As a result, ordinary thinking doubts the viability of eradicating gender because it sees gender as being at least partly a positive social identity rather than being a wholly negative one.\n\nProjects like Haslanger’s do, of course, start by aiming to alter the ways in which we are viewed and treated as women and men. So, in a sense, the abolitionist and re-evaluative routes go hand-in-hand to begin with. But the abolitionist strategy runs into difficulties if many social agents are unwilling to follow it through. Haslanger is asking for a significant shift in people’s self-conceptions and acknowledges that she is asking social agents to understand themselves in ways that are not ordinarily part of their gendered self-understandings (“Gender and Race” 48). In so doing, she is “call[ing] upon us to reject what seemed to be positive social identities” and to refuse to be gendered women and men (“Gender and Race” 48). I agree with Haslanger that a change in our self-understandings is called for; but I wonder if the change that she is calling for is the right kind of change given that ordinary thinking does not see the viability of eradicating gender. Again, my point is strategic: accounts that have abolitionist implications are likely to be extremely demanding. It will take a lot of convincing to make ordinary social agents view their gender as not being even in part a positive social identity and to make them refuse to be gendered women and men, if social agents do not believe to begin with that this is necessary. And, one might wonder, whether scarce feminist resources should be directed at something other than trying to convince social agents to revise their self-understandings in this manner.\n\nFortunately my students always do express a desire to see an end to gendered oppression. And clearly this is what Haslanger also wants, which may suggest that really the parties to the debate are just talking past each other. Everyone wants the same thing: gender justice. Haslanger’s rhetoric just differs from how we ordinarily talk about women and men. Usually, acknowledging this does not dispel my students’ worries; they still find it puzzling that Haslanger doesn’t use gender terms as people ordinarily do and wonder why she is confusing matters with her conception of gender. Of course, Haslanger’s rhetoric has a specific, valuable purpose: to motivate a certain kind of social and political response that undermines sexist oppression. But, given the kinds of worries I have mentioned here, strategically I think that this kind of response can be better motivated by understanding the phenomena feminists discuss under the rubric of sex and gender in a way that does not imply women and men no longer exist “after the revolution”. The worry is that accounts with abolitionist implications probably would not motivate positive social change, if this change requires that social agents must give up something they do not want to give up.\n\n**The Trait/Norm Covariance Model**\n\nThis section develops my trait/norm covariance model as an alternative to the sex/gender distinction. To begin with, it is important to note that, contrary to traditional feminist views, I do not take the term “woman” to be a purely social gender term. Ordinary speakers have, to use Ron Mallon’s terminology, indicative features in mind when they call someone a “woman”:\n\n>there is a distinction between those properties that are indicative of category membership (such as easily perceptible racial [or gender] markers), and those that are central. A property is indicative of category membership if having the property increases the likelihood that one is a member of a category. In the United States wearing a dress is indicative of being a woman ... [But w]earing a dress is neither necessary nor sufficient for being a woman.\n\n(652–3)\n\nIndicative features of womanhood include one’s appearance (clothing, hairstyles, make-up); behavioural patterns; social roles; and anatomical and bodily features (body type, shape, size, amount of body hair and how one “carries” one’s body). These features are conceivably involved in everyday gender ascriptions. Paradigmatically, feminists hold that the indicative features mentioned are not exclusively gender traits in that they include features which are taken to be paradigmatic sex traits (to do with being female or male). But, ordinary language users often deploy “woman” on the basis of anatomical sex features such as body type; “woman” is not a purely gender term for them, but (bluntly put) a mixture of sex and gender. So, ordinarily “woman” denotes individuals who are taken to possess features indicative of womanhood. This does not (and certainly should not) limit the application of “woman” to women-born-female; the term also applies to trans women, individuals “assigned male at birth whose gender presentation may be construed as ‘unambiguously’ female” (Bettcher 46), who call themselves “women”.\n\nMy contention is that feminists should use the term “woman” as ordinarily as possible. And the trait/norm covariance model that I will outline next will be sensitive to these reflections about ordinary language use. The model I am proposing deals roughly with the same phenomena that the sex/gender distinction does. It just understands that phenomena in a different way that is, I submit, more fruitful in being more congenial to everyday thinking. On my view, we redraw the boundaries of the sets of gender traits and sex traits giving up the labels “sex” and “gender” to denote those traits. Instead, the traits are divided into sets of descriptive traits and evaluative norms. The former (in a sense) describe “the way the world is” and include physical and anatomical traits (e.g., chromosomes, ovaries, testes, genitalia, body shape and size), one’s appearance (e.g., one’s clothing, make-up, haircut, amount of body hair), roles (e.g., whether one undertakes caretaking roles, engages in childrearing tasks) and self-conceptions (calling oneself a woman or a man). These are features of which there are “facts of the matter”—it isn’t in any sense mysterious or down to value judgements whether one has ovaries, undertakes childrearing tasks, or calls oneself a woman. (This does not mean that values were not involved in singling out descriptive features, like anatomical traits, or that descriptive features are not socially malleable; but more on this shortly.) Evaluative norms are to do with stereotypical judgements: whether one is judged to be, to appear to be and/or to act in ”feminine”, ”masculine” or “neutral” ways. Evaluative norms attributed reflect value judgements and cultural norms. So, on my and the paradigmatic feminist schemas:\n\n Paradigmatic feministmodel|.. |Trait/normcovariancemodel | ..\n--------------------|----------------------|--------------------------|----------\nSex\t               |Gender                 |Descriptive traits\t   |Evaluative norms\nHaving ovaries\t|Wearing make-up |Having ovaries\t           |Being “feminine”\n\t                |Being “feminine”   |Wearing make-up\t|\n\nWhat does it mean to say that evaluative norms covary with descriptive traits? Just that we take certain traits to be of certain kind. So, the trait/norm covariance relation is constituted by particular descriptive traits being viewed in a particular manner by us. I take “femininity” to mean “associated with women”, “masculinity” to mean “associated with men” and “neutrality” to mean “associated with neither or both”. That is, depending on how we view particular descriptive traits, they either covary with femininity, masculinity or neutrality. And certain trait/norm pairings are currently linked to women, others to men and still others to neither or both. They can be so linked in a global or (more often than not) in a local manner. For instance, being short-sighted is globally neutral: as far as I know, the trait is nowhere associated exclusively with either women or men thereby globally covarying with neutrality. Then again, possession of testes appears to be globally masculine, possession of ovaries globally feminine. Quite often, though, the trait/norm pairings are local differing from one context to the next and depending on social and cultural factors. So, although all cultures have traits that covary with femininity and others that covary with masculinity, the configurations of these trait/norm pairings can differ depending on their location. To illustrate, take long hair. In many UK communities it is no longer strongly associated with women and often covaries with neutrality. However, in UK Asian-Indian communities that do not consider it appropriate for those picked out by “woman” to have short hair, having long hair covaries more strongly with femininity. But, of course, other social and cultural axes affect this covariance relation even within a culture: in many UK Indian Sikh contexts, neither men nor women are expected to cut their hair, which suggests that (in these social contexts) having long hair covaries with neutrality. However, in these contexts, other practices to do with hair covary with femininity and masculinity, like the practice of Sikh men wearing turbans. The trait/norm pairings are interrelated: with those picked out by “man”, the pairing “having long hair/neutrality” is interrelated with “wearing a turban/masculinity”; but for those picked out by “woman” the former pairing is not interrelated with the latter pairing. (For more on Asian social conventions to do with hair, see Hiltebeitel and Miller.) The trait/norm covariance relations can also change over time. Wearing trousers is a good example: until quite recently in many Western Anglo-European contexts, masculinity covaried with it. But, relatively quickly, in many contexts it has become neutral. It is now socially acceptable for someone ordinarily picked out by “woman” to wear trousers. The same social value is no longer attached to this trait. Of course, this all further demonstrates that the ways in which the trait/norm covariance relations pan out are not always straightforward. Since the relations depend on beliefs and conventions that change over time and place, they will usually be manifestations of some local and contextspecific beliefs and conventions. There are many complications not least because of differences in contexts and in what norms social agents project on descriptive traits. Nevertheless, it seems fair to say that sometimes seeing how the relations pan out is not complicated and that sometimes social agents do not differ significantly in their ascriptions of norms.\n\nI have said that certain descriptive traits covary with certain evaluative norms, but what explains this covariance relation? I take the existence of this relation to be a thoroughly mind-dependent matter. If you like, wearing make-up and engaging in child-care (to name two descriptive traits) are not inherently or mind-independently feminine–that femininity covaries with them is something that depends for its existence on social factors and obtains because of us. The classification scheme of feminine, masculine and neutral evaluative norms is a strong pragmatic construction; that is, social factors wholly determine our use of the scheme and the scheme fails to represent accurately any “facts of the matter” (Haslanger, “Ontology and Social Construction” 100). So, the classification scheme does not pick out any mind-independent facts about descriptive traits. That some traits are viewed as feminine, masculine or neutral is a consequence of “human-made” fashions, styles, cultural beliefs, social conventions and linguistic practices, which determine what features are judged to be of what kind. The classification scheme of feminine/masculine/neutral is a mere social construction. Furthermore, this scheme tends to be hierarchal in grading traits; this is evident from the devaluing of many activities and features with which femininity covaries (like the devaluing of caretaking work).\n\nOn my model the claim “Jane is feminine because Jane wears make-up” does not capture any mind-independent fact about the world. Yet, my model also takes wearing make-up to be a descriptive trait of which there is “a fact of the matter”. So, it appears that saying Jane wears make-up does capture something mind-independent about the world. It is worth clarifying the notion of mind-independence here to avoid an air of inconsistency. Consider driving. In the United Kingdom, people drive on the left-hand side of the road; in the United States, they drive on the right. Which convention is the correct or true one? We cannot say because the context-specific conventions that govern driving are mind-dependent: they depend for their existence on productive human social practices and require that certain human-made background conditions are in place. Such conventions are, of course, mutable. The UK government could just decide to alter conventions governing driving. Obviously doing so in practice would be hugely difficult and certainly no easy feat. But the point is that ultimately conventions come down to us—there is no mind-independent fact about which side of the road is the correct side for driving. However, that people drive on the left in the United Kingdom is mind-independent in another sense. When I state “People in the United Kingdom drive on the left” I am stating something that is true mind-independently: the truth of the statement is not (if you like) up for grabs. I cannot just decide that the statement is false and drive on the right. (Or, I could, but probably with quite tragic results.) So, given certain background conditions, it is a mind-independent fact that in the United Kingdom people drive on the left irrespective of the fact that the convention to drive on the left is minddependent.\n\nThe descriptive trait of wearing make-up is akin to the convention of driving on the left: it is mind-dependent in that it is a trait that depends for its existence on particular human-made social conditions (it requires that certain human-made background conditions are in place). The trait is also socially mutable: wearing make-up might, for example, go out of fashion thus prompting people to abandon the practice. Nonetheless, that Jane wears make-up is (in another sense) mind-independent. The truth or falsity of the statement “Jane wears make-up” is not up for grabs: either she does or she doesn’t. This is akin to the claim “People in the United Kingdom drive on the left”: however mind-dependent—due to productive human activities— the respective conventions (to drive on the left and to wear make-up) are, whether the statements “Jane wears make-up” and “People in the United Kingdom drive on the left” are true or false is not open to debate given our current conventions. By contrast, the claim “The convention to drive on the left is better than the convention to drive on the right” is utterly mind-dependent. Whether this statement is thought to be true or false depends on one’s view or opinion, in addition to the convention to drive on the left being a product of human social practices. \n\nNow, although it is a mind-independent feature of reality that Jane wears makeup, that Jane acts in a feminine way because she wears make-up is mind-dependent. It does not capture any mind-independent facts about the world, like some supposed fact that the practice of wearing make-up is inherently feminine. That femininity covaries with wearing make-up is mind-dependent obtaining due to productive human activities—because of us. This further illustrates that the trait/norm covariance relation is not a causal relation in the sense that the former causes the latter.\n\nChildcare activities or the practice of wearing make-up do not cause femininity to covary with them; rather, our beliefs and judgements cause this. To illustrate, think about morality. Standardly moral philosophers agree that the act of giving to charity covaries with moral goodness. But does the act cause moral goodness? This depends on one’s metaethical commitments. For some moral realists, the answer might be yes: the act of giving to charity instantiates a realist (non-natural) moral property of goodness. So, the act of giving to charity literally causes moral goodness to pop up in the world because one’s actions instantiate the property of goodness. For moral constructivists, however, the answer might be no: the act of giving to charity covaries with moral goodness because we project moral goodness onto the act of giving to charity. Roughly, we have constructed a moral world in which giving to charity is considered good. So, the relation between giving to charity and moral goodness is not a causal one in that the former causes the latter. That giving to charity is considered to be morally good is down to us. The same appears to be true of what I have said about descriptive traits and evaluative norms: we have constructed a gendered world in which childcare and wearing make-up are considered to be feminine. That is, we— human social agents—are responsible for these covariance relations. And this being fortunately the case, we can also alter them so that childcare, for instance, no longer covaries with femininity.\n\n[continued below](https://www.reddit.com/r/Feminism/comments/6yp60e/ontological_commitments_sex_and_gender_by_mari/dmp1uid/)",
    "title": "Ontological Commitments, Sex and Gender, by Mari Mikkola",
    "subreddit": "Feminism",
    "timestamp": 1504809523,
    "score": 8,
    "keyword": "mixed race judge"
  }
]