[
  {
    "text": "Got fired from a high paying job for my industry and now it feels like I'm starting from scratch Hi all, \nI wanted to share my recent story to get some views on it. At the end of November of this year (2023) I was \"let go without cause\" from a Director position a held at a community health service for 1.5 years. \n\nI had a bit of a unconventional progression to that position. I only started my career in health services in 2017 after graduating from a 2 year community college diploma. My employers over the last few years saw great leadership potential and I quickly found myself in managerial roles. When I went to the place I got fired from, I entered as a manager and was promoted to director after 8 months of strong work. I had great working relationships with my senior leaders and the 150+ staff that reported to me in my division. I never missed a deadline, had a performance issue, or anything. I would say the only thing that created uncertainty about me was my age in comparison to my younger counterparts, it's something my CEO would always refer to. I'm also now 30 years old.\n\nTBH the reason I got fired escaped me for awhile, but I think it was a misinterpretation of something I did. I had been given a project to transition some tenants from a house and set them up in new accommodations so we could sell the house they were in, I was given a ridiculously short deadline of 4 weeks to make it all happen and we did. On the moving day we had contracted a moving service - they did great work and had to be paid of course. I was working from home that day and left my manager and her team to oversee the move, but when it came time for paying the vendor, they claimed they couldn't accept electronic funds or credit payments so we had to come up with $350+ in cash. I couldn't ask my manager or frontline workers to front this so I went there myself, withdrew the cash from my account and paid the movers - job done... I figured I'd just claim it on my expenses. I didn't go to any of the worksites or interact with any of the staff or clients, however my bosses were aware I was sick and WFH that day. Of course in healthcare, COVID scares are still strong sooooo when I come in Monday, half way through the day I was served my termination papers and escorted out of the building. \n\nIt really sucked, as I felt like I did so much for the company to the point where Ive fronted operational expenses on multiple occasions (never again). I get it, as a director I should have led by example and not show up to work - but I felt it was for a good reason to pay our vendors. Overall I dont know if this was the true reason, as I wasn't given one at the point of termination. \n\nAnyhow... I start a new job today. It has a 10k pay cut and a drop in title to \"senior manager\" but the organization seems ok. I desperately took this job to be able to keep income coming, but I also believe in the good of the program and operation I've been hired to lead. My current employer tells me that they only ask for at minimum 1 year of commitment to the role, knowing that my skills and competency exceeds the value of the position; I found this very courteous. \n\nI deeply fear not having the opportunity to climb the career ladder again. Not only because healthcare is taxing and only senior management and up positions really earn good money, but I also am not competitive in the job market with a 2 year diploma. I have a plan to go back to school to finish a BA and put some more work into my breathwork business but as I begin my new role, I can't help but feel hopeless that I'm stuck in this rat race in a low paying industry and if I don't get opportunities like the ones I've cultivated at previous employers then I'll never be able to live my ideal life (house and kids). \n\nHas anyone ever been knocked back in their career but found success later on down the line? How big a role did your age play in it?",
    "title": "Got fired from a high paying job for my industry and now it feels like I'm starting from scratch",
    "subreddit": "jobs",
    "timestamp": 1703686657,
    "score": 18,
    "keyword": "mixed race ceo"
  },
  {
    "text": "What’s your experience with EAP (employment assistance program) ? I have had mixed experiences with EAP service both dealing with my employer and then using the service (especially with a psychologist)\n\nThe first time I used it was with my employer at my first job. I didn’t know they even had this service until 2years in the job. At that time I was getting bullied by a colleague which is why they allowed me to have 3 sessions. I had to go through HR first and then the CEO when the HR manager left… I had a feeling the CEO did not like me using the service however the psychologist I was paired with was a life-saver and allowed to see the situation more clearly and gave me some instruction on what to do. \n\nSince then, I have been working at different places where they have been more open about having EAP services but my experiences with the service has been mixed. \n\nKeen to hear other people experience with EAP!",
    "title": "What’s your experience with EAP (employment assistance program) ?",
    "subreddit": "jobs",
    "timestamp": 1688643166,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "What job titles should I be applying for? Hello Reddit Community,\n\nI’m  at a crucial point in my career and seeking advice on job opportunities  that align with my diverse background. I have a Master’s in Biology  with a focus on Medical Science and a Bachelor’s in Biological Sciences.  My professional journey includes a mix of entrepreneurial ventures,  healthcare experience, and significant roles in sales.\n\nKey Experiences and Skills:\n\nEntrepreneurial Venture:\n\n* Founder & CEO of a startup developing AI-driven technology for pre-operative planning in surgery (this is just on my resume. I haven’t actually coded AI, developed a model, or educated myself on how to. My actual knowledge on AI is pretty much limited to understanding applications in which it can be applied)\n\nHealthcare Experience: \n* Worked as an Emergency Medical Technician, providing care in high-pressure environments.\n* Health Insurance Medical Claims Representative\n\nSales Experience: \n* Area Sales Manager: Transformed market strategies, led training programs, and achieved top sales figures.\n* Outside Sales Consultant: Excelled in product presentations and customer engagement, significantly boosting revenue.\n\nI recently faced a  setback in my sales career due to a disagreement over territory  reduction, leading to my dismissal from my job as an Area Sales Manager. I’m now exploring opportunities in  pharmaceutical or medical device sales, leveraging my strong academic  background and sales expertise.\n\nOther Roles: \n* Press Operator, Mechanic Assistant, and Timber Surveyor.\n\nI'm seeking advice on:\n\n* Types of roles that could fit my skillset and background.\n* Strategies for possibly transitioning into the medical/pharma sales field.\n* How to best present my varied experience in a resume for these industries.\n\nAdditional Skills and Interests:\n* Proficient in operating systems, software, and custom computing hardware.\n* Capable of comprehending and distilling complex scientific literature.\n* Interests include medical research, artificial intelligence, and machine learning.\n\nAny insights, suggestions, or personal experiences would be greatly appreciated!",
    "title": "What job titles should I be applying for?",
    "subreddit": "jobs",
    "timestamp": 1701980260,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "What jobs should I be applying for? Hello Reddit community,\n\nI'm currently at a career crossroads and seeking advice on potential job opportunities. My background includes a mix of entrepreneurial ventures, sales experience, and a strong academic background in biological sciences (Master's in Biology with a focus on Medical Science and a Bachelor's in Biological Sciences). My work experience spans various roles, including being a Founder & CEO of a startup in its infancy, working as an Emergency Medical Technician, and roles in sales - notably as an Area Sales Manager and an Outside Sales Consultant. In these positions, I've developed skills in client engagement, project management, and strategic market analysis, among others . Given my academic background and interest in the medical field, I'm exploring opportunities in pharmaceutical sales or medical device sales. However, my most recent sales experience was cut short when I got fired yesterday because my boss was mad I was mad they were reducing my territory by 25%, and I'm concerned about how this might impact my job applications if they request a reference.\n\nI'm seeking advice on:\n\n* Types of roles that could fit my skillset and background.\n* Strategies for possibly transitioning into the medical/pharma sales field.\n* How to best present my varied experience in a resume for these industries.\n* Advice on resume. Not all the info below is in my resume, but I'd like to hear what others think should be included, expanded on, or removed.\n\nAny insights, suggestions, or personal experiences would be greatly appreciated!\n\nMy resume info is pasted below for additional context.\n\n**EDUCATION**\n\n* **\\_\\_\\_\\_\\_:**\n   * MASTER OF SCIENCE: Biology with a focus in Medical Science\n   * 3.6 GPA in Master’s program\n   * Scored 70th percentile on the Human Gross Anatomy NBME Subject Exam. This exam is almost exclusively taken by medical school students, indicating superior performance to those in Medical School.\n   * May 2017—December 2019\n* **\\_\\_\\_\\_\\_:**\n   * BACHELOR OF SCIENCE: Biological Sciences\n   * August 2014 —December 2017\n\n**WORK EXPERIENCE**\n\n* **02/2023—12/2023**\n   * Area Sales Manager, \\_\\_\\_\\_\\_\n      * Rapidly transformed the market, revitalizing sales and engagement through strategic initiatives and relationship-building.\n      * Established strong rapport with Home Depot store managers and associates, leading to enhanced collaboration and improved sales performance.\n      * Entrusted with leading a Southeast region meeting, demonstrating the use of the shed builder software to associates and managers, despite the presence of more tenured Area Sales Managers.\n      * Recognized for exceptional customer service and in-depth product knowledge, with multiple customers providing explicit commendations for the same.\n      * Played a pivotal role in training Home Depot associates on selling \\_\\_\\_\\_\\_ products, ensuring they were equipped with the necessary knowledge and tools.\n      * Consistently ranked among the top sellers in the Southeast region, with sales figures often exceeding $20k+ in a single day.\n      * Received commendations for outstanding performance from \\_\\_\\_\\_\\_\\_ vice presidents, district service managers, district managers, as well as \\_\\_\\_\\_\\_ peers and managers.\n      * Demonstrated leadership and expertise, contributing significantly to team achievements, including notable sales milestones and promo closes.\n* **12/2022—02/2023**\n   * Outside Sales Consultant, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_\n      * Trained extensively in all product lines and mastered the delivery of professional interactive presentations, consistently exceeding company expectations.\n      * Achieved a perfect score on the script read, memorizing 5 pages of dense script text, marking the highest grade in my cohort.\n      * Set an average of 7 appointments per day while in the store, showcasing my proactive approach and dedication to the role.\n      * Successfully closed a significant percentage of the leads provided, resulting in a noticeable increase in company revenue during my tenure.\n      * Recognized for my exceptional ability to engage customers, leading to a higher conversion rate compared to peers.\n      * Worked closely with leadership and mentors, leading to the refinement of sales strategies and techniques.\n      * Demonstrated exceptional customer service, leading to numerous referrals and repeat business.\n      * Despite my short tenure, my departure was deeply felt by the company due to the significant impact I made in a short period.\n* **07/2021—08/2022**\n   * Health Insurance Medical Claims Representative, \\_\\_\\_\\_\\_ (\\_\\_\\_\\_\\_) – Remote position\n      * Assisted customers with claims, payments, billing, and benefit inquiries.\n      * Communicated with medical providers to ensure proper patient billing and transparency.\n      * Promoted to a level 2 medical claims representative for exceptional performance.\n* **02/2020—11/2020**\n   * **Press Operator, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_**\n   * Was solely responsible for operating a complex press generating 1.2 million dollars in product per day.\n   * Highest paying job in the plant exclusively given to those highly qualified and capable of running the press with high efficiency and low product loss.\n   * Multiple awards were received for ‘press of the night’, where I had the best production numbers of all the press operators.\n* **05/2019—08/2019**\n   * Emergency Medical Technician, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_\n      * Provided Emergency care to those in need in one of the highest crime rate locations in the country.\n      * Provided patients with a sense of security and comfort during life and death situations.\n      * Worked with medical facilities to ensure increased patient satisfaction through high-quality expedited care.\n* **12/2017—05/2018**\n   * Emergency Medical Technician, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_\n      * Over four months and 150 calls in the field as a Nationally Certified Emergency Medical Technician providing next-level Emergency Medical Services to multiple communities in the states of Louisiana and Texas.\n      * Responsible for delivering life-saving intervention in the event of Basic Life Support (BLS) necessity.\n* **05/2016 — 08/2016**\n   * Mechanic Assistant and Software Solutions Analyst, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_\n      * Independently developed an online system to track mechanic tool movement and inventory within the shop.\n      * Assisted mechanics in the completion of vehicle checks, repairs, and initial inspections.\n* **05/2015 — 08/2015**\n   * Store assistant and Bagger, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_\n      * Ensured store operations ran smoothly by bagging groceries, stocking shelves, mopping, sweeping.\n      * Assisted customers with finding items in the store, loading their groceries into their car, and returning carts.\n* **05/2014 — 08/2014**\n   * Timber Surveyor, \\_\\_\\_\\_\\_ – \\_\\_\\_\\_\\_\n      * Performed GPS mapping for plots of land to create clearance boundaries and ensure precise timber removal.\n      * Surveyed plots of land to determine the percentage breakdown of tree species within a given area.\n      * Assisted in monitoring job sites to ensure safety precautions were being adhered to, thereby reducing injury risk.\n\nENTREPRENEURIAL VENTURE\n\n* **Apr 2023 – Present**\n   * Founder & CEO \\_\\_\\_\\_\\_\n      * Developing AI-driven technology to transform pre-operative head scans into comprehensive models that illustrate potential post-operative aesthetic outcomes, tailored specifically to the unique anatomical features of each patient.\n      * Conducted comprehensive, in-depth interviews with post-operative patients and surgeons to carefully glean detailed insights into the outcomes, efficacy, patient satisfaction, and overall success of their surgical procedures.\n      * Performed a detailed analysis of market size and expansion potential, focusing intensively on identifying and evaluating key addressable and obtainable market segments for strategic business growth and targeted marketing efforts.\n      * Engaged in extensive, targeted research on the innovative application of AI in the field of plastic surgery, aiming to significantly enhance, refine, and revolutionize the technological capabilities of the \\_\\_\\_\\_\\_ platform.\n\nUSEFUL SKILLS AND ATTRIBUTES\n\n* Extreme composure and patience under pressure when faced with situations as complex as the life and death of patients.\n* Very knowledgeable on operating systems, software, and custom computing hardware.\n* Natural interest in medical research and ability to comprehend scientific literature.\n* Exceptional ability to assimilate relevant data to solve problems and understand concepts in the most efficient way possible.\n\nADDITIONAL SKILLS, ATTRIBUTES, & INTERESTS\n\n* Skills and Attributes: Highly intelligent (Mensa qualified); Quick typist (74 words per minute); Ability to comprehend complex scientific literature and distill it for a general audience; thorough understanding of Search Engine Optimization; Articulate speaker and outstanding writer capable of conveying thoughts concisely; Keynote / PPT presentation; Sales & Distribution; Product Demand Research; Salesforce\n* Interests: Weight lifting; Boxing; Hunting; Fishing; Socializing; Wine and Beer tasting; Meditation; Sauna; Medical research; Artificial Intelligence research; Machine Learning; PC building, programming, and gaming; Reddit.",
    "title": "What jobs should I be applying for?",
    "subreddit": "jobs",
    "timestamp": 1701920439,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Should I tell my mentor that I’m probably getting fired? Essentially I’ve been struggling with my job for months. \n\nI’m pretty sure it’s been a mix of disliking the work I do (PR), feeling overwhelmed and burnt out constantly, and not really feeling welcomed or comforted in the workplace (I feel like people just act awkward or like they’re walking on egg shells around me, which is strange because I feel like I’ve been fairly open, welcoming, and understanding towards them??). \n\nAnyways, my manager, who often corrects and points out the issues that I’ve consistently had in the workplace, was my also mentor for a solid 6 months. This is my first job out of college and I started at an entry level position, so initially the idea made sense. I was a bit slow to realize that this was actually a horrible idea as I could never really be honest about my experience at my job, how I felt she was doing as a manager or my opinions on the on-boarding process. She’s also very type-A (understandably for this line of work) and micromanaged essentially every item I worked on to the point where I had no confidence in what I do at my firm. Because of this self-consciousness, I felt like I was unable to progress or allow myself to take on bigger tasks out of fear of messing up or not meeting standards, all the while the work I was doing was apparently already not meeting expectations. \n\nI feel bad about causing other people trouble and having my colleagues do extra work because of my shortcomings, at the same time though I wish I was able to honestly talk to someone at my firm who wasn’t my manager about my comfort level and who I could turn to for genuine advice. \n\nThat being said I finally got a new mentor around a month and a half ago who’s been very nice and understanding when it comes to some of struggles I’ve faced. She actually seemed to kind of care about what I thought about my progress, didn’t seem judgmental, and offered good advice to me. She wasn’t quick to call out all of my errors or problems with no solutions in mind like my former mentor. Jumping right into an in-person full time job directly out of college post COVID was definitely an adjustment for me and she’s told me she understands the struggle. Around 2 weeks later I was pulled in by the president, CEO, my manager’s manager, and my personal manager/former mentor, and we discussed how I wasn’t a good fit for the company. They gave me a 30 day “probation period” where I was supposedly given an opportunity to “prove myself”. I’m in the final week and I’m about 99% sure I’m being fired. I haven’t told others at the company and I haven’t told my mentor either. \n\nI’m not sure if I’m even allowed to tell her, or if she already knows. I don’t want things to come as a complete surprise one day when I’m all of a sudden off the team. If anything I feel like it’d be good to discuss next steps or lessons learned from my experience. I’m still kind of weary based on my experiences with my former mentor though, who seemed to use the issues I initially vented to her about against me when it came to evaluation meetings. It doesn’t help that I’m a pretty open book I guess...",
    "title": "Should I tell my mentor that I’m probably getting fired?",
    "subreddit": "jobs",
    "timestamp": 1682445573,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "mental health issues? I work at a large, woke nonprofit.  CEO is black.  We recently hired a black section manager.  Since week 1, he's been disruptive and haranguing his upline and downline.  No one wants to work with him.  His dept head has been stopped by the CEO from writing him up.\n\nWhy would anyone new behave like this?  Hes not friend with CEO. Just same race.  My conclusion is he's not well mentally.  And because it's a woke organization, he's been getting away with very bad behavior.",
    "title": "mental health issues?",
    "subreddit": "jobs",
    "timestamp": 1673594818,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Do Quiet-Quitting as much as possible I want to share my wisdom as guy thats been working actively for the last 7 years. cooshy IT job, even working from home etc. 95% of bosses and managers are complete assholes. they dont care about your ideas or talent. they are more obsessed with making you over-work and suffer than you making the company millions. the dumbest people i have seen. do anything possible to take it easy, practice quiet quitting, abuse welfare as much as possible, value your work, sabotage your workplace to be unable to function without you. in short....declare a SILENT WAR on your employer and be 10 steps ahead in fucking them. they are NOT your friends.\n\nyou have no idea how much i hate them. i run a little podcast, im supposed to be an \"alt-right racist\" but i focus 100% on speaking against corporations, bankers and politicians. Keep in mind something like cheese is 3 times cheaper and REAL compared to what they sell you in walmart. when i see black people stealing from walmart i cheer for them. when all jobs expect you to work for 15$/h and everyone is looking to abuse you....the only winning move is to go OUTSIDE the game...and make them starve and beg.\n\njust last week we heard some investment asshole speak how we workers need to be crushed and reminded that the employer is king and we dont make the rules.\n\nive been practicing various ways to combat corporation and government greed, and urging people to try it too - piracy, growing vegetables at home, canning/preserving, buying in bulk, now im even looking to make my own cheese at home.\n\n9 out of 10 popular bulgarian \"sheep cheese\" brands were caught putting 50% cow milk in the mix (when they are not using palm oil). 9 out of 10. that means EVERYONE is scamming you. EVERYONE.\n\nremember from me - always do anything possible to fuck with the \"ceo\" class and corporations. become so self sufficient that they will have NO POWER over you. abuse welfare and lie on your CV as much as possible.",
    "title": "Do Quiet-Quitting as much as possible",
    "subreddit": "jobs",
    "timestamp": 1695585967,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "You Cannot Be Serious I’m a young college student who recently went on a “field trip” with some other students in my major. I go to a well known commuter friendly college so my major has a good mix- a lot of adults who come back to finish their education, want to get a higher salary, etc.\n\nNow, after our trip concluded we all stopped to get lunch. I was already a bit uncomfortable because I was the youngest there, and the only female. Luckily I’m a very affable person so I decided to make small talk with the man sitting next to me from our group. We get to discussing our current jobs and he tells me he works in the education system. He proceeds to tell me about a 7th grade girl who was talking about freezing her eggs.\n\nHim and I are both a bit taken aback- him from his memories, and me from the way he was describing the situation as if it were like a 12 year old being weird. As he continued however, he went on the explain how she wanted to freeze her eggs so *she could become a CEO and focus on her career*. He still thought this was weird and I had to be like “wait that’s actually very wise and intellectual of her, sure it may seem odd she knew of this so soon, but I knew about egg freezing from a young age because of the internet.” His response “freezing eggs is weird and it creeps me out, I wouldn’t let my daughter do that”. \n\nWe continue talking and it becomes very apparent this man has no idea why women freeze their eggs. I had to explain how fertility works, drops, and is affected by our age. How certain genetic factors can become a risk, and why it’s typically advised to stop having children after a specific age. I also emphasized the fact that many women are having children later because we are now apart of the workforce and cannot have children whenever we desire under Americas capitalist society. He was genuinely taken aback and intrigued, which I appreciated. He had no idea how women’s fertility worked, why egg freezing and IVF we so popular and important. I was thankful he was attentive and receptive to what I told him but….\n\nThis man is almost 40 with two kids. \n\nEveryday I fight harder and harder to not become a misandrist.\n\nThat part’s obviously a joke but I think y’all know what I mean, like why are you guys so DUMB\n\nEdit: Let’s just add some clarification since you all are talking about how we live in the USA and how our schools fail us, which yes kind of in that regard. We do live in the US, but we are from Southern California/Los Angeles region. Sexual knowledge is HIGHLY accessible here. I have never met an adult parent who didn’t understand at least a sliver of women’s fertility! I also wanted to add that I was very appreciative of the fact he was willing to learn WHICH I STATED. \n\nI was taken aback how some of you claimed I was “sitting on a high horse” but I think this is more of a regional thing. It’s unknown for people to not know about these things at all down here at that age. You don’t even have to go down the rabbit hole with this information, it’s literally on advertising here with us getting ads encouraging us to donate eggs! Besides, it truly is unacceptable to have a child without understanding fertility unless it was forced on you, or you are not allowed to get an abortion. \n\nThat being said some of you really need to stop playing devils advocate. Constantly making excuses for men in general when it comes to women’s health and their role in it, is extremely ignorant and perpetuates the problem. Like this man is a FATHER who is almost 40 for f**** sake.",
    "title": "You Cannot Be Serious",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1699608356,
    "score": 2019,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Donating eggs - my perspective. TLDR: I anonymously donated eggs in 2021. Yesterday I met my donor daughter for the first time. She will be 1yo this month. She is beautiful. She looks like me and my youngest child. Her parents are wonderful. I am incredibly happy for them. My donor recipient had a hard time and went through a lot to get her daughter. My youngest child has been begging me for a sister so he sort of got his wish haha.  \n\n\nLong version:   \nI live in Australia so you can't sell your blood, plasma, sperm or eggs. If you donate, you do it altruistically. I've always donated blood and plasma - I hit 75 donations before my doctor told me to give it a rest for a year. In 2021, I watched a doco on Netflix called One More Shot about infertility. I've always wanted to be a mum. I met my husband at uni. After three and a half years, we got married the day after I turned 23yo (husband was 24yo). I had my first son a year anda bit later when I was 24yo and had my second son when I was 27yo. I'm 32yo now. I fell pregnant easily - especially with my second. I fell pregnant the week my Implanon (contraceptive) was taken out. My GP didn't believe it until he checked the dates - he was the one who took the Implanon out. My point is that I am very fertile, I am done having kids and I have plenty of eggs that I don't plan on using so why not donate?  \n\n\nDonating in Australia had a lot of prerequisites: you had to be of a certain age, be relatively healthy, had finished your own family or sign a waiver saying you wouldn't blame the clinic if your fertility was affected by your egg donation(s), etc. You also had to go through a few other hoops like sessions a few months apart with a psychologist. If you were married like me, you need permission from your partner and they too would have to do some psych sessions. Then came the blood work. The forms. Vaginal scans. Medication. Lots of needles. Lots and lots of appointments. As an egg donor, you basically went through the IVF process and stop short of the implantation part. That was all fine with me. Inconvenient but I'm a SAHP so I had a lot of free time. The clinic paid for everything for my donation - apparently some clinics in Australia want you to donate (for free) but also expect you to pay for it too (medications, hospital stay, doctor fees, psych fees, etc.) so I'm guessing that's when you know who your donor will be and the recipient parents would cover that. I'm an anonymous donor so I didn't know who would get my eggs. I could put stipulations and pick recipients who were of a certain age, race, religion, nationality, etc. but I didn't. When I woke up from the egg retrieval surgery, I was handed a gift bag with a note basically saying thank you and that even if my donation did not result in a baby, that at least I gave them a little more hope anyway. I've kept that note and filed it away.  \n\n\nA year later I heard there wasn't many donors, even less than the exisiting dwindling pool of donors, due to covid. So I made another egg donation in 2022 at the same clinic. My ovaries were overstimulated again but this time was much worse than last time. I was sick for longer and had gained a lot of weight and decided not to continue - legally you could donate up to five families. During this second donation, the clinic let slip that my first donation recipient was pregnant. I was glad for them but didn't seek out anymore information at the time.  \n\n\nOne day I got an email telling me our donor database was being moved over to a government one and I had to fill out new forms. During this process I found out I had a match, that one of my egg recipients were successful and had a baby girl in 2022 (clinic can release the gender and year of birth of donor children to egg donors). I was so glad for them and didn't want to pry so didn't send that email to the clinic. So I filled out the new forms. I had the choice to not put down any identifying or contact information until the child was 16yo but I put down all my details incase they needed it for whatever reason. Maybe they didn't need my details today but might need it in the future before the kid turns 16yo. When the kid turns 16yo, they could find me whether I liked it or not. I was also fine with never hearing from them ever as well.\n\nWithin a week of filling out those new forms, I got an email from my donor recipient. The first embryo implanted worked and she had given birth to a beautiful baby girl. The mum sent me a photo of her and her daughter that day (10mo), plus another photo of her daughter as a newborn. I literally screamed that my kids ran to me. I was so excited and happy for her! I quickly showed my sons and my husband the photos. My youngest who is 4yo has been bugging my husband and I for a sister. My 4yo celebrated and screamed \"yay, I have a sister!\"\n\nThe next few weeks were a mixed bag of feelings. My kids who were extremely happy and excited came home one day saying they don't want to talk about their donor sister and wanted to keep it all a secret. It turned out no one believed them at school and had called them liars. I talked to the teachers and we sorted everything - my kids are fine now. My husband and I had years to talk and process different outcomes of my donations but I forgot that my kids are so young that they would need much more time to sort it all out for themselves. My mum and siblings were excited and a little heart broken but mostly happy. It took almost a year to donated eggs from when I first made an inquiry to the egg retrieval and last blood test. My dad passed away a couple of months before the egg retrieval surgery. He was proud of me, excited, and fascinated by the egg donation. I'm sure my mum would've wanted to talk to him about it.\n\nThe day came when I would meet my donor recipient, her partner and her daughter. I was very, very nervous. Mostly thinking that they wouldn't like me. I was worried that my skin would be darker than they expected it to be or that my personality wasn't what they'd imagined. I didn't want to be a disappointment. When we got to their driveway, we saw their amazing vegetable garden - much like ours. I was so, so nervous but I had my two kids, who are also very keen gardeners, running around the garden finding veggies they could identify. We never even got to knock on the door because my husband and I were chasing after our boys. I looked up and there they were -  they just appeared out of thin air haha. My donor recipient was holding her daughter who looked very much like my youngest. Her daughter had just woken from a nap and was a little groggy but was excited to see my boys playing in her garden. My boys wanted to give her a hug immediately but my eldest changed his mind said that they both should wait and not scare the baby so they crouched on over and said hello. I noticed that she has my eyes, my eyebrows and the same hair as my boys. She definitely has her father's nose and a few of his features too. Time will tell how much more she will take after me or her father (also biological father) through our shared DNA. I'm sure she'll take after her mother's mannerisms and such too. I'm happy that my donor recipient could carry her child through pregnancy, labour and delivery - I know how much she wanted that. I know my pregnancies made me a little closer to my boys and is genuinely a unique experience.\n\nWe eventually went inside. I found out my donor recipient's husband/donor child's biological father is also a long distance runner like myself. My recipient loves gardening like I do. It turns out they are very much my sort of people and I was just so happy for them. I was also relieved that they liked us too. My donor child is so very loved. Her parents had gone through so much. Again, I had my children so easily and young that I never thought about miscarriages, IVF or anything to do with infertility at all. It just never came up in conversations. It was only after I donated that a lot of my friends and family told me about their stories of loss and infertility. My donor recipient had a few miscarriages with some after IVF. I can't imagine the heart break she and her husband endured throughout the years.\n\nI feel a bit goofy typing this but there was this weird amazing feeling when I held my donor child. It was sort of a \"hey there you, did you know that your mum went to the moon and back to get you? You magical little thing. I'm so happy you're here\" She is the sweetest baby girl. She didn't cry at all throughout our visit. Loved being held by my husband but more so me - I kept bouncing her to make her laugh so that's probably why. Her parents said that she doesn't usually like being held by men at all and that she usually takes a little to warm up to people in general but she came right along with my husband and I. She followed my boys everywhere with her tiny legs - she only learnt how to walk a couple of weeks ago. We talked for a couple hours until my children got overtired and probably overwhelmed. We took some photos to show our both our families (hers overseas and mine out of state). They kept mentioning how grateful they are but I don't really know what to say to that. I'm just really, really happy for them. \n\n&#x200B;\n\nJust a couple of notes I want to add in:\n\n1. There hasn't been enough time for my second donation (2022) to result in a child but I've been told the (19 successfully frozen) eggs have been allocated to a family so I hope they get their little one(s) too even if I don't get to meet them ever.\n2. My husband probably would've donated sperm but because we didn't want to have anymore children, he had a vasectomy in 2019. I watched that documentary in 2021 so it was just too late for him to donate sperm in the typical and inexpensive way.",
    "title": "Donating eggs - my perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1688997426,
    "score": 94,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I work with all women in science and it’s awesome There’s only 6 of us, but my department is 100% women, more than half are women of color, and we do science at a biotech company. I’m currently in an email thread with two of my managers (both women) and it made me start thinking about how great and easy it is to work with other women. We work closely with other departments, too, so I do work with a good mix of genders/races/ages but it is so refreshing to not have to be constantly explaining myself or proving my worth. My bosses back me up on decisions. They have stopped other departments from assigning me more work that shouldn’t be assigned to anyone in my department in the first place (reports, small projects). They come to me for advice on issues they haven’t encountered before but I have cause I’ve been here a long time. They let me present data at meetings with clients and higher-ups. \n\nI know in my heart that if I had more man bosses, or any gender but misogynistic, I would not be in the same position and salary. \n\nI am so grateful for accidentally ending up here and I’m excited for future young STEM women to be more likely to have this experience, rather than constantly having to prove yourself. I know we are going backwards in a lot of aspects society-wise but this is a little win for me.",
    "title": "I work with all women in science and it’s awesome",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678214336,
    "score": 72,
    "keyword": "mixed race ceo"
  },
  {
    "text": "On dealing with my boyfriend’s sexist friends in a second language I’m not sure what I’m looking to achieve by writing this post, perhaps I just need to get this off my chest. However I’m open to advice or encouragement. Tell me to chill, I don’t know.\n\nSorry for the length, I hope this isn’t boring.\n\n\nBackground:\n\nI (32F) am an American in Europe. I’ve been living here, in the same country, for about a decade so the language barrier isn’t such an issue. When I encounter situations where cultural differences are evident, I try my best to reserve judgement and just listen until I’m sure I understand what’s going on.\n\nSo our country’s lockdown was pretty strict. After the first wave, I moved across the country then got stuck in lockdown again in a brand new city. Fortunately, I met a fantastic guy around that time and we spent a lot of our quarantine together.\n\nHe’s not the kind of guy I wouldn’t normally go for: he’s in finance and is a semi-pro sports player. I’m an artist, I’m bi, I’m mixed race, and clearly a foreigner- it’s cool, I’m happy with who I am, but it’s obviously easier running in social circles where we have at least a few of these things in common.\n\nI figured I was changing a lot in my life at that time so why not try to get to know someone who I normally wouldn’t have reached out to before. It turns out it was a great decision. My partner is a fantastic human, his family is also super open to our relationship which isn’t necessarily a given in this region. Thus far, we’ve been together for nearly 3 years.\n\n\nThe issue:\n\nAs we began to settle into our normal lives after COVID, we started hanging out with my partners friends more (most of them are from his sport). Eventually they could resume playing, so a lot of my Partner’s time was spent with the team. Many nights were dedicated to after practice/game hangouts, which was mostly a lot of fun…. except… the rampant misogyny. Honestly I was floored at some of the shit I heard.\n\n\nHere are some classics:\n\n-Just the free usage of the our language’s equivalent of bitch, slut, whore and f**. Sometimes even racial slurs\n\n-A dude at a wedding yelling out “so guys what bitches/sluts are you trying to find tonight” while his wife and baby were at the other end of the courtyard\n\n-Another referring to his wife and mother of his child a crazy, emotional *girl*\n\n-Yet a different wedding one of the groomsmen didn’t understand why Pride needed to be a thing. The irony, gay marriage is not legal here\n\n-Many of the team players have a tattoo for a famous player of their sport, who raped a 19yo. I’ve asked, they still insist “she was lying” or “even if it was true he was really good at said sport”\n\nAnd finally the one that tipped me over the edge:\n\n-I found out a couple months ago, one of their ex teammates stealthed a friend of mine. I can’t say I’m surprised but I would be shocked if this sort of behavior was an isolated incident \n\nFor the first several months of getting to know some of these guys I was pretty reserved. just absorbing context. Getting to know new friend dynamics is difficult on its own, in a different language it’s even harder. However, after a while it was clear that I wasn’t misunderstanding much.\n\nI don’t know if it’s me being a woman or a foreigner, but any time I interjected, no matter how calm or rational it was packaged, I was met with opposition. Most of them would just double down. It’s not really a surprising result. After a while I felt myself becoming hostile to my partner’s friend group as a whole (even though some of his friends are actually chill people). It was not a good look.\n\nMostly I was upset my partner never said anything. Like his discomfort was palpable in some of these situations, but didn’t see the point in being confrontational if the guys weren’t in his close friend circle.\n\nAs for some of the guys in his close friend circle- fucking yikes. To be fair he has been trying to be more proactive when derogatory things are said.\n\n\nThe solution so far:\n\nAs I started making my own friends it has been easier to avoid situations around my partner’s sports friends. I even thought at one point that I was blowing things out of proportion. But now that our interactions are usually for specific events, their disrespect is just more evident.\n\nSo, that’s it. Distance is my solution.\n\n\nThe question:\n\nI don’t even know what advice I need. My partner just finished his last season, but this topic is still thorn in our otherwise great relationship. \n\nIt sucks that I cannot spend an extended amount of time with some of his best friends. And I feel very uncomfortable knowing my partner’s good friends have such little respect for women- but of course I’m never going to say “it’s me or them”.\n\nLike I said, he’s being more assertive on this topic, he has major golden retriever energy and does not like to disappoint people. I applaud his efforts and don’t think I can fairly ask for anything more. \n\nWhen I do see his bros, I’ll just have to keep it superficial until further notice.\n\nThanks for reading and letting me vent.\n\nTDLR\nMy partner and I are an odd pairing. During COVID we made it work then I realized a lot of his friends are pretty sexist. I thought something was lost in translation or there was some cultural thing I didn’t get, but that wasn’t it. My SO makes an effort to speak up when they say fucked up shit but some of his friendships still make me uncomfortable. As a solution I avoid most interactions with his buds. It feels bad.",
    "title": "On dealing with my boyfriend’s sexist friends in a second language",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690741434,
    "score": 28,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I'm Furious - The Media is Built for Men, and They Don't Even See it!!! So, in my country some 'Lord' (some random person knighted by the Queen/King for silly reasons) has declared that \"75% of young offenders come from a broken home (i.e. no father).\" This post isn't going to be about *this statistic,* more the conversation around it. Quite frankly, I'm tired of men & boys having the \"I didn't have a father\" excuse. (My guess is that boys who were raised by a single mum actually would turn out *better....* But the lack of opportunity and lower household income interferes with that, but hey-ho. Alternatively, men who abandon their children probably were also abusive to the mother and child. Children who grew up around violence are more likely to be violent.). \n\nHowever, onto the actual post... \n\nI was hate-listening to the radio (my mum listens to it, so I now hate-listen to it lol) discussion on this topic. The presenter is liberal/centrist, so of course there was no discussion as to *why* families are broken, *why* men grow up without a father. It's as if this just exists in a vacuum.. As if the fairies do this to young boys. *And of course, the conversation revolves around young men without a father, not young women.* We don't exist, remember! The conversation was 90% male callers and texters, apart from 1-2 single mums talking about how they were abandoned.\n\nI texted in (I know I should know better to not engage with normies, but I'm very vocal): \"unfortunately, any attempts to change the culture we have that teaches men that they can abandon their children will be branded 'woke' by the very same Conservatives who are concerned about the nuclear family unit.\" To the presenter's credit, he read it out. Oh, but then...\n\nSome odious man (an MRA) texted in that the discussion was making him \"very angry\" because apparently loads of women prevent their child from seeing their father, or \"drive the father away from the relationship in the first place\" and \"poison the child against him.\" I apparently need to see \"both sides of the coin.\" The all-male television crew had obviously chosen that text to 'counter' mine. \n\nImmediately suspicious that this was MRA nonsense, I started googling the organisation the texter mentioned: Fathers4Justice. I'm disgusted. It's worse than I thought. Here's the REAL story in most cases: the father is the one who causes the break-up of the family unit, by being abusive or cheating. The mother is either forced to leave him, or he chooses to abandon them. So some men go off with their new floozy and never attempt to get custody. In the case where the mother is forced to leave (which is super dangerous), the father uses custody as an attempt to maintain control. He wants her to raise his 'heir' and do all the heavy lifting, meanwhile he gets to be the 'hero dad who sees his child once a week'. They take on more custody so they have to pay less in childcare - that's the only reason. The ONLY reason. The courts give custody to women more often... Because most men never turn up to court. They don't seek custody. In the few cases that they do seek custody, the courts favour him! \n\nIt totally makes sense. Think about it: why would a woman want the father to not be involved? We are not vindictive and spiteful like men are. We actually care about the child's welfare. We are exhausted of doing all the work and it's near-impossible to live on one income now. The stories about women pushing men away are about as common as women lying about being SA. There's a common theme of men making up stories about women doing this or that to them. \n\nMeanwhile, look at Conservative men: a lot of them don't have children (think of influencers online), but preach to women about having them. The ones that do have dozens that they never even see: Boris Johnson, Elon Musk, Donald Trump, etc. These men want just enough custody to have a 'strapping young lad' as a trophy child \"look at my virility,\" \"look at how beautiful his mother is\", or a future CEO of their company. \n\nWe live in a world where women are forced to carry their rapist's child to term and give him visitation or dual custody rights. On what PLANET do men think that they can't see their child. A RAPIST can see his child. In what UNIVERSE do men think we're favoured over them. \n\nWhat have we learned today?\n\n* Men will conveniently leave out all the reasons as to *why* phenomenon happens, if their behaviour is the case \n* If you dare to point it out, someone will come out to defend the patriarchy with lies or at least unchecked points \n* MRA's are everywhere; they are NOT a small subculture - they are mainstream \n* We hear mens' voices way too often \n* MRA's just want power over women; they do not care about the issues that they purport to care about\n* Never listen to a man's 'stories' about what women apparently do\n* Fact check everything a man says, especially about women or their 'rights'; it will be wrong, and most likely the total OPPOSITE is occurring \n* Don't risk having a child with a man \n* Unelected 'lords' should keep their mouth shut\n* Men will turn what should be a conversation about the patriarchy & poverty into a conversation that implies all the world's woes are caused by: single mothers, women in general, women having the ability to leave a relationship, a lack of 'discipline' (i.e. bring back slapping kids!), and liberal destroying the nuclear family unit & conservative values. \n\nNow there's a woman on the radio saying that \"she's behaving vindictively, like when a woman is left by a man whom she loved, but did not love her back...\" about a married fascist politician... who tried to incite a race riot last week... being fired... by a married prime minister... and so she's turned around and said he's abandoning the country....??? Look how casual misogyny is just thrown about, and by women too. Men KILL women who leave them, but they're not 'vindictive'; there's no \"hell hath no fury like a man scorned\" phrase. So tired. I'm so tired. England is a dump.\n\nI know this isn't exactly the worst thing that's ever happened. I'm aware that, in a vacuum, this would be overreacting; unfortunately, this isn't a vacuum - women are constantly ignored, left out of conversations, railroaded by MRAs and undefended by spineless centrists/liberals who pretend they're presenting a balanced view. Trying to give balanced coverage leads to Brexit. It leads to Trump. It leads to climate change. It leads to the hell we call Earth! \n\nAlso, on another note: TwoX keeps deleting my posts for no reason? Like, there's no reason. They just do it automatically. It's infuriating because, when you post, it doesn't keep the draft you saved. I've lost so many good posts because of this :( \n\nIf I was famous, I would make an online documentary where I go around to men who claim they’re trying to get custody. Of course, it would be self-selecting: the ones who don’t actually want custody won’t allow you to talk to them. However, I bet the ones who agree aren’t being allowed to see their children because they’re either not turning up to court, or because they’re dangerous. \n\nLastly, let’s imagine a woman is turning the child against their father.... And?!?! We ALL know how terrible men are. We ALL know the justice system will never keep us or the child safe. She’s justified to do that! \n\nMy dad keeps saying to my mum that I don’t hang around with him because she’s turned me against him. HaHAhahHahHahahaahahah... we live together. He never talks to me! He emotionally neglected me. He’s violent and always angry at nothing. I hate him because of his own actions. He is a living walking breathing example of men who blame women for their own behaviour.",
    "title": "I'm Furious - The Media is Built for Men, and They Don't Even See it!!!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1700031176,
    "score": 10,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I responded with this to r/askreddit on a question about “dirty little secret” Nurses and doctors have too many patients and the nurses are on the front  line to alert the doctor on important changes in patient condition. Ideally a nurse should have no more than 4 patients who are stable but VERY FREQUENTLY nurses will have 6 to 8 patients and in that mix there are very ill individuals. We URGE you to read r/nursing frequently to get a true flavor of the atrocious dangers you are ALL in if you are a patient in the hospital. The medical establishment is gaslighting you with the nice websites, music in the lobby, smiling calm staff but behind the curtain we are all scrambling to make sure we don’t make errors but with all the stress, long shifts ….people are most likely dying from nursing and doctor errors. Most are avoidable if we weren’t stretched so thin. The industry will say there aren’t enough nurses and that is partly true but we’ve been in many many situations where there can be safer staffing numbers. Coworkers calling the hospital offering to work and they are declined. \nUnfortunately, the medical system is all too focused on financials to pay BIG CEO and upper management salaries and they answer to their shareholders interests and NOT you the patients. It is a dangerous time to be a patient. \nAgain, I beg you all….in mass….educate yourselves buy reading the nurse’s comment on how scared they are. Anything marked “vent” is most likely a good read on a stressful and dangerous shift for a nurse.\n\nEdited to add: PLEASE….if you want to be heard go to r/askreddit and add your comments there. Give examples of the situations you have been in that put patient safety at risk. Speak up!!!!",
    "title": "I responded with this to r/askreddit on a question about “dirty little secret”",
    "subreddit": "nursing",
    "timestamp": 1694113898,
    "score": 108,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Considering A Career Change - Looking into an Accelerated Nursing Program 32 y/o M in Midwest\n\nI went to college because I was supposed to go to college. Wasn't sure what I was going to do after, but was pushed by my parents to get a degree. I wrestled in high school and was recruited to a D3 liberal arts school that is known for teaching critical thinking and entrepreneurship so figured I'd go there, try to learn a lot, then get into sales or something. I changed my mind and decided to get an English degree and be a high school English teacher/wrestling coach when I graduated. I graduated with honors and I taught/coached for a year before decided teaching wasn't for me. I had a bit of an existential crisis because I had no idea what to do next. I spent all this time and money to be a teacher and then quickly decided to not do that. My mom encouraged me to try nursing, but I didn't want to go back to school and spend more time and money on a degree and have the same thing happen. I decided to get a logistics sales job where a few friends already were doing well. I figured I would just do that until I figured out what was next.\n\n9 years later I am still at that job. I've done well for myself, making enough money to pay off all my and my wife's student loans. We own a beautiful house that we already have 60% equity in. I'm frugal and have saved up a lot. But I dread going to work everyday and doing something that isn't meaningful. Our CEO keeps telling us we need to find our \"why.\" I have no why at this soulless job.\n\nAbout 5 months ago my father had a pneumonectomy. While recovering he had a pulmonary embolism which caused cardiac arrest. Luckily he was in the ICU at the time and the were able to intubate him and put him on ECMO which saved his life. Unfortunately the road to recovery has been long and arduous. He was on ECMO for 55 days, most of which while unconcious. He was in the ICU for over two months and then transferred to PCU for a few days. He was then transferred to a LTAC facility for vent weaning. While at the LTAC, he had multiple issues that set us back and we had to eventually get him moved back to the ICU for infections we think were caused by bad care.\n\nWhile my dad was at the LTAC, we had a mixed bag of care. We had a few great nurses who taught us a lot about how to care for my dad. Unfortunately the LTAC was very understaffed and we would noticed sometimes he wasn't getting the care he needed. I started doing the job of the CNAs because they would never come around. I would noticed how different nurses did things differently, and noticed quickly how I could help in some cases. I also found myself catching mistakes made by some of the less competent staff. I fear some of these mistakes is what caused so many setbacks during my dad's 7 week stay there.\n\nLuckily my dad is doing a little better now. We are back in the PCU at the hospital he was at originally and are working to get him into a rehab for therapy as he has lost a lot of strength from being mostly bedridden for 5 months. I've still been helping a lot with the staff in PCU now, and feel a sense of pride when I can do simple tasks sometimes the staff struggles with--like placing a pulse oximeter probe when his staff can't figure it out and it is extremely easy for me to do things like move him around for them. The other night his RT didn't properly set up his vent and it quickly became an issue. When I called her back in the room she couldn't figure out what was wrong, yet when I told her what I thought was wrong and she tried what I suggested the issue quickly went away.\n\nI am no nursing savant, but I feel like I have a knack for helping people and problem solving. I feel like my \"why\" would be to prevent someone from being treated like my dad. I have a few friends and family that are in the field that tell me they think I could be a great nurse. A buddy just went through an accelerated BSN program and is now an ICU nurse. He says he thinks I would do great in the same program. I know going through an accelerated program would be tough, but I am really considering it.\n\nBefore I take this massive step, I wanted to hear what yall think of the profession. What are the joys of the job that you still enjoy years after entering the field? What has made you want to quit? Are how many ABSN folks are out there that can weigh in on that track?\n\n\\_\\_\\_\\_\n\nTL;DR -- I am considering going back to school to get a nursing degree after graduating with a degree in English a decade ago. Before I make that decision, what would you tell me that is encouraging about the profession? Also, why should I be hesitant to making this life altering decision?",
    "title": "Considering A Career Change - Looking into an Accelerated Nursing Program",
    "subreddit": "nursing",
    "timestamp": 1687733565,
    "score": 4,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Saying \"Catch a Bubble\" is now racist... At least according to my school's admin. A bunch of Kindergarten and first grade teachers were told that in a meeting. The teachers were completely confused because they've been saying it for years and asked for an explanation, but of course admin was not able to explain any of their reasoning behind it. One teacher (white woman) was specifically told that she \"doesn't understand the culture of the children (title one school, mostly African American)\" to which she reminded them that she is engaged to a black man and has a mixed race child. They didn't respond to that either and basically the teachers were told if they are ever heard saying it again, they would be fired. \n\nI tried searching this claim and found something about how it's equivalent to telling kids to \"shut up\", but even that seems like a stretch. Nothing about how it's racist. \n\nAnyone else ever heard this?\n\nEDIT:\nTo clarify: I don't think it's racist. I'm just curious if anyone has dealt with something similar with that phrase or another management skill with their admins trying to be \"white saviors\". Also can't believe that of all the issues my school should be dealing with, this seems to be the focus right now. We literally had a child bring bullets into the building last week and that's being completely covered up.",
    "title": "Saying \"Catch a Bubble\" is now racist...",
    "subreddit": "Teachers",
    "timestamp": 1697473897,
    "score": 3981,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I was dress coded. Please advise. I, 19f, am a first year student teacher at a middle school. I was wearing a black high-neck body suit with black slacks from old navy. During planning, my mentor teacher told me that a male AP said that I was dressed “inappropriately” and that I need to wear looser clothes. My mentor teacher pointed out that she didn’t find anything wrong with my outfit but she just wanted to let me know. I immediately felt so embarrassed and uncomfortable because I put effort into dressing professionally and I felt like I was being singled out because many of the female teachers wear the same outfit and even more form fitting clothes than what I wore. My personal thought is the AP said something because my butt is big. I cannot control that. Even when I wear my baggy cargos to this school, my butt still pokes out. I just feel weird & targeted honestly. Please tell me if I’m wrong. Thanks.\n\nEdits for clarification:\n\n1. The high-neck bodysuit also has sleeves so no shoulders were out. The bodysuit just looks like a tucked in shirt, honestly. The reason I stated that I believe the AP made the comment specifically about my booty was bc I have a very small chest & my chest has never been a point of attention for me. However, my small waist & large butt combo has always been a point of attention no matter what I wear. \n\n2. I am able to student teach at 19 bc I earned high school credits in middle school due to being on the accelerated track + I dual enrolled during the pandemic, earning most of my freshman & sophomore credits for college before I even graduated hs. Lastly, I graduated hs a semester early. \n\n3. Yes I am in the USA.\n\n4. I am mixed race: Black, White, & Native American.",
    "title": "I was dress coded. Please advise.",
    "subreddit": "Teachers",
    "timestamp": 1695665653,
    "score": 2674,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation I thought Matt Yglesias' post today about the failure of teacher evaluation/pay as a policy over the past 15 years, would interest some here. It's from his substack which has a paywall for most posts, but I thought it would be reasonable to put the text in here, maybe he'll get a new subscriber or two. If you want to see the whole thing with the charts/graphs and hypertext links, check it out over there.\n\n&#x200B;\n\n[https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped](https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped)\n\n&#x200B;\n\n**Why teacher evaluation reforms flopped:The strange death of education reform, Part V**\n\nBy Matt Yglesias\n\n&#x200B;\n\n\\[This is part five of an ongoing series. Check out part one on the nature of the education reform movement, part two on the rise and fall of the achievement gap, part three on the successes and failures of charter schools, and part four on the right’s embrace of unregulated privatization.\\]\n\nI can’t believe I’ve gone this far in the series without discussing what was probably the single most important component of Obama-era Education Reform: the large-scale effort to shift teacher compensation and teacher evaluation from a system that was very focused on seniority and credentials to one focused on teachers’ measured ability to generate learning gains for students.\n\nObama was not only convinced by this strategy on the merits, but his administration was also empowered in a very unusual way to implement this change.\n\nThis was in part thanks to the Great Recession, which left state and local governments short on money and the macroeconomy in need of fiscal stimulus. The American Recovery and Reinvestment Act allocated money for a grant program called “Race to the Top” that, instead of giving federal money to school systems based on some formula, granted funds based on the extent to which schools implemented Department of Education-approved reforms. It was also in part a somewhat peculiar legacy of the original No Child Left Behind law, which deliberately gave states unrealistic proficiency targets and required non-compliant states to obtain “waivers” from the federal Department of Education.\n\nThe nexus of RTTT and the NCLB waivers gave Arne Duncan unusual influence over K-12 policy (which is typically more of a state and local matter), and Obama empowered Duncan to wield that influence fairly aggressively — especially to push states to adopt quantitative teacher evaluation systems.\n\nThis was politically dicey. Teachers unions hated it, and while rank-and-file Democrats never turned on Obama over his advocacy for this idea, the dispute drove a lot of intra-party tension and organizing. A lot of people who are today firmly anchored in the progressive wing of the Democratic Party don’t realize (or don’t remember) that downstream disputes about teacher evaluation 10 to 15 years ago were the genesis of so much factionalism, but they were. At the same time, while this cause had a degree of bipartisan support, it wasn’t really something Republicans or the conservative movement leapt to give Obama credit for. Rather than right-of-center people praising Obama for taking on the unions, conservatives generally negative-polarized away from their belief in the reform project, leading to today’s revived interest in vouchers.\n\nIf it had all worked out as intended, we would today see this as a major pillar of the Obama legacy — ARRA might not have been large enough to fully close the output gap, but it was large enough to drive systematic and beneficial change in American education.\n\nThe unfortunate reality though is that while there are some teacher evaluation success stories, these reforms did not on the whole generate great results. The upshot is that a ton of political capital was poured into something that didn’t work, the energy for reform dissipated, and a tremendous opportunity was lost.\n\n**The 10,000-foot case for evaluation reform**\n\nAs I’ve argued before, in politics it’s really helpful to be right about everything all the time. Unfortunately, Obama and his allies were wrong about this, and I was, too. The upside, though, is that I feel like I can describe pretty clearly what the reformers were thinking.\n\nThe basic point is that when it comes to setting teachers’ salaries (or deciding who gets laid off during a budget crisis), you have to pick some system. You could pay everyone the exact same amount (or do layoffs randomly), but that would still be a choice. And I think paying every teacher the exact same amount would probably be a mistake. Instead, districts typically pay teachers based on seniority, with extra pay based on their possession of graduate degrees. Because of the way pension and health benefits work, a veteran teacher is more expensive to have on the payroll than a rookie, even if their salaries are identical. So in practice, the system is even more weighted toward seniority than the salary schedule alone would suggest. Meanwhile, many systems operate on a “last in, first out” system for layoffs, meaning the most junior teachers are the ones who have to go in the event of a budget crisis.\n\nYou can model this as just union clout, but I think many who support this system have a good-faith belief that seniority serves as a rough proxy for teacher skill. That’s even clearer for the graduate degrees — giving people extra comp for extra credentials makes no sense unless you think the credentials are a good proxy for quality.\n\nIn reality, though, seniority is a pretty weak proxy for quality. In a very influential paper published in 2006 by the Hamilton Project at Brookings, Robert Gordon, Thomas Kane, and Douglas Staiger argued that the positive impact of experience on performance plateaus fairly rapidly.\n\nThe research on paying teachers extra for getting Master of Education degrees is, if anything, much clearer — these degrees do not help teachers become more effective, in part because the incentives are obviously screwy. Teachers are strongly incentivized to get the degrees whether or not the degrees are valuable, so universities compete in the marketplace to make the degrees as easy to obtain as possible. And as any teacher could tell you, that is not a good way to teach anything useful to anyone.\n\nThat’s what made the idea of switching to a system that emphasizes measured effectiveness so compelling.\n\nIs it straightforward to measure what makes a great teacher? Of course not. Are there problems and shortcomings with value-added measures based on test scores? Sure. At the same time, a highly imperfect proxy still seems much better than a proxy that definitely doesn’t work well, like seniority. And the master’s degree thing is worse than useless — the teacher ends up with less than 100 percent of the raise because some of the money goes to pay off the student loans that financed the useless degree.\n\nSurely we can do better than this.\n\n**It’s hard to do better**\n\nI think that we can, in fact, do better, and the teacher pay reforms that Washington, D.C. enacted during this era have had some clear benefits.\n\nBut in terms of the big national push for compensation reforms, the news is bad. That’s the conclusion of a recent and convincing paper co-authored by Joshua Bleiberg, Eric Brunner, Erica Harbatkin, Matthew Kraft, and Matthew Springer:\n\n\"Federal incentives and requirements under the Obama administration spurred states to adopt major reforms to their teacher evaluation systems. We examine the effects of these reforms on student achievement and attainment at a national scale by exploiting the staggered timing of implementation across states. We find precisely estimated null effects, on average, that rule out impacts as small as 0.015 standard deviation for achievement and 1 percentage point for high school graduation and college enrollment. We also find little evidence that the effect of teacher evaluation reforms varied by system design rigor, specific design features or student and district characteristics. We highlight five factors that may have undercut the efficacy of teacher evaluation reforms at scale: political opposition, the decentralized structure of U.S. public education, capacity constraints, limited generalizability, and the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security.\"\n\nI really like this paper because it not only presents a provocative result but offers a good explanation for what went wrong. Federal officials saw local reforms that seemed to be producing good results and decided to create a financial structure whereby the federal government would try, via the states, to make localities adopt similar reforms.\n\nBut not only do education interventions in general have an annoying habit of failing to work at a large scale, but this particular effort was beset by huge problems of political implementation.\n\nLots of the state-level politicians thought these evaluation systems were a good idea, of course. But the marginal elected official in these jurisdictions often didn’t think this was a particularly good idea, and only went along with it because they wanted the RTTT money. That meant there wasn’t a strong state-level political coalition that really wanted to overhaul the teacher personnel system. And this was atop another implementation layer of school boards (or occasionally mayors) who almost certainly didn’t want to change things. This then filtered down to another layer of implementation where principals were suddenly dealing with teachers who didn’t like being subjected to a new evaluation framework. Meanwhile, a range of actual practitioners (including some fervent reformers) has emphasized to me that reformers at the time tended to ignore the fact that most principals in schools with challenges really, really hate needing to fill vacancies. There isn’t some huge line of skilled teachers looking to take jobs in high-poverty schools.\n\nThe last line in the quote above about “the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security” is really important in my opinion.\n\nA key linchpin of the D.C. merit pay efforts is that average compensation went up by a large amount — and is only partially undermined by the high cost of D.C. housing. Every teacher, every year, needs to make a choice between “keep teaching” and “change careers.” The goal of compensation reform is to make the above-average teachers marginally more likely to keep teaching and the below-average teachers marginally more likely to change careers. But if teachers on average find the assessment process annoying and the reduction of job security troubling, then you’re making retention of average teachers harder and undermining the whole process.\n\n**Revisiting the original recommendations**\n\nThe Gordon/Kane/Staiger paper I mentioned earlier was very influential on my thinking. And it’s not just me. The Hamilton Project, in the late Bush years, played a major role in developing the policy agenda of what would turn out to be the Obama administration. Then-Senator Obama was even a featured speaker at Hamilton’s launch.\n\nI think it’s fair to say that the paper wasn’t just one of the research documents that supported the Obama administration’s approach; it was, in a sense, the intellectual blueprint for the whole thing.\n\nStill, it’s worth saying that this policy agenda was conceived during a different set of circumstances than those under which Obama became president. He says in the talk above that “when you keep the deficit low and our debt out of the hands of foreign nations, then we can all win,” and the policy panel that followed really focused on deficit reduction. Democrats in the mid-Bush era were not expecting the Great Recession, a huge collapse in aggregate demand, soaring unemployment, and ultra-low interest rates. They believed the Bush policy mix of tax cuts, wars, and Medicare expansion was unsustainable and that it would fall on them to replace it with something more responsible. By the same token, Obama name-checks Gordon as one of the Hamilton people “I have stolen ideas from liberally.” But Gordon’s paper does not propose using federal stimulus funds to try to strong-arm states into changing teacher evaluation policies, in part because the whole idea of doing a big federal stimulus wasn’t on the radar.\n\nWhat they wanted the federal government to do instead was pick up the tab for “up to ten states” to create a system that would offer bonus pay to highly effective teachers who were willing to work in high-poverty schools while denying tenure to highly ineffective teachers.\n\nThat’s similar enough to RTTT that you can see how one idea became the other. But it’s also genuinely different — Gordon proposed, essentially, a subsidy to a handful of states whose political leaders were genuinely enthusiastic about reform, with the reform in question designed to take nothing away from veteran teachers. It’s a policy change that is designed to generate a much higher level of top-to-bottom alignment, from teachers to principals to district leaders to state-level politicians. The hope, obviously, was that the reforms would prove to be a huge success, which would generate pressure for further adoption.\n\nThe other important plank of Gordon/Kane/Staiger was reducing barriers to entry in teaching. They cite data indicating that while traditionally certified teachers are better on average than uncertified ones, the difference is small with plenty of overlap. The idea was that by pairing certification reform with tenure reform, you’d cycle through more cohorts of rookie teachers faster, weed out the least-effective ones, and over time raise average teacher quality. And you could achieve that without doing anything negative from the standpoint of veteran teachers.\n\nBecause of the Great Recession, we ended up in a situation where districts weren’t hiring new teachers or creating new bonus programs. There was instead a lot of emphasis on using effectiveness evaluations to structure layoffs, which makes sense conceptually but is a clear and present danger to veteran teachers, and the point of RTTP was to tempt jurisdictions that didn’t particularly want to do compensation reform to do it anyway.\n\nI think the hope was that this would bring reform to scale much faster.\n\nInstead, it generated tons of ill will while creating a very strong socio-psychological connection between the evaluation movement and a period of severe education austerity in which budgets were slashed, jobs were lost, and inflation-adjusted salaries fell. And it was from within the union backlash milieu that we first started hearing from Ibram X. Kendi that the idea that an achievement gap exists is racist and that we can’t try to evaluate teachers based on student test performance because standardized testing is also racist.\n\n**Pitfalls of change**\n\nAs I mentioned above, I was a true believer in this particular reform idea.\n\nAnd I still believe that the 10,000-foot version of it is correct. If anything, I’m more focused than ever on the role that screwy compensation practices play in supporting rent-seeking graduate schools of education and in incentivizing them to operate as highly ideological enemies of sound social science and pedagogy. One potentially promising compensation reform proposal is to simply eliminate all new graduate degree bumps on a forward-looking basis and plow the savings into higher base pay across the board. This would have only minor educational benefits, but down the road it would have good political economy benefits.\n\nMore broadly, though, my thinking about the other great municipal workforce — cops — is greatly shaped by my understanding of what did and didn’t work here.\n\nMy points about the spatial misallocation of police officers are directly parallel to the Gordon/Kane/Staiger points about the utility of paying bonuses for highly effective teachers who are willing to take on the most difficult assignments. The discourse about “merit pay” flew off in a different direction, but the basic idea was never intended to be anti-teacher — it’s simply harder to teach classrooms full of kids who are dealing with a lot in their lives and whose parents are less likely to have the bandwidth or the financial resources to participate actively in their education. But the system as a whole does not serve its intended goals if valued teachers all self-select out of those assignments, leaving the toughest jobs to a mix of rookies, idealists, and people who’ve washed out of other schools.\n\nSimilarly, whether you’re talking about cops or teachers, if you want to hold people to a higher standard you need to be willing to spend money on higher pay and to think hard about recruiting pipelines.\n\nThe next, and probably final, entry in this series will focus on something that, based on the arc of ed reform, I am both hopeful and concerned about: I’m inclined to support the new wave of enthusiasm for phonics and “the science of reading,” but I also worry it will turn out to be another example of something that’s hard to bring to scale in a decentralized system.",
    "title": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation",
    "subreddit": "Teachers",
    "timestamp": 1684956059,
    "score": 5,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Book recommendations on equity? (US-based, ESL teacher) I'm planning to work as an ESL teacher in the US in 2024 after having taught abroad for many years.\n\nI'm planning to apply to a Transition to Teaching fellowship.  A major theme of the fellowship is equity and diversity.\n\nFull disclosure, I'm a white male living in an Asian country in a city where over 99.9% of people are of the local ethnicity.  There essentially is no ethnic diversity.  Virtually everyone I would come into contact with is also roughly middle class (there are nearly no truly rich people here and the government takes pretty good care of poorer families).\n\nSo I am not exactly the expert on equity in education or diversity, unless you can count the fact that I have been a racial minority for nearly half my life here and have a mixed-race family.\n\nI'd like to broaden my understanding of the situation in the States.  I also believe that being an ESL teacher puts me in a unique position because I will not be working with the general student population.  My students will not necessarily represent the ethnic/income situation of the school/population at large.\n\nDo you have any book recommendations for someone in my position?  I feel this is one area that I should really learn more about.\n\nThank you!",
    "title": "Book recommendations on equity? (US-based, ESL teacher)",
    "subreddit": "Teachers",
    "timestamp": 1693536505,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "If things don't change soon this country might not survive the next decade. America is centuries behind the rest of the world when it comes to workers rights. We have put up with this nonsense time and time again. we continue on and on with this neo-slavery model of the rat race. Humans are no longer longer seen as humans with emotions, differences, aspirations, character, families and community's but rather a tool for corporations to exploit. America is designed to make you go crazy. It may not be now, it may not be 20 years from now. But if you continue to put up with the 80 hour week model a lot of us endure you will go crazy at some point.\n\nThe most minuscule medical diagnosis could set you back thousands of dollars. It is at this stage you realize the hospital is not your friend. At your weakest moment you will be given a bill which will mean you will have to put extra hours in at the office. So you finally graduate school, and you think your position in life will finally change but again...you are handed a bill which of course means you will have to put in extra hours at the office.\n\nSo decades pass and you think you finally see the light at the end of the tunnel but suddenly your rent goes up by a few hundred dollars. You must yet again...put more hours...in...the....office.\n\nNo matter how much you work no matter how hard you try the slightest inconvenience or mistake can set you back years if not decades. The American dream of vast acres of land to be explored and tamed to your liking is over. If you are lucky you will be able to sign up for a 30 year loan with 5% interest rates on a 500,000 dollar home somewhere moderately safe. But most of us will have to settle with room mates and the unlucky ones might have to sleep in their car or a motel. We have an entire generation of men, woman, and children with almost zero stability from month to month. Our future is uncertain and we are at the mercy of those with more power, more resources and more connections. \n\nIt is the equivalent of joining a game of monopoly at the tail end of the game and being told \"Pull yourself up by the bootstraps! You can win if you just put your mind to it!\" Those that are very lucky might be able to buy a plot or two but the vast majority of us will go completely bankrupt with nothing to show for it...just as the game intended. \n\nAnother thing that people forget is that as we dedicate more and more of our lives to our jobs the less social, family and community ties we will have. Hanging out with friends becomes increasingly more difficult. setting aside time for a family event becomes impossible. Having time to meet your neighbors or spending a few minutes to chat with people in your community becomes a chore. A lot of us are simply hanging by a thread if hanging by anything at all. Every second counts in todays world of hustle culture. You spend 8 hours sleeping in preparation for work in the morning. Then you spend a further hour in the morning preparing yourself for work. Then you spend another hour driving to work. Then you spend a further 8 or more hours at work. then another hour driving home in high stress rush hour traffic. If you are lucky you might get a couple of hours at the end of your day to do as you please. But in the end you will never really enjoy it because in the back of your mind you know you are going to have to go through the same anxiety riddled scenario the very next day. \n\nIn an ideal world people wouldn't fear waking up in the morning. People would look up to their boss as a leader and the worker would be comfortable traveling from point A to point B without fearing death. Commuting to work should be paid by the company you are working for. If they cannot afford to transport workers to their job then they should be paying enough taxes to build the appropriate public transportation.  America has become Disney Land for the rich and an open air prison for the poor. You have to pay 2000 dollars or more for a drivable car just to get to work when that money could go to a stable non stress inducing transportation system. Nearly 70 percent of drivers have driving anxiety. Why is so much of our life dedicated to something that makes us scared and fearful? Humans weren't meant to drive 2 ton vehicles going 70 miles per hour. For those of us that do not feel comfortable doing so there should be alternate options. People that are incapable of driving shouldn't be cut off from the rest of their community and forced to walk hours at a time to get needed jobs/services. If you live in Michigan you would know it is a city built for cars, not people and it is a nerve wrecking nightmare. The only construction that is taking place here is for cars never for humans. The roads are also undrivable filled with massive potholes that can disintegrate your car in an instant, and you will have to spend thousands on maintenance. so yeah...fun right?\n\nI do not know how much longer the American worker will continue to take these unfair conditions. Most people do not have anyone to talk to because we have dedicated our lives to work instead of each other. There should be a 25 dollar minimum wage to compensate for all the things I just mentioned. Workers should not be spending half their income on housing and the other half on transportation. We need to start demanding those in charge start designing a livable society that doesn't require being in the top 1 percent to enjoy. How has our standard of living fallen so far since the 50's...I'll tell you why. Mismanagement, inequality, bad planning and corporate greed. Why should the people in charge care about the roads when they can just use their 2 million dollar helicopter to  take them to their 8th mega mansion? Meanwhile the ones that work under them are walking tens of miles to work because unfortunately owning a car is becoming increasingly unaffordable to many.\n\nThe commoners have had enough. Mental wellbeing is at an all time low. You can not have a functioning society with this many problems being swept under the rug. This is the first time in American history the new generation will grow up poorer than the old generation. Wealth is usually passed on but this time there just isn't anything left to pass on... The only positive thing I can say about what is happening here is that it may be a lesson for future generations to prevent this from ever happening again. People are just starting to wise up to the absolute chaos that is this so called \"economy\" that slowly sucks the life out of you day by day and you are expected to sell a piece of your soul every time you head in to work. So enjoy your freedom. The freedom to be at the mercy of your boss. The freedom to be at the mercy of your landlord. The freedom to go bankrupt at the slightest medical inconvenience. The freedom to drive a 2 ton vehicle on highly convoluted and overcrowded roads. The freedom to lease your labor to a corporation and never own your own creations. The freedom to be paid an unlivable wage that guarantees poverty. The freedom to give up family, friendships and community in favor of meeting deadlines. The freedom to pay exorbitant bills to multi billion dollar companies that see you as a resource. The freedom to delay retirement a few decades because you have been working your whole life and still own nothing. The freedom to \"buy\" a house by signing a 30 year loan. The freedom to go to school and be buried in student loan debt. The freedom to work your entire life for a company expecting a promotion just for them to replace you with a robot at the drop of a hat. The American dream is just that a dream. It's time to enter the real world and address the problems we have been ignoring since the 60's\n\n1. Provided food and housing for all that work full time (No one should be working and homeless)\n2. Safe, accessible, and low cost public transportation for morning commutes. (People should not be forced to drive just to go to their local grocery store)\n3. Equal distribution of corporate resources/profits amongst the workers.  (Workers should each be given a percentage of the profits made by a corporation. Workers should not be doing all the work and be given a tiny percentile of profits)\n4. Public healthcare system that is affordable (Anyone who is working should be able to be healthy while they work. No one should be working while unable to afford care for their bodies)\n5. A realistic and fair way to achieve the American dream (Start family/House/College)\n6. Give all workers a voice in their company's. (Democratize work force. Everyone gets to vote, disagree, or agree to workforce policies)\n7. Minimum wage of 25 dollars an hour adjusted each year for inflation ( Every year workers will be paid a livable wage no one should be working 10 dollars an hour while their CEO is making 10 million)\n8. Better safety protocols in the workplace (People shouldn't put their health/safety at risk just to meet insane quotas)\n9. Guaranteed vacation for at least 1 month out of the year. (We should be working to live not living to work)\n10. Transparent hiring practices (The current method of hiring is shameful and disgraceful to the worker. No one should have to show up to 5 interviews and take 2 hour long test just to not even land the job. Hiring should be transparent for the applicant. If you are denied for \"Having too much experience\" or \"Not having enough experience\" The employer must compensate you for wasted time. This will give more of an incentive for companies to actually hire applicants rather than just waste 100 applicants time just to hire no one. The requirements for the position should be listed beforehand and if the applicant meets all those requirements and still isn't hired the employer should give reasons why. If they can't give a valid reason they should compensate you for wasted time. The current job market has completely alienated job seekers. it's time to put an end to companies lying about high wages to applicants on the job flyer just for them to show up to an interview and being told they would only be paid 8 dollars an hour. In a fair market this would be seen as fraud and false advertising. But because we care so little about workers companies are allowed to get away with this unbelievable behavior. And they wonder why no one wants to work?)\n\nThat is it. I hope that some of you took in what I have said. After years of suffering on dirt poor wages and living in the rat race I am finally starting to see it for what is really is. A scam. Everything is designed to funnel money out of the workers pockets, pull the roof from over the workers head, and take food out of the workers mouth. If you think working will make you happy you haven't been paying attention for the last 50 years. The worker is being hit from all sides and it is up to us to stand up as a class and say enough is enough. The alternative is to keep living as indentured servants to your chosen bank or corporation. Is that truly a life you'd like to live? To die of old age knowing you wasted so much on so little? At your final moments you look back on all the years wasted trying to keep up with the never ending expectations and demands put on you by our unequal economy. Having the rug pulled right from under you before your last breath. You realize it was all a scam. The American dream is just a dream. All the real world experiences you missed out on to chase the imaginary label of \"success\" but at the cost of your fulfillment, wellbeing and mental stability. Your boss doesn't show up to your funeral. Neither does your land lord, manager, banker, insurance agent, CEO, bill collector, etc. The only ones that show up is your friends and family that you've been ignoring all your life, chasing a lie. You are buried shortly after and the company that you worked for, for 50 years quickly replaces you with no mention of your disappearance. Ready to start the process all over again with the next sucker. The exploiters laugh knowing that you died owning nothing all while their wealth expanded exponentially. This is a fair system... but only to those at the top of the scheme. And you let them do it.",
    "title": "If things don't change soon this country might not survive the next decade.",
    "subreddit": "WorkReform",
    "timestamp": 1678521369,
    "score": 114,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Don't accept being just a number.       Treat them the same. They want to treat me like a number? Well thats fine! I will treat them like a check. Go to work do my job description and go home. No more kissing ass. If your job doesn't pay you enough call them out. If they refuse to pay well then quit right there on the spot. No 2 weeks notice thats only for people who can pay their workers enough to survive the next two weeks working at a job. When your wages are so low half the staff sleeps in their car you are a sociopathic exploiter that doesn't deserve to own a business.\n\n        If rent prices within 50 miles of the job cite cost 3000 a month minimum and your job pays you only 1500 a month that job is knowingly putting you through hardship while they at the same time hand their CEO a 10 million dollar bonus. The fact that there is still a large segment of society that is against pay increases, unions and affordable housing and transit is outright infuriating. people at this very moment are getting off work and dont know where they are going to sleep tonight. Some people don't know if they are going to be able to pay this months rent because their employer cut their hours. Everything is said to be on the up and up but never before has their been so many people so held down by an economy that feeds off their labor then spits them out into the wretched world of poverty only to be cared about when the wheel stops spinning and the rat finally abandons the pointless race. The alternative to stable wages and living conditions is a complete boycott of the economy in its entirity. \n\nI refuse to pay 1000 dollars to live in a 300 sq ft apartment with 3 other people. I refuse to work 80 hours a week and still have to skip meals. I refuse to dedicate my life to a company that barely sees me as a human being but as a biological robot that has to do whatever i am told. I refuse to put my life on the backburner and the needs of senseless productivity first. I refuse to lose friends and family because of overwork and exhaustion. I refuse to forgo my right to start a family, have steady relationships and friends in order to maintain my status in the corporate world. I demand fair living wages and fair hours anything less than that should be seen as an insult to the workers true self. \n\nNo more exploitation or indignation we need workplace reciprocation, mass wealth repatriation in this precious nation mandatory vacations, all we do is work yet mass starvation we also need public transportation how about a train station im sick of traffic my head aching, money we chasing but i fill up my pump and there goes my savings.",
    "title": "Don't accept being just a number.",
    "subreddit": "WorkReform",
    "timestamp": 1675823166,
    "score": 8,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Liking what you do x Better compensation \nTL/DR: I'm expecting a job offer in a couple of days that potentially can give me good salary bump but for a role more boring that I have today. \n\nI've been in my company for about 5 years and it is getting harder to have meaningful compensation reviews. I applied for a new job to focus on better comp but I believe I will get bored really easy. How to define if I should focus on money or liking what I do?\n\nHere are some aspects to help with the comparison:\n\nTotal comp: I am expecting a 20% raise in the new role and even though I didn't get the offer it looks like they will match that. The new offer will be sent next week but my current comp is about to be reviewed this or next month. I already mentioned to my manager that I'm expecting a salary review since I'm having great impact in the team and had a lot of good feedback but I expect something around 5-10%. Also bonuses are better defined in the new role.\n\nBenefits: I'm not sure yet about the new offer but the ones I have today are quite average and I might have room to negotiate better ones in the new role. \n\nRole: My current role is a mix of sales, customer success and strategic product development. I like what I do but I find the customer support/training part quite tedious. The new role will focus more on the parts I think are boring and also I won't have as much impact in the strategy of the team as I do today. \n\nCareer progression: I currently report to the CEO of my company and my career path is a bit unclear. However, the product we are building is growing and we are seeing a lot of interest in the market and from potential buyers/investors. I have some stock options and eventhough we are not actively looking for investors it looks like in an year or two we will have some investing opportunities which might lead to salary bumps and more important roles. The new role is in an older company that have more stablished processes and it has a more standard career progression, less start-up-y. \n\nHybrid work: My current company has a hybrid situation that I quite like and the new role will allow for even more flexibility. However, I plan to move to a situation where I would work 3mo abroad per year and the new role already let me know it would be possible. Haven't discussed this with my current manager but I know they won't like it eventhough it is a possibility as other people have similar arrangements. This is a big thing for me as it has some personal aspects involved. \n\nInternational trips: I currently do a couple of international trips per year that are quite interesting but of intense work. It's a good way to visit new places without paying and I won't have that in the new role.\n\nEmotional: I love the product we are creating and I want to see it grow and be a part of it. I fear the FOMO I might have if I leave now, since we are in a steady grow stage. It has a potential to disrupt the industry we are in and we already reached some interesting benchmarks of SaaS products, proving the potential of it. I could even keep using the product if decide to leave, make some extra money on the side and keep the relationship going, but with way less impact.\n\nI thought about using the new offer as leverage to negotiate my salary but I fear it might jeopardize the relationship I have with the CEO and it is a hard conversation to have. \n\nI appreciate any advice! \n\nCheers",
    "title": "Liking what you do x Better compensation",
    "subreddit": "WorkReform",
    "timestamp": 1684536729,
    "score": 7,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I got a talking to by the CEO for WHAT? TLDR: CEO gave me a minor talking to for NOT bringing homemade cookies when I visited the southern office.\n\nSo I'm in IT but I enjoy baking for fun and friends. So for holiday parties or just because I felt like it I'd randomly bring in my Great grandma's chocolate chip cookies (that I made but her recipe.) Not often, only a couple times a year, 5 on the extreme end.\n\nEveryone LOVES them even people who claim to not like cookies normally.  \n\nRandomly my job sends me to the southern office and I'd randomly bring them cookies as well when I got there. Well apparently I didn't do it the last two trips and someone in the southern office felt this warrented a complaint to the CEO since this hurt their feeling!  Now granted this is a sub 50 person company and the CEO has an open door policy. But comeon really?  \n\nSo the CEO tells me that people complained last time that I was down there that I didn't bring them cookies and I needed to make it right next trip.  WHAT THE BLAZES! \n\nI can't be the only one who thinks this is crazy petty and disappointed both in my southern coworkers and in the CEO that he didn't tell them to just be thankful when I do bring them.\n\nI'm not going to disobey the CEO, but you better bet that I'm going to be mixing and baking them on company time now. I was ordered to make them by the CEO so it's Buisness time now. \n\nThoughts on if this is crazy or not?\n\nEdit: For clarity it wasn't a write up or anything, but his tone was a cross between annoyance that he had to deal with this and wanting me to make it go away, and unbelief that he had to deal with this in the first place.  Not his joking/teasing tone. That tone is very distinctive.\n\nEdit 2: correcting autocorrect.\n\nUpdate: Man this blew up!  So a couple of things to clarify from the comments and an update.\n\n1. I'm male, for those who find that weird Gordon Ramsay would like a word with you.  Also the deer on my wall at home don't care. \n2. The southern office is in the southern part of a northern state and we're in the northern part of the same state so we call it the southern office.  So all the true southerners are off the hook.\n3. The CEO is technically out of both offices but primarily out of the northern office.  This was apparently caused by a southern office coworker who he won't name assuming that the northern office got the cookies all the time and this got their feeling hurt that they didn't so they decided to complain to the CEO that I wasnt being fair in my cookie distribution and that I was insulting the southern office by not bringing them.... \n\nI almost wish my imagination was good enough to make this up.\n\nUpdate: So I told my immediate supervisor about this, this morning and his response was about this, \"I wish I couldn't so easily believe that the southern office could be that petty but I can.  Well if the CEO wants you to make cookies you're making cookies. If he doesn't like it then he should have stood up for IT against this stupid pettiness.\"\n\n\nFinal update:  Oh man did this blow up WAY more than I expected. I appreciate everyone's advice. Some more than others.  \n\nTo those who took the time to phrase things professionally, you have my thanks for ideas on how to say it.\n\nTo those who suggested adding extra to the cookies or intentionally messing them up.  Ya no, I'm not disrespecting Great Grandma's cookies like that.  \n\nMy immediate supervisor is, irritated shall we say, with the southern office but more irritated with the CEO for not cutting it off at the source.  (Apparently word of the complaints reached him after I told him from a different source.) So he's onboard with me making them on company time.  Just irritated with everyone EXCEPT me and agrees with me that this whole thing is stupid.\n\nThe irony is I was already planning to make a batch for the southern office for my trip next month, AND I ALREADY had finished dough in the freezer for a northern office batch. \n\nI'm thinking this'll be my last batch and when people ask I'll let them know that the southern office complained so I stopped baking for both so no one has anything to complain over. \n\nYes it'll cause some minor office drama, but it'll be against the southern office generally and not me for as others have said, \"ruining a good thing by complaining.\" \n\nTo those who found this hilarious, I suspect that once I have some distance from this I'll agree with you.\n\nThank you to everyone and I hope you all have a great rest of your week and may any discussions with your CEOS be smoother than mine and drama free!\n\nFinal final update!  I mean it!\n\nNo I'm not going to share the recipe. It's Great grandma's recipe. Not even my girlfriend gets the recipe until the I dos have been said.",
    "title": "I got a talking to by the CEO for WHAT?",
    "subreddit": "careerguidance",
    "timestamp": 1689728944,
    "score": 1687,
    "keyword": "mixed race ceo"
  },
  {
    "text": "How to get back on the horse after a (really) messy career failure? I am 32M and am trying to recover my career after a painful failure.  (I have changed some details in the following the but the overall picture should be clear enough.) \n\nI was a high achiever at school and university (Oxbridge, arts) but after graduating I didn’t follow the corporate path (IB/consulting) and fell into working as a contract software engineer/tech consultant.\n\nAvoiding names but I worked freelance for a couple of years at a mid tier agency network (not exactly McKinsey but I work on a few blue chip client projects) then moved abroad to help a colleague set up a new team at a well known local online portal. Moved back home after 2 years and worked at another agency group.\n\nBy this point I was 26 earning very highly and pretty chuffed with myself.  I accepted a leadership role at a startup led by a high profile wealthy CEO.  I thought this was my big break.  \n\nThe first two years were things were fine and/or I was delusional enough to ignore the warning signs.  I worked hard and achieved what I could with zero resources.  The promised profit share never materialised, and nor regularly did our salaries as the company struggled for cash.\n\nAfter 2 years I was ready to throw in the towel but COVID hit, and hit me personally particularly hard.  I had suffered from depression previously and struggled badly with lockdowns in the UK. Add to the mix that I had a girlfriend at the time who was classified as vulnerable and suffered from extreme health anxiety, and it was about the worst possible time to look for a new job.  Discounting the (essentially worthless) shares and non-existent profit share, I was earning about 50% of my old income, but I was at least (mostly) get paid, and the workload was minimal so I sat on my hands for the COVID era and waited it out.\n\nPost-COVID, there was a glimmer of hope, the CEO agreed to a large capital raise and take the company in a new direction.  I was given a pay rise to match my old rate and and a central role in the fundraising and decided I may as well give it a final push.\n\nSince then, things have gone from bad to worse.  The pay rise I was supposed to get has been “temporarily” on hold for 2 years, bonuses were promised and never materialised, and I’m now owed a very substantial amount of money which I have little hope of recovering. The company has descended into a chaotic mess of increasingly desperate and unfocused “initiatives”/get rich quick schemes. No one trusts anyone or cares about their work.  One of the team (of 8) literally died. \n\nMaybe worst of all, *it’s rubbed off on me*. I used to consider myself rigorous, diligent and hardworking but I feel like I have become lazy and complacent, my standards have dropped to the floor, my work ethic is nonexistent, and my professional knowledge is hazy and 5 years out of date. \n\nMy friends and peers have progressed to senior roles and got VC funding to start businesses off the back of their success. Meanwhile I’ve spent the past 2 years kind of sleepwalking, helping out with a friend’s small local business while I waited for something to happen and I don’t know where the time has gone. I moved back in with my parents just over a year ago to try to save money and at the start of this year the magnitude of how much I’ve fucked up hit home and I started having panic attacks, become depressed and suicidal and had to stop working completely. I feel physically sick at the idea that I’ve wasted 5, possibly *the* 5 prime years of my career and have almost nothing to show for it. \n\nOne one level this is admittedly (sorry) yes, a sob story and I would just love to hear anyone else’s experiences and/or motivation as reassurance this is recoverable.\n\nOn another level, and I am trying to stay constructive, I’m at a loss as to where to go now and how to re-skill and recover my work ethic.\n\nI desperately want to 1. find a new pool of people who are doing high quality work, and 2. gain some credibility and show that I am not a complete fuck up but I can’t really see a path forward. \n\nThings I have considered:\n\n* Try to resume a similar role at a serious/reputable company - I can’t honestly say I would trust myself taking on management responsibility with serious takes and I can’t see how anyone would offer it to me given my track record of judgement calls.\n* Start a company? My goal was always to do this by now but currently I feel so out of touch with good practice I don’t think I could do it, and again I can’t see anyone investing in me based on my track record. \n* I’ve thought about trying to do an MBA but - if I could get accepted somewhere decent - I’d be worried about the cost and losing another 2-3 years seems like a big gamble now. \n* Try to switch to consulting/banking/finance - I now deeply regret not getting a tier-1 name on my CV but I think it’s too late now. I’ve had exposure to a load of corporate finance stuff but I cant honestly say any of it wasn’t garbage. \n\nAre there any routes I’ve missed???\n\nI’m sorry if this seems overly negative. I know I should be glad I’m not homeless etc etc and I have a family home to live in but it’s how I feel right now.\n\nAt the very least it’s been helpful for me to write this all out so if you’ve made it this far - thanks for reading.",
    "title": "How to get back on the horse after a (really) messy career failure?",
    "subreddit": "careerguidance",
    "timestamp": 1687698734,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "CEO is trying to keep me.. continue with school or take the raise? \n\n(TL:DR at the end)\n\nHey everyone,\n\nI’m at a fork in the road.. I’m 28 (M), married, living in Southern CA. I’ve been working in the cannabis industry for 5 years, at my current company for 3.\n\nThe company is a retail chain, with about 10 stores, fairly big player in SoCal Cannabis. A mix of great people and a handful of assholes- owner is a bit of a manic coke enthusiast.\n\nI started out as a contracted employee to just do ordering at $16 an hour, however over the past 3 years I’ve been hired on full time at salary currently $64k plus the semi-regular bonus (2 a year avg). In this time I’ve built up the entire demand planning and purchasing department from a single spreadsheet to a somewhat sophisticated centralized system capable of being ran by 1-2 people.\n\nLast year I started learning Python, and been applying that to my work to increase productivity- I’ve realized that I love problem solving, and am deeply interested in science/technology.\n\nThis year I’ve been saving about 80% of my pay (I live in a cheap shit studio with my wife 29- who also works at this company) to afford going back to school full time and possibly pay out of pocket.\n\nIn the last 6 months I have busted my ass to leave on a good note, proud of my work. Building out high level assortment analytics and reporting, developing/sourcing for our multiple white label product lines, and assisting in building out our new centralized distribution- including some software solutions to reduce labor.\n\nAs the year has gone on, keeping up with my schoolwork has been difficult.  I’m still maintaining A’s but work is beginning to suffer.\n\nMy CEO is aware and I recently told him I’m leaving at the end of the year for sure. He’s a huge fan of mine and wants to go to the owner and offer $85K. Also looking into developing a new role that focuses on analytics and software solutions. \n\nMy long-term thinking is that an engineering degree has a better overall trajectory and higher pay, with a wider range of opportunity- even outside of engineering disciplines. However, that’s a serious pay raise and skips the need to pay for school. \n\nI want an education but it would be an opportunity to continue to make my own way and I would also continue to just be self taught, as well as possibly continuing to fight for more raises, long-term.\n\nLastly, ownership/cannabis is mostly greedy, engineering has the potential to be more meaningful in the world.\n\n\n\nTL:DR\nI’m a married 28-year-old man, my wife (29) and I work at a cannabis company. I’ve been there for three years, started from the bottom and built my department(s). Been saving to go back to school (engineering), when I’m ready to leave for sure, work offers a $20,000 raise and possibly a new role.\n\nCEO is great, owner is always doing coke.\n\n\nThanks everyone.",
    "title": "CEO is trying to keep me.. continue with school or take the raise?",
    "subreddit": "careerguidance",
    "timestamp": 1694824086,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Probation extended by a month despite positive feedback and minor suggestions. Should I be worried? Last week, my manager sat me down for my 4-month probationary review and due to the company, especially our department being understaffed, and lack of serious feedback, I had assumed I would pass my probation. However, my manager pointed out a few areas that she wanted to see improvement in and said for those reasons, she wants to extend my probation by a month.This came out of left field because although two out of four of the reasons were discussed with me a few times, they didn't seem like major issues for them to warrant a probation extension. \n\nBasically, she wants me to involve her and my other manager in the process of responding to comments and mentions on social media more. This was mentioned to me before, but it was never clear how exactly they wanted me to do that because I was already involving them in the process of responding to queries. This time she clarified that it was up to me how I did it. The other reasons involved doing something that was never explained to me, and she said she hasn't had time to go over that with me but now she wants to do that. She also wants me to start making suggestions on the overall social media strategy, which I did previously but she hasn't had time to go over that. Also, it's only been 4 months and it's my first role so my coworker agreed with me that this wasn't something I should've already been doing but rather something for me to start doing now. One of her last suggestions was to get a car or move closer to work because weekends and evenings are occasionally required as part of the job description. But I told her this isn't possible at this time and that I've never been late to work, so my commute hasn't proved to be an issue yet.\n\nI should mention that last month, we had a new CEO join our company so the new leadership has already made a lot of people uneasy, and my manager said this herself. She also said she wants to make sure that I'm happy to work here and that I'm not annoyed commuting 1.25 hours only to come here and be hounded by my coworkers (which has lately become a big part of my day since we're under a lot of pressure from other departments).Following the meeting, she has started communicating with me over email and text more so than ever (I'm thinking she wants to start a paper trail). She also points out minor things that aren't really mistakes as if they were mistakes. This is something she's done before too, but it's become even more frequent now. However, just last week (after the meeting), she defended me to a coworker who was criticizing my work. I'm not sure what to make of all these mixed signals.\n\nBased on this, does it sound like I'm about to be fired or that she just wants to see some minor improvements? Should I start looking for another job and saving up in case things go severely wrong?",
    "title": "Probation extended by a month despite positive feedback and minor suggestions. Should I be worried?",
    "subreddit": "careerguidance",
    "timestamp": 1693845351,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Dealing with a company that encourages A but wants(?) B Hi r/careerguidance!\n\nI ask you for advice on how to proceed with my professional life and if I am in the wrong.\n\nLet me outline my situation for you: \n\nI am employed (part-time because I'm finishing my engineering master's degree) at a small company (\\~25 white-collar employees) that manufactures several high-tech products. For the last 4 years, two colleagues of mine and myself have built a new business unit (BU) from scratch. Colleague A focused on organizational work, marketing & sales, and Colleague B on process engineering. Both of them are in management positions. \n\nMy part is technical sales and a little product engineering. In the latter role, I have created a simulation that is one of the pillars this BU stands on. I am not in a management position.\n\nAlso in the mix is our CEO. This person was described by many as more of a quality manager rather than a leader. It is fair to say that him and I don't have the best relationship.\n\nThe last involved role is the owner of the business. I've known him personally for a long time. He encourages every employee to take initiative and \"make things happen\". An infamous quote of his is \"everyone should act like a business owner and do everything that generates more revenue\".\n\nNow to the problem:\n\nFor three times now, I and colleague A taking initiative has hurt us more than it helped. All our previous actions in this regard were focused on growing this BU and solving problems that arise in the growing process of a new business. E.g. creating a new role that does solely product management as there is no capacity for that right now. \n\nWe explained our proposals to all persons above in meetings. This is the preferred way to communicate in this company. Speaking to people individually is not encouraged, especially coming from a position below the person you want to talk to. Each time we adapted the message based on the feedback from previous attempts.\n\nWhile colleague A and I try to be very careful with our wording, we've been criticized several times for bringing out issues in an open setting with stakeholders present (even though it is formally encouraged to do so). Apparently, us doing so is seen by the stakeholders as a personal attack since they are the authority over their area and external feedback implies that they don't do a good job (which we never wanted to imply). \n\nThe proposal itself, while being subject to debate, was never seen as invalid or irrelevant. However, there is never an action set in place afterward. Usually, colleague A and I pick up the work ourselves because we care about what we built.\n\nMy question is now:\n\nIs it worth sticking with this company and building a career there under those circumstances? I take pride in my work and like to put effort in. Sadly it feels like I am encouraged to run but there is a rubber band attached to me that eventually pulls me back.\n\nAlternatively, should I start a new job after my studies are finished a few months from now?",
    "title": "Dealing with a company that encourages A but wants(?) B",
    "subreddit": "careerguidance",
    "timestamp": 1679392738,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Should I focus on liking my job or find better compensation? \nTL/DR: I'm expecting a job offer in a couple of days that potentially can give me good salary bump but for a role more boring that I have today. \n\nI've been in my company for about 5 years and it is getting harder to have meaningful compensation reviews. I applied for a new job to focus on better comp but I believe I will get bored really easy. How to define if I should focus on money or liking what I do?\n\nHere are some aspects to help with the comparison:\n\nTotal comp: I am expecting a 20% raise in the new role and even though I didn't get the offer it looks like they will match that. The new offer will be sent next week but my current comp is about to be reviewed this or next month. I already mentioned to my manager that I'm expecting a salary review since I'm having great impact in the team and had a lot of good feedback but I expect something around 5-10%. Also bonuses are better defined in the new role.\n\nBenefits: I'm not sure yet about the new offer but the ones I have today are quite average and I might have room to negotiate better ones in the new role. \n\nRole: My current role is a mix of sales, customer success and strategic product development. I like what I do but I find the customer support/training part quite tedious. The new role will focus more on the parts I think are boring and also I won't have as much impact in the strategy of the team as I do today. \n\nCareer progression: I currently report to the CEO of my company and my career path is a bit unclear. However, the product we are building is growing and we are seeing a lot of interest in the market and from potential buyers/investors. I have some stock options and eventhough we are not actively looking for investors it looks like in an year or two we will have some investing opportunities which might lead to salary bumps and more important roles. The new role is in an older company that have more stablished processes and it has a more standard career progression, less start-up-y. \n\nHybrid work: My current company has a hybrid situation that I quite like and the new role will allow for even more flexibility. However, I plan to move to a situation where I would work 3mo abroad per year and the new role already let me know it would be possible. Haven't discussed this with my current manager but I know they won't like it eventhough it is a possibility as other people have similar arrangements. This is a big thing for me as it has some personal aspects involved. \n\nInternational trips: I currently do a couple of international trips per year that are quite interesting but of intense work. It's a good way to visit new places without paying and I won't have that in the new role.\n\nEmotional: I love the product we are creating and I want to see it grow and be a part of it. I fear the FOMO I might have if I leave now, since we are in a steady grow stage. It has a potential to disrupt the industry we are in and we already reached some interesting benchmarks of SaaS products, proving the potential of it. I could even keep using the product if decide to leave, make some extra money on the side and keep the relationship going, but with way less impact.\n\nI thought about using the new offer as leverage to negotiate my salary but I fear it might jeopardize the relationship I have with the CEO and it is a hard conversation to have. \n\nI appreciate any advice! \n\nCheers",
    "title": "Should I focus on liking my job or find better compensation?",
    "subreddit": "careerguidance",
    "timestamp": 1684565843,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I feel lost and very frustrated - What should I do? Well, the title encapsulates my mindset right now. This will be long winded, but I'll try to summarize as best as I can. I'm also happy to share a resume privately if that would at all help.\r  \n\r  \nTL;DR at the top as below provides quite a lot of background.\r  \n\r  \nWorking IT for over a decade from helpdesk -> Systems Engineer and wanted to change careers for more challenge and better pay while using my knowledge. Made what I thought was a calculated move involving a base pay drop of $10k to change and get commissions. The move was mostly semi successful, however a big change mixed things up in both good and bad ways. The bad way involves compensation with the loss of commissions while being strung along for news of a promised higher base pay and project related commissions. The good part is technically promotion and title bump on paper.\r  \n\r  \n================================\r  \n\r  \nI've spent over a decade in and around IT. I've always been a jack of all trades type because I really enjoy knowing about tons of things, but I have never really specialized in anything in particular. In the beginning I started in basic helpdesk support and worked my way up and also going out of scope where I could to learn more about other areas that the higher up IT people managed. This afforded me opportunities to gain more responsibilities.\r  \n\r  \nAs a Systems Engineer making about $60k, I was handling escalations of different types, managing some very crucial systems for many locations, and working with different vendors for various products we either bought already or were vetting for purchase. I had been getting a little burnt out in recent years and wanted a career change. My brother has been in Enterprise Sales for about the same length of time as me, and he has tried to get me into sales for years so I finally decided to make a move. In my time in IT, and especially at the Systems Engineer level, I learned a fair amount of the business side of things, purchasing, implementing, supporting, requirements, projects, discussions with Directors, VPs, C suite, and owners.\r  \n\r  \nEarly this year I managed to get an interview with an IT Services Provider for an SDR role. Both the Director of Sales and the CEO were impressed with me due to my experience and they asked if I would like a TAM role instead. The base pay was $50k so I figured it would be a calculated move for a better future. Although it wasn't the front lines of sales, that was still a part of it and had a nice mix of things to utilize my experience. That was around 9 months ago and the sales team wasn't doing as well as leadership hoped so they fired the SDRs, kept an AE for sales duties, moved our other TAM to a Customer Success role along with our boss, the Director of Sales. For me, they wanted to keep me on and decided to create a new role in the company for me as a Solutions Engineer within a newly created Projects department.\r  \n\r  \nIt all sounds well and good, however the leadership has only given me a rough job description in the month or so since the official role change. I haven't even been told who I officially report to, just who it will \"likely be\". They said they were still figuring out the compensation because it will be a base pay with some sort of commission structure based on client projects. I understand things like this can take some time since it is all new, however they have said \"soon\" \"2 weeks\", etc multiple times when I've inquired about my pay change. I'm nearly a month in at this point and when I asked again today, I was told that they are \"very much still discussing the role\" and that compensation will probably be around the new year when they discuss salaries.\r  \n\r  \n\r  \n\r  \nWith all of that said, I feel like I'm stuck between a rock and a hard place with both sides squeezing tighter. I have been here for under a year while simultaneously getting promoted and making less money than when I started, until leadership gets it together hopefully very early next year. Being here less than a year doesn't help me look good while job hunting.",
    "title": "I feel lost and very frustrated - What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1700598425,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I denied the job and I don’t know if I did the right thing? There’s this Startup which got funded from Department of Biotechnology under Indian govt. \n\nI gave interview for Project Associate in one of their drug development project. The project is of two years mainly developing one drug. \n\nSo after few days of my interview, The CEO called me and said this is an unofficial call to let me know they are thinking of giving the post to me if I’m comfortable with starting from 1 September till July 2025. He said you can’t leave the project in between. 9-5 and stipend is 17k per month. Also no leave. If taken leave then salary will be deducted.\n\nSo, the issue is I’ve been preparing for CSIR/UGC NET for almost more than year now and I’m very hopeful that I’ll clear my exam on December. I’ll clear my JRF ( at least I hope so) because I’ve been preparing for it seriously. I have to clear my exams because there’s not any other option. \n\nSo I asked the CEO if they can convert my post to Jrf only if I clear my exams after January. They said they can’t do it because they are not under DBT but only funded by DBT. \nIf I clear my exams then I can go for any project which will pay the basic Jrf amount that is 31k per month. Also can take into phd with fellowship. \n\n\nThe ceo said he’ll discuss with the panel Members to see if there’s any option to use my Jrf. But I don’t think they will call me back because they can’t afford to lose the project associate in between the project. \n\nMy first personality who kinda denied the job is confident in me saying we took the right decision. \nBut the second insecure personality is saying what if we don’t clear the exam in December and have to sit for another 6 months idle. We should’ve taken the job for two years. \n\nI’m really feeling weird about the whole thing because it was my first proper job that I got selected. \n\n\nTLDR: I refused my first job (contractual ) that was of 17k/month for two years. Because I believe I’ll clear my entrance for NET/Jrf which will give me 31k/ month in December for any project or in phd. \n\nNow I’m feeling mix if I did the right thing.",
    "title": "I denied the job and I don’t know if I did the right thing?",
    "subreddit": "careerguidance",
    "timestamp": 1693376478,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Should I try sales? Just for a bit of context, I'm in my late teens and from the UK. I have a background in business studies and have a little side hustle business. I recently applied to a sales assistant role which requires me to acquire new customers door-to-door, representing one of the large broadband companies and their new technology. I think there's a potential for growth and sales. I myself am positive and driven.\r  \n\r  \nHowever, after having successfully landed the job, although I haven't officially started yet (today was my first day of training and getting to know what I'll be selling), I'm faced me with uncertainty. My parents suggest that I find something else, as they think that the job is a waste of time and I won't even make the minimum wage as it's commission-based pay. I can see why. Also, the job is around 40-60 minutes away from my home.\r  \n\r  \nOn the other hand, I've visited the office and the work culture seems amazing. The group interview was also good. The employees enjoy a mixed and flexible work culture of both casual and professional. They talked us through how the experienced will support the beginners and that there's potential for us to grow to becoming mentors, campaign directors, and even CEOs. They talked us through incentives and annual company trips to exotic locations if we progress to the higher stages. The employees state about working hard but playing hard too.\r  \n\r  \nI'm an open-minded individual and one that really thinks through and feel like it's a great opportunity as long as I push through and don't give up myself. The company has already offered to move me up a few levels due to my personal experience in selling and promoting my own goods.\r  \n\r  \nBut, it's still a door-to-door sales position that is one of my first jobs and I'm really unsure if it's worth being patient for weeks on end without sales and getting doors slammed in my face. Or should I just accept offers that provide a secure hourly wage that are nearer to me but don't provide as many incentives or the growth.\r  \n\r  \nWhat are your guys' thoughts? I need to let them know. I've only verbally accepted the role but haven't signed any papers yet till a few days. I'm honestly feeling that there can be great progression in this role and to network with great people and like mentioned, the work culture is amazing too. But, I don't know if I'm that much into sales and going door-to-door. I certainly feel like I have some of the qualities but just don't know to be honest.\r  \n\r  \nSorry for the long read..",
    "title": "Should I try sales?",
    "subreddit": "careerguidance",
    "timestamp": 1695408494,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Professional way to ask if CEO is sexist in an interview? Basically what the title says. I’m in the last round of interviews for a new corporate job. Privately owned company - so there’s that. I love my current job, but because I’ve risen to a higher management level, I’m interacting much more with one of our CEOs and he constantly say extremely inappropriate things that really make me uncomfortable (calling women hun or sweetie, making overt comments about trans and gay people, making comments on how women look or how attractive he find certain celebrities, “jokingly” calling people by their race, saying certain people on our clients’ team are just diversity hires and are “dumb as rocks”) there are other worse things but it’s pretty inappropriate and I know will be hard for me to tolerate or hold my tongue and so I’m looking for other jobs. \n\nIs there a professional way I can ask my interviewer about the “culture” or “values” of the company or CEO? Could I even say something about how bc of previous experiences, I want to make sure as a woman in the workplace, I will be treated with professionalism. \n\nThanks!",
    "title": "Professional way to ask if CEO is sexist in an interview?",
    "subreddit": "careerguidance",
    "timestamp": 1676828459,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "A recruiter ghosted me for a while and then reached back to me out of the blue very recently A couple months back, I was invited to an in-person interview for company A to maintain their front-end. The setting was a little unprofessional, but it's not a big deal. CEO told me the issue and how I can be a part of their team to help resolve the issue. Then he introduced me to the tech lead via Slack from his laptop and after a couple exchanges, they told me the salary. It was somewhat low, but I have no experience, so I just take what I can get.\n\nThey told me I have to do coding examination first and after I submit it, I reached out to them to see what will be the next step. A few days later, they asked if I can learn a language that I'm not familiar with but it's part of their tech stack, so I said that I can try my best. After that, absolutely nothing. I tried reaching out to the CEO multiple times, didn't get a single response. I texted, called, emailed, absolutely nothing.\n\nRecently, I received an offer from company B that pays almost double the salary of what company A shared, and the position fits my tech knowledge, so I immediately accepted it. But a couple days after, CEO from company A reached out to me, asking if I have landed an offer yet. After months and months of ghosting me, he finally reached out to me, and out of all media, he texted me.\n\nHonestly, although he's the first one who perform the act of ghosting, I felt a little guilty of ghosting him back. Maybe the least I could do is tell him that I'm no longer interested. What do you guys suggest I should do? For the record, I'm not at all interested to work for company A due to many reasons, not just the bad communication skills.\n\nEdit: Thank you so much for the inputs everyone. I have read all of your mixed suggestions and after careful consideration, I think the best solution is to be the bigger person and give that closure to the CEO. I'll just going to be short and to the point, but remain professional.",
    "title": "A recruiter ghosted me for a while and then reached back to me out of the blue very recently",
    "subreddit": "cscareerquestions",
    "timestamp": 1693426906,
    "score": 203,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I'm the only software developer in my company. How do I make sure I'm following best practices? Background: I'm 40 years old, currently majoring in Computer Science in one of the top universities in my country and about a year and a half from graduation.\n\nI work in a small company (_very_ small) in another industry, in a senior management role, but recently the CEO asked if I'd be willing to work on a software project full time, which I eagerly accepted.\n\nTo keep things simple and avoid giving away any sensitive info, I'm working on a two-tiered server where users make requests, which are forwarded to a spot server which runs on a GPU. Part of this setup uses a ML model that I trained using corporate data.\n\nProject-wise, things are going great and I already have a functional prototype. I'm using Django for the go-between server and FastAPI for the GPU server. As I want to encrypt the data, from what I've read I'll probably have to add Nginx to the mix.\n\nBut regardless, the fact still is that I'm an undergrad student doing the job of an entire IT team. Labor-wise, it's OK. I'm happy to have the opportunity and gain the experience, and my salary is unchanged. And the company really cannot afford to take on additional staff right now.\n\nMy questions are:\n\n1. How do I educate myself on the best practices for the project I'm doing? I'm keeping the code well organized, I have separate (private) GitHub repos for each of the components (gateway server, GPU server, shared), I've containerized the GPU server into a Dockerfile. I'm taking security quite seriously and looking into every single precaution I can think of (I'll probably have two layers of encryption for the data in transit and also encrypt the data at rest).\n\n2. How do I make sure this experience will count in my résumé? Will I be taken seriously, considering I did everything on my own and wasn't supervised or taught by anyone?\n\nThanks in advance.",
    "title": "I'm the only software developer in my company. How do I make sure I'm following best practices?",
    "subreddit": "cscareerquestions",
    "timestamp": 1692625737,
    "score": 17,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Weird feeling about a company I applied to So I'm an 8YOE SWE and I'm trying to change jobs in a location with very few companies operating in my field, therefore finding an offer that matches my skills and interests in such a place is a rare and precious event.\n\nSo as hinted by the title I just found one and I'm about to have the first interview round with them. But I see a lot of weird things and I'd like more opinions, perhaps it's just normal. \n\nFirst, this company has existed since about 40 years and they are doing some custom high-end parts for big and expensive machines, eg in the medical field, so typically sell very few parts at a very high price. \n\nFirst thing I noticed is that there are only a dozen employees, but I'd expect an engineering company that survived for so long to have grown a bit more. \n\nSecond thing I noticed, more than half of the employees have director/executive/marketing/sales kind of role and are there from the early days (mix of PhD and MBAs, sometimes both). According to my research, some of them serve multiple boards of directors at the same time. I saw only 3 or 4 engineers I could relate with and except one they all joined in the past 3 years (after they got a new CEO). \n\nThen I googled them and while they have a quite nice website describing their work, team, etc, but I found only a single press article about them, yet they've been around for a long time. Ok, perhaps there are some outside of the Web, but just one? Oh and on social medias they have been active for a few years, but the reactions on their posts are always from the same 2-3 employees. \n\nThey do exist legally, I checked and it's a properly registered company, the names listed being the ones of their board of directors who've been there since 40 years ago. \n\nNow I'm wondering how sketchy this all could be, as I'd really want to not switch job to end up in a failing company, not seeing my salary at the end of each month, or being fired early. I'm wondering if the new CEO managed to lift investments and is trying to boost a company that's been around as a side-kick for many people for decades. I'd be fine working for a growing startup, but one that existed for so long? \n\nAnyone has some experience with something similar?",
    "title": "Weird feeling about a company I applied to",
    "subreddit": "cscareerquestions",
    "timestamp": 1683780855,
    "score": 4,
    "keyword": "mixed race ceo"
  },
  {
    "text": "I need some opinions on my salary. Senior Dev I work at a corporation that is around 70 employees. We make a lot of money and have been around over 20 years, we just have a small employee count because we've automated a lot. 7 years ago I pitched a product design that I came up with on my own one night, the CEO loved it, and it's been my role for about 6 years now. I was hired as more of an apps engineer type role, pitched that idea, and after about a year of doing both roles, I moved into just running this product line. \n\nThere are 3 products lines, all created solely by me. I do all of the engineering work (enclosure design, circuit board design, testing, procurement, etc.), all of the embedded firmware for the microcontroller (C++), all of the software for a main unit (.NET/Linux stuff), all of the testing of both, customer support (whether direct or me sending our support team a TLDR that they expand on to the customer), and I am the one that leads all public speaking presentations and most meetings with any publications. I basically run a company within our company - my only contact with anyone above me is when more money is needed for production orders or as a \"hey I'm adding x, it'll be done in 2 months\" and then they respond \"sounds good\" and I bring them the new changes in 2 months. About 90% of changes are suggested by me, but any changes are always implemented by solely me.\n\nI make $120K base and then around $20K in bonuses. I have 7 years here and 12 total years in software development/engineering. This is in the US. I don't really know what to call my role since it's a mix of so many things. I'm curious what you would price me as reasonably. My goal is to tell them I need more money in a month or two and I want to know what I reasonably should ask for. My initial thought was around $145K base to compensate for inflation since I got the $120K bump 4 years ago, but I feel like just compensating for inflation is unfair to me due to all that I do. For context, we were selling about 100 units a year when I got the $120K, now we're selling around 500-1000. In 2024, we're already expected to pass 1000 in the first quarter.\n\nEdit: Also forgot to add - the sales aren’t insane, but the actual payoff is what these drive. The price for the actual units isn’t a ton but the resultant revenue is. The units fixed a gap we had in the market, allowing us to sell our other products to more customers. If I had to estimate, this has made us around $5-6M in 4 years due to what I’ve made.",
    "title": "I need some opinions on my salary. Senior Dev",
    "subreddit": "cscareerquestions",
    "timestamp": 1695755617,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Hot Tip: Seek a Small Office I keep seeing posts about how everyone hates their life in public or industry and thought I would share my experience. Not saying these jobs are abundant but this is what I did and it has worked out well so far (13.6% raise 2022, 25% raise in 2023).\n\nTitle: Property Accountant\n\nOffice: Asset management office (40 employees, 30 corporate, 10 superintendents)\n\n* Look for a company where the CEO/President is young. You want to get in on the ground floor of the next generation. Currently me and the VP (future president) are the youngest in the office.\n* Work hard, but work harder on your relationships with your coworkers. Nothing is more important than how your coworkers see you and how your bosses respond to you.\n* Identify a company with a poor tech stack that is transitioning to new tech.\n* Identify a company that has a workforce which is skewed to a very old demographic. My company average age is skewed to like 50-55.\n* Learn everything you possibly can about that tech once hired. Accounting is your 9-5 job, but you're gonna focus on breezing through that to get time to work on releasing new tech processes.\n* Your value is tied to automation and rolling out new modules. Don't ask for more accounting work. If anything, try to give up accounting work for more tech work. Accounting is literally a race to the bottom. I see all of our accountants take on more and more work and they don't get rewarded for it. Our value is in being a key employee to the company, not a slave that takes on more and more grunt work. \n\nTl;dr: General takeaway is focus on tech, not accounting. Being the best at a small company is a much better reward payoff than being a good employee at a multinational corp. Focus on your work relationships. If you leave and morale goes down it carries a ton of value. Negotiate, negotiate, negotiate.",
    "title": "Hot Tip: Seek a Small Office",
    "subreddit": "Accounting",
    "timestamp": 1703867188,
    "score": 166,
    "keyword": "mixed race ceo"
  },
  {
    "text": "First accounting job going completely wrong I was hired at a residential remodeling company for what they told me would be AP/AR. They needed help managing these tasks because there were missing payments and other issues going on. Before anything happened, I was very clear with the CEO (who interviewed me) that I had zero experience in the field, but he still agreed to hire me.\n\nOn my first day, no one helped or guided me on what I was supposed to do. They purchased QuickBooks and basically told me to do my thing. This was shocking to me because it was the first time I had used QuickBooks, and although it's not hard to navigate, I am clearly not qualified to use it. That same day, I learned that no one keeps track of anything. There were multiple folders in a desk full of receipts from who knows when, and when I linked their six bank accounts to QuickBooks, I realized they used the cards for literally everything, mixing different categories and not keeping things organized, and some of them with a lot of bank fees for NSF.\n\nThe second day was no better. I sat at my computer all day trying to figure things out, unable to ask for help because no one knows how to do this stuff. It was just me and their architect in the office. Later, I found out that they also want me to learn how to do federal and state taxes eventually, and also do the company’s taxes.\n\nToday is my third day, and I am still completely lost as to what I have to do. I can't ask for help because pretty much everyone works outside most of the day, and they don't really know how to handle all this either. I've been coming in every morning and just sitting with my computer trying to figure things out as I go because that's all I can do. Today, I learned that the CEO of the company thinks I am a CPA when I clearly told them I just graduated and have zero experience. I am not a quitter, and I really want to learn, but they are expecting way too much from someone with zero experience, and this is stressing me out so much. They think that just because I went to school, I already know how to do everything.\n\nEdit: Forgot to add that they also want me to manage the other 2 smaller businesses they have :(\n\nEdit 2: CEO also expects me to learn how to do payrolls and set up meetings with multiple banks and work something out to get a loan for a couple hundred thousand dollars.",
    "title": "First accounting job going completely wrong",
    "subreddit": "Accounting",
    "timestamp": 1683767979,
    "score": 130,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Excel CAN Be an Accounting Program Last year, I interviewed with a small (think 10 admin employees and 20-25 production employees) company for an A/R position. The hiring manager was super friendly, and the CEO came in on my second interview to get a better feel of me as a prospective employee. The CEO is very involved in her business, as she grew it from the ground up and took pride in it. She was very intimidating, and this was my first time talking to her. \n\nShe asked me if I had any experience working with accounting programs. I told her no (keep in mind that I actually said the word “no”) but that I was highly proficient in Excel and I’m a fast learner when it comes to new programs. \n\nCue me fighting back tears from anxiety as she lectures me that Excel is NOT an accounting program and it will “never be used by any company worth their salt”. \n\nShe offered me the job on a 3-month trial. I quit after 2 weeks to pursue another accounting job that gave me a much more relaxed, less-anxious feeling.\n\nA year later, I work both A/P and A/R for an agriculture company with less than 100 employees that works with vendors and customers world-wide. And guess what? I just taught my boss how to use a RIGHT formula to pull text from column A so he didn’t have a mix of letters and numbers. Now I work in an agriculture office \n\nWe use Excel every single day. And I know we’re worth our salt.\n\nExcel may not be under a list of Fortune 500’s most-recommended accounting programs, and those programs may be fantastic, but Excel counts, too!",
    "title": "Excel CAN Be an Accounting Program",
    "subreddit": "Accounting",
    "timestamp": 1678913569,
    "score": 10,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Start up Woes or Red Flags and jump ship? I'm 6 months in as the controller at a start up and quite a few things are happening that aren't sitting right with me. Are these start up woes that I'm just not use to or red flags and should bail out?\n\n- HR manager just quit. About 3 weeks ago a bonus was given out and secretary of CEO went around normal payroll process and said payroll service not to tell hr. Essentially a lack of trust with the word bonus at a pre revenue company and didn't want hr to know, who handles payroll normally. We are a week into two week notice and no one knows who's taking over payroll, no communication from c suite. \n\n- entire c suite and half of middle management is remote across the country at a manufacturing company \n\n- payment process is on the CEOs desk and ran through his secretary, both remote. Our bookkeeper, myself as controller, and CFO have no involvement in process. \n\n- I'm so far removed from process it took a random conversation from bookkeeper to notify me 6 weeks ago our main bank accounts were hacked and have brand new banking. \n\n- we are 100% r&d right now, but 100% of the company has never used our ERP system for when we start going into production and manufacturing. Today, I looked at log in status and of the 40+ people who have access to erp, only accounting department has logged on. \n\n- we are months behind on customer samples much less production promises. \n\n- our burn rate states we have 4 months of capital left with \"hopeful\" investors coming on soon. Been saying that since I interviewed in December. \n\n- we have a mix of people that have been brought on that have tons of experience in their roles, but the majority of operations, which I will rely upon for BOM and other costing/accounting have no experience but have been there a while and we're put in that role.",
    "title": "Start up Woes or Red Flags and jump ship?",
    "subreddit": "Accounting",
    "timestamp": 1687502730,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "What's the correct handshake strength for optimal synergy? Hi everyone, I just joined an MBB and am looking to up my game during networking sessions. I've always learned that we should convey our seriousness to a new contact via having a firm, dominant handshake; and conversely, that having a weak limp noodle handshake demonstrates incompetence and distrust. With this knowledge in hand, I've entered every meeting thus far introducing myself with a death grip overclock.\n\nHowever, my real life experience has been giving me mixed signals. One of my first contacts at work was a junior-ranking staff at a client firm, and he introduced himself with a tomato milkshake. For a short time after that, I completely lost respect for him - but then one day I was introduced to a senior partner from another MBB, and he too gave me an instant potato mash. Since then, I've entertained all manner of handshake grip strengths across the spectrum, from high- and junior-ranking personnel alike. One of the most memorable was a handshake I received from a CEO of a deca-billion dollar company, which I could only best describe as *al dente.*\n\nThis has made me question my perspective on life. Are handshake grip strengths really that important in relationship-building? I honestly feel really bad for looking down on the people who have given me wet diapers in the past, as they'd probably noticed it too. I'm looking for new insights into what the optimal benchmark is, so that I can recalibrate my first impression to the baseline for optimal synergy. Thank you everyone for your time reading this.",
    "title": "What's the correct handshake strength for optimal synergy?",
    "subreddit": "consulting",
    "timestamp": 1685265089,
    "score": 222,
    "keyword": "mixed race ceo"
  },
  {
    "text": "We Should Be More Concerned About Palestine... I know a lotta y’all not gon like me for this. I can just sense it. I feel like y’all might eat me up for this one too but I’m gonna say it anyway. \n\nThe way the black community—at least from what I’ve seen in America—is being so non-chalant about what’s happening in Palestine right now and it is really breaking my soul. In my opinion, we should be more vocal. And before you jump down my throat, let me say this: I *get* that a lot of us do not feel like we should have a social responsibility to “care” or be involved with non-black people’s political issues, I do. I get that we are *tired*. I get that we feel that we shouldn’t be the superheroes of every single non-black issue out there in the world because our emotional labor is already relied upon without ever giving us our just due back or giving us credit, *I get that*. \n\nHowever, I feel that this situation is unique. Not only is it unique, but it is also a literal genocide. A literal ethnic cleansing. I could never turn a blind eye to something like that. I say it’s unique to us because the Palestinian struggle has been similar to our own (I’m not saying it’s the *same*). And historically, the Palestinians have had black people’s backs in terms of our right to freedom and self-determination. I just listened to a talk with Angela Davis on Sunday where she said that Palestinians supported her while she was in jail. The Black Panthers stood with the Palestinians. As did Malcolm X, Martin Luther King Jr., James Baldwin, Toni Morrison, Audre Lorde, June Jordan, Nelson Mandela. And not just in the past, but as recently as 2020, during the George Floyd protests, Palestinians were teaching how to get tear gas out of our eyes. They painted a mural of George Floyd in Gaza (I believe it was Gaza, I may have to fact check on that). \n\nI don’t see how anyone could look at these videos of dead and mutilated babies, children with no parents, people fainting, people being blasted to bits, screaming out for god to save them and not feel anything? I don’t see how you can say “it’s not my problem” when it literally is because YOUR tax dollars are funding it, and YOUR elected officials are providing weapons and getting involved in the mix. And we are way more involved with Israel than we realize. Produce, shoes, printers, fast food...either sourced directly from or funding Israel. \n\nPlus, Afro-Palestinians exist. We are out there. I’m watching videos of people in Gaza and I’m literally seeing Afro-Palestinians in the videos. Afro-Palestinians are also in Jerusalem. There are documentaries about them. So black people are not removed entirely from the situation at all. We are out there and they’re here in America. My friend is Afro-Palestinian for Pete’s sake. So it’s very fucked up to say “not my problem.” What if the black non-Americans said that to us during Black Lives Matter? I’m sure some did, but how would you feel?\n\nAnd before you come at me with the whataboutism, yes, I agree, why don’t we also talk about Sudan and Haiti? I’ve seen black people come onto these Palestinians’ live streams and say what about Sudan and Haiti and I think it’s extremely disrespectful. If a Palestinian did that to us, we would be pissed. And why don’t we ask ourselves that? Why haven’t we made any noise for Sudan and Haiti? Because I BARELY see any creators talking about it. All I see on tik tok live streams with black people are conversations about body count, and who should pay for a date, and interracial dating. Never anything about what’s going on with black people in the world today. \n\nAnyways, eat me up. I know some might not agree.\n\nEDIT: excuse any typos please, I’m trying to get them all, but my tablet has weird autocorrect and I may not see them all\n\n2nd EDIT:\n\nI should say this. It’s crazy that we can be so apathetic about a literal ethnic cleansing. If we become so desensitized to this ethnic cleansing, this genocide, then what will happen once they come for us? If we show our government, if we show the world that we are okay with this, that we can simply turn a blind eye to it, then who’s to say it won’t happen to us next? Because you *know* how vulnerable we are as a population. There should never be a time where we take a stance of neutrality to genocide. Not ever. Because I guarantee you if they can do it to them, they will do it to us—in some places they already are doing it to us as some have pointed out in the comments. It should not be that hard to say: “I do not condone violence. I do not condone genocide.” But for some reason we find ourselves trapped in the false sense of stability that America brings to us. We love to sit in our privilege here and say if it’s not on my doorstep then it’s got nothing to do with me. But no one has ever heard of complicity. We are complicit. We pay for this. Our elected officials make decisions in our names. We are complicit and much more involved than we like to realize. We are supporting white supremacy, just under a different name and to a different brand of folks. And to me, that sounds like hypocrisy. I do not accept white supremacy in *any* of its forms. No matter what name it falls under. I do not support colonialism. Now how that make sense if I say I am neutral to white supremacy? But I’m black? Come on mane. Make that make sense. \n\nEDIT 3:\n\nSomeone asked me to post numbers to call for actions. \n\nHere are some of them:\n\n[White House Comment Line](https://www.instagram.com/p/CyzK48RRPbG/?igshid=MzRlODBiNWFlZA==)\nThis one is open Tues - Thurs, 11AM - 3PM EST. \n\n[Tell Congress Ceasefire Now](https://www.jewishvoiceforpeace.org/resource/call-congress-support-ceasefire/?fbclid=PAAaYvFphm9UDi9v3TiQreAVxgZqSuyXPuCLRFgcWoAhtqKxf5Pp4RJ-CeoQg_aem_AYk1oeqKcP2Oojq6EB1jN4qWPmlSSjkQgBMWFx4GJmSunN3XKZ82uHv1l1IhZ_fL1T8)\nThis one is by Jewish Voice for Peace. It calls for you and you leave a voicemail mail using the script to your representative. Takes less than 5 minutes.\n\n[Email Your Congress Member](https://www.jewishvoiceforpeace.org/resource/email-congress-support-ceasefire/)\nThis one is also done by Jewish Voice for Peace. Literally about 2 minutes.",
    "title": "We Should Be More Concerned About Palestine...",
    "subreddit": "blackladies",
    "timestamp": 1698290869,
    "score": 427,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me. Hey everyone, this happened at my daughter’s school this week and I’m kind of uncomfortable with how it went down. Would love to have some insight on this situation.\n\nMy daughter goes to a small school in our town where I volunteer in the library weekly. It’s my favourite day of the week, and I had a great time this week as always reading with and telling stories to the kids, plus getting to spend the day with my daughter. I got there a little early and since no one was in the library, I decided to go and paint with one of the teachers and some of the younger kids.\n\nAs we were painting, one of the little boys, let’s call him Miles, came up to us, pointed at the little bit of lace visible at the front of my wig and loudly said “Fake!” before he and his little brother sat down next to me and started to paint. I rolled my eyes, because kids are gonna be kids, and went back to what I was doing, but the teacher was clearly upset. She told him what he said wasn’t okay and made him apologize, I said it was fine he does that sometimes. She continued to tell me that didn’t make it alright, and started telling me about her experiences with racism growing up as an Indian woman.\n\nFor additional context I know this kid relatively well. I’m friendly with his parents, he’s friends with my daughter, frequently borrows her manga, and will generally come into the library to chat with me on the days I volunteer (translation: to show me his new Pokemon), read with the other kids and flip through whatever book I’m reading (he’s a very advanced reader). A few weeks ago at one of the school’s many events, a bunch of the kids and their parents were eating together and he said that he liked my hair. My daughter’s best friend said that it was fake. The school is very diverse and since a few of the black kids are either from mixed race families or have been adopted into white ones, conversations about my hair are frequent and sometimes the non-black kids join in. He asked what my real hair looked like and I told him that he'd already seen it several times.\n\nBack to the present, one of the other teachers (who was white) came up to me after lunch time and said that he and the other teacher were going to sit down and have a conversation with Miles about what he said and that it was important to talk to kids about racism. I said I didn't think it was necessary, but he continued to talk over me. If you recall my previous post about this school this is the same teacher who had been hitting on me, so I was way too uncomfortable to say as much as I probably should have.\n\nMy perspective on the situation is this. This kid wasn't racially stereotyping me, he has been present for multiple conversations about my hair, so he knew it was fake. He is a kid and is curious about cultural differences which is normal. I think non-black people have a different perspective than black people on what is considered unruly behaviour in a child. I also think non-black people think black hair is some kind of secret and are extremely uncomfortable talking about it or hearing it mentioned. I'm not.\n\nThe little boy is 7 years old. He's not white and comes from Middle Eastern/East Asian background, so there may have been an element of racism to the way the situation was handled towards him. He also made a comment about the first teacher's weight a few minutes after the one about my hair, so I also suspect that she just doesn't like him very much.\n\nAnyway, I'm curious about everyone else's perspective.",
    "title": "Child at my daughter’s school taken aside for a private discussion for “racism” towards me.",
    "subreddit": "blackladies",
    "timestamp": 1688343941,
    "score": 71,
    "keyword": "mixed race ceo"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 71,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Do you feel like it’s hard to fit in with other Asian Americans? Backstory: I grew up in a dominantly Black and Latino low income neighborhood. My parents were immigrants from Thai and Laos. Going into middle school-high school I hung out with a group of Asians. I thought that was really cool initially because I felt that there were more people who looked like me and enjoyed the things that I enjoyed as far as food and culture similarities growing up. All was well until I kept getting clowned for being “white washed” or not “Asian” enough. \n\nI was doing things at the time that weren’t seen as “Asian”. I played Football, involved with ROTC, hung out with people outside my race, dressed normally, and listened to rock, emo, and metal music. I tried to fit in by spiking my hair, dressing like I was a raver, getting into tuners, etc (this was the early 2000’s AZN movement). Even still, at the time I wasn’t asian enough and it messed with my head as a kid. I was more confused because compared to the “friends” I had at the time…I was fluent in my language and knew more about my culture than they did. Long story short, I stopped hanging out with them and did my thing. \n\nAs an adult I still feel like I don’t fit in but it doesn’t hurt me like it did before. I’m just more curious now. I have some Asian friends I keep in touch with and hangout with once in a while. When we have a big meetup I notice most of the time they have a huge group of other Asians vs my group of friends are more of a mixed group. Whenever I hangout with other Asians I feel like there’s a connection missing there and don’t really know what it is during those situations. Sometimes, it would be nice to connect with someone who shares similarities with me growing up as an Asian American. \n\nCurrently, I am a lead guitarist in a touring Metal Band and have a career in the Plumbing trade. Before that, I was/is a Marine Veteran and former Sheriffs Deputy. I am in a healthy Marriage with my Wife who is Latina and are planning our next stage of life.\n\nI’m proud of being Thai and still talk to my Father in my language. I’m very in tune with my culture and am comfortable with being myself. I don’t make being Asian my identity. \n\nWanted to reach out here on Reddit to hear if there are similar stories and if anyone needs a friend, I’m here.",
    "title": "Do you feel like it’s hard to fit in with other Asian Americans?",
    "subreddit": "asianamerican",
    "timestamp": 1697813820,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Trans men reveal how toxic society is towards men--MANY sources included &#x200B;\n\nhttps://preview.redd.it/luajuj8w4e6b1.png?width=790&format=png&auto=webp&s=3ef59a9188afe3a26d6caaeb18858427c4666be6\n\nRecently I've been looking at the FtM trans community online, and it's just sad how accurate this meme is.\n\nThe FtM trans community is much smaller than the MtF community, but FtM experiences post-transition are very revealing.\n\nThis community is interesting because their complaints are not only about failing to pass as male, but also about trying to cope with passing as male. From what I've seen, this problem is especially common with those who have completed transitioning and are attracted to women.\n\nAnd once they start getting treated like men, they get a brutal reality check.\n\nMany times, they are people who believed in concepts such as unilateral patriarchy, oppression of women, and male privilege. In their minds, they were gonna lead privileged lives once they became men, but when they transitioned, they were like rabbits caught in headlights as reality hit them like a train. Real life was a 180 degree difference.\n\nThese people have been treated like women their entire lives, and had been led to believe the game was fully rigged against women.\n\nImagine you're playing a game against bots, but you don't realize it and think you're good at the game. Suddenly, you get thrown into a professional match.  \nFucking brutal man.\n\n&#x200B;\n\nhttps://preview.redd.it/i07fp8hx4e6b1.png?width=735&format=png&auto=webp&s=36369715accef2d9714fc6177e1d0e852f6f5ba9\n\nHe said \"like I died and came back as a ghost.\" It's like that movie where Bruce Willis is dead but doesn't realize he's a ghost, and no one can see him. It really nails the reality of being a sub5 male in the West. If you're not [talented](https://journals.sagepub.com/doi/abs/10.1177/0305735613482025), [rich](https://www.sciencedirect.com/science/article/abs/pii/S1090513808001177?via%3Dihub), or a [chad](https://faculty.wcas.northwestern.edu/eli-finkel/documents/EastwickFinkel2008_JPSP.pdf), [that is literally how life can be](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373).  \nTough scenes man, truly.\n\n\"...her reaction was something like disgust mixed with pity.\"\n\nWelcome to the fucking club brother. \"[Disgust mixed with pity](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\" Believe me, I know what it feels like. And now bro, you do too.\n\n\"I used to look in the mirror and envision myself as this confident, strong man...\"\n\nIn his mind, he was gonna transition and drink beer and watch football. He was gonna be like \"yo, bitches, yo, yo\" and life was gonna work out just like that.\n\nThat is how disconnected from reality some people are. They have to find the truth out the hard way.  \nJust because you'd been told about how the system was rigged against women, you thought you knew the ugly side of life.\n\nBut you don't man. You ain't about that life.\n\nThese people are so naive. They look at celebs like Elliot Page.\n\n\"Oh look, Elliot Page has a hot girlfriend.\"\n\nYou ain't Elliot Page. He rode his Stacy look in Hollywood for fucking two decades. And only after his looks faded, he decided to come out. In a sense, he played his cards right.\n\nHe could transition into whatever he wants. He has the status, fame, and money. He could transition into a frog tomorrow with some experimental DNA injection, and [he would still date whomever he wanted.](https://www.youtube.com/watch?v=ol3nAWRLIDA)\n\nYou cannot.\n\nYou literally turned yourself into an inkwell.\n\n&#x200B;\n\nhttps://preview.redd.it/4nxe5z7z4e6b1.png?width=707&format=png&auto=webp&s=4943719e08227f88f88bd92175d6352b9d3530c8\n\nRight off the bat: 5'3. At 5'3 [it's pretty much](https://www.researchgate.net/publication/236670565_The_height_of_choosiness_Mutual_mate_choice_for_stature_results_in_suboptimal_pair_formation_for_both_sexes) [over](https://incels.wiki/images/thumb/e/ea/Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png/800px-Women-s-Acceptance-of-Potential-Male-Partners-Based-on-Male-Height.png?20190704023738), man.\n\n\"People who I barely just met will make rude comments or jokes about my size.\"\n\nThis is true. Happens all the time. Other men sometimes will try to throw you under the bus to make themselves look like an alpha, and then they'll play it off as a joke if you say anything back. [Social dominance games happen all the time](https://www.sciencedirect.com/science/article/abs/pii/S0191886913012245).\n\n\"...plenty of women will reject me just for my height...before I even get a chance to tell them I'm trans.\"\n\nPay attention to the word choice here. So it's okay if it happens to XY men because they're just g[enetic trash if they're 5'3](https://www.salon.com/2011/09/25/sex_cells_interview/), but because he's an XX man, he should get a pass for being 5'3?\n\nAre you really gonna feel any better if you get fake sympathy because you're trans? Personally, I'd rather get rejected for genuine reasons than get a pity pass.\n\n\"...when I try to be confident some people hate short guys with confidence...they see it as a person who doesn't know their rightful place.\"\n\nThis is so true. I love this part. [If you don't have the looks but have the confidence, it annoys people](https://gwern.net/doc/psychology/okcupid/weexperimentonhumanbeings.html). [They think you don't know their place](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116).\n\n\"You gotta be acting because there's no way someone with your looks can be confident.\"  \nIt just doesn't look natural. You'll be seen as someone who crosses the borders of natural hierarchy. [They will feel a subconscious hostility against you](https://www.researchgate.net/publication/317273311_Disgust_Trumps_Lust_Women%27s_Disgust_and_Attraction_Towards_Men_Is_Unaffected_by_Sexual_Arousal).\n\n\"I don't even benefit from the privileges the average man gets.\"\n\nWait until he learns that [the only privilege average men have is that which they have over sub5 men](https://arxiv.org/pdf/1607.01952.pdf).  \nI love how he thinks that if he was 5'8, his aforementioned problems would just go away. In reality, he would likely end up just like the first poster, getting reactions of disgust mixed with pity.\n\n\"Even studies will show you how height really affects men, [they get paid less](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2709415/), [suicide rate goes up](https://ajp.psychiatryonline.org/doi/pdf/10.1176/appi.ajp.162.7.1373), [more likely victims of crimes](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC32258/pdf/612.pdf), [seen as less attractive](https://www.independent.co.uk/life-style/love-sex/dating-app-tinder-bio-words-most-right-swipes-music-gym-6-foot-badoo-a8512541.html), and so on.\"\n\nWelcome to the ugly fucking reality.\n\n[As a woman, if you're tall, many men will see you as better genetic material for their offspring. If you're short, you'll be seen as more attractive.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9454610/) You really can't lose.\n\n[These days, even obese women are celebrated](https://www.instagram.com/plussizecafe/?hl=en). Meanwhile, being [just overweight as a man](https://royalsocietypublishing.org/doi/full/10.1098/rspb.2017.1819#d3e552) is a virtual death sentence for your dating life.\n\nAnd this isn't only about dating. It goes way beyond dating to life itself. That's the real privilege, [how you're treated by people](https://www.sciencedaily.com/releases/2005/04/050412213412.htm), [the connections you make](https://psycnet.apa.org/doiLanding?doi=10.1037%2F0022-3514.81.1.116). It's about everything, man.\n\n&#x200B;\n\nhttps://preview.redd.it/geedhfu05e6b1.png?width=605&format=png&auto=webp&s=5d3562ddf94d42a605a6fcc8bff0f35d1fd27aac\n\n\"I'm a very quiet, thoughtful, and sort of emotionally sensitive trans guy...\"\n\nRight off the bat, if you're like that as a man, you will be seen as a meek bitchboy by even the most socially progressive women.\n\nBut never pay attention to what people say. Progressive women will say \"oh yeah man, crying and showing emotions doesn't make you less of a man, it doesn't make you weak, it actually makes you more of a man bro.\"\n\nBut trust and believe when I, a progressive myself in many regards, say this. [If you are emotionally vulnerable in their presence, their pussies will dry up harder than the fucking Serengeti](https://journals.sagepub.com/doi/abs/10.1177/0146167214543879). And once again, this person had to find it out the hard way.\n\n\"...if I stayed as a girl I wouldn't have to worry whether I did nothing because I would still be liked and appreciated.\"\n\nExactly. I like this one because it includes the social aspects of the difficulties that come with manhood rather than just difficulties in dating. The middle paragraphs are underrated, really. He's spot on.  \n[As a guy, if you're not talented or have a respectable career at a certain age, you're looked down upon by society](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10206369/).\n\nMeanwhile, if you're a woman, if you don't have career ambitions or aren't talented in some field, you won't get dissed by society. [If anything, men will see you as better wife material](https://link.springer.com/article/10.1007/s10645-022-09412-w).\n\nThis is what we mean by \"tutorial mode.\" Men these days are expected to have the full package: [looks](https://link.springer.com/article/10.1007/s40806-017-0092-x), [race](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4631383/), [height](https://www.sciencedirect.com/science/article/abs/pii/S0191886913000020), [money](https://www.sciencedirect.com/science/article/abs/pii/S109051381730315X), etc.\n\nThis is why many men are struggling today. Many women, on the other hand, have none of these expectations placed on them by society.\n\nAnd these FtM men were not aware of the biggest JBW they had: [just be a woman](https://www.tandfonline.com/doi/abs/10.1080/14792779543000002). They fell for the line that men have it easier.\n\nAnd when they transition, the reality hits them like a fucking train. All the social privileges they took for granted have suddenly vanished like smoke in the air. But since they've grown up as female-presenting, they haven't developed the necessary coping skills to deal with the difficulties that come with being a man.\n\nBeing a man in the West is a constant battlefield where you're competing with other men for resources and women.\n\nThis is why I always say obsession with self-improvement for the sake of getting puss is a form of female supremacy. All the redpill gurus and PUAs are telling you to have money, interesting hobbies, ambitious goals in life, a gymmaxxed body, turn yourself into Thanos and travel to Vormir to get the Soul Stone, but for what?\n\nThe average woman, [who is overweight](https://www.medicalnewstoday.com/articles/321003#:~:text=One%20of%20the%20commonly%20used,the%20category%20of%20%E2%80%9C%20overweight%20.%E2%80%9D) and [much more prone to crying than the average man](https://journals.sagepub.com/doi/10.1177/1069397111404519).\n\n\"I want my man to be accomplished and have ambitious life goals?\"\n\nBut what have you accomplished? Do you own a startup and employ people? [You got a liberal arts degree](https://www.amacad.org/humanities-indicators/higher-education/gender-distribution-bachelors-degrees-humanities), and [now you work in retail](https://www.census.gov/content/dam/Census/library/publications/2020/demo/acs-44.pdf).\n\nRedpill dating coaches telling you to improve to get women are the real simps.\n\nAnd the people in this post have not yet realized this. They're in for a wild ride, I can tell you that much.\n\nDon't be a free agent in life. Let the truth guide you.",
    "title": "Trans men reveal how toxic society is towards men--MANY sources included",
    "subreddit": "MensRights",
    "timestamp": 1686926079,
    "score": 1022,
    "keyword": "mixed race ceo"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 60,
    "keyword": "mixed race ceo"
  }
]