[
  {
    "text": "Quitting your job. What's the best quit your job stories? I was there four long years, but I wish it would have been 4 hours. At first it wasn't that bad in my eyes because it was my first entry level job and I was making more money than I had my entire life. But after a few months and I was let loose so to speak, things got toxic as hell. First off, I had three bosses. All three were snarky, entilted,full of themselves, disrepsectful, perverted, vulgar, etc. I could go on and on. I started as a 22 year old male, and even I would literally cringe at the things they would say about women, politicians, other co-workers, or just anybody they felt deserved their ridicule. One manager in particular, who was my main boss, was the most repulsive. He made the other two look like angels dipped in pixie dust. He was short, fat, dipped snuff and typically had it all over his face, extremely loud, bullish, etc. Again, I could write a book on how awful this guy is/was. He would patronize the receptionist on a daily basis. And belittle anything and anybody. Any woman, and I mean any age or color, that walked in the door he couldn't help but judge her attractiveness in the most asinine way. Needless to say, I pretty much heard a grown tell me how he would fuck said woman every day of the week. He would plop his fat belly on top of his desk and imitate sex moves. It was disgusting and me and my co-workers had to sit through this and smile like we approved of what he was doing. It was awful. Not only did he do lewd acts like the mentioned, but he may have been the most judgemental/hypocritical human being I have ever been around. He would criticize people for not raising their kids right even though he didn't have any. He would make people feel like complete shit for taking their company issued vacations but he would miss four days in a row with no explaination. He mocked and made fun of an employee when he was going through a divorce, yet his wife had been wanting to leave him for months. He called another co worker worthless and a loser because he was struggling with an alcohol addiction, but he was a recovering alcoholic. He just flat out sucked to be around. Needless to say, he was a big part of the job being a toxic environment for everyone. But besides all that, they were extremely unfair with our work. We were in sales, and we had a damn good sales teams. We were breaking monthly and yearly sales records left and right. But none of that was good enough. We had weekly and in some cases daily meetings where we were threatened with our jobs if we didn't do this or do that. And anytime someone stood up for everybody, they would start their belittling train of garbage and try and make us feel 3 foot tall. We struggled to meet their impossible and unfair goals. At only 25, I had to check myself into the ER one night because of stress related palpitations. My BP was high and I was just burnt out. I tried my damnest to get out. I had a couple of interviews mixed in but nothing came about. I was ready to take a job shoveling poop just to get out of that God forsaken place. Well, one day...... shit hit the fan. I was working a customer and got him to commit, I went to my main bosses office to tell him what was going on. Well, he proceeded to tell me that he didn't like the way I handled the deal and I was awful at my job. (Keep in mind I have the deal SOLD) I slightly showed anger and told him I didn't appreciate him talking to me like that and that I've done nothing but work my ass off for him. He stands up and starts screaming in my face. Calls me a lazy piece of shit, a \"lazy millennial\", and that I should just go live off my dad's money (my dad is not rich). Welp, I shoved him. Shoved him as hard as I could against the wall and we go to tussling all over the place. Co workers break us up and as we are standing face to face I call him every name I've ever wanted to call him. It was the most relieving yet upsetting thing I have ever done. Of course, he says I'm fired. And I tell him great, I don't want to work for a fat, tea pot shaped fuck anyway (LOL). I go home that night and call everybody from the General Manager to the CEO and pour my soul into telling them what was going on at that store between me and everyone who works there. See, all they see is numbers, they had no idea what was going on inside. Well, the GM calls the next couple of days and is sucking up like crazy. Not only does he offer me to stay, he offers an extra week of vacation and he is willing to pay for it up front. They knew how pissed I was and I had ammo to turn their shit show into a PR nightmare. I accepted the offer and took the money and quit the day after. Best day of my life.",
    "title": "Quitting your job. What's the best quit your job stories?",
    "subreddit": "jobs",
    "timestamp": 1495228165,
    "score": 7,
    "keyword": "mixed race ceo"
  },
  {
    "text": "The long con to joining your dream company (what worked for me) [(original here)](https://medium.com/@jennlau/the-long-con-to-joining-your-dream-company-64708f10b020)\n\nMy only credibility in writing this is that I am now working for a company that I really, really wanted to work for. It’s almost been a year!\n\n&nbsp;\n\nI hope this works for you too.\n\n&nbsp;\n\nIf you already have an idea of where or for whom you want to work for, sweet! That makes things easier.\n\n&nbsp;\n\nDespite having one particular company (ok, I’m just going to start calling it Company A for brevity’s sake) that I had set my sights on, I made a list of five-ish companies that I would target. I wanted to chat with each of them — not necessarily get an interview, but really learn about the company and see if we jibe.\n\n&nbsp;\n\nIf you’re contemplating a switch, these questions might help you get started:\nWhat do you spend your free time doing and thinking about? What gets you psyched? Healthcare & public health.\n\n&nbsp;\n\nWould you prefer a 9–5 job, or a start-uppy type job? Start-uppy!\nWhat are examples of some companies that are in that market? Make a list of those in your vicinity, or wherever you’re willing to move to.\nWith your current experience, what could you do in that type of company? I wanted to work in tech, with zero programming skills. Marketing or sales for me!\n\n&nbsp;\n\nDo you know anyone that works in the aforementioned companies? Yes!\nIf you answered ‘no’ to that last question, stop reading, because it is all about who you know.\n\n&nbsp;\n\nKidding. Don’t stop reading. I do truly think it is at least partially about who you know, though.\n\n&nbsp;\n\nIn this case, I was in luck because I had an friend that worked at Company A. Actually, she’s how I came to know about them.\n\n&nbsp;\n\nI asked my friend if I could name-drop her in an email I sent to the VP of Marketing, as a means of mentioning how I came across Company A. She said cool, go for it.\n\n&nbsp;\n\nI now work at Company A.\n\n&nbsp;\n\nAt this point, you’re probably going, “What the hell, you knew someone that worked there! That’s how you got in!”\n\n&nbsp;\n\nOk fine, and it also took an additional 47 email exchanges and several phone calls amongst different departments.\n\n&nbsp;\n\nAlso, remember the other companies on my top five-ish list? I had coffee or interviews with all of them, without submitting a single application.\n\n&nbsp;\n\nThe only thing stopping you from getting to know the right people is the wrong mindset (and maybe a fear of rejection).\n\n&nbsp;\n\n*If you don’t know someone, get to know someone.*\n\n&nbsp;\n\nHere is the process I used for each company, from initial company research, to reach-out:\n\n&nbsp;\n\nThis was huge for me: get some type of email plug-in that notifies you when people read your emails. If you’re not getting a response but they keep opening your email, they’re likely interested, but very busy. Keep following up. \n\n&nbsp;\n\n**1. Research**\nUse common sense, poke around on their website, do some Google searching. If there are job postings on their site, great. Don’t apply directly to the careers page yet — they are likely to get lost in the mix.\nGo on LinkedIn and search for two groups of people: the hiring manager/HR for the office in your area, and someone that might be your direct supervisor (eg. VP of Marketing, VP of Sales). If it’s a small company, I go directly to the CEO. Get their names.\nYou can do the same with someone that used to work at your dream company. Why’d they leave?\n\n&nbsp;\n\n**2. Acquire email address**\nWho are you gonna email, and to what address?\n\n&nbsp;\n\nIf you found the right email in Step 1., lucky you. If not, visit their Contact Us page, and you might find something like “info@companyB.com” for Company B. It shouldn’t be too hard.\n\n&nbsp;\n\nStart guessing emails for the person you wanna email.\n\n&nbsp;\n\nLet’s say I want to email Bart Simpson, who is the VP of Marketing at Company B. There are only so many options: bsimpson@companyb.com, bart.simpson@companyb.com, bart@companyb.com. You’re smart. You got this!\n\n&nbsp;\n\nYou can also try http://mailtester.com/ and see if it is a verified email (this doesn’t always work, the domains are sometimes blocked).\n\n&nbsp;\n\n**3. Fire off some emails**\nCraft a compelling subject line and body content. This is friggin’ important!\nKnow who you are emailing. If they have some form of social media, you can get a sense of their humour, hobbies, and values that they hold dear. Be authentic. If you’ve never been to a basketball game, don’t pretend to be a fan. What are some ways you can relate and gain common ground?\nYou can see some examples here.\n\n&nbsp;\n\nRemember how I cautioned to hold off on applying directly on the careers page? If you’re speaking to the right person, they might be kind enough to get your application in the right hands.\n\n&nbsp;\n\nMost importantly, it is not just about getting a job — hence the long con. Regardless of how much of a good hiring decision you might be, not every organization can hire you at the snap of a finger. It’s about talking to experts in your industry. An hour of fruitful conversation can trump reading several hours of reading. What you learn from one person may strike enough of a chord with another person to consider you a valuable asset (I hate those words too).  \n\n&nbsp;\n\nIn this process, I learned a couple things:\n\n* People want to help you if they can sense your authenticity in wanting to learn. Not everyone is free for coffee; most people are free for a phone call.\n* Relentlessly follow up.\n* Sow your seeds! Where there may not be opportunity now, there may be opportunity later.",
    "title": "The long con to joining your dream company (what worked for me)",
    "subreddit": "jobs",
    "timestamp": 1491958692,
    "score": 5,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Confused about bonus that came in way below expectations? Hey all,\n\nFirst up, throwaway account.\n\nI'll keep this short and to the point.\n\nI work within a non-sales field within the business, but am very close to revenue. My performance within my actual role is fantastic, but I'm always looking for ways to add value to the business, often on my own time.\n\nIn this particular instance, I went after a specific sales partnership and landed the client. The contract came in and is worth mid $xxx,xxx. I've mainly worked on this deal in my own time (outside of hours) and balanced it with the work I was assigned to. \n\nThe deal was celebrated in front of the entire team this past week. I was praised, told this is a one of a kind deal that is fantastic for the business, and sets the standard for what we aim to do moving forward - plus a thank-you for working outside of hours. It's also a sizeable amount of money, as stated above, and has a few accounting incentives that make it even better P&L side. \n\n*Here's the problem:*\n\nI was handed an envelope, expecting a bonus. The \"bonus\" was a couple of gift vouchers worth a couple hundred dollars. I was honestly embarrassed, felt physically sick for the amount of work I put into this and felt very undervalued as a result. \n\nI was expecting a decent bonus, as a comparison, my bonus was ~$7k mid-year. \n\n*How I knew to expect a bonus:*\n\nI think it's important to clarify this, in case my expectations aren't in-line. \n\n- After a call with the client, I asked my boss for some time off. I'd previously used all my leave, and had none left. I asked my boss, and he basically said, \"you're about to land a deal worth x and you're asking for some unpaid time off? I think we can do a little more that, plus a bonus.\"\n\n- I was out with my boss for lunch discussing where the action items for the deal were at. He referenced to not having forgotten my bonus, he just hadn't had time to come up with something yet.. that was a couple of days before the team announcement.\n\n*Couple of other things in the mix:*\n\n- I didn't ask for a raise at my annual review - that was a few weeks ago. The business hasn't been doing that well, so I wanted to wait for a few things to come in before raising the question and putting them in an uncomfortable spot. I'm directly tied to revenue and have taken on far more work than before, so believe I deserve one now. It's possible that I haven't been forward enough about wanting more money. I worked my ass off for the mid-year bonus, but it definitely came as a surprise and was fairly hush hush. \n\n- I'm pushing for a role of being directly responsible for revenue. I've spoken to three key decision makers about this including the CEO, and they're all positive. I'm not sure if I should bite my tongue and wait this out as I don't want to hurt the chances of this, or if I have something to legitimately bring up, without causing issues. Worth saying, I have a good relationship with all contacts.\n\nAnyway, my main question is, should I ask what's up with the \"bonus\" they gave me? I feel insulted, and considering they've extended the line to bring me closer to sales, I'm not sure if I just gave them a freebie or if bigger things are in the mix and I should just wait it out. \n\nThanks!",
    "title": "Confused about bonus that came in way below expectations?",
    "subreddit": "jobs",
    "timestamp": 1489500996,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "New Job 3 months in....Help (Long Read) WARNING Long Read:\n\nTLDR: Company blindsided me into a position, no processes in place, no proper management in place and seems to be misappropriating funds and giving me very different work and I am only 3 months in.\n\nI had left my old employer of 5 years, where there was no more development for my career and the commute was 3 hours a day after an office relocation to join a small startup (or no longer a start up I was led to believe) closer to home, in fact literally a 20 min walk away. \n\nI didn't apply for a job, I submitted my CV as I was a project manager in the tech world and the company was in the industry. They emailed me to say thanks for the CV but wasn't looking for anyone at the moment. Fast forward 4 months later, they called out the blue and asked if I could meet, and said they had they had a role for me. I was excited went to meet the COO very informally and hit it off, he liked my experience and told me some of the problems etc that I could solve and I left feeling excited. \n\nI get an email saying they wanted to hire me as PM but with responsibilities of managing a team as well. I had managed teams before and they mostly had the skills I was used to and could still technically hold my own. I took the opportunity to develop my skills managing a team and gaining experience with some of their projects that were different that what I had managed before giving me some further experience, it was extra close to home, was given the okay by a few people who had worked with them before, the salary was lower but what I spent on commuting was saved and I negotiated extra after 6 months which would bring me to the same salary as my previous job. \n\nUpon accepting the role I had a 3 month notice at my previous role, I had worked extremely hard for them over the years and was a pretty good employee and very flexible, so asked if they could bring me down to just 2 months, i had a few projects to finish off in this time anyway. They say yes and 3 weeks before starting my new job, the CEO emails me to ask me to come in for a day to get a handover from the previous guy (I wasn't aware there was a previous guy and I was replacing him) and to get up to speed on some of the projects. \n\nI take a day leave in my current role and come along to a Risk meeting for one of their projects. At this point I am guessing this is one of the projects I will be leading on and alarm bells start going off. The project is 2 years in, is not complete, has huge amounts of risk, no paperwork, no logs, no diary and they have been paid 50% upfront and have spent at least 70% of the total cost agreed to be paid, that isn't in writing as they have no contract. I also must say the client is a charitable organisation and very well known in the community and across the country, so a big risk low reward project. \n\nI talk in the meeting and am very frank that this is a project that I would no longer commit too, advise them to call the client and be upfront, give them their money back and move on. But they don't want to, they have a reputation, they are a small firm so they get a PM Company to step in to help them. The PM sent seems very focused, very direct and I can see how she could get the project back on track and had the resource to do so. They tell me not to worry they don't expect me to manage this as the outsourced PM Consultancy company is and that this would be brought back on track for when I arrive. \n\nOkay I thought, if they have an outsourced PM then happy for them to run this and I can run some of the other projects. \n\nI must add at this point, there is no plan, there isn't even anyone taking any minutes in this meeting other than myself. So i send my minutes over at the end of the day after meeting them, tell them I hope all goes okay and I will see you in 2 months as there is absolutely nothing I can do at this moment in time. \n\nThat got me a bit worried, it's a project that also requires different levels of experience with technology I haven't worked with before, but okay they have experts and I can be brought up to speed and hey this isn't gonna be touched by me yet, so PM Consultants can run with it.\n\nI get another email 2 weeks before my official start date asking if I can come in again for an overview of another project and for me to work on a presentation I am going to be giving at an event about 3 hours from where I live on my second day of employment, and write a letter of response to an email received from a member of parliament about a project I will be leading on...when I start working for them. \n\nSo I take another day and go and visit the offices, work with the team on the project and get up to speed, I make a pretty basic presentation with the time I have and am pretty clear with the info they have given me, one of the lead tech engineers on the project is coming with me too and so it isn't feeling terribly difficult, but I like to talk about things I know. I am comfortable giving presentations of course and talking in front of hundreds of people but when I know what I am talking about. \n\nAnyway at this time I realise I should start work for them earlier because I want to spend a bit of time on the presentation and gathering notes and writing this letter, so I agree to start a day early (I had leave from my old employer that I was taking as a destresser before I started and I had holiday booked with the SO) my previous role was also very stressful.\n\nIt's on this day that I travel to this presentation with the senior engineer who proceeds to fill me in about the company. Bear in mind I asked around locally around this company I had friends and colleagues from another employer who had advised this was an okay company and I did what research I could on employer rating sites and couldn't see anything negative. \n\nI get home this night and literally cannot believe what I have heard. From activities of fraud to extremely bad hires to people hired who were family members to take company money and misappropriate funds. To the CEO taking asking their Finance Officer to pick up shoes and drive them to a date, while requesting they wait in the car and work. My brain is going haywire, I cannot believe what I have heard. But I take it to stock and hope that this might be a disgruntled employee and I will keep my eye on him. \n\nAfter this day I start getting up to speed on the two projects they want me to run and manage the team's resource on a day to day. And lo and behold the project that we knew was a shitstorm that should have been farther from 2 months ago, absolutely zero has happened. I cannot get hold of the PM Consultant, I have no paperwork, no documentation, no plans, no action plans absolute zilch. So i go to my CEO who was involved in this project and he just refers me to PM Consultant over and over again. At this point I am getting nowhere fast so I dig in to it and try to pick it apart and do the things that should have been done. At this moment right now I have managed to reengage with the client and got on a good footing and am progressing nicely, but we are still spending money I don't have and its a headache. \n\nThe other project is okay, it's stable however work that should have been done 6 months ago is now only getting done because I am here. The project is monitored by a governing body but I manage the project for my company and three other partnering companies. It's a challenging one but it's fruitful has a budget and thankfully has all the docs and paperwork up to speed (except I should mention that all though there was paperwork, half of it had people on it who was either a) made up to obtain extra budget b) no longer worked for the company and they either forgot to remove or no doubt left to retain their resource costs. \n\nI work on the project for a month and all is well.\n\nI have to submit my quarterly report to the PM and have gotten it back on track and I now submit my financials which consists of 4 mileage Travel days for me and the team, 4 lunch receipts, resource costs and one hotel. My Finance officer sends me his over and it's astronomical, 5K for travel and other. It has hotels, restaurant receipts for over £200, bike scheme for the boss it's insane. So this was not expected budget out of my project and it's pretty obvious some of what is here is not for the project. \n\nThe team in the office is a mixed back, half of the team are experienced but heavily resourced and half are pure interns/apprentices who have skills but have absolutely no motivation and literally have no experience in delivering work for projects and they are heavily utilised on my projects, the only projects they work for. On top of this I have been given 3 other projects to work on and I am telling them I can't because my time is heavily resourced. The team hate the CEO, every single person none of them like him and none of them have any good stories to tell. The CEO pulls me in the other day to tell me that they want the two projects I am working on to get to saleable stage and that they are going to give me targets to work on to bring income on these projects, so basically sales. I tell him we can talk about it but this was not what I was brought in to do, but he keeps booking meetings in for me and other companies to try and sell this product. \n\nI am at a loss of what to do, my 3 month probation has now passed although there has been no acknowledgement of such so my 8 weeks notice now kicks in. \n\nI guess I am posting here to see if I was simply just blindsided into this role, the company like me and want me to move up to COO position which my COO seems to be giving me a lot of his responsibilities anyway but the CEO is not a nice person. When he is in the office all hell breaks loose, he interrupts heavy resource, he seems to determine people to do work which isn't in their remit to do and decides workload which I have to back track and try and reshift. I have another manager who is above myself and on the level of COO who is so demeaning when requesting resource, not telling me what resource is for, not giving me requirements and there is literally no proper PM process in here which I have also been trying to implement as a whole. And the projects that he is demanding resource on has no PM and no process, requirements or documentation.  There is one other PM in the company who is okay but is on the same salary as me I found out and manages two projects, and asked me how I monitor my actions?\n\nAfter writing this I know I should leave and I am going to start looking for jobs, but I have only been here 3 months. What would you guys do in this position? Am I being dramatic? How is this 3 months going to look like? Is this company insane? It really makes me want to start my own up.\n\nThanks for reading.",
    "title": "New Job 3 months in....Help (Long Read)",
    "subreddit": "jobs",
    "timestamp": 1510825967,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Got a strane email from an older male student but given the context I'm not sure if it's a red flag or not... Backstory for context:\nI am a University student getting my degree and certification in TESOL – Teaching English to speakers of other languages.  I volunteer three-four times a week, two hours each time in a local community college’s ESL classroom.  Each quarter we get old students graduating out of our class (it’s beginning elementary English) and get new students signing up for class.  I speak Spanish and Chinese, as well as English.\n\n\nI always take a special shine (even though I’m not supposed to) to specific students, and certain students really take a shine to me over some of the other classroom assistants.  I like to learn a lot about my students, and usually make an effort to get to class early and stay a little late to get to talk to the students outside of class.  \n\n\nBeginning of my problem:\nLast quarter I had a student, let’s call him Jeng.  He is a late-middle-aged Chinese immigrant, and his wife who I’ll call Xue is also in the class.  He was in our beginning level class, but he’s quite obviously NOT a beginning level English speaker.  He’s damn near fluent, but he just has trouble writing, so needed a quarter in a low level class to catch his writing up with his speaking.  Jeng was always so jovial.  He was very chatty with us, the teachers and the other students.  He always had the most to say, and sometimes could go off on random but entertaining conversation tangents.\n\n\nJeng was VERY complimentary.  To everyone, but I felt like he ‘picked’ on me a lot.  (I say picked but it wasn’t a bad thing, though it was sometimes awkward).  He started out just saying the usual, that I was smart, that I was a good teacher, that I was very helpful.  Then he found out that I speak Chinese, and he would compliment me on my accent, my pronunciation, my vocabulary choice if he ever heard me speaking it.  I’m not a very verbose Chinese speaker though, my vocab is pretty limited, so he would always offer to give me Chinese lessons after class.  \n\n\nThen the compliments got…strange.  He would compliment me on my ‘fair’ skin.  He found out I’m mixed race and then kept telling me I was beautiful and fair for my race (I am very light skinned for my mix but….it’s just a weird compliment to receive, it’s not something I usually take as a compliment but I knew he was just trying to be nice.)  Then he asked me about my ‘white’ side, and I said my ‘white’ side is Dutch, because I tell everyone this, it’s not a secret and I’m not bashful about it.  Then, the next class, he told me ‘You have a very regal air about you, like you could be a fair Dutch queen.’  \n\n\nHonestly I felt like this compliment was way over the top, but what was I supposed to do?  I just tried to deflect in my usual self deprecating way, but he kept insisting for days that I looked like a European queen, or European Princess, or ‘Aristocrat.’  But the thing is, his wife was with him every time he would compliment me, and she would smile and nod, though she wasn’t big on talking (her speaking level was lower than his.)  So, I always got the feeling that these kinds of compliments were somewhat normal to them, and not anything weird.  So I let it go, and chalked it up to a clash of cultures, which happens A LOT in ESL classrooms.  \n\n\nMy current problem:\nI always give out an email address to my students so that they can email me when I’m not in class for homework help, since I assign a lot of them specific homeworks.  But today I got an email from Jeng, who isn’t even in my classroom this quarter, and said he and his wife ‘really like me’.  He wrote ‘My son is coming from China and I think it is good that you meet him!  Then, maybe I can give you Chinese lessons!’ \n\n\nAm I overthinking this?  Is this weird?  Or is this just a little bit overzealously friendly?  I’ve never been to China myself, and so I don’t know if this is a common sort of practice?  My friend joked that maybe he’s trying to set his son up with an American girl but I don’t think that’s the case, I’m pretty sure Jeng told me once his son had a wife or girlfriend or something.  The thing is, if this were a white guy in his early 50s?  I’d probably report him to someone.  But it’s this sweet friendly old Chinese man and his wife, so I feel like there might be a cultural disconnect happening here.\n\n\nI just need someone to tell me ‘no you’re not crazy for feeling weird’ or ‘oh you’re crazy this is a totally normal type of interaction in the context of Northern Chinese culture’ I guess.  What do you ladies think?  I feel like my ‘lady defense’ shield is always up but maybe it shouldn’t be?",
    "title": "Got a strane email from an older male student but given the context I'm not sure if it's a red flag or not...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485592009,
    "score": 6,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Should I continue to sleep with my friend? [Disclaimer: As of right now, I am 18 soon to be 19. If you read this post, you'll quickly figure out that I am quite young. I was slightly conflicted between posting this on here or r/Teenagers, but I remembered 13 year olds are over there. I understand that this is an adult issue, so I would like some adult perspective. I guess I am explicitly stating this because I don't want to be talked down to. I know sex comes with this clusterfuck of feelings and issues and conflicts, so on and so forth. I always use condoms, get tested regularly for STDs and I have Mirena inserted. I love having sex, but I want to hold on to the pretense of having a \"future\". I promise you that my Christian mother who had me at 22 has talked to me enough.]\n\nQuick background/rant, sorry:\n\nWe have been really close friends since 11th grade and by our senior year of high school, we had both been in relationships for over a year. But, after some talking, sexting, etc, for a few months, we decided to have sex. I think it was supposed to be a one time thing, but we have been seeing each other off and on since January of this year. I broke up with my boyfriend the day after the first time, but he has still been with his girlfriend. I think I kept seeing him the earlier half of this year because it made me feel less alone. Plus, it has different with him so far.. like sex is unbelievably good.\n\nThe last time I came home (Thanksgiving) he told me that his girlfriend wanted to sleep with someone else of a specific race, so they made an agreement that he could have sex with someone else as well. (If you think this is weird, trust me, so do I.) Since, we have already been seeing each other, he asked me if I wanted to, and of course I said yes. (MORE Background: I go to a university with 50,000+ students. I know I might find someone decent eventually.. but the guys I have been with so far suck in terms of sex.)\n\nMy senior year I felt really bad sleeping with him (+ guilty for cheating). Looking back now I think I was really jealous of his girlfriend and confused with why he was sabotaging his relationship. I know my self-esteem is wrapped up in this still; I am trying to figure out how. For one, I have never wanted to date him (obviously, he cheats, among other reasons). I have always felt jealous seeing them together at school, pictures of her on the internet, etc. Despite just getting out of a relationship, not wanting another one because I knew I was going off to college, maybe... I subconsciously wanted to be with someone?\n\nNow, I am a freshman in college. I have been back home twice and I saw him both times. I really like seeing him. Despite everything else, he is a really good friend of mine and I always have a fun time with him. I think early December while I was prepping for finals he told me that for sure he didn't want to do this anymore. (He has been extremely on and off this entire year.) I agreed because I have always let him decide. I think ONCE, I have texted him first. I really like seeing him and I know I'm going to have a good time, so why say no? But, whenever he would tell me that he wanted to stop, I respected that. Until November, we had seen each other maybe once a month up until August. We go weeks without talking, then he hits me up. I don't mean to be so easy with him, but it is such a chill situation.\n\nOn the other hand, I get bothered by this notion and the posts that circulate the internet that say something along the lines of \"Guys always cheat on a 10 with a 5\" and \"They do it because the 5 is easy to get\". Shit like this. I hate seeing it, because all I think is about this situation. His girlfriend is fucking gorgeous. I know I shouldn't compare myself to anyone, but it's hard. She is feminine, curvy, has beautiful longish dark, curly hair and pretty skin. I am mainly skinny (as a black girl, this isn't the most ideal shape) and look like a 12 year old boy. I don't like the idea of being that sorry \"5\". \n\nFurthermore, I have mixed feelings about him having a girlfriend. I like it because I feel comfortable knowing that this is merely a friends with benefits situation, but I feel bad for her. So many times I want to DM her and tell her that she is beautiful and (probably) smart and funny and talented and she should not be with this loser. (She is a senior in HS now.) I want to tell her that she deserves so much better and she has her whole life ahead of her and she has no reason to stay with this lame ass dude. She will eventually find someone that isn't so emotionally dependent on other people that they cheat when she needs time to herself. But, that \"loser\" is my friend and I can't do that to him. I know he loves her and is good to her, but still.\n\nNow, him and his girlfriend have decided to take a break after New Year's. For them, that means being \"basically single\". Naturally, he texted me and asked if I would be willing to see him and I said yes. But, now I am conflicted; being in college, I am too busy to care about any repercussions, because I see him, then I leave. HOWEVER, when I do care I feel ugly in terms of my personality and my personal appearance, like I'm that \"sorry 5\". I guess I'm asking should I remove myself from this situation permanently or should I continue see him?\n\nTL;DR - I've been the side chick of a good friend of mine for almost a year now. It kind of makes me feel shit about myself, but he is really good in bed and I enjoy the dynamic of our friendship. (No feelings, time in-between, optional, etc.) I'm in town for a few more weeks, should I see him  or should I stop seeing him for good?",
    "title": "Should I continue to sleep with my friend?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1514360814,
    "score": 0,
    "keyword": "mixed race ceo"
  },
  {
    "text": "New Cardiology NP - I think my salary was lowballed This is on a throwaway for privacy's sake, but I was just shown a contract for my current cardiology practice to transition from an RN (with them for 4 years thus far) to an NP. I graduated last May and held tight with promises that \"we are going to hire you.\" (FYI my practice was bought by a for-profit entity a year ago).\n\nFinally they threw a contract in front of me today to review. 25 PTO days a year (actually 16 after holidays are removed, and that includes sick leave and CME days), which do not accrue. It's a 3 year contract with a 24 month 10 mile noncompete. There's a bonus structure of cash collections x 50% - salary x 25%, which I figure will be miniscule if anything. \n\nThe salary is 85k a year. Oddly enough in the draft I was given Ninety Nine Thousand is written out next to the numerical figures. I was originally quoted 90k (which I thought was low but acceptable) by the CEO, who has since claimed she doesn't remember saying this. It's a draft copy and they keep verbally stating 85k, so I feel like the 99k written out on the contract was an oversight when they were putting new figures in.\n\nI like this practice and this place but I feel lowballed. I have 4 years of cardiac experience. I live in Missouri. I have wanted this job for months and administration *know* this, but the physicians in my practice have basically been demanding from corporate this job for me for a while. I know they lowball because they just hired a new RN for barely more than what I started out at floor nursing as a new grad, and several dollars an hour below what they started me as when we were owned by the nonprofit.\n\nI asked to have the salary revisited but I don't have a lot of hope they will raise it. If they don't, am I killing my future earnings with this contract? Do you guys see any red flags?\n\nNo call, no holidays. A mix of cardiology acute hospital care, clinic, and SNF consultations.",
    "title": "New Cardiology NP - I think my salary was lowballed",
    "subreddit": "nursing",
    "timestamp": 1485902274,
    "score": 2,
    "keyword": "mixed race ceo"
  },
  {
    "text": "[Inner city] [US History/8th grade] - Black vs African-American? I'm white. For the past four years, I've been teaching 8th grade in a school where 90% of the students are black. I've only taught ELA, but when something comes up regarding race and I say \"black\", someone will cheekily say \"it's AFRICAN-AMERICAN!\", or when I say \"African-American,\" someone will cheekily say \"Just say BLACK, I'm not from Africa!\"\n\nIn reality, I just mix it up based on what sounds better in the given sentence. I probably say \"black\" more because African-American is hard to say with a lot of syllables. But I have some sensitive students that take themselves pretty seriously, so I'm trying to avoid angry parent phone calls this year.\n\nThis is my first time teaching U.S. history so race is going to come up a lot. I want to explain from the start what I just said here, but I really have no right to tell them \"You shouldn't be offended by black!\" or \"Most of you aren't even from Africa, so I'm not using African-American!\"\n\nAny advice? Should I just accept there will be complaints either way and ignore them like I do with most petty complaints?\n\nOther info if it matters:\n\n* In a major northeast city\n\n* Most teachers are white\n\n* Right on the border of a very white neighborhood, so most kids are pretty racially desensitized\n\n* About two kids a year will angrily call me a cracker, so racism is still there a bit",
    "title": "[Inner city] [US History/8th grade] - Black vs African-American?",
    "subreddit": "Teachers",
    "timestamp": 1502968943,
    "score": 15,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Avenues for career advancement at a startup? I'm a new grad who got a job a month and a half ago at a startup ran by a CEO and COO who both have successful ventures in other companies and who have invested in startups in early stages that have later become very big - basically, I feel like these people know what they're doing because they have the experience and track record to prove it.\n\nSo far I've learned a lot from the business side of tech from management.  At every meeting I'm just trying to absorb as much as possible, picking the brains of my boss and his boss. I get to see first hand how a startup is ran which is exciting. \n\nAre there other avenues for career advancement or investment/making money in the position I'm in? Does anyone want to share their experience/story at a startup? I'm really hoping that post-grad can be more than a race to the 'senior developer' title on a resume for the high base pay and benefits at a Big N company, if that makes sense. Can anyone elaborate on this?\n\nThanks.",
    "title": "Avenues for career advancement at a startup?",
    "subreddit": "cscareerquestions",
    "timestamp": 1506470095,
    "score": 1,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Need Career Advice - CPA & CFE With 8 Year of Experience Hi all,\n\nI’m looking for some career advice as to what I should do next. I’m a 29-year-old CPA and CFE (Just passed the CFE last week) with 8 years of experience. I was in public accounting for four years doing a mixture of tax and audit for two regional firms (Fuck the big 4). I was a senior accountant and analyst for a healthcare startup for 2 years. Currently, I’m a controller for a small private equity firm that specializes in commercial and residential real estate. It’s a property management company that oversees numerous properties that are held under 40 different taxable entities. Each entity has at least one bank account which means we perform about 75 bank reconciliations a month. Riveting, I know. Basically, I oversee and perform everything accounting and finance related. \n\nI was originally hired by the CFO but he quit in February 2017 to become a CEO for another company. I took over his role and had a coworker promoted to accounting manager. Now it’s me (Controller), an accounting manager, an AP clerk and an AR clerk with some other analysts and admin staff mixed in. \n\nThe CFO acted as a boss, a mentor and a friend. He was constantly teaching and training me. As a result, I learned a great deal of knowledge. However, since he has departed, my learning has flat lined and I’m essentially going through the motions and babysitting the company. I’m afraid that if I stay here much longer, I’ll get technically behind and never make that leap to be a CFO/COO/Executive somewhere else. I don’t know if I should try to get my MBA, CMA or another certification? \n\nThe primary issues are that it’s a family business that is never going to grow, they don’t treat or invest in their employees (everyone is disposable), taking days off is frowned upon and I’m essentially an adult baby sitter. Additionally, I don’t have much say in the decision-making process. I turn 30 in February and kinda freaking out ha ha.\n\nAny help would be greatly appreciated.",
    "title": "Need Career Advice - CPA & CFE With 8 Year of Experience",
    "subreddit": "Accounting",
    "timestamp": 1506375684,
    "score": 9,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Does anybody here have a sibling who contributes to the Black dating issues? I mean the typical issues like the idea that non Black women/men are better than Black people. My brother is this way. He's 32 years old and single and has really low self esteem so I feel bad for him in that way and race issues towards black men bother him a lot. But when I'm with him, he stares at non Black women *nonstop* like his entire body and head will turn so he can check out a woman walking by but a Black female walks by and it's almost like he tries to look away. He proudly tells his friends (none of them are Black) that he's \"pickier with Black girls\" and that she'd have to be a perfect 10 for him to notice... but he's not exactly the perfect 10 type of guy, and his standards for other races are so low. He will date very homely, overweight or just bland looking White, Latina and Asian women. Even then, he doesn't attract many women because he doesn't take care of himself much, physically & that adds to his low self esteem. He also stares at couples who are interracial with a Black man a lot. I tried to hook him up with my friend but I felt bad because she was the one who asked and she's black/brown skinned and I knew he'd not like that.  I'm a Black female, it just feels disrespectful in a way, like his mind is so twisted when it comes to race and I don't understand it other than deep insecurity. \n\n&nbsp;\n\nHe also says the \"I think she's mixed\" thing when he finds a Black girl he finds attractive, which makes me cringe. Our mother is dark skinned, our dad is multiracial and very light but loves dark skinned women like my mom. My brother is darker like my mom but myself and my other siblings are all lighter tones. He seems the most affected by his race in a negative way. We also grew up in a majority white city but this issue seems beyond that. Should I just continue to ignore this? A part of me just wants to pick his brain and ask him *why* he seems to hate Black women so much... I've been reading up more on Black female issues, especially colorism and they're annoying me, so to have a brother who so openly adds to them is driving me insane. But then I feel like I can't change him, he's allowed to have his thoughts... idk. Anybody experience similar? Any suggestions?",
    "title": "Does anybody here have a sibling who contributes to the Black dating issues?",
    "subreddit": "blackladies",
    "timestamp": 1501346838,
    "score": 47,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Shout out to Spider-Man Homecoming for diversity? I know a lot of ladies feel like diversity in Hollywood shouldn't be celebrating like it's a victory but should be expecting at this point. I get that I'm still happy as fuck that the new Spider-Man movie has so much melanin. The movie actually looks like the town I grew up in!😄 Thanks casting/director for not pretending Queens is still white as hell. \n\nIt's also refreshing to see that Laura Harrier's character (Liz Allen) had a mixed race family. I love our light skinned, mixed race sisters but it's so annoying (and offensive) that they are often given dark skinned parents. It reeks of colorism and it doesn't represent black families or mixed families at all! Unrealistic casting only appeals to white minds who are only comfortable with a light face.\n\nNow… if only we could get a Miles Morales movie... In the meantime, I'm looking forward to Black Panther!",
    "title": "Shout out to Spider-Man Homecoming for diversity?",
    "subreddit": "blackladies",
    "timestamp": 1499802006,
    "score": 28,
    "keyword": "mixed race ceo"
  },
  {
    "text": "White male Tech CEO calls for fewer white men in Tech http://dailycaller.com/2017/09/25/tech-ceo-isaac-schlueter-calls-for-fewer-white-men-in-tech/\n\nI'm guessing Mr. Isaac Schleuter isn't going to demand that his own position be replaced by a non-white male.  \n\nThere's an interesting argument, typically made by people on the far right, that white males are now being discriminated against in Western society.    \n\nA few years ago I would laughed at such a notion, but recently a friend of mine was turned down for a teaching position at the University of Victoria (Canada) and the administrator flat out told him they were looking for more \"diversity.\"   He now teaches English in Saudi Arabia.  \n\nAlso in Canada, I used to vote for the NDP.   Now \"the party has a policy requiring any departing MLA to be replaced by a woman or 'equity-seeking candidate,' including racial minorities, Indigenous people, and members of the LGBTQ community.\"   One poor sap had to claim he was [bisexual](http://www.cbc.ca/news/canada/british-columbia/ndp-candidate-reveals-bisexuality-after-questions-over-party-s-equity-rule-1.3811299) to prevent losing his job.  \n\nThis is not \"justice\", social or otherwise.  This is just discrimination under a new name.   \n\nIn the UK, poor white males are now recognized as the most [disadvantaged](http://www.bbc.co.uk/newsbeat/article/34667100/poor-white-boys-get-a-worse-start-in-life-says-equality-report) group.  \n\nWhy wouldn't they be?  If you help every poor ethnic group *except* poor white people of course they'll become the most disadvantaged.  And despite feminist claims, men almost always occupy the very bottom rungs of society.   \n\nThe left has lost its way.  Whereas they used to focus on class and *overcoming* racial and sexual distinctions, they now seek to create maximum conflict between the sexes and races while the billionaires run laughing to the bank.   *Divide et impera* is the oldest trick in the book, and modern day leftists have fallen for it hook, line and sinker.",
    "title": "White male Tech CEO calls for fewer white men in Tech",
    "subreddit": "MensRights",
    "timestamp": 1506463644,
    "score": 15,
    "keyword": "mixed race ceo"
  },
  {
    "text": "[Discussion] My industry seems to be hiring and promoting women more due to historical injustice. How is this similar and different than affirmative action in colleges? I just wanted to have an open discussion with y'all so let's try and hold back our biases. I should mention I am for 100% equality but do not think you should create inequality to do so, I'll explain.\n\nMy field has predominantly been male and moved female over the last couple of decades. Now it's fairly even, but the leadership is still majority men, like 70%. I feel this is due to history taking a while to run it's course, as you see the new entrants are fairly equal. Except now I hear the CEO of a certain employer is stating they want more women in leadership. It was not an official statement online but something we heard directly. I'm all for women leaders. But I am concerned with men losing out to these opportunities as a result. \n\nI find this argument similar to that of affirmative action for college admissions. I have mixed feelings but there is no doubt that I, a white guy in a small yet affluent town, had a totally better set of opportunities than say a black woman a few towns over who grew up poorer, etc. I feel that children (18 and under) have little ability to change their opportunities, so AA can help give people an equal footing their parents couldn't. It shouldn't be a kids fault they grew up in a worse place than I did. I didn't do anything to be so lucky. \n\nBut when it comes to workplaces, more so the promotions than the hiring, I feel that it's extremely unequal to promote a woman over me simply because they're making up for past injustices. I feel that if you have a college degree like mine and have the same job as I do, we are on an equal playing field. The promotion should be based on merit and work alone. It hasn't happened to me in any way, but I am wary because I'm seeing what looks like signs of gender preference at work. For what it's worth, I work with 70-80% women and am in fact the only male on my 15-person team. I am the minority which is an odd feeling. Not complaining however. \n\nWhat are your thoughts?",
    "title": "[Discussion] My industry seems to be hiring and promoting women more due to historical injustice. How is this similar and different than affirmative action in colleges?",
    "subreddit": "MensRights",
    "timestamp": 1502377556,
    "score": 9,
    "keyword": "mixed race ceo"
  },
  {
    "text": "A Socialist Defense of Gender Roles Edit: wow.  I've never seen such quick downvotes.   Remember that this is supposed to be a discussion forum not an ideological purity contest.   Only downvote if you think this post has contributed nothing to the debate.   \n\nEdit 2: I give up.   Enjoy the decline.   \n\nUnusual and long post here.    The non-socialist majority may enjoy it for the stats and the un-pc quotes by figures like George Orwell, Nicola Tesla and Christopher Hitchens.  \n\nMRA's are right to suggest that men got a raw deal under traditionalism.    I'm not suggesting we go back to a situation where e.g. a man be forced to pay his wives' debts.   Or that people be forced into certain roles.   I'm suggesting that the majority of men and women would be happier in a traditionalist arrangement: the woman takes care of the kids and home and the man is respected and honored for his contributions in turn.   Nor would this prevent women from achieving status in the male sphere.   It would just be more unusual since women would be doing the more important work of raising children.\n\nA return to a traditional conservative lifestyle is impossible absent collapse.   Female liberation has [never](https://archive.org/details/b20442580) been internally reversed.   Unfortunately it is also incompatible with large inequalities due to female hypergamy.    The majority of men are left out in the cold, so have no impetus to work.  Therefore a combination of men's rights and socialism are required if civilization is to continue.   This will naturally lead to men and women embracing traditional gender roles.    The only other alternative is a return to patriarchy, however that is exceedingly unlikely for reasons JD Unwin explains in the above link.   \n\nI was recently watching a documentary about a financial depression in the late 19th century.   A (female) professor noted that \"many women were forced\" into the workplace.   It struck me as an odd turn of phrase, since feminists claim that women weren't \"allowed\" to work back then.   Turns out this is false.   Karen Straughan notes that there are records e.g. of female blacksmiths going back to the middle ages.   Women could work, they just didn't want to.   Why would they?   For 90 percent of the population working sucked.   It still does.  Also, it's hard to work when you're pregnant.   \n\nThe only way feminists can get away with characterizing the traditional female sphere as a prison is by lying about it.   In truth, women could own [property](https://www.cambridge.org/core/journals/continuity-and-change/article/favoured-or-oppressed-married-women-property-and-coverture-in-england-16601800/617F23DD2D64A036C58E0BF7D56F89BE), wife-beating was severely [punished](https://www.debunker.com/texts/ruleofthumb.html), and women were respected for their role in society.    Alexis de Tocqueville commented on the essential equality of the male and female spheres in Democracy in America (1840) :\n\n“Americans,” he said, did not think that men and women should perform the same tasks, “but they show an equal regard for both their perspective parts; and though their lot is different, they consider both of them as being of equal value.”\n\nWomen have ALWAYS been greatly respected by men for being mothers and nurturers.   What is a more important job than raising a child?   It was only a small number of envious man-haters that decided otherwise.   \n\nThe feminist movement appears to have arisen not do to \"oppression\" but boredom.   Rich women lived lives of luxury most men could only dream of, but they were envious of the social status of their doctor and lawyer male relatives.   They wanted the privileges of both the female and male spheres.  They wanted to \"have it all\".\n\nA number of intellectuals expressed concern, though not as many as you'd expect considering the enormity of what feminists were proposing.   The socialist Earnest Belford Bax claimed that women were already the [privileged sex](https://archive.org/details/fraudoffeminism00baxerich).    The socialist Mother Jones, who spent most of her time organizing male coal miners and fighting child labor, considered it absurd that women could be \"liberated\" by work.   And Nicola Tesla, one of the most brilliant men who ever lived, predicted that \"equality\" between men and women would quickly lead to female superiority and massive social dysfunction: \n\n\"This struggle of the human female toward sex equality will end in a new sex order, with the female as superior. The modern woman, who anticipates in merely superficial phenomena the advancement of her sex, is but a surface symptom of something deeper and more potent fermenting in the bosom of the race.\"\n\nThe Catholic GK Chesterton, who embraced socialist ideas about land reform, suggested that mixing the traditional male and female spheres would be a disaster for society.   \n\nThis [article](http://gkcdaily.blogspot.com/2015/03/chesterton-notorious-anti-feminist.html) provides a decent summary.   \n\n>Woman is wrong, he considers, to try to adapt herself to society by making a man of herself. The contrary should come about—Society should adapt itself to womanhood by becoming gentler. To Feminists, he acknowledges that women undergo a revolting tyranny in factories; but he wanted to destroy the factories, while they, he felt, were content with destroying womanhood.\n\n\"The virtues of the Family and Home, due to free choice and limitation, form the basic cell of the social organism. Banish the spirit of Home, and you suppress the very possibility of a sanely constituted society.\"\n\nChesterton advocated wealth redistribution to the poor so that women wouldn't have to work.   George Orwell, who despite popular belief was a socialist, recommended the same: \n\n\"Far more drastically than anyone has proposed hitherto, taxation will have to be graded so as to encourage child-bearing and to save women with young children from being obliged to work outside the home (CW 16, 223).\"\n\n\"This, of course, is a subject of great interest in India, and roughly what we want discussed is how far women benefit by escaping from home and whether in the long run it is desirable for them to undertake the same work as men” (CW 13, 474).\n\nFeminists set about to destroy the \"patriarchal\" family, but they had nothing to replace it with.   We are not living in hunter-gatherer societies; the idea that the \"whole tribe\" would raise children has amounted instead to children being stuck all day in daycares and classrooms.   Women aren't able to spend as much time with their children as they'd like: they're too busy working.   They have replaced loving husbands with asshole bosses.   In a tragic irony, the \"new American dream\" for women is to become a [housewife](https://www.forbes.com/sites/meghancasserly/2012/09/12/is-opting-out-the-new-american-dream-for-working-women/#3c1b00ad623a).     \n\nThe single mother experiment has been a disaster.    Feminists assumed that men were only needed for their wallets, whereas it turns out that that males are [crucial](http://www.reviewjournal.com/life/family/experts-say-father-s-involvement-pivotal-proper-child-rearing) at every stage of child rearing.   The statistics for children raised by single mothers are nothing short of horrific.  \n\nWhat about men?   Men no longer feel like they have a role to fulfill, so are increasingly dropping out of society.   Suicides are at all time high.   Drug and alcohol addiction is rampant.    \n\nBy privileging girls in school and women in work, young women are now out-earning young men.   This leads to women being unable to find what they consider suitable partners due to hypergamy.  \n\nWomen have become ever more hateful and spiteful toward men.   Part of this is due to feminist lies, part of this is due to being forced to compete with the opposite sex.   The sexes aren't supposed to compete with one another; that's not how we were designed.   We're supposed to be complementary.  Since male leaders don't want to compete with women, they gave them ever more privileges at the expense of men.    So much for patriarchy theory.  \n\nAnd now we find the reason why being a housewife is the new American dream: Research has found that stay-at-home mothers are [happier](http://www.dailymail.co.uk/news/article-3634473/The-job-makes-happiest-Housewife-Survey-finds-stay-home-mothers-satisfied-profession.html) than those who work (female unhappiness is actually at an all time high).   So the whole feminist experiment was a gigantic waste of time.   More than that, it was a potentially fatal social experiment.    \n\nWomen who don't have children are more likely to get [cancer](http://www.everydayhealth.com/womens-health-specialist/childless-women-and-cancer.aspx).   The same applies to women who wait until their thirties to have children (the current trend).    Fewer and fewer women are giving birth.   Since population levels are unsustainable, more and more immigration is required.   This, in turn, leads to increased mistrust in communities.    The ruling class is able to play off workers against one another with ease, preventing solidarity.  \n\nMale creative genius is ignored and suppressed instead of being nurtured.    And for what?   So women can become unhappier?  \n\nIn The Red Pill, Warren Farrell emphasizes flexibility of roles.   But women don't seem to want flexibility for men.   They become resentful of stay at home dads.   They recoil at men expressing emotions.   They refuse to \"date down.\"   They demand all of their traditional privileges.  \n\nThe association between communism and feminism arose mostly from Marx's benefactor Friedrich Engels.   However it is interesting that many of the early socialists rejected his views on the subject and had no problem with traditional gender roles.    They didn't think women should be *forced* to be housewives, but as mentioned, only rich women were privileged enough to conceive of work as liberation.   \n\nFeminists have re-engineered society but it has not helped either men or women.   In the Israeli Kibbutz, which embraces an anarchic form of social organization, people were not given any gender roles but naturally became the most traditionalist society in the world.   This leads me to believe that the vast majority of both men and women prefer behaving like men and women.   We have created a society that ignores the happiness of the 99% and caters to outliers among both sexes -- in particular lesbians.    These outliers should not be oppressed, but they shouldn't dictate how the rest of us behave either.  \n\nIf it is respect and independence women are after, men's rights combined with traditional gender roles would allow them to have both.   They would be respected as mothers, would still be allowed to enter the male sphere if they wished (though only on equal terms -- no feminist bullshit), and wouldn't have to suffer being wage slaves.   They would not be able to simply divorce the man and take the kids and his money, so marriages would remain intact.   Men would likewise be able to act as men again, without being demonized; they would be respected and honored for the work they do to maintain civilization, and would have all the rights that women currently have.   \n\nEgalitarian economics would ensure that the majority of men not be excluded from romance due to hypergamy.   \n\nBonus: Christopher Hitchens: Women shouldn't have to work.  \n\nhttps://www.youtube.com/watch?v=TQas34criFo",
    "title": "A Socialist Defense of Gender Roles",
    "subreddit": "MensRights",
    "timestamp": 1489258273,
    "score": 4,
    "keyword": "mixed race ceo"
  },
  {
    "text": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n\"**Consciousness-raising: A Constant Change of Heart**\n\nFeminists are made, not born. One does not become an advocate of feminist politics simply by having the privilege of having been born female. Like all political positions one becomes a believer in feminist politics through choice and action. When women first organized in groups to talk together about the issue of sexism and male domination, they were clear that females were as socialized to believe sexist thinking and values as males, the difference being simply that males benefited from sexism more than females and were as a consequence less likely to want to surrender patriarchal privilege. Before women could change patriarchy we had to change ourselves; we had to raise our consciousness.\n\nRevolutionary feminist consciousness-raising emphasized the importance of learning about patriarchy as a system of domination, how it became institutionalized and how it is perpetuated and maintained. Understanding the way male domination and sexism was expressed in everyday life created awareness in women of the ways we were victimized, exploited, and, in worse case scenarios, oppressed. Early on in contemporary feminist movement, consciousness-raising groups often became settings where women simply unleashed pent-up hostility and rage about being victimized, with little or no focus on strategies of intervention and transformation. On a basic level many hurt and exploited women used the consciousness-raising group therapeutically. It was the site where they uncovered and openly revealed the depths of their intimate wounds. This confessional aspect served as a healing ritual. Through consciousness-raising women gained the strength to challenge patriarchal forces at work and at home.\n\nImportantly though, the foundation of this work began with women examining sexist thinking and creating strategies where we would change our attitudes and belief via a conversion to feminist thinking and a commitment to feminist politics. Fundamentally, the consciousness-raising (CR) group was a site for conversion. To build a mass-based feminist movement women needed to organize. The consciousness-raising session, which usually took place in someone’s home (rather than public space that had to be rented or donated), was the meeting place. It was the place where seasoned feminist thinkers and activists could recruit new converts. Importantly, communication and dialogue was a central agenda at the consciousness-raising sessions. In many groups a policy was in place which honored everyone’s voice. Women took turns speaking to make sure everyone would be heard. This attempt to create a non-hierarchal model for discussion positively gave every woman a chance to speak but often did not create a context for engaged dialogue. However, in most instances discussion and debate occurred, usually after everyone had spoken at least once.\n\nArgumentative discussion was common in CR groups as it was the way we sought to clarify our collective understanding of the nature of male domination. Only through discussion and disagreement could we begin to find a realistic standpoint on gender exploitation and oppression.\n\nAs feminist thinking, which emerged first in the context of small groups where individuals often knew each other (they may have worked together and/ or were friends), began to be theorized in printed matter so as to reach a wider audience, groups dismantled. The creation of women’s studies as an academic discipline provided another setting where women could be informed about feminist thinking and feminist theory. Many of the women who spearheaded the introduction of women’s studies classes into colleges and universities had been radical activists in civil rights struggles, gay rights, and early feminist movement. Many of them did not have doctorates, which meant that they entered academic institutions receiving lower pay and working longer hours than their colleagues in other disciplines. By the time younger graduate students joined the effort to legitimize feminist scholarship in the academy we knew that it was important to gain higher degrees. Most of us saw our commitment to women’s studies as political action; we were prepared to sacrifice in order to create an academic base for feminist movement.\n\nBy the late ‘70s women’s studies was on its way to becoming an accepted academic discipline. This triumph overshadowed the fact that many of the women who had paved the way for the institutionalization of women’s studies were fired because they had master’s degrees and not doctorates. While some of us returned to graduate school to get PhDs, some of the best and brightest among us did not because they were utterly disillusioned with the university and burnt out from overwork as well as disappointed and enraged that the radical politics undergirding women’s studies was being replaced by liberal reformism. Before too long the women’s studies classroom had replaced the free-for-all consciousness-raising group.\n\nWhereas women from various backgrounds, those who worked solely as housewives or in service jobs, and big-time professional women, could be found in diverse consciousness-raising groups, the academy was and remains a site of class privilege. Privileged white middle-class women who were a numeric majority though not necessarily the radical leaders of contemporary feminist movement often gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential.\n\nSuddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing. These careerbased changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate.\n\nWithout the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make CONSCIOUSNESS-RAISING 11ten gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential. Suddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing.\n\nThese career-based changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate. Without the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make one a “feminist.” Without confronting internalized sexism women who picked up the feminist banner often betrayed the cause in their interactions with other women.\n\nBy the early ‘80s the evocation of a politicized sisterhood, so crucial at the onset of the feminist movement, lost meaning as the terrain of radical feminist politics was overshadowed by a lifestyle based feminism which suggested any woman could be a feminist no matter what her political beliefs. Needless to say such thinking has undermined feminist theory and practice, feminist politics. When feminist movement renews itself, reinforcing again and again the strategies that will enable a mass movement to end sexism and sexist exploitation and oppression for everyone, consciousness-raising will once again attain its original importance. Effectively imitating the model of AA meetings, feminist consciousness-raising groups will take place in communities, offering the message of feminist thinking to everyone irrespective of class, race, or gender. While specific groups based on shared identities might emerge, at the end of every month individuals would be in mixed groups.\n\nFeminist consciousness-raising for males is as essential to revolutionary movement as female groups. Had there been an emphasis on groups for males that taught boys and men about what sexism is and how it can be transformed, it would have been impossible for mass media to portray the movement as anti-male. It would also have preempted the formation of an anti-feminist men’s movement. Often men’s groups were formed in the wake of contemporary feminism that in no way addressed the issues of sexism and male domination. Like the lifestyle-based feminism aimed at women these groups often became therapeutic settings for men to confront their wounds without a critique of patriarchy or a platform of resistance to male domination. Future feminist movement will not make this mistake. Males of all ages need settings where their resistance to sexism is affirmed and valued. Without males as allies in struggle feminist movement will not progress. As it is we have to do so much work to correct the assumption deeply embedded in the cultural psyche that feminism is anti-male. Feminism is anti-sexism. A male who has divested of male privilege, who has embraced feminist politics, is a worthy comrade in struggle, in no way a threat to feminism, whereas a female who remains wedded to sexist thinking and behavior infiltrating feminist movement is a dangerous threat. Significantly, the most powerful intervention made by consciousness-raising groups was the demand that all females confront their internalized sexism, their allegiance to patriarchal thinking and action, and their commitment to feminist conversion. That intervention is still needed. It remains the necessary step for anyone choosing feminist politics. The enemy within must be transformed before we can confront the enemy outside. The threat, the enemy, is sexist thought and behavior. **As long as females take up the banner of feminist politics without addressing and transforming their own sexism, ultimately the movement will be undermined**.\"",
    "title": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1507273110,
    "score": 9,
    "keyword": "mixed race ceo"
  }
]