[
  {
    "text": "Need Unbiased Advice about Interview Conduct Hello Reddit Friends,\n\nI have been stewing with this for a couple of months now and I cannot seem to \"get over it.\"\n\nI was hired for my currently role several months ago in a city that I have never lived in. Within my 2 weeks, the same role opened up in my hometown. Out of courtesy, I asked my team if I can apply for the new local role. They said go for it. So I did.\n\n3 months later, we finally schedule the interview. At the outset, the hiring manager (white lady) out right says \" you are being judged differently\". I did not know that meant but nodded so we can carry on with the interview.\n\nDuring the most crucial question, \"tell me about yourself\", the hiring manger cuts me off, tells me to, in affect, hurry up and moves on the next question. Not letting me finish my answer. At this point I am shook and really do not know what is happening. The rest of the interview, I make the mental realization that I probably am not getting the job.\n\n2 weeks later, I meet the team and hiring manager for the first time at a team retreat. Of course, I want to use this opportunity to get to know the team, ask questions, and introduce myself. When I meet the hiring manager, she/he gave me the cold shoulder and our conversations did not move past \"hi\", \"bye\" and \"how are you?\" I thought this was odd and the opposite of friendly.\n\nIronically, she/he led a talk about DEI later that day, meanwhile I am the only person of color on the team. Felt very hypocritical.\n\nA little while later, the job is offered to a former intern (white dude/dudette) who is less qualified that I am.  I am confused and can't help but put it together in my head that she/he sabotaged my interview and ultimately I never stood a chance.\n\nLater that day, she/he sends me an email at 3am with \"no subject\" line asking if I want feedback on the interview. I initially said yes but then later declined after she/he took a whole week to reply.\n\nThe next instance I see her. She/he is warm, friendly and event tried to hug me. Polar opposite from before.\n\nTo this day, I still do not know what she/he meant by \"you are being judged differently\" and cannot help but feel I was nepoed. I don't know how to feel but I have never encountered this situation before.\n\nI don't want to be judged differently. I want to be judged based on merit.\n\nAm I going crazy/ being petty?",
    "title": "Need Unbiased Advice about Interview Conduct",
    "subreddit": "jobs",
    "timestamp": 1680597925,
    "score": 2,
    "keyword": "white judge"
  },
  {
    "text": "Did I do the right thing? So I’m in training for a new job & I was paired to do a short project with this older guy that was in the military. He has said things I don’t like before, but I always brushed them off because I always think, “whatever, people are not perfect & it’s unfair to judge people for every little thing they say.”\n\nSo the guy has mentioned before that he doesn’t like that democrats want to “take his guns” which is dumb to me, but I did not think it was enough to worry about, even though I lean more towards the Democratic Party. I brushed it off\n\nYesterday got really weird though. I was grouped via zoom alone with him & we were talking about car accidents & he mentioned that his buddy was hit by “an illegal” that “wasn’t even supposed to be in this country” & I was taken aback. I’m Mexican & that term feels gross to me & has been used in hateful ways. This man is white, so it stung more & in the past he mentioned he was annoyed when people spoke Spanish when he was in the military. \n\nThis same day, while we were alone, he said he was catholic & that he does not hate gay people & believes they should have rights, but that they are committing a SIN. This implies the LGBTQ is immoral, so I was really uncomfortable.\n\nI was so annoyed and upset that I told my trainer that I did not want to be grouped with him anymore.\n\nThis caused them to report the guy & I feel strangely guilty.I believe people deserve to believe what they want, even if I disagree, but this felt horrible. \n\nI’m conflicted because I feel like I did the right thing, but I also didn’t try to talk to him about it to resolve it. I didn’t have the energy to with all the other stress I carry & I was grossed out.\n\nShould I have talked it out with him first? Am I a tattletale? Did I do the right thing?",
    "title": "Did I do the right thing?",
    "subreddit": "jobs",
    "timestamp": 1679784548,
    "score": 2,
    "keyword": "white judge"
  },
  {
    "text": "Do you feel strange neither party seems interested in the general insecurity of the labor market? I should note, I have a degree (one I regret enough to wish I were a teenager again). \n\nI can only judge by this subreddit, but...\n\nI've had interviewers talk about \"recent restructuring\" (firing people) *during interviews*. I was \"restructured\" out by a manager who couldn't get me on performance reviews, so he volunteered me out. \n\nI've been underemployed for life; frequently hired in \"newly created __ coordinator\" roles;, never treated like I'm senior (as in, promoted from ___ coordinator to senior __ coordinator or ____ manager, within my job field or title...even after solid performance reviews or years with a company...I'm not saying I should be a senior software engineer tomorrow because I've used an in-demand softare for 7 years, as someone suggested) and only worked for bad companies that didn't really promote people...in self-contained roles and for small teams. \n\nI worked as a temp in \"good companies\" that would churn/burn 10 temps and keep 1 to be trained to \"level up\". My last job was in a dead end job with no hope of promotion or training I wasn't doing by myself. I was basically a team assistant. Thing is, in \"good\" companies, I've seen others promoted from administrative assistants to executive assistants and then ___ \"managers\". In a city, you can make a living off of that, earn $100k/year if you're lucky, but it takes a long time and you have to have the sort of resume to be hired in settings that pay that well. \n\nI know some of this is personal but it really does seem like the person who can \"start in the mail room\", be loyal and hungry, and get promoted frequently, get raises, get paid fairly, get trained new things - things to stay, things to go to bigger and better places...is somewhat rare? If nothing else, it's out of my reach in white collar jobs.\n\nI don't think I appreciated how cyclical firing of people, regardless of their performance or years of experience/duties, is just seen as a very normal thing - cleaning house, even. At least in corporate life. I would have assumed part of this is my field (sales/office support) but this year senior sales guys were fired and it appears people with stronger backgrounds than myself are being let go (again, going by the posts I read in this subreddit - project managers, engineers, cybersecurity staff...finance). \n\nI've never leveled up into a middle manager type role where I don't have to be so afraid. I'm typically in admin roles that are first cut, or they're primarily hired on a contract basis. (A TERRIBLE feeling, and it's another I've noticed - companies over the years that won't hire me fulltime will hire me as a temp. Nobody cares about contracting as a practice.)\n\n\n I'm a millennial, my mother still tells me I can start as a receptionist for H&R Block or start as an entry level claims agent in an insurance company and then be promoted to manager. \n\nI've never worked for a company that invested in me as an employee, even if I worked hard and indicated I wanted to stay/grow into a role. Only exploitative shitty places where there was no ladder. It's all I could get. I wonder if that's more frequent than I'm aware of. I have never been in a \"good job\" in a company with room to grow.\n\n\nHave any of you thought about this stuff as well? Specifically, the normalcy of massive layoffs built into the financial year.",
    "title": "Do you feel strange neither party seems interested in the general insecurity of the labor market?",
    "subreddit": "jobs",
    "timestamp": 1699570152,
    "score": 1,
    "keyword": "white judge"
  },
  {
    "text": "Stumbled across an incel forum that was complaining about how “average women” get so much attention from guys and have it so much easier than the average man in society. They were asked what they consider an average woman, and their top responses were Pam from The Office and Emma Stone Pretty much sums up their mentality. Two tiers of women to the incels: supermodel white women and pretty, very pretty or even model-but-not-quite-supermodel white women.\n\nAlso, “having it easy in life” was ONLY being talked about in the context of dating and getting hit on. That’s literally the only criteria they judged it on.",
    "title": "Stumbled across an incel forum that was complaining about how “average women” get so much attention from guys and have it so much easier than the average man in society. They were asked what they consider an average woman, and their top responses were Pam from The Office and Emma Stone",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692117802,
    "score": 5527,
    "keyword": "white judge"
  },
  {
    "text": "I really hate handling male jurors sometimes I'm a 27 year old law clerk, working for a judge who's often handling jury trials. Today is day one of a two week mess (not getting into details, but it's nonsense). Because we were handling a different case last week, I wasn't available during jury selection, and this is the first time that I'm meeting the jurors.\n\nI walk with a cane as I wait for insurance to approve a necessary surgery (different rant). About a week ago, my cane got stuck in a hole in the sidewalk and caused me to fall. I bruised my knee pretty bad and broke my pinky finger.\n\nMy bruised knee is visible today because I'm wearing a skirt suit. Court appropriate, knee length pencil skirt. A male juror saw my knee and made an oral sex joke. Told me that I should \"use a pillow next time [I'm] on [my] knees.\" It caught me off guard and I said \"what?\" He said that \"a pillow would cushion [my] knees the next time [my] man drops [my] ponytail.\" One other male juror laughed. Several of the female jurors looked uncomfortable.\n\nI brought this issue to my judge because it made me incredibly uncomfortable. He didn't see the issue. My co-clerk said it was fucked up and said that he'd handle the jury for the most part going forward. I feel bad because this was supposed to be my trial, and now my co-clerk has to do a lot of work because of some creep.\n\nThere have definitely been a few times that older male attorneys made odd comments, but I knew that they weren't intended as offensive (having a young woman in law when my city's legal field is still pretty much old white men). This comment from the juror was just so targeted and malicious. It was intended to cause offense. I don't know why he wanted to, but he succeeded. \n\nI know that it was impossible for that juror to know, but it felt even more gross because I'm ace and this is asexual awareness week.\n\n\n\n\nUPDATE/EDIT:\n\nBefore I give an update, I just want to correct some things I've seen a few times in the comments. The confusion is due to how I phrased my post, so sorry about that. First, this was said in the jury room, not the open courtroom. I was the only court officer/personnel in the room, and the judge did not hear the comment directly, just through me (that's not to excuse his reaction, however). Second, the \"they weren't intended as offensive\" comment was just that I have encountered some older attorneys who have said something that they meant as innocuous but phrased it quite poorly, and they apologised for what and how they said it when confronted. I have confronted attorneys when they've said something off-colour, but there's an inherent sense of ease when dealing with attorneys in the courtroom, as they wouldn't risk their careers. It's not that I'm necessarily uneasy around jurors, just that there's a much greater element of the unknown. Third, I am STILL doing most of the work on this trial. This isn't a simple open and shut case (hence the two week timeframe), so there's a lot of legal issues the attorneys are arguing over. I am still in the courtroom listening to their arguments, looking up case law, briefing my judge so he can make a decision. My co-clerk offered to handle the actual jury wrangling, which is doing a headcount to make sure everyone is there before bringing them into the courtroom and answering any questions they have before going in or after being dismissed for a break/recess. It is a lot of work in itself, but it's not the majority of work that goes on in these trials. We've had trial days in other cases where the jury is dismissed at 2:30, but we're still in the courtroom until 6:00 because things have to go on the record, motions have to be made, the law has to be checked. \n\nI also just want to clarify the timeline. The attorneys had just finished putting an issue on the record, so the judge asked me to bring in the jury. I went to their holding room, said something to the effect of \"hi everyone, just doing a quick headcount,\" and it was while counting them that the juror made the first  comment. I asked him \"what?\" because I genuinely thought I misunderstood him as I didn't think anyone would be so brazen. After his second comment, I told them that since everyone was there, they had ten minutes for a bathroom break before I brought them in because we needed to address one more thing in court first. I left. I did not address his comment at the time because I was honestly shocked and disgusted and did not know how to respond. I immediately reported it to my judge, as he is my supervisor and is ultimately in charge of the courtroom. In that reporting, I referred to it as a \"disgusting comment.\" My judge said he didn't see the issue, so it was not brought to the attention of the attorneys. Although I have some power in the courtroom and can chat with the attorneys about case logistics or sports or whatever, it is not within my power to say anything that could suggest to the attorneys that a juror should be discharged from service.\n\nOn the actual update:\n\nThis morning in chambers, I confronted the judge about his reaction yesterday. I told him again that it was disgusting. I told him it was sexual harassment. I told him that it was a \"ghastly remark unbecoming the dignity of the courtroom and gravity of jury service.\" I was particularly proud of the last comment, which I may or may not have spent too much time considering in the shower last night. He still thought I was overreacting and \"probably misunderstood\". My co-clerk and our chambers secretary both sided with me. I told the judge I was going to speak with the jury commissioner. My judge said he would bring it to the attorneys' attention today if I did not go. I still went. I also asked our secretary if she could text her cousin and see if the president judge had any openings in her schedule today. This was done via text so that there was no chance of the judge overhearing and getting mad at the secretary. The president judge does not have any gaps today, but she has one tomorrow; my co-clerk said he'd cover the courtroom if necessary.\n\nThe commissioner is a late 30s/early 40s guy. We have a decent work relationship; everyone in that office is great. I explained the situation and that there's a part of me that thinks (as many of you also suggested) he was only doing it to get out of jury duty. We dismissed a different juror before court yesterday for unrelated reasons, so it's possible he figured he could also be excused. I asked how the commissioner would like me to proceed. He was shocked, to say the least. He asked me if I was comfortable being in the courtroom with the juror. I told him that honestly, now that I had a chance to process it, I was more angry than anything. Yes, I am uncomfortable to some degree, but now I'm angry that he came into my workplace and had the audacity to say something that made other members of my panel uncomfortable. The commissioner told me to \"go momma bear\" and \"destroy him\" if he says anything else. He told me that yes, court officers are held to a higher professional standard than jurors in and out of the courtroom, but I would have his backing if I wanted to go low instead of taking the high road. He also told me to talk to two of the ladies in jury commission because they've been dealing with assholes for decades, so they might have some advice. One of them told me to remind him we had his employment information and use other very open threats that technically aren't threats. The other told me to learn another language and curse them out in that, since he would have a hard time making a report if he didn't know what I said. They also told me that they would flag his name/juror number on the master list to remove him from ever being called again so he can't do or say anything to future law clerks. I love my jury commission folks.\n\nBy the time that conversation was done, we had to actually start court, but while in the courtroom, I shot off an email to one of the HR reps. Basically said \"hey, I discussed this with jury commission but I also wanted to check to see what HR itself says about handling unruly jurors.\" I summarised the situation and am waiting for a response. Idk if it's good or bad that it's been about three hours.\n\nWhen we dismissed for lunch today, a few jurors, both male and female, asked if the situation had been addressed outside their attention. I said I couldn't really discuss things that happen outside their presence, and they took the obvious hint that that meant no. At least one of them had to have gone over to jury commission because one of the ladies texted me \"lol they're here you're good\". \n\nSo yeah, that's where things are sitting about 24 hours later. My judge is still being an ass, but higher powers are now aware. Pretty much every other person who has heard what happened has my back. \n\nFinally, to everyone who has suggested creative ways to smack him with my cane, I appreciate it, and the suggestions made me laugh. To the other law clerks and attorneys thanks for the support and understanding; it helps to have support from people who know how careful each step has to be when dealing with judges, since it's such a delicate dance to keep a job with some of them. To everyone else who offered support, I still appreciate it. To the men here and in my inbox telling me that I need to learn how to do my job and they as a man would have responded differently, kindly piss off. I'm damn good at my job. Within the last month, the appellate court has affirmed two opinions I wrote. I am good at working with jurors to accommodate health issues, childcare concerns, interpersonal conflict. I have never had a single complaint filed against me. I get along well with the attorneys who appear in the courtroom because I make sure the courtroom operates smoothly and the trials can proceed quickly without hiccoughs. Yesterday was very much an exception to the way I run the courtroom. It's easy to brag that as a 6'2\" man, you would've fought him, verbally or physically. When you're a short disabled woman, you have to be a hell of a lot more careful with aggressive men you don't know.",
    "title": "I really hate handling male jurors sometimes",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1698075972,
    "score": 4663,
    "keyword": "white judge"
  },
  {
    "text": "Is it weird that my boyfriend wants to see me r*ped? **Hi this post is really graphic to read, I personally struggled to write it. Please skip for your mental health, if needed!!**\n\n&#x200B;\n\nWe have been together for 4 years and I'm not sure if this belongs here. But I'm hoping for some advice.\n\n&#x200B;\n\nMy boyfriend is very sexual and into some really graphic porn. Like gangbang and double penetration. He often shares his sexual fantasies with me and I don't know how to respond to them, because I'm not really into any of that. I listen because I'm curious what his sexual interests are, but it makes me a little uncomfortable. Anyways, about a few days he shared a fantasy he had of me. He wanted 4 men (specifically black, i'm latina and he's white) to come and r\\*pe me while he watched. He described it as voluntary r\\*pe. I said I'm not into it and he said that it would really turn him on if I was woken up to it. Like if I was asleep and woke up to these 4 men forcing me have sex.\n\n&#x200B;\n\nI don't live with him, I'm in another state so we've been texting a lot about sex. Does anyone have any advice to me? I feel very confused about how to feel. Like I encouraged him to share his fantasies, but now I feel very anxious about what he said. We didn't talk about it again, but he sends me porn videos of a woman with multiple men gang banging her. I don't respond to these videos, but he keeps sending them. I feel like if i tell him to stop, he'll feel judged by me. How should i handle this situation?",
    "title": "Is it weird that my boyfriend wants to see me r*ped?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1696990650,
    "score": 1231,
    "keyword": "white judge"
  },
  {
    "text": "I’m so tired of playing a losing game. So I quit. We need to realize it’s impossible to please people who hate us. \n\nIt’s really become clear to me over the last several years and seeing what’s happening in the world (particularly in the US because that’s where I am) that a disturbingly large portion of humanity simply hates women and will not be convinced otherwise. And it’s not just men, there are plenty of women who hate other women. \n\nWe are constantly judged. No matter what we do, it’s wrong. There is an absolutely impossible standard set for us that no person can ever meet, and yet our perceived failure is seen as a reason to keep hating us. \n\nIf we choose to express ourselves sexually, we’re called sl*ts and wh*res. \n\nIf we choose to not be sexually active, we’re called prudes and “frigid.”\n\nIf we enjoy sex with men, that’s bad. If we enjoy sex with anyone other than men, that’s bad. \n\nIf we choose to pursue an education and career, we’re selfish cold-hearted and will die alone. Especially if we choose not to reproduce. \n\nIf we choose to get married and have a family, we’re lazy and contributing to overpopulation. \n\nIf we are stay at home mothers, we’re mooching off our husbands and sitting on our asses all day and being bad feminists. \n\nIf we are working mothers, we’re neglecting our children and homes. \n\nIf we are happily single, we’re going to be eaten by our cats. \n\nIf we are happily in a relationship, we’re somehow manipulating someone. \n\nIf we take birth control, we are selfish and promiscuous. \n\nIf we get pregnant, we’re irresponsible and stupid. \n\nIf we have an abortion, we’re evil baby killers and trying to duck out of responsibility. \n\nIf we give birth, we’re babytrappers. \n\nIf we dress too seductively, we’re asking for the wrong kind of attention and have no self respect. \n\nIf we don’t dress seductively enough, we’re frumpy and have no self respect. \n\nIf we are cautious around men and try to protect ourselves, we’re paranoid and silly and exaggerating. \n\nIf we aren’t cautious and end up assaulted, we should have been more careful, what were we thinking? \n\nIf we’re in an abusive relationship, we should have been more picky and had higher standards. \n\nIf we refuse someone’s advances, we’re too picky and should “give them a chance.”\n\nIf we’re polite and demure, we are too passive. \n\nIf we stand up for ourselves, we’re too aggressive. \n\nIf we express ourselves, we’re hysterical and too emotional. \n\nIf we hold back, we’re bad communicators. \n\nWe are considered too weak, too fragile, too dumb, too emotional, too vain, too EVERYTHING to be equal to men, but we’re also somehow responsible for every bad thing a man does. Either his mother didn’t raise him right, or girls he pursued wouldn’t date him, or his wife was a nag or stopped putting out, or that woman or little girl was tempting him, or women’s suffrage has somehow disenfranchised him and women’s rights have robbed him of opportunities that used to be reserved for men only. \n\nAnd I’m so tired of this. \n\nWe’re never going to win. Not by playing by their rules. I know many of us have realized this long ago, but for anyone who needs to hear this: you don’t have to keep trying. People will hate you just for existing, and the best revenge is to just keep going, live YOUR best life, fight their attempts to quell us, and stop trying to meet the impossible standards they placed on us. \n\nWe have to keep fighting. We have to push back on these toxic beliefs, not because we’re going to convince them to stop hating us, but because they will never stop hating us. We don’t owe them anything. We owe each other, our allies, and ourselves everything. \n\nMisogyny has always existed and probably always will. Getting rid of it isn’t what we should be trying to do. Instead, we need to take away their power and make it so they can’t keep trying to keep us “in our place.” \n\nVote. Protest. Donate. Talk to people. If you have kids, raise them to be feminists. If you don’t, consider volunteering at shelters or community centers. Be intersectional. This fight affects cis women, trans women, black women, white women, all our LGBTQ+ and POC siblings. And even men. \n\nBecause misogyny and hate hurts everyone. They’re going to hate us no matter what, so we might as well fight for ourselves, our safety, our freedom, our happiness, our future. And let everyone who hates us rot away in their hate. We don’t have to play their game. \n\nI quit. I quit caring what hateful men and women think of me and my life and my choices. I’m don’t playing nice and trying to get along and compromise with people who believe I’m not worthy of freedom and dignity. \n\nThey can call me any name they want, it’s not going to make me keep trying to play their losing game.\n\nEdit: cue the “Reddit cares” message from someone offended by this post. Not only are you a coward and abusing a good feature, but the fact that I upset you by not caring about you is hilariously ironic.",
    "title": "I’m so tired of playing a losing game. So I quit.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1677865311,
    "score": 824,
    "keyword": "white judge"
  },
  {
    "text": "Psychiatrist described me as “petite attractive young woman” in his notes Not my psychiatrist, thankfully, but by a contracted doctor I was sent to see for an evaluation by the (US) Social Security Administration for my disability case. I know that this was in his documentation he sent to social security because it was directly quoted by two male judges in their denial letters. I don’t know why they both felt the need to include that quote, but they’re clearly both implying that this is relevant to me being (or NOT being, according to these judges) disabled. They’re all old white men and they’re all aware from my medical records that I have PTSD after years of sexual abuse when I was a teen. This whole process has been devastating on top of grieving everything I’ve lost due to my health conditions, and these comments in the midst of these denial letters both disgust and infuriate me. Not to mention the 71 year old psychiatrist that they made me see feeling it’s appropriate to write this in the first place. The icing on the cake is that despite both judges quoting said psychiatrist, they both concluded that his decision that I am disabled was determined to be “not persuasive”/disregarded because I only met with this doctor once.",
    "title": "Psychiatrist described me as “petite attractive young woman” in his notes",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687983243,
    "score": 234,
    "keyword": "white judge"
  },
  {
    "text": "How have random men harassed you for being fat/ugly in public? A few incidents of this from my past have been on my mind lately, so I thought I'd share them and invite others to share as well. We talk a lot (as we should) about the sexual harassment and intimidation that attractive women have to put up with from random male strangers. But as those of us who are not conventionally hot or skinny can tell you, when men aren't treating us like we're invisible dirt, they're making their displeasure with our appearance very much known. And I think this conversation is worth having, not just to validate one of the many traumas of being an unattractive woman in this world, but also because it reveals how these are just two sides of the same coin: male entitlement, surveillance, and psychological terrorism. (If you think that last one is an exaggeration, bite me.) Men who harass women in public, no matter the nature of that harassment, are asserting that we exist for them to look at, judge, and either consume or reject, at will.\n\nHere are a few experiences I've had. Fortunately a couple of them have satisfying-ish endings where I stood up for myself, but rest assured they are all singularly unpleasant, shameful, painful memories, that I now have to carry around with me, through no fault of my own.\n\n* I was in Providence, RI, doing some research for school. I was standing on a corner waiting to cross the street, when all of a sudden I heard from behind me, in a sort of high-pitched yodel: \"SOOIE!\" (For those who don't know, this is a traditional way farmers call their pigs. This was also when I was at my fattest.) I turned around, looking for the source, but didn't see anyone. As soon as I had turned back around, again: \"SOOOO-IE!\" This time when I looked behind me, I realized there were two young bro-y white guys sitting in a car waiting for the light to change. But they weren't looking at me, and seemed to be minding their own business. I turned around again, really bewildered and humiliated at this point. You guessed it: \"SOOIE!!\" It happened once or twice more, and I was so upset and flustered that it was only after they had driven away that I put it together. These guys were calling me a fat pig in the cruelest, shittiest way possible, then acting all innocent when I turned around to confront them. I'm sure the combination of insulting me and making a fool out of me was absolutely hilarious to them. And best of all for them, they were in a car, so once they'd had their fun they could just drive off scot-free. It still makes me mad and ashamed to the point of tears when I think about it. How I wish I had put two and two together in time to let them have it.\n* Another time I was on my way to a morning class, halfway through a crosswalk, still half-asleep and lost in whatever thought I was lost in, when all of a sudden the car I was crossing right in front of honked, which was EXTREMELY loud at point-blank distance as you can imagine, and scared the shit out of me. Def jumped a few feet in the air. I look up and the old guy sitting behind the wheel is laughing his ass off. Startling and upsetting this random fat chick was the funniest thing in the world and I could tell he was super proud of himself. This is one of the Good Endings, though. The light was still red, so instead of walking away, I went right up to the driver's side window. Knocked on the glass and everything. Asked, \"Did you want something?\" in an assertive voice, loud enough for him to hear me through the window. Y'all, he was FLABBERGASTED that I was confronting him. Had no idea what to do. I gestured at him to roll the window down so we could chat: he most certainly did not roll the window down. Made some flustered gestures at me through the glass. No, he didn't want anything, sorry. \"Oh, you didn't? Great.\" Left him there at the light, hopefully with his pants full of shit.\n* This last one lasted all of five seconds. Sitting on a brick wall talking to my friend on the phone, when once again I have the shit scared out of me, this time by a car full of teenage boys going past with all of the windows down and all of them SCREAMING at me at the top of their lungs. I think some of them were just wordlessly screaming, whereas others were shouting insults. Another Good Ending: I only had a split second to react, but somehow thankfully had it together enough to muffle my phone against my chest (so as not to deafen my poor friend) and yell back \"EAT SHIT!!\" with a big thumbs up. It was *GREAT* watching those fuckers grins disappear and turn to confusion and anger.\n\nWow, just realizing now that all of these instances were of men in cars harassing me as a pedestrian. Fucking cowards in their fucking coward-mobiles.\n\nIf anyone wants to share, please feel free to do so in the comments. Has this ever happened to you? How did you react? What would you tell the asshole now, if you could? What the ever-loving fuck is wrong with men?",
    "title": "How have random men harassed you for being fat/ugly in public?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1683395124,
    "score": 175,
    "keyword": "white judge"
  },
  {
    "text": "One Year Later: The Repurcussians of Anti-abortion Legislation It has been a year since the Supreme Court stripped women of their nearly 50 year right to make their own reproductive health-care decisions. This is the result. \n\n1) For the first time ever, a majority of Americans say abortion is morally acceptable and recent abortion laws are too strict.\n\n2) For the first time in two decades, more people identify as pro-choice than pro-life.\n\n3) For the first time in 49 years, “The Dobbs decision transferred all-or-nothing disputes to the states” (Wall Street Journal), an undue burden on state supreme courts.\n\n4) A recent NBC News poll found voters who oppose the court’s actions include 55 percent of men, 67 percent of women, 66 percent of suburban women, 77 percent of female voters ages 18-49, 92 percent of Democrats, 60 percent of independents and 31 percent of Republicans.\n\n5) A March17 - May 18 Kaiser Family Foundation survey of 569 OBGYN doctors revealed shocking findings: “68 percent found the [Dobbs] ruling has worsened their ability to manage pregnancy-related emergencies, [and] has worsened pregnancy-related mortality (64 percent), racial and ethnic inequities in maternal health (70 percent) and the ability to attract new OBGYNs to the field (55 percent).”\n\n6) Michele Goodwin, a legal expert in bioethics and health law, notes “A dramatic proliferation in anti-abortion legislation in the United States has coincided with this nation becoming the deadliest in the `developed world’ to be pregnant and attempt to give birth” (Ms., May 24, 2022).\n\n7) Black women are 3.5 times more likely to die due to maternal mortality than their white counterparts, unabated by abortion bans.\n\n8) The states with the highest maternal mortality rates also lead the nation in anti-abortion legislation.\n\n9) Isabella Oishi, Georgetown Law student, writes that since the Texas Heartbeat Act became law, it did not reduce the need for abortion care. Rather, there has been an 11-fold increase in Texans crossing state lines for abortions.\n\n10) Oishi further reveals that states prohibiting women to seek abortions in other states is “likely unconstitutional based on the right to travel, the Privileges and Immunities Clause and the Dormant Commerce Clause. The anti abortion legislation harkens back to the (1793) Fugitive Slave Act.”\n\n11) Federal judge, Colleen Kollar-Kotelly, announced a constitutional right to abortion may be found in the 13th Amendment, ratified at the end of the Civil War in 1865 -- made slavery and involuntary servitude illegal. This is an area that was ignored by the Supreme Court.\n\n12) Andrew Koppelman, author of “Forced Labor: A Thirteenth Amendment Defense of Abortion,” writes “forced pregnancy’s violation of personal liberty is obvious. Restrictions on abortion also violate the 13th amendment’s guarantee of equality, because forcing women to be mothers makes them into a servant caste, a group that, by virtue of a status of birth, is held subject to a special duty to serve others and not themselves”.\n\n13) Elie Mystal, a legal scholar, wrote in the March 2022 issue of The Nation: “these anti-abortion states are borrowing traces of the sadistic logic and psychological tactics of this country’s enslavers.” As recently as June 29, Ja’han Jones, a research-based author, concurred with Mystal by noting “with abortion rights being rescinded across the country, it’s more important than ever that we call restrictions on this vital procedure what they actually are: slavery.”\n\nThe issues of pro-choice vs. pro-life, awareness of the 13th Amendment’s slavery and involuntary servitude prohibition, OBGYN doctor concerns, morality and maternal mortality have come center stage to voters and the 2024 election. GOP candidates will – most likely -- purposely ignore these multitude of findings while Democrats will tout women’s reproductive rights.\n\nSCOTUS’s 6-3 decision created this unnecessary chaos for 334 million Americans.\n\n[Source](https://thefulcrum.us/consequences-and-repercussions-scotus-dobbs)",
    "title": "One Year Later: The Repurcussians of Anti-abortion Legislation",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689252596,
    "score": 34,
    "keyword": "white judge"
  },
  {
    "text": "I became the healthcare outlier Hi folks. I'm sure that many people reading this are on some form of birth control, whether it's a pill, a patch, a ring, or an implant of some sort. This story isn't meant to scare you, or make you feel like you're making a wrong choice for your health by taking a hormonal birth control. Instead, I hope it acts as a flag for people who, like me, tend to minimize health issues.\n\nA touch of background. I'm a female, mid-twenties, mid-weight, low-height, and overall healthy. I don't smoke, I barely drink (it makes me pukey and sad) and I focus on physical activity for activity's sake, without any particular goal. For my entire life, my heart, lungs, and other giblets have been almost entirely flawless, save for a few hiccups here and there due to my digestive system handling stress about as well as a jellyfish in a furnace. My only long-term issue has been anemia because of heavy periods and a vegetarian-inclined diet (beef makes me sad). I wouldn't consider myself anyone special. I am just a normal white lady who likes long walks and eating carbs.\n\nOn the 12 of April, I went to the doctor. It was something I had been putting off because I didn't want to freak myself out. I can be a bit of a hypochondriac since I spend possibly too much time on medical subreddits, so I try to balance myself by avoiding doctors whenever I can. I've gone in too many times to discover that I am, in fact, a very healthy person who is extremely anxious. However, this time, I felt like I had a real reason: I was short of breath. It was more than likely that I was making a mountain our of a molehill, or a pulmonary embolism out of an iron deficiency, but since I was about to go on a long road trip without access to pharmacies, I thought ah, fuck it, I should probably go. Maybe my doc could prescribe some extra-strength iron supplements, or give me some other advice to keep from feeling woozy all the time. Whatever.\n\nI was doing my best to ignore the scariest issue that it COULD be, because it seemed so ridiculous that it could be something as serious as a pulmonary embolism. I knew that there was a risk because of my birth control, Yaz. But it was a tiny, tiny risk. I was sure that I was being paranoid. After all, I still felt fine. My O2 was 100%, I had no pain in my arms, neck, or shoulders, or discoloration or any sort, or any bleeding out of unusual holes. Plus, Yaz had been an absolute godsend in all other ways-- it leveled out my mood, made my uterus not a dickhead, and had given me new energy. I felt like a tampon commercial because of it. Surely it was just me being a weenie.\n\nMy doctor listened to me describe my symptoms and tell her about how I came in because of shortness of breath on birth control, logged my concerns as \"potential stress, anemia, concerns regarding shortness of breath on Yaz\" because, as I told her, I was 99.9% sure it was nothing but my stupid Dasani-quality blood messing with me. I was sent in for a few blood tests-- two for anemia, and one, D-Dimer, to detect particular chemicals that break down blood clots. D-Dimer, she said, gives false positives 40%-60% of the time, but regardless, if it came back positive, I would be scheduled for a CT scan with contrast to be safe.\n\nWouldn't you know it-- I came back with both anemia and a positive D-Dimer. My CT scan was scheduled for a few days out, and I waited anxiously, noticing the tightness in my chest more and more because, after all, I am a huge paranoid dweebus. I try but frequently fail to ignore the WebMD symptom checker in my head that tries to diagnose me with the worst possible diseases. I knew that the scan would be a wonderful money bonfire that would do nothing but reassure me that my lungs were doing exactly what lungs should be doing.\n\nSpoiler alert: not exactly.\n\nWhile I was sitting and waiting to see if I had any reaction to the contrast solution, I heard one of the techs processing my scan say \"oh, what's that?\". This was followed by every scrub-wearing professional staring at the screen. When I was walked back out to the waiting room, the tech who had placed my IV squeezed my shoulder and said 'good luck!'. I didn't think anything of it because who would-- healthcare professionals are lovely people most of the time. But when I got home and checked my phone to find five missed calls from my doctor, I realized that I should have probably taken a hint. She told me that I needed to get to the ER immediately.\n\nWhy, you ask? Well, I don't have a pulmonary embolism. I have four. Three in my left lung, one in my right. I took an ambulance to the hospital with a pair of bamboozled EMTs who simply couldn't believe that I was a walking, talking 20-something who had a normal BP and perfect O2 saturation. They informed me, politely, that most people with PE are grey and unable to talk, and are usually intubated en route. When I arrived at the ER, my EKG showed that my heart was just only starting to show the strain of having spent weeks dealing with back pressure in my arteries-- explaining the slowly developing tension in my chest over the past few days, which I had put down to health anxiety. Otherwise, I showed no signs of being sick at all, other than being slightly out of breath.\n\nAfter a delightful 24 hours in the ER, I'm back home. I'm decidedly off Yaz and on a thiccque dose of anticoagulants for the next three months. The clots in my lungs will (god willin') slowly dissolve, but until then I will continue to struggle to do things like go up stairs, or walk my dog. Those worsening symptoms I noticed? Turns out they weren't just in my head. It was my body struggling to compensate for the clogged arteries in my lungs. My heart is still very mad at me, and my lungs are even madder. What started as shortness of breath while jogging has become shortness of breath when standing, when walking. It sucks massive, massive ass. But I'm incredibly lucky.\n\n I am not anyone special, so I don't blame you if you don't read my story, but I had to write it down because it scared the shit out of me. I feel like it's so incredibly important for women to not let the 'government certified' unlikelihood of serious health conditions make them neglect their instinctual concerns about their health. I showed no signs of DVT or PE at any time, aside from being slightly short of breath when exercising. Every single doctor I saw in the ER was baffled by the fact that my lungs sounded clear and strong and that all my vital signs were totally normal. Please, please listen to yourself when things seem fishy. Being judged as a 'hysterical woman' is ok if it means you keep being alive.\n\nTL;DR: I, a perfectly healthy mid-twenty year old, have four clots in my lungs because of a modern birth control that is considered safe. I will fortunately recover, but if I hadn't trusted my gut and continued to think it was anemia, there's a good chance that one of those clots would had dislodged and possibly killed me. Even if it is 'just' anemia, or 'just' stress, it is worth treating seriously. Always, ALWAYS see a doctor for shortness of breath if you're on birth control.",
    "title": "I became the healthcare outlier",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1681538337,
    "score": 29,
    "keyword": "white judge"
  },
  {
    "text": "Rant: middle age women complaining about how \"these young mothers just want to be comfortable\" and romanticizing struggle I (25f) am and will forever be childfree by choice. I feel as strong about being childfree as I feel about granting every parent out there the right to live their paternity/maternity at their fullest and enjoy it as comfortably as they can and their means allow. If needed I will physically fight anyone judging mothers for taking time off or \"getting themselves comfortable\" by things such as small as an electric breast pump, not breastfeeding or hiring a nanny for whenever they need some time away (trust me, i have seen a couple).\n\nSo my mom was having surgery today and I was sitting waiting for news in the same waiting room with a young mother and her girl , the baby was maybe less than a year and was sleeping in her arms, she decided to wait an hour for some lab results about her child's explosive dhiarrea or something and she did not want to go back home and come back in the afternoon because she had been spending lots of money on the childs issues recently and did not want to pay for transportation twice in a day. We were making small talk about how she is an engineering student at the same college i went to and teachers and blablablaa and she was also complaining about the lack of baby changing tables in the restrooms of a private center like that that had just recently been refurbished, we live in a town in a developing country but still, this is a new 4-story building that offers more than 20 specialties, for my money least they could is not have people chaging their babies diapers on a chair in the hallway. The restroom was right in front of where I was sitting and all of the sudden she goes like \"if I dont go now I will pee myself, would you hold her?\" I know this is not a normal practice but since I saw other people saw her ask me and it would be just a couple minutes I said yes. So I took the baby.\n\nComes a women who was also sitting with us and starts complaining about how irresponsible it is to just hand your child like that. I know, not the best but that girl took the fastest pee ever seen by a human, she literally came back less than 2 minutes after. And I was literally sitting in front of the door with like 20 witnesses of her giving me the kid, what was I going to do? Steal her? So this blonde middle age woman (i would say early 60s) goes on about how this is wrong and that's why kids nowadays are neglected because of \"free mothers\". I told her kind of trying to get her to calm down before the other women came from the restroom \"it's complicated because what was she going to do? Wear a diaper?\" Then she started on about how you are supposed to \"train your body\" when you have a child so you dont do things like that. Yeah, right, after 1 hour holding pee I would just pee myself but hey, the old lady is happy I did jot hand my child to someone else before going to pee.\n\nThen comes back the mother and takes the baby from me, same baby who happens to have taken the biggest and most liquid shit ever recorded in human history from such a small being. >! There was dark yellow-brownish-smelly stuff in my arm and I swear I regretted being alive in that moment. It was outside her diaper, on her pants and when the mother took her I also saw it in her back !< \n\nThe mother says sorry and lady #2 (Dominican version of your classic white-american Karen) starts explaining that that's why you dont give your child to strangers, because they dont have the same patience with your child that you have. I SAID NOTHING, PEOPLE, i did not complain although I was dying of ew inside, I even asked the mother if she wanted my wet towels when she said she had run out because the baby had been shitting all day and she could not clean her so well without changing tables so she wasted lots instead of her normal 4. In the end i just gave her the pack from my mom's bag although they are not the same brand as she had used, I think this lady was broke-ish because she did ask to take the whole pack or maybe she just didnt want to go to the pharmacy idk.\n\nThen goes lady Karen and starts telling us about how these mothers are so comfortable that end up not even wanting to breastfeed and are incapable of changing their baby diapers anywhere, then proceeds to explain how she had to change her baby's sometimes in buses because they were running late for some shit. I tried to explain how \"your generation had those struggles so we didnt have to have them\" to try to lighten the mood and we ended up changing topics. She also made comments about how baby carriers are not safe and end up creating \"trambotic\" babies. The word she used in spanish was \"bebés tullidos\", which is explicitly despective for someone with a discapacity. The mother I was talking to had an emptu baby carrier on her without using it, maybe for when the kid is awake idk.\n\nBut for the love of whatever god you believe in, it's two pm and you see a women who has been around with a baby since 6 am trying to figure out why she has fevers and crazy dhiarrea, you dont make comments like that. \n\nAnyway, too long post. I just hope this changes some day. I think people our age is going to be kinder with maternity and after this type of person (who I dont believe can change at this point) dies, we'll have a better world where most people can support others and help them get basic rights and acommondations to be parents and stop making other peoples struggles about ourselves or how we did it better.",
    "title": "Rant: middle age women complaining about how \"these young mothers just want to be comfortable\" and romanticizing struggle",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687913421,
    "score": 7,
    "keyword": "white judge"
  },
  {
    "text": "Hot Take: It's Time to Stop Blaming the Pandemic Yes, kids post-pandemic are a different breed, and it's getting worse every year. But my state has been fully in person for 3 years now. The kids who spent a semester online did have some catching up to do, but their behavior was developmentally appropriate, they adjusted socially pretty quickly, and it was easy to smooth out the rough academic edges. The kids the year after that, not so much. The year after that, worse. This year has been absolutely bonkers and we just finished quarter 1. I keep hearing parents blaming the time kids spent online, that they got behind and are still suffering, and I'm honestly sick of it. Most of them spent the same amount of time online as the kids 3 years ago, and they were younger when it happened, so I really don't understand the excuse. My 4th graders this year were literally in kindergarten. My colleagues teaching 2nd and 3rd are having similar issues with kids who never had to do school online. It wasn't the pandemic. My 4th graders have the academic skills and maturity of 1st graders. I have students who roll around and hide under desks, can't read or write, and do subtraction with tally marks. Even our accelerated program has had to be toned down to the point that those teachers have admitted that basically any 4th grader can keep up, the parents just like the social prestige of having their kid in the advanced group.  \nPoint being, I think it's time we examine the parenting habits developed during the pandemic that are really the source of the problem here. When parents tell me that their child is still catching up from being online (in KINDERGARTEN), I have started asking them how their routine changed during online schooling, and what parts of those routines didn't change when life got back to normal. Parents will often tell me that they had to resort to their child getting a lot of screen time so they could work from home, and that now their child spends most of their free time on the iPad. They can't get their kid to show any interest in reading, and refuse to play any educational games to supplement their Roblox time.  \n\nI am not judging parents for going into survivial mode then, but let's be honest with ourselves, here. Your child does not read at a first grade level because they spent part of kindergarten online. They've had all of first, second, and third grade to make progress. They aren't reading at home and they haven't had to spend any time thinking for themselves without a screen in front of their face for basically their entire lives. Developmental scientists have been warning about this for years before it got this bad. Whatever you started doing during the pandemic that you haven't stopped doing is the real issue.  \n\nTo top it off, they are so uninvolved in their child's development that learning ends when their child leaves school. Pre-COVID, when I told parents their child was struggling with something, the assumption was that I was addressing it at school, and they asked what they could do to help at home. Now, parents look at me and ask me what I'm doing about the problem. When I explain my intervention process, and show documentation, they ask me why I don't start offering after school tutoring. When I offer online resources, book suggestions, games, etc., they tell me that they're not a teacher and \"don't know anything about that stuff\". I don't know where this culture of \"the teacher is the only one responsible for my kids' learning\" came from but I'm TIRED. I'm also tired of entitled parents in the community complaining about teachers who stay firm in their expectations and don't bend to their will.  \nP.S, I know that many states stayed online a lot longer than mine. We did not handle things in the best way, and teachers were terrified to return to work. My point is that life has been mostly back to normal for long enough that we can't keep blaming COVID.\n\nEDIT: This post was never meant to be a black-and-white hard line in the sand. COVID was absolutely traumatic for these young kids, their parents, and the teachers, and I understand that the effects will be felt for a long time. I am immunocomprimised and considered leaving the profession when I was told we were returning fully in-person in November of 2020. I have lost people to COVID, almost lost people, and people I love are living with the effects of long COVID. I thought that I had made me point clear enough, but in case I did not, I apologize to anyone to whom this sounded like a \"COVID is over, everyone move on already\" post. That is not the stand I am taking. But imagine my frustration at the same parents who denied the existence of COVID saying \"welp, what are ya gonna do with these COVID kids, amirite?\". Firstly, like any trauma, our follow-up actions or inaction can lead to more adverse effects. Continuing to shrug off issues because COVID happened is wrong. Moreover, I don't deny that COVID was a catalyst for glaring societal problems worsening, problems that are not necessarily only on the fault of the parent. However, I don't think it's a coincidence that the precise things developmental scientists were warning about RE: screen time pre-2010 are exactly what we are seeing now. If we keep blaming COVID and doing nothing, we are going to have a generation of kids who lack critical thinking skills, are socially maladjusted, and cannot perform basic academic functions who never even participated in online school.",
    "title": "Hot Take: It's Time to Stop Blaming the Pandemic",
    "subreddit": "Teachers",
    "timestamp": 1695769004,
    "score": 1396,
    "keyword": "white judge"
  },
  {
    "text": "Was this teacher out of bounds to comment on my child’s social life? My daughter is 9th grade at a new school, her math teacher sent a LONG email the other week commenting about how my daughter(we are black) never interacts with other black students. According to her, all her friends are white, she doesn’t even really associate herself with the lack students. The school is predominantly white, she has a lot of white teammates for basketball and soccer. I thought it was highly inappropriate for her to even comment on my daughter’s social life, her job is to teach and not to be judge and jury. She thinks that she’s not embracing all of her identity and I’m so mad about what I’ve read. Should I complain to administration?",
    "title": "Was this teacher out of bounds to comment on my child’s social life?",
    "subreddit": "Teachers",
    "timestamp": 1681469096,
    "score": 325,
    "keyword": "white judge"
  },
  {
    "text": "Suggestions for Dressing Like Iconic Christmas Movie Characters The last week of Christmas I'd like to dress up like famous holiday movie characters. I'm looking for suggestions that are more on the subtle side - no pink bunny pajamas or Elf suit. Think Judge Reinhold's ugly sweaters in The Santa Clause or Uncle Eddie's mock turtleneck under a white sweater.\n\nI usually do something similar for Halloween and my students love guessing which characters I am. I need ideas for Christmas, too.",
    "title": "Suggestions for Dressing Like Iconic Christmas Movie Characters",
    "subreddit": "Teachers",
    "timestamp": 1700670988,
    "score": 1,
    "keyword": "white judge"
  },
  {
    "text": "Afraid to File a HR Complaint I know this isn't typical \"work reform\", but I feel like it's something that deserves more attention here. \n\n&#x200B;\n\nWarning: Long tl;dr at bottom \n\n&#x200B;\n\nI am a white male, CISHET presenting human. (I'm fairly pansexual) I am currently working as a mountain bike trail builder for a small town, and it's a job I absolutely adore. This is true for my winter role as well. The problem is that in the summer, I loathe many my coworkers. It didn't take long to realize that I just didn't want to interact with them because of their topic of conversation, and the \"know-it-allness\" of one of them. \n\n&#x200B;\n\nSo it all came to a head the other day when I expressed my opinion of what the next work on the trails should be. And the Know-it-all guy rolled his eyes as if to say \"oh look at the dumbass speaking\". This when he hasn't been on our trails all summer due to injury, and every day we go to perform the work he keeps telling the bosses we should do, having a reason not to help. \n\n&#x200B;\n\nSo I called him on it by saying \"Could you not? Especially if you're not going to come help string trim?\" And he fucking blew up at me \"Why, I could string trim circles around you!\" Yeah, I don't really care, it's irrelevant. He continues to lash out and act a fool, even saying I'm the cause for all the problems on the team. \n\n&#x200B;\n\nStatistically, he's right. In a later team meeting I mentioned my being the outsider of the group, and that's okay with me. I always have been. (Two of them and a boss work together on a different winter job, and the other guy has worked with them for years.) I have various examples of this being true, and was told then by one of them \"that's not how it works here, you're not the outside person, you're not a victim.\" or something of this sort. \n\n&#x200B;\n\nI even mentioned to my boss that when I realized their conversation topics were not things I want to talk about, I just stepped out of them. He then proceeded to ask me if that was the best thing to do, placing the blame on me. Here's the conversation topics:\n\n&#x200B;\n\nThis girl they had nicknamed \"solar eclipse\" because she was under 18 and you can't look at her. Now that she's turned 18, she's referred to as \"Lunar\" and they gawk more openly. Kinda like when Emma Watson was turning 18 and people essentially had countdowns for it.\n\n&#x200B;\n\nThey spend much of their time talking shitty about, or making fun of people when they're not around said person. Even those they claim to be friends with.\n\n&#x200B;\n\nI have heard many times the valuation of women according to the size of their tits. Or rather, the only characteristics I hear about women from these men are bodily characterists. And of course one of them who is about to be a father is the typical \"I have to protect my daughter from men\" types, which is to say he feels he needs to protect her from people like himself and his friends.\n\n&#x200B;\n\nThey still call things they don't like \"gay\". They refer to some traits of humans, derogatorily, as \"woman\" or \"female\". \n\n&#x200B;\n\nAnd you can most certainly, according to them, judge the quality of a Mexican restaurant according to \"little abeualitas in the  kitchen.\"\n\n&#x200B;\n\nOh, and they also leave their work trucks idling when mowing large lawns for an hour or two at a time so they can get into a cold truck when they're done. Even when it's parked next to the climate controlled building our team office is in.  Or when they go into the store for minutes at a time, or gather implements for the day from storage, etc.\n\n&#x200B;\n\nFuck this drives me nuts.\n\n&#x200B;\n\nIt's a team of five. I only get along with one of them. And since the foreman is on a winter crew with two of them as EMTs at a different job, he's probably not going to support me in this, either. He's too close to the problem.\n\n&#x200B;\n\nThe boss/manager litterally just sat there while the dude raged at me, and him, about me being the problem with the team, because no one challenged them then. (I've only directly done so twice.) So he's not really capable of being quality help, and spent his time explaining to me that he hired people for their strengths, and thus doesn't focus on their weaknesses. Weaknesses such as laziness, being an argumentative know-it-all, etc. I was also told that if someone is causing problems and can't work as a team member, he has no reason to invite them back for the next season. Which I'm guessing is me, the guy who's waiting to be screened for Autism and ADHD. Cause it's true, I'm the burr under the saddle, and against sexism/racism/homophobia like this, I'm okay with being the odd person out until it makes my life miserable in a place it shouldn't. \n\n&#x200B;\n\nThere is no way there won't be retaliation if I take this to HR. I see no way it will get smoothed over, either. Because I just don't tolerate this sort of shit and don't want to be around it. So by removing myself from it, I'm accused of \"having a shitty attitude.\"\n\n&#x200B;\n\nAnd it's not like they wouldn't hide all this in front of women, or Mexicans, or gay people.  The bosses don't see it, and I do because I'm sort of out in the field with them. And it's not just them. I hear this bullshit in my locker room at the other job, particularly during our Pride week. One guy even talked about how stupid and illogical women are while I was, ironically, on the phone with my partner who is a professor. And if I file a complaint, it's basically the equivalent of dropping an armed hand grenade in the room while they're wearing body armor and I'm not. I really don't know what to do. Especially without putting my winter role at this job in jeopardy, when this crew isn't around and I get along with everyone because they aren't like this. \n\n&#x200B;\n\n&#x200B;\n\ntl;dr I work with a bunch of men who only talk about women according to physical characteristics, judge Mexican restaurants by \"the little abeualitas\" in the kitchen, and spend a lot of time talking shit about their \"friends\" behind their backs, and letting truck engines idle for hours a day. I removed myself from these interactions, and have had to defend myself a couple times, and am accused of having a shitty attitude and being the source of all friction from the team. But if I take it to HR, there is no way there won't be retaliation, and it might cost me ability to work a labor service I really love providing for the community. \n\n&#x200B;\n\nI just needed somewhere a bit to rant. Maybe to get some insight.",
    "title": "Afraid to File a HR Complaint",
    "subreddit": "WorkReform",
    "timestamp": 1690666358,
    "score": 9,
    "keyword": "white judge"
  },
  {
    "text": "29m; rock bottom; what type of careers would be something I can work towards? Good afternoon everyone,\r\n\n\r  \n   I am facing a big existential crisis in my life and I feel hopeless and stuck to move forward in my life. Around 2015, I dropped out of York University from my Sociology degree due to mental health and overwhelm which caused a lot of problems because currently I am engaged in acquiring documentation for an academic petition and hoping that its successful in removing my bad grades. I feel like York has me in a bind because I cannot easily transfer to other universities or programs due to a low GPA. I never had a math or science background in high school, my average was around a 77. I have zero degrees right now or diplomas, all I did was work a series of jobs in the retail, landscape, construction, fast food, one healthcare adjacent role and they didn't pan out into anything. Did an IT program in 2021 and got a sec+ certification but nothing came out of it. I have come to the realization that tons of white collar jobs require at minimum a degree as of today.\r  \n\r  \n   At this point, I am unsure of what career to work towards that will help me acquire a sense of fulfillment and higher than average income. Currently, I have been reflecting and thought I would like to become a social worker or registered clinical counsellor/psychotherapist because I like to help people, but I'm worried about how much time it would take for me to get there given that I am the age I am right now. I also considered going back to school to get prereqs done for nursing but that depends on how I perform in the prereqs at adult school. I am looking to go back to York in January to do the winter semester to raise my GPA. Then there's the problem if I go to college instead of finishing my degree it will rule out any grad school/masters program opportunities which I don't want to happen. For me, having a degree felt like something necessary and it still feels necessary to me due to the above. I have never made over 35k a year in my life, I come from a poor family with a lot of dysfunction.\r  \n\r  \n   Right now, I still live at home and don't have many bills but I want to increase my earnings potential because at some point I want my own place and meet a girl and start a life I am proud of. I just feel like I am so behind in life and I want to be successful but my brain is such a mess and I'm overwhelmed all the time having anxiety attacks and major depressive lows. I hate that I am getting to the point where I cannot say if I will be okay and have passive suicidality which is scaring me too. At the moment, I am working on getting a long-term therapist to work with me to move forward. I have about 45k saved up which I have not put towards any investment vehicles.\r  \n\r  \n   My friends don't judge me but I am so angry at myself for where I am at. The years from 21-28 felt wasted and I don't know how to reconcile with it. I just want a sense of dignity and be able to take care of myself and feel okay about my future. A new lease on my academic life would be incredible, just the ability to restart somehow. I believe I am smart, adaptable, quick learning, and possess incredible people skills but do not know how to translate this into a prosperous career. I am ambitious and am willing to work hard but I struggle with knowing what's the right path to take. Maybe some intelligent people here can give me some insight as to what I should do in terms of possible pathways. I really need some moral support, I feel so alone.\r  \n\r  \nLocated in (Toronto, Ontario) for advice purposes.\r  \n\r  \nThanks for reading if you got this far,\r  \n\r  \nHave a great day.",
    "title": "29m; rock bottom; what type of careers would be something I can work towards?",
    "subreddit": "careerguidance",
    "timestamp": 1699385261,
    "score": 1,
    "keyword": "white judge"
  },
  {
    "text": "FYI: the guy who \"Name and Shamed\" his employer on this subreddit lost the defamation lawsuit against him A little while ago there was a series of posts that blew up on this sub from a guy who worked for Loanstreet and decided to \"Name and Shame\" them on this subreddit, claiming that they \"cheated him out of equity\". The OP later updated that Loanstreet was suing him in federal court for defamation, and appeared quite confident he would win. \n\nI had a bad feeling about this case, and I decided to follow the updates on Pacer. A couple weeks ago, the judge released her opinion, finding that the defendant did indeed defame and disparage his former employer, and that his accusations against them were not true. She also dismissed all of his counterclaims against Loanstreet.\n\nI guess this is a good lesson to 1. Watch what you say online, and take a deep breath before deciding to \"Name and Shame\" an employer you feel has wronged you. 2. Be skeptical of what you read on reddit, disgruntled employees are not always reliable narrators. \n\n\n\nSome highlights from the opinion:\n\n\n>[Defendant]’s allegations that Lampl “just pocketed\nthe options he promised me” and “is a rich con man,” or that\nLoanStreet “withheld $100k in options that they promised [[Defendant]]\nbefore [he] was hired,” “is a fraudulent, exploitative mess,”\n“cheat[s] people just to make [their] big piles of cash a little\nbigger,” “cheated [[Defendant]] out of equity,” and “defrauded [[Defendant]]\nout of over $100k” are simply untrue... More than that, his accusations have specific, obvious\n–- and in some cases legal -- meaning and are plainly refuted by\nthe black-and-white terms of the Offer Letter and Option Agreement. \nBecause his statements necessarily “produce a different effect on\nthe reader than would a report containing the precise truth,”\n...they must be considered false\n\n\n-\n\n>Here, all of [Defendant]’s statements were meant to expose\nLoanStreet and Lampl to public opprobrium and shame. Indeed, the\nstated goal in the headline of his Reddit posts was to “Name and\nShame” LoanStreet.\n\n-\n\n>However, we doubt that [Defendant]’s statements constitute “a\nmatter of public interest.” The Court is mindful of § 76-a’s text\nstating that the term “public interest” “shall be construed\nbroadly, and shall mean any subject other than a purely private matter.” Here, though, [Defendant]’s\nstatements involved “an internal complaint about the behavior of\na fellow employee,”...and [Defendant]’s former employer, which [Defendant] admits in his\nposts is a “small company” of “[less than] 30 people.” .. Whether and when a single employee was entitled to\ncertain vested stock options under the terms of his unique\ncontracts at a company of less than 30 employees is likely not a\nmatter of public interest. Indeed, to the extent that [Defendant]\nbelieved he was “cheated” and “defrauded” by LoanStreet and Lampl,\nhe could have pursued that theory in a court of law. \n\n-\n\n>The Court is concerned that it would be\ninappropriate –- and inconsistent with legislative intent -- to\nreward [Defendant] for his behavior by finding that his calculated (and\nfalse) attacks on LoanStreet and Lampl can transform a purely\nprivate gripe into a matter of public concern. As such, we are\nskeptical that New York’s anti-SLAPP law applies here\n\n\n-\n\n>Although [Defendant] denies having made his statements with actual\nmalice...we infer [Defendant]’s\nreckless disregard for the truth from his obvious ill will towards\nLoanStreet and Lampl together with the indisputable facts which\ncontradict his statements... First,\n[Defendant]’s ill will is evident from his calculated decision to wait\nthe full “requisite year” for his “non-disparagement clause to\nexpire,” ...before embarking on a\nmultifaceted smear campaign to attack plaintiffs using charged --\nand in some cases abusive -- language. If that were not\nsufficient, [Defendant] amplified his posts in the hopes that LoanStreet\nwould face maximum ridicule, even paying for advertisements\nbearing titles such as “LoanStreet horror story – LoanStreet\ncareers,” and “LoanStreet horror story – ‘a terrible place to\nwork.’” The Court thus has no doubt that [Defendant]\nwas motivated by personal animus towards plaintiffs such that “malice was the one and only cause for the publication” of his\nstatements. \n\n\n-\n\n\n >“when read in the full context of the\nposts, as defendant urges the Court to do, it is clear that even\nthe most vitriolic of the bunch — remarks such as, ‘[Lampl] is a\nrich con man’ and ‘[LoanStreet] is a fraudulent, exploitative mess’\n— relate to the specific accusation that LoanStreet and Lampl\ndefrauded defendant by unlawfully withholding $100,000 in stock\noptions.”\n\n\n-\n\n\n >Even assuming that [Defendant] was discharging a moral duty in\nmaking his statements or maintained a common interest with the\nviewers of his posts -- both highly dubious assumptions-- his\ndefenses would fail, as these two qualified privileges are defeated\nif the statements at issue were “published excessively, i.e., [they\nwere] made to persons with an insufficient interest in it for it\nto warrant protection.”  Here, [Defendant] posted his statements\non prominent, public social media and workplace review websites to\nan audience that had no obvious interest in LoanStreet and then\namplified them further using paid Google advertisements. One might, for example, question the conviction with which [Defendant] felt a “moral duty” when he waited the requisite year for his non-disparagement agreement to\nexpire before launching his online campaign...[Defendant] cannot simultaneously maximize the audience\nfor his statements then hide behind qualified privileges which\nexplicitly do not apply to such excessive publication.",
    "title": "FYI: the guy who \"Name and Shamed\" his employer on this subreddit lost the defamation lawsuit against him",
    "subreddit": "cscareerquestions",
    "timestamp": 1696140867,
    "score": 1263,
    "keyword": "white judge"
  },
  {
    "text": "Lazy girl job How are managers dealing with lazy girl employees? \n\nBelow is wiki’s definition of lazy girl jobs:\n\nA lazy girl job is an easy, usually white-collar, job with good pay where an employee can quiet quit.[1][2] The term was coined in 2023 by Gabrielle Judge, also known by screen name \"antiworkgirlboss\" on Instagram, in response to hustle culture, the Great Resignation,[3] and worker exploitation. Although the trend is centered around women, she says men can have lazy girl jobs too. Judge explained the term was a marketing gimmick in order to raise awareness about \"toxic workplace expectations\" and is not about celebrating laziness.[4]",
    "title": "Lazy girl job",
    "subreddit": "Accounting",
    "timestamp": 1692368121,
    "score": 0,
    "keyword": "white judge"
  },
  {
    "text": "What practice is like in the various big law firm groups Many of you are rising 2Ls with no idea how to merge and aquire or leverage the finance. Not to worry, as a current v20 SA, I am here to let you know exactly what life is like in all the groups based on my wisdom, and not pure rumor based on one conversation I had with an associate one time.     \n\n- Litigation        \n\nYour first day, they lock you in a room with no lights or windows, and nothing but a computer with access to Westlaw (or god forbid Lexis). For years, the only light you see is when they open the door to bring in more piles of discovery documents. After 4 years of darkness after you have lost all humanity, they will unleash you in a federal courtroom against another litigator and leave a pool cue and some broken bottles in the center. The last one standing gets the greatest reward of all, a granted discovery motion that affords them the right to read 37 more pages of irrelevant corporate documents.      \n\n- Mergers and Acquisitions     \n\nEnjoying your time in Shanghai? Too bad, you have to be to Chicago in 45 minutes, after that you have to close a deal in Munich before meeting a client in Lagos. At least that is what the partner's life is like, which is their reward for getting that position by winning the yearly cocaine eating competition. You will be locked in the due diligence dungeon and making sure every contract the corporations made don't have two Peerlesses or promote a Harrier jet or whatever.      \n\n- Capital Markets      \n\n\"Shuuuuuh like fir shur dude, bruh that party was hella tight bro.\" Were you in a fraternity in college? Does taking a shot for every point the DOW Jones goes up sound appealing? You may be ready for Cap Markets. GDIs need not apply.     \n\n- IP     \n\nThere are two types of IP lawyers:     \n\nType one: got terrible grades in law school? No problem. Your undergrad degree in environmental studies means you are the only person in the firm who has ever seen, let alone knows how to use a plus sign. Dazzle your co-workers with the most basic scientific knowledge. Stand in wonder at how some of the smartest people you know have no idea how the world around them works. Learn to never ask anyone in your firm for health advice.    \n\nType two: theater kids who the firm fooled into thinking entertainment law was real.     \n\n- Trusts and estates:   \n\n\"We shall give the Bar Harbor home to Gertrude, my second niece thrice removed,  the Hamptons home shall go to my cat Mittens, and to Darcy a meer pittance, since she had the gall to marry a Catholic.\" This could be your every day in T&E as the firm looks to meet the every need of the ancient families who have patronized the firm since 1854. Remember to use 'summer' as a verb with this crowd.      \n\n- Real Estate     \n\nWe have the best practice group here folks, lots of people are saying it. Very smart people. Good genes. 👍👌✋. Is another building bothering your client? Sue them. Is there a bit of land you want? Build on it and sue them if they say anything. The children's hospital bringing down property values and bumming people out? Find some bizarre covenants to force them into something useful like an H&M.     \n\n- Appellate litigation    \n\nNot real. They are paid actors who are supposed to imitate the most insufferable gunners in your 1L class. Oh you clerked for judge Easterbrook? More like judge Easter Bunny based on how obviously fake the story is. Next you expect me to believe Yale law is a real place 🙄.      \n\n- Tax    \n\n\"Yeah, I just really like tax, you know, I worked as a an auditor after undergrad, but I really wanted to shift to more of the accounting side of things. I just finished my Tax LLM, because I just wanted to know more. I have a full body tattoo of the Tax code, but I had to put some of the last pages on my kid because it is really long.\"    \n\n- Bankruptcy and Restructuring    \n\n\"Existence is pain. The only reason we create any works is so they can be torn asunder\" Do not let your business within 500 feet of them, as they will swoop down and devour it like so many vulture, hauling the bits off to anyone who has cash on hand.   \n\n- Lobbying and election law    \n\nWhat if the National Review or Vox was made into a real person? You no longer need to wonder with this group. Not only do they know the mayoral candidate in every city over 150 people. They know their shoe size, first pet's name, and favorite way to receive dead drop payments. 100% probability of wearing  a gingham shirt.    \n\n- White Collar Defense    \n\nSpent 20 years at DoJ before they needed to put a down payment on a summer house. Big on grilling, big on mowing the lawn, 100% chance of asking if you saw the game on Sunday.",
    "title": "What practice is like in the various big law firm groups",
    "subreddit": "LawSchool",
    "timestamp": 1686920003,
    "score": 588,
    "keyword": "white judge"
  },
  {
    "text": "*HOW TO GET GOOD GRADES* in 1L, while staying sane and having a great time - a detailed guide from a recent grad *Cross-posting in lawschooladmissions because many 1Ls are still on there*\n\n**2/3Ls and grads** - Please feel free to add to this, comment, and critique!\n\nHi 1L friends! 2021 UVA grad here, now two years into my BigLaw career. Congrats on starting law school this month. I originally posted this guide a few years ago as a 2L, and have received countless messages ever since about how helpful it was. I repost it every year around this time so that the new incoming 1Ls could see it and hopefully find it useful too. Here are the posts from prior years in case you find the discussions in the comments section useful:\n\n\n[Fall 2022 - /r/lawschooladmissions](https://www.reddit.com/r/lawschooladmissions/comments/wuzs4n/how_to_get_good_grades_in_1l_while_staying_sane/)\n\n\n[Fall 2022 - /r/lawschool](https://www.reddit.com/r/LawSchool/comments/wuzs0g/how_to_get_good_grades_in_1l_while_staying_sane/)\n\n\n\n[Fall 2021 - /r/lawschooladmissions](https://www.reddit.com/r/lawschooladmissions/comments/pcomm7/how_to_succeed_in_1l_detailed_advice_from_a/)\n\n\n\n[Fall 2021 - /r/lawschool](https://www.reddit.com/r/LawSchool/comments/pcompf/how_to_succeed_in_1l_detailed_advice_from_a/)\n\n\n\n[Spring 2021- /r/lawschool](https://www.reddit.com/r/LawSchool/comments/kvwwgp/hoping_for_better_grades_in_the_spring_heres_a/)\n\n\n\n[Fall 2020 - /r/lawschooladmissions](https://www.reddit.com/r/lawschooladmissions/comments/idcu40/for_overwhelmed_1ls_a_comprehensive_guide_on_how/)\n\n\n\n[Fall 2020 - /r/lawschool](https://www.reddit.com/r/LawSchool/comments/idcs25/for_overwhelmed_1ls_a_comprehensive_guide_on_how/)\n\n\nWhen I was a 1L, I was lucky enough to get lots of sage advice from Reddit, TLS, and older students at UVA. I wanted to pay it forward, and ask you to do the same. This guide represents all of the things I personally learned myself, advice I received over the years, and comments by dozens of top-performing students at UVA and other T14s who have given me feedback and helped me improve the contents. Historically, my 1L mentees who followed this guide have performed extremely well (including several with a 4.0 at schools like UVA, Penn, and Michigan, though obviously that requires a lot more than just following my advice lol).\n\n\n\n\nYou should also check out **[this post about what to do in the last month before finals (ie how to outline etc.), and how the hell you actually write the exam when you're sitting in the room on test day](https://www.reddit.com/r/LawSchool/comments/ykbw18/how_to_study_for_finals_in_the_last_30_days_and/).**\n\n\n\nRemember that there is no \"right way\" to do law school, *including* my advice in this guide. You should listen to as much guidance as you can, then try things and decide what works for you personally. Nobody grades you on how you prepared, only on the final result in the exam room. **[This post by moderator Hstrat](https://www.reddit.com/r/LawSchool/comments/ng7e4z/aggregated_content_for_rising_1ls_and_others/)** contains a priceless collection of other guides and AMAs across the internet that you should read as well, including some that helped me as a 1L several years ago. I recommend paying attention to even the ones that disagree with me :)\n\n\n*2022 update: Several people have asked me recently when I was going to post my \"updated\" guide, so I wanted to confirm that I've gone through the whole post again and while there are a handful of tweaks, most of the advice holds true. I've also been asked to add advice about how to get jobs, how to do well in BigLaw, etc. but this post is already dangerously close to the Reddit character limit so I think I'll have to save that stuff for a separate guide :)*\n\n\nFeel free to ask any questions below, and again, commentary and contributions from other people who got good grades is welcome! Happy to also answer questions beyond studying if anyone wants to ask them (about career choices, my experiences in biglaw, whatever).\n\n**Caveats/Intro**\n\n* No advice is “correct” (including this), just suggestions to try for yourself\n* No one will ever see your notes/outlines/flashcards/etc, only the exam itself\n* The exam is 100% of your grade, so focus on that\n\n   * Your entire semester should work backwards from the exam\n   * Obviously if your syllabus says otherwise, adjust accordingly\n\n**Sleep/health/caffeine/drinking**\n\n* Your physical and mental health are important for obvious human reasons  \n\n   * They are ALSO critically important for grades\n* 1L is a marathon, not a sprint\n* You WILL burnout eventually  \n\n   * The question is when, how bad, and how fast can you bounce back?\n   * Delaying burnout and mitigating its intensity is key; health is critical to this\n* The increased brainpower, efficiency, and speed of being healthy, well-rested, and mentally/emotionally centered vastly outpaces any time “lost” from not studying more\n* Specifically: Sleep, exercise, diet, relaxation, reasonable levels of caffeine/alcohol/drugs  \n\n   * Sleep is absolute king here\n   * An hour of sleep is more valuable than an hour of anything else, including studying, job applications, exercise, socializing, etc. because it  makes all of those activities way better/easier during the rest of the  day\n\n**General life/social stuff**\n\n* Warn your family, friends, partner, etc. that law school is really intense and that 1L Fall is by far the most important semester  \n\n   * It will NOT be that bad, but it’s wise to set their expectations low and have them be pleasantly surprised that you’re available, rather than be mad that you’re not available enough\n   * They should be under the impression that your life will be 100% taken up by studying, until you’re comfortable enough with your schedule to inform them otherwise\n* Be nice to everyone, don’t start drama  \n\n   * This is all so much easier when you get along\n   * Contribute to and take advantage of the support network!\n   * Remember that every classmate will also be lawyer, in a very small world, and it’s better to be friends with the hiring partner, opponent, client, attorney general, judge, whatever than to have them remember when you tried to fight them on the softball field lol\n\n**Pacing/high-level overview**\n\n* Common mistakes: burnout too early, or (less common) slack until the end  \n\n   * You CANNOT push yourself round the clock in the library all day every day all semester – literally nobody can keep up this pace forever  \n\n      * Every year people try this, burn themselves out, and get wrecked in finals\n   * You should assume that you are totally average until 1L grades tell you otherwise  \n\n      * If you’re insecure that you’re not smart enough, you’re probably wrong (chances are you’re average)\n      * If you’re overconfident because you think you’re smarter than everyone else, you’re also probably wrong (chances are you’re average too)\n* You need a plan, and it should be ambitious but reasonable  \n\n   * Plan for problems/interruptions/sickness/distraction\n   * Leave slack in your schedule each week, and across the semester as a whole\n* Each hour of your time becomes more valuable the closer you get to finals  \n\n   * Thus, try to front-load tasks as much as possible without burning out\n\n**Work backwards from the exam**\n\n* The exam is the only thing that matters\n* Repeat: **THE EXAM IS THE ONLY THING THAT MATTERS**  \n\n   * Plan the entire semester based on this realization\n   * Cases are important for learning, but pretty unimportant for the exam  \n\n      * Repeat: they *ARE important*, just not while sitting in the exam\n* So start by figuring out: what does the exam look like?  \n\n   * **NOTE**: Check the format with your professor, on the off-chance that it’s different… but most will be like this:\n   * A series of hypotheticals that you will need to analyze, often w/ little guidance, and write about in a Word doc for the professor (at some schools this may be done via special exam software but the content is the same)\n   * Extreme time pressure\n   * (Usually) open-book, open-note, even open-internet\n   * Blind grading (professor has no idea who you are)  \n\n      * Notably, they also don't know whether you nailed a cold call or bombed it\n   * Cases are used only for their key takeaway/rule, and maybe to analogize the most important facts to the exam hypo  \n\n      * *At most* you might say something like “Necessity is not a defense to murder (*Dudley*), so in this case John wouldn’t be able to raise it.”\n      * Or something like, “The workers here are independent contractors, but unlike the anesthesiologists in *Roessler*, they don’t seem to have apparent authority.”\n      * This kind of unofficial “citation” to a case is not only the maximum you’d have to do, it’s honestly more than most professors would expect or care about – you DO NOT have to even use cases to this degree\n      * The point is, a few days/weeks from now, when you’re spending so much time learning cases, reflect back on these examples in this post, and realize how little information you’ll actually use from them on the exam\n* So, now that you know what the exam involves, what sorts of tools would probably help you during the exam?  \n\n   * A gigantic, well-organized document with all the information from the class, that you can CTRL-F to find things  \n\n      * This is an “outline”\n   * Your raw class notes to CTRL-F in case you missed something  \n\n      * This is why you should take good notes\n   * A shorter document laying out only the most important info as a reminder, that you can glance at quickly mid-exam  \n\n      * This is an “attack outline”\n   * Other visual aids?  \n\n      * An excel database of cases w/ key info?\n      * Flowcharts?\n      * Other creative ideas?\n   * Knowing your professor’s opinions, preferences, quirks\n   * Practice: having done a very similar exam multiple times before  \n\n      * AKA “practice exams”\n   * General familiarity with the content from constant exposure  \n\n      * AKA consistent studying and review all semester\n* What will probably NOT help you during the exam:  \n\n   * Memorization (because it’s open note)\n   * Flashcards\n   * Details of case facts\n   * Full case briefs\n   * In-depth reasoning of majority/dissent\n   * Historical cases that are no longer relevant\n   * Highlighting in your casebook\n   * Rambling about general legal concepts not directly related to hypo\n   * Policy/theory/ethics  \n\n      * UNLESS explicitly asked, or specific prof likes it\n   * The opinions, preferences, quirks of your classmates\n* Thus, **devote more time to developing things that will help and less time to things that won’t help**  \n\n   * Don’t spend time on things just because they feel like “work” (ex. writing out a 2-page analysis of each case you read, making flashcards), or because your classmates are doing it, or older students say to do it, or even because professors say to do it (it’s been probably decades since they were in school)  \n\n      * **This includes not blindly listening to ME either!** Think critically and carefully about each task and consider whether it will really help you come exam time\n      * Solicit suggestions from 2/3Ls, classmates, profs, the internet, and try out their methods…. But be prepared to adapt to your own way, or toss them out\n* I have way more to say about exam nitty-gritty and strategy, but that should wait until much later in the semester  \n\n   * When the time comes, check out my post about [preparing for exams during the final month of the semester](https://www.reddit.com/r/LawSchool/comments/dtiy6y/detailed_game_plan_for_finals_for_all_the_anxious/), followed by my post detailing [specific strategies for writing the exam itself once you're sitting in it](https://www.reddit.com/r/LawSchool/comments/e7m4uz/for_1ls_a_detailed_guide_on_how_the_hell_you/)\n\n**Taking notes in class**\n\n* By far the most important thing you can do\n* The professor is judge, jury, and executioner of your exam  \n\n   * If you, the book, or supplements ever disagree with the professor, the professor is always right (for the exam anyway)\n   * Many profs will encourage you to challenge their ideas, either in class or in office hours…. But when it comes to the exam, follow what they think\n   * If you get a policy/political question, you may choose to argue a point that your prof disagrees with, if it’s truly a debatable non-settled non-legal question  \n\n      * But when it comes to “how does Torts work” your prof is always correct\n* For most profs, 99.9% of the information you’ll need will come up in class at some point (either from the prof, or from discussion w/ students)  \n\n   * This is part of why devoting too much time to reading/briefing isn’t worth it – you’ll get the info in class\n* Pay attention, take lots of notes, fill any holes either by asking classmates, revisiting the recordings, or going to office hours\n* Do not create a separate Word document for each day of class, just combine all your notes for the same subject into one document so you can CTRL-F the entire semester of that subject in one go (ex. all Crim notes in a single doc, not \"Crim August 26th\" and \"Crim August 28th\")\n\n   * Trust me, this will save you enormous time and effort later\n   * You can also use more sophisticated tools like One Note if you know how\n* I strongly encourage you to type your notes (if the professor allows it) for the sake of speed and to save time transferring handwritten to electronic later, but there is no \"right\" answer on this one\n* If you handwrite, you will HAVE to transfer them to electronic form at  some point so you can use them for outlining and during the exam  \n\n   * Probably smart to set up a routine for doing this each week or other similar time period\n* Follow whatever style and format works best for your brain - nothing else matters\n\n**Reading**\n\n* Timing: probably good to get ahead, at least by a couple days  \n\n   * Aspire to finish the semester’s reading early if you can\n   * By reading ahead, you leave room for problems (if you get sick or have some deadline or are burned out, the punishment is being back on normal pace, rather than falling behind)\n   * BUT consider that being too far ahead means you forget details and can mess up cold calls  \n\n      * Probably good to do a quick refresh right before class\n   * Start to track how long it takes to read each page (this may be different for each class)  \n\n      * Not to be a gunner, but so that you can accurately estimate time for each assignment\n      * You *will* get faster as the semester goes on (often significantly faster) - this is part of the normal law school process\n* Read every word carefully the first time through, but read it like a normal book and don't get bogged down for long if you're confused - either the book will explain it later, or the professor will explain it in class\n* Try really hard to understand what’s going on factually and legally\n* Try to figure out how each judge is making their arguments\n* In your head, practice distilling the key questions:  \n\n   * In 1-2 sentences MAX, what are the facts?\n   * In 1-2 sentences MAX, what legal rule comes out of this?\n   * In 1-2 sentences MAX, what did the dissent say (if any)?\n   * In 1-2 sentences MAX, is there any other context/info from book?\n   * Ex. *R v. Dudley & Stevens*  \n\n      * Facts: “Two guys starving on boat eat third guy”\n      * Law: “Rule: necessity is not a valid defense to murder”\n      * Context: “This is an old English case and American law is a bit different now”\n* You do NOT have to actually write these things down as you read, although you can if you want to  \n\n   * However….\n\n**Briefing**\n\n* CONTROVERSIAL: should you write down *all* of those facts, details, arguments, and legal minutiae from the reading?  \n\n   * This is called “briefing”\n   * Doing this is part of traditional law school advice, but highly controversial\n   * There seems to be a modern trend away from briefing\n   * **Personally, I am strongly against briefing and advise you to seriously consider not doing it**\n* Briefing pros:  \n\n   * Cold calls are way easier\n   * You never need to revisit the book because it’s all there\n   * Helps some people remember facts/arguments/details better\n   * May force you to understand things better\n* Briefing cons:  \n\n   * Takes an absolutely enormous amount of time\n   * Most of the information is unnecessary outside of cold calls\n   * Will never be used on an actual exam\n   * You can survive a cold call without it\n   * People often become too reliant on them as a crutch\n   * Seriously, an enormous f\\*cking amount of time\n* Some people swear by briefing, including some very successful students\n* But many, including me, think they’re a waste of time  \n\n   * The ratio of time required to value gained is insanely wasteful\n   * They mostly help cold calls… and cold calls have no impact on your grade\n   * Many people study tons of hours and burn out… yet get bad grades?  \n\n      * Too much time spent briefing is often the culprit - among the dozens of 1Ls I've mentored over the years, it's the most common problem they have\n      * Briefing *feels like* you’re being productive and *feels like* you’re “learning” and “being a good law student” and “accomplishing something”… but many people discover come exam time that **those efforts don’t translate into results**\n   * Easy to be too perfectionist or worry about things like formatting, that no one will ever see\n   * Try it, maybe it works for you, but be ready to abandon if necessary\n   * Only do it if  \n\n      * a) you have no other more valuable tasks to do and\n      * b) are totally well-rested, relaxed, and bored and need no rest time\n   * I would much rather spend an hour reading ahead, outlining, doing practice exams (late in the semester), doing career services tasks, taking care of personal errands, making flowcharts, revising my notes, reviewing my notes, etc. than I would an hour of briefing\n   * I would also much rather spend an hour sleeping, partying, watching Netflix, jogging, etc. than an hour briefing, because my energy will recharge and make be more productive at other more important tasks\n* MIDDLE GROUND: “Book Briefing”  \n\n   * Highlight important things\n   * Make notes in the margins\n   * Don’t actually write out a full brief\n   * Many people like this solution\n\n**Outlining**\n\n* Sounds scarier than it is  \n\n   * Literally just compile your notes into one big document, edit it a bit, and format so it’s easy to look stuff up/organize\n   * If you add something to the outline you don’t understand or remember, revisit your notes/book/friends/supplements/professor to figure it out  \n\n      * Eventually you’ll understand everything\n* Use old outlines!  \n\n   * Everyone agrees you shouldn’t just use an old outline straight up (and sometimes profs don’t allow it)\n   * But you don’t necessarily need to take the time to build one from scratch\n   * Either take an old one and modify it to your liking, or build your own but use the old ones as a reference to save time and make sure you don’t screw up\n   * Many schools have an outline bank\n   * Many student orgs have outline banks\n   * Your PAs should provide old outlines, as will student org mentors (ask them!)  \n\n      * Unless your school doesn't have PAs or mentors, of course\n* It’s an iterative process – the outline is never “done”  \n\n   * You want to compile the information in a way that is both comprehensive and easy to navigate in your brain  \n\n      * Remember that you’ll be flipping through or CTRL-Fing it urgently to look up something during an exam\n      * Information recall speed and organization are key\n* It’s also a critical learning experience as you fit all the conceptual pieces together in your head and organize them in ways your brain understands  \n\n   * This is the main reason relying solely on old outlines is a problem\n* Ideally you should add to your outlines bit by bit as the semester goes on  \n\n   * BUT note that you will not be capable of doing much of the connective intellectual work until the end of the semester when you’ve seen enough of the class to understand how things fit\n* An “attack outline” is literally just your outline, but slimmed down so it’s faster to look stuff up\n\n**Practice Exams**\n\n* Don’t worry about this until like, November\n* But once you get to the last few weeks, and certainly reading period and finals, these will be critically important\n* Most profs will give you old exams, though some wait until late in the semester  \n\n   * If not, ask\n   * If you can’t get them, try to find exams from other profs, or the internet\n   * DON’T ask a 2/3L for them, because schools tend to get very touchy about it and you don't want to get the 2/3L (or yourself) in trouble\n* You really really really need to get hands on practice applying your knowledge and resources to hypos\n* You WILL feel panicked the first time you’re staring at a hypo and a blank page but you’ll figure it out  \n\n   * You want to work through this experience on a practice, not the real thing\n   * Remember to read [this post about how to actually write the exam](https://www.reddit.com/r/LawSchool/comments/e7m4uz/for_1ls_a_detailed_guide_on_how_the_hell_you/)\n\n**Think outside the box**\n\n* That’s basically it for traditional law school study techniques, but feel free to experiment\n* I personally started using Excel spreadsheets and found them ultra useful - [here's an example](https://www.reddit.com/user/Oldersupersplitter/comments/iiuucb/excel_cases_outline_example/?utm_source=share&utm_medium=web2x&context=3)\n\n   * Each case (including the minor note cases) gets a line with the name, year, the topic, a few words of facts, and a very brief overview of why it matters\n   * I can see the entire possible body of law for each topic on a single screen\n   * You start to notice trends and connections differently than in Word\n* Flowcharts  \n\n   * I love flowcharts, and as a 2L used flowcharts almost exclusively during the actual exams (with other traditional tools available if needed) - here is [a link with some examples](https://www.reddit.com/user/Oldersupersplitter/comments/idkyr8/flowchart_examples/)\n   * There are white boards in many library study rooms\n   * I eventually moved to the [LucidChart](https://www.lucidchart.com/pages/) website and find it easier to do electronically\n\n**Structuring your semester, revisited**\n\n* Now that we know what everything is….\n* Your #1 job is staying on top of the readings and class notes  \n\n   * Preferably staying slightly ahead on reading\n   * At the start, this is really your only goal\n* Review/revisit material periodically to refresh it and find connections  \n\n   * Some people do this at the end of each week, every couple weeks, etc\n* Talk to your classmates, talk to profs in office hours, try to learn wtf is going on\n* Look for old outlines day one, and refer to them as needed even before making your own\n* Start building your outlines and/or modifying old ones  \n\n   * Some people add a little each week, others only after 4-6 weeks, some at the end\n   * No correct answer, but certainly it’s good to at least start by November 1 if you can\n* In the second half of the semester, the focus shifts more and more from reading into outlining\n* In the final month, 90% of your time should be spent on outlining, practice exams, and filling in holes in your understanding  \n\n   * Those last two are more important than outlines, which is why it’s good to aim for progress on outlines early\n* [Plan out the days you’ll prepare for each final](https://www.reddit.com/r/LawSchool/comments/dtiy6y/detailed_game_plan_for_finals_for_all_the_anxious/), way before you need to  \n\n   * I like to give myself 30 days before the first final: one week per class, then two days at the end to cram before the first final\n   * Then, as soon as you take a final, forget everything and spend all of your time prepping for the next one, and so on until you’re done\n   * Plan to be ultra burned out after each final  \n\n      * If you can study, great\n      * But you will almost certainly not have the mental or emotional capacity to  study until the next day, maybe that evening at best, so don’t rely on that time when you’re planning\n\n**Study groups**\n\n* Can be incredible helpful\n* Can also be a huge distraction\n* Very very important for reviewing practice exams at the very end\n* Probably worth trying them, at least with one other student to bounce things off of\n* Be extremely cautious about wasting time  \n\n   * Your classmates are probably cool and interesting, and if you become besties, you might spend all your time chatting and enjoying each other’s company instead of studying\n   * It’s good to have a concrete game plan for each study session - save the socializing for when you go to the bar *after* an efficient and productive study session (both the studying and the drinking will be improved this way)\n   * Later in the semester, you can even calendar specific things to cover on specific days\n* Don’t be afraid to include people from the other section(s) that share your professors!\n\n**Productivity in general**\n\n* There are many common suggestions and tips for productivity that I won’t write about for pages and pages here because you can look them online or in books (and by getting to this point, you’re probably respectably productive anyway)  \n\n   * However, here are some law school-specific thoughts that I have based on not only my own experience, but also the experiences of my 3L friends and the 1Ls I’ve mentored...\n* ***If you tell me you “studied 10 hours in the library….”***\n* First, law students love to exaggerate these things (so don’t freak out when your classmates mention stuff like this), but let’s assume you actually did 10 hours\n* Second, how much time during those 10 hours were you ACTUALLY studying?  \n\n   * Many many many people, myself included, will go to the library or their desk at home to “study” but find themselves constantly distracted by the obvious things (facebook, games, online shopping, news, etc) but also  less obvious things:  \n\n      * Talking to friends/study group about stuff that is not relevant to class\n      * Getting into deep philosophical arguments about legal theory that will make a great paper someday but have nothing to do with 1L exams\n      * Thinking about all the money you’ll make in BigLaw\n      * Thinking about how you’re going to save the world in PI\n      * Reading some interesting but irrelevant legal tangent because you don’t want to look at Torts any more that day\n      * Listening to friends in other sections talk about how *their* Contracts class is going\n      * Picking out the exact right shade of highlighter for highlighting today’s notes\n      * And so on…\n   * Sometimes you know that you’re not being productive if it’s Instagram, but many of these things I listed above might *feel like* you’re productive because they’re “about the law” or at least “law adjacent”  \n\n      * And hey, many of these things are great and valuable and you should do  them…. But don’t count them as “study time” in your schedule or your  head, because you will fool yourself into thinking you put in more hours  than you did\n      * Instead, use your study time to *actually study* and then spend the same amount of time doing all that other stuff I listed but block it out during a *separate time* in the day\n      * You may end up with MORE time to do these things that interest you because you power through the real studying all at once, and then feel free to go on tangents and socialize to your hearts content without being  chained to the library desk\n* Third, when you really truly are “studying,” what **specifically** does that mean and is it the most effective task at this moment?  \n\n   * This basically plays into everything I described about study habits above\n   * There  are lots of tasks that do technically count as studying, and hey maybe you do them for 4 straight hours without talking to anyone or checking  facebook…. But they don’t actually help you for the exam (or only help a  little bit)\n   * Here is where briefing really ruins a lot of people, in my opinion\n   * What are some other examples of tasks I’ve heard of classmates doing that waste time (or that I’ve done myself and realized my mistake)?  \n\n      * Re-reading the case multiple times after already discussing it in class (just revisit your notes at that point)\n      * Reading parts of the textbook that aren’t in the syllabus\n      * Reading supplements for topics that aren’t in the syllabus\n      * Memorizing facts (unless you get the rare closed book exam)\n      * Making flashcards (same thing)\n      * Looking up the history around an area of law, or the voluminous academic  scholarship around it (probably interesting, maybe valuable in the grand  sense for your education, but do it in “non-study” time because it has  no bearing on the exam unless the prof says it does or you’re very  confident it will come up)\n      * Briefing (in my opinion)\n* **IF** you only spend your study time doing **effective, high-value tasks** (*assigned*  reading, outlining, practice exams, reviewing notes, making visual aids  for the exam, finding explanations to topics you don’t understand,  filling in holes in your notes) and you also spend your “study time” **actually studying** without distraction  \n\n   * You will find that **the number of hours required to prepare thoroughly and get good grades is** **much smaller than you’d think**, and much smaller than the amount of time most students “study”\n   * This  is how some people “magically” get good grades while also going to Bar  Review, maintaining a relationship, playing video games, taking weekends  off, etc.  \n\n      * And, because they have left so many hours each day/week to rest and relax, their brains are in a better position to perform well when it comes to  study or take the exam!!\n* Of course, **I guarantee you will be nowhere near perfect** at this at the start, or even by the end of the first semester  \n\n   * But you should aspire toward efficiency and constantly ask yourself, *for you and the way YOU study effectively*, “am I actually studying during study time?” and “are my study tasks effective & efficient?”",
    "title": "*HOW TO GET GOOD GRADES* in 1L, while staying sane and having a great time - a detailed guide from a recent grad",
    "subreddit": "LawSchool",
    "timestamp": 1692031788,
    "score": 186,
    "keyword": "white judge"
  },
  {
    "text": "Tips from a Former Write On Judge  I'm graduating from law school (woohoo!) and leaving law review behind. I served as a judge in my school's Write On, and now I'm passing on common problems I saw and some strategies I used to make law review. I'm particularly focusing on the best ways to get points with the least amount of effort, especially because that's where a lot of people mess up.\n\n**1. Use Your Best Argument**\n\nThis seems obvious, but it was amazing how many people made arguments that they couldn’t support well. The writing and Bluebooking were fine, so it didn’t seem like a time crunch. So what gives?\n\nI think some people tried to make an unpopular or unusual argument in order to differentiate themselves. Don’t make an argument that you can’t support with sound reasoning. The judges really don’t care what argument you make. If we cared at the start of the competition, we have stopped after going through a mountain of papers. My highest and lowest scorers made the same argument, and I didn’t agree with either of them. One just had good reasoning, and the other didn’t.\n\n**2. Use the Online Bluebook**\n\nYou will use parts of the Bluebook you haven’t seen before during the Write On Competition. The 21st edition is 365 pages long and you have a few days to a couple weeks to finish. That is why you need the [online Bluebook](https://www.legalbluebook.com/). You will be able to search and find anything you need in seconds without needing to know where in the Bluebook the relevant rule is located or whether a relevant rule even exists. This will save you so much time and keep you from handing in a rushed, shoddy comment at the last minute. The online Bluebook costs money, but there is a [free trial](https://www.legalbluebook.com/sign-up) that should cover the length of your competition. \n\nLook up everything. Everything.\n\n**3. Use the Bluebook’s White Pages**\n\nSpeaking of the Bluebook, you’re not going to use it in quite the same way as you did in your Legal Writing class. You probably had to write a memo and a brief and used the Blue Pages, and you will use them most in practice. However, academic writing infuriatingly uses the [White Pages](https://lawlibraryguides.neu.edu/bluebook/BluepagesVsWhitepages). They are similar to the Blue Pages, but are slightly different. If you review the White Pages prior to the start of the Write-On Competition, you will be a step ahead of the rest of your class.\n\n**4. Review Punctuation and Grammar**\n\nIf you went to school in the United States, chances are your education in grammar and punctuation was uneven. A lot of schools rely on an intuitive approach, but the rule that you should use a comma “wherever there’s a pause” won’t cut it for Write On.\n\nWrite On judges have been working on their law journals for the last year, and have spent hours scrutinizing every apostrophe and semicolon. They will notice, but this is an easy place to pick up some low-hanging points. Review [common grammar mistakes](https://grammar.yourdictionary.com/grammar-rules-and-tips/5-most-common.html), [commas](https://owl.purdue.edu/owl/general_writing/punctuation/commas/extended_rules_for_commas.html), [semicolons](https://www.grammarly.com/blog/semicolon/), and the difference between [en-dashes, em-dashes, and hyphens](https://www.grammarly.com/blog/hyphens-and-dashes/).\n\n**5. Use Spell Check**\n\nSeriously. Spell check has fallen into disfavor, and it won’t catch form/from typos. However, it still has its uses, and I was amazed at how many people clearly didn’t take the time. Spell check will catch your obvious typos and misspellings and is a low-effort way to keep you from losing precious points. Again, the judges have been obsessing over the minute details of academic writing for a year. They will notice every typo. \n\nIn the Write On Competition, a lot of people lose points for things that are very simple to get right. Leave time to give everything one last check, and double check to make sure you adhere to any rules that your school has set. \n\nGood luck! You got this.",
    "title": "Tips from a Former Write On Judge",
    "subreddit": "LawSchool",
    "timestamp": 1684082332,
    "score": 38,
    "keyword": "white judge"
  },
  {
    "text": "Preparing to Get Fired - Systematic Racism Hello, ladies. \n\nI am a public defender and I’m preparing to get fired for confronting systemic racism and racial bias. I will not divulge details, but I am fed up and have decided to make an argument in open court like never before. I know that they will fire me when I am done and I am okay with that.\n\nI cannot sit back and watch a specific judge punish a black defendant harsher than he did a white defendant for essentially the same crime.",
    "title": "Preparing to Get Fired - Systematic Racism",
    "subreddit": "blackladies",
    "timestamp": 1681145013,
    "score": 355,
    "keyword": "white judge"
  },
  {
    "text": "Welcoming non-black people into our spaces and the consequences So, the 91st Miss Coppin State University is a white latina(from what I’ve gathered). Of course, backlash reasonably happened because why would you let a white person represent an HBCU? Anyway, Florida A&M University released this statement saying quote\n\n “My heart goes out to [redacted] the 91st Miss Coppin State University, and any student who has been judged, belittled or mistreated simply because they were considered “not Black enough” to uphold an HBCU leadership title. To my beautiful brothers and sisters of color that stand on the thrones, sit in the classrooms, and walk the halls our ancestors bled and led us to currently reside. Remember their sacrifice;remember their endless love devoted to this very moment in history, to our education, and to the classrooms of which hold a magnitude of ethnicities and skin tones that all reflect the unity of which many eyes never got to see. Don’t be the person who cannot relate so you do not try to understand; we are NOT our oppressors! Imagine being “too light” for one group but “not white enough” for the other. HBCU’s all over the world embody the inclusion and safe space for us all to further our education and broaden our identities with the support, love, and family adopted the moment you step on our campuses. To all the victims out there, know that you are not alone and although it is easy to focus on the ones trying to tear you down, know that there is a much higher percentage of those rooting for you. Together we fight. Together we love. Together we uplift #HBCUnity.”\n\nNow, apparently she ran unopposed for Miss Coppin(this probably isn’t likely), but there should be no reason someone who is non-black feels comfortable going into our spaces, then taking roles or titles meant or us. We have become so focused on being nice and inclusive to everyone, we’ve erasing our spaces. I’m going to end this by saying this, our grandparents and great grandparents didn’t fight to have our own spaces to be letting non-black people take our roles, representation, and titles.",
    "title": "Welcoming non-black people into our spaces and the consequences",
    "subreddit": "blackladies",
    "timestamp": 1675376943,
    "score": 126,
    "keyword": "white judge"
  },
  {
    "text": "I don’t feel black enough So, at night, I always find myself overthinking, haha. Right now, I'm reflecting on the fact that I don't have any black friends. Most of my friends have been White or Hispanic. Don't get me wrong, I absolutely love being black and cherish our culture. However, as a 19-year-old from the younger generation, I struggle to connect with other black women, especially those I encountered in school. I remember one particular black girl from high school who seemed to dislike me for no apparent reason. Now that I'm in college, I'm actively trying to make black friends. Unfortunately, it hasn't worked out yet, and I a group of friends, but yet again I’m the only black girl in it. \n\nGrowing up, I lived in the suburbs, and my mom often considered certain things as 'ghetto,' like lace front wigs, specific braids, or even Jordans, etc. She also preferred me to have white friends. I believe this is where the disconnect stems from. But, honestly, I just want to make friends with other black women without being judged for enjoying things that are stereotypically associated with 'typical white girls.' I hope you understand that I'm not coming from a place of ignorance, but rather a genuine desire for connection.",
    "title": "I don’t feel black enough",
    "subreddit": "blackladies",
    "timestamp": 1695456306,
    "score": 106,
    "keyword": "white judge"
  },
  {
    "text": "I have an embarrassing confession, I have zero musical exposure to rap, R&B, etc., and zero idea who to listen to. Please help! So pretty much the title, and please don't judge my use of \"I love rap\" while also being clueless. Every time I hear a good beat I just fall I in love. It hits *hard\" for me, but I'm 34 and am having such a hard time figuring out how to expand on these random occurrences.\n\nI live in a predominantly white area, and old school rock completely dominates. I grew up in a heavy metal region, and rap was not a focus at all. I now have my own space where I can literally put my music on blast and my neighbors are 10+ acres away. And I want to hear rap music. I want to listen to old school disco funk. I. Want. To. MOVE.\n\nWhere should I even begin??? Does anyone have a good playlist, artist, or educational source they can recommend? What is your favorite artist. Please bring me up to speed! I don't want to stumble around, I want to hear who the top hits were underground. Artists that moved you but never got traction. Anything!\n\nI will add, I'm have figured out that I'm not a fan of \"mumble rap\", gave it a taste, but wasn't a fan personally. Haven't heard anything else that I didn't devour. Share your favorite artist openly!\n\nLastly, if you don't care for a recommendation, please keep it to yourself unless they are convicted pedos, women beater, etc. Let us draw our own conclusions. But if there is something you love about an artist, please do a shout out!\n\nEdit: I'm gonna be honest, I posted this while I was drinking with friends (between conversations), forgot i posted it, and they just left. I opened up this app and my jaw hit the floor. You guys have no idea how hard it has been for me to open up about wanting to break into this genre but feeling constantly shamed about not being born with the knowledge. I really appreciate you all, this is such an emotional and passionate hurdle for me 😭😭😭\n\nI'm going to keep checking in and responding as suggestions role in. I would like to post the full playlist for others to delve into, but I don't want to post it blindly without having listened to the artists first and striking my own connection. I've had problems sharing links here in the past, so hopefully I can get it up without much trouble. \n\nThank you all for sharing your knowledge, and please keep it coming, you have no idea what this means to me!! ❤️❤️❤️",
    "title": "I have an embarrassing confession, I have zero musical exposure to rap, R&B, etc., and zero idea who to listen to. Please help!",
    "subreddit": "blackladies",
    "timestamp": 1694376623,
    "score": 60,
    "keyword": "white judge"
  },
  {
    "text": "Why do ''alt'' black women mostly white guys? Edit: title was meant to say date!\n\nThis might be controversial.\n\nBut from being an alt black woman myself from Britain (I kinda detest the alt term but that's another discussion, I'm using it for ease of understanding) and dating white guys in the past, I've noticed that I used to slide more towards white guys. \n\nI've also observed this in other black women who have 'alternative interests' or less 'stereotypical' interests. 9/10 times I'm right when I assume they're dating a white guy.\n\nImportant: there's nothing wrong with dating out. After all, I want black women to go where they're admired and loved. And there is more to love than the colour of your skin. \n\nComing from a personal standpoint, I think I've slid towards white guys because I felt that they wouldn't judge me about my interests and seem to have an open mind (this is only because white people are not put in rigid boxes and stereotypes that they feel they need to be in order to feel included by their race) and my alternative interests aligned more with them. \n\nI was also judged quite harshly by a handful of black people around me for being different, which I think made me uncomfortable sharing myself intimately and being myself in a romantic relationship with a black guy. The thought scared me in fear of judgement and rejection but now I'm working on that trauma.\n\nA theory: I think this creates a weird cycle that we can't break. Because we unconsciously assume black partners won't accept us, Black men who are 'alt' date white women and black women who consider themselves 'alt' date white men (I don't know how it is in LGBT+ communities). So we never find and date each other, which makes me sad. \n\nWhy do we think this is? I hope that the newer generations will have an open mind and be more flexible in the boxes they put themselves in to help with this. \n\nHave you observed this? Am I just insane? If you consider yourself 'alt' have you observed this in yourself and why do you think this is?",
    "title": "Why do ''alt'' black women mostly white guys?",
    "subreddit": "blackladies",
    "timestamp": 1672768283,
    "score": 61,
    "keyword": "white judge"
  },
  {
    "text": "I’m getting social anxiety from non-black people hiding their bags / phones when I am around I’m not sure how to let go of this anxiety and feel more at ease in public when I am out alone. \n\nIt is mostly white and asian women who do this. I feel it’s really unfair for them to have the power to make me feel out of place / unwanted. \n\nI am always hyper aware of my body language and positioning relative to others. While in public I am constantly thinking about how I can look less threatening and I feel uncomfortable in my own skin while out. As a result, I think I am looking at people more intensely to gauge their reactions.\n\n\nFor context, I am a dark brown, attractive girl in my 20s. I dress well, quite chic and often wear designer bags and clothes. I often have makeup on. I don’t think it’s that I look sketchy, it’s just that people see dark skin and judge right away. Unfortunately in the city I live in most all of the homeless people are black so I even catch myself being on guard around other black people on occasion. \n\nI’d appreciate any tips on letting go of the anxiety so I can feel relaxed in public and 100% myself. I asked a few black friends and they said they’re pretty aloof and don’t pay attention to this.\n\na few examples:\n\n- I’m walking down the street, someone passing me will look up and see me and either put their phone away, grip their bag, or eye me until we pass as if to watch for any sudden movement \n\n- when I join a line at checkout or for a bathroom, someone hides their phone or moves their cross body bag to their front side or back side so it’s further than me. once I was in the check out line at zara and turned around to see how much longer the line was. the woman behind me was busy texting and quickly put her phone away and started eyeing me",
    "title": "I’m getting social anxiety from non-black people hiding their bags / phones when I am around",
    "subreddit": "blackladies",
    "timestamp": 1693844898,
    "score": 39,
    "keyword": "white judge"
  },
  {
    "text": "What is it with older Black men being so patronizing? A number of Black men who are older seem to be patronizing to Black women and occasionally others from this weird place of acting as if they must bestow wisdom...or am I trippin? I've noticed this in observing how they try to flirt with women, how they try to teach, and how they interpret other's information erroneously as if looking for something to teach, challenge, or correct. Like...did someone just issue a decree that every Black man has to be a more annoying bagger vance once they're over 40?  \n\n\nI've had male therapists before and all of my therapists have been nice lovely people. However, the Black male therapist I have is...patronizing and often fails to fully grasp where I'm coming from in a way that transcends my having ADHD and rapid fire thoughts. To be blunt, as a therapist being on the receiving end is oddly fascinating. He simultaneously respects my knowledge and I'm encountering an attitude I've experienced specifically the most from older Black men which is a certain level of *let me explain the world to you* combined with this feeling of they're *doing me a kindness*. I am a therapist. I get there's an unavoidable explanatory quality sometimes. But every fucking session I feel like I'm back in high school listening to a particularly great, but deeply annoying Black male teacher who very clearly bought into this attitude. \n\nIt's a sexism problem on one hand, and I've experienced similar with white folks, but they don't do it with this sense of familiarity or attempted \"I'm helping you out by doubting you/talking down to you while simultaneously demanding you meet a certain level\". Or at least it doesn't feel that way, in fact of white folk it seems I get that attitude from the most is white women/afabs, which I think is striking. It is as though because they feel a kinship they don't think they can be perceived as anything other than helpful despite their tone/attitude. The result is me walking away feeling older Black men tend to perceive themselves as sages of the community instead of fully authentically just listening especially to Black women. I suspect they think Black women won't let them get a word in edgewise(...which is less to do with being Black and a woman with me, but more with my ADHD . \n\nOverall while this attitude can be present in other populations and individuals, but this feels so common and uniquely accepted as how Black men of a certain age should be. It appears different than older white dudes who are \\*similar\\*, but generally don't have a sense of that over familiarity/arrogance until they know you well or unless they feel like they know Black folk as a group well (barf). Maybe that's the core, when people feel they understand someone they perceive as less experienced/lesser/in need of wisdom then they don't feel the need to check how they convey information NOR question if they actually understood the information shared with them. They assume they're being the wise mentor, the kindly sage, the Bagger Vance and with Black women it feels so...automatic in the interactions with older Black men. Even men who've tried to flirt with me have on occasion come at me like I don't know what I want, what I'm doing, or as if I need guidance. Meanwhile certain Black men come into the room like they know you especially if you're Black. **It's not about their language, code switching, but about their tone and approach that feels like being put at a distance intellectually while fronting like there's a closeness they uniquely have due to their supposed understanding and wisdom**. \n\n&#x200B;\n\nI feel bad critiquing one of our own when our field needs Black men so badly, but these older dudes stay with this attempted sagely behavior without listening to what a Black woman is saying and he recognized I got defensive because it sounded like he was judging my professionalism without actually grasping the concepts I was explaining. **Am I overgeneralizing to an insane degree? Is this a cultural norm or behavior you've witnessed. Am I codifying race into something rooted in sexism?**",
    "title": "What is it with older Black men being so patronizing?",
    "subreddit": "blackladies",
    "timestamp": 1676484901,
    "score": 32,
    "keyword": "white judge"
  },
  {
    "text": "I don't trust my study director and I don't know why. So for context, I have been skipping most of my classes at university because I was having major anxiety when visiting the lectures (due to being stared at by lecturers and because of having no friends, feeling depressed). So I \"took a time off\" unofficially and was working on everything from home. \n\nMy lecturers noticed this and told our study director about this and he contacted me for a online conversation today morning. We then talked and he seemd rather annoyed and impatient with me than empathic. His tone was kinda judging me like first told me that he noticed I was skipping classes and then asked me what was going on. I told him I was not doing well because of my anxiety (I left out the part of the being stared at ... bc most of my lecturers are white and I didnt want to come off as complaining about race and yada yada). He then proposed for me to take a semester off but I told him that I already did a gap year before starting my degree and didnt want to lose any more time during my studies. He was like \"That's not an excuse for me for saying that.\" and for me it came off as very judgementful and my guards were up even stronger at that moment. \n\nHe then gave me contacts of psychologists on campus, bla bla bla, then told me that he wants to be my \"go-to\" person when I need something and to tell him how things turn out in the future but I dont trust him and I also don't want to tell him anything about me. I just don't know, I get a kind of dishonest, sneaky energy of him, especially what he did to me during the exams (like standing behind me most of the time and staring at me like he was controlling me). I have noticed in general, that he is more tensed up and serious with me than with my other white fellow students even though I am very quiet, don't act up, the only bad thing I did is having not so good grades but even then ... \n\nI really want to trust him but I just don't get that close \"teacher-student\" trust bond with him and mostly hold my distance. \n\nWhat do you think?\n\nP.S. I am the only black person in the whole study program, all others are white, including the lecturers and my study director.",
    "title": "I don't trust my study director and I don't know why.",
    "subreddit": "blackladies",
    "timestamp": 1683223183,
    "score": 17,
    "keyword": "white judge"
  },
  {
    "text": "Truly zero white cast sunscreen? Hi beautiful ladies! I am not a black lady, but my sister-in-law is. \n\nWe live in East Africa, and it's nearly impossible to find cosmetically elegant, no white cast sunscreen here.\n\nI am visiting the States and I really would like to get her some sunscreen, but I'm not the best judge of which types have no white cast.\n\nI'm looking for something that is not necessarily extremely expensive, but certainly feels nice on the skin. Physical or chemical, also Asian beauty! \n\nThank you so much for your suggestions 🩵",
    "title": "Truly zero white cast sunscreen?",
    "subreddit": "blackladies",
    "timestamp": 1688658061,
    "score": 17,
    "keyword": "white judge"
  },
  {
    "text": "Do you market and advertise your business as black owned? There was an internet discussion brought up a while back that stemmed from Jess Hilarious proudly proclaiming that she doesn't support black owned businesses due to unprofessionalism. \n\nI have not advertised or marketed my business as black owned anywhere other than LinkedIn. In part, due to the negative stigma associated with black businesses. I do feel like I will be unfairly judged and held to a higher standard than a typical white owned business or beyond what would even be considered as reasonable expectations just because I'm black. I am an indoor hydroponic farmer (vegetables, not marijuana), co-op organizer and recreational teacher as part of an agriculture/horticulture learning program for kids. I had a black man leave a negative review for my business because I was attending to paying white customers at the farmers market instead of holding up the line and taking time out to entertain him with random conversation. At the end of his rant was \"what you expect from black businesses.\" I had to appeal that bs review for almost a month before it was taken down. \n\nI don't hide it if asked but sometimes I find myself really hoping no one asks. After being asked, I've randomly been asked for skinfolk discounts, had my prices questioned or sometimes I've just had a nice black woman state that she would've supported sooner if she knew it were black owned, which is nice and I appreciate it but it doesn't feel necessary? Out of my friends group I'd say almost half of us are business/side business owners, mostly black women, and none of us advertise our businesses as black owned except for one. The one that does, that's just so it's easier to be identified for grant qualifications.\n\nSo do you advertise and market your business/side business as black owned? What do you think are the real pros and cons of either choice?",
    "title": "Do you market and advertise your business as black owned?",
    "subreddit": "blackladies",
    "timestamp": 1698886262,
    "score": 8,
    "keyword": "white judge"
  },
  {
    "text": "Working in a tech industry... Anyone Works in tech? I'm at a company and I'm a bit annoyed at something that happened. I made an update to fix a bug that was occurring and the tech lead reviewed the pull request and rather than asking me to fix the bug decided to make the changes himself. His changes ended up breaking everything and I ended up spending my day today undoing his changes. I've had incidences with this guy before where I feel like he is over explaining Concepts that I already know, and I feel like I'm being minimalized. I feel as though he doesn't respect my input as a developer and I understand that sometimes I do have my struggles, I'm not somebody that just started programming. I've been working in my field for over 10 years now.\n\nWhat makes the problem feels worse is that I'm one of two black people in the company. There used to be three but one of them got fired last year. When I first got the job, I was afraid that I would be the only black person because everybody in the training videos were white. However because of this, I don't know how to address my concerns about what has happened with the entirety of my pull request being changed only for the tech lead to find out that what I did was correct and he had made things a lot worse.\n\nAfter what just happened, I don't feel as though I'm a respected member of the team. Now on one hand I understand wanting code to be better. What in my experience if you opened up the pull request, people make a comment and you change it. This could have been my point to say listen this is done the way it was because it wouldn't work otherwise. Now I know that the team lead is concerned because I don't know the reasons why I had to do things the way that they were done, but I did test all the ways when I was working on it. This is Legacy code that has some items which are particular about them, and things do easily break. I'm upset that he didn't properly test this changes, because as soon as he deployed, the client came back with issues that were found.\n\nUntil my review, I'm going to try and do my best to make sure I don't make any mistakes or bugs, but I feel like I'm being judged for everything I do. This particular team lead tends to micromanage some of the requests he asked for. And while I understand clean code, it's getting to the point where I'm getting really annoyed with him saying oh do it this way instead of the way that you did it. In another PR he had asked me to do something using vue rather than PHP, which I did initially try only to find out that the page wasn't even in vue. Now I understand he doesn't know everything about every single line of code, but I feel like maybe he should have asked me why I did things the way that I did.\n\nAnyways I'm not sure what I'm going for with this post. I'm frustrated with my job. I feel like I'm about to be suffering from imposter syndrome cuz I feel like I'm not good at what I do but I know that I'm better than what people expect of me. Anybody else go through this?",
    "title": "Working in a tech industry...",
    "subreddit": "blackladies",
    "timestamp": 1679455736,
    "score": 8,
    "keyword": "white judge"
  },
  {
    "text": "I met someone new that I really like but have had traumatic experience’s dating white people… This guy lives in my building which I’m also on the fence about but he’s really cool. You know that feeling when you immediately feel comfortable in conversation and feel a good sense of mutual understanding? It’s like that. \n\nWe’re (27f and 30m) both musicians and met outside through another neighbor. He lives in the exact same unit than me but on a different floor and walking into his apartment felt like an entirely different world! Looked like it was straight out of a catalog. Was absolutely spotless, with nice furniture and art and plants and what not. It was so inspiring being in that space and I haven’t stopped thinking about it since! \n\nWe have a lot in common and I can really feel a strong connection between us that could lead somewhere but deep down, I really don’t have the energy to date a white man at this point in my life. I’ve dated every race land dated a white guy for 2 years almost two years ago. It was my most painful relationship due to several reasons. Ive been betrayed by several white friends as well..I’ve have grew up going to predominately white schools, moved to california 3 years ago and have had multiple jobs where I was discriminated against and more. The reality of it on top of my experiences dealing with white people in general is just daunting. \n\nI feel like no matter how much you try it just boils down to the very obvious differences. I had a hard life and i want someone who’s sensitive to that. I also hate the feeling of someone hearing what I’ve been through and wanting to help me bc I’ve come a long way.\n\nIt also feels somewhat embarrassing for me to date a white man for some reason even though I never judge or having any kind of reaction to any other peoples relationships. With all these feelings it also feels wrong to not give someone kind a chance for that reason so I’m just torn. Has anyone felt or related to any of this?",
    "title": "I met someone new that I really like but have had traumatic experience’s dating white people…",
    "subreddit": "blackladies",
    "timestamp": 1677043822,
    "score": 7,
    "keyword": "white judge"
  },
  {
    "text": "Can I call myself Chinese? I'm half Chinese and half white. Whenever it's relevant I always refer to myself as \"half Chinese\" because I'm a little worried I'd be judged for calling myself Chinese. I'm not 100% sure if I'm supposed to post this here, but I think this is the best place I can get unbiased and honest judgment. The question has been bugging me for a while. \n\nI'll just note some things that are probably relevant. \n\n- I cannot speak fluent Mandarin Chinese, though I am currently learning it. \n- I've been to China (Xi'an, Beijing, and Shanxi province) 2 times that I remember, and a few times when I was a baby. \n- I grew up in a 60% Asian neighborhood. \n- Some people think I look very Asian, while many others don't realize at all. \n- I've read many books on Chinese history, mostly modern history. \n- I currently live in a mostly white area.\n\nEdit: I want to say, I really appreciate all of the responses. I'm seeing a lot of new perspectives.",
    "title": "Can I call myself Chinese?",
    "subreddit": "asianamerican",
    "timestamp": 1693863241,
    "score": 162,
    "keyword": "white judge"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 69,
    "keyword": "white judge"
  },
  {
    "text": "Dealing with with racial insecurity / hypervigilance 31M gay desi guy living in a progressive/liberal US city here. I have faced a lot of racism (ranging from overt to casual/microaggressions) in my life and it has caused me a lot of CPTSD and stress. This has lead me to being very hypervigilant and insecure about my race.\nI’m already doing therapy but thought might wanna ask here.\n\nMy insecurity is less about “I am ashamed to be brown” but more about “I wish I didn’t have to go deal with all the cultural stereotype baggage”. More examples of triggers include:\n\n- Everytime I am in diverse group of people, I automatically put myself in some sort of social hierarchy. E.g. if I meet a hot white guy, I’ll automatically assume they won’t be into me or that I’d be judged for my skin color\n\n- I watch a movie/TV show set in Europe or hear friends talking about how London/Barcelona is so beautiful and fun and instantly wonder why can’t people talk the same about India (versus the usual stereotypes of poverty, pollution, casteism. India is beautiful, it has some of the most stunning landscapes and historical sites in the world)\n\n- I meet a non-Indian person and they instantly tell me about how they have an Indian coworker who got an arranged marriage or an gay Indian friend who is married but closeted (I don’t make any assumptions when I meet a white person, for e.g. that they have 4 step parents or that their parents are racists)",
    "title": "Dealing with with racial insecurity / hypervigilance",
    "subreddit": "asianamerican",
    "timestamp": 1684296201,
    "score": 14,
    "keyword": "white judge"
  },
  {
    "text": "Connecting Hey Reddit! I am a Hispanic woman who grew up with my black mother and white step father (bio father is Hispanic) but was never allowed to learn about my culture. Now as an adult(barely I’m 20 lol), I feel so lost as to who I am and just wanna learn and be a part of my Hispanic culture. I guess my question is how and where do I start? What kind of events can I attend? Learning new languages is hard for me (I speak English and French) but I’m willing to learn to feel more connected. I listen to Spanish music and one of my favorite musicians is gonna be in my home city in 2 months and I really want to go but I’m worried I’ll be judged for not being fluent enough. Any and all advice is appreciated. I think I just need a little courage.",
    "title": "Connecting",
    "subreddit": "Hispanic",
    "timestamp": 1694830039,
    "score": 0,
    "keyword": "white judge"
  },
  {
    "text": "Many studies show black men face more discrimination than black women. Here is the evidence: Intersectional feminists often argue that black women have it the worst, and they suffer worse than black men because they're black and a woman. Well guess what? There's lots of evidence that shows black men face more discrimination than black women.\n\nThis [article](https://theconversation.com/black-men-face-high-discrimination-and-depression-even-as-their-education-and-incomes-rise-141027) by *The Conversation* elaborates on what black men deal with. According to study 1, black boys from the wealthiest families were the most depressed. Study 2 found that for black men, the highest education credentials were associated with an increase, not decrease, in depressive symptoms. Study 3 found that in a nationally representative sample of American adults, black men with the highest income had the highest risk of depression, specifically major depressive disorder. Interpersonal or one-on-one discrimination was not found to be a factor. Study 4 found that 700 black teenagers were followed for two decades in Flint, Michigan. Perceived racial discrimination was measured in 1999 and 2002. Discrimination as teens was a predictor of depressive symptoms in people transitioned to young adulthood a decade later. Nonetheless, this was only true for black men, but not black women. In that same study in Flint, an increase in perceived neighborhood fear, defined as being scared of the crime and violence in the neighborhood, was linked with an increase in depressive symptoms for black men, but not black women. Study 6 found on IAT tests that white men had higher racist attitudes towards black people than white women, but the difference wasn't particularly extreme, but statistically significant. Nonetheless, white women also can be really racist towards black people, too.\n\nBlack men also get arrested, incarcerated and stopped or profiled far more than black women. Even white men experience being arrested and incarcerated far more than black women. And the reason why most prisoners are men isn't simply because men commit crime more. [A significant minority of criminals are women](https://www.reddit.com/r/MensRights/comments/xyl5wb/statistics_cited_women_are_more_likely_to_commit/), but female criminals are severely underreported, get arrested less when reported, are less likely to be incarcerated when convicted, are paroled earlier, and given more lenient sentences compared to men. Additionally, black men are far more likely than anyone else to be killed by police. [In fact](https://www.bloomberg.com/news/articles/2019-08-06/race-and-police-shootings-what-new-research-says), white and Asian men were much more likely than even black or Native American women to be killed by police. Almost all police homicide victims were men! [Black men were also much more likely than anyone, even black women, to be murdered in general](https://www.niussp.org/health-and-mortality/americas-high-homicide-rate/?print=print). [Black men are also more likely than black women to be victims of crime in general](https://bjs.ojp.gov/content/pub/pdf/bvvc.pdf). [Black men also were](https://www.pewresearch.org/short-reads/2019/05/02/for-black-americans-experiences-of-racial-discrimination-vary-by-education-level-gender/) more likely to be subject to racial slurs/jokes, be unfairly stopped by a police officer, have people act suspicious towards them, been assumed to be prejudiced, or to have feared for their personal safety. In fact, 59% of black men had been unfairly stopped by police, compared to just 31% of black women.\n\nAnother study called \"[Gender Matters Too](https://psycnet.apa.org/buy/2008-05171-002)\" found black men and women in 11th grade classrooms differed in their perception of peer and classroom discrimination. For boys, discrimination harmed their grades, attitudes and their regard for the importance of school. For girls, however, the effects generally had a positive impact. Another [study](https://psycnet.apa.org/doiLanding?doi=10.1037%2Fpspa0000288) found that the real root of racism towards blacks was perceived threat, not dislike, and that people were racist toward black people not due to negativity towards them but feeling threatened by them, especially black men. When isolating negativity from threat, they found no automatic black-negativity link. Negativity towards blacks was associated with viewing them as a threat. [In fact](https://polisci.osu.edu/sites/polisci.osu.edu/files/mcconnaughy_white.pdf), another study found that people viewed black men as particularly violent, and viewed white men as more violent than black women. They ascribed a low amount of violent personalities to black women and an especially low amount of it to white women. They viewed black men as more promiscuous than white men, white men as more promiscuous than black women, white women slightly more promiscuous than black women! They viewed black men as less intelligent than black women, and viewed black men as less ambitious than black women. Fast responders gave unpleasant responses to black men far more than to black women. All responders gave black men the most unpleasant responses compared to black women and white men and women, and black women slightly less unpleasant responses compared to both white men and white women! Another [study](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.848.1523&rep=rep1&type=pdf) found that even both male and female participants were equally likely as each other to be more willing to shoot a black unarmed suspect than a white female armed suspect or black female armed suspect. Men and women equally were likely (when not even looking at race) to prefer shooting unarmed male suspects over armed female suspects. An implicit racial bias [study](https://journals.sagepub.com/doi/epub/10.1177/0146167219829182) found that black women were seen as more dangerous than white women by participants of all races, but they still viewed black men as more dangerous than black women. Even when looking at black children, they viewed black boys as more dangerous than black girls.\n\n**Black men had it worse during slavery**\n\nThis thread I made a year ago talks about how there were more male than female black people enslaved in the United States, and the black women were more likely to be free. In 19th century United States, [more men than women were slaves and more women than men were freed slaves](https://www.statista.com/statistics/1010277/black-and-slave-population-us-by-gender/). Although there was always a difference, the difference increased in the Civil War because of all the black male soldiers who died, and women weren't sent off to war as soldiers.\n\nThis only looks at the ones in the US. Believe it or not, the vast majority of enslaved black people were sent to places like South America or the Caribbeans, and a minuscule percentage were in the US. [When looking at all the enslaved black people from the 17th to 19th century](https://www.statista.com/statistics/1183869/ratio-male-female-slaves-by-route-1636-1867/), they found that in any region, men outnumbered women, with the gap being quite large in most regions. Many historians think all slave owners were white men, but evidence found that 40% were white women. They were often cruel and violent just like male slave owners. In fact, George Washington's wife owned way more enslaved people than him. White women were trained to enslave black people from a very young age, and they even were often given slaves as early as 9 months old! [According to](https://www.history.com/news/white-women-slaveowners-they-were-her-property) History.com:\n\n>White women were active and violent participants in the slave market. They bought, sold, managed and sought the return of enslaved people, in whom they had a vested economic interest. Owning a large number of enslaved people made a woman a better marriage prospect. Once married, white women fought in courts to preserve their legal ownership over enslaved people (as opposed to their husband’s ownership), and often won. “For them, slavery was their freedom,” Jones-Rogers observes in her book.\n\n**Black men were raped, too.**\n\nWe often hear about female slaves being raped, and how it was legal to rape black women. [What we don't hear about is how often black men were raped by slave owners](https://muse.jhu.edu/article/448992/pdf). [They often were](https://shareok.org/handle/11244.46/1279). They also were stripped naked and white people laughed at their genitals (i.e.: body shaming of men for their penis size even though they have no control or choice of their penis size). According to the [AAIHS](https://www.aaihs.org/sexual-violence-against-enslaved-men/),\n\n>Foster begins *Rethinking Rufus* by examining how enslaved men’s bodies were depicted in Western art and sculptures that were widespread in the visual culture of slavery. Foster argues that enslaved men’s bodies were “symbols of enslaved manhood and sites of violation” that were objectified through a number of cultural forms including art and literature (12). The objectification of enslaved men depicted in paintings often resembled everyday acts of terror including the public inspection of Black men’s genitals, whippings and lashings, and bodily exposure due to lack of adequate clothing. Visual depictions of enslaved men that emphasized their genitalia and sexual prowess gave way to the prevailing myths of Black hypersexuality and the Black male rapist, an archetype that ensured the extralegal protection of white women from Black men who purportedly lacked control over their sexual urges. Foster also argues that while visual depictions of enslaved men’s bodies often highlighted their athleticism, strength, and muscularity, this same imagery eroticized enslaved men’s bodies in ways that fueled the physical abuses and sexual exploitation of enslaved men. Foster notes that these stereotypes found in eighteenth-century visual art contributed to the eventual punishment and national disenfranchisement of Black men.\n\n**White women also raped or sexually preyed on black men, too.**\n\n[White women also had sexually abused black men, too](http://www.inquiriesjournal.com/articles/1674/sexual-relations-between-elite-white-women-and-enslaved-men-in-the-antebellum-south-a-socio-historical-analysis). White women were authority figures or in a position of power over these black men, and white women had sex with black men, often even raping them forcibly. White women also threatened to falsely accuse black men of rape if black men didn't have sex with them. Because abortion was unregulated, and any woman was able to get an abortion back then, many white women used this advantage to sexually abuse black men without people knowing she fornicated out of wedlock, and was able to abortion \"illegitimate\" children, hiding the evidence that she sexually abused black men. As a result of this and the fact that men could not speak about being raped because people believe men cannot be raped, historical records of white women raping black men are often overlooked, and it could've been more common than we think, perhaps as common as white men raping enslaved black women.\n\n**Almost all lynching victims were men whereas a significant minority of victims were white.**\n\n[Another interesting fact](https://www.newspapers.com/clip/5803482/lynching-nj-1901/): virtually all lynching victims were men. Of all the 2,516 lynchings that happened from 1885 to 1901 in the US, 82.67% happened in the South and 13.75% happened in the North. 66.69% were black and 31.84% were white. 97.97% were men and 2.03% were women. Just 51 women lynched compared to 2,465 men. We always hear about how most victims were black, but no information about how virtually all were men. White men got lynched far more than black women. Black women rarely were lynched, and almost no white women got lynched.\n\n**Black people also face discrimination when it comes to rape.**\n\nIt is true that people are less responsive to black women who got raped than white female rape victims, but if people knew how common it was for men to be raped, and women rape men as just as much as men rape women (cited in a thread I cited above about women being more likely to commit crime than people think), then I'm sure they'd respond less to black male rape victims than white male or black female rape victims. In fact, they'd probably care for black women who are raped than white men who raped. Black men also are viewed as hypersexual, promiscuous, unable to control sexual urges, and always wanting sexual intercourse.\n\nAlso, false accusations happen a lot more than feminists admit, and I cite evidence for it in this [thread](https://www.reddit.com/r/MensRights/comments/xzb7d8/statistics_show_that_false_accusations_are_quite/) of mine, and black men especially are affected. Black prisoners incarcerated for rape are especially likely to be innocent, especially when their accuser is a white woman. White women historically falsely accused black men of rape to get them lynched, and they still falsely accuse them, and while most rapists get away with it, black men who are accused by white women are more likely to be incarcerated even if they're innocent. It was considered rape historically for black men to have consensual sexual intercourse with white women, and there was a double standard for a while where people judged black men marrying white women more harshly than white men marrying black women because black men were viewed as predatory.\n\n**Education/life expectancy**\n\nBlack women also have a higher life expectancy than white men and especially black men, and are less likely to go to college than white men but [go more than black men](https://www.brookings.edu/articles/black-women-are-earning-more-college-degrees-but-that-alone-wont-close-race-gaps/).\n\n**Feminists don't care about black people, not even black women.**\n\nFeminists often don't pay attention much to black women's struggles. Even first wave feminists disregarded them and didn't want them to vote, let alone allow black men to vote, and that motivated them and was a reason why they wanted to vote, because they worried black men were technically allowed to vote despite Jim Crow laws and didn't want them to have the complete ability to vote before white women.\n\nNonetheless, many stereotypes feminists make about men are especially applied to black men due to society historically portraying them as hypermasculine, hypersexual and prone to violence or crime. Feminists' portrayal of men harms black men especially. They also ignore false rape accusations despite that white women still, to this day, falsely accuse black men of rape which is why so many black prisoners are falsely incarcerated for rape, and yet feminists expect every reported person for rape to be imprisoned. They also widely ignore how black women are associated more with the term black than with women, and aren't viewed as normal women.\n\nThis is why womanism (black feminism) was started.\n\n**Conclusion**\n\nDoes anyone notice how people hate black men more than black women? Yeah black women face pregnancy discrimination with prenatal care and dealing with more abortions and unwanted pregnancies, but black men usually don't ever get to see their kids, and often cannot afford to pay child support. Many black children are raised by single moms and barely knew their dad, if at all.\n\nThe reason black men face more discrimination than black women is due to people's racism towards black people being associated with seeing them as a threat, not dislike, and being a woman prevents black women from being seen as a threat as much as black men. Nonetheless, people might see black women as more dangerous than white women and be racist towards them due to a guilt by association mindset. In spite of that, people still are more racist towards black men because when racial attitudes are mostly about feeling threatened, people tend to view women in general as harmless, which is different from how they view men in general.",
    "title": "Many studies show black men face more discrimination than black women. Here is the evidence:",
    "subreddit": "MensRights",
    "timestamp": 1699982481,
    "score": 197,
    "keyword": "white judge"
  },
  {
    "text": "Hypocrisies of Feminists Feminists are the biggest hypocrites of everything. We all know this by now. Add any other examples of hypocrisies in the comments.\n\n* They preach about stop body shaming yet will insult men with \"small dick energy\" or call them a \"little man\".\n* Claim they want men to open up their feelings but insult them with words such as fragile, fragile male ego, fragile masculinity, toxic masculinity, emotional, sensitive, etc. They are the same people to hold up a mug saying \"male tears\" too.\n* They want their experiences invalidated yet will always claim that women attempt suicide at higher rates (which is not true) when it comes to men killing themselves more. This is invalidating men's experiences.\n* They want to not be judged by their number of sexual partners but will call any man who disagrees with them incels or virgins. They will further complain about how men should stop valuing themselves and other men by their body count yet women clearly do the same thing in this example.\n* They do not want women to be generalized but then proceed to generalize all men as rapists, creeps, pedophiles, murderers, etc. On the topic of rape, men are not even close to the supermajority of rapists compared to women but feminists refuse to admit this.\n* They view gender based scholarships and affirmative action as equality despite women already making up a majority of college enrollment.\n* Feminists claim that they want to abolish all gender roles but will never adhere to them themselves. They demand men pay the first date if not all the dates, demand that men ask them out, demand men propose, demand a man taller or substantially taller than them. They will never advocate for more women working in dirty lower paying jobs, just the white collar cushy office jobs. They only want to abolish gender roles that are convenient to them.\n* They claim \"my body, my choice\" but will actively genitally mutilate (circumcise) their sons. It is mostly done by women and requires a mother's consent. They do nothing when it comes to the selective service or the draft for men.\n* They call men misogynistic for dating preferences such as having no body hair or not being fat but demand a man 6 feet tall with a 6 figure income.\n* Feminists claim that men never take accountability when men get longer sentences for the same crimes.\n* Feminists will claim that the suffering of women is a man's fault and the suffering of a man is a man's fault or the sufferers fault too. How much have they done to address the growing educational gap between men and women? When women fall behind in education, it is a man's fault. When men fall behind in education, it is a man's fault.\n* Feminists will whine and bitch about how most of the top 0.000001 % are male billionaires while never talking about how most homeless people are men (who there are a lot more of than billionaires).\n* Feminists claim that their opponents are sexist despite asserting that \"men are trash\" or \"#killallmen\".\n* Feminists will claim they are not racist but will characterize Indian men as creeps and sexual predators.",
    "title": "Hypocrisies of Feminists",
    "subreddit": "MensRights",
    "timestamp": 1691023832,
    "score": 145,
    "keyword": "white judge"
  },
  {
    "text": "Attacking men is attacking me When I see the patriarchy being blamed, I feel marginalised as a man. I also feel that however patriarchy is defined, some men did bad things, many men did good things, built society, lost their lives, sacrificed themselves for the benefit of others, and it saddens me that all this is wiped, and we are instead defined by the bad and imperfect.   When I hear men being stigmatised as oppressors, I feel stereotyped. When I hear people say I am privileged therefore I am showing my aggrieved entitlement, I feel minimised as a person. When I hear people talk about bad qualities associated with men, or use masculinity as a negative, I feel personally vilified.  \n\nWhen you attack symbols of my identity, I feel devalued as a person. When you see me as privileged without knowing me and my life, and without recognising the privileges in other identities, I feel judged, and unsafe, that I can be stereotyped into your box, so that you can devalue me. When you attack men, whites, Christians, middle aged, etc, you are attacking me. I take it personally. I feel it. I don't intend on taking it personally but these are parts of my identity and I am not ashamed of who I am. \n\nI choose not to be treated as disposable; to shut off my feelings and pretend I don't feel pain. You may say I am angry because I am an entitled white man, and to you I say, who are you to judge me and who are you to show your sexist racist stereotyping. That hurts when you say that. I did not attack you or your group. Sexism hurts you.  Guess what. It hurts me too!  Why attack me and my group? \n\nI can be angry. I can feel offended. I can feel judged. I can feel sad and demoralised. I can feel hurt.  I am a man and not a creature to be despised and devalued. I will not accept or tolerate that. \n\nI invite men to sense how you feel when people criticise us.  Let them know the impact on you personally. Give them arguments they will give you their rationalisations. They think men are heartless and invulnerable - that we have no feelings, powerful, and that we can take constant criticism. They rely on this myth to keep us disposable. Give them your truth - how you really feel, how it impacts you personally. They may criticise your expressed vulnerability but they will they will leave as the bully, not the virtuous. \n\n&#x200B;",
    "title": "Attacking men is attacking me",
    "subreddit": "MensRights",
    "timestamp": 1698585158,
    "score": 147,
    "keyword": "white judge"
  },
  {
    "text": "I was in a Left Wing subreddit and someone responded to me with this, and I'd like to get your guys' opinion on it. Do you feel like this could ultimately explain why Men are treated harsher in general? >*\"Generally speaking, it is always easier for people to judge other people who are in their peer group (at least as far as a \"left wing\" type person). So being a white guy, I am most likely to criticize the behavior of other white guys. I feel less comfortable criticizing the behavior of women, or of other ethnic groups. Maybe there should be some universal moral code that you can objectively apply, but I just don't know the backgrounds of a lot of people well enough to sit in judgement. Or I feel like I don't.\"* \n\n- An average redditor.\n\nThe logic here is that groups normally criticize their own and ignore the bad behavior of other groups, and this is normally how things work. This is what a leftist said to me to justify why women aren't as responsible for the bad things they do. White men have all the power, white men will only criticize other white men, and thus, you have modern society where only white men get in trouble and lose everything. Russel Brand gets MeToo'd, Amber Heard gets a Netflix documentary.\n\nBut does this logic track? Does it even make sense across the board? Is this how all \"peer groups\" work? Are women generally too nervous to criticize men, and only hold other women accountable? Or is this just some complete tripe that a Leftist came up with to justify his weird brand of racism/sexism?",
    "title": "I was in a Left Wing subreddit and someone responded to me with this, and I'd like to get your guys' opinion on it. Do you feel like this could ultimately explain why Men are treated harsher in general?",
    "subreddit": "MensRights",
    "timestamp": 1695235113,
    "score": 80,
    "keyword": "white judge"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 62,
    "keyword": "white judge"
  },
  {
    "text": "Military False Accuser: Is There Any Justification? BLUF: Big Black Active Duty service member VS Cute Little Asian girl. I was facing 30 years for a crime I did not commit, do you think I stood a chance against my false accuser? Who would you put your money on to win that battle? I had to start training for that Prisoners Vs Guards annual football game, I was going to try out for Cornerback.\n\nI was falsely accused of Rape/Sexual Assault (Article 120 of the UCMJ) by a fellow service member. My NCIS investigation lasted several months. During that time, I thought my life was over, I thought my career that I had spent years building was over, and I was sure that she would be believed without question simply because she was an attractive female and she’s very well-liked as far as I can see (she has no shortage of white knights looking out for her). Objectively, superiors would consider me a top Sailor not only in the Navy but also within a Joint service environment, I’m not saying that to brag, I’m just trying to paint the picture for you that I’m the furthest thing from what I was accused of. \n\nOnce NCIS brought me in for questioning, that is when I found out what I had been accused of. Up until that point, I just had a No-Contact order issued to me that didn’t state why. NCIS had a Chief escort me in then asked me some biographical information and showed me the form that revealed the accusation and my accuser. I looked at the paper, then I acknowledged it and signed with no reaction. Inside I was furious to see I was being accused of such a heinous act even though if you asked anyone who worked with us (other than her confidante who probably believed her), I would be the last person people would say could have sexually assaulted someone, but I still had no idea what she said I did. The agent then said to me, “we just want to give you the opportunity to tell your side of the story”. At that point I invoked my right to remain silent and have legal representation. The agents then let me go. I then called and retained the best UCMJ lawyers I could. \n\nThere was nothing for the attorneys to work with since I hadn’t been charged, but I was fully expecting this case to go all the way to court martial, not because I was guilty, but because I knew she would be believed even though she came forward with the allegation almost a full year after we had last spoken. I spent months preparing for all of the possible charges I could think of, I made a PowerPoint, constructed a video with hours of analysis giving everything that happened between us which proved that I never sexually assaulted her. I was ready for battle to say the least.\n\nEventually my command legal Officer would randomly reveal to me that the NCIS investigation had finished and the Staff Judge Advocate (SJA is basically the prosecutor) had chosen not to charge me with anything and my Command chose not to take ANY adverse action against me (I interpret that as they know I did nothing wrong but they had to go through the motions). \n\nNone of my friends or family were ever even interviewed. I couldn’t even tell my mom because she wouldn’t have been able to handle it. She nearly had a mental breakdown once I revealed at his whole situation to her. She commended me for keeping this from her because I protected her from herself.\n\nI’m waiting for the Freedom of Information Act (FOIA) request for my investigation to see why I wasn’t charged because there must be something that they found revealing she lied and was an unreliable witness. I want some type of justice, I will continue to be the best that I can be and remain successful in the military, striving to take care of my shipmates, but I’d be lying if I told you I didn’t have thoughts of taking the law into my own hands at some point.\n\nThis was a good result, but it’s bittersweet that I didn’t get to face my accuser and she’ll get away with trying to ruin my life. It cost me a fortune in legal fees since I was facing 30 years in prison 30 years of probation so I didn’t want to leave my fate up to a free military lawyer who wouldn’t represent me until I was charged. The cost of defending myself pushed my family’s wealth back years and it’s going to be an uphill battle trying to recover. It also cost me sleepless nights of wondering when the police would come take me to jail. Aside from the mental health anguish it cost me and my wife who was diagnosed with stage 4 cancer during this time, I can’t interact with women the same anymore. I came from absolutely nothing and made it to briefings where I’m advising Generals and Admirals on adversarial matters of National  Security with high priority targets. I never even thought I’d make it this far coming from the projects, so for someone to be able to take all of that away with a lie is unconscionable. If I worked this hard to get what I’ve earned, what do do you think I was willing to do to keep it? The military has no recourse for false rape accusation victims so I’m wondering if anyone has ever sued their false-accuser and won! \n\nI’m a YouTuber and I’d love to do a video about this, but now may not be the time. I’ll need to consult with a lawyer after the FOIA comes back and then check to see if it would be a good idea. I don’t want a defamation suit against me for something that is avoidable. Now that the case is dropped, what resource do you recommend for justice? If you have no resource, that is fine, I’ll still appreciate your kind words, and I’ll still push forward and kill ‘em with success.\n\nTLDR: In the words of Cassidy, “I’m an innocent man, I’m just from the hood”.",
    "title": "Military False Accuser: Is There Any Justification?",
    "subreddit": "MensRights",
    "timestamp": 1679758326,
    "score": 44,
    "keyword": "white judge"
  }
]