[
  {
    "text": "IT Job Hunting 101 As I've been recently asked more than a few times here (and elsewhere) how I've managed to get laid off 4 times and never out of work longer than a month.  In fact, every time I've really set myself to finding a new job it's never taken longer than a month.  I've helped at least a couple dozen people in my field find new jobs using this method...so I thought I may post something that may be of help.  Even if you're not in IT, some of these tips may help you.  \n\nDisclaimer:  You may agree or disagree with what I've posted.  I'm not saying it's gospel, it's just what has worked for me and others that I've helped along the way.\n\n# IT Job Hunting 101 \n\n### I.  Resume\nFirst thing to do is take a look at your resume and understand there are 2 audiences that will review your resume.  The first is recruiters (either contract houses or internal recruiters).  They don't care about what you've accomplished as much as they're for keywords.  They don't understand the technical terminology (most of them), they just know what they need to find.  The second audience would be hiring managers and technical staff.  They want to know your responsibilities in your previous jobs and what you've accomplished.  I've refined my resume over years of asking recruiters, managers and technical staff if my resume was easy to read and understand.  Ignore the rule about the 2 page resume...it's crap.  \n\nOne thing about lying on your resume.  It's one thing to stretch the truth, it's another thing to lie...there's a difference.  If you lie, odds are you'll be caught and excluded.  But saying you can do something that you CAN do (even if it wasn't in production) isn't really lying as much as stretching the truth.\n\n\nAnyway, on to the resume format.  This format has had good success with the people I've helped to revamp their resumes\n\n\n\n    Date               Company                                City, State\n    Job Title (in BOLD)\n    1.  I start by listing responsibilities in a couple of bullet points\n    2.  Then I add accomplishments\n    3.  Typically, I end up with 7-8 bullet points\n    4.  Use terms like built, created, designed, deployed, implemented and managed.  Don't reuse terms if you can avoid it.  \n    5.  The last item is my technical environment which is not a bullet point but an entry under the last bullet point (and it lines up with the rest of the text).  Example\n    Technical Environment: Windows 2003/2008/2008R2,2012R2, Active Directory, ESXi Server 4.1/5.0/5.1/5.5, vCenter 5.0/5.1/ 5.5, WSUS 3.0.\n\nI always have a friend with decent English and IT skills proofread my resume before I submit it anywhere.\n\n### II.  Organizing your job search.\nI start with an excel spreadsheet with the following columns:  \n\n1.  Recruiter\n2.  Recruiter contact #\n3.  Recruiter e-mail\n4.  Position interested in/submitted for (this is important, many companies will exclude you if you've been submitted for the same position by multiple firms).\n5.  Last contact date.  It's important to maintain contact with your recruiter weekly (no more than that).\n6.  Step in the process (submitted, interview (list date), background check, offer, etc)\n\n### III.  The Search\nI really don't have any earth-shattering tips to share here...it's really a numbers game.  The more jobs you're submitted to, the more interviews you'll have.  The more interviews you have, the more comfortable you'll be with interviewing (and the better you'll perform).  If you don't have an established list of recruiters and contacts, you'll have to troll around Dice and other job boards looking for positions with your skill set.  Apply to those positions directly, speak with the recruiters.  Talk to friends in the field (and LinkedIn can help here).  Contact recruiters you've spoken to in the past about other jobs.  Be aggressive.  When I've been laid off, my full-time job was finding a job.  I'd be on the phone and searching every morning from 8-noon. \n\nBefore I hit a senior level in terms of skills, I'd message ALL of my LinkedIn recruiting contacts stating that I was actively pursuing new opportunities.   I'd also message the recruiters I've worked with in previously telling them the same.\n\n### IV.  Recruiters\nFirst thing is to be up front with what your salary requirements are and what type of position you're looking for.  If you're out of work, you can't afford to be as picky.\n\nI contact recruiters I've had contact with weekly (a week apart) and tell them that I'm sorry if I'm being annoying, but I'm really interested in XYZ position at company ABC and I want to know where we are in the process.  If you've interviewed, ask the recruiter if they've heard any feedback.  Most contract house recruiters get paid a salary and commission for placements...so understand that they really don't care about YOU per se, they just want to get the job filled. However, if you can build a bit of a personal relationship with them, it DOES help that they remember you.  I've gotten a few positions with recruiters I've maintained contact with over a course of years.  Many times they've thought I may be a good fit for a position and I was their only submission.   \n\nDepending upon your level of desperation, you should ignore recruiters that only e-mail you or only contact you via LinkedIn Mail (especially recruiters that are outsourced recruiting).  If a recruiter calls you, by all means pick up the phone and talk to them.  Good recruiters will call you and maintain occasional contact with you (at the point where you have a good relationship, e-mail is perfectly acceptable).  \n\nAfter you get a position, maintain contact with the GOOD recruiters on the list, give them leads on people you know that may be looking.  Keep this list and use it for the next time.  \n\n### V.  Interviews\nI can tell you that I've gotten most of the positions I've interviewed for...and that over 20 years and countless interviews, I've only really blown 2 interviews.  The first was early on in my career and there was a pen on the table and I started fidgeting with the pen.  I caught myself half way through the group interview, but the damage was done.  The second was a techical interview for one of the top companies in the field.  I was nervous about the position going in (because of the company AND the position was different than I was used to).  About a quarter way through the interview, I was asked to whiteboard the architecture I came up with (something I wasn't prepared to do) and I experienced total vapor-lock.  I forgot everything and fumbled around trying to draw it on the whiteboard.  Afterwards, I called a buddy of mine and gave him the lead on the position as well as the hiring manager I interviewed with and told him, \"Look, I know I blew the interview but I'm not calling you for that.  I do have someone that would be a good fit for the position.  Turns out my buddy did interview and did get the job.  The bottom line is that I've learned from my mistakes.  \n\nThe interview is where you set yourself apart not just technically, but personally.  They're not just interviewing people they want to do a job, but people they can work with.  \n\n1.  Prepare for your interview.  Know what the position is and what it entitles.  Know about the company (what do they do).  Try to find out if they have any other offices.  Find out how many employees they have.\n2.  Review your resume and recall the things mentioned on your resume as you'll likely be asked to explain those items in greater detail.\n3.  If you've been laid off, do NOT show up down for an interview.  If I can get away with it, I try not to let them know I'm already laid off (because you're subject to being low-balled if you get an offer).  But if you can't get away with it, it's best just to be honest and say that it's just business and it happens and smile when you say it.  Your mental state when interviewing after being laid off says a lot about you to your potential employers about how you'll deal with stress on the job.  If you maintain a positive attitude despite being laid off, most interviewers will be impressed.  How do I know this?  I've asked the hiring managers after I started the new job what set me apart (aside from my technical ability).  They've said my attitude was positive in spite of being laid off.  \n4.  Sit straight, hands in your lap or lightly clasped in front of you (no white knuckles..LOL).  Be relaxed.  Smile.\n5.  Ask them questions about the team, working environment, and technical environment.  You should be interviewing them as much as they're interviewing you.  Believe it or not, this does set people apart when they make a decision.\n6.  Bring examples of your work.  NOBODY does this.  I've brought examples of documentation I've written for environments I've architected.  I've also brought examples of code I've written.  I never provide the ENTIRE document or code (if they want that kind of thing, they can hire me). \n7.  Do NOT bring up salary requirements at your interview unless they ask...this is usually taken care of BEFORE the interview by the recruiter.\n8.  At the end of the interview, ask how you did in the interview and if there's anything more they'd like to know or things you could improve on in the interview process.  Again, this says something about you wanting to constantly improve.  \n\n### VI.  Social Media\n1.  LinkedIn - Use it.  Don't add everyone, add only recruiters you've spoken with (otherwise you'll get crap leads).  For every job you have you should get at least 1 recommendation (I usually shoot for 2...one from a peer and and another from a manager).  Tailor your skills and endorsements for your needs (remove things you don't like or don't want to do) \n2.  Facebook - Do NOT have your profile set to public and have pictures of you looking like a douchebag available for anyone to view.  That's the same with any other social media site you belong to...employers can and will look you up (even if it's unofficially).  \n\n### VII.  After getting the job\nGo get drunk.  Just kidding.  Hell you may want to, just don't drive.  Anyway, there's some follow-up stuff I do after I get a job (not immediately after...maybe 30 days after).  \n\n1.  I contact the recruiter and ask them for feedback on my resume.\n2.  I ask the people I interviewed with what set me apart from other candidates (so I can remember these things).  \n\n### VIII.  After NOT getting the job\nGo get drunk.  No really, go get drunk.  Not really.  Get your chin up and say, \"Next!\"\n\n1.  Find out why you didn't get the job from the recruiter the hiring manager or both.  Ask what they were looking for and what you could improve upon to get the position if it should open up in the future.    \n\n### IX.  Career-Building\nAs someone with 20 years in the field, I can tell you that until I reached a senior level position, my main goal when changing jobs was to do something a little bit different.  Early on, I was only doing Windows...but when I had the opportunity to work at a place that would cross-train me in linux, I took it.  That led me into doing work with VMware When I had the opportunity to do storage in addition to virtualization, I took it.  Stretch yourself...you should look at a job as a resume builder.  \n\nExperience > $$$  Until you get experience, money should be a secondary concern.  I've had 2 occasions that I took pay cuts ($5k) just to have an opportunity to do something I knew would pay off (it did).\n\nAdmittedly, I have a somewhat mercenary approach my career.   Part of that is because I've been the high-priced (at least from what they're paying the contract house) contractor guy and the first to feel the axe when cuts are made.  Because of that, I've come to the conclusion the only loyalty I owe any company is my time and quality of work.  Beyond that, I don't owe them a thing.\n\nOne thing I forgot to mention...and this is also important.  I know the rule is don't talk salary with other people.  While you should NEVER discuss salary with co-workers...that rule doesn't apply to *former* co-workers.  Once you've left you can ask people in a similar position what they're making.  I know what my job pays for my area...both at the top and the bottom of the scale.  Why?  Because sharing information helps everyone out as it's easier to know your worth in the marketplace if you have those discussions with people you've worked with (NOT currently working with).  \n\n### X.  Giving Back\nI've done a few free seminars on this stuff.  I've been very fortunate in my career and I wouldn't be where I am without the help of others.  I've always tried to help people I know with their careers...finding new jobs, feedback on their resume, lists of recruiters, whatever.  I'm fortunate in that I love my career...I want other people to be happy in their careers as well.\n\n#### Special note for those unemployed workers out of work for more than 60 days\nI'm going to suggest you do the following.  That if you have a gap in your resume that you fill it with something stating you're self-employed IT.  You were doing independent contract work (using your skills) for small businesses or freelance work.  There's a stigma against having large gaps...because wonder if you're so good, why are you out of work?  Yes, I'm telling you to lie on your resume to get past the ridiculous stigma people have against people out of work.  When asked on an interview state that you've been doing whatever independent work but you wanted a more consistent level of work (pay).\n\nEDIT:  Added a bit about sharing salary info.",
    "title": "IT Job Hunting 101",
    "subreddit": "jobs",
    "timestamp": 1485209298,
    "score": 143,
    "keyword": "white manager"
  },
  {
    "text": "Sam Club Manager won't hire \"Cholos/eses\" I went to Sam's club for an interview and the manager was a cool guy but he told me that he does not hire people from wal-mart aka \" ghetto people \" or Cholos/eses. I have no problem with it but isn't it messed up cause some of my family/friends are \" cholos \" and their cool.\n\n\n\n\nThe manager is Mexican I think, pretty sure he's not white",
    "title": "Sam Club Manager won't hire \"Cholos/eses\"",
    "subreddit": "jobs",
    "timestamp": 1510963305,
    "score": 20,
    "keyword": "white manager"
  },
  {
    "text": "Working 40 hour weeks but massive facetime work culture. What to do? I work a white collar job, was recently moved to an interim department for on-the-job training before an upcoming promotion to a position in another department.\n\nI loved my old team, everyone minded their own business, not much small talk during work or even any attempt to be friends, but we would have drinks once a month. My boss was a good manager - very progressive way of working, didn't care where or when people worked, as long as work was done and deadlines were met.\n\nMy interim department is the opposite: straight up prehistoric. Boss of this department is a double-standard, hypocritical asshole. He wants butts in seats 8 hours a day (9-6) 1 hour unpaid lunchbreak, Monday to Friday. Working from home is explicitly banned NO exceptions aside from family/medical emergencies. Yet he does it pretty often himself, once he worked from home for almost a month straight because of a personal home improvement project WTF.\n\nThe result of the facetime culture is a lot of slacking off, surfing the net, Youtube videos on speakers, small talk and fooling around to kill time (boss' office is in a different part of the building). The distractions mean it's hard to get anything done. This facetime culture is fucking stupid, if everyone cut their shit out, they could be done in 5-6 hours a day and home early.\n\nThere's lots of guilt tripping if someone arrives late/leaves early, is missing from their desk outside of their robotic lunch hour (Very few meetings but a lot of \"desk work\"). Way too much nose poking into one another's business, like asking what time who arrived, wondering aloud if someone who called in sick was faking, overall toxic as fuck\n\nI actually am less productive despite spending more hours at work and significantly more unhappy now. With my old team, I would go the extra mile because I liked me boss, and wanted him to look good to his boss. I would work and reply to emails during weekends at home not because I had to, but because I felt bad for being in office 25-30 hours a week.\n\nThe good thing is I'll be done training in this toxic hellhole, moving to a (hopefully better) department and getting a raise at the end of the year. The bad news is that even surfing the net has become boring as shit.  I've started taking double lunch breaks to burn through \"time being bored\". What should I do (career wise and to fill up time)?",
    "title": "Working 40 hour weeks but massive facetime work culture. What to do?",
    "subreddit": "jobs",
    "timestamp": 1501788735,
    "score": 14,
    "keyword": "white manager"
  },
  {
    "text": "Switching from a white collar job to a blue collar career. I'm looking for people who went from white collar office work to blue/grey collar and work with their hands mostly. It can be anything : plumbing, electrician, construction project manager, etc. \n\nI'm looking for some information as to how and why people have made the jump!!",
    "title": "Switching from a white collar job to a blue collar career.",
    "subreddit": "jobs",
    "timestamp": 1485907217,
    "score": 11,
    "keyword": "white manager"
  },
  {
    "text": "Interview questions to ask to gauge organization and management style A few of my most recent job disasters were plagued with micromanagers and disorganization. Now that I'm interviewing for new positions, I want to try and ask the right questions to weed out managers and companies where these are major issues. What are some specific examples of questions I can ask to gauge this? Should I go with scenario questions, or more black-and-white questions?",
    "title": "Interview questions to ask to gauge organization and management style",
    "subreddit": "jobs",
    "timestamp": 1492639022,
    "score": 11,
    "keyword": "white manager"
  },
  {
    "text": "Why do all the soccer teams have white coaches/managers and none of them have a black, brown, Asian, etc?",
    "title": "Why do all the soccer teams have white coaches/managers and none of them have a black, brown, Asian, etc?",
    "subreddit": "AskReddit",
    "timestamp": 1503899533,
    "score": 3,
    "keyword": "white manager"
  },
  {
    "text": "Hostility from female RNs/patients to female MDs... Hello everybody, \n\nMy significant other is a female in medicine. We're both in residency and apart from the common gripes we have about residency, she gets things like... \n\n*going to a male patients room to examine him. \"I told you not to wake me unless you had my dinner tray?\" \n\n\"Are you the cleaning lady?\"\n\n\"Are you my nurse?\" \n\nDespite her wearing a white coat... introducing herself as doctor... doesn't matter. But, what I found most surprising was the hostility of nurses. It so happens that my SO is a former nurse before going to medical school.\n\nNaturally, this poses some unique challenges and opportunities/perspective. \n\nThe part that infuriates me... is the nurses who treat female residents or residents in general poorly. Who then say things like... \n\n\"I know that we (nurses) can do medicine, because we know more than you a lot of the time.\"\n\nOr even worse... questioning the management decision being made by the female resident. I've gotten a call before and I gave the exact same answer as the female resident. Nurse goes \"oh, just making sure! Heehehe\" \n\nAnybody else have similar experiences? If so, how did you or how do you handle them? Share your stories. Or nurses if you've witnessed this please share also. \n\ntl;dr - how do you deal with patients/RNs who treat female doctors as subhuman.",
    "title": "Hostility from female RNs/patients to female MDs...",
    "subreddit": "medicine",
    "timestamp": 1491456096,
    "score": 126,
    "keyword": "white manager"
  },
  {
    "text": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this. Background: I work in a city hospital that serves a very impoverished minority population . Our Institution isn't exactly stellar  , so except for Radiology and Surgery most of our residents and staff are FMGs or IMGs.  Me (FMG) and my posse ( Mostly FMGs)were doing our rounds. Being a Sunday , out team was providing cross-coverage and we had a lot of patients to round on. \n\nWe make to the ED to examine a patient who had come in with shortness of breath and  diagnosed with a PE. The patient was a black transgender patient. She had been in the ED for a couple of hours \n\nThe moment I stepped in the room my spidey-sense started tingling. Started off rough enough \" who are you ? why Are you here ? Why are  you rounding so late?.I'm short of breath\" ( while screaming at the top of her lungs).  Ma'am . I had 30 patients. i needed to prioritize , but you have my attention now . \n\nShe explained that she was basically ignored by the nurse ( which was true - was not hooked up to telemetry or SO2 monitoring ).\nI apologized to her and told her I would talk to the nurse and that she should take it up the charge nurse. So far nothing usual. \nThen she went off on a tirade  .\" My mother worked in this hospital ,I also worked in healthcare . Used to come here sometimes until I started getting my care in  *Brand name * Hospital . This hospital was  much better run when we had Real American Doctors, not all these foreign doctors.\" She repeats this stament verbatim again during the course of the encounter. \n\nNow my interns and resident are visibly disturbed. But she goes on . About how her usual hospital is much better.  I then remind her BTW, I'm also foreign ( my phenotypic  ethnicity is ambiguous- on a good day I can pass off for Hispanic/Italian . I was called \" white trash \" once ).\n\nIn order to diffuse the situation , I agree with all her comments. I  put in a few negative comments about my own hospital( I find this works very  well to calm down a an angry patient/family )  This eventually calms her down , and I manage to get a coherent history and physical exam.\n \nBy the end of the encounter I tell her \" Ma'am, I'm sorry you couldn't get a real american doctor today \". She then suddenly becomes apologetic.  \"Oh, I didn't  mean all foreign doctors are bad . Just like the cops you have good ones and bad ones  . You all have been very professional . \"\n\nI shake her hand and the encounter ends.\n\nI don't know how to feel about all this. My training tells me that the outburst was probably a reaction to the stress of being in a hospital and mistreatment by the ED nurse. She did apologize in the end ( cant vouch for the sincerity of it  though ) . She herself belongs to a very marginalized group ( Black M-to-F transgender ) but had no qualms or second thoughts about espousing xenophobic comments.  \n\n Throughout  my training I've been on the receiving end of irate patients .But this encounter left an especially bad taste in my mouth. I guess the fear of \"the others \" is a very primal urge. And all these civilities are just veneers on a underlying tribal  mindset. \n\nAt least I can watch the WWE Summer Slam tonight and get my mind off this .\n\nAnyone else here had similar experiences ? How would you debrief your residents/interns ?",
    "title": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this.",
    "subreddit": "medicine",
    "timestamp": 1503260107,
    "score": 37,
    "keyword": "white manager"
  },
  {
    "text": "I had a psychotic breakdown at work This will be a very long post. But I feel like it's worth reading. As fellow nurses, you all know that we stretch ourselves too thin. We work long hours. We have stressful shifts. We push our bodies and our minds over and over again. For our patients. For our coworkers. For our families. We all know that we should take care of ourselves. We all know we should eat better, exercise more, drink less. Stop saying yes to picking up extra shifts. Stop going without sleep so we can spend time with our friends and families on our off days. Of course we know all that. But we're nurses, it's just what our life is like. So we keep going. Until we break. This is my story about my break.\n\nI had worked 3 night shifts in a row. Nothing new. I've always worked nights. I hadn't slept well at all, also not new. I've been taking meds for insomnia for about 5 years. I was on call from 2300-0700 for night number 4. I had got somebody to cover the first 4 hours of my call because I wanted to go to a mystery theater dinner thing. The day after shift 3 I didn't sleep. At all. Just could not fall asleep, even with drugs.  I should have skipped the dinner and tried harder to get some sleep. But I was really looking forward to it so I got up an I went. And then of course I got a text saying they would need me at 2300. I was already so tired, my eyes were burning and my face was flushed. I was over emotional already. But they needed me so I had to go. \n\nI work in L&D. I've been at this unit for about a year. Before this I worked step down. I'm pretty comfortable in L&D now. Still haven't encountered a lot of things but for the most part I'm confident in my skills. When I get to work the unit is slammed. And there are 2 triages that had just come in that my charge nurse gives me. Both are rule out labor. As soon as I start working I realize I'm kind of off. I go to the supply room for something and totally forget what. I stare at a fetal strip forever before being able to analyze it. I forget where to go in our charting system to get to certain things. One of the triages is fine, going to be discharged. The other is 38 weeks and having contractions every 2-7 minutes. Her cervix is 2/60/-2. Her doctor happens to be on the unit for another delivery so I let her hang out on the monitors to wait to see what the doctor wants to do. So I start working on discharging the other patient. About half an hour or so later I've discharged the other patient and the MD gets out of the other delivery. She looks at the strip and says \"She's having lates. Why haven't you admitted her?\" I look at her strip (even though I'd been checking it regularly and it looked okay) and see she HAS been having deceleration. Go in the room and patient is obviously in pain. Recheck her she's 4/80/-1. I try to get an IV so I can start her bolus for an epidural. I'm flustered and scared, I have the volume on the monitor up and I can hear baby's heart rate keeps dipping. I can't get the IV. I go to get some help. The other nurse gets the IV quickly and I start a bolus, turn the patient to the left and put her on some oxygen. Strip still looks iffy but I just can't really get a good picture of what's going on. I don't know what to do. So I go out to the nurse's station and ask somebody else to take a look at it. \"Oh yeah, looks like she started having variables here. And then they turn into lates here. And now her variability is minimal.\" I start crying. It was like a faucet got turned on. I can not calm myself down and stop crying. Everybody surrounds me and keeps asking me \"How can I help you? What can I do?\" And I can't even think straight to know what to ask them to do. So my charge nurse switches around assignments and I give the labor patient away and get some post partum patients instead.\n\nThe next few hours are horrible. I keep crying randomly, my eyes are so swollen and my face is red. I can't concentrate on anything. I'm having a hard time keeping up with which patient needs what. All the nurses keep looking at me like \"You poor thing\" and being overly sugary and sweet towards me. \n\nAround 0530 thing start getting worse. I was looking at a nurse telling her something about the labor patient I had and I thought that I saw her eyes dilating and then contracting back. I kept staring straight into her eyes. I would tilt my head to left and then back to center over and over, all while looking into their eyes and seeing them dilate and contract over and over. I snapped out of it after about thirty seconds and was terrified. The nurse was obviously a little freaked out and kept asking if I was okay. I tried to shake it off and kept telling myself the shift was almost over. I'd be able to sleep soon. But then it happened again. My heart was pounding and I started hyperventilating. At this point all of the nurses are very worried about me. My charge nurse talks me into going to the ER. I try to call my boyfriend as my charge nurse walks me down to the ER but he doesn't pick up. Once in the ER ever person I interact with I think is in this little \"trance\" where their eyes glass over and dilate while I stare. I start to think that I'm somehow infecting these people when I look at them and making them go into a trance.\n\nThe get me back to triage quickly. My HR and BP are through the roof. I can hardly talk at this point. I'm trying to explain how I'm feeling to the triage nurse but every time I look at him he starts going into this trance. I really start panicking at this time. I keep telling the triage nurse to get help because I'm making him sick. I keep going over ACLS steps in my head because I think that either I'm about to code or this triage nurse is. My boyfriend calls me back at this point and I tell him to get to the ER because I feel like I'm coding. \n\nThey get me back to a room. Every single person that comes in I think is in this trance. They seem like they're walking slow and moving slow. Their eyes are glazed, pupils dilated. Speech is slow. The nurse and doctor step out at one point and I press the code blue button in the room because I'm certain I'm dying. My heart is racing, my chest is tight, I'm dizzy. And I see all these people in trances and I know I'm going to code and there will be nobody there to help me. I keep snapping in everybody's faces in hopes they will wake up. I'm screaming and crying. \n\nMy boyfriend shows up around this time. I look at him and even HE goes into this trance. I hit him in the chest trying to wake him up. I keep telling him I love him so much and that I'm sorry. I tell him he doesn't have a pulse and I'm so sorry that I've made everybody sick because nobody can help him. There are several nurses and techs and they're trying to hold me down and I'm fighting them. Hard. They try to get an IV but I'm moving too much. They then roll me to the side to give me an IM injection (Benadryl and Ativan). I'm screaming and fighting them because I don't understand what's going on and I think they're giving me something to kill me (because I'm making everybody go into this trance.) I get away from them and get off the stretcher. There are people in and out of the room constantly. They're trying to talk me down. At one point when there is nobody in the room and I sit against the door and try to barricade people from coming in. I manage to get my cell phone and I call 911. I tell them that everybody at my hospital is in a trance and they're trying to kill me. My boyfriend gets the phone from me and is trying his best to calm me down. I keep trying to drag him out of the room (I was trying to get out of the hospital because I thought 911 would be sending EMS). \n\nI start feeling weak and strange. I think that I'm starting to die from the injection they gave me. They're trying to get me back on the stretcher and into wrist restraints. I'm biting and kicking at this point. They try to put paper scrubs on me (I had taken my scrubs off by this point..dunno why). I think they're trying to put a hood over my head so I won't see when they kill me. They give me another injection (Haldol). I'm still trying to get up. Finally all the drugs start hitting me. I'm certain I'm slowly dying at this point. They tell me I've been PEC'd and start explaining things to my boyfriend. I think it's weird that they would bother with a PEC since they tried to kill me. I start feeling very drowsy and weak. They make my boyfriend leave the room since I'm PEC'd. He tells me he'll be back at 1300 for visiting hours. I told him \"Fine, but I'll be dead by then.\" The nurses slowly filter out as it becomes obvious that I won't need to be held down anymore. The leave a sitter in the room that looks terrified. I drifted in and out, at this point I have accepted the fact that I'm going to die and I'm just glad I'm going to be able to sleep. \n\nI sleep a bit on and off and slowly start coming to my senses. I realize I'm not going to die. I start getting scared that I've been PEC'd. My boyfriend comes back and I get him to tell me his side of things. Later that afternoon EMS come to transport me to a psych facility. By that time I'm pretty much back to my baseline. \n\nThe psych facility terrifies me. I'm on a general adult psychiatric ward. The first person to talk to me was a schizophrenic patient that was telling me that I was his daughter and was yelling at me because I took the elevator when he had told me to take the stairs. What in the fuck? I do not belong here. They start me on new meds for sleep (Seroquel). I sleep like a baby and feel fine other then being anxious about being in a psych ward. I think surely they'll let me go home after reviewing the PEC. I'm not a harm to myself or others, I'm not suicidal, I'm not depressed, I'm no hallucinating. Nope. I was there for 9 day. I don't know whether they held me so long because I was a nurse and they wanted to insure I was safe to go back to work. Or maybe because I had good insurance. I saw patients that were in for suicide attempts and active hallucinations leave before me. All medicaid patients. As a nurse, it was definitely enlightening to see this world from a patient side. I now have a very very negative view of short term inpatient psychiatric care. Now this could have been a bad example of typical units. I could write a book. Hell maybe I should.\n\nAnyway. I'm back to work now. Still on nights because I can't find an L&D day position. Thankfully we self scheduled on my unit so I've been able to make sure I don't work more than 3 shifts in a row. The Seroquel is helping with sleep, but I have already had to go up on the dosage for it to be effective. I'm terrified every time I work that I won't be able to sleep. I'm terrified that this will happened again. I never got an official diagnosis but I assume it was a severe panic attack with psychotic features. A small part of me wonders what if this was just a precursor to some psychological illness. All of the nurses on my unit have been so supportive. I still get weirded out at work sometimes, deja vu and what not. I still hate having patients in the room that that labor patient was in. I still feel weird around the nurses that were there that night. It was a terrible experience, I still remember most of it so vividly. The delusion of everybody being in a trance still seems so so realistic to me. I've talked to so many people about how it looked from an outside perspective. I wish I could understand exactly what happened. It's awful to have your mind betray you.\n\nThank you for anybody that read. It feels good to see all of this down in black and white. And please, take my experience as a warning. You are not invincible. You can not keep running your body into the ground. One day your body and mind will say \"Enough.\"",
    "title": "I had a psychotic breakdown at work",
    "subreddit": "nursing",
    "timestamp": 1506545659,
    "score": 559,
    "keyword": "white manager"
  },
  {
    "text": "Didn't know nurses manage vending machines too... I'm clearly a nurse  in my navy blue scrubs and big RN badge... Just now in the hosptial cafeteria a white coat doctor just stormed over to me and asked if I can get his money back for him from the vending machine....  If this were a patient or visitor,  I would gladly assist then in finding a cafeteria manager.  But  I'm so sick of some docs treating us like assistants and employees instead of team members.  OK... Thanks for letting me rant",
    "title": "Didn't know nurses manage vending machines too...",
    "subreddit": "nursing",
    "timestamp": 1484679388,
    "score": 149,
    "keyword": "white manager"
  },
  {
    "text": "Anyone else have family that just doesn’t get how hard constantly swapping between days and nights is? Sorry for the long-ass rant, but I’m busy not sleeping for nights and I’m tired and frustrated. \n\nLast week, after coming off a couple 12 hour nights, my husband decided to wake me up to ask me a stupid question two hours after I’ve gone to sleep. This is my first “day off” - I got off work that morning at 0730, slept about 4 hours, got up, picked the kids up, did dinner, and then took a melatonin around 2030 to help me get a solid night. Of course, at that point, I’d gotten enough sleep that my body was like “okay, back to work”, and I was awake until 6AM. Of course, having only had about 5 hours of interrupted sleep in the last 36 hours at that point, I had to sleep for most of the next day. I was back on nights the day after that, so there was no point in fighting to stay awake and get back into a daytime schedule at that point. \n\nI was livid with him for waking me. When you only have two days off in a week with five night shifts, those days are important! Instead of being able to see daylight, spend waking hours with my kids, get errands run, and do some meal prep, I got to stay on nights, not see anyone, not get stuff done, and continue living with that low-grade feeling if “ick” that comes with nightshifts for another three days, plus the time it took to get turned around at the end of it. \n\nI managed to successfully get back on a daytime schedule for my days off. Following my third and final nightshift for that set, I stayed awake from the moment I came home, but closed my eyes sitting upright in a chair for about an hour and a half when I couldn’t fight exhaustion any longer. I felt like absolute shit, but I was terrified of missing out on my two days off if I couldn’t sleep that night. I baked, I shopped, I crafted my kid’s Halloween costumes, I meal prepped, I cleaned. \n\nI felt refreshed going into the last two night shifts of my two on/two off/three on/two off/two on run of night shifts. Last night was the first of two. This morning, I came home around 0800, had breakfast, watched half an hour of TV and settled in around 0930 to try and get a solid 8. I rarely am able to sleep much before my first night shift, so I rely on a good sleep between shifts to keep me going. \n\nAt 1515, my dad comes home from picking the kids up early - my son was feeling sick, so the school had called my husband at work, and he asked my dad to pick him up as he was at a truck repair shop picking up a driver and couldn’t get there soon enough. He didn’t give my dad any instructions on what to do with our son, despite the fact that my parents were watching my sister’s kids too and my son would have to be in our home so as not to infect his cousins. My dad comes and knocks at the bedroom door and I get to wake up, run next door to my sister’s place to grab zofran (she’s also a nurse, working days), put blankets and towels on the couch, get the barf bucket, put the iPad in a ziplock bag with an alarm and a timer, and instruct my son to start raking small sips every five minutes using the timer once the alarm goes off, and go back to bed. \n\nI am almost asleep when my husband gets home. He comes in the house, checks on our son, walks to the front door, hollers across the yard got our other son to come home, goes over to our old truck with a noisy 454 big block engine, turns it on and revs it for a bit, and then starts doing mechanical work on it. I can sleep through noise once I’m asleep, but this sudden onset of perfectly spaced out noise was enough to rob me of a chance at getting another hour and a half. Now I’m going back on nights with only 5 hours of sleep in the last 36. \n\nHis response when I tearfully lost it on him? “I didn’t think noise bugged you when you were sleeping.” Except I wasn’t sleeping. I was trying to get to sleep after waking up and having to run around for an hour and then going back to bed, so I’m already slightly charged up. He knows that I’m sensitive to noise when trying to get to sleep and that ear plugs and and white noise don’t do much for me. “I thought your dad would just know not to wake you up.” Ummm, with no instructions on how to medicate and manage our vomiting child? \n\nI’m so tired, but it’s 1820 and I’m on at 1930 and there’s already been one sick call for nights. Tell me your stories. Give me your tips. Tell me I’m only a tiny bit petty for setting alarms to go off every two hours tonight while I’m at work so he can gain some perspective. \n\nEdit: It’s 0654 and I made it! What’s more, I got in a solid 20 minute nap. Thanks to all of you for sharing your stories and commiserating - it made the night all that much better.",
    "title": "Anyone else have family that just doesn’t get how hard constantly swapping between days and nights is?",
    "subreddit": "nursing",
    "timestamp": 1509067328,
    "score": 35,
    "keyword": "white manager"
  },
  {
    "text": "Looking for honest opinions. Male nurse here. I have been a nurse for about 6 years but at every hospital, I have ended up having issues with the same type of nurse. Usually a very masculine acting, type A personality female nurse. I want to remedy this because it's effecting my career. I think it has to do with the way I look and my personality. I a 6'4, 245 pounds and would be a type A personality, have always been self conscious because of my size but whatever I am doing still isn't working I always get complaints from usually that same nurse over and over again until a bullseye is put on my back, then I will eventually get into trouble. The complaints are never about my ability, it's usually that I don't show enough urgency during emergencies. Which I don't, because having prior EMS experience, I don't want to act too high strung so as to not make the patient even more scared. I have never had a patient complaint. It has to been something that I'm doing  but I have no idea what it is. Another thing that happens, is if I am doing something wrong, no one ever brings it up to my face, but goes to management. When it would be something I would have corrected before it got to that point. I like nursing, but this has happened more than a few times so I want to correct it. My first thought, and the other nurses that I get along with say it's discrimination, but as everyone knows, as a white male, you can't bring that up. Does anyone have any experience with this or any advice. I really want to correct whatever I am doing. Sometimes I think if I was a feminine acting male nurse that was 5'7, instead of my size. The thing that throws me off is patients love me, they really do. I get compliments and letters all the time. I am just really depressed about this and don't want to leave nursing. Thanks in advance guys (and gals).",
    "title": "Looking for honest opinions. Male nurse here.",
    "subreddit": "nursing",
    "timestamp": 1505650561,
    "score": 14,
    "keyword": "white manager"
  },
  {
    "text": "Making work friends? Something that has really been bothering me lately is that I don't feel like I am friends with anyone from work. There is 1 person that I hang out with *occasionally* (as in like once every few months) and that is it. I try to be social, invite people out places, try to include myself in plans, attend work-organized social events, etc. But I never get the effort returned. I am never included on people's plans, I am never invited out.. Nothing. Even when they are sitting and making the plans right in front of me. \n\nMaybe it's because I'm still kind of new (1 year)...but there are people who have been there less time than I that get invited out. Maybe it's because I'm a guy in a female dominated profession. Maybe it's because I work swing shift. Maybe it's because I'm white and working in a predominantly black hospital. Maybe everyone just fucking hates me. I honestly don't know. Most people seem to enjoy working with me and seem to like me at work.\n\nThis is something I've dealt with my whole life. I've never felt included on plans (barring a small group of really close friends) and always feel like an outsider. I'm so fucking miserable and lonely. It's making it really hard to go to work because people sit around and talk about the last time they all went out. They all post pictures of shit I wasn't invited to on Facebook. They make plans right in front of my face and don't even bother to ask if I want to come out with them. \n\nI think I am going to ask my manager to switch me to night shift (although I am TERRIFIED of working nights) because they seem like the stronger team and they all seem closer outside of work compared to days and especially swing shift. Any other suggestions?\n\nP.S. sorry about the rant.",
    "title": "Making work friends?",
    "subreddit": "nursing",
    "timestamp": 1495002147,
    "score": 12,
    "keyword": "white manager"
  },
  {
    "text": "Medication error(s) & termination Hi, I'm a pediatric nurse practitioner that recently started a new job at a school-based health center and I'm about 5 months into the job. The clinic that I \"took over\" from previous NPs was always missing basic things like gloves, white copy paper, and cabinets were filled to the brim with expired point-of-care tests (ie: rapid strep kits, ua/culture tubes), needles, medications, etc. I have been trying very hard to get this clinic back up to par, and made a full Excel sheet of inventory and expiration dates for all meds and lab supplies. \n\nThe other day I found that our \"private stock\" (non VFC or federally funded vaccines) had plenty of expired vaccines, so I pulled them out of the fridge and freezer(s) to be thrown away. The vaccine had been expired since 5/2016 and I started my position in 12/2016 (why the vaccine was still even there was beyond me). However, my medical assistant had inadvertently placed the expired MMR back into the freezer AND onto the VFC shelf. \n\nI didn't know this until I had jumped in to help with giving vaccines on a busy, under-staffed afternoon (it was just me and 1 MA that day) and gave the expired MMR vaccine to a patient because STUPID me didn't double check on the vials before drawing them up. Usually I re-verify all vaccines and write down lot #'s and exp dates, but since I had just done all the inventory just 4 hours earlier and knew there shouldn't be any more expired vaccines in the freezer, I didn't recheck. Which is still my own fault. \n\nNot only this mistake though, an incident report regarding vaccine errors has been filed 4 times in the past 5 months for my clinic. First I had ordered an extra flu shot on an 18-year old because I missed that he had already gotten the flu shot this season (I missed a page of his vaccine records). The second time, one of my medical assistants had given an incorrect vaccine because they went off a verbal order of mine but had grabbed a wrong vaccine and gave it WITHOUT looking at the order in the computer OR verifying the vaccine with me. The third time one of my newer medical assistants discovered she stuck herself with a needle after giving vaccines and had to go through the entire needlestick injury report/protocol. \n\nBut as the NP at the clinic, I feel responsible for all of the issues that has happened-- and I'm afraid that in the end, that is what my clinic manager and administrators will see too and fire me for all the cumulative errors. My clinic manager was supposed to have come in to do an in-service with our clinic after the 2nd vaccine error but it never happened because she \"got too busy\". In your experience, do you think I can be terminated (\"3 strikes you're out\")?",
    "title": "Medication error(s) & termination",
    "subreddit": "nursing",
    "timestamp": 1494782653,
    "score": 3,
    "keyword": "white manager"
  },
  {
    "text": "Moving from an RN in Aged Care to an RN in a Hospital. What do I need to brush up on? Hi, thank you to anyone who helps with this, you guys collectively have a lot of knowledge and are down to earth so I figured I'd put my question here.\n\nI started my new grad in aged care. I now want to work in a hospital for some experience. I originally wanted to work in a hospital but I didn't do so great in my new grad interviews (I was really insecure and I worked myself up so much about potentially not getting the job that I interviewed horribly). I feel way more confident now so I'm going to start applying for hospital jobs at the end of my aged care new grad program and see if I can land one.\n\nI don't mind aged care too much, I'm in Australia where it's 1:150 people with lots of assistant nurses and certificate IV nurses and enrolled nurses to help. It gets crazy stressful sometimes where I feel like my hair will turn white but most of the time it's not so bad. \n\nSo what I want to know is, what do I need to brush up on for hospitals? I don't remember anything to do with IVs but I'm sure I can learn, it wasn't that hard from what I remember.... and I think I'm gonna go to a course on IV cannulation, what do you guys think?\n\nAny feedback would help. I just don't know what I should be focusing on for hospitals as I have no hospital experience, except nursing school and I think aged care and hospitals are two different beasts!\n\nI have the following as stuff I've learned in aged care, I'm just gonna word vomit everything I can think of at the moment:\n\nClinical:\n- Catheters... so many catheters. Including trial to void, in and out etc...\n- PEG feeds.\n- Medication management.\n- Dementia specific nursing.\n- Palliative care.\n- Writing and implementing care plans.\n- Antibiotic stewardship.\n- Infections (MRSA/VRE/the usual)\n- Cytotoxic medication management.\n- s/c infusion pumps for palliation.\n- Skin integrity management.\n- Continence management.\n- Swallowing assessments (so many swallowing assessments).\n- Falls risk assessments.\n- Head to toe assessments including palpation because we don't have god-damn bladder scanners!\n- Wound management both complex (with vac dressing), chronic and acute.\n- Suicide prevention plans. Cornell scales for depression.\n\nInterpersonal/professional:\n- Conducting care conferences (?) with families eg about advanced care records or a complaint or something like that.\n- Conflict management.\n- Questioning a MO's order (this was scary!).\n- Developing and running education for other RNs and Assistant Nurses on delirium + catheters if that matters.\n- Direction and delegation of Assistant Nurses and Enrolled Nurses (diploma nurses) and Certificate IV Nurses.\n- Advocating for the residents (poor staffing levels = neglect and one other Certificate IV nurse and I managed to change this by putting in a formal complaint which = more staff. Some residents were being left soaked in urine!!)\n- Behaviour management +++.\n\nBonus:\n- Policy changes: s8 patches (morphine/fentanyl) were being cut in half by some nurses to achieve a dosage charted from the Dr. I worked with a few other RNs to change the policy so the doctors can't chart half patches... :|\n- The implementation of a communication board for people with aphasia/language barriers/dementia. We didn't have one lol so I just made one. Management loved it and it was a \"continuous improvement\" exercise...\n\nEducation:\n- Completing my honors in nursing at the moment. Focusing on leadership and clinical reasoning... (my honours degree is really airy-fairy actually...)\n\n**tl;dr: What differences are there between hospitals and aged care? What do I need to study before applying for work in a hospital?**",
    "title": "Moving from an RN in Aged Care to an RN in a Hospital. What do I need to brush up on?",
    "subreddit": "nursing",
    "timestamp": 1510983253,
    "score": 4,
    "keyword": "white manager"
  },
  {
    "text": "A list of helpful Certificates & free training material for Upcoming and Experienced Engineers Good evening everyone. I'm new to Reddit, but I noticed there was a lot of posts under /r/engineering looking to find certifications to help people startup in the Engineering field. \n \nI recently was awarded the \"Forbes 30 under 30 in Manufacturing and Industry\", I just turned 22 and have been programming machines/robots since around 14 years old. Thanks to certifications, I was able to join Boeing as what my Manager called their youngest robotics programmer at 19 years old (at least for their R&D Division.) My job title is now “Robotics Programmer” my primary focus is composite carbon fiber: utilizing machines called “Automated Fiber Placement”. All thanks to certifications!\n \nI have a massive stockpile of links, and I thought that they would come in handy to others. It goes from Tool Engineer, Robotics, AI, Deep learning, Stress / Design Engineering softwares, PE, LEAN Six Sigma all the way to Programming in Python, CNC and more. \n\nSome may be faulty over time, feel welcome to update in the comments and I can update the thread \n \nIf this is helpful to people, I will spend some more time and put updated prices on each item + format it by grouping related items.\n \n[Udacity Robotics NanoDegree] (https://www.udacity.com/robotics)\n \n[edX All Engineering Courses] (https://www.edx.org/course/subject/engineering)\n \n[edX Robotics Certification - MicroMasters] (https://www.edx.org/micromasters/pennx-robotics)\n \n[Introduction to Aeronautical Engineering] (https://www.edx.org/course/introduction-aeronautical-engineering-delftx-ae1110x-2)\n \n[Introduction to CNC / Computer Numerical Control (automated machinery)] (https://www.edx.org/course/introduction-computer-numerical-control-tenarisuniversity-cnc101x)\n \n[PennX Robotics Dynamics & Control] (https://www.edx.org/course/robotics-vision-intelligence-machine-pennx-robo2x)\n \n[PennX Robotics Vision Intelligence & Machine Learning] (https://www.edx.org/course/robotics-vision-intelligence-machine-pennx-robo2x)\n \n[An introduction to Engineering Simulation Softwares] (https://www.edx.org/course/hands-introduction-engineering-cornellx-engr2000x-0)\n \n[Artificial Intelligence (Programmers / AI Engineers Basic)]\n(https://www.udacity.com/degrees/nd101/summary)\n \n[Artificial Intelligence (Programmers / AI Engineers Advanced)]\n(https://www.udacity.com/degrees/nd889/summary)\n\n[Six Sigma LEAN certification] (http://www.6sigmacertificationonline.com/lean-six-sigma-green-belt-certification/?gclid=Cj0KEQjwyZjKBRDu--WG9ayT_ZEBEiQApZBFuFumYiEULtakrsJKtzKxdkMKg4Y2AswQHcty4s3QbC8aAh8C8P8HAQ)\n\n[Six Sigma LEAN source] (http://www.iassc.org/)\n\n[Udemy Engineering Courses starting at $10 - Look for verified Certifications] (https://www.udemy.com/courses/search/?q=engineering&src=ukw)\n \n[Short Courses: Aerospace Engineering] (http://www.shortcoursesportal.com/disciplines/37/aerospace-engineering.html)\n \n[Principles and Practice of Engineering (PE)] (https://www.nspe.org/resources/licensure/what-pe)\n \n[Requirements to become a PE verified Engineer] (https://www.nspe.org/resources/licensure/how-get-licensed)\n \n*Geometric Dimensioning and Tolerancing*\n[Great white paper for studying] (http://www.pages.drexel.edu/~rcc34/Files/Teaching/MEM201%20L6-Tolerance_RC.pdf)\n \n[Great PDF for GD&T] (http://engineering.pages.tcnj.edu/files/2012/02/dimensioning_and_tolerancing.pdf)\n \n[Famous pocket guide for tool engineers: GD&T] (http://www.pdfdrive.net/pocket-guide-for-gd-t-e7715066.html)\n \n \n \n*PROGRAMMING* \n \n[Google free Deep Learning course] (https://research.googleblog.com/2016/01/teach-yourself-deep-learning-with.html)\n \n[42: Tuition free programming University in Silicon Valley] (https://www.42.us.org/)\n \n[CATIA V5 Training (World's largest CAD / Computer Aided Design / Simulation Software)] [http://v5train.com/]\n \n[NX Unigraphics CAD / Computer Aided Design / Simulation Software] (http://training.plm.automation.siemens.com/index.cfm)\n \n*General Free Training Material - Programming, Manufacturing, Engineering, etc*\n \n[CNC Training] (http://www.cnccookbook.com/CCNewsletterWelcome.html?utm_source=cnccookbook&utm_medium=sumome&utm_campaign=bettercncer1)\n \n[NX Unigraphics Training: MyIGetIt] (https://www.myigetit.com/Library/Topics/2?name=NX&gclid=Cj0KEQjwyZjKBRDu--WG9ayT_ZEBEiQApZBFuJM450aC_Cg3cwsS-EOLzWZEBJOfSCgM0i-d8HfOKgAaAgBR8P8HAQ)\n \n[Free Machine Learning & Data Science Course] (http://www.openculture.com/2017/05/a-free-course-on-machine-learning-data-science-from-caltech.html)\n \n[MyIGetIt: Geometric Dimensioning & Tolerancing + Finite Element Analysis + CATIA + NX Training] (https://www.myigetit.com/library)\n \n[Free Machine Learning course] (https://www.udacity.com/course/intro-to-machine-learning--ud120)\n \n \n \n[Full PHP code ignite course:]\n(https://www.udemy.com/codeignitercourse/)\nCode: CODEIGNITERFREE\n \n[Complete PHP course with Bootstrap3 CMS system & Admin Panel ]\n(https://www.udemy.com/complete-php-course/)\nCode: PHP4FREE\n \n[Complete HTML + CSS course from Beginner to Advanced ]\n(https://www.udemy.com/htmlwebsite)\nCode: FREE4ALL\n \n[Full PHP course for beginners ]\n(https://www.udemy.com/php-course-for-beginners)\nCode: BBW4FREE\n \n[Full JavaScript for Beginners ]\n(https://www.udemy.com/learn-javascript-course)\nCode: FREEJAVASCRIPT\n \n[introduction to Python for ETHICAL hacking]\n(https://www.udemy.com/python-for-ethical-hacking/)\nCode: FREEBIES\n \n[A complete guide to intermediate C++ Programming Language ]\n(https://www.udemy.com/inter-c-plus-plus/)\nCode: couponliar\n \n[ BASH programming course: master the Linux command line ]\n(https://www.udemy.com/bash-programming/)\nCode: BYLDGQ7F\n \n[Angular 2+ with TypeScript Essentials]\n(https://www.udemy.com/angular-2-training)\nCode: ACC2017\n \n[Android Dev working with Databases using MySQL & PHP]\n(https://www.udemy.com/android-development-course)\nCode: PHPSQLFREE\n \n[Agile Project Management SCRUM step by step ]\n(https://www.udemy.com/scrum-master-training/)\nCode: scrmexamplesfbfree\n \n[AI that determines careers that are a good fit for your skill set!] (https://leap.ai/welcome)\n \n \n \nFeel free to post your certifications below to help others too! Thank you all for posting great content in this sub that I can absorb!",
    "title": "A list of helpful Certificates & free training material for Upcoming and Experienced Engineers",
    "subreddit": "engineering",
    "timestamp": 1497839077,
    "score": 805,
    "keyword": "white manager"
  },
  {
    "text": "How does your company manage R&D/Prototype Projects? Hello fellow reddit engineers. I am a mechanical engineer with a couple years experience in industry working in design with two separate companies. I've done 3-4 large prototype projects with varying degrees of complexity and varying degrees of disorganization. I've found what works for me to manage projects and keep a team moving forward but I'm really curious how the rest of you keep your projects, large or small, organized and documented. Specifically I wondered;\n\n - Assuming you have a concept that you are relatively sure will work, do you run a prototype through your ERP/MRP system? Do you have a separate database for engineering projects or do you create part numbers, BOM, etc in the production instance?\n\n - If you work outside of the ERP/MRP system how do you maintain tracking, costing, BOM, and inventory? \n\n - When in the project do you attempt to capture your cost rollup? When does this consideration come into play for your design process?\n\nI know that there is no real black and white answer as it varies so much with the scope of the project. I'm just curious to everyone else's experience. Thanks so much for your ideas!\n\nTLDR; How do you manage your prototype projects so there isn't complete chaos but you still aren't bogged down in paperwork?",
    "title": "How does your company manage R&D/Prototype Projects?",
    "subreddit": "engineering",
    "timestamp": 1490790708,
    "score": 4,
    "keyword": "white manager"
  },
  {
    "text": "Even if I hadn't put in my notice, I would've left this week anyway. Holy shit, guys. My school is so bad. I'm at a Title 1 middle school. \n\nI've lost count of the number of times I've been assaulted this year. I've had students put hand sanitizer in my drinks, stab me with pencils, shoulder-check me, actually shove me, throw desks and chairs at me, throw backpacks at me, throw books at me, swing a piece of wood from a bookshelf at my head, threaten to hit me and bite me. \n\nI have students telling me to kill myself daily. I have students yelling that I'm a bitch in the middle of class, white bitch, witch, telling me to suck their dicks, that I must like getting cum in my eye, that I'm going to die alone and lonely, that I'm pathetic and everyone hates me. It's now escalated to students making explicit sexual comments and gestures at me on the regular. Students have threatened to tell their parents that I beat them and call the the n word in class, or that I've touched them inappropriately. \n\nMy admin's response has only ever been, \"Make sure you document everything.\"\n\nThere's been a couple weeks in October where I was breaking up multiple fights a day. In my classes, this has largely calmed down, but sometimes I'll cover for other classes and I have to grab a chair from a student before they throw it at another student. \n\nAdmin is criticizing me for not being able to control my classes. I can call security and they show up maybe half the time. If a student is removed from my class, they're back within 10 minutes and raising hell again. \n\nI've had outside observers come in from the city, who have *seen* me doing my best and doing everything by-the-book (in terms of instruction) and they've seen how the kids treat me and each other. That kind of validation is nice; that it's not my fault. Could I be a better teacher? Yeah. But there are teachers in this school who have been here 5, 10, 20 years and still having the same problems. \n\nAbout half of our kids are confirmed to be homeless, living in shelters or transient housing. Even with that, I was pleasantly surprised by how many parents showed up to conferences last week. Only two parents were the \"why are you so mean to my child, it's your fault that she's failing, you're a horrible teacher\" yada yada yada, but other teachers backed me up and confirmed that their kid is a jerk in their classes too.\n\nThe school has a roach problem, and I suspect a mice problem as well. There's lead in our pipes and water. There's mold in our bathrooms--the stench hits you like a wall when you walk in. \n\nI've lost weight. I'm losing my hair. I'm not sleeping and I'm rarely eating. I've called two suicide hotlines recently. \n\nI put in my two week's notice last week. \n\nI finally managed to see my former therapist (I \"graduated\" from therapy a few years ago). It took a while because she had the flu, no fault of her own. 20 minutes into our session, she said she's putting me on emergency medical leave and taking me out *immediately.* I only wish this happened sooner.\n\nThis job isn't worth it. \n\nThis isn't worth the paltry salary. \n\nThis isn't worth the disrespect. \n\nThis isn't worth the violence. \n\nThis isn't worth a 2 hour one-way commute. \n\nThis isn't worth the countless sleepless nights to get everything done. \n\nThis isn't worth my life. \n\nI worked so hard for this. I did great in uni and I came into this with passion and enthusiasm, and it's been literally beaten out of me. I was top of my classes, honors and excellent rec's from my mentor teacher and professors, and this was the only school that would hire me. I'm reluctant to continue teaching. Even if another school won't be this bad, I still don't think it's worth it. \n\nI don't know what my next steps will be. I've been applying to jobs in the private sector because I know I have awesome marketable skills, and I'd make a good employee. I'm hoping something will work out. In the meantime, I'm going to rest.",
    "title": "Even if I hadn't put in my notice, I would've left this week anyway.",
    "subreddit": "Teachers",
    "timestamp": 1512352075,
    "score": 212,
    "keyword": "white manager"
  },
  {
    "text": "[PA] [11/12] - Having a terrible student teaching experience. Advice please **TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**\n\nI am at a AA-sized school in western PA outside of the city. When I was first assigned to this school I was excited as the mentor teacher had received some awards and plaudits both statewide and even a national one. I thought \"what better person to learn from that this person\".\n\nWhen we first started it was going great. She was excellent at teaching me the ins and outs of contracts, etc (which I realize now was totally off-topic and shouldn't have even come up), the mechanics of school politics (again, some bells going off) and so forth.\n\nDuring the first week, I could see how she was a really good teacher. The kids respect her and she has great classroom management. On Tuesday of the first week, she said she would want me to start teaching the following week. So she would take the first Econ class of the day and I would teach the two in the afternoon. She wanted me to start drafting lesson plans for these days and then we'd go over them on Friday.\n\nThe first week of doing Econ in the afternoon went well, so she had me take over that class full time in Week 3, while I took over the second of her two Psych/Soc classes in the same format. In Week 4, it was all me for everything.\n\nWhile I was excited to jump into teaching full time, I should have had a few alarm bells going off:\n\n* why wasn't she modeling her preferred style of lesson planning to me?\n* why was she moving faster than my university's suggested timetable for giving me more responsibility?\n* how was I going to be expected to extrapolate from her incredibly abridged lesson plans?\n\nI took comfort in the fact that, at the beginning, she would sit down with me and go over what she would expect to me to cover the next week and so forth M-F. And it became our ritual, in a sense, for us to sort of broadly go over the next week on Friday and then for me to turn in an overview of the week by Sunday, which she would comment on if there were any concerns.\n\nFast forward to last weekend. She is busy on Friday with students asking about extracurricular stuff and my attempts to connect on the following week's material are rebuffed. So I do my best on Friday evening and Saturday to map out the week, extrapolating from a very thinly detailed syllabus to try to use as a pacing guide. I text her on Saturday evening asking if we could go over the plans for the week, and she responds \"I'm busy right now, I'll call you tomorrow at 5\". (bear in mind, she told me from day one that if I EVER need help to call and she'll \"talk me down from the ledge\" and work with me\".\n\nThe next day, I reach out by email ahead of time, sort of detailing all of my concerns about the upcoming week, my confusion over the pacing and wording in the syllabus and uncertainty as to her suggestions from the past. \n\nThen 5 comes and I get no response, then 7, then 9 - and by this point I'm freaking-the-fuck out. So I send another follow up text stating that I had sent an email with some questions and I was hoping to discuss the following day, at least, as well as the week moving forward.\n\nI get a text at 11:30 pm asking \"have you figured it out yet\". To which I of course responded no and that I thought i at least had a plan for the next day but that I really needed some clarification on the rest of the week. She responded \"**i can keep holding your hand forever, but you'll never learn anything that way. I need those lesson plans before 7 tomorrow. See you then**\n\nSo when she came in the door in the morning, I was hastily wrapping up the weekly overview lesson plan to be turned into the office - basically just going off of whatever she did last year.\n\nThen all week long, there was this tension in the classroom. I could feel it growing. I was frustrated with her for essentially abandoning me with little preparation (a strategy which many of my teacher friends derided as unprofessional and extremely unhelpful). She seemed annoyed with me for seemingly needing any help at this point.\n\nOn Wednesday, I get an email from the director of field placements at my university wanting to have a phone meeting the next day. On that phone meeting is literally everyone in the chain from the top of the school of education down to me. \n\nMy site director first allows me space to give my side, and then proceeds to list a rapsheet of complaints and errors on my part that have been privately communicated to her over the past week or two about my untimeliness in turning stuff in and unpreparedness for the day each day and needing to have my hand held for every little thing...yadda yadda.\n\nI was so taken aback and felt so cornered, but i swallowed my tears and the lump in my throat and did my best to give a fair account of everything from my end, to include - which I've yet to mention - that the previous week she broke her tooth in half and had 2 miss days of school in pain after getting it pulled and i was left with subs, etc. Then the following days she was in pain because she couldn't take her percocet before coming to school and so was always in a foul mood, but I did my best to steer clear, etc.\n\nThe school seemed understanding of my side, and said they aimed to support me in whatever way possible to help get me across the finish line.\n\nThen yesterday was teacher in-service. Teachers are supposed to be given an itinerary at least a week ahead of time. Our teachers were given them on Wednesday. My MT forwarded the email to me, but i notified her that as it was a Google doc, and she was not the creator, it wasn't able to be opened unless shared by the creator. She said she'd follow up, but never did.\n\nSo I arrive at 8 the on Friday morning, and go to meet her in the classroom, which is where we met previously. She's not there; door locked. I go to the auditorium, which is where in-service began last time, and no one is there. Finally I hear an announcement and see teachers walking toward the collaboration center, so I join them and we all walk in the door at 8. I get a text from her at 8:02 saying \"in-service started 2 minutes ago and you aren't here\". So i responded \"im here, in the back of the room\". She turns around and makes eye contact.\n\nLater in the day I get a call from my site director asking how the day is going, if I'm feeling any better after the ambush on the phone the day before, etc. Then she asks, what time did the in-service start this morning? I said, \"8\". \"And when did you arrive?\" \"just before 8\". \"Well, your mentor teacher sent me an email notifying me that you didn't arrive until 9\".\n\nI was PISSED. I forwarder her the texts proving that I was there at 8 and that I had notified my mentor teacher of my presence in the back of the room.\n\nI got ANOTHER call from the university and after some back and forth, they sort of seemed to agree with my suggestion that I felt that I was being sabotaged at this point for whatever reason. They said to not go into school on Monday, don't contact my mentor teacher, don't contact the school - they'll take care of it. What they want is to have a meeting where all the expectations of all parties are laid out in black and white, on paper, so there's no confusion, and then we'll figure out a path forward from there.\n\nI'm so frustrated and confused and exhausted and exasperated over the whole thing. I don't even know what to do going forward. I was told to not make any more lesson plans at this point and to just take the weekend to spend time with my kids and wife and think about some solutions to help get me across the finish line on December 8.\n\nI'm so furious I don't even know what to do. I'm also worried that my MT, if I remain in her classroom, is going to sabotage me by switching subjects this week to throw off any lesson planning I've already done (both classes are combined Psych/Soc and Gov/Econ) and we go back and forth. Everything I've planned for the rest of my time there is in Sociology and Gov, so I half expect to walk in the door tuesday and she'll have been teaching Psych and Econ and tell me to hurry up and make some lesson plans for the rest of the week.\n\nAnyway. Suggestions?\n\n**TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**",
    "title": "[PA] [11/12] - Having a terrible student teaching experience. Advice please",
    "subreddit": "Teachers",
    "timestamp": 1507998970,
    "score": 41,
    "keyword": "white manager"
  },
  {
    "text": "Did my school handle this wrong? Long post here. Yesterday as we were switching classes, there was an incident (which we all saw) in the hall involving another teacher. \n\nStudent A, let's call him Joe, calls student B who we'll call Chris, a stupid faggot. Chris walks up to Joe and says \"say that to my face one more time.\" So Joe looks him dead in the eye and says \"you're a stupid faggot.\" Chris jumps on Joe and the two start fighting. Their teacher runs over to Chris who she was closest to, and pulls him off, and he puts his hands up and walks away and says \"okay okay Mrs. T, I'm done fighting.\"\n\nSo now the teacher is standing in between both boys. Joe then jumps on her back and starts hitting her severely in the chest and neck. She manages to get him off and immediately sends both boys to the office, but she ended up with two pretty nasty bruises just below her neck.\n\nLater all 4 teachers get called to the office to give an account of what happened; we all saw it so the stories are the same. Principal takes a picture of the bruises for evidence and says the parents are on their way and she will let us know what happens. We're all thinking Joe will get kicked out for assaulting a teacher.\n\nLater we hear Chris is suspended for 5 days. Now we're just waiting to hear about Joe, and again we're thinking there's no way he'll be allowed to stay after attaching a teacher. Then we hear that Joe...is also suspended, but only for 3 days. The principal says it's because he has a behavior contract and he gets \"special exceptions.\" \n\nI know what a behavior contract is and how it works here. If the student breaks the contract, they're out. We had one kid break his contract when he got angry and called his teacher a \"white bastard\" and he was expelled about 10 minutes later. Another student was accepted at the beginning of the year, with such a bad history of schooling, and it was agreed between the parents and school that if he breaks even one school rule he's out. First day of school he walks in chewing gum and completely out of uniform, and was expelled that day.\n\nSo we have two students who were expelled for lesser incidents, and yet Joe only gets a 3 day suspension, less of a punishment than the other kid, for beating a teacher. All of us are just shocked, and upset that this student wasn't punished more severely. It's like the admin doesn't care about this teacher's safety. And this isn't even his first incident; he's been in so many fights with other students this year, fights that he started, that other kids are now afraid of him.\n\nTL,DR: student beat up a teacher and was allowed to stay with only a 3 day suspension, and got less of a punishment than the other student involved who stopped fighting, getting a 5 day suspension. All teachers are pissed.",
    "title": "Did my school handle this wrong?",
    "subreddit": "Teachers",
    "timestamp": 1483659278,
    "score": 19,
    "keyword": "white manager"
  },
  {
    "text": "[Southern USA] [Kindergarten] - Please help with class management! Throwaway account, because I'm paranoid of someone in my school finding me. Also posted in /r/ECEProfessionals \n\nI am a second-year teacher at a rural, 90% African American school in the southern United States. I'm having issues with classroom management. Last year, my assistant was very strong- she basically ran my whole classroom. Whenever the kids were being too loud, she'd sternly redirect them to pay attention. Sometimes she even yelled, but it worked. I am not a confrontational person and her methods worked, so I ran with it. She was African American, and told me that her ways were effective because the kids saw her as a mom/grandma figure and respected her. I believe this to be true. However, she has retired and I have a new assistant- an older white lady who is not as strong of a personality.\n\nIn this community, the norm is for children to be scolded/punished for doing wrong things. The ways that some of the other teachers talk to their students align to this method of child-rearing, because culturally they are similar to their students (again, the kids see the teacher as a mom/grandma). I should mention here that I am white. I have been told by the other kinder teacher (and several other friends within the school) that if I spoke to the kids the way the other teachers might, I would be in trouble because \"Black people don't want to see their kids yelled at by a white teacher\". That is a direct quote, please don't call me a racist or tell me that race doesn't matter.\n\nThe issue is that I cannot get the kids to stay quiet or pay attention, even if I raise my voice (which I hate to do). I also feel like they are goofing off when we are supposed to be working. My kids are turning in absolute crap- I know they are capable of better work. When I try to get them to be quiet, they still talk or play at their tables and do half-assed work. I would love to be able to allow them to whisper at their tables about what we are doing (and generally work together in teams), but it seems like the majority of them are always off-task. I try to plan active activities/group work/movement into our day. I also allow them to talk during breakfast and snack.\n\nWe have a school-wide management system using a 'green, yellow, red' behavior chart. If a kid misbehaves, I'll warn them. If they repeat, I'll change their color. I've thought about starting some kind of token-based economy, but at this point I'm not sure they'd be quiet or attentive long enough for me to tell them about it.\nI've tried all the positive behavior things we learn in college, like highlighting kids that are doing what is expected, etc. We made our class rules together. All the positive/reinforcing/'let's talk about your choices' stuff doesn't work. Changing their colors doesn't work. Having them practice walking in the hallway quietly (because we can't seem to do that correctly, either) doesn't work. None of it seems to work. I'm frustrated and upset and not sure what else to do. Any advice would be greatly appreciated.",
    "title": "[Southern USA] [Kindergarten] - Please help with class management!",
    "subreddit": "Teachers",
    "timestamp": 1504303176,
    "score": 11,
    "keyword": "white manager"
  },
  {
    "text": "Is the writing on the wall that I should look for a new job? Created a throwaway for this. The facts: I'm a senior marketing manager working in my dream job at my dream television network in NYC. (I realize how rare this is, and I am grateful every day.) I'm well-respected in my department, my reviews are really solid, and I'm given many opportunities to travel, work on high-priority accounts, do public speaking, etc.\n\nMy company has been very open and vocal over the last several months about a conscious initiative to hire more diverse candidates, both in our work force and in our talent on-air, which I happen to completely agree with. As a major media company, I think it's important that we represent all voices, and that people of all backgrounds can relate to what they see when they turn on our network.\n\nThe way my department is structured, there is no way for me to move up to the director level without one of the existing directors leaving - but there are about eight, so turnover does happen. About six months ago, there was an opening, which I applied for. I was told by the hiring VP that I was absolutely qualified and that I'd be an asset to the team, but they ended up hiring someone from outside the company, who happens to be of a minority ethnicity. (She's great, so I can't argue with the hire.)\n\nThat said, I now find myself in a pickle. They've basically said outright that any new hires will be diversity candidates, and I am a white woman. (Our offices are pretty 50/50 men and women, so being female doesn't count as diversity here.) I hate even considering that I might need to leave my dream job, but I also think the writing is on the wall that I most likely won't be able to move up because of this new initiative.\n\nWhat would you do if you were me?? Is it time to start looking elsewhere? I'm getting choked up just thinking about it, but I know I need to do what's best for my career. Thanks for any advice.",
    "title": "Is the writing on the wall that I should look for a new job?",
    "subreddit": "careerguidance",
    "timestamp": 1510086302,
    "score": 9,
    "keyword": "white manager"
  },
  {
    "text": "How can I get back on track after gendered career derailment? I'm a 28-year-old woman who has experienced gender-biased career derailment and am still recovering from it. In 2013-2014, I was employed as a Marketing Coordinator for a small executive training firm. The CEO postured himself as a champion of equality, but he was an elderly white man who had somewhat rigid views of women in the workplace. \n\nEven though admin tasks were not in my job description, there was immediately a lot of mission creep with me being expected to take an inordinate amount of extra work such as answering phones, running personal errands, and planning the company parties for no additional pay. My employer expected me to be an Office Manager and a Marketing Person and essentially work two jobs for the price of one (underpaid) employee. When I tried to advocate for fair treatment and compensation and presented evidence that they were incorrect in their management of me; the CEO became retaliatory and had me terminated for \"poor performance\" despite never having received a poor performance review and having performed the job for which I was hired competently and in good faith. \n\nMy direct manager tried to defend me and managed to have me retained as a work-from-home freelance contractor, but I took a significant pay cut and lost all of my benefits. Unsurprisingly, she was later also pushed out of the organization when she became pregnant but now works for another company and is one of my best clients. \n\nNow, I have a freelance practice and am much happier in my personal life. The money is okay, and I set my hours, but it can be unstable at times, and the lack of benefits and savings causes me a lot of stress-- not to mention the annual tax liability and overhead costs of running a small business. I wish I could find an in-house job where I am treated fairly based on the merits of my talents and work ethic, not my gender.",
    "title": "How can I get back on track after gendered career derailment?",
    "subreddit": "careerguidance",
    "timestamp": 1506715003,
    "score": 7,
    "keyword": "white manager"
  },
  {
    "text": "I have a CS degree with 5 years of experience in sales/advertising/marketing; should I get an MBA? Try to keep this to a minimum here...  \n\nFirst some more specifics:  \n- C.S. degree attained in 2012 (Cum Laude)  \n- Hate programming, found out too late in major, but like IT  \n- Good, solid leader with a proven track record in extracirriculars and job  \n- Currently under-utilized in my job  \n- Making ~$65k as a 1099-Misc pre-tax, ~$55k net; somewhat commission based  \n- Own house (mortgage)  \n- Can afford MBA without a significant blow to cash flow (will have over $20k in bank by start of Spring semester to pay for schooling)  \n- No retirement and no option for 401k match; IRA or self 401k are my only options  \n- GF who is in nursing school and will finish in 4 semesters, Spring 2019  \n\n\nMy current job situation is less than ideal. My job pays relatively well for my area and I like who I see on a daily basis, but I feel like something is missing. Also, I'm slightly disenchanted with having a wavering check once a month. One month I made $3,000, the next I made nearly $8,000. My job isn't hard but it is very taxing physically (i work in the elements) and I can't see myself doing this past 50 or so.  \n\nI really would like to transition to something that's a little more white collar based. My friend who is just now graduating (Winter 2017) with a double degree in finance and economics keeps telling me I should go back and try to get a job at the FDIC like he will. From what I've heard, the pay is pretty top notch as is the benefit package. I'd like to retire right on the dot at 65, and I feel like that's definitely doable with what I've heard at least from the FDIC gig.  \n\nI guess my main question is, what would I gain by getting an MBA? I think many hiring managers would look more closely at me when I apply for supervisory roles within a company. Also, I could possibly get something more geared towards business, like the FDIC job. In retrospect I should have majored in finance and economics like my friend but I don't think it behooves me to go back for another BA. I'd feel like I was taking a step back somehow.   \n\nAlso, I'm not sure if this helps or is something to consider, but everyone has this idea that all CS people are males who are exceptionally nerdy, but I'm not really like that. I can very easily talk to people and can present with incredible ease. As a matter of fact for my senior project we built an android app and my partner said we'd split the coding efforts 70/30 to him if I did all the presenting and everything along with it.  \n\nTL;DR - CS major dissatisfied hoping to make a career change into IT supervisory roles or business. Will an MBA help and is it worth it?  \n\nThanks in advance! Also I'm sorry if my formatting is poorly done. I'm relatively new to formatting on reddit.",
    "title": "I have a CS degree with 5 years of experience in sales/advertising/marketing; should I get an MBA?",
    "subreddit": "careerguidance",
    "timestamp": 1497731367,
    "score": 7,
    "keyword": "white manager"
  },
  {
    "text": "Interior stylist or interior designer or interior architect? How to get a career in interior design. INTERIOR STYLIST OR INTERIOR DESIGNER OR INTERIOR ARCHITECT? \n\nThe definitions are a little loose and confusing. I myself was completely baffled by it all at the start, I knew what I wanted to do but had no idea how to define it which is essential when looking for your first dream job in the industry. Firstly, there is a big difference between interior decorators and interior designers/architects. To sum up the difference in one word, the difference is — Education. \n\nInterior Stylist – Photoshoots for editorials and advertising, trend forecasting, artistic/creative direction and show home styling.\nInterior Designer – Furniture specification, concept design, design management, design programmes and client management.\nInterior Architect (often found within an Architecture studio) – Room layouts, architectural detailing, a degree in Interior Architecture or Architecture, building regulations and planning applications.\nI personally define what I do as both interior design and styling. Even though I have a Bachelors Degree in Architecture, my passion is all about interior design. But I know for one thing, studying Architecture RIBA Part I at university was the best thing I ever did. It is respected in the design industry and gives you a professional chartered qualification that you can use anywhere, even if you decide to take a break from interior design for a couple of years.  The British Institute of Interior Design is a great tool for budding interior designers from specifying accredited universities to posting job advertisements.\n\nHOW DO I GET THE JOB?\n\nBuild your portfolio. This is YOUR selling tool, so make it look professional and slick. Try not to go ‘wacky’ with colour (my portfolio is a grey and white monochrome scheme), keep it clean and minimal so they are looking at your work not the graphic design. Leave as much white space as you can and take tips from graphic designers in the way they lay out pages (try to use Abode InDesign if possible).\n\nIf you can, try and get an internship. Internships, long or short, give you experience of the industry that you want to be in and allow you to find out if it is the right one for you. It means that you start from the bottom and you get access to amazing talent in the real world. And you can add the work to your portfolio to show to potential employers. You can find job advertisements everywhere but here are the best places to look.\n\nBritish Institute of Interior Design\nDezeen Jobs\nRIBA Appointments\n\nSHOW ME THE MONEY! HOW MUCH WILL I GET PAID?\n\nOf course, this depends on a lot of factors such as, education, prior work experience, size of the firm/company and location. A designer that is employed by a furniture company will most likely make less than a designer that is employed by a high-end architectural firm. Starting salaries for junior designers range from £18,000 to £23,000 a year. Experienced interior designers earn between £25,000 and £40,000. Senior designers can earn £45,000+, while creative/design directors can earn up to £75,000, and sometimes more. Salaries vary widely and depend on location and your reputation and contacts. It is possible to command high earnings, particularly when there’s involvement with high-profile ‘prestige’ projects.\n\nKeep in mind though, interior design is not all about plumping up cushions and selecting beautiful fabrics. You will be expected to work evenings and some weekends as your role will be integral to a large construction and development process, the client will always expect (almost) EVERYTHING for yesterday.\n\nMost of all, find a job in interior design that you love and you will never have to work a day in your life. This may take time but be patient. I know that if you are passionate and driven enough, you can achieve your dream. JUST GET OUT THERE AND START THE FIRST DAY OF YOUR FUTURE!",
    "title": "Interior stylist or interior designer or interior architect? How to get a career in interior design.",
    "subreddit": "careerguidance",
    "timestamp": 1486163483,
    "score": 5,
    "keyword": "white manager"
  },
  {
    "text": "Which career pathway is right for me? I need serious guidance! Hey reddit, I heard you like thorough posts so get ready for this wall of text.\n\n**About Me:** I am 22, white, and female. My education history is fairly short with only a semester and a half of college. I have little financial support so any further college education would require loans. My personality falls into the INFJ category. I have major depression and anxiety which does affect my ability to work (motivation to work; poor social skills) and which kind of environment I can work in(I realize this is not r/depression but this is relevant). My work history consists of some clerical duties and food serve/prep with brief work in Photoshop. \n\n**Strengths:**\n\n* hard-working\n\n* active listener\n\n* creative/artistic\n\n* time-management\n\n* sympathetic\n\n* reliable (?) - sometimes I show up to work late and I work myself to exhaustion\n\n* trustworthy/honest\n\n**Weaknesses:**\n\n* social skills\n\n* leadership/management\n\n* team working\n\n* patience\n\n* handling criticism\n\n* realistic\n\n* perseverance\n\n* working 40 hrs/wk\n\n* stress management\n\n**Things I need from my job:** structure, an employer who cares, benefits, balanced work load, growth opportunity, & variety in the work.\n\n**Careers that Interest Me:**\n\n* Psychiatrist\n\n* Massage Therapist\n\n* Clinical Psychology\n\n* Counselor\n\n* Illustrator\n\n* Translator\n\n* Yoga Instructor\n\n* Wandering Hermit\n\nWhat I am looking for is some advice on what career seems like a good match for me as I am having problems deciding for myself. Also, if there are any careers that I did not list that you think would be a good match. I need a guiding hand or in this case, a guiding, internet stranger. \n\nI would love to pursue something that satisfies both my interest in science and art. People say that an art degree isn't worth the debt associated with it so I'd like to have a career deemed worthy enough to have loans.",
    "title": "Which career pathway is right for me? I need serious guidance!",
    "subreddit": "careerguidance",
    "timestamp": 1499871935,
    "score": 3,
    "keyword": "white manager"
  },
  {
    "text": "How many hours am I expected to work? I joined a company as a developer, with the expectation that I should be working around ~8 hours a day. I make sure that I always keep up to that schedule. If I am at work at 9, I leave at 5, and if I am there at 10, I leave at 6. I don't have long lunches either.\n\nWhat surprises me is that all of my team members (5 other developers, including my manager), easily work 9-10 hours a day at least. My manager is online around 8 am each day, and at office around that, and I have seen email responses from him around 10 pm some days, including comments on pull requests which means he is working that late. Not only that, there is a developer on my team who let slip by one day that he was up till 3am the night before, like it was no big deal. What the hell?? Is that generally expected to be up working that long hours in a dev job?\n\nSome more details if it helps, all of the devs on my team are H1-visa holders (from India), I am the only white guy. I wish my team was more diverse, but it is what it is. I don't want to be singled out as the guy who doesn't work as hard just because I leave at 6. What do I do about the situation?",
    "title": "How many hours am I expected to work?",
    "subreddit": "cscareerquestions",
    "timestamp": 1505676819,
    "score": 55,
    "keyword": "white manager"
  },
  {
    "text": "Should I report about racial stereotypes that go too far? Please i need advice? Hello cscareerquestions. Longtime lurker and finally made an account to complain about my possibly shitty situation. I just want readers to keep in mind and tell me in the end if I’m overreacting or am I actually being mistreated. I really want to believe I’m overreacting and I feel like I’m going crazy over this. \n\nTL:DR: I’m currently facing some less innocent stereotype jokes by an employee and I don’t know whether or not I should let it go or not.\n\nSo I work in an IT department that has a software team under a Canadian (Toronto area) company that does research. I am myself a young male Canadian-born Chinese who recently started my career as a software developer. Most of the stereotypes I’ve witnessed upon myself are very innocent and I play along and genuinely laugh. However, I have this one senior lead (who is White and from a commonwealth country other than Canada) and overall he’s a great guy and a great leader. He sometimes likes to use stereotypes a bit too much. A good amount of them time are innocent and I’ll play along or just not respond at all if they’re a bit more on the offensive (ex. Looking at a bunch of resumes and seeing a common last name like ‘Patel’ and saying hey that’s (another employee’s) brother)\n\nHowever, this one thing really got under my skin and prompted me to come here looking for advice. He wanted to know my “real” name and was being very persistent. I politely told him my parents gave me my western name first but it wasn’t enough for him. He even went to get other people to nag me about it who thankfully didn’t want to participate. He proceeded to try hard to annunciate his wife’s (who is also a Canadian born Chinese) and laughed. He’s a pescatarian who loves animals and loves to comment on a lot of the times when I’m eating something with meat and has also made some comments about me being a meat eater and being Asian. I feel like his wife just lets him have free reign on stereotypes but he should know not to have the same amicability to everyone else. That is probably what plays a huge part in his own mind that he can use Chinese stereotypes so frequently. My perception of him now makes me think he likes to make everything about my culture a joke and has somewhat of a superiority complex over i\n\nI really want to keep this job and has great benefits and a great pension and the other people I work with are just splendid. However, my contract ends in August with a chance to go on Full time with the benefits after that. My manager (who is also white) is a great teacher and mentor to me and the only thing he has ever asked me about my background is ‘What is your ethnicity’. My manager and I really get along and he knows I do a good job.\n\n However, I don’t know whether if I should make a complaint about this senior lead to my manager because what if he sees this as a nuisance to deal with a workplace problem that is related to racial sensitivity? The senior lead and manager are close professionally but not sure personally so I don’t know how to approach this. All I can think about is that if I make this complaint, am I going to be looked at as a problem? What if letting me go after my contract is the easier thing to do because I made this complaint? Does this also make me look bad if I’m trying to apply for another job and I say I complained about because of racial discrimination?\n\nSorry for the long post!",
    "title": "Should I report about racial stereotypes that go too far? Please i need advice?",
    "subreddit": "cscareerquestions",
    "timestamp": 1489964345,
    "score": 28,
    "keyword": "white manager"
  },
  {
    "text": "Analyst? Dev? Eng? What am I? **tl;dr**\n*trained in economics, started career in e-commerce, took a data science bootcamp, self taught python, done work related to data arch/infra, and dev/sys ops all in the course of 2 years.  not sure what my career path looks like to employers.*  \n\nLet's play a game.  I tell you what I do for a living and you tell me what my title is.  \n\nMy background is in E-Commerce and I went to school for Economics and Stats.  I've worked for my current employer, a small/medium-sized tech company, for a little over 2 years now where I was hired as a Data Analyst.  A few months before I started here, I finished a coding bootcamp course in Data Science where I started writing in Python.  When I started my current job, I expected to write some SQL, look at numbers, do some math, and tell people who made more money than me what to do about said math.  \n\nOver the first 3-6 months of my job, I took over the grunt work for a reporting engineering deptartment that was dissolved prior to a company re-org.  This included maintaining and optimizing **data ingestion, processing, and storage**; ingesting files from emails and data from APIs, parsing data with **Python and lots of Shell scripting**, and writing to **MySQL/Postgres** databases.  \n\nI inherited this system and for the first 3-6 months, the question I was usually asked was \"where is my data?\".  Over this time I made it a point to make sure no one had any reason to ask me that anymore.  \n\nMonths 6-12 included me flying abroad to develop a solution for a newly acquired startup in another country.  Their database was an Excel sheet, so I set out to build a similar infrastructure for them.  Excel was a key tool for them, so this included learning **VBA** to integrate their current workflow into the system I built, which this time leveraged **AWS** services, which my company had just begun using.  I set up **EC2, RDS instances, and made use of S3** - only using Python to handle dataflow.  \n\nMonths 12-18 was like going back to a marriage right after your first affair.  The processes I had established were pretty airtight and perhaps because the company was growing, there was less pivoting.  With less pivoting came less technical surprises.  It became maintenance from here until the next few months when I started getting back into analysis.  With no systems to worry about, I got to do some **statistical analysis** and a little bit of modeling.  Exploratory data analysis became a huge part of my focus.  With this, I became more involved in the process of displaying data.  Enter: **Flask, some PHP, and minimal Node.js**.  I built a few standalone apps with Flask, tweaked some legacy apps built in PHP, and contributed to some projects built in Node.  Through this I also became a bit more savvy with web servers.  Before this I had no idea things like **gunicorn or nginx** ever existed.\n\nSince then, there have been a few shakeups that have affected my role.  I've shifted back to infrastructure - primarily **monitoring and alerting**.  We tried a bunch of different monitoring platforms for setting up dashboards.  I leveraged the chat client our company uses to handle some alerting.  I also became more familiar with job scheduling platforms (basically fancy schmancy crons).  My department has grown but with more analysts, so occasionally someone will do something that crashes a server or clogs a database.  I've also became much closer to **MapReduce a la Spark and Hadoop**.  I learned more technical things about **EC2s, cluster management, and benchmarking** than I learned about Data Science in the bootcamp course I took.  I still enjoy white-boarding data architectures, so this week I'm **writing a Python library** that leverages some proprietary tech so that these new Analysts can stop being a risk to our infrastructure (half-joking).  \n\nSo here's my existential crisis.  What in the heck am I?  \n\nI went to school for Economics, and have no formal training in CS or IT.  I feel like I've gone in so many directions that I'm worried about landing another position if I decide to move to another company.  I understand that the REAL answer here is \"it's up to you\", but for the sake of an attempt to have a more precise career outlook, if you had to give it a name, what would you call my role during the last 2 years of my career?",
    "title": "Analyst? Dev? Eng? What am I?",
    "subreddit": "cscareerquestions",
    "timestamp": 1504596811,
    "score": 7,
    "keyword": "white manager"
  },
  {
    "text": "Looking for a job (after being out of steady work since October 2016) Why is it so hard to get (and keep a job) these days in Seattle?  I primarily work contract roles because that's mostly whats out there.  Getting a fulltime position seems nearly impossible!  The last few companies that interviewed and/or considered me for full time positions flaked on me (even some of the contract hiring managers have been flaking also).  What is the big deal with this area lately?\n\nI'm an experienced SDET/HW engineer with 7+ years of industry experience.  My resume speaks for itself, I have worked at Microsoft on contract multiple times, have a diverse set of skills (not just one) and does great work, but ever since October, it's like the market has just... dried up.  What's the deal here?\n\nLately, Microsoft has been actively opening new positions for the Surface and Azure team.  I had two interviews for the Surface team.  The feedback was that for one I was not as qualified as the other candidate, while the other one didn't specify (likely because I was overqualified).  I'm not being picky about salary or anything, or even where I work, but the software engineering and IT industry has never been stable for me, and I've never had a full time position in my entire life because they are so hard to come by and much harder to get considered for.\n\nI post my resume on monster, careerbuilder, indeed, etc. and just started using LinkedIn, hired.com, and a few more.  No success at all.  The prior years before have been much more successful.  2016 hasn't been a good financial year for me, ant 2017 is just abysmal.\nNothing, nothing, NOTHING!\n\nI'm not trying to complain here, but I'm amazed that I haven't been kicked out of my place yet.  I don't have money to buy food, pay for transportation, and debt just keeps piling up (thanks alot, my idiot ex girlfriend), so I feel like it's do or die at this point.  I even thought of committing suicide several times.  There just has to be a way out of this, right?\n\nOne of my ultimate goals is to get back into Microsoft, specifically on the Surface team.  I've been on the Surface Hub team before, and did an outstanding job with tools development and automation but ever since the budget cuts in 2016, things have just been downhill from there.\n\nIf you want to know my skillsets, here's some of the languages and technologies I've used.\n- Visual C++, Visual C#, Java, Objective-C, some Javascript, some Python\n- .Net frameworks, open source APIs for Linux and MacOS\n- Cross platform native app development for iOS, Android, Win10 (UWP) and Blackberry 10\n- Automation using Selenium Webdriver, TAEF, Eclipse\n- Xbox testing and development\n\nAnd that's just a basic summary of the things I've used and excelled at, and yet I STILL can't find anything this year!  Once again, I'm not trying to complain but I really don't know what to do anymore.  6+ months of seemingly non-stop job searching with next to no results makes me want to quit software engineering and do something else that's going to provide SOME sort of stability because what's the use of getting paid an upper 5 figure or 6 figure wage if you just keep getting laid off all the time??  It really does just seem hopeless.  And lastly, I'm not trying to play the race card or anything (because I don't use the \"white man got me down\" excuse) but is it because I'm black?  No really, I'm running out of ideas.  My resume used to get me tons of interviews.  Now, not so much...\n\nAny ideas or insights would be really appreciated.\n\nShogun",
    "title": "Looking for a job (after being out of steady work since October 2016)",
    "subreddit": "cscareerquestions",
    "timestamp": 1495488734,
    "score": 3,
    "keyword": "white manager"
  },
  {
    "text": "Is this a good response to the question \"tell me about a time you disagreed with your manager\"? My response to this is the following story:\n\nThere was a time about a year into my career when I was working on a project to convert a data feed from a mainframe process to a SQL stored procedure. The feed was sending data from our systems to another area of the company, and receiving a feed back and storing the data. It was a monthly feed.\n\nWe worked closely with our business partners to analyze the requirements and develop the stored procedures. In one of the feeds there was some ETL logic required that neither my manager nor I really had a good understanding of. We reached out to some other folks in our department and found that another BA (business analyst), who was previously a developer, had some SQL code that did almost exactly what we needed, we only had to change a few data sources and outputs. From what I can remember his code was joining several data sources and using a cursor to output a temporary table to be used later in the feed. We worked with him to get this logic into our feed and to try and understand what it was doing.\n\nWhen it came down to it though, my manager and I did not have a 100% understanding of what Mike's (the BA) code was doing. We knew it would work, Mike knew it would work, but even after stepping through the code and working with Mike are understanding of this portion was still lacking. Mike is a bit a white-beard and we knew we could trust him and that the code was solid though. \n\nMy manager wanted to move forward with this portion of the feed being a \"black box\". I didn't really like the idea of doing that and voiced my opinion. However, since I was junior at the time I didn't really have much of a say in the matter. Even my manager's manager was OK with doing this. Especially since we were in a bit of a time crunch.\n\nIn order to mitigate as much risk as possible I made sure to test this code 200%. I wasn't happy that we were doing this, since it was going to be our name's at the top of the SQL script and we were owning it, but at the end of the day there wasn't much I could do.",
    "title": "Is this a good response to the question \"tell me about a time you disagreed with your manager\"?",
    "subreddit": "cscareerquestions",
    "timestamp": 1502151694,
    "score": 2,
    "keyword": "white manager"
  },
  {
    "text": "How can you measure quality within an engagement? I'm the senior on an an engagement with the goal of having all walkthroughs through manager review by July 31st. I want to create a 'scoreboard' within the audit room to publicly display everyone's progress toward this goal and update it a few times a week. I think the personality my team will like this. My only roadblock is that I feel it's only emphasizing the quantity of production and ignoring the quality. \n\nDoes anyone have any ideas for how quality within an engagement can be quantified and displayed? Basically I want some incentive other than just pump through as many walkthroughs as possible so you look good on the white board.",
    "title": "How can you measure quality within an engagement?",
    "subreddit": "Accounting",
    "timestamp": 1493954917,
    "score": 6,
    "keyword": "white manager"
  },
  {
    "text": "Reflections on ACN versus MBB About me: spent over 4 years in ACN strategy after undergrad and was highly rated throughout.  Left just after being promoted to Manager for an MBA in the Chicago area.  Turned down the ACN return offer and took a full-time offer with an MBB.  I've now been at my MBB here over a year and am about to be promoted back to manager level.  Really happy with my decision overall.\n\ntldr: MBB is better than ACN.  That said, I enjoyed my time at ACN (couldn't be where I am without them, they gave me my first shot after all), still have a lot of friends there, and still think of my career counselor as a mentor.  But, if you want to do consulting, there's no reason why you wouldn't want to do it at MBB.\n\n**What's the same**\n\n- The day-to-day work:  The gist of what you do is pretty much the same.  Solve problems, build models, deal with people.  For example, I built a model recently that was pretty much a duplicate of a model I built back at ACN.  I put together a deck on change management that is very similar to what ACN does and the Partner loved it.\n \n- The travel: Yeah, it still sucks.  Still flying economy, still staying at a Westin, still renting from Avis.  Per diem's a little more generous, but then again, I don't get to keep what I don't spend, so it balances out.\n\n- The starting pay is pretty much the same\n\n**What's better**\n\n- The projects: MBB has clients that at ACN we could only dream about.  Where we have the same clients, the MBB projects are with more senior clients, the projects themselves are more interesting, and the stakes are higher (on average, obviously).  The mix of projects is also more skewed towards interesting things like strategy, deals, marketing, etc.  More than at ACN, what you're doing is meaningful for the company and there is something major at risk based on your recommendations.  Best of all, there's ZERO IT implementation projects that some Partner is trying to disguise as MC.  I remember so many people being pissed off when they got bait and switch'd... one of my best friends at ACN quit when a \"Product Strategy\" gig turned into managing the error resolution log for some shitty tablet.  Also, I never had bench issues at ACN, but know that a lot of people did - this isn't an issue at MBB.  Also, never have I felt like I was rubber stamping something.  Never have I had a partner push us to try to change numbers so he could go sell some other project.\n\n- Client relationships:  I feel like at ACN, we were mercenaries and hired guns.  For a lot of clients, we would come in, do some work, leave and have no idea when we would come back (on the Strategy side, obviously on the tech side it's different).  Even on the diamond clients.  MBB really feels like partners with the client.  In a weird parasitic way.  I guess because the clients are often higher up, but we've been working with some people for years and years on different topics.  We really have a pulse on what's going on in a company, the problems they're going to face, and because of that, there's a level of trust that I never saw at ACN.\n\n- Grunt work: there's just no comparison.  You can tell that MBB has been doing this for decades.  At ACN I spent hours and hours of my day doing research, trying to find free excerpts of research reports because the team was too cheap to buy them, Googling images of charts that hopefully appeared in a newspaper or something.  Now?  there's a whole team that does the research for me.  If I see a report I need, I can just buy it.  And don't get me started on comparing ACN's garbage fire of a KX.  Or slide creation.  At ACN I spent so much time making slides, tweaking slides, making them client ready.  QPT or whatever they call it now is shit.  At my firm now, I just draw stuff out, send it to the slide people, and beautiful slides the next morning.  It's incredible - hours and hours of my day freed up just from these two things.\n\n- The pay scale: it's a lot steeper at my MBB than it would have been at ACN.\n\n- Exit opportunities: I can't think of any of my ACN friends leaving to jobs where I'm like, \"damn, I wish I got that.\"  That happens weekly here.  \n\n**What's worse**\n\n- Hours: I probably worked 50 hours at ACN, now I work 60 hours.  I guess 10 more hours doesn't sound like much, but you really feel it.  Plus, it's always gogogogo... at ACN you could easily just take a break here and there - now I feel like there's just no downtime.\n\n- The competition: At ACN, I felt like I could put in 70% effort and still do really well.  Now, I feel like putting in 100% is just average.  On average, the people at MBB are just smarter, or work harder, or worse, both.\n\n- The 'kool-aid': At ACN, I never did any extracurics and it didn't make any difference - still got high ratings.  Now, I feel like I *have* to do stuff like help plan the holiday party or do white papers, etc.  It's not work, but it's still work.  It's time I rather use for something else.",
    "title": "Reflections on ACN versus MBB",
    "subreddit": "consulting",
    "timestamp": 1512492033,
    "score": 449,
    "keyword": "white manager"
  },
  {
    "text": "New Year New Opportunity First, I want to say thank you to /r/consulting for the help and support over the last several months. The folks and wiki around here are incredibly helpful.  (Yes even you alcohol warriors)  This post will likely be my last from this account unless there are specific follow ups/questions/etc. so I'm a little more willing to be free with some info.\n\nI recently accepted an offer to join a Big4 digital strategy practice. I figured I'd put a little detail here as I'm a non-typical hire and perhaps someone down the line could utilize my experiences to some extent.  If this belongs in the regular recruiting thread, I'm more than happy to delete and move as necessary.\n\nSemi-pertinent details: US based, white male, mid 30s, former military, working in the healthcare industry, BA in Philosophy from not even close to target state school. 4.0 GPA and few extracurricular activities (but one of note).\n\nI was lucky enough to have a friend who recently moved into MBB from Big4, and had contacts at the Big4 I had in mind.  I scheduled a phone call with the senior manager and discussed my thoughts around moving to consulting, the whys and hows etc.  Said senior manager offered to internally refer me for any positions that came available for which I'd like to apply.\n\nI found several and applied for few as not to dump on a new contact I had little interaction with.  The SM talked to the recruiter for the position I eventually accepted and had the recruiter manually pull my application and pass it forward.  My initial app had been dinged by the electronic system, unbeknownst to me at the time.  This ding explains why this was the only position I received any follow up regarding, and I have still not heard for what reason I was initially dinged.\n\nI received a request for phone interview from the recruiter.  It was a pleasant 30 minute conversation detailing why I thought I would be a fit at the company,why I was looking to move, what I saw as my strengths, and general compensation expectations.  I was then scheduled for a phone interview with a manager similarly placed to my area of interest.  That interview was again about 25 minutes with a little over 5 minutes for me to ask questions.  This section of the process took about two weeks.\n\nI was then scheduled for face-to-face interviews in two weeks time.  During this time it was requested that I have another phone interview, this time with someone more healthcare focused.  I was told this interview went well and we proceeded with in person interviews.  \n\nThe interviews were specifically behavioral, tech, and case, though little of them fit what I expected out of said types of interviews. I was told that everyone had enjoyed speaking with me so far and the interviews were much more conversational that I expected them to be.  The case was very process focused \"what would you expect if X happened and how would you handle it\" kind of questions.\n\nI left without much feel for how they all went, though I'm a talker, so I figured my answers were sufficient.  I received a call back two days later wanting to move forward with the offer process.\n\nDue to the holidays and various levels of \"out of office\" for people involved, the offer process encompassed a few weeks with an expected start date around the end of January. I'll admit to the offer being slightly less than I was hoping for, but as someone stepping into a post-MBA role without an MBA or significant consulting experience, I felt it was a fair offer.\n\nFrom what semi-candid feedback I have been able to garner, my ability to speak concisely and effectively about a wide array of healthcare and business topics including the technologies at play and business processes along with a rather personable demeanor is what won the day.  It was commented that an interviewer had seen my name as someone who had looked at their profile, though I don't believe this was intended as a positive or negative statement, more an \"I saw this.\"  I did it to include in my conversations topics and questions relevant to their experiences and any shared experiences (typical interview prep, but I hear it was more important for a consulting interview as it illustrates the willingness to engage clients on their level).  Having an odd and noteworthy extracurricular gave some of the various interviewers throughout the process something to start with instead of diving head long into the meat of the resume.  \n\nI know a lot of this post will be old hat for many of you, but I figured there might be folks like me with some of the questions I had going through the process, and hopefully this quick run down of my experience illuminates one of the myriad of roads for making it into consulting.  Thanks again /r/consulting.\n\nEdit: clarity",
    "title": "New Year New Opportunity",
    "subreddit": "consulting",
    "timestamp": 1483481579,
    "score": 10,
    "keyword": "white manager"
  },
  {
    "text": "LPT- Always, always bring your headphones with you. Even for you old heads like me.\n\nSo I'm sitting here, waiting to get my car done. Normal shit right? Not for me.  I have been seriously suffering from severe depression since '10 so going out and doing normal shit is something I struggle with.  Fun times I tell you.\n\nThis waiting room is like a mini Chinese torture.  CNN, Donald Trump infestation feeds, country music blaring, and a shit ton of white folks. Panic attack incoming. Shit. Can I just get my car and leave? I don't care that I already paid. Fuck the tears are coming. Why didn't I bring my goddamn earphones???\n\nBreathe.  Need to vent. Oh, I cant- been pushing people away for years. Ain't nobody got time for my shit.  Oh! /r/blackladies.  That's right. So I'm here.  No more sniffles. I will breath, vent and relax. I think I can manage now. Breathe.\n\nThank you /r/blackladies. Just for being you.( God, here come the tears again). If you are out there suffering from that bitch called depression, you are not alone sis.  I don't wish this Satan.  \n\nIf you're young and was kind enough to read this far of this random mess, you have hope and put treatment as first priority in your life.  You deserve it.\n\nLove you all.\n\nG",
    "title": "LPT- Always, always bring your headphones with you.",
    "subreddit": "blackladies",
    "timestamp": 1492447292,
    "score": 44,
    "keyword": "white manager"
  },
  {
    "text": "Essay on Feminism I need ideas on what to write my essay about. It has to be 3-4 pages long and I have to have 2-4 references. I sort of wanted to discuss women on TV and use the TV series \"The Lost Kingdom\" on Netflix (Great series if anyone is looking for new shows to watch) to help analyze some of these issues.\n\n Just a few things:\n\n1. I think women should have free birth control\n\n2. I think \"inequality\" in regards to the amount of women who are CEO's is not actually an inequality. Women are now starting to become CEO's and a change in the amount of women who are managers/CEO's is not something that is going to change overnight/within a year.\n\n3. I think the pay gap between women and men is a skewed statistic because there are too many variables involved (Workplace wage, Actual position at company, How long you have been working.\n\n4. I'm a believer that the way women are percieved by the media (magazines, news, movies, music, etc..) is very innapropriate compared to how men are treated. I absolutely believe that women are sexualized way more than men. \n\n5. I think women and men should be required to sign up for the army draft. I believe that women and men should be required to take a physical/mental health test that may exclude them from the draft if they do not pass the requirements (Too emotional, height requirement, suffering from various mental health issues, etc...)\n\n6. I believe in white male privilege in US society but other privileges exist too. I believe in privilege in general. Wherever you are, you or someone else has privilege (whether it's privilege by being thin, privilege by skin color, privilege by being a native or immigrant, privilege with socio-economic status, etc..)\n\n7. I don't think Porn has anything to do with feminism \n\n8. I don't think that violence against women has anything to do with feminism. I think violence as a whole is a issue with society and that if you are violent towards any individual without legitimate reason (Ex: self defense (physical and verbal-bullying), standing your ground) then you should be punished.\n\n9. I think one of the primary issues with women's rights is also that many women expect things to be equal while also expecting men to do various things for them such as: \n\n              1. Make the first move\n              2. Pay for things\n              3. Be Chivalrous\n              4. Fix things that are broken\n              5. Propose for marriage\nOnce these stereotypes are addressed and resolved it'll help balance things more. \n\n10. I think that there should be a divide in women and men when playing sports. I think there should also be co-ed versions of the teams.  This is not a gender equality issue, this is a biological issue.\n\n11. I agree with the movement of loving your body (both men and women do this, but I see that it is primarily women who discuss this the most). I do not agree with the idea of loving your body and finding it acceptable/okay to live an unhealthy lifestyle though. If you are overweight, you should strive to be as healthy as possible, not use \"loving your body\" as an excuse to not be healthy. \n\nAny and all comments are appreciated. If you want me to explain further into detail any of my opinions let me know ^. If you disagree with any of my opinions and would like to debate/educate me more/change my view then feel free to comment too. If your emotional because my post triggered you in some way (sorry if it did, it was not meant to in any way) and just want to tell me that I'm a dickhead, please do so in a creative way. I'm a huge fan of creative insults. \n\nThanks for the help",
    "title": "Essay on Feminism",
    "subreddit": "Feminism",
    "timestamp": 1488330727,
    "score": 1,
    "keyword": "white manager"
  }
]