[
  {
    "text": "Waiting for decision for a job I really want (+2 days and counting) I was terminated last December from a hedge fund due to a very toxic fallout (the person doing the firing couldn't look me in the eyes). And I spent about a month and a half after that trying to heal from the situation. I was burnt out going into the job search, and only applied to 2 companies that I was sure would not be toxic (I am in tech so there are always jobs available and almost every well-known place there is reputation of a bro culture). One of them turned out to be a dream job. I never knew I would be excited to work again. Anyways, final round went smoothly, or so I thought, and the recruiter said they'd reach a decision sometime a week later. It's now been 8 days and a follow-up email later, and I still haven't heard back anything. I restarted the application process, now armed with the optimism that maybe I can find a job that I love in an environment that doesn't belittle or despise me. It was hard coming to terms with a job that felt so right was not meant to be yesterday, but I suppose that is a part of life.\n\nEdit (Context): I am an Asian female in STEM. As the only woman on all teams I've been in, it feels like I've been fighting to belong my whole life. Yesterday I watched a tiktok video of a black woman receiving feedback about being perceived as aggressive and threatening despite sitting at a meeting quietly and saying nothing while a white guy jumped up and down and cursed at the same meeting and received no feedback. My problems are probably not as egregious, but I am struggling with the same question: how do you act on feedback that is about what you are instead of what  you did? My mother tells me that it is okay and just do my best. But today when I talked to recruiters that don't see any limits for me and were talking about aiming for directors and principals, I just feel like crying ||\\_\\_\\_\\_||.",
    "title": "Waiting for decision for a job I really want (+2 days and counting)",
    "subreddit": "jobs",
    "timestamp": 1613688212,
    "score": 1,
    "keyword": "white principal"
  },
  {
    "text": "It's the fact that we need it, for me. I just watched Moxxi on Netflix, and it hit strong on all the right and wrong places.\n\nLike, *spoilers* the principal at their school refused to acknowledge anything the boys were doing because it would be paperwork and headache for her, what prompted the girls to start a feminist group.\n\nIt also reminded me when my cousin (13F) called me to talk about how her school had an argument if queer people and women *should* have rights.\n\nWe shouldn't have those arguments, shouldn't have rights, shouldn't have to endure shit. But because we shouldn't need to.\n\nWe are still people, but since we're not white straight males, we aren't seen as such.\n\nLemme tell yall, the Bible, aka white people base fit many things in life? No whites. It's in the middle East/Africa! Jesus? He's black. And a nice guy overall, but the fandom kinda sucks.\n\nSo why is it that whites are seen as better? Don't get me wrong, I'm a white as milk girl in Brazil, but it still bugs me that people use of religion to justify racism and many other forms of prejudice.\n\nAnd then there's the issue of misogyny.\n\nWe can't do anything by ourselves, go to the corner store alone, without being sexualised in any way! I work gigs in a bar nearby and the amount of guys plainly harassing me and the other girl that works with me sometimes. Not only flirts, but straight on harassment.\n\nAnyway... Thanks for coming to my (not so)TED Talk. You'll find chocolate chip cookies and no lactose milk at the back!",
    "title": "It's the fact that we need it, for me.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1631385006,
    "score": 7,
    "keyword": "white principal"
  },
  {
    "text": "How do I get over this TW: Sexual assault\n\nAfter rolling around and contemplating whether to post something or not I've finally decided to do so. My boyfriend said that I should consider sharing my story somewhere so here it goes. Growing up, I've always found it easier to have male friends since we like the same things (martial arts, video games, crude sense of humour), and for the most part all was good until high school. Looking back there were little things that bothers me but I think these two incidents stick out the most and bothers me the most. \n\nIt was the beginning of the school year and we had a new transfer student in our class. His seat was beside mine so I thought it would be nice for me to show him around the school and the neighbourhood since he was also relatively new to the country. All was well and eventually he asked me out and we went out for about a week or two. I later realized that there were conflicts of interest based on our values and he was often pushing boundaries so I told him I liked it better when we were friends but he accepted and we went back to that. However, he started to touch me in inappropriate ways in class when the teacher wasn't looking. Things like grab my thighs, touch my waist or neck, and even tried to kiss me a few times. I've told him multiple times to fuck off and even kicked him into a wall but he didn't. I went to the counsellor on day after class. They offered to put my into another class but that was the only class running due to a lack of students and it was the middle of the school year. They offered to tell me teacher and they could move the seats and she could keep an eye on her and the principal, apparently, gave him a warning or whatnot. I don't know if that actually happened. I guess it got better. I talked to my friends in that class about it and they said that I shouldn't have went out with him. And maybe if I paid less attention to his actions he might be gotten bored and f'ed off on his own. I don't think about this much now as it disgusts me but the few times that I have I start to doubt myself..\n\nSometime in highschool I joined a martial arts club/team. It was a small team so I quickly bonded with everyone in it as practice was quite often. We hung out a lot and everything was good and no one really pushed boundaries. Eventually that blew up in my face haha. The team leader confessed to me and I turned him down. It was awkward and we didn't talk much for a bit then it got better. It was the day after a big performance and we went to someone's house to celebrate. We had a couple of drinks then everyone started to go home. I was waiting for my ride and eventually he said he needed to talk to me. He got pushy. He got forceful and kissed me and eventually tried to have sex with me. I repeatedly said no I don't want to get off and tried to push him off but God. It's hard to push off someone 100 pounds heavier than you off. My ride got here in time so I was able to leave. \n\nI've told this to a few close friends before and the responses were not great..they were among the lines of yeah he's an asshole but you could've avoided this if you didn't... To sum it up, I should've have drank, I shouldn't have been nice, I shouldn't have gotten to close to them, and I should've realized that he was a shitty guy from the beginning. It felt ridiculous. I felt ashame I was blaming myself I was miserable. In the mean time, rumours were going around the school saying that I'm easy, a slut, a white, a bitch, a tease because apparently he bragged about it to everyone. I told my mom eventually. She said I must've gave the wrong signals. That it's embarassing that this even happened and I can't let anyone know. My family comes from a place where sex is almost taboo to talk about so I get it. I just have to live with this. I just need to be more careful and harsh and to stop trusting people. I cut friends out, I became a loner, I was mean and cold and lonely. To him I was a notch in the belt and something to happily brag about to everyone while I'm miserable and suffering. But why? If karma is really than why am I suffering? Why's he happily living like he's never done anything wrong. Why am I the one having to repress these memories so I don't become miserable. I don't know how to get over this. Even if something bad does happened to them how do I get over this trauma. \n\nSorry if this felt like a rant and thanks for reading till the end.",
    "title": "How do I get over this",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616112534,
    "score": 5,
    "keyword": "white principal"
  },
  {
    "text": "Harassment by students I need a bit of advice. For context, I'm a first year teacher in a small town. Starting off the year, I had a lot of shock with some of my students. They were all very interested in my personal life, asked a lot of questions about my relationship and where I lived. Over the course of the first semester, I had a few students continue to ask really personal questions. There were times I felt like they were even trying to flirt with me. Well, last week before Christmas break, we were virtual. I was teaching from home and had a student, same as before, ask for my snapchat. Well come to find out he had recorded asking me and then posted it on tik tok. (I had someone from the community send it to me.) The student captioned it with try again tomorrow. Several of my students then commented things like, keep you chin up/try again tomorrow/she's missing out. When I first brought this up to my principal he basically dismissed it completely. I then went back to him and he only took me seriously because I was sobbing (it brought up some previous trauma). \nFlash forward to this week when a friend of the student who recorded me left his student ID on my car windshield. \nI just feel like all these small things are piling up and my principal doesn't car. He just keeps saying that its \"baptism by fire.\" Excuse me no, this is not something any teacher should have to deal with. I don't care if im only a few years older than my students or that im not ugly, I shouldn't have students getting away with hitting on me everything they are in my classroom. \n\nSorry for the rant, I'm just fed up and not sure what to do next.\n\n\nEdit: Thank you all for the advice, its much appreciated! I've had conversations with the union rep before. While she agreed that me being recorded was bad, she also downplayed the issue. The problem I'm seeing with being in a small town school is that everyone downplays issues or doesn't understand why things are an issue. On top of that, our principal is a pushover when it comes to any opinions/choices of the board and our board is the bad kind of stereotypes of middle age white men.",
    "title": "Harassment by students",
    "subreddit": "Teachers",
    "timestamp": 1614485244,
    "score": 161,
    "keyword": "white principal"
  },
  {
    "text": "That one time my high school had hosted a wet tshirt contest. By now many of you have realized how old I am, but for the newbs...I was supposed to graduate in 1994....more on that later...\nBut during my junior year Student government advertised an upcoming Wet T shirt contest at Friday’s assembly. We couldn’t believe it. It was actually in the announcements every day. Kids were asking all the teachers (mostly Miss Cross) if they were going to participate. She was. Along with some of the cheer team and football players, and even principal! \n\nA good friend of mine convinced his mom to let him bring the camcorder for the pep assembly. Everyone was excited. \n\nAlong trods Friday, as slow as a day can arrive at the end of a week, and the day has come, we’re all set up to watch the spectacle. All the participants are standing behind large bucketS of water. \n\nThe announcer shushes the crowd with ease,,.you could hear a pin drop...then the countdown...3.....2.....1.....\nThen every participant bent over and picked up a white T shirt, already in the bucket, and holds it up to show the rest of the crowd...with as much acting clout as an after school special, which is to say not much...\n\nWhen the crowd eventually found out, like 6 people at a time, that THIS was the wet t shirt contest that Duane had brought his big old camera for, I swear you’ve never heard a more angrily disappointed group of teenagers. Duane was the best, saying as loud as possible, Are you f~~~ing kidding me!!!!?? I need to see them ~~~~~~~!\n\nIt was an absolute melee, security had to calm down a few kids who lost their sh-t, and about thirty kids just walked off campus.\n\nFrom a teacher standpoint, I’m like,this had to be the worst idea in educational history.\nWhat was your schools worst idea that had good intentions?",
    "title": "That one time my high school had hosted a wet tshirt contest.",
    "subreddit": "Teachers",
    "timestamp": 1622383994,
    "score": 120,
    "keyword": "white principal"
  },
  {
    "text": "All I wanted to do was play a vocabulary game... I posted this on r/tifu but I thought y’all would get a kick out of it, too. \n\n\nI’m a 6th grade English teacher. It’s a Friday, end of the day, and I’m over it. I only have to kill 45 more minutes before my students are dismissed for the day and my weekend can begin. I have just the perfect plan: let’s play a vocabulary game!\n\n\nThe game I came up with for us was a hybrid between silent ball and sparkle. For the uninitiated, silent ball is a game where students must remain silent while sitting on top of their desks, and they pass a ball around the room. Sparkle is a game where students have to spell a word together, so like one kid would say the first letter, the second kid the next letter, third kid says the next letter, etc. \n\n\nI had students sit on top of their desks and pass a ball around, but once a student caught the ball, they had to add the correct next letter to the word. If they got the letter wrong, they had to sit down. Fairly simple. Everyone was on board with it and was engaged in the game. Every teacher’s dream!\n\n\nI made it a point to write the word up on the board as they went along so they could keep track of what letters had already been said. It was going great until the vocabulary word I gave them was \"cumulative.”\n\n\nI got 3 letters in and then it felt like they started taking dives to stop me from getting any more letters up on the board. And of COURSE, that’s when my principal walked in. With a bunch of snickering 6th graders staring at the word “cum” dead-center on the white board. Cool.\n\n\nTL;DR: played a vocab game with my students and played myself into writing “cum” on the board when my principal walked in.",
    "title": "All I wanted to do was play a vocabulary game...",
    "subreddit": "Teachers",
    "timestamp": 1619832880,
    "score": 60,
    "keyword": "white principal"
  },
  {
    "text": "Principal assigned me to dual language... I'm not fluent. Edit: I should also include that I'm a 25F high school math teacher and last year I taught half my sections in algebra 2 and the other half in statistics. \n\nFor context I'm a now second year teacher about to start my second year at the same school in a few weeks. The school that I work at is about 40% Hispanic, with the rest of the population being predominately white. Its also important to mention that I am half Mexican (mestiza) with a Hispanic first and last name. I was never raised speaking Spanish and learned the language only through high school and college in which I've studied about 5 years collectively. \n\nAt the end of the year in May/June, my principal casually dropped the news on me that I would be assigned a section of dual language algebra 2. I had no prior warning of this and my immediate reaction was to say that I wasn't fluent and didn't know how I'd be able to teach the course. My conversational Spanish is enough to get by, but it's no where near the level of a native speaker. His reaction in turn was to kind of dismiss my worries and say that he'll make sure I'm supported to help me teach the class. \n\nOver the last few weeks of school, I desperately ran around and talked to a bunch of people including the union rep and my department head and they all had the same answer which was that he was within his rights to assign me that class, but that it did seem unfair. I also sat down with a 1-1 with him and told him that I did not have the Spanish to support the class, and while he listened and empathized, he ultimately needed me to teach the course because there are no other teachers who could support a dual language class. Also as far as supports that he had loosely promised, I found out that there really wasn't any since there was no dual language curriculum, no guaranteed bilingual EAs, nor any other teacher in the district who has done with course. \n\nI am now 2 weeks out from PD and I have never felt more anxious about teaching. I'm more scared than last year which was not only my first year but also the beginning of \"COVID schooling.\" While my principal did come to an agreement that he would be satisfied which however I handle the class, assuming I do my best to make it a dual language experience, I am terrified of teaching this class. I know my Spanish isn't good enough and it feels even more embarrassing considering that my name and face just scream \"Hispanic\", which is something I've dealt with my whole life.\n\n I'm at a loss with how to move forward and quitting isn't an option right now considering I have nothing else lined up and it's so close to the start. Anyone have any words of wisdom for me or even remotely shared experiences? I don't want this to be the thing that makes me hate my job or hate this school, but everything about this situation is giving me anxiety and making me dread the beginning of school.\n\nEdit 2: Thanks to everyone who was able to chime in and give advice. It means a lot to have the support and sympathy from many fellow educators. I just wanted to add that there seems to be a little bit of confusion on what dual language is in comparison to ESL. While I am unsure about other states/districts, where I'm at, the main difference is that ESL takes speakers of other languages and has the goal of building fluency in English while DL on the other hand is a program that begins at the kindergarten level and has the goal of achieving bilingual fluency in English and the target language. Students who are in DL are not always native speakers and are cohorted from kinder up through 12th grade. They are all usually fluent in English but have varying levels of fluency in the other language. While it's simpler to offer a 50/50 experience in elementary school, at the high school level, this balance is harder, therefore the program relies on immersion since there are usually fewer DL course offerings due to limited staff.",
    "title": "Principal assigned me to dual language... I'm not fluent.",
    "subreddit": "Teachers",
    "timestamp": 1629105036,
    "score": 57,
    "keyword": "white principal"
  },
  {
    "text": "Ridiculous teacher dress code I was recently reminded of the ridiculous dress code at my first job. It was a public school that required uniforms for students - white shirt, navy or khaki pants/shorts/skirt. Teachers were required to wear only those 3 colors - navy, white, and khaki (though not necessarily in the same pattern as students - I had a solid navy dress I wore all the time). It was supposed to create community or something like that and it was enforced by the principal. Black dress pants were a big no no. \n\nI’ve never heard of anything like this since, so I was just wondering if anyone else ever had to deal with a dress code policy this restrictive?",
    "title": "Ridiculous teacher dress code",
    "subreddit": "Teachers",
    "timestamp": 1628183325,
    "score": 38,
    "keyword": "white principal"
  },
  {
    "text": "Question about a weird interview my actual question: is there a way to report a person or school district if you don't work there but had an interview? \n\nThe reason for the question for those who want a quick read:\nSo i don't want to make this long and I've told this experience to everyone i know because I just couldn't wrap my head around this interview i had. It was my third round and was with the superintendent, assistant superintendent, MS principal and HS principal. The first two interviews were killer! Felt good, the connection with folks was there and felt genuine. Then this interview happened and it made me feel really small. \n\nI'm in my 30s (she/her) and i teach health and phys. Ed. I'm in my fourth year at a title 1 school and this matters because I was interviewing for a district that was not. I am white bit teach a diverse group of kids and we have a diverse staff as well and i really love it. However, i was trying to find a job back home to be with my family. I went to school originally for Kinesiology and got my BS. I subbed after graduation and decided to go back to get my teaching certificate and my masters in education. \n\nBullet points of what entailed:\n-first comment was that he is just now seeing my resume and finds it \"interesting\" especially that i went from an assistant to a superintendent to \"where i am now\" and compared it to his \"girl in front doing that\"\n-said i subbed for too long (while i was in. School...)\n- asked what someone with a kinesiology degree would so anyway after graduation\n- questioned whether I was actually a head varsity soccer coach multiple times and asked me to verify by listing rivals??\n-when asking if my girls played travel teams i explained they are not able to afford it. They need help with things like running shoes etc, because many either just immigrated or come from immigrant families and the income just isn't there to support paying for those teams (like many other families in the area) when i explained this he said \"i don't get it...what's the draw? What's the draw to that area for them? Are they all related or something?\" \n- they didn't understand what overcrowding was\n- when i asked about the school culture and how they show they support or value teachers he said \"we only hire the best so your paycheck every two weeks is how we show you we value you. I don't do any of that appreciate stuff or emails or awards\"\n- when i asked about inclusiveness, specific to LGBTQ students (that's what my passion is and my current work is heavily involved in). He scoffed and said \"that's more of a grass roots issue. Too much parent pushback. I'm not gonna spend time training my staff for that\"\n- i asked about how they feel with PD opportunities for teachers outside of the mandate PD. And he literally said \"conferences and workshops are stupid. Waste of our money and resources.\" Which yes, we should be in the classroom but it was weird how defensive he got.\n-when i was told teachers \"abuse PTO to do stuff like that\"\n\nThese are just a few things. I felt disrespected, belittled, small, and overall annoyed. He spoke to me in condescending tones and was at some times a little intense with his rants for each thing. There has to be a way to report or at least have on record any issues during interviews right???\n\nThanks for reading i needed to get that out.\nAlso was not offered the job (shocking). I truly would not have accepted if they had. They did not align with my.values at all.",
    "title": "Question about a weird interview",
    "subreddit": "Teachers",
    "timestamp": 1627608159,
    "score": 29,
    "keyword": "white principal"
  },
  {
    "text": "Angry Parent is Threatening Me I have a student named Derek (not his real name). Derek is not one of my favorite students, though I would certainly never indicate any of the kind to him or to any of my students.\n\nHe's something of a tattle tell and a trouble maker. During pre-Covid times, he would poke another student with a pencil. The student would ask him to stop. After he continued poking the other student, his pencil would be snatched away, snapped in half, and dropped on the floor.\n\n\"TEACHER! TEACHER!\" Derek would shout (even though he knows my name along with the fact that most of my students call me \"chef\" because I'm the chef instructor of a Culinary Arts program).\n\n\"\\_\\_\\_\\_\\_ stole my pencil and broke it!\"\n\n\"Were you poking him with it?\"\n\nDerek would study his feet. \"I dunno. Maybe.\"\n\n\"Did he ask you to stop?\"\n\n\"I don't remember.\"\n\n\"Did you poke him again after he asked you to stop?\"\n\n\"HE BROKE MY PENCIL!\"\n\nAfter telling the other student not to take pencils away from Derek or to snap them in half, I returned to my instruction. Derek had other plans. At home he tattled on me to his mother by offering a one sided perspective. \"And I wasn't doing ANYTHING and a bully took my pencil away and broke it. I told teacher and he didn't do ANYTHING.\"\n\nIncensed over how I had allowed her precious high school freshman to be \"bullied,\" Mama Bear would start to metaphorically poking me.\n\n\"WHY ARE YOU ALLOWING MY SON TO BE BULLIED?\" she would demand via email. \"RESPOND AT ONCE!\"\n\nI typically do not reply \"at once.\" I usually wait for 24 hours. Since I've had lots of prior experiences with this kid (who was also with me as an 8th grader), I knew that it didn't matter what I said because the truth doesn't matter. This parent was prepared to believe anything her son had to say. She was equally prepared to believe that anything I had to say was a lie.\n\nShe's played this game with other teachers. With other teachers she's also played the race card. \"YOU HATE MY CHILD BECAUSE HE'S BLACK!\" The other teachers have all been white.\n\nShe has NOT played this game with me because I'm not white. I'm Asian. I'm even more of a minority than this parent is.\n\nThis hasn't stopped her from relentlessly badgering me.\n\n\"MY SON CLAIMS HE TURNED AN ASSIGNMENT IN BUT HIS GRADE SAYS THAT IT'S MISSING. EXPLAIN!\"\n\nI checked and found that although I had graded an assignment on Canvas (our instructional platform), for reasons unknown, this grade wasn't carried over to our electronic gradebook (Infinite Campus). I sent Derek's mother a thank you note for having brought this to my attention. I explained that Canvas had not transferred these grades to Infinite Campus. I told her that I had reported this to IT and had updated Derek's grades.\n\n\"WHY DOES HE ONLY HAVE A 71?\"\n\nI explained that his low GPA came from the fact that he had only earned a 70 on a unit test. Since the district has required us to weight all tests at 90% of a student's GPA, all test grades are really important.\n\n\"WHY HAS HIS GRADE FLUCTUATED?\"\n\nI have no idea what she meant by this question. Grade point averages change as new grades are added. This is basic math. Instead of saying this to her, I told her firmly but politely that I had addressed her concern about a missing grade and thanked her again for bringing this matter to my attention.\n\nShe's now threatening to complain about me to the district office because I'm rude and I'm allegedly not answering her questions.\n\nI am not worried. She shot her credibility with the district many years ago after she tried to convince the assistant superintendent that our principal, the assistant principal, and all of Derek's teachers \"hate\" her son because he's black.\n\nThis woman has reportedly been screaming at teachers and building administrators ever since her son was enrolled in kindergarten. She will doubtlessly continue to complain so long as Derek remains enrolled in our school.\n\nLucky us.\n\n(sigh)",
    "title": "Angry Parent is Threatening Me",
    "subreddit": "Teachers",
    "timestamp": 1618881513,
    "score": 28,
    "keyword": "white principal"
  },
  {
    "text": "I hate parent teacher conferences! My school always does PT conferences early in the year, about midway through the first quarter. I don’t really know why. But anyway our conferences were today and tomorrow.\n\nI had one parent bring an issue to my attention that was pretty serious. Her son (who is white) told her that a girl in our class (the girl is black) has been threatening him, telling him to fuck off, or shut the fuck up. When his mom told me this I was surprised because this student has never mentioned anything of this nature to me or another teacher, as far as I know. But I told her that if it happens again, he needs to tell an adult, whoever he is near at the time.\n\nAs chance would have it, my very next scheduled conference was the girl in question. I felt I should bring it up, but I also knew I had to be careful because I have no proof of anything. So I just mentioned to the girl’s mom that I had gotten a report of her daughter possibly using very inappropriate language with another student. I emphasized that I didn’t know if there was any truth to it, but I encouraged her to just speak with her daughter to see if she’s having any issues with other students. The mom knew right away who I was talking about even though I never mentioned his name. She said this student repeatedly makes racist remarks towards her daughter, makes fun of her hair, her skin, calls her fat, and has evidently called her the n-word. She did agree that if her daughter used the bad language that was not an appropriate response though, and said she would bring it up at home. Again, just as before, this girl has never mentioned anything of this sort to me or any other teacher. I told her that the next time this happens, her daughter needs to tell an adult right away.\n\nSo I really don’t know what to think. Maybe they’re both telling the truth, maybe not. But I can’t do anything if the students don’t let anyone know when this is happening. Either way, I’m going to speak with my principal tomorrow.\n\nDid I mention I hate conferences? Ugh.",
    "title": "I hate parent teacher conferences!",
    "subreddit": "Teachers",
    "timestamp": 1632964798,
    "score": 29,
    "keyword": "white principal"
  },
  {
    "text": "Coming Full Circle / Le Cordon Bleu & the Public School System I'm a dual certified teacher with 17 years as an elementary teacher and 14 years and counting in Culinary Arts. Despite having lived and worked in two different warzones as an expatriate teacher in the international American schools, nothing in my 31 years of experience could have prepared me for the past year. In reading the posts on this board, I have seen many complaints about lax district attendance requirements for virtual education and hybrid. I have also seen a growing number of posts about administrative pressure to inflate grades given how abysmally some students have become during the current crisis.\n\nWhile I have not had any first experience with grade inflation at my school, in an effort to \"improve\" our attendance rates, my district has unintentionally undermined our virtual instruction. Per district policy, we are required to mark students present if any one of the following conditions were met.\n\n1. The student attended your virtual class. (It doesn't matter if the student just logged in and then logged out without bothering to stay for instruction. The mere fact that he or she even bothered to log on counts towards attendance credit for that student's class.)\n2. The student didn't log into your virtual class but did log onto Canvas which is our instructional support platform where we keep all student lessons and assignments. If a student logged into Canvas on the day you had your virtual class, that student will be marked as present.\n3. If the student sends his or her teacher an email on the day you had a virtual class, that student will be marked present.\n\nThe students aren't stupid. A lot of them have milked the system and my attendance rate has dropped to the point where I only have 1-2 students out of a class of 16 who bother to attend any of my virtual classes.\n\nConcurrent with the bad attendance has been the growing failure of students to complete any of my assignments. At least 40% of my students are failing. Some haven't even logged onto Canvas in two months.\n\nI think there are a lot of parallels between what's been happening in many of our public school systems and what happened to the American division of the Le Cordon Bleu culinary schools.\n\nIn France, Le Cordon Bleu is a widely respected and venerated culinary school that was first opened in 1895. Throughout the last 126 years, a succession of great chefs have taught the next generation of culinarians whose ranks have included the likes of Julia Childs, Giada De Laurentiis, and Mario Batali\n\nIn 2000 Le Cordon Bleu entered into a partnership with Career Education Corp. (CEC), a company that bought up private vocational schools in the United States.  Instead of adopting the Le Cordon Bleu curriculum and standards, the CEC slapped the Le Cordon Bleu logo on their culinary uniforms and campus signage. When the American division first opened, these schools included the Southern California School of Culinary Arts of Pasadena, California; the Western Culinary Institute of Portland, Oregon; the International Culinary Academy of Pittsburgh, Pennsylvania; the Scottsdale Culinary institute of Scottsdale, Arizona; and the Midwest Culinary Academy of Mendota Heights, Minnesota. In time, the American maintained and operated 16 schools. Trading upon the Le Cordon Bleu name, at the height of their popularity these schools generated an annual net revenue of some $100 million dollars.\n\nAs a 2003 Le Cordon Bleu graduate, I had the dubious distinction of watching this school begin its slow decline almost from the moment it first opened its doors. After having burned out as an elementary teachers after 17 years in the profession, I cashed out my Texas Teacher Retirement account to pay for my tuition at the Texas Culinary Academy in Austin. I was 40 years old at the time. My father still insists that I was having a mid-life crisis.\n\nMy class had about forty students. While most of the students were recent high school graduates, our very oldest classmate was in his 50's, though a life of hard living had made him look a decade older. I was the 2nd oldest student in the class. There were also a handful of students in their 30's. The ranks of the older students included a registered nurse, a veteran who had mustered out after 20 years in the service, a pastor, a computer engineer, and a restaurant line cook.\n\nOur school uniforms consisted of white culinary jackets with the Le Cordon Bleu logo emblazoned over the left chest. We also wore herring bone black and white cook trousers, black socks, and close toed non-skid shoes, along with a white skull cap. In addition to our textbook, we were each issued a black tool kit that included a complete knife set.\n\nAlthough the CEC had published and distributed a set of student handbooks that outlined the school rules and expectations, these standards were rarely applied. In theory, students who were late to class should have been barred from attendance and made to attend a Saturday makeup session. In reality, none of the chef instructors seemed to care if students were as much as 30 minutes late.\n\nStudents were expected to come to class wearing clean uniforms. In reality, some students came to class wearing jackets that were stained with ingredients that had been used during the previous day. One student even showed up wearing sandals with black socks. The chef instructor let this student stay even though his clothing was a health code safety violation.\n\nA lot of the younger students didn't bother doing their reading assignments or their written homework. Many of these didn't even bother to take notes in class before we went to the kitchen for our hands-on production lessons.\n\nSince most culinary classes teach students in cooperative learning groups of 3-4, the older students banded together into two groups out of vested self interest. We did this because we had work ethics and standards. We read the assignments. We completed the written homework. We also took notes.\n\nDuring our lab time in the kitchen, many of the younger students would disappear for extended smoke breaks of 30 minutes or longer. They wouldn't help with production. They wouldn't help with cleaning the kitchen. Since we were working in cooperative groups, each group shared a common grade. Those of us who were responsible didn't think that these other students deserved to share our grade since they made no contributions to our group effort.\n\nAt the end of our course of study, as part of our graduation requirement we were expected to complete a three month externship under the supervision of a chef or a kitchen manager. Students who had been allowed to develop slovenly habits and to show up late for class had a rude awakening when they tried to act the same way in the commercial food service.\n\nEven though the Le Cordon Bleu schools were still relatively new, by the time I got to my externship, it was hard finding anyone who would take me. The Texas Culinary Academy had already developed a dismal reputation among most of the area restaurants. Students were late to work. Students were improperly attired. Students thought they could get away with 30 minute smoke breaks. Those students who hadn't paid attention in class and who had not assisted in the kitchen were quite out of their depth and lacked the basic skills that a culinary extern should have had.\n\nI was lucky. I eventually found a placement with a boutique hotel that had an attached French restaurant. I completed my externship without problems and graduated with honors. As with nearly anything else in life, what I got out of the program reflected what I had put into it. I went on to work in the food service for five years before returning to education as the chef instructor of a high school Culinary Arts program.\n\nI was successful. A lot of my former classmates were not. Since Le Cordon Bleu did not hold their students to high standards, their reputation suffered. In time, student externs could not find placements. Le Cordon Bleu graduates could not find jobs.  In 2015, CEC tried to sell their schools but the Le Cordon Bleu label was so badly tarnished in the United States that they wound up announcing their pending closure. No new enrollments were accepted after January of 2016. The last classes graduated in September of 2017.\n\nLe Cordon Bleu is an example of what can happen when you don't enforce high expectations regarding attendance, student participation, and grades.\n\nI started teaching in 1982 before President George Bush's No Child Left Behind Act ushered in accountability testing. For those of you who are old enough to recall what teaching was like BEFORE accountability testing you may remember that some schools and some districts had similar lax standards.\n\nBefore accountability testing, elementary students were often \"socially promoted.\" It didn't matter that these students were failing and had cruddy attendance. During my first elementary teaching job in a Title I district on the south Texas border, my principal told me that kids who were retained would suffer worse from the emotional trauma of being left behind than if they were promoted with \"a few\" academic deficiencies.\n\nAlthough I was a novice teacher at the time, I remember thinking that my 5th grade students were 2-3 grade levels deficient in both reading and math. If the principal thought that these were \"a few\" academic deficiencies, I couldn't help wondering what a glaring deficiency might have looked like.\n\nThe problem with having lax standards was that some schools were graduating students who were functional illiterates. Back in 1977, the U.S. Office of Education estimated that an estimated 23 MILLION American adults were functional illiterates who lacked the ability to read restaurant menus and train schedules.\n\nIn 1976, a student named [Peter W. sued the San Francisco Unified School District](https://core.ac.uk/download/pdf/217048241.pdf) because they had graduated him even though he was only on a 5th grade reading level and had failed several grades. The plaintiff alleged that in failing to properly educate him, he had been relegated to a life of manual labor since this was all that he was qualified to do. The trial court dismissed the complaint. This was subsequently upheld upon appeal because Peter W's failure of educational achievement was not accepted by the court as an \"injury: within the meaning of tort law.\n\nAnother lawsuit followed. In 1976 [Edward Donohue](https://www.nytimes.com/1977/02/20/archives/a-graduate-who-says-he-cant-read-saying-he-is-functionally.html) was graduated even though he couldn't read at all. In 1977, he sued his former school for \"educational malpractice.\"\n\nHis lawsuit alleged that even though he had failed all of his classes during his junior year (except for woodshop), he was socially promoted and became a senior. He was even placed in a senior English class despite having failed English as a junior.\n\nDoes any of this sound familiar to our current education climate?\n\nThe teachers at Mr. Donohue's former high school said that there was an unofficial rule that said that they could not fail more than 15% of their students. Instead of actually educating their students, there was pressure from the building administration to graduate students as a way of getting rid of them.\n\nI  wish I could say that Edward Donohue had a fortuitous outcome to his lawsuit. I am sorry to say that he did not. In 1977 in [Donohue v Copiague Unified School District](https://www.leagle.com/decision/197948747ny2d4401440), the court found in favor of the district. The summary statement alluded to, \"the practical impossibility of proving that the alleged malpractice of the teacher proximately caused the learning deficiency of the plaintiff student. Factors such as the student's attitude, motivation, temperament, past experience and home environment may all play an essential and immeasurable role in learning. Indeed as the majority observes proximate cause might 'be difficult, if not impossible, to prove'.\"\n\nIt wasn't until 1981 ([Hoffman v. Board of Education](https://scholarlycommons.law.hofstra.edu/cgi/viewcontent.cgi?article=1427&context=hlr)) that a plaintiff was (partially) successful in pursuing an educational malpractice lawsuit. Daniel Hoffman was a student in the New York City Schools. At the age of five the school district placed him in a class for the mentally retarded. He remained in this class for the next 12 years despite the fact that a school psychologist had insisted that he wasn't retarded but instead suffered from a low self image. Although the court awarded the plaintiff $500,000 in damages, this judgement was reversed upon appeal and the case was dismissed.\n\nThe reality for all of us is that this isn't 1976, 1977, or 1981. It's 2021 and the times have changed.\n\nIn 2016,  a high school graduate Jamarria Hall joined a class action lawsuit with six former students in suing the Detroit public schools because the district was graduating students who were illiterate. As a junior and later a senior Mr. Hall alleged that his English teachers taught him using 3rd and 4th grade level books.  His attorney alleged that his former school was literally falling apart and lacked certified teachers and up-to-date textbooks. It argued that conditions were so appalling that in one instance an 8th grade student took the initiative to teach math to his classmates for a month after his teacher quit and the school was unable to find a replacement.\n\nIn May of 2020, after four long years of legal battles, the Detroit Public Schools settled and agreed to pay the seven former students a total of $7 million to settle this education malpractice claim. In settling they have also created a legal precedent for future education malpractice claims.\n\nThe implications of this recent case should be clear. School districts may successfully be sued for educational malpractice. While school administrators seek short term relief by having teachers inflate grades so as to appease the school board and angry parents, if these practices were to continue, it could have serious legal implications in the years to come.\n\nNot to detract from the validity of anything that I have said, but this is also why teachers should belong to a union. Most unions offer legal representation and liability coverage as part of their benefits.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nEdited: I graduated from Le Cordon Bleu, Texas Culinary Academy in 2003, not 2001. That was a typo which has since been corrected. Since it was quite late at night (or early in the morning depending upon your perspective), I also corrected some grammatical mistakes.",
    "title": "Coming Full Circle / Le Cordon Bleu & the Public School System",
    "subreddit": "Teachers",
    "timestamp": 1617261744,
    "score": 27,
    "keyword": "white principal"
  },
  {
    "text": "\"Just log in to this stupid training\" I teach in a pretty well-off area that is fairly conservative. I had to go show the principal my vaccine card and tell him to his face that I had a fever after getting the vaccine, because that is the dumb policy that my district decided to enforce. \n\nWhile I'm waiting, someone else is asking a question about whether teachers who are sick today can log in to the mandatory DIVERSITY training that we have today. \n\nThe principal eventually tells him, sotto voce, to make sure \"they just log in to this stupid training. It's a waste of time.\"\n\nY'all. This is the PRINCIPAL of a school that has an almost all white staff but with an increasingly diverse student population, and he's so open about his disdain for including others. \n\n(Also, he wasn't wearing a mask through any of this, which is par for the course with this one)\n\nHow the heck are the people IN CHARGE of our schools so dang MEAN?",
    "title": "\"Just log in to this stupid training\"",
    "subreddit": "Teachers",
    "timestamp": 1615555448,
    "score": 23,
    "keyword": "white principal"
  },
  {
    "text": "Tales from a Title 1: Why I left I was a first year teacher. But I'm not fresh. I graduated in 2018. We put my husband through grad school while I stayed home with our first kid. We moved back to our hometown and I got a job at my old middle school. I was not prepared for the storm ahead me....\n\nLet's begin with what happened during PD before school started. I was told the principal, had been a little off the rails. The year prior he had a mental breakdown during STAAR testing and took two, 3 week leaves. Well during PD he would make rambling speeches about CRT, he made racist comments about \"nappy\" hair and went on about how teachers should dress appropriately because the male students will want to have sex with them. The Friday before school starts, the superintendent came to a meeting and told us he was put on leave and we would have interim. So that's how the year starts. Here is a list of things that happened: \n\n- A student threatened to shoot up my classroom. \n\n- A student caressed my hair and nothing was done. \n\n- A student attempted to hug me and put his arms on me, nothing was done. \n\n- A female student grabbed my butt in the hallway, nothing was done. \n\n- A student that was only a day back from county, threatened to put his hands on me if I didn't move from the door. \n\n- Kids were passing weed around in my classroom and only questioned one and did nothing else about it. \n\n- Multiple fights, weed smoking in the bathroom and absolutely no respect from the students in my classroom. \n\n- A white student was constantly harassing black students calling them N words, sexually harassing female students and even said he was going to rape one and nothing happened. \n\n- My speaker was stolen for two days (but returned by a good student) and admin scoffed because it was returned \n\nThe list goes on. I put my 5 day week notice on Monday. Yesterday was my last day. On Wednesday a student told me \"so now that you quit does that mean I can hit it\" and made an obscene gesture at me. I was having vertigo, wasn't sleeping, stomach pains and more. It was too much. I got a remote job as a talent acquisition coordinator. When other teachers found out I was leaving, they were begging for advice on how to get a new job. Some of my sweet students cried, begged me to stay and brought me going away gifts. But it's not enough. \n\nThe state of education is a flaming pile of shit. And now I'm sick and depressed thinking of what to do for my own children.",
    "title": "Tales from a Title 1: Why I left",
    "subreddit": "Teachers",
    "timestamp": 1638630324,
    "score": 23,
    "keyword": "white principal"
  },
  {
    "text": "Serious question: How do other educators tolerate the lack of accountability for extreme behaviors long term? I just took leave. I’m doing a lot of reflecting about what felt so unsustainable about this job, and whether I will be able to tolerate returning at some point. This is my second time in 3 years of teaching and six years in schools of reaching a breaking point. I’m wondering how others are able to tolerate, year after year, the lack of accountability for violent/anti-social behaviors that seems to be the norm. \n\nIt seems utterly unethical to tolerate this aspect. Entering teaching, I was onboard with the rhetoric about equity and non-exclusionary discipline being racist/biased.  I still believe historically there is a precedent for this claim and individual educator biases still make this an issue. I believe that many times excluding students harms/victimizes them. I believe in restorative justice and repairing harm when it’s been done. \n\nHowever. It seems we’ve swung way too far from “inequitable accountability” to “no accountability”. In the name of not inconveniencing our most difficult students and their difficult families, we have normalized tolerating constant abuse and violence. \n\nI care deeply about my most troubled kids. And I think that’s where our shift away from discipline comes from. But I cannot maintain the emotional stamina to support this kid if they are never held accountable by administration or parents. Because the truth is, I would never tolerate this from a colleague. It’s reasonable me and kids are reaching a point of no return in terms of forgiveness for these kids. I don’t think it’s unfair I have no patience left for this nonsense. \n\nWe can simultaneously allow room for mistakes and forgiveness while absolutely not tolerating certain behaviors. We can understand WHY kids don’t have appropriate skills and react violently. That can help us design interventions. But that doesn’t mean we let go of any standards. We can understand why kids are violent and angry without enabling further violence. \n\nIt seems like a losing cause, honestly. We need to start making violent/highly disruptive behavior highly inconvenient for parents or it will never stop. And to do this, we need administration to actually put the fire under the parents’ ass. Repeated incidents of violence? Demand a parent meeting before the kid can return. \n\nI have students who have repeatedly thrown chairs, hit, kicked, and CHOKED other students. I keep filling out office referrals and there is never any escalation.  A boy threw a chair at another student a second time last week and there wasn’t even a parent phone call made by the principal. I do not have the emotional stamina to argue with parents about why their kid chose violence. Every ounce of emotional energy for dealing with difficult people is spent during the school day on these kids. I need someone else to drive these disciplinary conversations. \n\nWhen are we going to stop making the inconvenience of a violent actor in a chaotic social environment a professional responsibility to tolerate rather than an issue to be turned around on the parents?\n\nAs I reflect on what broke me down so much, there are a lot of aspects. Workload, inability to leave things “behind at work”, my own challenges with organization and executive functioning. Ive been thinking about my ability to intentionally prioritize skills development in these areas while on leave. \n\nAnd that would certainly help, but it’s all moot if there’s no urgency about ending the constant violence and near-violence in my classroom. I really don’t think, even if I improve my skills in the areas that are under my control, that I can tolerate a lack of accountability for violence. This being such a prevalent aspect of my students experience creates all kinds of issues. I know my students aren’t safe and I can’t protect them ultimately. Therefore I’m always on edge for a violent escalation, which means teaching content is a far secondary priority. My kids are anxious and on edge because it’s not a safe learning environment. With all of us on edge, there is bound to be further escalations. \n\nConstantly telling parents of victims “it’s been handled” is eroding my own sense of personal integrity. Because I know it’s a lie, but I can’t tell them “sorry, nobody else will do anything. All I can do is intervene and put hands on kids when it inevitably happens,“ which as a white man in elementary feels increasingly risky. \n\nAnd lastly, from the standpoint of what’s best for both the abuser and the victims, it’s helping nobody. It’s teaching the victims that we should tolerate abuse and violence. It’s teaching the violent kids that they can be violent without repercussions, which I can easily see leading them into prison or death by adulthood. \n\nWhen does saying “hell no” trump reputation  management? When does the well being of the students and staff outweigh upsetting a parent? \n\nHow do you continue to show up every day without this aspect breaking your spirit?",
    "title": "Serious question: How do other educators tolerate the lack of accountability for extreme behaviors long term?",
    "subreddit": "Teachers",
    "timestamp": 1639002715,
    "score": 22,
    "keyword": "white principal"
  },
  {
    "text": "Adventures in Culinary Arts: A Tale of Three Meatballs My Culinary I students learned to make a brown sauce today. After pureeing the sauce, we made a simple derivative by stirring in some cream. The cream sauce was mixed with macaroni and was served with meatballs that the students made from scratch.\n\n[https://imgur.com/H5QT8kW](https://imgur.com/H5QT8kW)\n\nWhile the meatballs were baking in the oven, I told my students the story of Mr. Smith (not his real name).\n\nWhen I first transferred to my current school some six years ago, the principal decided to have a mid-year open house. Since she wanted to showcase my talents and advertise my presence, she gave me a budget and had me produce hundreds of appetizers with my students.\n\nWe made burger sliders, glazed berry tarts, deep fried pork egg rolls, flan with dulce de leche, and lots of other foods. We also made meatballs in a brown sauce.\n\nI teamed up with our business teacher to serve this food. While my students produced the food, the business teacher's FCCLA students wearing white dress shirts with red power ties and blue blazers served as our counter servers to serve the appetizers. We improvised a counter by placing a table sideways in the main hallway outside the kitchen door.\n\nI am told that no open house has ever been so well attended. I teach at a rural Title I high school of some 300 students. Each parent got 3 tickets for coming to our open house. Each ticket was redeemable for one portion of appetizers.\n\nMr. Smith is one of our teachers. It turned out that he LOVES meatballs. Even before we opened, he was in line to order meatballs. The meatballs came 3 to a portion. To the amusement of the students, he was in line FIVE TIMES throughout the night. He paid for the meatballs using extra tickets that he got from his wife. His wife happens to be our school principal.\n\nAfter telling this story to my class, the students asked if they could take Mr. Smith some meatballs. I've told the same story to all of my classes this week and since Mr. Smith is one of our most popular teachers, every single class has asked if they could take him a portion of meatballs.\n\nMr. Smith has been in gastronomic heaven, much to the amusement of his wife.\n\n**EDIT:** Just in case anyone were to wonder if Mr. Smith abused his spousal privileges by getting extra tickets, he did not. Each teacher, administrator, and staff member was given three tickets. Mr. Smith spent all of his tickets and then mooched two tickets from his wife.",
    "title": "Adventures in Culinary Arts: A Tale of Three Meatballs",
    "subreddit": "Teachers",
    "timestamp": 1620760687,
    "score": 18,
    "keyword": "white principal"
  },
  {
    "text": "Growing as a Black Lady I’m not sure how to write this, but I’m about to move out of my white community that I spent the majority of my life in. I’m just beginning to see that a lot of the trauma I’ve experienced in life is from racist white people and systematic racism, and I’m  done. I think I just need to rant therapeutically.\n\nMy black parents moved to my area in the 1980s to escape the crack epidemic in the city before I was born. They were very “old school” to say the least. They tried to enroll my sisters in the local Catholic school, and the nun interviewing them asked them “Do you live in *insert only poor predominately black community in three counties here*?”\n\nThey weren’t sure what microaggression the nun was insinuating, but it rubbed them the wrong way. Around town one of the neighbors told my parents the local public school was actually the better option academically. So that’s where my sisters were enrolled. My middle sister actually made out decently, but my oldest sister had a hard time. My middle sister was actually crowned *Miss _*insert town here*” and almost went to the state beauty pageant. Never seen before or after in my town. They were both harassed by the school bus driver (who, years later saw the error of his ways and made sure I wasn’t harassed on his route). The school principal and teachers made a point of humiliating my oldest sister. When my sister brought it up to my parents, my parents said “well it’s not like they’re turning the hoses on you. Deal with it.” In their old-school mentality. My oldest sister is still in a cocktail of psych meds today from the abuse she received going through this school, including sexual assault. \n\nMe? Where to begin with me? I was the youngest in my entire grade and the only black child at a new school. The first teacher I ever had in elementary school husband was a reknown bigot in town, and said teacher tried her best to make sure I was held back. She never gave me any attention in class. Funny, to go to the next grade level I had to be tested (the deal my parents worked out with the school). The results came back that although I was the youngest in the grade-level, I was academically a whole year ahead of my classmates with just the equivalent of being at best ignored or regularly bullied each day. The way my parents tell it if it wasn’t for the teacher’s union the administration and Board of Ed would have fired her on the spot.\n\nUp until 8th grade it was pretty uneventful on the social front, I was still emotionally immature, but had a small group of girlfriends. Academically I was still ahead of most of my peers, but each year the bullying by the teachers became more and more intense. Could it be an emotionally younger student is an easier target? Sure, but looking back I think the teachers were looking for low-hanging fruit. Starting in 5th grade, I remember a teacher who liked to bully low-hanging fruit take me aside after another clique tattled on me and said meanly “there’s something wrong with you”. That stuck with me until I started anti-depressants a year ago and was my universal truth. \n\nEnter the guidance counselor. The middle school guidance counselor automatically had me slated as a “bad kid”. I was having a middle school girl fight with one of my girlfriends (truly over something petty). Looking back, I was probably beginning to experience symptoms of childhood depression around age 10 or 11. The middle-school guidance counselor threatened to call the police on me if I upset one of my girlfriends again. She found any excuse to drag me into the principals office (who was a level-headed man, he would just shoo me away within two minutes). 8th grade, there was a switch and my classmates became blatantly racist towards me. No one defended me. We had a new principal 8th grade and he enabled the bullies towards me. Looking back, I was not only depressed, but had begun to exhibit some symptoms of OCD. I had my first panic attack over these bigoted bullies when I was 13. I never told my parents as I was completely shut down and silent at home.\n\nEnter high school, long story short... more of the same. I was not accepted by my white peers, and the few other black kids at the school did not accept me because I was not “black enough”. During these awkward years I was pushed out of the closet as an lgbtq student. So, it truly felt like “we can’t dislike her because she’s black, but we can dislike her for being bisexual”. I was basically the school pariah. Did I mention when the white students came out of the closet they were elevated to popular levels? Some students were openly racist. Once again due to depression I was shut down and nothing was done about it. My OCD, Panic Disorder, and depression was severe in high school. My OCD came up in untraditional ways than cleaning and hand washing; rather I had scrupulosity, limerace, disordered eating, compulsive exercising, sexual OCD, verbally repeating words/sentences, thought cycling, maladaptive daydreaming, and excoriation disorder. Do you want to know what an obsession feels like? Imagine having intrusive, anxiety provoking thoughts on an topic ALWAYS. Sometimes it’s something average about work or school. Sometimes they are grossly inappropriate like socially-unacceptable sexual thoughts. Or anything in-between. Always. When you wake up, when you go to bed, during the SATs and GREs, at your grandma’s funeral. Always! You cannot turn that off. People don’t understand.\n\nWanna know what a compulsion feels like? You know that feeling when your having sex and you’re about to cum? That’s what the build up feels like. When you orgasm, that’s what engaging in the compulsion feels like. So, every time I engaged in religious rituals (my family was Catholic so it was hella easy for this aspect of my OCD to fly under the radar for a while), that I HAD to do or I was damned to hell, this is what it felt like. If I didn’t engage in a religious ritual, it was panic attack inducing.  That’s just ONE aspect of my compulsive nature. As an adult, I stay away from all organized religion. I’m very happy with this decision.\n\nThis was in the early 2000s. Even in my awkward teenage years I was intelligent, I knew something was “wrong”, but when I approached “safe” adults to say something was up I was told I was “looking for attention”. I tried to see my high school guidance counselor, but it became clear that she may have thought she could start an inappropriate relationship with me. She laughed off my concerns and enabled rumors that we were dating. When it got scary, I mustered up the little strength I could and told her to F off and never talk to me again. I was still shut down at home so my parents didn’t know what was going on. They also knew something was “wrong”, but instead of helping me get the help I need, they just screamed at me to “be normal” until a panic attack was induced. My parents would once again say “there’s something wrong with you.”\n\nStarting in college, at a PWI, I finally began healing and I was accepted for who I was. I went to therapy regularly and I truly bloomed.  \nI was still bullied by mean racist girls, but I had a circle of friends who would shut them down because it was the right thing. For the first time, my college had a multi-cultural club, and I had black girlfriends and I began to learn what it meant to be a black lady!\n\n\nThroughout my travels in life, I have consistently been rejected because I was either black or not black enough. I’m an educated woman with a successful career. I’m finally moving out of my racist white county. Is it weird that this is bitter sweet? Its gotten more obviously racist over the years. Trump flags are still up. Blue Lives Matter people are silent over the Jan 6 attacks, but the area is truly beautiful. If things were different I wish I could raise a family there. The cherry on top of everything is when another black family moved into town from a predominantly black area. As a good neighbor I went to say hello, excited to have someone else in town who looked like me. The family was very cold me to with the common look I get from some other black people of “not black enough”. \n\nThere are some very good people in this town. This may sound controversial, but a LOT of town cops and local state troopers made public statements during the BLM protests that “Black Lives Matter” over and over again. They marched with BLM, and were uncomfortable at Blue Lives Matter rallies. The whole community is taking steps to embrace inclusiveness and diversity. They are finally having real conversations. \n\nOne of the few things that came out of COVID-19 is that I started anti-depressants. My “old school” black parents were and still are highly embarrassed I attend therapy sessions, and told me my whole childhood that “only people in crisis go to therapy; only people with something wrong with them go on psych meds”. My life became clear and I found the strength to just leave. I realized how severe my Panic Disorder once when I began to take a PRN med for them every week and a half or so. That didn’t count the panic attacks I had behind a closed door at work or simple panic attacks that didn’t warrant a PRN. Since I was 13, I’ve been averaging 2-3 panic attacks a WEEK. I’m in my 30s... My therapist and my primary collaborated to add an additional medication last month, and for the first time ever the OCD symptoms, which have been notably decreasing since a year ago, (heads up they’ve always gone down little by little since talk therapy) went down significantly in the past month. It was like before I could only walk a mile, and out of nowhere I could run a marathon. I still have work to do in that area, but I count my blessings. \n\nHowever, the bigots are getting louder and louder. If you have guessed where I’m from yet, a local politician recently gutted a local anti-hate bill to only list BLM and Antifa as hard groups (if I understood the controversy correctly). A part of me wants to stay and fight for the town I love, but I think this just may be some sunk-cost fallacy. There are maybe four people in my town who I’m going to keep in touch with. This place is not good for my mental health, which is an ongoing project to heal. The area I’m moving to is far more diverse, mix of black, white, and Hispanic. The community over is predominately Indian, black, and Hispanic. For the first time in a long time, I feel like I fit in in my new community. Where I don’t stand out like a sore thumb just for having more melanin to white people; where I’m not teased for speaking the King’s English to other Black people. I love that feeling.\n\nWhat should I do next? I like what I do at work, but I think it’s time to take the next step in my career... also, I hate being one of the only black people as high up as I am in the company (1st world problems, I know)... I really want to find a company that is more diverse. Should I join the NAACP? Links? Or should I just be me and know I’m exactly where I should be in life?\n\nI don’t know... I’ve never been around a large group of black women in my life (the group of black girlfriends I had, though healthy and fabulous, was small). Have any of you ever experienced any of this? What do you recommend the next steps be as a strong black woman on my life journey?",
    "title": "Growing as a Black Lady",
    "subreddit": "blackladies",
    "timestamp": 1613871236,
    "score": 27,
    "keyword": "white principal"
  },
  {
    "text": "Can someone please give me some encouragement? **TL/DR:  Educators, sons and daughters of educators, and people who attended majority Black schools in underfunded areas, please give me some words of encouragement and support.  I just quit a job and while I don't regret it, I feel like I failed my kids.**\n\nI've posted in other subs about my ongoing experience in the 7th circle of hell these past five weeks.\n\nI'm a kindergarten teacher.  I've been working in long-term sub positions in posh private schools and guest teaching in gifted public schools for 2 or 3 years now.\n\nThis year I landed my first lead teacher role.  I spent maybe $1000 on my classroom.  I spend 10-12+ hours daily making it beautiful, buying supplies, a printer, watercolor crayons that cost $16.00 a set, etc.   $100 on cork from Home Depot to cover up really messed up walls to make bulletin boards.  Prepping for the next day's lessons, and organizing the chaos from the day, etc.  You get the idea.  I am the first person at that school, every day between 6am and 6:30am and sometimes one of the last to leave.\n\nI have a very large class and the kids are FUBAR.  I teach in a Title 1 school, and for those who don't know, that means it's in a bad neighborhood and the children come from poverty and trauma.  Add the trauma of the pandemic and you have all kinds of crazy.\n\nSince the beginning of the school year, I have lost my voice every week, sobbed, got in two car accidents because of sleep deprivation, had nightmares about my classroom, migraines, and even found a grey hair.  My period, which is normally like clockwork, came two weeks early because of the stress and I'm having stomach issues.  I am worried it's an ulcer.\n\nBoth of my paychecks were late.  The first one was a week late.\n\nThere are only maybe 4 children out of over 20 who consistently are quiet, paying attention, and listen to direction the first time.  The others are doing everything under the sun.\n\nThe worst part is the violence.  I can deal with the backtalk and the lying, though it horrifies me.\n\nOne of the kids stabbed a ball with a sharp pencil and deflated it and now our class has no balls for recess.  Another told me with pride he fights adults.  Two parents have sent messages with photos to myself and the principal about things that happened to their kids at recess or in the bathroom when I am not present.  My assistant handles bathroom breaks and recess duty.  The principal handed me my ass over these incidents and took away my prep time, so now I have to be with the kids all day.  The kids still fight and shove each other.\n\nEveryone on staff is Black, and I can't tell you how much I LOVE that.  I truly had no idea how much I was missing that camaraderie and support, to have Black staff members who bring me tea for my throat or little figurines or just check in before the day starts or pop in my class for a random encouraging hug.  I love us.\n\nBut the principal is White and she's a raging narcissist and a White savior liberal racist.  Nothing I do is right and she makes impossible demands and doesn't respond to multiple requests for support or training.\n\nI put in my two weeks notice this week after she spoke to me in a disparaging way in front of staff and the kids.  She never notices the good things I'm doing.  I know I've gone above and beyond expectations.  Veteran teachers have told me so.  And if 3 teachers have already quit so far, there's something wrong with leadership, not just the kids.\n\nIt's truly sad that I'm going to make more money as a substitute teacher.\n\nIt's killing me that I will be leaving my kids behind and I know that will traumatize them, but after I put in my notice, I felt like an elephant got off my chest.\n\nDid any of you attend a school like that?  How did you turn out?\n\nAny words of encouragement would be greatly appreciated.  I really feel defeated.  I wanted to teach in this school because I wanted to do something for my people but I am in the \"protect my peace\" phase of my life journey and my life has been anything but peaceful since August.  I had no idea this school was like this when I accepted the job and signed my contract.\n\nI'm going where I will be respected, appreciated, and paid.",
    "title": "Can someone please give me some encouragement?",
    "subreddit": "blackladies",
    "timestamp": 1632577388,
    "score": 19,
    "keyword": "white principal"
  }
]