[
  {
    "text": "Just offered a contract job overseas, I need some advice I'm in pharmacy and on a whim, I applied to a contract gig in Iraq for a year. They contacted me and would like to take me on, and I'm considering accepting but I need to bounce the facts off someone first.\n\nFirst of all I'm a young female American, single, no kids and no ties to anything here currently. This would be on a compound with a heavy military presence, lodging and meals are provided for and there is a stipend for travel to get over there and also for leave. I will need to get my Visa set up which the company also assists with.  The pay is really good.  Not so good I doubt its validity, but a good deal more than i make now.\n\nI'll be speaking to the medical director on Tuesday. What sorts of questions do I need to ask? Is this safe for me? Does anyone have experience with this sort of situation? I've never been to the middle east but I know it can pose a bit of a risk for an American white girl like me. It seems like the sort of adventure I would like to embark on, but I want to be smart about all this.\n\nThanks ahead of time!!",
    "title": "Just offered a contract job overseas, I need some advice",
    "subreddit": "jobs",
    "timestamp": 1556294890,
    "score": 11,
    "keyword": "white director"
  },
  {
    "text": "Any interview tips for tomorrow? I have interview tomorrow for an HR Coordinator position. My phone interview went really well and I am excited about this position. I was thinking of wearing a white shirt with black blazer and pale green pants. It is also apparently a two hour interview with a panel and then two individual interviews with the director and the VP of HR. Any tips with how to go about an interview that’s this long?",
    "title": "Any interview tips for tomorrow?",
    "subreddit": "jobs",
    "timestamp": 1570754310,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "Nagging memory of a friend's dad getting angry at me because he thought he could see down my shirt during a play On mobile, and this is really long. Tl;dr at bottom\n\nWhen I had just turned 17, I played the role of Lady Macbeth in a community theater production of Shakespeare's Macbeth. It was my first lead role in a play, and I was immensely proud of myself.\n\nThere was some difficulty with my costumes. As a young girl, I had what you might call a noticeable figure, and the costume director put a lot of effort into making my costume period appropriate, thematic, and modest because I was underage.\n\nFor most of the play, I appeared in an ankle-length black skirt and black camisole under a long-sleeve black mesh top with an enormous lace collar ruffle puffed up so high that it touched my chin in the front and the back of my head. Also, kabuki make-up. Because of...art...\n\nAnyway, at the climax of the play, Lady Macbeth has a mental breakdown and delivers the famous \"out damn spot!\" monologue. My costume for this was a change to an all-white ensemble: a long white skirt and tank top with a white cardigan. Since the blocking of the scene involved me grovelling on the floor, the director, the costume designer, and I were all mindful of the neckline of this costume, so as part of my costume change, I wrapped an Ace bandage around the top of my chest from my collar-bone to my rib cage to cover my body with the flesh-colored wrap. In case a member of the audience were to get an eyeful during the scene, they would be seeing flesh tone fabric, not my body.\n\nY'all, I crushed that scene. Bits of the soliloquy linger in my memory today. I remember so clearly the black-box theater, the lights, and the low stage. My eyes filled with real tears as I played the part of the murderous queen with the guilt-ridden and broken mind.\n\nAfter the play, flushed with my triumph, I met with some school friends who had come to see the play with their families. Unprompted, one friend's dad's feedback was that he wished I had been dressed more appropriately. He said that during the last scene, he could see down my shirt all the way to clearly see my bare stomach. I tried to argue that it wasn't possible, but I was shut down with a stern, \"Young lady, I saw what I saw.\"\n\nBut, I know it wasn't possible. Not only did I have the Ace bandage in place, but I was also wearing a corset under my costume. It was literally not possible to see my bare stomach because my stomach wasn't bare.\n\nI have often reflected on the disturbing implications of this man's comment. What was he doing staring down my shirt when I was reciting Shakespeare? Why was he staring so hard he convinced himself he could see down my shirt and between my breasts to my stomach? Why was he so mad at me, a teenage girl, even if what he thought he saw was true? Why wouldn't he let me assert my modesty, my intention and efforts to remain covered? He seemed so sure I had intentionally put my bare torso on display, and he was furious over it.\n\nTbh, I can't count the number of times as a teenager I experienced grown men reacting in anger to my developing physique, blaming me for their own aroused reaction to a child.\n\nHonestly, what was I supposed to do? Would it have been most modest not to appear on stage at all? I still find it baffling 15 years later.\n\n\nTldr A friend's dad thought he got an eyeful while I appeared in a play. He didn't. He reacted in anger. Thinking about it, that reaction was a common one for me throughout my teenage years.",
    "title": "Nagging memory of a friend's dad getting angry at me because he thought he could see down my shirt during a play",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1550330790,
    "score": 64,
    "keyword": "white director"
  },
  {
    "text": "Lady scientists! Animation studio is creating a female scientist character, need some advice on her outfit from real female scientists please! Hi all, \n\nLike the title says, the studio I'm working at is creating a female scientist character (our concept artist designed her, not me) and I believe she's a dog food nutritionist. The original character design features her wearing a white coat and sneakers and my (male) creative director thinks her shoes are \"unattractive. Try asking SleepingWillows for fashion advice.\" My immediate response was \"who cares, she's wearing sensible shoes for her job.\" My higher-ups didn't like that response, and said to put her in kitten heels, and literally said \"like a Bond scientist.\" \n\nI have a lot of problems with this and made that verbally clear, so I said I'd ask to see what actual female scientists wear. If you work in this field or even in the STEM field, please let me know what shoes you actually wear to work. My coworker suggested a pair of Keds instead, since that seemed like a good blend of sensible and stylish, but we'd prefer a more accurate answer. Thanks in advance!\n\nEdit to add reference since I can't share any artwork: https://www.duluthtrading.com/womens-keen-presido-23635.html \nThese are sort of similar to what the shoes look like now, except grey.",
    "title": "Lady scientists! Animation studio is creating a female scientist character, need some advice on her outfit from real female scientists please!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1551728482,
    "score": 5,
    "keyword": "white director"
  },
  {
    "text": "Scrubs or Professional clothes ? I am an attending physician, hospitalist. In my hospital, almost all of the medical specialty docs wear professional clothes and most of the surgical specialty / ER docs wear scrubs. In addition to that, almost anyone else who works in my hospital, is in scrubs. However, all of my colleagues wear professional clothes - you know, pant-shirt, blouse-skirts etc. I do that too, but I like to wear scrubs. Now, my director (leader of the hospitalist program, aka, my boss) is a 40-ish female physician and feels STRONGLY against scrubs. She says that you are not a moonlighter or a resident and shouldn't wear scrubs, and in extreme cases, if you have to, please wear a white coat on top of it. Everytime she sees me wearing scrubs, she shows such genuine surprise and remarks about it. Kind of unnerving.\n\n&#x200B;\n\nNow here is what I think about scrubs :-\n\n\\- they are super comfortable\n\n\\- its a hassle to make sure clothes are clean, ironed and ready, every morning, especially with a 7 am - 7 pm schedule, not to mention the pain to mix and match styles and colors\n\n\\- they are super professional for the type of work I do , FFS, I am not wearing a bikini thong while seeing a patient\n\n\\- they are issued by the hospital, if it was so wrong, the hospital would just stop issuing scrubs to me\n\n\\- I dont see a point walking into an infection with my $100-200 worth of professional clothes\n\n\\- almost ALL other countries, anyone who works in a hospital, is MANDATED to wear scrubs (aka hospital supplied clothes), I dont understand the American obsession of dressing up like a car salesman\n\n\\- my job is 100% clinical ( well 20% clinical and 80% computer typing), I dont have ANY managerial or administrative duties and its 100 % inpatient. I am dressing for the job\n\n\\- I tried to look up my hospital official policies, but so far, no luck. I guess we are just expected to dress up professionally.\n\n&#x200B;\n\nI want to know how to deal with the situation. I have expressed my desire to wear scrubs multiple times, but she just doesnt get it. In the back of my mind, I want to say that unless you tell me I will be fired or disciplined for wearing scrubs, I will continue to wear them, But honestly I would never want it to escalate it to this level.\n\n&#x200B;\n\nSo, what should i do ?\n\nShould i talk to the director ?\n\nShould I just give up and start dressing up like a car salesman ?\n\nIs there a middle ground ?\n\n&#x200B;\n\nEdit : I am a guy, I dont know how a few commenters assumed that i am a woman. \n\n&#x200B;",
    "title": "Scrubs or Professional clothes ?",
    "subreddit": "medicine",
    "timestamp": 1553524591,
    "score": 337,
    "keyword": "white director"
  },
  {
    "text": "[Vent] I know teaching is for me but my admin is absolutely the worst. I have taught at this school for three years. It's all I have known since I am a young teacher. Every year the admin has gotten more and more delusioned and abusive. I tried to get out last year and did not and am absolutely terrified of the prospect of not getting out this year. \n\nConstant gaslighting and fear mongering. Private office meetings of abuse and insults. Being told we are lazy and do not try hard enough and it's our fault the kids abuse us even though they refuse to discipline to keep the numbers low. Accusing of us of not caring if we do not bleed for our students.\n\nOur principal sent out an email yesterday saying he expects no more teachers to take days off. Our kids are not doing well because we all take too many days off. So no more. If your kid is sick you still need to show up. If you are sick you need to too. I have not taken a single day off except for this upcoming week for Jury Duty. The kids are failing because there is no accountability. You do not let us fail them and they know it so they do not try. Your scores are low on state testing because you falsify data and bully teachers into passing them. \n\nOur director of instruction has been through six secretaries in two years!! She abuses them out the door!!! Our turn over rate is insane and that is with them refusing to accept transfers and trying to block them! (No idea how they can but they do.) I got told I do not have good relationships with students because I am white teaching in title one even though I have had no write ups in two years! Because I work on relationships and know it would be a waste too. \n\nMy anxiety and depression are attacking me lately. I tried so hard to be strong but I do not know how I will survive until May like this. Everyday is some new rule, expectation, pressure. I cannot even put into words how much stuff has happened and what they do. We have a group that meets every other week to just talk and support each other. Texas unions are not super strong but we are reporting and yet they get away with this abuse daily. \n\nI am so tired. I love teaching but I can barely get out of bed and yes I am in therapy and I do take meds but the constant teacher abuse is getting to me. \n\nThanks for coming to my Ted talk.",
    "title": "[Vent] I know teaching is for me but my admin is absolutely the worst.",
    "subreddit": "Teachers",
    "timestamp": 1550373945,
    "score": 13,
    "keyword": "white director"
  },
  {
    "text": "I filed a grievance report; admin told me to “not be so uptight” Update: I talked to the district the school is umbrellaed under, and nothing can be done that is not fiscally involved.\n\nSo, my next move is to go with a legal intervention. Still working out the kinks, but after ANOTHER call-out about my pregnancy in front of the ENTIRE teaching staff, I’m done and I don’t care about my employment. I can’t teach and be discriminated against. \n\nThanks for all the comments. \n\nOriginal:\n\nOk, I’m braving this because I just read another post about admin so here goes:\n\nI felt particularly targeted after kicking a student out of my class (who, by the way, isn’t even on my roster) for saying he “hates Americans” (btw, he’s a white American) then got on his knees to apologize in an accent. I knew he was making a scene so I kicked him out.\n\nMy admin had an office staff member and a counselor interview me a total of three times TWO WEEKS after the incident. Also, I had to be in a meeting with the student with another staff member present to mediated the conversation. (I’m a 5’3” petite female and the 17 year old male student is 6’2”). \n\nSo, pissed off at all this attention, I contacted one of the administrators who asked for me to be interviewed and she blew me off, saying I “traumatized” the student with my “hostility”. \n\nThen, I filed a grievance report, stating the unfair treatment I have had when the same student has been freed of any consequences for insulting and belittling me in front of other students. \n\nFor my follow up, my HR representative and Director of the school spoke to me for two hours, saying I was petty for filing the report, staff and students don’t like me, and I’m being “inappropriate” and “too uptight”.  They also blamed my age and my pregnancy (currently 10 weeks; I announced it early on) for my “heightened sensitivity”. For the student, they said he won’t be punished and that I was the one in trouble for causing him stress. They even threatened my job if I don’t “ease up”. (At-will employment at a charter school).\n\nA few coworkers came up and gave me encouraging words, but there’s got to be some next step, like going to the district, for that kind of treatment. Honestly, I’m at a loss of words. Just wanted to throw all that out there.\n\nEdit: I’m not unionized.",
    "title": "I filed a grievance report; admin told me to “not be so uptight”",
    "subreddit": "Teachers",
    "timestamp": 1572568534,
    "score": 9,
    "keyword": "white director"
  },
  {
    "text": "A woman came in for an interview the other day A middle-aged woman walked into my boss's office the other day, very professional looking, but relaxed enough for a teacher. She was interviewing for a computer science opening at our school.\n\n\"Hi Susan, I'm Adam and this is my assistant Nicole.\"\n\nPleasantries were exchanged.\n\nShortly after, he looks at me and asks me for her file, so I hand him a folder containing her documents.\n\n\"I checked out your CV and I must say, Susan, it's pretty impressive!\"\n\n\"Thank you, it's been a great journey and I look forward to what's next!\"\n\n\"Did you ever meet Bill in person? I mean, you probably saw him every day, right?\"\n\nOf course she had. And not just Bill, but also Elon and Jeff and the late Steve too. Infrequently, yes, but often enough.\n\n\"That's really something, isn't it? Amazing... Well, I suppose we should get started now.\"\n\nHe pulls out a pen and underlines her name on the CV inside the folder I gave him.\n\n\"I'd like to start by thanking you for coming in today, we're really excited about having you onboard. Did you bring a physical copy of your online application with you?\"\n\nThe woman hands him a blue folder, a little thinner than mine. He places it on his desk without reviewing its contents.\n\n\"Great. So... \"\n\nThe interview was fairly standard. I learned that Susan had spent most of her life working at some of the world's best tech companies, starting out as a tester and eventually becoming the senior VP of her department, which had been expanded after one of the startups she had founded was acquired by the company.\n\nImpressive as it was, her CV was the least interesting thing about her. The manner in which she carried herself was something else. She was confident, but never cocky. She had a gift for explaining things and she would never patronize you or make you feel stupid. She was clearly an expert in her field and I would have hired her on the spot, but I wasn't the person conducting the interview.\n\nI simply transcribed and my boss interviewed.\n\n\" ..and you were also involved in the company's education programs for about... five... six years if I'm not mistaken? Is that correct?\"\n\n\"Six, yes. On the first year, I primarily designed the initial draft of our first course and taught it. After that, I was primarily involved with designing policies for our team of trainers and revising the syllabi to keep up with the pace of change in the field.\"\n\n\"Amazing. Teenagers?\"\n\n\"Mostly young adults and mid-level professionals.\"\n\n\"Oh...\"\n\n\"We also organized high school competitions and workshops across California, we had a lot of success with those programs.\"\n\n\"Ah, I see. But have you taught for at least two consecutive years?\"\n\nShe hadn't.\n\n\"Well, that's okay! We will help you with that\" said my boss.\n\nAfter another ten minutes of questions and answers, it became clear she'd be moving to the next round. Hands were shaken and business cards exchanged.\n\nThen my boss looked at me and asked me to schedule the second interview with the school's director.\n\nAs the woman turns around and heads for the door, my boss opens her blue folder and starts reviewing its contents. Almost immediately, he says \"Oh, Susan, did you bring your degree and your transcripts with you? They don't seem to be in this folder.\"\n\nShe hadn't brought them, and how could she? She had no degree to bring to the school because she'd dropped out to work for a popular phone manufacturer. She apparently hadn't mentioned dropping out in her cover letter, nor had she actually mentioned graduating in her CV. My boss's face turned white and the room went silent for a minute.\n\nAfter regaining his composure, my boss says \"Susan, I'm very sorry, but we cannot work with you as you are not a qualified educator. I'm very, very sorry.\"\n\nBefore she could respond, my boss continued \"Thank you for your time, Susan. Please reach out when you finish your degree, we'd be very happy to have you here.\"\n\n\"But...\"\n\n\"Thank you. Nicole? Please bring in the next interviewee. Thank you.\"\n\nSusan thanked him for his time as he hurried her out and she waved goodbye at me. She seemed confused.\n\nI feel really bad for her and I think my boss's attitude was horrendous.\n\n\"School policy, Nicole, remember that,\" he said to me right before I walked out to bring in the next prospect, \"we have to follow the rules.\"\n\nThe next interviewee I brought in was a fresh graduate with a business informatics degree.\n\nHis second interview is tomorrow.",
    "title": "A woman came in for an interview the other day",
    "subreddit": "Teachers",
    "timestamp": 1566756194,
    "score": 6,
    "keyword": "white director"
  },
  {
    "text": "Feeling lost on my Career choice - Should I quit Grad School and pursue a career in the outdoors?  \n\nHello Everyone,\n\nLong time lurker, first time poster here.\n\nI posted this same thread originally in /askacademia and someone pointed me in this direction thinking it would be a better fit for my question.\n\nI have been reading as many threads as I could find connected to my particular circumstance. I've decided to write you all here in hopes that I can gain some further clarity.\n\n**Quick background:**\n\nI am 26. I have worked for the last decade to get to where I am at now. I have always been an artistic individual and I started to take it seriously around my junior year of high school. I spent five years at community college because the tuition was cheap, it was close to home, and the facilities and community were amazing . I spent the last 2 years in high gear putting in 10-12 hour days 25/30 days a month. I got into a 4 year school, continued in high gear and finished up in a year and a half and got my BA. (They did not have a BFA when I was there) I came out with zero debt so that felt good. I always told myself that if I was going to get a MFA it was going to be paid for, not by me, but by the school on the merits of my talent.\n\n**Where I am now:**\n\nCurrently I am a first year graduate student working on my MFA at a pretty good University. I make ceramic sculptures - not pottery - and I paint water color as well as illustrate. Tuition is almost fully funded, except for a few units. This is a 3 year program and I would probably pay somewhere around 3k for tuition total which is pretty great. Living and food costs are my own to handle and I've figured out my own living situation that won't take me into debt.\n\nI came to grad school with the hope that it would push my work to the next level, would inspire thoughtful questions and I would receive harsh but constructive criticism. I thought I might want to be a professor as well.\n\nWhat I found was a pervasive ideology around what \"art\" is and that 'everything is art' Which I can intellectually understand, but as someone who prides themselves on technical skill along side their creativity this has been very difficult to accept. Most all performance art appears as a joke to me. Instillation art is questionable, although some of it amazing. There just seems to be a strong push against beauty and representation, and a strong push towards being confrontational and highly conceptual. Not inspiring by any means.\n\nThe professors that I have seen do not seem all that happy. To put it pretty simply, I can't say I would want to take their place. Teaching still interests me and I would love to do it in some capacity as good teachers have really changed my life for the better. Perhaps being a mentor is a better word than teacher. I've noticed that teaching is only a percentage of what you do - usually less than half - and there is tons of time spent in meetings and dealing with the bureaucracy of the university. So I am not inspired to push for that either.\n\nBeing a working artist and playing the game for gallery directors and their clients is not what I want to do. I'm not much of an actor and there is a fair amount of shmoozing involved.\n\n**What I've come to realize about myself:**\n\nI love the outdoors, I always have. If I wasn't working in the studio I was outside, hiking, backpacking, camping.\n\nAs an artist you spend an incredible amount of time indoors hunched over under florescent lights. Especially if you want to make a lot of good work. Not something I cared too much about when I was younger, but now its just not how I want to spend my life. I want to be outside as much as possible, I want to be physically active and remain healthy. I want to enjoy my youth and use my body.\n\nI want to serve others, be outside as much as possible, build strong community and continue to pursue health and wellness.\n\nNeither of these paths offer much money or job security. Aside from the professor route, but the job market is saturated and I'm not thrilled at the thought of being stuck in an institution, its just not a good fit for me culturally.\n\nSome outdoorsy careers/jobs that I've come across that interest me are:- Wilderness therapy guide\n\n\\-White water rafting guide\n\n\\-Backpacking guide\n\n\\-Wild land Firefighter\n\n\\-Camp counselor\n\n\\-Ski Instructor\n\n\\-Park Aid\n\n\\-Park Ranger\n\n\\-Railroad worker\n\n\\-Arborist\n\n\\-Landscaper\n\n\\-Tree planter\n\nIf there are any other outdoorsy jobs that you guys can add please let me know.\n\nMost of these jobs have been described as \"poverty with a view\" and I am okay with that. Health, happiness and being in control of my own time are my top priorities, not accruing material goods. My ultimate goal is to buy a piece of land and build a homestead/intentional community. I am a van lifer and alternative living spaces are highly attractive to me, from tiny homes and shipping container houses to natural buildings made of cob or hempcrete.\n\nI have a friend working as a Wilderness therapy guide and it sounds awesome. I have another friend that actually went through a wilderness therapy program as a participant when he was younger and he said I would be a great fit. Getting a job would not be all that difficult.\n\n**My dilemma:**\n\nI have found myself disenchanted with the prospective outcome after finishing grad school. I am not enjoying my time here and its a constant feeling, not some thing that shows up on tough days. I have worked for a large part of my life for this and I have attained exactly what I *thought* I wanted. Do I suck it up and spend the next 2 1/2 years potentially hating what I am doing, but at least I will have an MFA? Should I spend this time using up the last few years of my 20's on something I don't believe is all that worthwhile? Do I give up on my \"dream\"?\n\nDo I make a hard turn and change my trajectory entering into the outdoor field? The people working these jobs seem to be happier, they have a zest for life. Their interests and values seem to align closer with mine.\n\n**Formal question:**\n\nI am looking for anyone who has made a similar choice in their life - \"quitting\" on something they thought they were meant to do after working intensively to get good at what they do and completely changing their direction. How did things turn out for you? Are you glad you made the change? Did you wish you had kept with it? Are you happier now? More miserable?\n\nAny insight and thoughts are helpful.Thank you for taking the time to read this far.\n\nMuch Chi.\n\n**TL;DR:**\n\nShould I quit pursuing my MFA and re-invest my time into an outdoor career that I think would be more fulfilling?\n\nDoes anyone have a similar experience of quitting on something you have a heavy investment of time in and changing your trajectory? How did things turn out for you?\n\n**\\*\\*\\* If this is in the wrong section or if it could be moved to a section that would be a better fit please let me know this is my first post on Reddit.\\*\\*\\***\n\n&#x200B;",
    "title": "Feeling lost on my Career choice - Should I quit Grad School and pursue a career in the outdoors?",
    "subreddit": "careerguidance",
    "timestamp": 1546661258,
    "score": 4,
    "keyword": "white director"
  },
  {
    "text": "New Manager and co-worker are sharing feedback about team on speakerphone next to me. Any Advice? Hi All,\n\nFirst time poster here looking for some quick advice on my current situation.   I work for a large corporation where I have my own office.   Our group is currently going through a transition from our previous manager, whose role has been split into two.  One for development purposes and one for operational purposes.  During this transition, the new manager (who sits in a different state) is assuming the development role for our group and another co-worker (same position higher title) is assuming the day to day responsibilities of our team.  So to recap, there will be an operational manager(minimal interaction most likely, larger strategic thinking), development manager (sits in another state), and co-worker (office directly next to mine).\n\nRecently, I went out to the development managers site to lead a one of my project teams for a face to face discussion.  I included some time for the new development manager and I to meet.   We met for a 2 hour discussion and covered a range of topics.  Ways to improve in the current role, development opportunities, and current feedback about how the \"transition\" was going.  I was honest, open about how this is a crazy time ( i am assuming an addition 3 projects as colleague is going out on maternity leave) and was saying a am barely staying afloat but see and appreciate the road map they are laying out for the team.  She said i understand its a bit rough at the moment but we recently hired two new project managers who will start in \\~ month.   Talked about things i saw that could be improved and areas i wanted to work on.\n\nFast forward to a week ago, I am in my office and i hear my co-worked and development manager talking on speaker phone not noticing anything of it until i hear my name brought up.  The specific phrases that were used were, \" he came in here for 2 hours whining and complaining.  He said Don (previous manager) didn't tell me this and that and etc\"   Jon (another coworker, lower grade) said the same thing!. \"  from that point, i felt myself go white and left my office since hearing direct feedback you are not supposed to hear is a weird feeling to process.\n\nMy question to Reddit is this:   Clearly this is not an appropriate conservation for my \"actual\" reporting manger (development manager) to be having with my co-worker.  I do not believe you should be sharing feedback and essentially talking shit about your own team when you are the manager.    What do you recommend?   There is a caveat in that our area director is very much in tune with creating an excellent culture and is attuned to inclusion and team building.  She would not have this since she told us a while back these two women would be the best thing for our development!  turns out they just talk shit.\n\nHow would you approach this situation Reddit?  Trust is clearly gone with those two.   My current solution is to prove them wrong and improve in some areas they discussed but also that my time with this role is nearing an end.  Before this happened i was already passively looking for another opportunity, now it is active.\n\n&#x200B;\n\n**Edit:**\n\nThese conversations go on weekly on Wednesday's.  This has occurred now twice where I can uncomfortably hear these interactions.  I try to leave the office now\n\n**Edit 2: TLDR**\n\nTeam going through transition, new manager (remote) and co-worker(taking on more responsibility) in office next to me talk shit on speakerphone, share feedback that I' & others provided to them, can hear all conversations. Awkward",
    "title": "New Manager and co-worker are sharing feedback about team on speakerphone next to me. Any Advice?",
    "subreddit": "careerguidance",
    "timestamp": 1554410614,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "WSJ: Audit Watchdog Plagued by Internal Strife, Whistleblower Claims https://www.wsj.com/articles/audit-watchdog-plagued-by-internal-strife-whistleblower-claims/\n\nA watchdog tasked with protecting investors by policing audits of public companies has slowed its work amid board infighting, multiple senior staff departures, and allegations that the chairman has created a “sense of fear,” according to a whistleblower letter and people familiar with the situation. \n\n\nThe Public Company Accounting Oversight Board, set up by Congress after the Enron Corp. and WorldCom Inc. accounting fiascoes of the early 2000s, oversees accounting firms that audit companies worth in total trillions of dollars. The regulator is meant to ensure investors can rely on the financial statements of public companies by inspecting audits and taking action against accounting firms.\n\n\nLately, the board has struggled with internal feuding and personnel issues, say the people familiar with the matter. The regulator has issued 27% fewer audit-inspection reports this year, board data show, as senior staff positions remain unfilled for months.\n\n\nThe internal strife resulted in the filing of an eight-page whistleblower complaint with the board in May. The letter, which hasn’t been previously reported, said it was written by a group of current and former PCAOB employees. In August, the whistleblowers sent the letter to commissioners at the Securities and Exchange Commission, which oversees the PCAOB. A spokeswoman for the SEC declined to comment. \n\nAfter receiving the whistleblower letter, the SEC appointed Harvey Pitt, a former agency chairman, to review the PCAOB’s corporate governance, according to people familiar with the matter. Mr. Pitt declined to comment.\n\n\nArthur Levitt, a former SEC chairman, said he was concerned about developments at the regulator. “The PCAOB, depending on the people who are part of it, can be enormously important or it can be a totally worthless political jumping ground … my sense is it’s being politicized.”\n\nTorrie Miller Matous, a board spokeswoman, said Monday the PCAOB undertook a sweeping assessment in 2018 of its operations and has been working toward “a series of transformation initiatives to address systemic issues that exist across the organization.”\n\n\n“We have candidly addressed these changes with staff in a variety of ways, but recognize that change is not easy,” Ms. Matous said.\nThe PCAOB undertook efforts to refresh its agenda and image after a scandal erupted in 2017 involving the leak of confidential inspections data. A former board employee who passed the data to auditors at KPMG LLP was last week sentenced to nine months in prison.\n\nThe SEC in December 2017 replaced the PCAOB’s entire board after officials learned about the leak. The new chairman, William Duhnke, previously worked for many years on Capitol Hill under Sen. Richard Shelby (R., Ala.). Mr. Duhnke served as staff director for the Senate Banking Committee under Mr. Shelby.\nRepublicans had urged the SEC for years to give Mr. Duhnke the job, which pays about $670,000 annually. The compensation of board members, whose pay is triple the salary of the SEC chairman, has long made the PCAOB a destination for former regulators and public-company auditors.\n\n\nWithin months of arriving, Mr. Duhnke began pushing out longtime senior executives, according to the whistleblower letter and people familiar with the matter. The former executives, who included the board’s general counsel and its director of inspections, agreed to sign nondisparagement agreements in exchange for six months of continued compensation, the people said.\n\nSeveral former senior PCAOB officials contacted by the Journal in recent weeks confirmed they had signed the agreements and declined to be interviewed due to the deals.\nThe whistleblower letter said the regulator “is permeated by a sense of fear,” due to “the numerous terminations … [some] driven by retaliation.”\nAn associate general counsel at the board, Heidi Steiber, left the agency after objecting to the way terminations were done, the letter says. Ms. Steiber said the dismissals could “conflict with representations made to insurance carriers,” according to the whistleblower letter. The concern was that the board’s insurance policies required its leaders to consult with legal counsel before dismissing employees, which Ms. Steiber felt wasn’t done, people familiar with the matter said.\n\nMr. Duhnke has yet to replace some of the people he allegedly pushed out, but he has hired other staff. For example, Ms. Matous, a former communications aide who worked with Mr. Duhnke in the Senate, is paid more than $400,000 to lead an office that oversees media affairs, lobbying and small-business relations, according to two people familiar with her hire. Ms. Matous said her pay is in line with other directors at the board and was determined by the human resources office.\nMeanwhile, the board hasn’t had a permanent general counsel or enforcement director for 16 months. The board’s website shows around 50 permanent roles need to be filled, out of about 850. Ms. Matous said the number of open positions falls within its historical average.\n\nThe hiring process has bogged down as each of the PCAOB’s five board members gets a shot at interviewing candidates for top positions, the people said. The delays stem in part from the board’s own rules, which allow the chairman to pick the agency’s top officers but says the hires are “subject to the approval of, and made in consultation with, the governing board.”\n\n\nMr. Duhnke has clashed with other board members over hiring choices, the people familiar with the matter said. Ms. Matous said the chairman has sought to get other members to support key hires. “The board is close to making an offer to a candidate for the enforcement role,” she said.\n\n\nOne board member, Kathleen Hamm, wasn’t reappointed to the board last week. The SEC said Friday that Rebekah Goshorn Jurata would take over for Ms. Hamm. \n\n\nMs. Jurata, 37 years old, worked most recently for Andrew Olmem, a White House official who worked under Mr. Duhnke when the two men served on the Republican staff of the Senate Banking Committee. Ms. Jurata, who also has worked at the SEC, couldn’t immediately be reached for comment.\n\n\nThe board has also said it would change how it conducts and communicates the results of its inspections of audit firms. The PCAOB has issued 82 inspection reports this year compared with 113 for the same period last year, according to its website.\n\n\nMr. Duhnke said in October 2018 that the PCAOB needed to speed up how soon it reports inspection results, while also harping less on “failures” that inspectors observe. The board is drafting a new type of inspection report that will be more useful to investors and audit committee members, while allowing the regulatory staff to issue its reports more quickly, Ms. Matous said.",
    "title": "WSJ: Audit Watchdog Plagued by Internal Strife, Whistleblower Claims",
    "subreddit": "Accounting",
    "timestamp": 1571152837,
    "score": 21,
    "keyword": "white director"
  },
  {
    "text": "From CIB to Big 4 Hi all, \n\nI just wanted to collect some opinions on my current situation, in case anyone has already gone trough something similar.\n\nA few months ago, I joined a Big 4 in a non-client facing position. My primary background is in corporate & investment banking where I was client facing. The reason that pushed me to leave my former job were more practical (low salary, limited progression, questionable environment, high turnover). Yet, during my time in banking, I kept reaching one high after another leading to constant positive feedback from clients, senior management, country heads etc, awards etc..My local management (middle-management) seemed however underwhelmed and didn't have the same level of enthusiasm for some reason.\n\nI thus decided to leave my former banking position to move into this Big 4 one ... I deem it to be the worst mistake I could have ever done career-wise. I'm almost 6 months in and although I understand there is a reasonable adaptation time, it seems I'm not adapting. I went from being a high-achiever in a client-facing role, to an incompetent individual in an internal role. \n\nThere are no procedures and processes in place. One day it's black, the next it's white. You get ratty responses from contractors offshore, local managers and other stakeholders. Limited training. When you ask a question, it's either \"I don't have time\" or \"I don't know\". No one cares how you're doing or progressing as a new comer. You're being given a project with incorrect information which you have to feed to other stakeholders and thus end up losing credibility. \n\nIt's a headache. I've dealt with demanding CFOs/directors/MDs in banking and no one ever said they didn't have the time or sent me a ratty response. I managed to build relationships with higher management very quickly in banking, which does not seem to be happening here. The job in itself is not hard and certainly does not even compare to the amount of pressure I had in banking. This is nothing. However, the hostile atmosphere is hard to dealt with. The job is extremely boring as well. I'm depressed and certainly don't recognize myself. I lost all of my confidence, I'm not the bubbly/shiny person I once was in banking. I cry every day at work, which is not normal as I probably cried 3 times during my 4 years prior to this.\n\nHas anyone ever moved from industry to Big 4 to realize they made a mistake? Was it easy to move back into industry?\n\nThanks.",
    "title": "From CIB to Big 4",
    "subreddit": "Accounting",
    "timestamp": 1566237585,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "Racism and sexualization I experienced at Child Care Job Racism and sexualization I experienced at Child Care Job\n\nI’m a mixed black woman living in a very white Midwestern state. Recently, I was a child care worker at a super white and Trump supporting day care (didn’t know it when first applying for job) and I have never experienced such blatant racism! A lot of the white People were shocked to see I was working there and they reacted by ignoring me, giving me a dirty look to my face, talking about me in front of my face, and watching my every move to make sure I didn’t steal, lie or abuse the kids. They acted like I was the first black person they ever interacted with. They were envious I was in graduate school and ate healthy  also. Everytime a kid would cry, a worker would rush to my room and ask the kid what was happening. I felt like I had to always smile and not show any negative emotion like anger in order to make them comfortable and not fearful. I swear that job added to my ptsd.  One mother of a child saw me, ignored me, then asked another worker who was going to be looking after her baby (definitely implying she didn’t want me to). Also the child care workers told me to make sure I wore conservative clothes and to not flirt. While some of the other workers came in yoga pants and flirty and the managers didn’t say anything. They assumed I would be hypersexual and try to steal husbands or something! Then the child care director tried to figure out my insecurities and make me feel inferior/insecure by bragging about blonde women with blue eyes then watching me to see my reaction. It’s like she didn’t like seeing how I was happy, successful and black at the same time.\n\nThen after working for some time, a lot of the white fathers of the children started sexualizing and had crushes on me which made the white women more mad. What made me quit, though, was when a couple assumed I had abused their kid because she all of the sudden started having accidents (peeing). When his daughter was probably having accidents because of their marital concerns—- the husband cheated on his wife with the other day care workers and was trying his hardest to get with me. The father was also a police officer. And then the white co-workers became envious the police officer liked me because they all wanted him so they got even meaner and tried to sabotage me. I am betting they were telling the police officer lies about me being dangerous or crazy or something which is another reason the girl’s parents assumed the worst—that I was abusing her. \n\nWhat confused me was he was obviously racist (he didn’t acknowledge the other black woman worker) but acted like he was in love with me. but I think he was only nice to me because he thought I was attractive. Or then i wondered if it was a colorism thing but I doubt it because I was like the same skin color as her in the summer. I wonder if they were stereotyping me based on jezebel stereotype or sexualized mullato (although I doubt they knew I was mixed)?\n\nI also had no one to turn because the day care director was the most racist of all and would direct her workers to watch me. She would let her white workers come in late but was hard on me if I did. \n\nI feel hurt and angry Thinking about my experience at this job especially so because it confirmed that white people reject me, see me as other, and as a threat no matter what I do and who I am.\n\nWorst job. Should have made a complaint  for discrimination and reported them. Anyone relate or have similar experiences while working at child care?\n\nEdit: As for the parents assuming I abused their kid.. there was definitely racism and stereotypes going on there. But I also have to say, during that time, I was very emotionally unstable. I had just moved out of my abusive parents’ Home out on my own, financially independent for the first time. I was victim blamed from my family for my dad’s sexual abuse so I didn’t have any support system. Also, I already had trauma reactions from past racial discrimination. So being around all these white People made my ptsd alive and I was super hypervigilant, had major mood swings, was dissociating, and would sometimes be standoffish and other times friendly. It’s important I mention this because this played a factor in my treatment. But I still wouldn’t have been this mistreated if I was white. And I know this because there was a white girl that started right after me who was often angry, yelled at the kids, and was emotional.. but they didn’t care. And they weren’t watching her constantly or checking her kids in the room frequently.\nAlso, I forgot to mention, when I first applied the director almost was warning me about the location. Because she said, “this location is very Lilly white. Maybe you would prefer our other more diverse location since you are going to graduate school for social work.” Basically this woman segregated her child care centers. One was all white and the other was diverse. I was the first black woman to work at her “white” center.",
    "title": "Racism and sexualization I experienced at Child Care Job",
    "subreddit": "blackladies",
    "timestamp": 1548154953,
    "score": 61,
    "keyword": "white director"
  },
  {
    "text": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S. Hey all! I’m a producer for Empowered Health, a new podcast that is aiming to demystify women’s health.\n\nWe just put out the first episode of our two-part series on the maternal mortality crisis. Episode one explores how race plays a role in this crisis– it becomes clear our culture isn't doing enough to protect black mothers. Black women are three to four times more likely than non-Hispanic white women to die during childbirth. That’s even after adjusting for socioeconomic factors, like education and income.\n\nAs more than one researcher said to us, the birthing crisis is the canary in the coal mine of women's health. It is a problem of women not being listened to, not being respected and being disempowered during a time in life when they should feel entitled to good care and a personal feeling of empowerment, feeling full of feminine power and purpose.\n\nDr. Neel Shah, the director of the Delivery Decisions Initiative at Ariadne Labs, breaks down how medical students are trained to be biased and how that contributes to this problem. Fatima Dainkeh of YWCABoston helps us understand actually talking to black mothers is a good place to start and that a day-long workshop on bias isn't going to cut it. Midwife Ebony Marcelle shares how she's shaped her care model to better serve African American mothers. And, Dr. Mary-Ann Etiebet, the executive director of Merck for Mothers, looks at the global initiative she heads working to integrating the voices of black women into maternal mortality and morbidity.  \nFigured this group might be interested in this episode, here's the link:  \n\n[https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392](https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392)\n\n(links to other streaming platforms on our website www.empoweredhealthshow.com)",
    "title": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S.",
    "subreddit": "blackladies",
    "timestamp": 1555987676,
    "score": 29,
    "keyword": "white director"
  },
  {
    "text": "Rant: I'm getting fucked by my new employer and I just need to vent. Hi r/blackladies. I want to start off by thanking you all for creating a great safe space. I used to engage with this page a lot more in undergrad but my old account was compromised earlier in the year.\n\n&#x200B;\n\nI really think I am getting fucked by my new employer. It's going to be a long one.\n\nFirst and foremost: I am getting my master's in museum studies. I am 23 years old. I don't have a lot lived experience and have only worked part-time summer jobs\n\n&#x200B;\n\nLast summer, I did an internship at a museum close to my hometown. When I was there, I really enjoyed the staff and the practices at the museums. The thing I liked the most was the fact that staff was younger because most museum staffs are old white women and their board of directors are even older white men (like 70 is young).\n\nThis is my last semester in my program. Due to mental health issues I had this school year (depression and mental fatigue), I was not in a rush to start a new museum job. I wanted to get settled back at my parents house, start working with a therapist, and get mentally fit enough to look for museum jobs.\n\nHowever, my adviser told me about a new position at the museum I did my internship at. She told me to apply. Now, it is important to describe my adviser. She's very passionate, but is overbearing and can be rude at times. She has the \"hustle hard, sleep when you're dead\" kind of mentality. When I tried to explain to her that I was dealing with mental fatigue due to going from undergrad straight to grad school, she didn't understand. \"I didn't have that issue. I think you work hard, don't let it affect you\" were her words to me.\n\nSo for a week, she kept hounding me about applying to the museum. I applied to appease her, but also because the position wasn't that bad. The position was part time with flexible hours. I knew I wasn't going to be full time, but I did not want to work full time until the end of this year or start of next to give my brain a break and so that I would have time during the work week to start talking to a therapist. I liked that the museum was close enough to my parents house, so I could live with them and have a security net until I get aged off of their insurance. Also, there were not many positions opening in museums and other institutions near my parents house. I'm not really in a good mental health space to pack up my whole life to move to a different state or far away from my family. \n\nI filled out the application, got an interview, and was offered the position. Here is the first kicker: the HR representative offered me minimum wage ($9.45). I was immediately taken aback, but I started justifying it in my head. The museum has been having some economic issues and cut down on their staff a couple of years ago. They are currently campaigning for a millage to be put on the ballot, so I figured if the millage was passed, they could probably offer more money later on. Another thing was the way the HR person phrased it. I thought that it was a flat rate and the job posting didn't have pay ranges. I also thought you could only negotiate salaries. So I said yes to everything and accepted the position.\n\nHere is kicker number two. My supervisor for my internship-lets call her Susan (she is not going to be my immediate supervisor for this position)  is a graduate of my program and still is communication with my adviser. My adviser called me into her office a couple of days ago to tell me she spoke with Susan. Susan spoke to HR and HR told Susan that I could have asked for more money considering my degree and experience. Then the HR person started laughing and apparently jokingly said \"it's good that its that low!\" My adviser told me that I need to be more assertive and in a couple of months I should ask for a raise.\n\nI feel like it was unprofessional for HR to tell Susan that I accepted such a low wage. I also think it was unprofessional for Susan to tell my adviser what happened. I get that my adviser was trying to help me, but through my time in the program, she has always minimized my feelings, and paints me to be this painfully shy, non-assertive person. I'm not super talkative or outgoing mainly because I'm the only WOC in my program and the youngest person in program. Most people who get their degree in museum studies are older white women who are career transitioners. I don't have a lot in common with my cohort and they aren't the friendless of people. So here again, my adviser is painting me as someone who can't stick up for myself.\n\nHad I known I could negotiate my hourly wage, I would have done so. Now that I do know, I am really tempted to just call HR and ask to renegotiate considering that the museum was willing to offer more and I'm not getting benefits.\n\n&#x200B;\n\nIn conclusion: to the younger readers of r/blackladies who are just starting in your field, please take my experience as a learning moment. You can negotiate anything. If you have the ability to attend a salary negotiation workshop, do so.\n\n&#x200B;\n\n**TL;DR: I accepted a low pay rate at a new employer not knowing I could negotiate hourly wages and the way I found this out was through unprofessional means.**\n\nQuestion: Should I call HR ASAP? I still haven't sent in my offer letter. I have a 90 day probation, so should I wait until the end of probation? I think its important to note that the only bills I will have are cell phone,co pay for the therapist, and gas thanks to the graciousness of my parents. I will have to start paying back my student loans at the beginning of next year.",
    "title": "Rant: I'm getting fucked by my new employer and I just need to vent.",
    "subreddit": "blackladies",
    "timestamp": 1554325078,
    "score": 13,
    "keyword": "white director"
  },
  {
    "text": "Asian Art Advocates Accuse the Shed's Kung-Fu Musical of 'Yellow-Face Casting.' But Its Director Says the Character Is White",
    "title": "Asian Art Advocates Accuse the Shed's Kung-Fu Musical of 'Yellow-Face Casting.' But Its Director Says the Character Is White",
    "subreddit": "asianamerican",
    "timestamp": 1564010168,
    "score": 6,
    "keyword": "white director"
  },
  {
    "text": "At the workplace, are Asians only comfortable around other Asians? Just curious. Reason why I ask was because I recently started a new job at a marketing firm and there were several other new employees who started on the same day. One of them happened to be a young Asian female who looked around my age (mid 20's) and pretty much all of the employees in our office are white with a small mix of blacks. On my first and second day, I made the efforts of trying to introduce myself to those who sat around me (although my director already introduced me to some of them) excluding the entire section of people sat 2-3 rows ahead of where I sit.\n\nThe Asian sat at the 3rd row ahead and on Friday, she came all the way to my desk and asked if I was Chinese (I'm Korean btw), saying that 'I am new here too', 'did you grow up here?' blah blah and saying how she was happy to see another 'Asian' in the office (I felt that was weird) can you imagine another race, like a black employee for example, going up to another new face employee who is also black and saying, \"it's good to see another black brother/sister here in the office?\" it's just weird and not right.\n\nI got an automatic assumption that this Asian female employee only feels comfortable around other Asians, she hardly interacts with the employees who sit around here since I can tell from a distance and was quite surprised how she came up all the way up to me out of nowhere and started to introduce herself with a bunch of questions like that. I don't know, is it just an 'Asian' thing? Am I overreacting to this situation or what?",
    "title": "At the workplace, are Asians only comfortable around other Asians?",
    "subreddit": "asianamerican",
    "timestamp": 1556504996,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "History of feminism the way they don't want us to know! This is the speech the Cambridge feminists did not want anyone to hear. Its Elizabeth Hobson's speech from the Justice 4 Men & Boys event yesterday. Published with her permission.\n\nHello and welcome to The History of Feminism, I want to make two disclosures before I begin: firstly, that this lecture will concentrate on the Western world – particularly the Anglosphere. I am not suggesting that, that’s where feminism’s boundaries reside or denying its existence elsewhere but it does start here and here is where my real expertise lie. And secondly: this may come as a surprise to you but I am not a feminist. I am an ex-feminist but after studying the movement, I struggle to see how any reasonable person could know what I now know and be anything other than opposed to it. I’d like to thank the powers that be at Cambridge University for refusing to bow to pressure from the mob and allowing these talks to go ahead and I’d like to condemn the emotional reasoning of those who would have stopped them. The purpose of further education is not to make people feel comfortable, it’s to challenge preconceived ideas and to build the capacity to meet challenging concepts head on and to grow from those experiences. Universities should be arenas wherein students build resilience, tolerance and dignity but increasingly activists are subverting these spaces to feed anxiety, black and white thinking and hysteria within their communities which is harmful to the search for truth that they should be engaged in – and harmful to the individuals that they claim to want to protect (including themselves). So, finally, thank you to everyone sitting here now: to those who’ve come in support of our work, those here out of curiosity, and especially to anyone who’s expecting to be offended, yet intending to engage because that shows some strength of character!   \n\nBefore I get stuck into the recorded history of feminism, I need to take a moment to illuminate the biological roots of the movement. Human beings are a gynocentric species – this means that we prioritize the needs and well-being of women over men. This is an evolved instinct that came about as a result of women being the limiting factor in reproduction – ie. women have a much lower ceiling on how many offspring they can physically produce – and in small communities that are subsisting this makes them highly important because they potentially hold the key to whether or not the collective will survive at all. This is why we traditionally send only men to war, this is why we have the “women and children first” Birkenhead Drill, this is why people are more likely to put themselves at risk to save a woman in danger than a man – and it’s why we have feminism. Feminism has taken our gynocentrism and weaponized it. \n\nMen’s role in this evolutionary sense is to act as a genetic filter – both to mitigate gene replication errors (ie. Preventing less successful combinations multiplying by barring many men from reproducing) and to produce and retain genetic recombinations that enhance the fitness of offspring. To these ends, male fitness is constantly policed to ensure that women’s standards are met before they gain sexual access – which is why far fewer men than women reproduce.  Because the pay-off of carrying particularly successful genes is so much greater for men (women will likely have the opportunity to reproduce if their fitness is moderate, men may well not), evolution gambles with male genes. This results in very different bell curves for men and women in terms of IQ and physical and psychological health, with men being over-represented at either end of the distribution (particularly intelligent/healthy or unintelligent/unhealthy) and women clustering around the middle. Feminists focus on the apex of male achievement to prove that men enjoy greater success than women (whilst ignoring the biological reasons that catapult a minority of men to the stratosphere) and on the acts of the most malevolent minority of men to generalize their patterns of behavior as emblematic of masculinity (whilst ignoring the fact that the very demographics that preoccupy them show that what is emblematic of masculinity is actually variability).  \n\nSo, human beings have always valued women more than men and been more critical of men than women. These were necessary instincts in tribal communities but they have been manipulated to privilege women to the point of dysfunction – and this began with the development of proto-feminism, which arose in the late Middle Ages. Queen consort of France and England, Eleanor of Acquitaine spearheaded a movement within her court to subvert the chivalric code (which had traditionally governed relations between knights and lords and the general public) to regulate the behavior of men towards women. These women initiated a system of romantic feudalism wherein noble men were under irresistible pressure to identify a lady as midons (my lord) and to submit to her will and delicately accept any scorn that his midons saw fit to extend to him. Eleanor established Courts of Love in which she and her noble women would administer “justice” in romantic disputes. Not only may many men in particular recognize this state of gender relations – but the modus operandi that Eleanor and co used to achieve their supremacy is entirely familiar: they generalised about all men based on the poor behaviour of a minority, asserting that women needed protection from men’s violations, and they pushed forward a narrative of women’s moral superiority, justifying female dictatorship. Within 200 years, Eleanors’ ideas had spread and saturated throughout Europe and throughout the class system. \n\nLa féminisme proper was born in the revolutionary France of the late eighteenth century – the political force first, the term around half a century later. In 1791, Olympe de Gouges published The Declaration of the Rights of Woman and the Female Citizen in response to the Declaration of the Rights of Man and of the Citizen. By publishing this document, de Gouges hoped to expose the limitations of the French Revolution in the recognition of women’s rights and to initiate changes in the Declaration of the Rights of Man to include sex equality. De Gouges opened her Declaration with the quote, \"Man, are you capable of being fair? A woman is asking: at least you will allow her that right. Tell me? What gave you the sovereign right to oppress my sex?\" [close quote]. In the preamble, de Gouges mirrors The Declaration of the Rights of Man, explaining that women, just as men, are guaranteed natural, inalienable, sacred rights - and that political institutions are instituted with the purpose of protecting these natural rights. She closes the preamble by declaring that \"the sex that is superior in beauty as it is in courage during the pains of childbirth recognizes and declares, in the presence and under the auspices of the Supreme Being, the following Rights of Woman and the Female Citizen.\" [close quote]. She was one of a small number of women beheaded for treason during the revolution. \n\nCharles Fourier is credited with having originated the word \"féminisme\" in 1837. A founder of utopian socialism and a slightly later supporter of women's rights, he believed that all jobs should be open on the basis of skill and aptitude rather than sex segregated and that traditional marriage could potentially hurt woman's rights as human beings, he himself never married. Fourier is believed to have influenced Karl Marx who argued as early as 1844, in his Economic and Philosophical Manuscripts, that women’s position in society could be used as a measure of the development of society as a whole. In The Communist Manifesto, Marx and Friedrich Engels celebrated the dissolution of the bourgeois family, with an erosion of the status of the father already taking effect as women entered the workforce. This, they believed, would lead to “a higher form of the family” in which women would be the true equals of men. Several years ago, at a FiLiA debate I heard Sheila Rowbotham explain that nobody could understand feminism without reading this book. International Women’s Day itself, has Bolshevik roots. Clara ‘The Grandmother of German Communism’ Zetkin and Rosa Luxemburg, at the Socialist Internationale in 1910, advocated for a Women’s Day but the date was not set in stone till 1921 when the USSR officially adopted March 8th which was selected to commemorate a specific date that led to the Russian Revolution. Specifically, a 1917 workers strike at a weapons factory in Petrograd. The women workers strike that modern feminists claim was the inspiration for International Women’s Day did not start until March 9th. \n\nMoving to the United States, in the pioneering Declaration of Sentiments from Seneca Falls in 1848 (generally taken as the seminal text of the first wave of feminism - though I would argue that it’s actually the second after de Gouges declaration) the claim was made that “The history of mankind is a history of repeated injuries and usurpations on the part of man toward woman, having in direct object the establishment of an absolute tyranny over her.” This is not justified by the history – of men risking their lives both in work and war to provide for and protect women, their families and their homes. Granted, the text highlights a series of injustices that women were subject to, however such a claim remains myopic and misleading. Under coverture legislation for example, while husbands did become the legal owner of all family assets, in reality, this came with responsibilities, and wives were not left entirely devoid of rights – their rights were simply different. Husbands could be criminalised for failure to keep their families as well as he could reasonably be expected, wives’ permission was required to sell any houses owned by the family – and actually if a member of a man’s household ran up debts, he was legally responsible for their repayment. Yes, women deserved to be granted various rights – but so did men, who did not deserve the derision they received from first wave feminists (including Christabel Pankhurst who notably explained in her 1913 book The Great Scourge, that men were “little more than carriers of venereal disease”). Furthermore, in his 1913 volume ‘The Fraud of Feminism’, Ernest Belfort Bax identified “two distinct sides” to feminism: an “articulate political and economic side embracing demands for so-called rights”, legitimately – and “a sentimental side which insists on an accentuation of privileges and immunities”. There is no mention in The Declaration of Sentiments (or any first wave texts) of the privileges and immunities enjoyed by women, nor any injustices faced by men.  \nThe women’s suffrage movement in the U.S. was tainted by racism. Although an African-American abolitionist, Frederick Douglas, did take to the stage at Seneca Falls – no African-American women are believed to have been present. Furthermore, feminist heroines like Elizabeth Cady Staton who organized the meeting at Seneca Falls and was a co-author of the declaration embraced her racism explicitly, characterising black men as inherently inclined towards rape, throughout her career. She also argued vehemently against the 15thAmendment (that would extend the vote to African-American men), claiming that it would degrade women to follow black men into the franchise.\n\nThe Women’s Social and Political Union – or Suffragettes – in the U.K. were not afflicted by racism. They actually took pride in the strength of support for women’s suffrage throughout the British Empire. The night before the coronation of George V in 1917, a demonstration was held to demand the right for women to vote, which featured an “Empire Pageant” featuring representatives from India, Australia, New Zealand, South Africa and the West Indies – and Indian Princess, Sophia Duleep Singh, was a major donor. They were not, however, devoid of bigotry – and I don’t just mean towards men – British Suffragettes held a special contempt for the working classes. Not only did they fail to rally behind the truly progressive call for universal suffrage, preferring to campaign for women to be able to vote “on the same terms as men” (ie. with property qualifications) but they embarked on a campaign of terrorism that may have hurt some middle and upper-class opponents (or insufficiently active supporters) financially but would put working class lives in both direct and indirect danger. They smashed shop windows and burned or bombed 17 industrial premises, including a lino factory, a laundry, woodyards and freight yards. They also targeted the café at Kew Gardens with an arson attack – destroying a business that was owned and staffed by women and destroying their livelihoods in a pre-Welfare State society. When the proprietor went to the WSPU to complain, she was told that she was taking ‘too personal a view of the matter’ and that the staff would no doubt be glad that they had lent support to the women’s cause.  96 homes were targeted. One was that of the Chancellor of the Exchequer, Lloyd George, which was empty under renovation. The bomb exploded just before his builders were due to start work so narrowly avoided injuring them, it did however destroy tools which were provided by the men themselves – who may well have ended up on the streets or in the workhouse as a result of their loss. Other houses – though the Suffragettes insisted that they only targeted them when empty – actually contained staff who were put at risk. Sulphuric acid and phosphorus in letter bombs caused a number of postmen to suffer severe lung damage and/or burns. A bomb planted outside the Bank of England would, if it had not been defused by a policeman, have gone off in a busy commercial area mid-afternoon. A bomb at Lime Street station, Liverpool, was packed with nuts and bolts to maximise harm. A bomb containing 24 cartridges of gunpowder was placed in the toilets of a theatre to go off during a matinee performance. The congregation at St John’s, Smith Square, had to put out a bomb containing 5½lb of gunpowder. Another bomb was chucked into a full Territorial Army barracks. The jockey whose horse ran over Emily Davison at Epsom in 1913 (Herbert Jones) suffered flashbacks to the event throughout his life until he committed suicide in 1951. The idea of these women as noble heroines is an outrage to any right-thinking person – and the idea that their terrorism led to the extension of the vote is implausible. They dropped their suffrage campaign entirely with the onset of WW1 (and a £20,000 grant from the government) and embarked upon their white feather campaign, for which they have further blood on their hands. Universal suffrage was won by quietly committed lobbying from the suffragist movement – and the sacrifice of so many working-class men in the war.\n\nTo understand the evolution of feminism from first to second wave, we need to look at the birth of critical theory. Critical theory emerged from the intellectual collective known as The Frankfurt School. They began their mission in 1923 with the establishment of the Institute for Social Research at the University of Frankfurt. Initially, founder Felix Weil and director Carl Grunberg, along with fellow orthodox Marxists, tasked themselves with making Marxism a viable alternative economic system to rival capitalism but from 1930 under, new director, Max Horkheimer the focus shifted to an examination of the culture out of which Capitalism flourishes, in order to subvert it to accommodate Marxism. Thus critical theory was established. The group moved its activities to the U.S. in 1933, in response to the rise of Hitler, to become associated with the University of Columbia in New York. Here, Erich Fromm pioneered the marriage of Marxist theory with Freudian theory and characterised the family (which they rightly identified as the building blocks of Capitalism) as repressive and pathological. Herbert Marcuse’s Eros and Civilization was published in 1955 in which a society based on free love and no work that liberated the human natures (that he felt were being repressed by Capitalist society) was proposed. This book was a major channel through which neo-Marxist ideas fed into various liberation movements in the 1960s, including of course feminism. Of feminism, Marcuse claimed that “the Women’s Liberation Movement is perhaps the most important and potentially the most radical political movement that we have.” Marcuse’s sentiments were echoed by Shulamith Firestone, founder of the Redstockings collective, who published The Dialectic of Sex in 1970, another utopian (or dystopian, depending on your perspective) radical classic that argued that the domination of men as a ‘sex-class’ over women as a ‘sex class’ (or “underclass”) was based in biology which needed to be overcome through advances in medical science that would liberate women from the “barbaric” practise of childbirth. She held the nuclear family, which she labelled a tyranny, in contempt and advocated for rationally constructed non-permanent bonding relationships between people who voluntarily undertook their upbringing in which “the dependence of the child on the mother (and vice versa) would give way to a greatly shortened dependence on a small group of others in general”. Kate Millet’s sister recollected a consciousness raising group that she attended with Kate in the New York of 1969 that opened with a back-and-forth recitation:\n\n“Why are we here today?”\n\n“To make revolution”\n\n“What kind of revolution?”\n\n“The Cultural revolution\" \n\n“And how do we make Cultural Revolution?”\n\n“By destroying the American family”\n\n“How do we destroy the family?”\n\n“By destroying the American Patriarch\"\n\n… it goes on, but you get the gist! Feminism became the leading vanguard in the subversion and desecration of a comparatively decent, prosperous civilisation. Their battle in this culture war was the decimation of the family and they would achieve victory in that battle by destroying men – a process they would enact by attrition of the esteem in which men were held, their identities and eventually their rights. \nA host of extreme misandrists poured forth bile during this period, thinkers like:  \n\n• Andrea Dworkin (“Under patriarchy, every woman’s son is her potential betrayer and also the inevitable rapist or exploiter of another woman.”),\n\n• Catherine Mackinnon (“Male sexuality is apparently activated by violence against women and expresses itself in violence against women to a significant extent.”),\n\n• Valerie Solanas (“to call a man an animal is to flatter him”),\n\n• Robin Morgan (“I feel that 'man-hating' is an honourable and viable political act”)\n\n•  Germaine Greer (“Men are the enemy”),\n\n• Shulamith Firestone (“all men are selfish, brutal and inconsiderate”) \n\nMarilyn French (“All men are rapists and that’s all they are”).\nHowever, I think it’s well worth looking at the more apparently benign representatives of the movement and unpicking what they had to say. In 1970, Irina Dunn coined the phrase “A woman needs a man like a fish needs a bicycle”, which was popularised later by Gloria Steinem. Referring to whom, I ask? To the countless generations of men who had endured the dirtiest, most dangerous and thankless labour to support their families? To their relatively recent male ancestors who fought for women’s suffrage (such as Jeremy Bentham and Henry Fawcett) and the elected representatives who would ensure such legislation passed (such as John Stuart Mill, whose male constituents elected him on a platform including female suffrage)? To their fathers who may well have participated in World War Two to protect their societies and families? To their brothers? Friends? Lovers? I believe Gloria Steinem had many of those – and was supported morally and financially by a number of them too. It may sound cute and catchy but it’s both contemptibly narcissistic nonsense and reprehensibly offensive.\n\nSecond wave feminism saw campaigns for equal pay which was realised in 1963 with The Equal Pay Act in the U.S. and in 1970 in the U.K. with our Equal Pay Act. It is, of course, entirely fair to legislate against malicious sex discrimination but, as we can see from the landmark case that led to Barbara Castle implementing the U.K.’s Equal Pay Act, the nature of the acts is far more expansive, responding not to simply the same jobs but to “work of an equal value”. The Ford Dagenham machinists strike in 1968 followed a re-grading exercise by Ford who classified sewing seat covers for cars (predominantly performed by women) as less skilled than jobs on the production line (largely done by men), resulting in a fifteen per cent pay disparity – and the court to which the case was referred found in Ford’s favour. There was no sex discrimination in this famous case, simply fair pay for different roles, but feminist activism continues to force the hands of employers not to make rational economic gradings but to ensure that men and women go home with increasingly similar pay packets regardless of relevant factors, and hey it has almost certainly led to less pay for Patriarchs, weakening their ability to provide for their families and putting stress on their relationships so it’s a win-win for feminism.\n\nSecond wave feminists also fought for access to contraceptive pills and abortions. The pill entered the U.S. market in 1960 but it wasn’t until 1972 there that it was made available to single women and, previously being at the discretion of individual medical practitioners in the U.K., it was incorporated into the National Health Service by Barbara Castle in 1974. This has led to far greater choice for women in terms of life paths, more sexual freedom and better physical health outcomes – and yet some have experienced a historically new pressure to be sexually active and a corresponding ennui in response to their sex lives, whether they believe they’re lacking or they fail to find meaning in casual sex. Abortion was legalized in 1967 in Scotland, England and Wales and found to be a constitutional right in 1973 in the U.S. There has always been a proportion of women who have killed their babies, bodies of new-borns believed to have been suffocated at birth have often been found behind Roman villas and prior to the act women turned to untrained practitioners who would administer folk-medicines or insert knitting needles into the womb through the cervix and obviously medicalised abortion up to a certain point is more humane for both the unborn child and the mother – and far safer for the latter. However, the callousness with which feminist activists typically have and still do approach the subject shows no concern for the sanctity of human life and precious little for the psychological well-being of the women who are told that expelling a “clump of cells” is a liberating act that will have no deleterious impact on her whatsoever (yet alone any sympathy for the men involved).\nA concerted struggle, on the part of radical feminists, began against pornography during the second wave. Feminist campaigners like Andrea Dworkin and Catherine Mackinnon joined forces with the religious right to raise concerns about trafficking and coercion in the industry and claimed that men’s consumption of porn led to increased risk of sexual assault and rape for women in free societies, as well as diminishing their capacity to be viewed as full human beings. In the U.S., several states enacted local ordinances that intended to treat porn as a violation of women’s civil rights and to allow women who believe they have been harmed by porn to seek damages in civil courts. The Dworkin-Mackinnon Ordinances were opposed as a threat to women’s freedoms by sex-positive feminists such as Camille Paglia and Wendy McElroy and were eventually shot down as violations of the First Amendment.\n\n The third wave of feminism emerged in the 1990s. It is characterised by intersectionality. Rebecca Walker, one of the founders, explained that “Feminism, in order to stay relevant, had to become about more than gender equality.” In an effort to be more inclusive, third wavers have embraced the grievances of – well, anyone who will identify straight white men as the problem. With literally no “rights” to be won, feminism became increasingly navel gazing – or more specifically a little lower – and obsessed over the minutiae of female existence in the modern Western world, finding oppression and abuse everywhere – from the make-up aisle to the bedroom. On university campuses posters were going up with the Ms. magazine study statistic that one in four college women was the victim of rape or attempted rape. This feminist lie was concocted by Dr Mary Koss who broadened the definition beyond any reasonable limit and in defiance of the 73% of her apparent “victims” who did not classify their experiences as rape. Take Back the Night Marches were growing, with participants chanting “2, 4, 6, 8, No More Date Rape” and giving emotional monologues about mistreatment at the hands of men. A moral panic was underway that still resonates darkly today. If Paglia, McElroy and their sex positive cohort thought that they had won the war for the hearts and minds of liberated young women in the 1980s, they were to be dramatically disproven just a decade later by an anxious and vulnerable generation of feminists. \nIn 1993, the Duluth Model was created in Duluth, Minnesota, founded by Ellen Pence (not, I believe related to Mike but certainly a good reason for his rule…). Used in all U.S. states (although recently seriously weakened by Donald Trump) as well as 17 other countries (including the U.K.), The Duluth Model is a gendered theory based on feminist beliefs. It contends that men’s violence towards women is based on a sense of entitlement arising from being part of the privileged ‘sex-class’ in a Patriarchy. Moreover, it expands the definition of domestic violence to include all manner of behaviours – from threatening to leave her or commit suicide to displaying weapons to making her feel guilty to making big decisions to giving her an allowance… It’s a mix of both clearly abusive behaviours and behaviours that exist in a very grey area that could conceivably be part of fairly healthy relationships. There is very little room left in Duluth Model theory or indeed the agencies that employ it for male victims of domestic violence, especially where it’s perpetrated by women, and it is a recognised phenomenon to see male victims end up in Duluth-inspired abuser intervention programmes that teach them that their masculinity is problematic. Erin Pizzey (founder of the first U.K. women’s shelter) describes the lead up to such instances using the acronym: DARVO. It stands for ‘Deny, Attack, and Reverse Victim and Offender’, she says that “A particular trait of women abusers when confronted with their behaviour, for example by the police, is to turn the tables on their victim by claiming to be the victim themselves.”… A police force informed by Duluth, of course, is inclined to believe her.\n\nAnd now a new wave of feminism appears to be quickening, with a schism between older third wavers and a new generation. Rene Denfield writes that current feminists “promote a new status for women: that of the victim” while Naomi Wolf laments that a substantial segment of modern feminism is devoted to victimhood. \n\nIn recent decades feminists have successfully promoted the idea of 'Believing the victim,' in cases of alleged violence, harassment or sexual misconduct against women - regardless of available evidence. In the words of Lena Dunham: “Things women don’t lie about: rape.” This subjective reasoning has led to campus rape trials in kangaroo courts across the U.S., Australia and Canada (they’ve been advocated for here in the U.K., but remain to be implemented, although the Varsity student newspaper informs me that they’re under serious consideration here at Cambridge now). They are governed by amateurs with inadequate legal training, who are given licence to assess innocence or guilt with a balance of probabilities standard of adjudication. With this trend we are witnessing a move away from the longstanding legal principle of ‘innocent till proven guilty’ and toward the dangerous principle of ‘guilty till proven innocent’ – paving the way for the systematic ruination of innocent lives. And the current state of affairs is not enough for some feminists who want to see men, not guilty till proven innocent but guilty upon accusation. Julie Lalonde, an “expert” brought into Ottawa University during the hysteria around a rape allegation (that proved false) to tackle the institutions “rape culture” believes that \"Every time we see a high-profile sexual assault trial result in an acquittal, it sends women back 50 years\" [end quote] and Emily Lindin tweeted that “I'm actually not at all concerned about innocent men losing their jobs over false sexual assault/harassment allegations.” \n\nUnder feminist Director of Public Prosecutions, Alison Saunders the U.K.’s Criminal Prosecution Service became embroiled in a scandal wherein targets set for rape and sexual assault prosecutions encouraged police forces to withhold exonerating evidence from courts. Innocent men were incarcerated, that’s a fact – and as a rule, their victimisers have retained anonymity and avoided their own well-deserved sentences for perjury.\n\nThe #MeToo movement has proven itself to be a malevolent witch-hunt, with a body count. A prime example of feminist aggression into the lives of non-feminist men and women who do not need feminism to dictate acceptable behaviour, at best it can only serve to diminish the romance, comedy and beauty (as well as some discomfort and tragedy) – in other words the colour – from our lives. As Camille Paglia pointed out, “Leaving sex to the feminists is like letting your dog vacation at the taxidermist.” At worst it serves to destroy men (professionally, personally, legally, or even totally). In August 2018, Brendan O’Neil counted four suicides as a result of #MeToo allegations – Benny Frederickson, head of a Stockholm arts centre, Carl Sargeant and an unnamed Labour party activist and Jill Messick, a movie producer, who killed herself as a result of harassment she received for defending Harvey Weinstein. Since then I have counted another four: Swaroop Raj, a Noida technician from India, American skating champion John Coughlin, Arghya Basu, filmmaker, and Armando Vega Gil, Mexican rockstar, who committed suicide after an anonymous woman claimed that he told her he would like to teach her to kiss when she was 13 and he was 50. I have no doubt that there are many that we have missed.   \nAnd the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?... We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately... I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying...”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending [pride] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalise the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonise men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.\n\nRegardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance. \n\nMasculinity as a whole is utterly vilified and demonized in our societies. The endeavour can begin at school, intensifies in university – and in the workplace increasingly, and reaches a tragic crescendo in family courts where men are denied access to their children who would bring such critically important meaning to their lives and be the ultimate expression of their masculinity. There is a gender justice gap for those convicted of crimes. Sex discrimination in the U.K. criminal justice system has a long history: e.g. flogging as a punishment for female criminals was banned in 1820 but continued for men until 1967 – that’s 147 years! Presently, men account for around 95% of the total prison population despite only committing 3.4 times more crimes than women. Factors that explain this disparity include: a greater percentage of convicted men being sentenced to prison, men being given longer sentences on average than women, women being paroled earlier than men (despite being more likely to be disciplined for bad behaviour whilst incarcerated) and women being more likely to have mitigating factors (such as age, dependents, lack of previous relevant convictions and the appearance of genuine remorse) applied to their sentences. And yet, feminist activists (such as Women in Prisons, Baroness Corston and Julie Bindel) have committed themselves to widening the gender justice gap – enabled by sentimental authorities. Our Tory government has committed itself to taking a rehabilitative approach when dealing with women offenders, which I think is great, but the voices of our male offenders (as well as the experts on effective justice) are utterly ignored when they raise the question: “What about the men?” \n\nThe cultural obsession with the gender pay gap is being driven by disingenuous authoritarian feminists with no regard for personal choice, meritocracy or human well-being. The focus is exclusively on the mythical glass-ceiling with no interest paid to the fate of those men employed in the glass-cellar dangerous and dirty jobs that women don’t want, who are increasingly at risk of unemployment due to automation, and/or the ever-present risks of workplace injury and death. Quotas are being used by many organisations which discriminate against men, sometimes caucasian men specifically. This is not only immoral in that it unfairly disadvantages individuals but also frankly stupid with the potential to impair the functioning of sectors rejecting meritocracy and therefore the economy and society in general. Moreover, the clunky way in which the government has demanded that businesses publish their “gender pay gap statistics” may ultimately lead to men being chosen over women for the kind of minimum wage jobs that very few do out of choice. “Equal pay” is being acquired for women performing even dissimilar roles to male counterparts, regardless of relevant facts such as: whether they work fewer hours. For example, the BBC’s former China editor Carrie Gracie was awarded £280,000 in back pay to bring her earnings in line with Jon Sopel, the North America editor, despite the fact that his job was more intensive and he was on air significantly more than her. She has donated her pay-out to The Fawcett Society. There are also several battles raging to secure equal pay for (mainly female) supermarket store workers as (mainly male) warehouse workers. An Asda spokesman clarified (in response to coverage consistently suggesting otherwise) that ““At Asda, hourly paid colleagues doing the same job in the same location are paid the same. Men and women doing the same job in our retail stores are paid the same. Men and women doing the same job in our distribution centres are paid the same. Pay rates in stores differ from pay rates in distribution centres for legitimate reasons” [end quote]. Differences in comfort, exertion and safety in the roles have been labelled entirely illegitimate reasons to offer different levels of pay to workers in the coverage of the stories, and the Court of Appeal agreed earlier this year and ruled against Asda.\n\nNow, the U.K. is facing the extension of hate crime legislation to include the charge of misogyny. In line with current hate crime legislation, the charge will require no evidence of hateful motivations but rather be governed by the perception of the victim or any witnesses involved. This shameful waste of police time will offer another avenue for malicious women to use the law to harm innocent men; as well as diverting precious resources from the fight against actual crime. And do not think that these “crimes” will not be acted upon by sensible officers, a perception of indifference from the police in such instances will be treated (as it is with current hate crimes) as “secondary victimisation”, with Greater Manchester Police clarifying that action will be taken against police accused of indifference towards “victims” and “whether or not it is reasonable for them to perceive it that way is immaterial” [end quote]. \n\nIn the interests of nuance, I accept that there have been and are individuals who identify as feminist who don’t fit into the negative description of the movement that I’ve just given. There are feminists who want equal rights for men and women, equal treatment, choices, opportunities. Feminists who have compassion for men and value them. But what impact have they really had on the trajectory and achievements of the movement? They’ve been marginalised heretics pleading intelligently and rationally but essentially ineffectually with their hysterical peers. While their hysterical peers have been lobbying our institutions irresponsibly and illogically but consistently successfully for policies and procedures that are damaging our societies.  \n\nFeminism, though once it was at least partially in practice, is now “progressive” in name only. Feminists don’t look around at our wonderful civilisation with gratitude and awe and want only to extend and protect the liberal values that have brought us here. Feminists look at our civilisation with anger and malice and want to burn it to the ground, rending our liberal values assunder, and to remake it in their own image. And feminists understand that “Power is in tearing human minds to pieces and putting them together again in shapes of your own choosing”, as Orwell explained through O’Brien in 1984, that’s why the epicentre of feminist indoctrination is in the education system where young and malleable minds proliferate to be manipulated by feminist historiography. Thankfully, we non-feminist women and men are studying and expressing our findings and more and more individuals are learning to see through the feminist narrative. I look forward to a post-feminist future.",
    "title": "History of feminism the way they don't want us to know!",
    "subreddit": "MensRights",
    "timestamp": 1558867022,
    "score": 388,
    "keyword": "white director"
  }
]