[
  {
    "text": "Sharing a simple job search strategy that I think the vast majority of job searchers would benefit from Job searching is one of the most miserable activities known to man. I believe this strategy is more effective and less painful for a few reasons, notably that: it makes excellent use of your personal network and generates warm introductions; it allows you to hone and practice your sales/pitch/interview skills constantly; and it provides frequent opportunities for encouragement and self-affirming interactions. These are all rare perks in most job searches.\n \nI am not a career consultant or interview coach or recruiter. I am sharing as someone that has conducted several successful job searches on my own behalf, as someone who has hired and fired people, and as a former executive coach that has had a front row seat in many, many searches. In the last year I’ve also had a front row seat to the job searches of several very close friends as well as my spouse. \n \nI am not suggesting this is the best or only job search strategy, but if I had to bet all my marbles, personally, this is the way I would go. I am writing it down here in case you find it helpful. You can decide for yourself if it makes sense and you want to try it.\n \nAt a high level, this strategy is based off a technique from venture fundraising (I am CEO of a company that has raised capital from investors). In venture fundraising we say, “Ask for money and you'll get advice. Ask for advice and you'll get money.”\n \n> You can think of this strategy as the analog: *“Ask for a job and you'll get advice. Ask for advice and you'll get a job.*\n \nThe strategy goes like this:\n \n1. Make a list of contacts. These are people who have relevant skills, experience or network for your search and who like you enough to help.\n \n2. Email your contacts to ask for a 20-minute call or coffee date to get their advice and feedback. \n \n3. Meet them, describe your value proposition to employers, your skill set and your job search strategy. Let them react, and ask for advice and feedback.\n \n4. Before you finish the conversation, ask for at least one introduction for the purpose of further advice, feedback and brainstorming. (Do NOT if they know of job opportunities.)\n \n5. Repeat steps 2-4, continuously expanding your web.\n\n6. Follow up every 1-2 weeks with each contact on your list, to stay top of mind.\n \n7. You will get warm introductions as opportunities come across your network’s radar, moving you to the top of the pile immediately as jobs become available.\n \nAs you execute these steps, you're building an ever-expanding network of people who are now enlisted in helping with your job search. \n \nAs part of the conversation (step no. 3), you are actively pitching each person on your value, but you’re sneakily doing it under the pretense of getting feedback. People’s walls will come down and you’ll activate their desire to help. (I recently learned that this is one of the 8 core needs in Maslow’s hierarchy -- no joke.)\n \nEventually you will get introduced to someone who hires you.\n \nI know that the devil is in the details so if you want more details, keep reading. I’ve broken down the steps using a hypothetical example and provide some example emails and exact wordings you can use. However, remember that copying other people’s language is a good way to sound like a robot, so make sure to make these your own.\n \n****************\n\n**Step 1: Make a list of contacts**\n \nThe heart of your strategy is to build a network of people who are thinking about you and your job search, so you'll need a way to keep track of all these people.\n \nInclude column headings for:\n \n> Name - Jane McDougal\n \n> Organization - High Flying Avionics\n \n> Email - jane.mcdougal@hfavionics.com\n \n> Phone number - 212-867-5309\n \n> Who introduced you - [blank if she is your contact]\n \n> Action required - Yes\n \n> Next action - initial email\n \n> Notes - [none yet]\n \n**Step 2: Write an email requesting a phone call or coffee**\n \nHere's a template you can use:\n \n> Subject: Advice?\n \n> Hi Jane,\n \n> I hope all is well!\n \n> [As you know] I’m exploring new career opportunities [in avionics industry] and was wondering if you'd be up for a call [or coffee] in the next week or two. I would love some advice on my strategy and positioning, and, if you don't mind, maybe some ideas on people to connect with.\n \n> Thanks so much. If workable for you, I'm available [time block 1] or [time block 2].\n \n> Best,\n> [YOU]\n \nYou can change this template as you like, but keep in mind the principles at work here:\n* Concise: gets to the point quickly\n* Request is clear -- they know exactly what they're signing up for\n* Focuses on your desire for advice while getting their wheels turning on other contacts for you\n* Let's them know the type of advice you want so that they feel confident they can provide it (and not waste either of your time)\n* Provides scheduling options to reduce back and forth\n \nYou might also notice that the request is passive: there is no question mark. (\"Can we talk?\" vs \"I was wondering if we could talk.\") This is intentional. The passive request doesn't make the other person feel put on the spot for a reply and therefore makes them feel a greater sense of choice and autonomy in offering support.\n \n**Step 3: Conduct the meeting**\n \nI suggest approaching the meeting as follows:\n \n* Get connected. Depending on your relationship with Jane and your cultural context, this could take 30 seconds or 30 minutes. The point is, be human.\n \n* Get down to business. After you get connected, make a decisive and clear pivot to talk business. Don't let the conversation wander or avoid the topic. Jane signed up to help and it's your job to honor that contract. You can segue by saying, \"OK, so let me tell you about what's going on.\" Jane may do this for you by saying, \"OK, so tell me what's going on.\"\n \n* Set the agenda. Explain: \"Let me tell you about what I'm looking for and how I'm going about that. I'd love your input on both my approach as well as how I'm positioning myself.\"\n \n* Share your value proposition. Talk about what you're great at and what kind of value you believe you can provide. (You're doing this in the context of getting feedback, but notice how you've created an opportunity to pitch yourself!) IMPORTANT: Be prepared with a clear and compelling pitch. Ideally, Jane walks away with an unforgettable snapshot of the value you can provide, so that as soon as she learns of a good opportunity she will think of you. When you're done sharing, ask for input: \"What are your thoughts? How can I improve my pitch?\"\n \n* Share your job search strategy. Explain how you're focusing on warm introductions and meeting great people in the field, because you never know who is hiring. Ask: \"What do you think? Does that make sense?\" Most of the time Jane will affirm your approach.\nGet new contacts - Jane may offer you an introduction or two without being asked. If not, and if it feels appropriate, you can go ahead and say, \"Would you mind thinking of one or two people in your network who might also have advice and ideas for me?\" Notice how you're not asking Jane who is hiring (she probably won't be able to think of anyone) -- you're just asking for people with advice and ideas (which everyone has). This makes it much, MUCH easier for Jane, who provides a few names: Lamar Garvey and Samantha Marshall.\n \n* Write down the names, say thanks and let them know you'll follow up. Tell Jane that you'll send her an email that she can forward to Lamar and Samantha.\n \n*Let me expand a little on the idea of sharing your value proposition.*\n \nInside your head, it might be very clear what you do, what you’re good at, what you’re looking for, and so on. But other people are not. They need a “handle” of sorts, an extremely simple and memorable way to think of you vis-a-vis job search.\n \nTo that end, I suggest coming up with a few assets:\n \n* A pithy job search headline. E.g. “Embedded systems engineer passionate about avionics.” You should use this early and often, modifying it slightly so you sound human. \n \n* Three to five key selling messages with stories. You need a little meat on the bone for these conversations, but you don’t want to wing it. You want to make sure you hit the most important messages, and stories is the best way to do so. \n \n(What do I mean by a story? When I talk about my passion for great workplaces, I talk about the time I was 23 and bought some hip new shoes but wasn’t sure I could wear them on casual Fridays because they had white soles. I never forgot because I was so excited to show them off but was stressed enough that I didn’t wear them. This story brings home the idea that I’m passionate about people feeling safe at work in a few sentences. That’s what you want -- to reinforce your key points with a quick story or non-hypothetical example.)\n \n**Step 4: Follow up to facilitate the introductions**\n \nIntroductions are sensitive territory. If the introduction breaks down at any point it reflects badly on everyone. For that reason you need to pro-actively manage this part of the process.\n \nHere's an email template you can use:\n \n> Subject: [Your name] intro to Lamar O’Donnell\n \n> Hi Jane,\n \n> Per our discussion I’d love to connect with Lamar O’Donnell to get his advice. [Add a human and non-transactional reason why, e.g. “Based on your description it sounds like we’d hit it off, and given his sales experience I thought he might have some pointers on how I describe my value, too.”]\n \n> As context (feel free to forward this to Marty directly if helpful), I’m a lifelong software engineer with a passion for all things flying and avionics. I have 20 years experience in embedded systems (Motorola, Intel) and a burgeoning web development skill set. My LinkedIn, if helpful, is http://linkedin.com/yourname.\n \n> Thanks!\n> YOU\n \nThis makes it easy for Jane to forward the email, add a short note, and wait for Lamar and Samantha to reply. Then she can just copy you in on the thread and be finished.\n \nNow, you should add Lamar and Samantha to your list, and keep the ball rolling.\n \n****************\n\n**A few thoughts on why this approach works**\n \nIt’s a big deal to commit whole hog to a new job search strategy (you can only do so much, I understand). So, these are some of the reasons why the strategy works, and why you might consider giving it a try.\n \n**1. People want to help**\n \nPeople can relate to the sucky-ness of a job search. Saying that you're looking will activate the \"helper\" gene that lives inside so many people. If you're not asking your network for help, you're snubbing a whole bunch of people who could feel good because they helped.\n \nAlso, according to Abraham Maslow’s research, one of our 8 core needs is called Transcendence, the need to help others achieve their potential. You are tapping into a universal need here -- pretty neat.\n \n**2. Your request for advice is flattering**\n \nWhen you send out your initial email requesting some time and advice, your ask is flattering: you want their advice. People like to give advice because it suggests that who they are is valuable.\n \nBy the way, people may offer connections for the same reason: their network reflects well on them, so they will want to impress you with who they know by offering those contacts to you.\n \n**3. Your ask is small and clear**\n \nPeople are also much more likely to say \"yes\" to a request when they feel that the boundaries of their \"yes\" are clear. There is no slippery slope. Your request is for time and advice, and possible ideas on further connections. That is a clear boundary so easy to say yes to.\n \n**4. You get to pitch your value to everyone you meet**\n \nYou're pitching yourself at every meeting, except normally being pitched makes people resist. In your case, they're just listening to as to provide feedback, which has the opposite effect: they're listening more closely.\n \nThe process of providing the feedback will help them internalize and remember your pitch, as they will begin to get their fingerprints on it and take ownership of it. Now they can more easily think of you and advocate for you to others.\n \n**5. Making requests in person is 34 times more effective**\n \nMost people think an email request is about as effective as one made in person, but requests made in person are 34 times more effective (!!!). This strategy gets you face to face before you ask for introductions, dramatically improving your odds of getting access to valuable new contacts.\n \nHere’s a Harvard Business Review about this. \nhttps://hbr.org/2017/04/a-face-to-face-request-is-34-times-more-successful-than-an-email\n \n**6. Every opportunity has a warm introduction**\n \nUsing this strategy, everyone you meet is through a warm introduction. You can bet that everyone who ever posted a job online would rather meet a candidate through a warm introduction than an online portal.\n \n**7. Going through your network will improve culture/values fit**\n \nPeople you get along with are more likely to know other people you'll get along with. By meeting people through your network, you increase the chances that the hiring manager at the end of the chain is someone you'll also get along with.\n \n**Bonus: Get positive affirmation and build momentum as you go**\n \nThis human-to-human approach will provide numerous opportunities to be acknowledged for your value. As you solicit feedback on your pitch, each of your contacts will help you dig for the gold in your experience and continuously reframe yourself in an ever-more positive light. Each introduction becomes an opportunity for acknowledgement, as your contact seek to enlist their own contacts in spending time with you.\n \nGetting positive affirmation is NOT superficial -- it is an important and necessary part of building and sustaining momentum during your job search. Embrace and enjoy it.\n \n****************\n\n**To sum up, here’s what you need to execute this strategy**\n \n* Tracking spreadsheet (I like Google sheets or Airtable)\n* Initial outreach email template\n* Followup email template\n* A pithy headline for your job search\n* 3-5 key selling messages, each one with a story to illustrate\n \nAgain I am not an expert but if you have questions on this technique I’m glad to discuss in the thread.",
    "title": "Sharing a simple job search strategy that I think the vast majority of job searchers would benefit from",
    "subreddit": "jobs",
    "timestamp": 1495736627,
    "score": 8,
    "keyword": "white ceo"
  },
  {
    "text": "How can I get back on track after gendered career derailment? I'm a 28-year-old woman who has experienced gender-biased career derailment and am still recovering from it. In 2013-2014, I was employed as a Marketing Coordinator for a small executive training firm. The CEO postured himself as a champion of equality, but he was an elderly white man who had somewhat rigid views of women in the workplace. \n\nEven though admin tasks were not in my job description, there was immediately a lot of mission creep with me being expected to take an inordinate amount of extra work such as answering phones, running personal errands, and planning the company parties for no additional pay. My employer expected me to be an Office Manager and a Marketing Person and essentially work two jobs for the price of one (underpaid) employee. When I tried to advocate for fair treatment and compensation and presented evidence that they were incorrect in their management of me; the CEO became retaliatory and had me terminated for \"poor performance\" despite never having received a poor performance review and having performed the job for which I was hired competently and in good faith. \n\nMy direct manager tried to defend me and managed to have me retained as a work-from-home freelance contractor, but I took a significant pay cut and lost all of my benefits. Unsurprisingly, she was later also pushed out of the organization when she became pregnant but now works for another company and is one of my best clients. \n\nNow, I have a freelance practice and am much happier in my personal life. The money is okay, and I set my hours, but it can be unstable at times, and the lack of benefits and savings causes me a lot of stress-- not to mention the annual tax liability and overhead costs of running a small business. I wish I could find an in-house job where I am treated fairly based on the merits of my talents and work ethic, not my gender.",
    "title": "How can I get back on track after gendered career derailment?",
    "subreddit": "careerguidance",
    "timestamp": 1506715003,
    "score": 7,
    "keyword": "white ceo"
  },
  {
    "text": "Trouble Getting Promoted Due to Belief System / Worldview I’m your typical tall white male software engineer in Silicon Valley working at a top 5 MegaCorp. But I’m at the bottom of the ladder (level 1 engineer) and I’m having a tough time getting promoted because, frankly, I think everything I do is bullshit.\n\nI probably watched Office Space or Fight Club too early in my life. I feel like a real life Peter Gibbons sometimes.\n\nManagement tells me that I’m a talented engineer but I have trouble seeing a project to completion. I forget to follow up with people on who’s in charge of what, miss minor details required for fully finishing a feature, sometimes miss a meeting etc. These are all kind of related to the soft / managerial skills required to be a fully functional cog in the 9-5 system.\n\nUltimately, I want to maximize how much I earn. And for that I need to get promoted. But to get promoted, I need to work on the soft / managerial skills. And to want to do that, I need to believe that struggling in the corporate world is worth it. But I doubt office culture. I doubt the idea of a 40 hour work week. I think most meetings are useless. I think capitalism is flawed in that a handful of people control the majority of the wealth (our CEO made more in one paycheck than I will make in one hundred lifetimes).\n\nMy question is: can you help me buy into the things that I am criticizing above? Why does such a bullshit system exist and how can I fit into the mold better when my true passions lie far outside of the corporate world (or the US society in general)?\n\n***\n\n**Edit1**: I could write an essay on these thoughts but the TLDR is I think office life is a disingenuous way for humans to live and it makes me fundamentally unhappy. But I suspect that maybe it could just be my worldview that needs to be adjusted.\n\n***\n\n**Edit2**: Ok, here's the advice I've gleaned from this productive thread:\n\n- My lack of ability to care for managerial BS has nothing to do with capitalism\n- I should see a therapist\n- I should stop being lazy\n- I should stop seeking money and get passionate about a product\n- The system perfectly translates effort to success/promotions so I should stop criticizing the CEO because he put in the most effort\n- If I don't like corporate BS I should start a startup\n- My current job is probably just boring\n- Some admin didn't like my Betty Fupa joke\n\nIt's almost as if this subreddit has a heavy bias towards CS careers.\n\n***\n\n**Edit3**: Holy shit. I think, deep down, I am a communist.",
    "title": "Trouble Getting Promoted Due to Belief System / Worldview",
    "subreddit": "cscareerquestions",
    "timestamp": 1509836283,
    "score": 0,
    "keyword": "white ceo"
  },
  {
    "text": "There Are Only 23 Black Owned Banks Left in America > Black-Owned Banks Hit Their Peak a Century Ago \n\n> In late 19th and early 20th century, 57 black-owned charter banks entered the system\n\n> Black-owned banks arose and flourished in a period when African-Americans were kept out of other financial institutions, both overtly and through practices that effectively walled off their neighborhoods from other banks.\n\n> The sector hit a peak in the late 19th and early 20th century, a period when 57 black-owned banks and credit unions existed. \n\n> Six CEOs of black-owned banks locked themselves in a New Orleans conference room for more than a day in late 2016. Surrounded by papers, drawing boards and PowerPoints, the group strategized ways to reverse a trend 15 years in the making: the decline of their own banking sector.\n\n> The number of black-owned banks operating in the U.S. has been dropping steadily for the past 15 years and fell to 23 this year, the lowest level in recent history, according to the Federal Deposit Insurance Corp. That has left many African-American communities short of access to capital and traditional financial services, according to some banking experts.\n\n> “We have a crisis among black banks,” said Doyle Mitchell, CEO of Washington-based Industrial Bank. “We met…to save the industry. To save ourselves.”\n\n> The 2008 recession hit the black banking sector especially hard, and if the current rate of closures of about two a year, as well as the industry-wide reluctance or inability to start banks, continues, black-owned banks could disappear entirely within the next eight to 12 years.\n\n> The trend is worrisome to some analysts who argue fewer banks serving low-income, minority groups could expand “financial deserts”—communities with few or no banking institutions—and increase the likelihood that black and Hispanic communities could become susceptible to redlining, a discriminatory practice that excludes poorer minority areas from financial services.\n\n> “These banks are banks that serve relatively poor neighborhoods,” said Russell Kashian, an economics professor who studies black-owned banks. “There are neighborhoods that if…the black-owned bank isn’t there, nobody is there.”\n\n> Most black-owned banks typically have a few branches in one city, although one of the category’s largest players, New Orleans-based Liberty Bank, has a multistate presence. Such banks comprise just a sliver of the overall U.S. financial sector, with collective assets of $5.5 billion, versus $16.3 trillion in the industry overall.\n\n> As a result, some economists question the significance of the sector’s decline. “Size-wise they’ve been small,” said Nicholas Lash, a business professor at Loyola University Chicago who studies minority banking. “So their total impact on black communities can’t be very, very large.”\n\n> Yet those who live in communities that have been served by black-owned banks say the impact there, both practical and psychological, is deeply felt. The most recent example is in Chicago, where Illinois state regulators in January closed Seaway Bank & Trust, determining that its financial health had so deteriorated that pumping in more money couldn’t save it.\n\n> “It was like air coming out of a balloon,” said Bob Fioretti, a former Chicago alderman who was previously involved in raising money to keep Seaway open. “People were deflated. Seaway was a standing icon of the community.”\n\n> Seaway, formerly Chicago’s largest black-owned bank, helped anchor the famed black business community on the city’s South Side.\n\n> Claire Adams, a former board president of a South Side Chicago housing community that was one of the first businesses to use Seaway when it opened in 1965, said she now fears that with fewer small, community banks in her part of the city, payday lenders and check-cashing institutions, which often charge exorbitant rates and fees, would be many African-Americans’ only nearby banking option.\n\n> “The only thing that’s left are these predatory institutions,” Ms. Adams said.\n\n> In some areas of the South Side, Seaway was the first bank some African-Americans had access to, making it a symbol of black enterprise and economic development, patrons say. Many speak of the bank with admiration, often mentioning a program that allowed children to open a bank account with a small amount of money.\n\n> “I [could go to] Chase or something…but I like Seaway,” said Nell Robinson, who has used Seaway for more than two decades. “Seaway was here before Chase. It’s a black bank [and], we have to pull our people up.”\n\n> With such concerns in mind, members of the South Side’s religious community raised more than $100,000 in deposits for Seaway in 2016. But the effort wasn’t enough. Seaway was sold to the State Bank of Texas, then sold again to North Carolina-based Self-Help Credit Union.\n\n> A prolonged period of low interest rates and intense competition, as bigger banks slowly move into underserved areas, have combined to contribute to the black banking sector’s decline, even after the recession’s end. Now a practical concern in Chicago and elsewhere is that, even if bigger institutions step in, they won’t be as accommodating in lending to black-owned businesses.\n\n> A survey of entrepreneurs by the U.S. Census Bureau in 2014 found that 47% of black business owners had gotten the full amount of funding requested from banks, credit unions or other financial institutions, compared with 76% of whites.\n\n> That survey also showed fear of rejection was the top reason cited by black business owners who chose not to seek needed capital at all.\n\n> “When I have an applicant that comes into my bank and comes into XYZ large bank, and they’re on the edges, there are things that I can understand and appreciate about their situation that XYZ large bank won’t, and that makes the difference,” Mr. Mitchell, of Industrial Bank, said.\n\nI feel like we have to do whatever we can to keep these financial institutions alive man. Some of these banks & credit unions have been serving us and our communities since before integration. No way we should let them down now by continuing to take our business to people who don't care about or respect us. \n\nI have an account w/ Industrial Bank here in DC which is black owned in fact it was my very first bank account ever. My parents are the reason for this, and I'm proud to say I still do business with them to this day.",
    "title": "There Are Only 23 Black Owned Banks Left in America",
    "subreddit": "blackladies",
    "timestamp": 1503677750,
    "score": 85,
    "keyword": "white ceo"
  },
  {
    "text": "\"Why, when we talk about white heterosexual males, do we always paint them as rich, powerful individuals who are the unapologetic recipients of years of unfettered privilege? Not every white guy is the CEO of a Fortune 500 company or a political powerbroker.\"",
    "title": "\"Why, when we talk about white heterosexual males, do we always paint them as rich, powerful individuals who are the unapologetic recipients of years of unfettered privilege? Not every white guy is the CEO of a Fortune 500 company or a political powerbroker.\"",
    "subreddit": "MensRights",
    "timestamp": 1506072761,
    "score": 304,
    "keyword": "white ceo"
  },
  {
    "text": "\"Equality\"... or, \"When was the last time a feminist...\" I rarely engage a feminist for the same reasons i rarely engage with KKK, Muslim Jihadists, Marxists, Holocaust deniers , etc etc.\n\nThat said, feminists are far far more powerful and numerous than i'd like to admit (and not just in the West), and so i've recently started compiling a list of issues on which feminist hypocrisy truly shines. Y'know, for fun.\n\n\nSo anytime a femmy pulls the '**bububut we stand for equality**!\", i say:\n\n\n\"When was the last time a feminist seriously advocated equalizing...\n\n- the suicide rate?\n\n- homelessness rate?\n\n- mental illness rate?\n\n- drug use rate? \n\n- death rate from unnatural causes?\n\n- workplace injury and fatality rate?**\n\n- divorce rape rate? child custody rate? \n\n- time spent with family rate? or more generally: free time rate? \n\n- tax contribution rate? (remember, in general males contribute to taxes more than they receive in welfare, females are the opposite)\n\n- military conscription rate?*\n\n*this one is personal for me. In the country i come from, military service is mandatory for males. Imagine being forced to give up X number of years of your most fruitful, prime years for the drudgery/harshness of being a private. Yet NOT ONE of the feminists in my country mention a damn fucking thing to change it. But you know what they DO mention? The fact that males who've completed military service get networking/career opportunities that are not afforded to females.\n\nLet me reiterate that: the feminists are angry that females dont get the benefits of being forced into military conscription, but have zero issues with the female lack of obligation of being forced into conscription. \n\nYa gotta love these terrorists....\n\n\n\n.....anyone else think of other bullet points to add? \n\n----\n\n**EDIT: just to add on about the 'workplace injury/fatality' part:\nwhen was the last time a feminist advocated equalizing the gender ratio of blue collar jobs: the dirty/dangerous/unhealthy/isolated jobs that are dominated by men? \n\nwhen was teh last time a feminist talked about equalizating coal miner jobs, or garbage truck collectors, or bus/taxi drivers, or construction workers?  Nah, it's only the white collar jobs: CEOs, execs, board of directors, the presidency. \n\nEquality^TM !",
    "title": "\"Equality\"... or, \"When was the last time a feminist...\"",
    "subreddit": "MensRights",
    "timestamp": 1493625760,
    "score": 40,
    "keyword": "white ceo"
  },
  {
    "text": "Just watched The Red Pill, here's some random thoughts First and foremost, it was an incredibly intelligent yet *mild* look at both pro and anti MRAs. In the end, she stayed level headed, gave us a summary, concluded her topics and said she's not a feminist anymore. A total Streisand Effect, thanks to the protests, who led us to believe that this is hate speech. I expected to be shocked. I expected a Michael Moore style of biased editing from the filmmaker. I expected a big, mean slant against feminists. But nope, she gave both sides a chance, and all we got were mental gymnastics from our critics. \n\nThings you should know about this documentary, if you haven't seen it yet: She focuses on a handful of pioneers for men's rights and sticks mostly with them, while bringing in other interviewees. Some of the primaries: The guy from A Voice for Men; Warren Farrell; a guy from the National Coalition for Men; an ex writer for Playboy who lost his son in family court, and a British woman who started the first women's shelter in Britain and was later ostracized for being critical. Plenty others that I'm forgetting.\n\nAs for the rest of the interviewees: I loved the chillness of Girlwriteswhat at the bar and was glad to see her in this doc, although I wish she would've dressed a little nicer. The CEO of Ms. Magazine seemed smart and level headed, despite being a huge critic. Her focus is obviously on women, and that's fine. I simply wish her agenda would leave men alone, which it obviously doesn't. Those sociology and gender studies professors she interviewed were completely barfy.\n\nHey Big Red, how many times can you blame the patriarchy for everything wrong in your life? Do you know who you sound like? Black culture in the 90s that would blame \"the Man\" for keeping them down. But I see that you two have teamed up to blame white privilege and the patriarchy now. Smart thinking. Speaking of Big Red, even in a relaxed café setting, she stills comes off as bat shit crazy. \n\nI had to close my eyes during the circumcision scene.\n\nI was sooo so happy to see that she included that disgusting protest at the University of Toronto against Farrell's speech. I was on this sub when that happened, and I knew this event was getting us close to a tipping point against the misandry of Feminists and SJWs. Sadly, I noticed that some of the faces from the original vid were missing. That could be because she was pressed for time, but I think it was because they threatened legal action against YouTube and probably against Cassie too. That was another tipping point: When Feminists/SJWs realized that they're too chicken shit to come out from behind their computer and engage us in a rational manner.\n\nLastly, the video diaries were super duper important in conveying how she felt about this and how her aim was changing. Sometimes docs need a human element, and that's what she did. Without these logs, I think the doc would've lost a lot of its strength, and I'm gonna go ahead and say it: Having an attractive, blonde, white woman be the predominant face of men's rights in this film is the huge punch that we need.\n\nGood work, Cassie, and thank you very much for doing this!",
    "title": "Just watched The Red Pill, here's some random thoughts",
    "subreddit": "MensRights",
    "timestamp": 1495478150,
    "score": 24,
    "keyword": "white ceo"
  },
  {
    "text": "A Day Without Men So I keep seeing news about women going on strike to show how invaluable their contributions are to the workplace, to society, to the economy, etc. \n\nI feel that the minds behind the strike didn't really think it through. \n\nWhen millions of people get through their day, have dinner, go to bed, and wake up tomorrow without being inconvenienced in the slightest by the women's strike all it will do is prove the opposite of the point they wanted to make.\n\nI am a supporter of equal rights for all, men, women, black, white, pink, purple, I don't care, equality for all means just that, for all, so please don't think I'm saying that I think, even for a second, that women are unimportant.\n\nBut imagine if we had a Day Without Men, a Men's Strike, a day when all the men in the country refused to work. Everything would fall apart. There'd be garbage piling up on the streets, public transport wouldn't be able to run, construction would grind to a halt, law enforcement would practically cease to exist, the military would do the same. What about slaughter houses that produce all the meat we eat? The kitchens filled with underpaid male immigrants? \n\nI'm sorry female Gizmodo writers, no one cares if you don't write for a day. The fact that you have the ability to not go to work for a day without everything going to shit exposes how expendable your position really is. All it does is highlight the dichotomy between true workplace equality and what all the third-wave feminists call equality. \n\nYes, gender inequality exists, I don't think it should, but historically it has. Men have been ahead in the game for millennia, but at the same time they have been stuck at the very back. Yes, more men hold CEO positions than women, but more men also hold the dirty, overlooked, under appreciated jobs that are the foundation that holds up the rest of society. \n\nThroughout history there have been examples of exemplary women who broke away from the norm and did huge things, who showed that women as a whole are not weak and can do great things. As we march ever forward into the future it is a truly great thing that more and more women are able to rise against any preconceptions that say they should stand by the sidelines of history. But I think it is too easily forgotten that the road that this march of progress, that this march towards equality for all treads  upon is paved with the bones of men.",
    "title": "A Day Without Men",
    "subreddit": "MensRights",
    "timestamp": 1488992766,
    "score": 14,
    "keyword": "white ceo"
  },
  {
    "text": "White male Tech CEO calls for fewer white men in Tech http://dailycaller.com/2017/09/25/tech-ceo-isaac-schlueter-calls-for-fewer-white-men-in-tech/\n\nI'm guessing Mr. Isaac Schleuter isn't going to demand that his own position be replaced by a non-white male.  \n\nThere's an interesting argument, typically made by people on the far right, that white males are now being discriminated against in Western society.    \n\nA few years ago I would laughed at such a notion, but recently a friend of mine was turned down for a teaching position at the University of Victoria (Canada) and the administrator flat out told him they were looking for more \"diversity.\"   He now teaches English in Saudi Arabia.  \n\nAlso in Canada, I used to vote for the NDP.   Now \"the party has a policy requiring any departing MLA to be replaced by a woman or 'equity-seeking candidate,' including racial minorities, Indigenous people, and members of the LGBTQ community.\"   One poor sap had to claim he was [bisexual](http://www.cbc.ca/news/canada/british-columbia/ndp-candidate-reveals-bisexuality-after-questions-over-party-s-equity-rule-1.3811299) to prevent losing his job.  \n\nThis is not \"justice\", social or otherwise.  This is just discrimination under a new name.   \n\nIn the UK, poor white males are now recognized as the most [disadvantaged](http://www.bbc.co.uk/newsbeat/article/34667100/poor-white-boys-get-a-worse-start-in-life-says-equality-report) group.  \n\nWhy wouldn't they be?  If you help every poor ethnic group *except* poor white people of course they'll become the most disadvantaged.  And despite feminist claims, men almost always occupy the very bottom rungs of society.   \n\nThe left has lost its way.  Whereas they used to focus on class and *overcoming* racial and sexual distinctions, they now seek to create maximum conflict between the sexes and races while the billionaires run laughing to the bank.   *Divide et impera* is the oldest trick in the book, and modern day leftists have fallen for it hook, line and sinker.",
    "title": "White male Tech CEO calls for fewer white men in Tech",
    "subreddit": "MensRights",
    "timestamp": 1506463644,
    "score": 14,
    "keyword": "white ceo"
  },
  {
    "text": "Trudeau, Trump find common ground on economy, security - Women in business round table The CBC was rife with pro feminist articles today.  But a section near the end of this article caught my attention.  Trudeau, and Trump (!), partook in a round table discussion about how to encourage more women in executive positions. \n\nWhat is this?  Why is this a thing?  The Apex fallacy annoys me to no end.  People are so dumb to engage in the idea that \"because there are more male CEOs, men are privileged\".  It's a dumb argument.  Should we have a round table to discuss how we can have more female coal miners?  Or taxi drivers?  Or how about more homeless females?  \n\nFurthermore, how does a male CEO make me privileged?  It maybe, perhaps, makes HIM privileged.  It doesn't make me privileged. \n\nThat's like saying that having a white male Canadian PM shows that men are privileged.  Ah, no.  Our PM is \"a feminist\", and constantly stuck in 2015.  That doesn't make me privileged.  In fact, the exact opposite. \n\nBut whatever.  Is Trump now buying into this propaganda too?  I thought Trump was the first to speak against the grain and not subscribe to bullshit.  So why would he participate in this round table?",
    "title": "Trudeau, Trump find common ground on economy, security - Women in business round table",
    "subreddit": "MensRights",
    "timestamp": 1487033371,
    "score": 11,
    "keyword": "white ceo"
  },
  {
    "text": "You are Equal: I'm sorry Here is my response to the \"you are not equal, I'm sorry\" letter.  First, the letter in it's entirety, followed by my reply.\n\n\"Say Thank You\n\nSay thank you. Say thank you to the women who gave you a voice. Say thank you to the women who were arrested and imprisoned and beaten and gassed for you to have a voice. Say thank you to the women who refused to back down, to the women who fought tirelessly to give you a voice. Say thank you to the women who put their lives on hold, who –lucky for you — did not have “better things to do” than to march and protest and rally for your voice. So you don’t feel like a “second class citizen.” So you get to feel “equal.”\n\nThank Susan B. Anthony and Alice Paul for your right to vote.\n\nThank Elizabeth Stanton for your right to work.\n\nThank Maud Wood Park for your prenatal care and your identity outside of your husband.\n\nThank Rose Schneiderman for your humane working conditions.\n\nThank Eleanor Roosevelt and Molly Dewson for your ability to work in politics and affect policy.\n\nThank Margaret Sanger for your legal birth control.\n\nThank Carol Downer for your reproductive healthcare rights.\n\nThank Sarah Muller for your equal education.\n\nThank Ruth Bader Ginsburg, Shannon Turner, Gloria Steinem, Zelda Kingoff Nordlinger, Rosa Parks, Angela Davis, Malika Saada Saar, Wagatwe Wanjuki, Ida B. Wells, Malala Yousafzai. Thank your mother, your grandmother, your great-grandmother who did not have half of the rights you have now.\n\nYou can make your own choices, speak and be heard, vote, work, control your body, defend yourself, defend your family, because of the women who marched. You did nothing to earn those rights. You were born into those rights. You did nothing, but you reap the benefits of women, strong women, women who fought misogyny and pushed through patriarchy and fought for you. And you sit on your pedestal, a pedestal you are fortunate enough to have, and type. A keyboard warrior. A fighter for complacency. An acceptor of what you were given. A denier of facts. Wrapped up in your delusion of equality.\n\nYou are not equal. Even if you feel like you are. You still make less than a man for doing the same work. You make less as a CEO, as an athlete, as an actress, as a doctor. You make less in government, in the tech industry, in healthcare.\n\nYou still don’t have full rights over your own body. Men are still debating over your uterus. Over your prenatal care. Over your choices.\n\nYou still have to pay taxes for your basic sanitary needs.\n\nYou still have to carry mace when walking alone at night. You still have to prove to the court why you were drunk on the night you were raped. You still have to justify your behavior when a man forces himself on you.\n\nYou still don’t have paid (or even unpaid) maternity leave. You still have to go back to work while your body is broken. While you silently suffer from postpartum depression.\n\nYou still have to fight to breastfeed in public. You still have to prove to other women it’s your right to do so. You still offend others with your breasts.\n\nYou are still objectified. You are still catcalled. You are still sexualized. You are still told you’re too skinny or you’re too fat. You’re still told you’re too old or too young. You’re applauded when you “age gracefully.” You’re still told men age “better.” You’re still told to dress like a lady. You are still judged on your outfit instead of what’s in your head. What brand bag you have still matters more than your college degree.\n\nYou are still being abused by your husband, by your boyfriend. You’re still being murdered by your partners. Being beaten by your soulmate.\n\nYou are still worse off if you are a woman of color, a gay woman, a transgender woman. You are still harassed, belittled, dehumanized.\n\nYour daughters are still told they are beautiful before they are told they are smart. Your daughters are still told to behave even though “boys will be boys.” Your daughters are still told boys pull hair or pinch them because they like them.\n\nYou are not equal. Your daughters are not equal. You are still systemically oppressed.\n\nEstonia allows parents to take up to three years of leave, fully paid for the first 435 days. United States has no policy requiring maternity leave.\n\nSingapore’s women feel safe walking alone at night. American women do not.\n\nNew Zealand’s women have the smallest gender gap in wages, at 5.6%. United States’ pay gap is 20%.\n\nIceland has the highest number of women CEOs, at 44%. United States is at 4.0%.\n\nThe United States ranks at 45 for women’s equality. Behind Rwanda, Cuba, Philippines, Jamaica.\n\nBut I get it. You don’t want to admit it. You don’t want to be a victim. You think feminism is a dirty word. You think it’s not classy to fight for equality. You hate the word pussy. Unless of course you use it to call a man who isn’t up to your standard of manhood. You know the type of man that “allows” “his” woman to do whatever she damn well pleases. I get it. You believe feminists are emotional, irrational, unreasonable. Why aren’t women just satisfied with their lives, right? You get what you get and you don’t get upset, right?\n\nI get it. You want to feel empowered. You don’t want to believe you’re oppressed. Because that would mean you are indeed a “second-class citizen.” You don’t want to feel like one. I get it. But don’t worry. I will walk for you. I will walk for your daughter. And your daughter’s daughter. And maybe you will still believe the world did not change. You will believe you’ve always had the rights you have today. And that’s okay. Because women who actually care and support other women don’t care what you think about them. They care about their future and the future of the women who come after them.\n\nOpen your eyes. Open them wide. Because I’m here to tell you, along with millions of other women that you are not equal. Our equality is an illusion. A feel-good sleight of hand. A trick of the mind. I’m sorry to tell you, but you are not equal. And neither are your daughters.\n\nBut don’t worry. We will walk for you. We will fight for you. We will stand up for you. And one day you will actually be equal, instead of just feeling like you are.\"\n\n\n------------------------\n\n\nMy reply: \n\n\nI think you misunderstand the concept of \"equality\". \n\nEquality means that nobody is inherently considered to be better than someone else because of superficial qualities. It means that we have laws to prevent someone from using those superficial qualities as a basis for making decisions regarding opportunity. \n\nLet's examine your complaints one by one:\n\nYou list over a dozen women who should be thanked for fighting for the rights that women have today. Which, is all the same rights as men have (plus a few more). \nThen you double back and say basically that you can pretend that you have equal rights, but you're a fool denying all the work done by those before you.  So...  look more closely at that. The *ACCOMPLISHMENTS* of those women are what earned you equal rights. Yes. Say THANK YOU. Say it often and mean it, because you have equal rights. today. right now. You do. \n\nImmediately you plummet into the wage gap myth. Let's use some tired cliche' obvious answers of why this is stupid. \n1. If I could pay a team of primarily women approx. 75% of what I would pay an equivalent group of men, why would I not hire primarily women and save up to 25% on my largest expense as a business owner, human resources?\n2. The differences in pay between men and women in the sighted fields is normally on the level of 5 or 6 cents to the dollar. an amount easily attributed to a variety of things, but certainly not solely determined by sexism. I'll grant you that it is possible it is a factor, but if I were a betting man I'd wager an argument could be made to show sexism acounts for less than 1% of the discrepancy. \n3. Let's factor in the wages paid for jobs likely to harm or kill you. An industry happily left to men, who make up over 95% of workplace deaths. This means that jobs likely to harm or kill you are likely at least 90% men. Meaning that when you have no education, and you need to make good money, risking your life will earn you more money. Add to this the understanding that girls and women graduate high school and college in greater numbers than boys and men. \n4. young childless women, in their mid 20s, are out-earning their male counterparts. \n\nWomen aren't treated poorly in the workplace as a commonality. They gravitate towards different fields of work. There are anti discrimination laws, if someone is violating those laws, report them. use social media, expose them. Believe me, the world is watching, and very few of them would want to miss out on a chance to support a woman fighting oppression.\n\nYou go on to complain about men discussing your uterus, and your body...  So, what you mean is that men elected by a population of voters made up of men and women, where at least half don't vote, decide details of laws surrounding abortion and reproductive rights. \nCurrently you have the federal right to seek an abortion. You have literally hundreds of birth control options, ranging from hormonal daily pills, to semi monthly injections, implants, non-hormonal options...  etc. Many/most of these options are covered by health care, by law. Men have one option: condoms. Besides condoms men are told to either accept the risk of sex, or not have it at all. \nIf I meet a girl, she says \"I'm on birth control injections, and I would abort as soon as I found out if something happened anyway, I'm totally not interested in having kids at this point in my life.\". We have sex that night. we see each other another few times, and it kinda fizzles out. 4 weeks later she calls me and says \"I'm pregnant, and I know I said I would abort but I'm keeping it. It's yours\", you have no choice in the matter. You are now legally accountable for that kid for 18 years. \nIf you put that sort of lack of choice upon women, suddenly it sounds like the worst thing ever. Imagine, if a man could say \"fuck no, you're having this child, I'll take custody, and you pay me monthly to raise it, I know I agreed that abortion was what we would do if birth control failed, but I actually want a kid now, so you'll have it and I'll take it, and you help pay for it, and you can see it on weekends if you want.\"  no. If you said \"Well if you don't like the concept of being forced to have a child if you get pregnant, then don't have sex\".  This is literally the choice men have. We can trust a woman at her word, and then she can change her mind and we are legally responsible for that kid. This is not equality, not at all. when the suggestion of the \"financial abortion\" is made, that a man can tell a woman \"I will not raise a child with you, I am opting out legally from raising this child or ever having a right to be in this child's life\" you have to release that man from being a legal parent. This would have to occur within a time frame during pregnancy the same as a biological abortion. This allows women their choice of being single parents, or aborting in the case that they decided to keep an accidental pregnancy. This allows men to be held to their word, as well as women to be held to theirs. This allows equality of choice, and reproductive rights.  \nI also wonder where feminism is on helping to promote Vasalgel, which would greatly reduce the rate of accidental pregnancy in the first place, and give men a powerful option for birth control methods, putting them a step closer to women in terms of this right. \n\nTaxes on \"basic sanitary needs\".  you are talking about equality to men, right? we pay taxes on our basic sanitary needs all the time. razors and toilet paper and tissues, and talcum powders, and deoderants...  of course we pay taxes on those items. If you have a complaint that items like sanitary goods shouldnt be taxed, that is fine, I probably would support that. But I don't see how you believe that is an issue of inequality to men. \n\nThe letter talks after this about having to \"justify their actions after a man forces himself on them\" right. you have to recount exactly how it happened to the police, who will investigate the incident. You have to explain to police when there is a potential element of consent involved that you had clearly communicated you were not consenting, and how you did that. So the police will ask you detailed questions all about the incident so they can do their job as best as possible. You giving a strong account of an event will help your case. the police are trying to help you.  this is not inequality. If I am attacked by someone, and I break their nose and jaw defending myself, and yet I'm untouched claiming to have been attacked, I'm going to have some detailed explanations to make, aren't I? and here I am the victim, being interrogated!? Yes. Because your story is a very important element of the incident. \n\nYou follow this by mentioning that women don't have paid maternity leave. Do men have paid paternity leave? \nOh...  women in other countries have it, gotcha, Because this was supposed to be about how you're not equal to men, wasn't it? Sure, work to get paid maternity leave, work to get all the things you believe would improve out society. But don't claim it is a factor of inequality. Because it's just something you want the government to regulate about business, and you cannot simply stuff socialist concepts down people's throat without a spoonfull of oppression to make it slide down a little easier. This again is not an inequality, and I've yet to see an actual right you lack that men have. \n\nThe next topic is breastfeeding. I don't really know if there are any laws preventing this, but I'm fairly sure that most laws allow for it, making an exclusion to indecency laws for breastfeeding in public. I think people who give others a hard time for this are shitty people. It isn't something men do though, so it's not an inequality, it's also (to my knowledge) not regulated as being illegal. So it's mainly social pressure and commentary that is being complained about. Again, not a right being denied to women that is granted to men. If women want to urge the law to let them be topless as it does in various parts of the country, go for it. Just don't expect men to stop looking at tittys. That's never going to happen. \n\nThe next part discusses social pressures and criticisms of things like appearance and then references being judged for the brand of high end hand bag she carries rather than her degree.....  by who? BY WHO!? I don't know any men who would know the brand of the handbag, but they might judge you by your degree. A degree she is more likely to have than a man, on average, by the way.  You are judged differently from men on your appearance? probably. But if you believe men aren't objectified you're crazy. If you think men aren't catcalled you're crazy. You simply can't see what your feminist lenses filter out. This is not inequality. There is no law that can prevent how people see other people. and your depiction of judgement for the high end handbag over the college degree just stinks of your inability to see just how insane your privilege theory really is. \n\nNext up is spousal abuse and rape, followed by the privilege stack listing off people worse off than white men.  Let's take them one at a time. The deluth model makes sure men are arrested when they are the abused. The lack of men's shelters helps to ensure that there are no resources for men to get themselves and their children out of abusive homes. If they go to the CPS, they may lose their children all together, because of the lack of understanding of abused men in our society. You ignore half of the abuse sufferers because of their gender, and act like women are the ones who are invisible. Just google \"men's shelter closes\" and read.  That's feminism. that's your equality. You want to know a little nugget of info that should help you understand how much you don't understand this situation? Lesbian couples have the highest rates of spousal abuse. \n\nFollowing this you compare the USA to various other nations. \n\nSingapore, Estonia, Iceland, New Zealand. You understand that your request for equality is all over the map, you want to have the benefits of socialist systems for yourself, but you also idolize what some of the least diverse nations on the planet are able to do by being a strongly nationalist society. They have some of the most strict immigration laws in the world, while america remains to have one of the most permissive. None of this has any bearing on your equality to American men. \n\nThe next paragraph essentially creates a straw man out of the sort of person who would claim to be on equal footing to men in America. The author essentially paints a picture of a woman who says she isn't a victim, and doesn't see the world through the feminist lens. Then scoffs at this straw man, claiming she get's it. It's because these sort of women cannot bear to understand their victimized place in society, that these women who don't walk around feeling the victimhood of womanhood are simply too weak to handle the realities of our world, and their place in it. The existence of successful women, and the individuals who are doing well in life are tossed aside, with the explanation that just because a woman can make patriarchy work for her doesn't mean she isn't still oppressed... Right. It's amazing how the writer of this article can start off the list thanking all those who won her the equal rights she enjoys today, turn around and deny the equal rights she has, and then list off a bunch of factors that have nothing to do with equality, simply are issues feminism/some women have with modern society or government policy in America. Though not one can be held up as a right other citizens have that they are denied. Not one can be listed as a \"human right\" and not one can be looked at as anything more than a first world complaint when compared to what women around the world deal with. \n\nShe ends the list having never sighted one thing men have that women don't, but that she will keep fighting to make she she gets those equal rights, because even though you might feel equal in your life, you really aren't because you're eyes aren't opened, and focused through the feminist lens to see how horribly you have it.  \n\n\nHere is a list of rights women have that men do not: \n\nWomen are able to register to vote without a social contract of selective military service. Men may not register to vote without selective service registration. Failure to register for the selective service may result in fines or jail time. \n\nWomen have the only legal control grated over reproductive rights. Men have the option to use birth control or abstain from sex in order to control their reproductive rights. \n\nWomen in the USA aren't allowed to have part of their genitals removed at birth. Male genital mutilation is considered normal in the USA.\n\nIn several states, men cannot be \"raped\" by a woman. Rape is only considered to be penetrated, but being forced to penetrate is not called rape. Further, you'll notice when a little boy is raped by a woman, they call it an affair, or sex, but not rape. \n\nAnway, that's about it. Legally we are pretty much on equal ground. So when you discuss the issues, call it what it is. You are fighting for womens rights, and women's issues. But not equality. You thanked the women in the first part of your letter who gave you that. Maybe stop shitting all over their work by claiming it didn't accomplish all that it has. You have all the legal rights of men in your nation, and then some.",
    "title": "You are Equal: I'm sorry",
    "subreddit": "MensRights",
    "timestamp": 1485362231,
    "score": 11,
    "keyword": "white ceo"
  },
  {
    "text": "[Discussion] My industry seems to be hiring and promoting women more due to historical injustice. How is this similar and different than affirmative action in colleges? I just wanted to have an open discussion with y'all so let's try and hold back our biases. I should mention I am for 100% equality but do not think you should create inequality to do so, I'll explain.\n\nMy field has predominantly been male and moved female over the last couple of decades. Now it's fairly even, but the leadership is still majority men, like 70%. I feel this is due to history taking a while to run it's course, as you see the new entrants are fairly equal. Except now I hear the CEO of a certain employer is stating they want more women in leadership. It was not an official statement online but something we heard directly. I'm all for women leaders. But I am concerned with men losing out to these opportunities as a result. \n\nI find this argument similar to that of affirmative action for college admissions. I have mixed feelings but there is no doubt that I, a white guy in a small yet affluent town, had a totally better set of opportunities than say a black woman a few towns over who grew up poorer, etc. I feel that children (18 and under) have little ability to change their opportunities, so AA can help give people an equal footing their parents couldn't. It shouldn't be a kids fault they grew up in a worse place than I did. I didn't do anything to be so lucky. \n\nBut when it comes to workplaces, more so the promotions than the hiring, I feel that it's extremely unequal to promote a woman over me simply because they're making up for past injustices. I feel that if you have a college degree like mine and have the same job as I do, we are on an equal playing field. The promotion should be based on merit and work alone. It hasn't happened to me in any way, but I am wary because I'm seeing what looks like signs of gender preference at work. For what it's worth, I work with 70-80% women and am in fact the only male on my 15-person team. I am the minority which is an odd feeling. Not complaining however. \n\nWhat are your thoughts?",
    "title": "[Discussion] My industry seems to be hiring and promoting women more due to historical injustice. How is this similar and different than affirmative action in colleges?",
    "subreddit": "MensRights",
    "timestamp": 1502377556,
    "score": 9,
    "keyword": "white ceo"
  },
  {
    "text": "Essay on Feminism I need ideas on what to write my essay about. It has to be 3-4 pages long and I have to have 2-4 references. I sort of wanted to discuss women on TV and use the TV series \"The Lost Kingdom\" on Netflix (Great series if anyone is looking for new shows to watch) to help analyze some of these issues.\n\n Just a few things:\n\n1. I think women should have free birth control\n\n2. I think \"inequality\" in regards to the amount of women who are CEO's is not actually an inequality. Women are now starting to become CEO's and a change in the amount of women who are managers/CEO's is not something that is going to change overnight/within a year.\n\n3. I think the pay gap between women and men is a skewed statistic because there are too many variables involved (Workplace wage, Actual position at company, How long you have been working.\n\n4. I'm a believer that the way women are percieved by the media (magazines, news, movies, music, etc..) is very innapropriate compared to how men are treated. I absolutely believe that women are sexualized way more than men. \n\n5. I think women and men should be required to sign up for the army draft. I believe that women and men should be required to take a physical/mental health test that may exclude them from the draft if they do not pass the requirements (Too emotional, height requirement, suffering from various mental health issues, etc...)\n\n6. I believe in white male privilege in US society but other privileges exist too. I believe in privilege in general. Wherever you are, you or someone else has privilege (whether it's privilege by being thin, privilege by skin color, privilege by being a native or immigrant, privilege with socio-economic status, etc..)\n\n7. I don't think Porn has anything to do with feminism \n\n8. I don't think that violence against women has anything to do with feminism. I think violence as a whole is a issue with society and that if you are violent towards any individual without legitimate reason (Ex: self defense (physical and verbal-bullying), standing your ground) then you should be punished.\n\n9. I think one of the primary issues with women's rights is also that many women expect things to be equal while also expecting men to do various things for them such as: \n\n              1. Make the first move\n              2. Pay for things\n              3. Be Chivalrous\n              4. Fix things that are broken\n              5. Propose for marriage\nOnce these stereotypes are addressed and resolved it'll help balance things more. \n\n10. I think that there should be a divide in women and men when playing sports. I think there should also be co-ed versions of the teams.  This is not a gender equality issue, this is a biological issue.\n\n11. I agree with the movement of loving your body (both men and women do this, but I see that it is primarily women who discuss this the most). I do not agree with the idea of loving your body and finding it acceptable/okay to live an unhealthy lifestyle though. If you are overweight, you should strive to be as healthy as possible, not use \"loving your body\" as an excuse to not be healthy. \n\nAny and all comments are appreciated. If you want me to explain further into detail any of my opinions let me know ^. If you disagree with any of my opinions and would like to debate/educate me more/change my view then feel free to comment too. If your emotional because my post triggered you in some way (sorry if it did, it was not meant to in any way) and just want to tell me that I'm a dickhead, please do so in a creative way. I'm a huge fan of creative insults. \n\nThanks for the help",
    "title": "Essay on Feminism",
    "subreddit": "Feminism",
    "timestamp": 1488330727,
    "score": 1,
    "keyword": "white ceo"
  }
]