[
  {
    "text": "Company won't hire any minorities I am a white male who is an upper-middle manager at a regionally successful business in the Pacific Northwest (300+ employees on the payroll). After getting a graduate degree (combined with some Covid layoffs), I have been making strides at work and have received two promotions in the last four years. Approximately two weeks ago I got invited to be a member of a resume review board for selecting new interns and employees. This is the first time I have been a member of such a board.\n\nThings were pretty banal and repetitive at first until we arrived to a frankly over-qualified candidate who was African American. I voted that we bring this guy on but the other people I was on the board with disagreed. They said that they couldn't bring in any more African American employees until more diversity coordinators for the company were hired. I asked what the hell that had to do with anything and they said they didn't want to open up the company to \"liability for any lawsuits\" so they had to acquire more diversity resources before they could hire any minority candidates. The head of the board also stated that this directive came from the Owner/CEO. Completely disgusted, I stormed out of the meeting.\n\nThe head of HR was also a member of this meeting so I have no real avenue for filing a complaint other than via the Oregon BOLI. I have been completely socially isolated at work since this incident and anticipate I am on the verge of being fired. What do I do in this situation??",
    "title": "Company won't hire any minorities",
    "subreddit": "jobs",
    "timestamp": 1696993994,
    "score": 397,
    "keyword": "white ceo"
  },
  {
    "text": "The job-hunt is f*cking BRUTAL holy sh*t So I've been unemployed for quite some time. The last \"job\" I had was an online \"internship\" that was a) unpaid, b) promised NO JOB OFFER upon completion regardless of how well you did, and c) was so disorganized that you had to go above and beyond just to get any form of guidance.\n\nAfter a month or so, I was like \"fck this\" and just stopped following up. It really didn't seem like it was worth anything. Problem is now I was officially unemployed and facing a dreadful job market, and I knew it'd be tough, but holy shit, I didn't think it'd be THAT bad. \n\nI already have a degree from an esteemed university (like top 40ish in the world), but it didn't seem like a single employer gave a fck about that, since my experience is limited. At first, I applied to jobs that were related to my major, ofc to no avail. I thought that my preferences were too broad, I had to find a more specific specification under the umbrella that is my field (Compsci/IT). I decided to take a certification program, which at least gave me some direction. I decided to pursue something in cybersecurity (which is what the certification was for), but little did I know that \"entry level\" jobs were not actually \"entry-level\" and they required experience as well. I decided to give it my best shot regardless, but ofc, of all the applications I sent, not a single person responded to me. \n\nI asked for help online, and people suggested that I pick up a help desk role first, and that through that I could make it into a security role. That sounded fine with me. Even if I didn't have the exact role that I wanted, at least I'd have some direction in my life, plus a job (which I've been lacking for some time now). Unfortunately that didn't really change my odds that much, and I still didn't hear back from any of the applications I sent. I even reached a point where I'd cater each resume and cover letter to the job & its description and I Still don't hear back somehow, not even a \"next steps\" type of email. \n\nNow I don't know if anyone else felt this way before, but its been having some tremendous effects on my mental health, and not positive ones lol. I feel like I'm drowning. I started developing white hairs due to the stress. I've become incredibly cynical and negative and feel like shit most of the time. I cant get it out of my mind. It's almost like no matter how hard I try, I just cant catch a break. And to add on top of that, going on the most toxic social media platform on the planet, Linkedin, and watching all your connections with their \"I'm proud to say that I have accepted the position of CEO at Google\" bs. When everyones expecting you to get a job, and you're trying your DAMN hardest, and you just feel like you're getting anywhere, its truly a maddening experience. People putting these expectations that you need to get a job, like youre not already killing yourself trying to get one. I honestly don't remember that last time I was truly happy.\n\nI almost wanna go out and just scream at the top of my lungs. Like, what is it that I'd have to do to get a job? I haven't had a job in my field for a year now (I don't count that shitty \"internship\" as a job). I personally don't like to complain, but when you're spending all your energy on application, and you don't hear back from one, how can someone not get discouraged? To add on top of that, My work permit expires in like 10 months, and I cant really stay if I get some sh\\*tty minimum wage job. I'm literally fighting for my life. I can think of dating, I cant enjoy time with my friends, I'm just miserable 24/7. I'm not expecting some angel to swoop down from heaven and hand me a job, but when you're applying to multiple jobs, and you don't hear back from any, you just have this \"what else can I do really\" feeling. Just having some sort of break, or w, would mean everything.\n\nWell, I don't expect you good people of reddit to be able to fix my life issues or anything, but this shit's been eating me alive, and I figured I might as well rant here then let it consume me. Plus I figured it'd be much better posting it here than on Linkedin (which I believe is the faker than Instagram tbh). If I were to post this on Linkedin, I could very well kiss my professional life goodbye lol.\n\nHope you're having a better day than me haha, and thanks for reading.",
    "title": "The job-hunt is f*cking BRUTAL holy sh*t",
    "subreddit": "jobs",
    "timestamp": 1693356668,
    "score": 31,
    "keyword": "white ceo"
  },
  {
    "text": "Getting an itchy feeling that I’ll be fired/replaced soon from my current job. For reference I work as the sole member in our Shared Services team as a manager.\n\nI have increasingly felt like I will be pushed out of my job fairly soon. 9 months ago a new employee was hired to be a “filing legal clerk” (we’ll call her Joanne). Very small workforce currently so Joanne is essentially our General Counsel (GC)’s only support, outside of things I was doing for the GC before I started running all our a/p processes. So the GC definitely needed filing help because I was overwhelmed with accounting and the CEO requested we hire Joanne. \n\nTurns out this new person and the CEO are RELATED. Don’t get me wrong, while Joanne doesn’t know everything she has been a very good worker and is skilled in quick-learning. She is charismatic, funny, accommodating, and has been a blessing to work with in general. Nothing against her. I joined and took over our accounts payable process last year and have been pretty overwhelmed as I was the only one doing it. This took up most of my work time for a long time. But while I was overwhelmed in accounting and falling off with some of my legal duties, without notifying anyone else via email, the CEO/GC randomly promoted Joanne to “HR Manager”, and Joanne has slowly begun to handle things that I would be doing in shared services (HR, hiring, assorted admin tasks, handling of outside vendors etc). \n\nOn another note, I have been trying to transition into our development team as a sort of junior project manager, because without a finished degree (dropped out due to COVID and have just been working since then) I feel as though I’ll never move up in administration/accounting at this business. It seems development does not require a degree, just specific training/classes/experience. It really interests me as well, and as a female/POC the opportunity to break into a long-held field by older white men was too good to pass up. I have an in with the head developer and we have great work rapport. He has been slowly training me on small things when he can find time (he is EXTREMELY busy--and our only developer). \n\nThe GC is aware and seemed supportive of my choice to train into development months ago. I found this amazing online training course that our head developer says will basically propel me into the development field; asked the GC months ago if I could enroll and she's just put it off/made excuses. She has stopped answering basic message requests from me. She just scheduled a meeting with Joanne and I for this week (literally entitled “Meeting” with no subject), and I’m increasingly suspicious that she wants to just fire me altogether and not have me join development. A couple of weeks ago she asked our director of accounting to fully transition me out, stating that she’d rather the a/p process “stay in accounting” (which DOES make sense, but the timing feels fishy and she did not tell me directly that she'd went to the director of acct). I trained the new person already and have fully transitioned back into just shared services. I did not study accounting but have some previous job experience running a/r so I was fairly good at this job and actually enjoyed it--bummed.\n\nNow I find myself with little to nothing to do, other than the occasional administrative tasks with our developer (he is transitioning me slowly), and other office management/admin tasks that come with my current shared services title.\n\nI have been loosely applying to other jobs for the last few months but feel a bit panicky as I was looking forward to getting this development industry experience under my belt. Without it, I'd probably end up in office management again--nothing wrong with the job/I am good at it, but I want to get my hands on something and be more involved in our actual industry, not just back-office stuff. \n\nNot sure if I can do or say anything to executive management at this point to save my skin, but any insight would be great. My favorite mantra is \"no one knows what they are doing\", which is comforting, but dealing with the underhandedness of the GC and my lurking Imposter Syndrome has been nerve-wracking. TIA\n\nTL;DR: Executive management hired someone the CEO is related to, and feels as though I am slowly being replaced. Trying to figure out if I should stay as long as possible to get developent experience/train into a different role or cut and run (and save myself some tears/sanity)\n\nEDITED: for relevance",
    "title": "Getting an itchy feeling that I’ll be fired/replaced soon from my current job.",
    "subreddit": "jobs",
    "timestamp": 1684177425,
    "score": 3,
    "keyword": "white ceo"
  },
  {
    "text": "Should I work for a racist boss? TLDR: My old boss was toxic and racist but wants me to work part time as a contractor. \n\nBackground: I recently quit working for a very toxic company and boss as a project manager for a short time. I enjoyed the projects themselves because I’ve been doing this type of work/projects for several years. My life dream is to eventually be self employed in this type of work and I’ve worked for and with several other good companies and bosses I’m the past. The most recent though, was a very toxic environment. My direct manager was manipulative, and a micro manager. They would often lie or spread false rumors about other employees to create their own narrative and make themselves look good. They were a workaholic themselves and literally spent 24/7 on call to the CEO, and expected the same of me (and all other employees) even though they were being paid a huge amount to be on call (like $400k+) while the rest of us were being paid a normal amount ($50k-$60k). I’ve been working a long time and I’ve had my share of dealing with difficult managers, but this was a new level. The stress was manifesting in my life physically and even though the issues came up early in the job, I couldn’t afford to leave for at least a year. I managed to buck up and have several tough conversations with my manager about my own expectations and boundaries, and for the rest of my time there was able to keep them from trying to control my entire life and keep it professional. They did manage to make my coworkers lives hell, because they were not experienced/brave enough to have the same tough conversations. I tried  advocating for them but it would only go so far when they were not able to stick to their own boundaries. My manager still respected my high quality work and promoted me a couple times to take on higher responsibilities. Towards the end, they asked me to be involved in hiring process to replace one of my lower rolls. I was the 2nd round interviewer after the standard initial HR 1st round, and my manager would be the final interviewer. I interviewed no less than 10 people, all of whom were well qualified and a couple were even over qualified. There were 5 candidates I passed along to my manager who I thought would be the best for the job for several factors (flexible schedule being the main one). 4 of the candidates were black women and 1 was a Hispanic woman. I provided in depth notes on their strengths and offered to help set up the final interviews. Immediately without looking at my notes, my manager asked me to find and send their linked in and social media accounts. I assumed they wanted to check for anything dangerous or inappropriate, since it was a client facing role. So I sent the profiles I could find. Most had linked in and a few had Instagram. I’m sure they had others but from what I saw, all of them had updated and professional looking profiles. The Instagram photos were normal. Within a day, my manager let me know they wanted me to keep interviewing and asked about one of the other candidates who did not make my top 5. (A young white woman, very conventionally attractive and skinny). I let them know she had the least amount of experience and would not be able to stay late ever, which was a requirement. I had to do several more interviews only to eventually have my manager tell me “not to be racist, but they just don’t work hard and always start issues”. I was so in shock I was speechless. I didn’t ask for clarification about “they” but it was a buoys after I questioned why all 8 candidates I had sent were black or Hispanic or even just older. I realized they wanted a young thin white woman. We eventually hired the attractive one who had the least experience and ended up giving my manager some headache because she needed a lot of training and was constantly calling out “sick”. I began job hunting almost immediately and left a few months later. \n\nFast forward to today, I have a new job where I’m doing well and with a healthy working environment. My old boss reached out to ask if I would help on a contract basis with their largest project they have every year. I could charge my higher rate and only work a few hours a week until the project is finished at the end of the year. And it would add to my portfolio. I wouldn’t have to deal with the usual stress since I would be a contractor, not an employee. I just can’t get past the fact they are inherently racist. I feel like I would be selling my soul.",
    "title": "Should I work for a racist boss?",
    "subreddit": "jobs",
    "timestamp": 1694456513,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "What do you feel about Stockton Rush (Occeangate/titan submarine CEO) not wanting to hire 50 year old white men?",
    "title": "What do you feel about Stockton Rush (Occeangate/titan submarine CEO) not wanting to hire 50 year old white men?",
    "subreddit": "AskReddit",
    "timestamp": 1690514661,
    "score": 0,
    "keyword": "white ceo"
  },
  {
    "text": "International Conference Fat Shaming Obese women like me typically have thick skins (no pun intended), and this story illustrates one more reason, ladies, to stay unflappable.\n\nLast week, I was at an international conference of airline professionals: Decision makers for airlines, aircraft manufacturers, Ministry representatives from various countries, and regional executives were in attendance. I work for a company that manufactures a futuristic aircraft, which is why I was there, and one of our competitors was there as well.\n\nThis is important to the story: There are several factors used to calculate how much it costs to operate an aircraft. Two of these factors are average passenger weight and luggage weight. As an example, an airline might figure every seat is occupied by a 220 lbs passenger and every bag weighs 50 lbs - which is why you're only allowed to check a bag that weighs 50 lbs or less. If you want to know more, IM me.\n\nDuring a discussion panel, our competitor was making some pretty outlandish claims, so during the Q&A session, I raised my hand. The camera was trained on me as I held the microphone and (trying not to think about all of the people around the world watching the live stream) asked a question regarding their plan to overcome some of their aircraft's performance factors.\n\nThat's when it happened. This (unsurprisingly) American white man, instead of answering my question, made a joke about 'how we all know that the weight of passengers can vary greatly' thereby impacting aircraft performance. Much of the audience laughed. I (compartmentalized) kept my face neutral. \n\nHad I been a man, I assure you that the 'passenger weight' factor, out of all of the other factors that could impact aircraft performance, would not have been used to try to detract the audience from a glaring flaw in his claims about his product's performance, as everyone in that room knew that the passenger weight factor is the same for every seat.\n\nBut because I stood my ground and didn't (die of humiliation / burst into tears / get red faced and offended) acknowledge his slight at me, he was forced to address the question. So, I got to make my point and he got to look like a total asshole, and then I executed my follow up question with grace, and his answer further illustrated that his claims were unrealistic. I replied only with, \"How interesting. Thank you,\" and sat down.\n\nNo, he couldn't make a jab at my company's product, or the operating environment, or my CEO. He had to make a personal attack on the fat older woman who had the audacity to challenge him. And when his diversion tactic didn't work, he had to admit some hard truths in front of all of these people.\n\nAnd I get to deal with my shame and humiliation in private.\n\nStay frosty, ladies.",
    "title": "International Conference Fat Shaming",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1699707420,
    "score": 294,
    "keyword": "white ceo"
  },
  {
    "text": "Women Of Color Set Lower Salary Requirements Than White Men, According To Job Search Site [https://www.forbes.com/sites/kimelsesser/2023/02/06/women-of-color-set-lower-salary-requirements-than-white-men-according-to-job-search-site/?sh=53dbb6b7454d](https://www.forbes.com/sites/kimelsesser/2023/02/06/women-of-color-set-lower-salary-requirements-than-white-men-according-to-job-search-site/?sh=53dbb6b7454d)\n\n&#x200B;\n\n>  \n>  \n>New data from tech job search platform [Otta](https://otta.com/) reveals that **women of color provide dramatically lower minimum salary requirements than white men, white women and men of color.** According to Otta's cofounder and CEO, Sam Franklin, the differences emerged across the board for every role and every level of experience.  \n>  \n>Otta asks job seekers to enter their work preferences, including minimum salary requirements, when they sign on to the platform. Based on data from 10,000 people who signed up for the job search site in December 2022, dramatic differences emerged when it came to minimum salary requirements. **Women of color entered 40% lower minimum salaries than white men. Men of color entered 30% lower minimum pay and white women 25% lower minimums than white men.**  \n>  \n>Otta previously [released data](https://www.forbes.com/sites/kimelsesser/2022/11/07/women-set-lower-minimum-salary-requirements-than-men-according-to-job-search-platform/?sh=7b5b0b904db4) showing women choose lower minimum salaries than men, but the new data reveals how the problem is dramatically worse for women of color. Otta currently has almost one million users, and 60% of these users are women, 25% are women of color, and 17% are men of color. Although the data came from both U.K. and U.S. users, Franklin reports that a separate analysis of data from the U.K. and the U.S. revealed similar findings in both countries.\n\n&#x200B;\n\n \n\n>**The discrepancy in minimum salary requirements seems to be getting worse with time, at least for women of color.** An analysis of data of new users from the previous year, December 2021, revealed women of color were setting an average minimum salary preference 26% below that of white men (as compared to the current 40% discrepancy between the two groups). Franklin explained his take on the growing trend via email, \"The gap increased dramatically in the last 12 months. The market conditions are changing in opposite directions, making it harder for people to know what pay is fair. Inflation is putting upward pressure on salaries, but tech layoffs are putting downward pressure on salaries. Many people look to their network and peer groups to ask what's fair, but that information is becoming outdated. I expect this amplifies biases.\"  \n>  \n>  \n>  \n>Negin Toosi, a psychology professor at California State University, East Bay and a diversity expert, says Otta's statistics are \"disheartening but not surprising.\" **\"This is really about who has status in this society, whose work is valued more, and who gets to ask for a larger salary without having to deal with backlash. It's not about something inherent to women or people of color, but how they are treated,\"** she explained via email.",
    "title": "Women Of Color Set Lower Salary Requirements Than White Men, According To Job Search Site",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676463551,
    "score": 6,
    "keyword": "white ceo"
  },
  {
    "text": "Nursing week bad luck I covered a shift this week that featured a surprise infection control surveyor from cooperate. They of course, chose the most packed cataract surgery day of the week. \n\nWhile prepping to roll my third patient out I see two tiny white bugs crawl over the patients shirt (Policy doesn’t require people to change out of their street clothes). I tell charge and in recovery the patient admits they have an active bedbug infestation. (Which come on. Please disclosure so you can be the last case and we can take extra precautions. Or even better- consider delaying elective surgery.) \n\nSo everyone in the room got to go back to the locker room to change, and we needed to do an extra terminal cleaning. Infection control is making themselves scare at this point. But you bet as soon as we finished cleaning the icky bug cooties they were back asking us about how we draw meds from multi use vials! \n\nWe ended up leaving over three hours later than scheduled with crabby patients upset about the delay. But hey, at least we got a thank you email from the CEO?",
    "title": "Nursing week bad luck",
    "subreddit": "nursing",
    "timestamp": 1683867974,
    "score": 3,
    "keyword": "white ceo"
  },
  {
    "text": "CEO is trying to keep me.. continue with school or take the raise? \n\n(TL:DR at the end)\n\nHey everyone,\n\nI’m at a fork in the road.. I’m 28 (M), married, living in Southern CA. I’ve been working in the cannabis industry for 5 years, at my current company for 3.\n\nThe company is a retail chain, with about 10 stores, fairly big player in SoCal Cannabis. A mix of great people and a handful of assholes- owner is a bit of a manic coke enthusiast.\n\nI started out as a contracted employee to just do ordering at $16 an hour, however over the past 3 years I’ve been hired on full time at salary currently $64k plus the semi-regular bonus (2 a year avg). In this time I’ve built up the entire demand planning and purchasing department from a single spreadsheet to a somewhat sophisticated centralized system capable of being ran by 1-2 people.\n\nLast year I started learning Python, and been applying that to my work to increase productivity- I’ve realized that I love problem solving, and am deeply interested in science/technology.\n\nThis year I’ve been saving about 80% of my pay (I live in a cheap shit studio with my wife 29- who also works at this company) to afford going back to school full time and possibly pay out of pocket.\n\nIn the last 6 months I have busted my ass to leave on a good note, proud of my work. Building out high level assortment analytics and reporting, developing/sourcing for our multiple white label product lines, and assisting in building out our new centralized distribution- including some software solutions to reduce labor.\n\nAs the year has gone on, keeping up with my schoolwork has been difficult.  I’m still maintaining A’s but work is beginning to suffer.\n\nMy CEO is aware and I recently told him I’m leaving at the end of the year for sure. He’s a huge fan of mine and wants to go to the owner and offer $85K. Also looking into developing a new role that focuses on analytics and software solutions. \n\nMy long-term thinking is that an engineering degree has a better overall trajectory and higher pay, with a wider range of opportunity- even outside of engineering disciplines. However, that’s a serious pay raise and skips the need to pay for school. \n\nI want an education but it would be an opportunity to continue to make my own way and I would also continue to just be self taught, as well as possibly continuing to fight for more raises, long-term.\n\nLastly, ownership/cannabis is mostly greedy, engineering has the potential to be more meaningful in the world.\n\n\n\nTL:DR\nI’m a married 28-year-old man, my wife (29) and I work at a cannabis company. I’ve been there for three years, started from the bottom and built my department(s). Been saving to go back to school (engineering), when I’m ready to leave for sure, work offers a $20,000 raise and possibly a new role.\n\nCEO is great, owner is always doing coke.\n\n\nThanks everyone.",
    "title": "CEO is trying to keep me.. continue with school or take the raise?",
    "subreddit": "careerguidance",
    "timestamp": 1694824086,
    "score": 2,
    "keyword": "white ceo"
  },
  {
    "text": "Any experiences using an executive coach? I'm 30 days into a promotion, and find myself facing some difficulty in the transition. While I'm more than qualified for the role in terms of ability and experience, I find myself struggling in what could be considered a corporate environment. \n\nFor some context, I've been in my industry (pest management) for 15 years. I started at the very bottom and have now worked my way into a Regional Operations Manager position overseeing several markets throughout the southeast, with more to come. My career trajectory takes me to a VP position in 2-3 years as we grow and expand. \n\nI've gone from field route work to a branch office, to now working in our corporate location with HR, accounting, my supervisor the SVP of Ops, the CFO, CEO, and others. \n\nWhile most have been gracious in accepting that I'm very much a blue collar guy in a white collar environment, I can tell that I don't truly mesh in a fully corporate world. In all honesty, I'm not quite sure where my improvement should be focused and how to progress. I fully understand that \"office politics\" will play a significant role in achieving my agendas, and would like to figure out the best way to accomplish that. \n\nAs a result, I've been looking at executive coaches. Someone who can assist in this transition without all the bullshit of \"we'll get you a promotion” and all that. Ideally I'd find someone who can work with me on better integrating into the environment, assisting me improving my shortcomings, and how to better position my strengths. \n\nThanks for any advice!",
    "title": "Any experiences using an executive coach?",
    "subreddit": "careerguidance",
    "timestamp": 1696187268,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "Career Crisis at 27, what do I do? Hi all, this is my first reddit post and I'm going to do something I don't usually do: Be completely open and vulnerable.\n\n&#x200B;\n\nMy Current Situation\n\nI recently started this new job which is to get sponsors for an upcoming concert, it's currently September as of this post and the concert is in November. I'm doing the best I can to push for meetings with potential sponsors but my boss is hounding me to get more meetings. I can't exactly ask a CEO of a company to drop everything they're doing in order to see me. I'm just a small fry in the work. Yet no matter how many calls, emails or meetings I get, somehow it's never good enough. I checked with many other sponsorship salespeople, they've all told me that usually to get sponsors, they need to talk to them at least eight months in advance due to budgetary constraints. Anyway I feel dumb everyday for not doing my job properly. I'd been unemployed for the past year and I feel like I'm failing at the first job I've got. Prior to my year of unemployment I finished a Masters in Politics/Economics. Before the week of this post, I was in a constant state of nervousness about my job because I care and I want to do a good job. Now I'm just apathetic, the concert is two months away, we don't have any sponsors and he's expecting me to get two in one month. \n\n&#x200B;\n\nThe personal side\n\nI work in a large office building on the top floor, the view is great and the chairs are comfy. This building is shared with tons of other companies (the corporate type). On my commute to work I feel so out of place there. Everyone is wearing some variation of a white shirt and black pants. I feel like such a cookie cuter sheep among the heard. I wonder what it's all really for? I used to chase corporate jobs but now I'm wondering why. So I can put it on my CV? and I'm questioning if corporate is really for me. I spent so long chasing it and listening to the advice of others without asking: Is this what I really want? I thought directionless before when I was unemployed but if I leave the corporate stream I'll truly be directionless. At least back then I was aiming for something. Also I'm questioning materialism, so many of the other people in the same building wear Rolexes and have Armani shirts. I used to chase those things. Now I'm questioning what the purpose of having those things is and where did I get my values of needing certain names on my CV without questioning what I wanted for myself rather than listening to others. And my values of materialism too. I mean do I really want my tombstone to say that I just owned a lot of expensive stuff? And another thing, I see so many of my friends working corporate jobs in their 20s and I see my uncles in much higher positions (all scattered around the world). The thing they have in common, they all go out drinking after work on the weekends. Is this what my life is destined to be, just an endless cycle of work 5 days a week and then go out drinking with your buddies over the weekend? Not that I'm against going out for drinks, I enjoy time with my friends drinking too. But still, am I doomed to just repeat this cycle? And I can't help but wonder of all the employees who go to a corporate job. How many of them are here as a last resort because of failed dreams? I look at myself in the mirror sometimes and I don't even know who I am, what I want or what I value anymore.\n\n&#x200B;\n\nThe positive side\n\nDespite being made to feel like I'm not good enough for what my boss wants I am learning how to keep on moving and show up. So I suck at my job but I'm trying to learn things as much as I can.",
    "title": "Career Crisis at 27, what do I do?",
    "subreddit": "careerguidance",
    "timestamp": 1694014689,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "Dealing with a company that encourages A but wants(?) B Hi r/careerguidance!\n\nI ask you for advice on how to proceed with my professional life and if I am in the wrong.\n\nLet me outline my situation for you: \n\nI am employed (part-time because I'm finishing my engineering master's degree) at a small company (\\~25 white-collar employees) that manufactures several high-tech products. For the last 4 years, two colleagues of mine and myself have built a new business unit (BU) from scratch. Colleague A focused on organizational work, marketing & sales, and Colleague B on process engineering. Both of them are in management positions. \n\nMy part is technical sales and a little product engineering. In the latter role, I have created a simulation that is one of the pillars this BU stands on. I am not in a management position.\n\nAlso in the mix is our CEO. This person was described by many as more of a quality manager rather than a leader. It is fair to say that him and I don't have the best relationship.\n\nThe last involved role is the owner of the business. I've known him personally for a long time. He encourages every employee to take initiative and \"make things happen\". An infamous quote of his is \"everyone should act like a business owner and do everything that generates more revenue\".\n\nNow to the problem:\n\nFor three times now, I and colleague A taking initiative has hurt us more than it helped. All our previous actions in this regard were focused on growing this BU and solving problems that arise in the growing process of a new business. E.g. creating a new role that does solely product management as there is no capacity for that right now. \n\nWe explained our proposals to all persons above in meetings. This is the preferred way to communicate in this company. Speaking to people individually is not encouraged, especially coming from a position below the person you want to talk to. Each time we adapted the message based on the feedback from previous attempts.\n\nWhile colleague A and I try to be very careful with our wording, we've been criticized several times for bringing out issues in an open setting with stakeholders present (even though it is formally encouraged to do so). Apparently, us doing so is seen by the stakeholders as a personal attack since they are the authority over their area and external feedback implies that they don't do a good job (which we never wanted to imply). \n\nThe proposal itself, while being subject to debate, was never seen as invalid or irrelevant. However, there is never an action set in place afterward. Usually, colleague A and I pick up the work ourselves because we care about what we built.\n\nMy question is now:\n\nIs it worth sticking with this company and building a career there under those circumstances? I take pride in my work and like to put effort in. Sadly it feels like I am encouraged to run but there is a rubber band attached to me that eventually pulls me back.\n\nAlternatively, should I start a new job after my studies are finished a few months from now?",
    "title": "Dealing with a company that encourages A but wants(?) B",
    "subreddit": "careerguidance",
    "timestamp": 1679392738,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "Weird first round experience at a small company Recently interviewed with a small contracting company that raises so many hilarious red flags. Thought I'd share it here for laughs.\n\nThis company exclusively contracts for the government and works with various agencies. The first round is with the CEO and his ~~wife~~ HR manager.\n\nOnce introductions are done he starts talking about the training regimen I will be receiving from him and the various team members. I will be highly trained to wear multiple hats unlike the monkeys out there in big tech corps. Yea dude called developers at big corps monkeys. He elaborated by saying big corp devs only work on miniscule portions of the codebase with limited scope.\n\nDude then proceeded to gush on and on about his excellent bs detector, how he can sniff bs from a mile away so no one dares to cross him.\n\nNext, he asked if I smoke (WTF). I asked if he is referring to smoke breaks, he said yea, but more importantly in meetings the smell of cigarettes is a no go (I guess smokers can't work office jobs then by his logic). Next he proceeded to school me on dress code, like how the data centers kick people out for not wearing business formal so employees should always turn up in suit and tie when trips to data centers are required.\n\nAfterwards I was told I cannot be actively developing public facing side projects because whatever tech I'm trained on by this company is used for ultra top secret government projects. By that logic I cannot have public ReactJS projects on GitHub lol.\n\nI was then grilled on whether I have any criminal convictions, bankruptcies or whatever because government.\n\nTbh the entire interview was weird and uncomfortable. This CEO also uses the word \"shit\" very liberally. Each time I answer something he would try to one up me. His ~~wife~~ HR manager would always interject with stupid questions for some reason.\n\nThis CEO also mentioned he is very busy and spends most of his day at meetings or reading technical white papers to know the latest tech and trends for his ultra confidential projects I guess. Yea dude just wanna brag he read technical papers.\n\nAll in all definitely not joining them lol.",
    "title": "Weird first round experience at a small company",
    "subreddit": "cscareerquestions",
    "timestamp": 1678886838,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "We Should Be More Concerned About Palestine... I know a lotta y’all not gon like me for this. I can just sense it. I feel like y’all might eat me up for this one too but I’m gonna say it anyway. \n\nThe way the black community—at least from what I’ve seen in America—is being so non-chalant about what’s happening in Palestine right now and it is really breaking my soul. In my opinion, we should be more vocal. And before you jump down my throat, let me say this: I *get* that a lot of us do not feel like we should have a social responsibility to “care” or be involved with non-black people’s political issues, I do. I get that we are *tired*. I get that we feel that we shouldn’t be the superheroes of every single non-black issue out there in the world because our emotional labor is already relied upon without ever giving us our just due back or giving us credit, *I get that*. \n\nHowever, I feel that this situation is unique. Not only is it unique, but it is also a literal genocide. A literal ethnic cleansing. I could never turn a blind eye to something like that. I say it’s unique to us because the Palestinian struggle has been similar to our own (I’m not saying it’s the *same*). And historically, the Palestinians have had black people’s backs in terms of our right to freedom and self-determination. I just listened to a talk with Angela Davis on Sunday where she said that Palestinians supported her while she was in jail. The Black Panthers stood with the Palestinians. As did Malcolm X, Martin Luther King Jr., James Baldwin, Toni Morrison, Audre Lorde, June Jordan, Nelson Mandela. And not just in the past, but as recently as 2020, during the George Floyd protests, Palestinians were teaching how to get tear gas out of our eyes. They painted a mural of George Floyd in Gaza (I believe it was Gaza, I may have to fact check on that). \n\nI don’t see how anyone could look at these videos of dead and mutilated babies, children with no parents, people fainting, people being blasted to bits, screaming out for god to save them and not feel anything? I don’t see how you can say “it’s not my problem” when it literally is because YOUR tax dollars are funding it, and YOUR elected officials are providing weapons and getting involved in the mix. And we are way more involved with Israel than we realize. Produce, shoes, printers, fast food...either sourced directly from or funding Israel. \n\nPlus, Afro-Palestinians exist. We are out there. I’m watching videos of people in Gaza and I’m literally seeing Afro-Palestinians in the videos. Afro-Palestinians are also in Jerusalem. There are documentaries about them. So black people are not removed entirely from the situation at all. We are out there and they’re here in America. My friend is Afro-Palestinian for Pete’s sake. So it’s very fucked up to say “not my problem.” What if the black non-Americans said that to us during Black Lives Matter? I’m sure some did, but how would you feel?\n\nAnd before you come at me with the whataboutism, yes, I agree, why don’t we also talk about Sudan and Haiti? I’ve seen black people come onto these Palestinians’ live streams and say what about Sudan and Haiti and I think it’s extremely disrespectful. If a Palestinian did that to us, we would be pissed. And why don’t we ask ourselves that? Why haven’t we made any noise for Sudan and Haiti? Because I BARELY see any creators talking about it. All I see on tik tok live streams with black people are conversations about body count, and who should pay for a date, and interracial dating. Never anything about what’s going on with black people in the world today. \n\nAnyways, eat me up. I know some might not agree.\n\nEDIT: excuse any typos please, I’m trying to get them all, but my tablet has weird autocorrect and I may not see them all\n\n2nd EDIT:\n\nI should say this. It’s crazy that we can be so apathetic about a literal ethnic cleansing. If we become so desensitized to this ethnic cleansing, this genocide, then what will happen once they come for us? If we show our government, if we show the world that we are okay with this, that we can simply turn a blind eye to it, then who’s to say it won’t happen to us next? Because you *know* how vulnerable we are as a population. There should never be a time where we take a stance of neutrality to genocide. Not ever. Because I guarantee you if they can do it to them, they will do it to us—in some places they already are doing it to us as some have pointed out in the comments. It should not be that hard to say: “I do not condone violence. I do not condone genocide.” But for some reason we find ourselves trapped in the false sense of stability that America brings to us. We love to sit in our privilege here and say if it’s not on my doorstep then it’s got nothing to do with me. But no one has ever heard of complicity. We are complicit. We pay for this. Our elected officials make decisions in our names. We are complicit and much more involved than we like to realize. We are supporting white supremacy, just under a different name and to a different brand of folks. And to me, that sounds like hypocrisy. I do not accept white supremacy in *any* of its forms. No matter what name it falls under. I do not support colonialism. Now how that make sense if I say I am neutral to white supremacy? But I’m black? Come on mane. Make that make sense. \n\nEDIT 3:\n\nSomeone asked me to post numbers to call for actions. \n\nHere are some of them:\n\n[White House Comment Line](https://www.instagram.com/p/CyzK48RRPbG/?igshid=MzRlODBiNWFlZA==)\nThis one is open Tues - Thurs, 11AM - 3PM EST. \n\n[Tell Congress Ceasefire Now](https://www.jewishvoiceforpeace.org/resource/call-congress-support-ceasefire/?fbclid=PAAaYvFphm9UDi9v3TiQreAVxgZqSuyXPuCLRFgcWoAhtqKxf5Pp4RJ-CeoQg_aem_AYk1oeqKcP2Oojq6EB1jN4qWPmlSSjkQgBMWFx4GJmSunN3XKZ82uHv1l1IhZ_fL1T8)\nThis one is by Jewish Voice for Peace. It calls for you and you leave a voicemail mail using the script to your representative. Takes less than 5 minutes.\n\n[Email Your Congress Member](https://www.jewishvoiceforpeace.org/resource/email-congress-support-ceasefire/)\nThis one is also done by Jewish Voice for Peace. Literally about 2 minutes.",
    "title": "We Should Be More Concerned About Palestine...",
    "subreddit": "blackladies",
    "timestamp": 1698290869,
    "score": 432,
    "keyword": "white ceo"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 61,
    "keyword": "white ceo"
  },
  {
    "text": "Woman hits husband and husband responds. Who should be punished? Well... According to wikipedia, this happened in 2023.   \n\n\n>During a 2023 New Year's Eve party at a nightclub in Cabo San Lucas, Mexico, White and his wife Anne were filmed arguing and then getting into a physical altercation with each other, with Anne slapping White and White slapping her back. Both have admitted to this and apologized for their actions, blaming it on the high amount of alcohol they had consumed. The UFC did not respond or address White's actions after the incident. **The California Legislative Women's Caucus sent a letter to Ari Emanuel, CEO of Endeavor, the company that owns the UFC, to fire White. The letter was signed by California State Senator Nancy Skinner and California State Representative Cecilia Aguiar-Curry.**",
    "title": "Woman hits husband and husband responds. Who should be punished?",
    "subreddit": "MensRights",
    "timestamp": 1676906405,
    "score": 31,
    "keyword": "white ceo"
  },
  {
    "text": "It sounds like Oceangate CEO Stockton Rush said he didn't want to hire \"50 year old white guys\" because they aren't \"inspirational\" in an interview with Teledyne Marine.",
    "title": "It sounds like Oceangate CEO Stockton Rush said he didn't want to hire \"50 year old white guys\" because they aren't \"inspirational\" in an interview with Teledyne Marine.",
    "subreddit": "MensRights",
    "timestamp": 1688063967,
    "score": 24,
    "keyword": "white ceo"
  }
]