[
  {
    "text": "Hit a new low today It has been a struggle this year, to say the least.  Today was especially terrible, for several reasons.  My toughest group arrived to the gym completely out of control. Diving down the stairs, crawling on the floor, shouting in the halls, and blatantly disregarding all attempts by peers and myself to gain control and behave.  It took 22 minutes for the class to stop this nonsense and enter the gym.  Once they got in the gym they went bananas. I sent them back into the hall, told hem my expectations, and let them back in.  Again, total chaos.  Back to the hall we went, and I explained the expectations again.  We finally made it inside and STRUGGLED through attendance.  One student in particular was way over the top so I had administration remove him from the class.  \n\nI am so beyond myself with this class, I straight up asked them what it would take for them to respect me and to behave themselves.  What followed was the most disheartening question and answer I have ever heard.  The overarching answers were that they would only listen to their Dean, who is essentially the middle school principal.  They told me she is he only one they listen to when given directions.  They told me the only way they would stop interrupting was if they were all put in rows and made to sit out of reach from another person so they wouldn’t be distracted. And the worst answer, that most of class all agreed on was this: one student told me I need to “act black, and yell at us”.  She said that was the only way she would follow my directions.  I asked her to clarify what she meant, and she said black people yell at you and that’s how you can get us to follow directions. The other students, black and white, nodded and agreed. How unbelievably sad is that? These students literally feel that they should be yelled at.  I can only attribute this attitude to the dean.  She is a black woman, and she yells at them.  I have never experienced so little respect for adults by children.  These kids are 10 and 11 years old.  I’m meeting with my principal tomorrow and will discuss this with her.  I just can’t believe how low my class felt today.  I really have lost faith in my school, and in my career choice.",
    "title": "Hit a new low today",
    "subreddit": "Teachers",
    "timestamp": 1507684996,
    "score": 21,
    "keyword": "white principal"
  },
  {
    "text": "Did my school handle this wrong? Long post here. Yesterday as we were switching classes, there was an incident (which we all saw) in the hall involving another teacher. \n\nStudent A, let's call him Joe, calls student B who we'll call Chris, a stupid faggot. Chris walks up to Joe and says \"say that to my face one more time.\" So Joe looks him dead in the eye and says \"you're a stupid faggot.\" Chris jumps on Joe and the two start fighting. Their teacher runs over to Chris who she was closest to, and pulls him off, and he puts his hands up and walks away and says \"okay okay Mrs. T, I'm done fighting.\"\n\nSo now the teacher is standing in between both boys. Joe then jumps on her back and starts hitting her severely in the chest and neck. She manages to get him off and immediately sends both boys to the office, but she ended up with two pretty nasty bruises just below her neck.\n\nLater all 4 teachers get called to the office to give an account of what happened; we all saw it so the stories are the same. Principal takes a picture of the bruises for evidence and says the parents are on their way and she will let us know what happens. We're all thinking Joe will get kicked out for assaulting a teacher.\n\nLater we hear Chris is suspended for 5 days. Now we're just waiting to hear about Joe, and again we're thinking there's no way he'll be allowed to stay after attaching a teacher. Then we hear that Joe...is also suspended, but only for 3 days. The principal says it's because he has a behavior contract and he gets \"special exceptions.\" \n\nI know what a behavior contract is and how it works here. If the student breaks the contract, they're out. We had one kid break his contract when he got angry and called his teacher a \"white bastard\" and he was expelled about 10 minutes later. Another student was accepted at the beginning of the year, with such a bad history of schooling, and it was agreed between the parents and school that if he breaks even one school rule he's out. First day of school he walks in chewing gum and completely out of uniform, and was expelled that day.\n\nSo we have two students who were expelled for lesser incidents, and yet Joe only gets a 3 day suspension, less of a punishment than the other kid, for beating a teacher. All of us are just shocked, and upset that this student wasn't punished more severely. It's like the admin doesn't care about this teacher's safety. And this isn't even his first incident; he's been in so many fights with other students this year, fights that he started, that other kids are now afraid of him.\n\nTL,DR: student beat up a teacher and was allowed to stay with only a 3 day suspension, and got less of a punishment than the other student involved who stopped fighting, getting a 5 day suspension. All teachers are pissed.",
    "title": "Did my school handle this wrong?",
    "subreddit": "Teachers",
    "timestamp": 1483659278,
    "score": 18,
    "keyword": "white principal"
  },
  {
    "text": "How Many Schools Did You Work In Before Finding A Good Fit? What Were The Key Factors That Led You To Look Elsewhere/Stay Put? I've just wrapped up my 5th year teaching: 2 years in a small, affluent suburban district, and 3 years prior at an urban charter school in the bronx. I'm moving on to a small but elite independent school in NYC.\n\nI'm curious to hear experiences from vets who have settled down  in a position they intend to stay in, or other young teachers who intend to stay in the profession, but are actively looking for the best circumstances. \n\nDid you move around a bunch early in your career? did you persist through any circumstances that pushed you to the brink of staying in the position? What contributes most to your job satisfaction? \n\nfor me, my first position was too stress inducing because i was simply outmatched by the kids. I'm not going to act like I was in a legitimately \"tough\" school, but I was confronted with the almost cliche college white-boy in an urban classroom scenario - kids far below grade level and a lot of cultural conflict. What kept me going for 3 years were my colleagues and leadership, all of which made me feel like a was part of a professional community and gave me real job satisfaction.\n\nI looked for jobs and found a cute district in a well-off town about an hour outside nyc. Really idyllic setting, checked all the boxes you think about when picturing an ideal suburban public school job. What i found is an extremely isolating experience and highly negative teacher culture. Not a ton of \"blaming the kids\" attitude, but certainly a strong negative attitude toward policy that came from above. Also, an extremely conservative instructional regime, and an overall conservative, risk-adverse culture. I mean, the district leadership talked a good game about advancing our practice, but it was clear what was really demanded by the parents in the district, and acquiesced by the district leadership, was a clean, traditional classroom regime. The district has lost 3 principals in the last calendar year, including the guy that hired me and I really connected with. I have no confidence i'll continue to grow here, so im moving on. \n\nSo now im moving on again; i wouldn't have done so if I wasn't really confident this will be a step up and im very hopeful. But there is this concern in the back of my head that the job isn't just for me, that if this place doesn't work out, maybe it's not the school being a poor fit for me, but me being a poor fit for teaching. it's doesn't feel like that when im working with kids, but it can feel like that elsewhere in my life. \n\nWhat has your experience been trying to find a professional space to grow early in your teaching career?",
    "title": "How Many Schools Did You Work In Before Finding A Good Fit? What Were The Key Factors That Led You To Look Elsewhere/Stay Put?",
    "subreddit": "Teachers",
    "timestamp": 1497380741,
    "score": 17,
    "keyword": "white principal"
  },
  {
    "text": "White principal told staff at predominantly black elementary school to put what white students there were in the same classes so they would feel 'comfortable'",
    "title": "White principal told staff at predominantly black elementary school to put what white students there were in the same classes so they would feel 'comfortable'",
    "subreddit": "blackladies",
    "timestamp": 1493167341,
    "score": 19,
    "keyword": "white principal"
  },
  {
    "text": "How the Ford Foundation Created Women's Studies [link](http://archive.frontpagemag.com/readarticle.aspx?artid=14085)\n\n>Women’s Studies professor and feminist author Susan M. Hartmann credits the Ford Foundation with being a substantive force that created the feminist movement. In fact, Ford’s support of women’s studies and feminist causes is so extensive that it cannot be summarized in an article of this length. The subject is ripe for a full-length book. It is safe to say that without the Ford Foundation, feminism would not have been successful in gaining such a strong foothold in academia, and by extension, politics.  \n\nSee also: [The Ford Foundation and the CIA: A documented case of philanthropic collaboration](http://transmissionsmedia.com/the-ford-foundation-and-the-cia-a-documented-case-of-philanthropic-collaboration/).  \n\n>The CIA uses philanthropic foundations as the most effective conduit to channel large sums of money to Agency projects without alerting the recipients to their source. From the early 1950s to the present the CIA’s intrusion into the foundation field was and is huge. A U.S. Congressional investigation in 1976 revealed that nearly 50% of the 700 grants in the field of international activities by the principal foundations were funded by the CIA (Who Paid the Piper? The CIA and the Cultural Cold War, Frances Stonor Saunders, Granta Books, 1999, pp. 134-135). The CIA considers foundations such as Ford “The best and most plausible kind of funding cover” (Ibid, p. 135). The collaboration of respectable and prestigious foundations, according to one former CIA operative, allowed the Agency to fund “a seemingly limitless range of covert action programs affecting youth groups, labor unions, universities, publishing houses and other private institutions” (p. 135). The latter included “human rights” groups beginning in the 1950s to the present. One of the most important “private foundations” collaborating with the CIA over a significant span of time in major projects in the cultural Cold War is the Ford Foundation.\n\nEdit: someone rightly took issue with the website on which the above was published (contains some questionable links on the side bar).  So here's the CIA itself discussing the same issues, in a somewhat humorously defensive tone: \n\nhttps://www.cia.gov/library/center-for-the-study-of-intelligence/csi-publications/csi-studies/studies/vol46no1/article08.html\n\nThe data comes not from the website but from the book by academic Frances Stonor Saunders, a British historian, as well as congressional investigations.    To repeat: there is no doubt, none, nada, that CIA has used philanthropic foundations throughout its history.   The same essay was published on other [sites](https://www.ratical.org/ratville/CAH/FordFandCIA.html) as well.   \n\nFor those still skeptical, go to 26.32 in [this](https://www.youtube.com/watch?v=5CFLpZcY3ss) documentary and you'll find an actual News report by CBS from the 1970's describing the scandal of CIA using philanthropic organizations as fronts.\n\nThis is not a \"conspiracy theory\".   It is part of the documented historical record.   \n\nIn Orwell's 1984, dissident groups (represented by Emmanual Goldstein) are actually controlled by the party.   By the same token, capitalist \"philanthropic\" foundations have long attempted to steer the left in certain directions -- specifically, away from class analysis and toward identity politics and postmodernism.   Feminism is their greatest triumph.   \n\nIt's ironic that so many people blame Marx for feminism, considering that the entire purpose of funding gender and ethnic studies was to reduce the focus on class.  \n\n>\"The Women's Liberation Movement may be considered as subversive to the New Left and revolutionary movements as they have proven to be a divisive and factionalizing factor.... It could be well recommended as a counterintelligence movement to weaken the revolutionary movement.\" This was from an August, 1969 report by the head of the San Francisco FBI office.[4] Within several years, the Rockefeller and Ford Foundations were pumping millions into women's studies programs on campus.\n\nOnce again I have to stress that this is not a \"conspiracy\" since it was done out in the open, although to the extent that CIA used these foundations to disguise their involvement in domestic politics, I suppose it may qualify.   Certainly the CIA's funding of Gloria Steinem and Ms. Magazine was illegal, since CIA is prohibited from engaging in domestic counter-intelligence operations.   \n\nThere are two possibilities here: one is that the great capitalists are just really enamored with feminism.   So much so that they bankrolled the certifiable nutcase Sally Miller Gearhart, founder of the first gender studies class and promoter of male genocide.  \n\nThe other possibility is that elites aren't quite as dumb and incompetent as many assume.  They recognized the gender war as an ideal way of neutering the left by dividing and conquering the working class.   Whether by design or accident or a little of both, they have succeeded.   Pseudo-\"leftists\" today talk almost exclusively about identity politics; they alienate the white male majority by labeling them privileged oppressors; and the traditional American left -- which focussed on anti-war activism, civil rights, free speech and above all class issues -- is all but dead.",
    "title": "How the Ford Foundation Created Women's Studies",
    "subreddit": "MensRights",
    "timestamp": 1514509030,
    "score": 48,
    "keyword": "white principal"
  }
]