[
  {
    "text": "Pronoun Question I'm a straight, married, white woman. On my LinkedIn it says (she/her). It said that when I was hired over a year ago. I work at a Christian school, and the principal just called my boss on his day off, to say I need to take that down, because it seems to go against the guidelines that say we are supposed to live as our \"natural born gender\". It is ridiculous and transphobic and all those things, I know. I'm just wondering, do I have any legal recourse? I know it's illegal to discriminate based on Gender Identity, and everyone here obviously addresses me as a she/her. It doesn't really affect me to take it off, but that's so stupid. \n\nI guess I'm just asking for opinions and thoughts. I know it's not as big of an issue as it may be for a trans person and it's not like I'm trying to take the school for all it's money, it just seems so ridiculous!",
    "title": "Pronoun Question",
    "subreddit": "jobs",
    "timestamp": 1699639767,
    "score": 1,
    "keyword": "white principal"
  },
  {
    "text": "How do you all deal with this shit? I am a licensed teacher in Japan (originally from America, but I moved to Japan and got a teaching license)\n\nI have been a member of this sub for a week, and I gotta say....if I was a teacher in the U.S. I would lose my fucking mind.\n\nLet me give you some examples why\n\n1. I usually teach English (because, duh) but every teacher in Japanese junior high schools is assigned a second subject, and once a week they will join that subject's lessons as like an assistant. So I basically go observe a social studies lesson once a week, and recently it was WW2, and the teacher said oh hey, David, can we ask you about America's point of view on WW2, and why you dropped the bombs. I stood up and said, the prevailing theory of why we dropped the bombs was to save lives, in 2 ways. One, save American lives by preventing a land invasion, and 2, save Japanese lives but scaring the shit out of the citizens of Japan to the point where they would give up. Dropping the atomic bomb on Japan was the best choice. And he said, could you stand in front of the dome in Hiroshima and say that? And I said, I could absolutely say that, because I wasn't alive, and that is what I was taught. And he thanked me after the lesson, and the kids asked me a few questions about if anyone in my family hates Japan (some of them do) and I answered honestly, and that was the end of it.\n2. I taught a lesson about how a large portion of the Japanese population is xenophobic, which can lead to foreign people, especially non-white foreign people feeling unwelcome. How Japanese people, especially Japanese people older than 40 seem to have a superiority complex, and it leadls to them thinking Japan is the only country on earth with \"X\", and how in America we have a lot of people who believe the same thing. The students/parents/principals were all super cool.\n3. A girl I teach was told she looks like a monkey by a boy (she's 15, so she was devastated) and she asked me if she was ugly, and I saw you are gorgeous and any boy with a brain would fall in love with you immediately. There was 2-3 other teachers nearby, and they all basically joined in saying similar stuff.\n4. I will start this one off by saying, Japanese kids can be waaaaaaaaaaaaaaaaaaaaay more innocent than American kids, and have a very child-like view of the world. So a 12 year old girl at my school, fresh to the JHS tried out a new shampoo, and was insanely excited how soft her hair got. So when she was coming into the school she said, oh sensei, look how soft my hair is, feel it, and immediately like threw her pony tail into my hand. I let it go immediatley, and just said wow that's amazing. However, her mom was standing right there, and complained to the assistant principal, who was also outside saying hi to students. The assistant principal immediately snapped back with, I don't know if you saw what I saw, but your daughter basically threw her hair into his hand, what was he supposed to do. If you don't want her to do that kind of thing, tell her it's inappropriate, I am sure he was much more uncomfortable than she was.\n5. Every time a fight happens inside the school, me, or another larger male teacher will go break it up, get the kids into seperate rooms, figure out what happened, talk to them for 20-30 minutes, and that's it. That's the whole story. There are no police, if there are no injuries and it was a first time occurence, than there is no escalation to parents, it's just chill.\n6. If a student is being a complete fucking menace, and preventing other student's from learning. Another teacher who is free during that period will come to the room, and essentially be that kid's watcher. If the kid continues to disrupt the class to the point where other students can't learn, then the extra teacher will take them somewhere else (the gym or something) and just hangout with them until they calm down.\n7. Anytime a parent complains about anything regarding curriculum/a teacher's behavior, the assistant principal/principal answers the same way, 100% of the time. I am sorry you feel that way, we are legally required to teach this curriculum, and there is nothing we can do to change that. If you have any further issues please contact your local representative.\n8. The pay is standard nationwide, and is roughly 1.25x the national average salary\n\n&#x200B;\n\nI don't know how the hell you guys do it.\n\nAlso, I really hope this post didn't read as, HA HA LOOK AT HOW GREAT MY LIFE IS , SUCKERS!\n\nThe whole reason I was inspired to get into teaching in the first place was a few teachers I had while growing up in America.\n\nI just can't believe how fucking terrible it is teaching in the U.S.\n\n&#x200B;\n\nP.S. - I pay for 0 of my school supplies.",
    "title": "How do you all deal with this shit?",
    "subreddit": "Teachers",
    "timestamp": 1687173017,
    "score": 3002,
    "keyword": "white principal"
  },
  {
    "text": "The \"clear my list\" teachers are asking for the moon, and it isn't going over well. Just be careful what you put on there.  Our profession is in the toilet and some of these lists aren't focused as much on school needs as they are on decor.  It's just not practical to have a bunch of unwashable, furry white throw pillows in a room full of 6 year olds.  And salt lamps and wax melts and lawn chairs and literal wallpaper and a bunch of plastic plants and painted wood signs.  I have a cousin who just started teaching.  My wealthy aunt said she'd happily pick up supplies at Walmart for the whole class, but she will not buy her a $120 zebra rug to match the zoo theme!  My principal said the district prefers we not post lists on any socials connected to the school.  \n\nAsk for what you want.  I don't really care, but you should know we might get nothing pretty soon if people keep asking for Homegoods crap.",
    "title": "The \"clear my list\" teachers are asking for the moon, and it isn't going over well.",
    "subreddit": "Teachers",
    "timestamp": 1690854222,
    "score": 2792,
    "keyword": "white principal"
  },
  {
    "text": "From a student: wtf is WRONG with admin? UPTATe: a different person from admin emailed my parents and me so we could have a sit down about the administrators (and my subsequent) actions. We can decide if the original admin attends this meeting. I think they’re doing damage control. \n\nRecently almost all the copiers in the school broke except for two. One of my favorite teachers said she’d give me extra credit + community service hours if I helped her after school by going from her class to the copier 3 floors down and across the school. \n\nApparently I’m really good at blending into the walls because one of our three vice principals walked in and started having a conversation that I clearly wasn’t meant to hear. Apparently Ms. L had kicked a student out of her class that day. Why? Because he kept calling Asian people orientals. According to the admin, she shouldn’t have kicked him out because this was a “teachable moment” for him and she was “hindering his education” \n\nI’m half Asian, and I also know this kid. He’s a year below me, super good at sports, and around thanksgiving asked me if I was going to be eating  dog. It’s clear he does it to get attention, and one day I hope that attention comes in the form of a kick to the nuts. \n\nMs. L explained how his behavior was hindering the other students in the classes education and ability to feel safe at school and that she doesn’t tolerate racism in her class, but after trying several times he wouldn’t stop, so she made him leave. At this point I’m full on watching their conversation and I would have thought he just didn’t care I was there, except for what he said next. \n\nAccording to Mr. Admin, oriental might not be a polite term, but it isn’t really a “bad word” or slur, it’s just a bit outdated. And yeah, oriental used to be perfectly fine to use and some people today argue that it still is. But oriental is also a term used to group a ton of ethnicities into one little term so white people didn’t have to bother learning. It’s also a word that historically was used in order to promote racism against Asians. \n\nI decided to voice these arguments with a loud “The fuck you just say?!” \n\nI now have a meeting with this admin to discuss the disciplinary actions that I get, while this kid gets away scot free. Ironically we have a “discrimination hotline” so maybe I should call this in.",
    "title": "From a student: wtf is WRONG with admin?",
    "subreddit": "Teachers",
    "timestamp": 1675236068,
    "score": 679,
    "keyword": "white principal"
  },
  {
    "text": "Teacher being unkind to racist student. We got a new student a couple months ago. They are white and the teacher and other aide in the room are black. This is a LIDS (low incidence disabilities) room, so all the kids have some type of disability. I am an aide and white as well. The student got into an argument with the other aide and told her they didn’t like black people and neither did their mom and that’s why they wanted me to give them their spelling test and not the black aide. They then began crying because they worried the aide would confront their mom and ask her if the family was racist. **I talked to the student about this and told them they need to apologize because disliking someone for their skin color is a horrible thing and what they said was mean.**\n\nThe aide then told the teacher who was already having some difficulty with the student as far as misbehavior and laziness concerning classwork. The past couple days, the teacher has been making comments to and about this student in front of them and the other students, who laugh. For example, the teacher said, “For the most part I’m proud of you guys… except you, (student’s name.) I’m disappointed. Do better when we come back from the break.” She has also said, “Why are you asking her for a cookie? You don’t like her.” When they asked the black aide for a Chips Ahoy cookie as she was passing them out to students for our Christmas party. I can tell the student is embarrassed and wants her to stop.\n\nThe teacher already bought all the students an individual gift and told this student that she shouldn’t have gotten them anything because they don’t deserve it. **While I understand that racism is awful and I do not condone their beliefs**, I think it is a little unfair that the teacher is essentially bullying an 11 year old who obviously learned this belief at home. They lived in a very white state before moving here and they are not used to being around people who aren’t white. I do not believe this student fully knows how to interact with kids of a different race than them. To me, I’d be trying to treat this student as kindly as possible to show them their belief is false. Kill them with kindness sort of thing so they will come to understand on their own racism is a bad thing, through positive experiences with people of other races. Instead, their racism is just being cemented through this negative experience I fear. \n\nShould I say something to the principal? This is a very delicate matter and I don’t know what to do.\n\nEdit: This student is in the life skills self-contained classroom. They can’t just be “moved” to another teacher. I am also appalled that people are telling me I’m an apologist for racism??? WTF?! Did you miss the part where I told the student to apologize because what they said was bad? This student has said a lot of things that are off the wall that make me believe that their family is nutty. \n\nEdit 2: Wow. So many of you are being extremely unreasonable and assuming shit. I can’t believe you’re allowed to teach. Your poor students have a moron for a teacher. If you’re not an educator then THANK GOD but I don’t know why you’re commenting. You’re about as sharp as a marble.\n\nEdit 3: I have known this teacher for years. She was MY principal when I was a student at the school I work at. She was known to always have her paddle ready and wasn’t very lenient with the students in general. She has a paddle she uses on the life skills students as well, saying she’s “old school” and will get through to them one way or another as long as the parents/guardians have agreed to it. Her expectations are quite high and she runs a tight ship.",
    "title": "Teacher being unkind to racist student.",
    "subreddit": "Teachers",
    "timestamp": 1702660814,
    "score": 324,
    "keyword": "white principal"
  },
  {
    "text": "I wish I would have broken up with teaching before it did with me. I’ve been a teacher for 8 years…and with my wife also being a teacher this last year was just too much. Our two small kiddos were sick all the time, and we don’t have family in the area. I went way over my sick leave the last two years (so did my wife), and admin could have cared less about our situation. I work for a charter and so we didn’t have a union. My job turned into filling in for all the gaping holes that the school year brings, and because “I’m flexible” and a “team player” I was doing everything but nothing well.  I was also driving a god damn bus route all year because there are no bus drivers anywhere. I was honest with admin that I was feeling overwhelmed, but they didn’t really care. Our new principal was more concerned about looking cute, hip, and shallow as hell. Oh….I also didn’t get a lunch. It sounds horrible but I honestly kinda liked it and I really loved some of the kids. Some of them were also horrible entitled rich white trolls. Trolls is generous too, because I watched that movie with my kids, and the trolls are gangster as fuck, it’s the Bergans that are legitimately evil but also just really sad. I also worked a year in Juvie, and behavioral schools most of my professional career….so that’s my framework. \n\nFast forward to April, and the state I live is cutting the education budget again. Sound familiar? So, our “executive director” aka “the king”, starts holding “all school meetings”, which are pretty rare. His language sounded like he wrote the film “The Purge”.  Immediately, I knew I was on the chopping block because the position I had was “ support staff” and not a core teacher.  Like Beanie Babies at Hallmark in 90s… I was fucking gone.\n\nIt’s now June and we have three days left of school and I find out my position is getting cut and I’m being laid off. I got excellent letters of recommendations from the directors, and that is worth something….but I was pretty devastated…..for like 2 days….and then realized I got unemployment, which is like 200 dollars less than what my salary was and I was free. Freedom.  I started floating…. levitating between heaven and earth with my actualization that I’m free.\n\nThe school I was at was a good school, full of people that legitimately cared about the well-being of their students. Some of them were also real life Bergans, but whatever. It wasn’t this school that made me realize I just got broken up with by a crazy person but by lots of lunatics. I also may be a lunatic, but I’m kind and realize I don’t have to play with mean girls anymore. Mean people are everywhere but the teacher mean girl is a special kind of evil.\n\nI’m no teamster but I understand now that if you have any shot at bringing down the meanies you need a god damn Union. \n\nKeep fighting the good fight Teachers!  My therapist used to said that a way to prevent burnout was having a solid plan b, and or c. My situation is making me figure out what that plan B is, but honestly, I wish I would have broken up with teaching before it did with me.",
    "title": "I wish I would have broken up with teaching before it did with me.",
    "subreddit": "Teachers",
    "timestamp": 1689703462,
    "score": 213,
    "keyword": "white principal"
  },
  {
    "text": "I can't \"connect with the students\" High School ELA teacher.  First year (24F) I feel like I have committed the worst sin of a teacher: I am starting to not care if my students succeed. I WANT to teach them that magic of words, and I know I know my content. However, my classroom management is awful. They talk over me, don't listen to instruction, and get frustrated at me when they don't know what they are doing. I've been working on my communication skills and being stricter on enforcing expectations. \n\nThe students don't trust me. I teach an 100% POC population and i am a white woman trying to teach THEM about racism and social justice. They know I don't know what I'm doing because I have never taught this before. The curriculum was made by someone else and it is not working. But I don't have anything else and when I proposed to teach one of my favorite books so at least I would be into the topic, the principal said no. My coworkers told me it wasn't a good idea to ask the principal, but idk I can't just not teach what they have asked me to teach. \n\nThe main thing is that every week my mentor tells me the same thing \"You need to figure out how to connect with your students.\" I've been making small talk at lunch and opening period. I have attempted to ask them more personal questions for the Do Nows. I have been trying to include their interests once or twice. I have tried gameification with Jeopardy. None of these has work. I have made little steps with only a few students but the rest of my class has checked out. And I am not good with people. I can't communicate well. Even my friends needed a learning curve to actually understand what I am trying to say. It feels hopeless because the problem is actually me. Something I have been working on for YEARS and still can't get right. I have been burned so many times by people and I am starting to wonder if I can even do this job. I don't want to keep trying if it hurts this bad. \n\nHas anyone ever felt similarly in their first year or have any advice so I can AT LEAST stay with these students for the rest of the school year? Most teachers quit on them, and I don't want to do that to them. Thank you in advance.",
    "title": "I can't \"connect with the students\"",
    "subreddit": "Teachers",
    "timestamp": 1700403927,
    "score": 183,
    "keyword": "white principal"
  },
  {
    "text": "I was yelled at by another teacher in front of half the school… I (30, female)work in an urban charter school (K-8) in SW Ohio. I’m a title teacher (mostly with 5th grade and specials) and it’s my first year in a proper school.The job is incredibly stressful for everyone. We cope with a lot of disrespectful students and a lot of existing trauma/added challenges inside the classroom. \nBefore I explain what happened, I must explain how the 8th grade schedule works. \n\nThere are 2 teachers for 8th grade: Brooks and Dunn (not their real names, just the first 2 that came to mind.) They have their own classrooms, but Brooks teaches ELA and history, while Dunn teaches math and science. Students switch between the classrooms and their schedules alternate each day. \nSo if Brooks’s home room is with him in the morning on Monday, they’ll be with Dunn that afternoon. Tuesday morning, Dunn’s home room starts with Brooks and goes back to Dunn’s room for math that afternoon.  \n\nEvery day before lunch, 8th grade has Specials (SEL or STEM) with either Mr Collins or Mr Bacon. Mr Bacon is known for his very short fuse and his booming voice. After Specials is finished, Bacon takes the students to lunch.\nThere are 2 cafeterias and 2 lunch periods. \nThe transition to lunch is always chaotic—half the school will be moving from one place to another and the hallways are quite narrow. \nRecently, one of the 8th grade classes lost the privilege to eat in the cafeteria and now has to eat in their classroom. \n\nMain events:\nI went to do lunch room duty and was asked by the principal to deliver lunch to Brooks’s classroom. So I started pushing the trolley down the hallway. Halfway to my destination, I saw a bunch of 8th graders being led by Bacon to the cafeteria. We greeted each other and I said I was taking food to Brooks’s room. Apparently, this WAS Brooks’s class (his home room) and I was briefly confused. I told Bacon there must be some mistake, because Brooks’s students weren’t supposed to be in the cafeteria today. (Admittedly, I may have talked over Bacon briefly-but not intentionally. We just started speaking at the same time.) Bacon then shouted at me in a booming voice that carried down the hallways and it honestly left me a bit shaken. \nSo I followed that group to back the cafeteria, where the principal told Bacon to take the food back to Brooks’s classroom. Bacon apologized a bit lamely for shouting at me, saying the 8th grade had been on his last nerve all morning and he shouldn’t have snapped at me. \nIt was a minor misunderstanding that left an odd taste in my mouth, but nothing too significant—until this afternoon. \nI had to teach specials in 4th and 5th grade and the kids were rowdier and more disrespectful than normal. Throughout the last 3 hours, I was asked by at least 6 or 7 kids why I “got in trouble” with Mr Bacon or “what I did wrong” or “why he yelled at [me]”. \nThey seemed to think this was yet another excuse not to respect me as a teacher. And that’s what got me upset enough to write this novella. The fact that kids saw him treat me that way and may have concluded that I’m not important enough to take seriously. I’m already very young-looking, relatively inexperienced, and white in a 98% black school community. I have enough trouble as is. \nShould I take this issue to my mentor or to the principal? Should I chat with Bacon 1-on-1?  Do I just move on and let it go? I don’t want to cause trouble for anyone, but a lot of this feels very not-okay. \nAny support, advice, or kind words would be appreciated. \nPS-sorry for any spelling/formatting error or lack of clarity. I’m on my phone and have never posted here before. \n\nThank you!",
    "title": "I was yelled at by another teacher in front of half the school…",
    "subreddit": "Teachers",
    "timestamp": 1695668173,
    "score": 42,
    "keyword": "white principal"
  },
  {
    "text": "Are all Kindergartners feral this year? Today I was clawed, scratched, kicked, and hit by a kindergartner. I’m lucky she didn’t bite me as she was trying her best. She kicked another staff member in the face. This was close to the end of the day after she had been with me all day due to refusing to stay in the classroom. This student hasn’t been able to stay a whole day in weeks due to her behaviors that continue to escalate. She often threatens to kill everyone. \n\nIs this the norm now? She is one of 4-5 kindergartners that we have DAILY issues with. Some are on modified day. Most, if not all, are not even close to developmentally ready for school. \n\nAnd here I am, the one who is supposed to have the answers because I was hired on to deal with behaviors (didn’t know that going in, turns out I’m an assistant principal without an admin contract or any training in being admin, I’m not even a certified employee). And I don’t know what to do. My principal just wants to talk to the parents non stop and not actually do anything. \n\nI can’t tell you how many times I’ve had to pick up a kid and carry them out of the room. Teachers have been threatened, kicked, hit, etc. I get the worse because I’m the one called in to take them out, but still. Side note, we are a predominantly white, rural school with a high grade. I was a school counselor in a different town for years and never once had issues like this. Not once was I hit, scratched kicked etc. now it’s a weekly occurrence. I was out of education for 5 years after we moved and I came back and it’s like everything got turned upside down. \n\nIs this the new normal?\n\nEdit to add: I am trained in CPI, I didn’t make that clear. I am not, however, an administrator. My background and license are school counseling but they don’t require a state license to be in my position.",
    "title": "Are all Kindergartners feral this year?",
    "subreddit": "Teachers",
    "timestamp": 1677038047,
    "score": 33,
    "keyword": "white principal"
  },
  {
    "text": "How to stop this Ok, I'm not a teacher by trade, I spent 50+ years in the HVAC industry. I'm a 62 year old white male and I'm working in a high school that is largely African American I am teaching their HVAC program. I came to this last October when the former teacher retired and asked if I'd be interested. After thinking about it I decided that I really liked the idea of being able to mentor young students and helping those who had no designs on attending college, and were looking for a good way to support their lives at the next level. \n\nMostly this has been the case, the students are generally great and responsive. However..... I have a few students that I cannot get to stop being disruptive, they refuse to pay attention and get out of their seats, they talk constantly. This is bad enough for a normal class and tough for teachers who have gone to college and trained to handle these situations. These traits can be deadly in my lab if they do not pay attention they can electricity themselves or others, there is the possibility of exposure to liquid refrigerant, explosions due to the natural gas furnace that we work on and so on. The administration is supportive, but how many red slip referrals can I give trying to get my point across to these kids before someone gets seriously injured. \n\nMy second issue and the reason why I have my demographic and those of the school is their use of the N word. They state that they're using it would seem a at the end and not the r, personally I do not see the difference and it bothers me greatly. My question here is do I die on this hill, or turn my head and try to not let it bother me. I've brought in a coach at the high school and the principal to talk to them about how this word should be offensive to them, bit it fits in one ear and out the other. \n\nI'm not sure that I'll get the right answer here, and not sure that I'm really expecting one, but it did give me a place to vent and to try to work things out. Thank you for reading this far.",
    "title": "How to stop this",
    "subreddit": "Teachers",
    "timestamp": 1693552665,
    "score": 27,
    "keyword": "white principal"
  },
  {
    "text": "How to deal with entitled parents? I teach 4th in a Title 1 school. I would've never expected so much parent entitlement from this school setting, but this year most of my prep time has been spent dealing with student issues and demanding parents (and it's always the rich white parents who are in the minority at my predominantly Black school). It almost feels as though I'm punished for telling these parents anything contrary to the idea that their sweet little baby is perfect and can do no wrong. For example, I set up a meeting with a parent because I noticed a decline in a student's work. Mom reacted with anger, was skeptical of MY teaching, threatened to go to my principal, and is now emailing every day or every few days asking for \"data to back up the interventions I have put in place.\" With another kid, I wrote home to tell them that he said several insulting things to another kid (\"Your mom is fat,\" \"your writing is stupid,\" etc.) and they said that their son claims he didn't say those things and I'm lying. I'm now receiving texts from this mom twice daily asking for updates on her precious baby and what I'm doing to \"help him feel less fearful in the classroom.\" I'm feeling really discouraged and angry because I put in so much work in the first half of the year to cultivate strong relationships with students and families. Then, one small issue arises, and suddenly I'm considered a liar, a bad teacher, and someone who is out to get their kid. It almost feels as though it would have been easier to not report any issues home and just pretend everything is fine.\n\n&#x200B;\n\nWhat's worse, it would be somewhat manageable if this was one parent, but I have 4-5 parents who are this demanding. I really cannot handle this many parents demanding my time every single day. I've been having to prep for hours at home the past few weeks because all my prep time is taken by parent meetings. \n\n&#x200B;\n\nTL;DR: How do I deal with entitled parents who demand frequent contact and updates?",
    "title": "How to deal with entitled parents?",
    "subreddit": "Teachers",
    "timestamp": 1679066045,
    "score": 26,
    "keyword": "white principal"
  },
  {
    "text": "You don’t fit into the community I teach in a predominantly Hispanic and black school in the south. I am a white, female, history teacher. I understand my privileges I have and I know I will never fully understand the true struggles my kids will face, but I love and respect them. \nI have been playing a cat and mouse game with my principal to see if I am being rehired and I finally was able to talk to him today. I have had great observations, never been pulled in to be disciplined, volunteer as much as I can, and try everything to help my students pass. He then shocks me by saying he’s “not planning to rehire me at the moment for a couple reasons.” \n\n1) He needs a teacher who will do more hand holding with the students. I literally do the assignments in class with my students so they don’t have to do homework. All I require of my kids is to participate in the discussion, ask questions, and write down the answers we come up together. \n\n2)The biggest issue: I apparently was accused of a racist incident before spring break. The accusation of what I supposedly said shocked me to the core because this wouldn’t have been a slip of the tongue mistake I made. But a bonefided racist comment which I would never make. This shocked me to my core. I was never told there was an investigation, what I was accused of, and the outcome until this meeting where he’s telling me that he’s worried I would make the school have another news worthy racist incident (we had a huge one at the beginning of the year.) He then said there was no substantiation behind the claim or they found no evidence but still…\n\nBecause of reason 2 he is not rehiring me. He essentially told me to only apply to the primarily white schools in the county and none of the diverse schools. He also said that he’d write me a recommendation letter a good one but not a glowing. \n\nI don’t understand how I can do everything they tell me, use all the crappy district resources, take abuse daily, and have never complained and still I’m not rehired. I’m just trying to wrap my head around this and my anxiety is spiking that not only does someone believe I am possibly racist but this can affect my future career. I just needed to vent, because I’m spiraling thinking of every interaction.",
    "title": "You don’t fit into the community",
    "subreddit": "Teachers",
    "timestamp": 1681351440,
    "score": 21,
    "keyword": "white principal"
  },
  {
    "text": "Mentally drained This is my first year teaching and it feels like I’ve been thru a lot. I got hired on the spot for 2nd grade back in June and by the way my interview went I should’ve known how teaching at my old school would be. The principal didn’t ask me any questions about myself all he told me what he expects and how he’s very laid back. Then school starts for the kids and that’s where my nightmare begins, they put 5 sped kids in my class, 7 with behavior issues and the rest were tier 3. Now I’m not to sure if this is normal for a first year teacher but I had at least 3-4 people come in my class to check up on me every single day. \n\n\nDuring the first week of school I understood but we’re on week 5 and they were still continuing to do. One of them was curriculum person I’m not sure what her job title was but since she didn’t like the way I was teaching they made me sit in the other teachers classes to watch how they teach with my class in theirs. I didn’t mind it but at the same time I felt bad because I did feel like I was in their way. But what I feel like what the curriculum lady didn’t understand was that given the kids that I got put with it was hard teaching them and keep in mind they were beyond needy and would not listen to me at all especially when they wouldn’t take their meds. Then this other lady I knew she dealt with behavior issues with kids but again I’m not sure what her job title is, every single morning during breakfast she would walk in asking if I need help and it bothered me because no I don’t need help in the morning especially while the kids are eating and still sleepy. Then one morning she walked into my class and caught me on my phone keep in mind it’s still breakfast time but I was also looking up an activity on my phone and showed her since my wifi went out. She then proceeds to report me to the principal for being on my phone. It baffled me since I showed her what I was doing.  \n\n\nNext issue was me getting dress coded every single day.  We are allowed to wear jeans, T-shirts, cargos etc since our principle didn’t mind. So I would look at what the other teachers would wear so I can get inspo I would dress how they would except I was getting dress coded but not them. I got dress coded for wearing a white t shirt keep in mind it was a fitted shirt but it was long enough to cover my stomach. The assistant principal comes into my class along with 3 other people telling me I need to change since what I wore was inappropriate. I was confused while she told me when I walked my shirt was fine so I wasn’t sure what the issue was. She did make me change but while I went to go change my shirt I was saw another teacher wearing the exact same outfit as me and they did not tell her anything. They then told my lead teacher that I was dressing like a teenager which made me even more confused. We all wore jeans and t shirts so why was it a problem when I did it?? I later on found out it was the ladies in the front office reporting me every single day.  I thought maybe it’s because I’m young and they didn’t liked how I dressed. It just felt like every day there was an issue with me no matter what it was.  \n\n\nNow my finally issue happened I got transferred. Personally I felt so blind sided by this, an aid had walked into my class saying she’s here to cover for me. I was confused saying it’s not my conference and she was confused as well. She confirmed that I did have a meeting with the principal but we both did think it was odd since he never emailed me about the meeting. During the meeting it was him the assistant principal and hr telling me that I’m getting transferred to another school saying how they need more teachers over there except I wasn’t going to be teaching 2nd anymore that I will now be teaching 5th and that made me feel more stressed out. The reason why I got picked was because I was the last hire and that’s usually who they move around. Keep in mind they told me this on Thursday and that my last day was this last Friday. So now I felt rushed to pack all my stuff and move. They also didn’t tell my lead teacher so her and my other coworkers were blindsided by this as well. In a way it felt like I got fired but I know I didn’t, I also feel like I was never going to win or please anyone there because any time I made a mistake they proceeded to make me feel stupid. \n\n\nAt the same time I feel like I was set up to fail. I’m not to sure if me moving is a saving grace and I get a fresh start there. It’s been six weeks since school started and it feels like a lot has happened to me, I’m not sure if they treated me however since I’m one of the youngest teachers there. Has anyone here gone thru something similar or is some of this normal?? Sorry if this was a lot I just needed to vent about it all 😭\n\nEdit: Sorry y’all I had a long night and I’m barely waking up. 1 I posted this half asleep and wasn’t thinking about how this turned out and 2 for some reason when I post on here my phone glitches and won’t let me correct my mistakes that’s why there’s a lot of misspelling but I just fixed everything!",
    "title": "Mentally drained",
    "subreddit": "Teachers",
    "timestamp": 1694334740,
    "score": 21,
    "keyword": "white principal"
  },
  {
    "text": "Empty 2nd grade classroom? From what I’ve heard this can be the norm for a lot of teachers, so I apologize if I’m just complaining.\n\nI’ve been in education for years but this will be my first year being the sole teacher. I’ve assisted a few first year teachers and at the school I was at previously (same district as I am now), the classrooms were left chock full of stuff. Most of our set up time was spent sifting through stuff to get rid of what we didn’t want and organize what we did.\n\nI just found out my classroom will be completely empty, barring curriculum materials. At first I just told myself I’d work with it, but I just keep thinking of materials I won’t have or need to scramble to get by the start of the year. A library, manipulatives, individual white boards, calming space things, individual bins of supplies, etc…\n\nIt just seems so daunting to get a completely empty classroom ready by the time school starts (contract starts Aug 24th, school starts Sept 6th). Any advice?\n\nEDIT: I went and saw the classroom and the previous teacher left a LOT. The principal commented, “She didn’t really clean out her class, did she?” I was like I’LL TAKE IT! The last teacher left for a middle school art position, so I assumed she would leave literacy and math stuff. She did! Tons of tubs and files of it! Even a huge tub of legos and other games! \n\nThank you for all your advice! It was hugely helpful regardless.",
    "title": "Empty 2nd grade classroom?",
    "subreddit": "Teachers",
    "timestamp": 1691809234,
    "score": 20,
    "keyword": "white principal"
  },
  {
    "text": "Got accused of “hating” a kid Humor because nothing else fits.\n\nI got accused of hating a kid today. Why?\n\nKid constantly wanders the classroom. I informed him my policy, which is sit down and silent during work time for this particular class (they cannot wander and every time I let them talk the conversation turns inappropriate and quite frankly, vile). \n\nKid always wanders. Always. He asks me “why” incessantly when I ask him to sit down. He argues all the time and flat out believes he should be an exception to every rule. Today, I flat out told him he was not an exception and, in fact, a well documented instigator of the problem. If he wanted to help the class earn back privileges, he needed to stay in his seat.\n\nGot an email to my principal and I from his parent LIVID accusing me of hating and discriminating against him (he’s a white, wealthy athlete). \n\nHere’s the problem:\n\nI nominated the kid for student of the week after his last essay was one of the best I had ever read.\n\nI recommended him for honors when I realized he wasn’t being challenged.\n\nI have asked to keep multiple projects of his as examples.\n\nHe has the highest grade in that class.\n\nSo, clearly, the issue is the disrespectful behavior and my admin already responded with a PDF of my student of the week nomination form, explaining that the accusation was just not possible when I praise the Child’s academics as much as I do and maybe we needed to move forward with a behavior plan.\n\nWe’ll see where this goes. I think it’s a mute point now. The form and other actions clearly contradict the idea of hating the kid. I just have a class of 21 where 18 cause major issues (attitude, apathy, entitlement, the works) and the other 3 are just happy the class now has to be silent.",
    "title": "Got accused of “hating” a kid",
    "subreddit": "Teachers",
    "timestamp": 1679014691,
    "score": 14,
    "keyword": "white principal"
  },
  {
    "text": "Nigga is an empowering word. No white people can't police our use of it. And yes they still can't say it. When did these takes become controversial? I ask because I saw a post on here where everyone in the comments were bemoaning the fact a black person wanted to say nigga. They didn't mind that it it was white folks policing the black persons use of nigga. Even going as far to act like it's the same as a white person using it.\n\nAll of that thread got me to thinking. Is this mindset normal now? When did the shift happen?\n\nLike in the south everyone black I know says it. My family old and young, teachers, principals, doctors, hbcu professors. Errrrrrbody lol it's so shocking to me to see folks saying that on the internet.",
    "title": "Nigga is an empowering word. No white people can't police our use of it. And yes they still can't say it. When did these takes become controversial?",
    "subreddit": "blackladies",
    "timestamp": 1684522731,
    "score": 42,
    "keyword": "white principal"
  },
  {
    "text": "Feeling isolated and exhausted at teaching job where black teachers are the minority I’m currently working at a predominantly white staff school. I’d safe about 7 teachers out of 70 are people of color. The demographic of students is almost evenly spilt between blacks,whites, and Latino students. \n\nI returned to this school after I had a rough experience in a metropolitan area school district . I’m in Georgia btw. I did this because I thought my principal was reasonable and nice ( he was the previous assistant principal when I left the first time and was super kind).  Now I’m regretting coming back . I genuinely think my principal is trying but it’s getting to  me.\n\nOne day last week, one of my students broke down crying telling me that a white boy asked if could call him a n*gger and if his daddy was a slave ? “ I was livid . I told him I heard and felt him but do not ever make them make you feel bad about being black.\n\nI brought this incident up to the assistant principal and he said he “understood”. Never followed up with me. So I went to the principal about this and he told that he had the kid on his “radar” and that the kid was having a “rough time”. I was perplexed at why he was telling me this. He added that the kid could be valedictorian if he wanted to but was just not in a good situation now. But then my principal would jumped back to the fact that he wasn’t condoning his behavior and gave me a long story about how he grew up with black friends and because he was darker skin he was mistaken as Hispanic. \n\nI got more irritated as he continued and essentially let him finish off his point. What causes more pain is that I’m currently in school learning about critical race theory and just how awful American history is in regards to treating Blacks. I need health insurance and a salary but im fearful that if I move districts I’ll have another issue. I just want a space where I feel heard. I’m not sure how to proceed.",
    "title": "Feeling isolated and exhausted at teaching job where black teachers are the minority",
    "subreddit": "blackladies",
    "timestamp": 1674524140,
    "score": 14,
    "keyword": "white principal"
  },
  {
    "text": "Gender equity in Australia, blind, misandrist, and unconcerned with the rights and best interests of children In March 2021 the principal and teachers at Brauer College in Victoria Australia required male students as young as 11 to stand during a school assembly and 'apologise' for being male, to the female students. Despite a backlash from parents, the broader community and some main-stream media, and the clear trauma caused to the boys involved and breach of their human rights, the school principal (Jane Boyle) admitted the assembly was inappropriate, but refused to resign or accept responsibility for violating school policy, Department of Education policy, State and Commonwealth Antidiscrimination laws and UN Treaty mandates for the treatment of children. No action was taken against the school, the principal or any teacher involved. More concerning, the National Children’s Commissioner (Anne Hollands) and the Commonwealth Sex Discrimination Commissioner (Kate Jenkins), took no notice of the event, made no public comment and took no action against the school, the principal or teachers.\n\nSimilarly, boys in April 2021 at another Victorian school (Parkdale Secondary College), male, white, Christian Year 11 students were forced to stand up in front of their fellow students and were aggressively berated for being white male oppressors, so aggressively, students reported being afraid of their accuser. Again, no action was taken against the school, the school principal (David Russell), or the worker who berated and abused the boys. The Kingston Council (who provided the worker), undertook an independent review of the event, but the final report of the review has been taken down from the council web site, and there is no public record of the results. Again, the National Children’s Commissioner (Anne Hollands) and the Commonwealth Sex Discrimination Commissioner (Kate Jenkins), took no notice, made no public comment and took no action.\n\nAgain, in May 2021 a female teacher at the Como Secondary College in Western Australia, stormed into the boys’ change room where boys were celebrating results of a lunch-time indoor soccer match, and shouted at the male students, accusing them of being a “bunch of testosterone-fuelled misogynistic boys”. The teacher was upset that the boys were too loud, but abused them using unnecessary and inappropriate offensive and sexist language. Again no action was taken against the teacher.\n\nDespite the close timing of these event suggesting a culture of misandry and sex discrimination in the Australian education sector, both the National Children’s Commissioner (Anne Hollands) and the Commonwealth Sex Discrimination Commissioner (Kate Jenkins), took no notice, made no public comment and took no action. It’s difficult to comprehend why the people entrusted with the important civil task of protecting the safety, dignity and rights of children, and their right to an education without sexual discrimination, would not have acted or at least commented on these serious abuses.\n\nHowever, on reading Kate Jenkin’s official bio, she describes her role as follows: “Her purpose is to advance gender equality and the rights of LGBTIQ+ communities, consistent with the Sex Discrimination Act  and the Convention for the Elimination of all Forms of Discrimination Against Women.” \n\nIt’s hard to reconcile this “selective” biased role that seems to ignore men and boys, with the broader powers and responsibilities conferred on the Commissioner by the Sex Discrimination Act: i.e. Section 48 (g) states that the commissioner may on its own initiative report to the Minister as to action that should be taken by the Commonwealth, on matters relating to discrimination on the ground of sex; Section 44 states that, on application, the commissioner may grant an exemption to the discrimination laws. The Sex Discrimination Commissioner chose not to report to the Minister about discrimination against boys in Australian schools in March-May 2021, and has almost exclusively approved applications for exemption made for the benefit of women.\n\nWhen the people entrusted with administering the laws enforcing and protecting the rights and welbeing of all Australians, and particularly the most vulnerable (children), turn a blind eye to the abuse of the rights of some people (males), while being hypervigilant of the rights of others like themselves (female), then there is little hope of impartial treatment or protection under the law. No surprise then that the selective gendered blindness practiced by these women has enabled an entrenched culture in Australian public policy and service provision, where men and boys have been made invisible in public discourse and policy development. \n\nSo the boys of Brauer College, Parkdale Secondary College and Como Secondary College have been made invisible and their rights under the Sex Discrimination Laws of the Australia and the UN Treaty mandates for the treatment of children have been ignored, just like Australia’s homeless men, male victims of domestic violence, male victims of sexual assault/rape/harassment, male victims of suicide, and male victims of genital mutilation have been made invisible and ignored. This is gender equity in Australia.",
    "title": "Gender equity in Australia, blind, misandrist, and unconcerned with the rights and best interests of children",
    "subreddit": "MensRights",
    "timestamp": 1676426453,
    "score": 88,
    "keyword": "white principal"
  },
  {
    "text": "Richard Bilkszto, Kike Ojo-Thompson, pluralism, solipsism, and a culture clash that led to a man's suicide **Warning: Very long post. Extensive discussion about suicide and mental health follows.**\n\n\nFor this essay I am drawing from two sources:\n\n[The National Post: Toronto principal bullied over false charge of racism dies from suicide](https://nationalpost.com/opinion/jamie-sarkonak-toronto-principal-bullied-over-false-charge-of-racism-dies-from-suicide)\n\n[The Star: A Toronto principal’s suicide was wrongly linked to anti-racism training. Here’s what was really said](https://archive.is/RWzEE#selection-5255.212-5255.229)\n\nMany of my arguments below are also inspired by John Ralston Saul's book about Canada, \"A Fair Country.\"\n\n---------\n\nA man in Toronto, Richard Bilkszto, committed suicide on July 13th, 2023, after a mental health crisis set off by events at a diversity, equity and inclusion training session in 2021. He was a school principal who had a long career working in adult education and special ed. The National Post describes him as \"frequently recognized and greeted warmly within the halls of his school.\" He was 60 years old.\n\nI'm writing this because his story and experiences are so similar to my own. These two articles give very different accounts of an interaction that happened over the course of two staff training sessions. The truth, of course, is surely somewhere between the two accounts. There is no such thing as unbiased media sources in the present day, so the best we can do is to compare:\n\nPer The National Post:\n\n*His stellar career took on a sour note after he was bullied in a diversity, equity and inclusion training session for Toronto District School Board (TDSB) administrators in 2021, according to a lawsuit Bilkszto filed in court. His sin, in the eyes of facilitators at the KOJO Institute, was his questioning of their claim that Canada was a more racist place than the United States. Canada wasn’t perfect, he said, but it still offers a lot of good. For the rest of the training session, and throughout a follow-up training session the week after, facilitators repeatedly referred to Bilkszto’s comments as examples of white supremacy. The experience was humiliating — particularly because Bilkszto placed a great emphasis on equality and anti-discrimination during his career.*\n\nPer The Star:\n\n*At issue, based on news reports, were two statements. One, Ojo-Thompson challenging a beloved Canadian myth by stating “Canada is more racist than the United States” and, two, “reacting with vitriol” when the former principal objected as well as “humiliating” him by calling him a “white supremacist” and a “resistor.”\nThe Star obtained a copy of the recording of the two sessions in question from a source who was present at the meetings. Based on it:\nOjo-Thompson never said: “Canada is more racist than the United States.”\nShe never called Bilkszto a “white supremacist and resistor.”\nThe recordings reveal for the first time a fuller picture of the conversation and disagreement that has been cherry-picked, shorn off context and nuance, and presented by those with an agenda to villainize diversity initiatives.*\n\n--------\n\nIn this context, I'd like to say a few things about Canada. I am interested in **equality**, **diversity**, and especially I'd like to speak about **pluralism**. I have been writing about these things lately, from my perspective and my experiences as a white man whom all his grandparents were born here in Canada. I was born in 1989. Canada at its best is a beautifully diverse and loving, welcoming society. At its worst, of course, its history and its present are in so many ways so abhorrent. \n\nI had the good fortune to grow up in a healthy left-wing Church community, where I learned important and deeply Canadian things about how to interact as a group of people. Canadian culture is about sitting in a circle. Things took a turn for the worse, though, and I had a falling out with the Church in a way that has caused me a lot of psychic distress over the years. I recognize what happened to Richard Bilkszto and *people need to understand*. This is clearly a story of two cultures failing to communicate, this is obviously a culture clash, that had tragic consequences.\n\n--------\n\nIt is not recognized widely, but truly Canadian culture has deep roots in the traditions of the Indigenous people who were here when the Europeans first made contact. This is where we get our strange Canadian ability to all function together in such a diverse, multicultural society. We have always been a society of immigrants - around 85% of new arrivals here become citizens, compared to about 40% in the States. Canada also has one of the highest rates of interracial marriage in the world.\n\nCanada also had both the French and the English settling at the same time, so in a way Canada was never a nation-state, it was always a story of different groups of people negotiating their way through the climate. This history was covered over in the late 19th Century with Confederation and a new wave of British colonial influence. We do things so weirdly compared to other places, but we do not know our own history - today we only know the bad parts.\n\nIt is broadly recognized now how the past centuries have led to the present shocking inequality and ongoing injustice for Indigenous peoples. What is overlooked is how over these centuries there were (and continue to be, in many places) also so many positive exchanges and rich cultural development between the settlers and the Native people, an interaction that played out very differently here than in the United States, who have their own history. For a further discussion of this see the book by John Ralston Saul, *A Fair Country*.\n\n-------\n\nI believe that a fundamental Canadian value is that of Pluralism. There is more than one voice. There is more than one valid opinion. There can even be multiple perspectives that seemingly contradict each-other. There are lots of us here, and we're all different. We need to figure out how to all get along. There are so many angles, many different people with different lives, and each of us can contribute by bringing our perspective into the conversation. Pluralism is something that is deeply connected with Equality, in its real sense.\n\nThe historical context here is very different, and Canada cannot be understood simply through comparisons to our southern neighbours. As I like to joke, Canada is not America's hat! The black people in Canada whose families have been here the longest are mostly the descendants of escaped slaves. I can't speak for them, just the history and the context is *very different* and needs to be recognized as such when speaking about the culture and social justice here. Canada, in this obviously idealized image of the country, has a lot to offer to the world.\n\nThe National Post:\n*Michael Teper, a representative of SOS TDSB, described Bilkszto’s philosophy as a classical liberal approach — he believed in providing equal opportunities to all, and offering outreach to underserved communities. He opposed the use of “artificial means to produce an equal outcome” and the use of racial stereotyping in hiring and school admissions. Bilkszto previously appeared on TVO to explain the debate as it was unfolding in Toronto schools.*\n\nI believe that *this* could be what Bilkszto was trying to speak up for, if he highlighted Canadian health care and funding for social programs. It's very difficult to have your life and values be rooted in this Canadian experience because it is not something that is well-represented at all, and we so often get lumped in with our neighbours to the South and painted over with the same brush - a brush that isn't really adequate for their culture either. \n\n--------\n\n**Solipsism and the threat of Authoritarianism**\n\nThe opposite of Pluralism is Solipsism. The Pluralist understands that they are one of many, while a solipsistic viewpoint sees itself as the only valid frame of reference. For a solipsist, everything orbits around them, and they are the ones who are here to direct and teach the rest of us and show the way forward. Solipsism comes with Dogma, Theology, entrenched viewpoints - we've reached a point where feminism in the 21st century needs to be discussed in the context of religious doctrine.\n\nThe person who showed me the article from the Star described the situation as being between people who are progressive and people who are still learning. This makes it sound as if any objection must come from a point of ignorance. It is autocratic, and at its very worse this is a looming threat of Authoritarianism. There are many frames, and all of us can learn from the others, and if we believe truly in equality in this century, this is what needs to happen. Of course, inequality still exists - there is disagreement here on the means, not the ends.\n\n-------\n\nThe Star:\n*In response, Ojo-Thompson leans on her personal experience as a Black woman to say: “I felt more normalized as a Black woman there than I do here. We’re invisibilized from the cultural fabric of this nation. Canada has never reckoned with its anti-Black history,” and, “I lived in the South. And I’m saying this factually without any hiccup. The racism we experience is far worse here than there.”*\n\nShe did not grow up here. She's *welcome* here. Of course this does not invalidate her as a person, or her perspective, it's not a bad thing that she is from elsewhere, just she is bringing her context as a person who grew up in a very different society. She is bringing to the table a comparison between her experiences in the US and Canada, and she is surely completely right that in many ways her time in the South was preferable. That is not at all what I am objecting to here. \n\nShe is only one person. She is one of the voices in the room. I object to the shape of the relationship that she makes with the participants of her workshop, putting herself in the position of authority, like a preacher - and taking full control of the conversation in the room. She clearly knows who her enemies are. A leader should be a facilitator and should create space for something beyond us to form between us. \n\n-------\n\nThe Star:\n*At a subsequent meeting the next week, Ojo-Thompson began by revisiting the concept of resistance that she mentioned even before the interaction with Bilkszto and how resistance upholds white supremacy. “I want to open by going back to the concept of resistance,” which “is going to be the most transformational, because we don’t talk enough about the many, many responses to the work, what they look like.”*\n\n*Soon after she says, “One of the ways that white supremacy is upheld, protected, reproduced, upkept, defended is through resistance.”*\n\n*Then she references the interaction with Bilkszto from the previous week, saying, “who would have thought my luck would show up so well last week that we got perfect evidence of a wonderful example of resistance that you all got to bear witness to. So we’re going to talk about it, because it doesn’t get better than this.”*\n\n*She's quoted as saying: “So we’re here to talk about anti-Black racism, but you in your whiteness think that you can tell me what’s really going on for Black people? Like, is that what you’re doing? Because I think that’s what you’re doing, but I’m not sure. So I’m going to leave you space to tell me what you’re doing right now.”*\n\nLet me be snarky for a moment here: What does she know about making space, really? Does she honestly believe that her behaviour here is making space? He was chastised for the way he attempted to interact. The ability to make space is sacred, and she is being sarcastic to him about it.\n\n**He tried to present himself as an equal to her**, and she repeatedly cast him in a negative light for that. She was the one in the position of authority. And she took it on and started using him as a negative example. \n\nThe Star criticizes him for not asking the right type of questions - not looking up to her from a submissive role, for him not being a diligent pupil:\n*That’s not a help-me-understand question typically posed by workshop participants to trainers. That’s a man saying to a woman, an expert on anti-racism, at the end of a session that is replete with history, data, experience and nuance, that she’s flat-out wrong.*\n\nThis is egregious. He did not say that she was outright wrong, he said that Canada had good things too. Ojo-Thompson is out of line. What is being described here is not Equality, it is one person casting herself as the Authority, the Leader and the Teacher. Furthermore, to claim authority by having science and data on your side is another hallmark of an over-regimented solipsist, who wants control over what is and isn't valid. She needs to learn to be one of many, so that we can all move forward. And, of course this is not to say that inequalities do not exist. Such an objection to the argument I am giving here would be in poor faith. \n\nThe beautiful thing about being Canadian is that I do not need to negate my culture, in order to welcome yours. My culture is not here to be overthrown, it's a beautiful, living, healthy thing. Cultural growth happens best through mutual understanding and exchange - the path forward is revealed in front of us merely if we'll have the conversations. There is still so much work to do, but it has to happen truly as equals.\n\nThis kind of interaction happens all over the world these days, not only in the Canadian context, but it is important to understand how deep of a cultural attack it was on Bilkszto to associate him with white hegemony and to call his words \"resistance.\"\n\n---------\n\nThis man's suicide is consistent with my own experiences being male in our society, and it is spoken about in similar terms in many places where men speak about these things. This is not an isolated case. This is a common pattern in men's experience today: wanting to contribute, not knowing how, trying something, then getting a hostile reaction. He was a special ed teacher, adult education, etc. - was this man autistic? He was surely walking to the beat of a different drum. We'll never know.\n\nWhat I do see though, is that he was trying to make a positive contribution to the community. He was living a generous life, and likely had his own idiosyncratic views of things. This workshop probably brought up a bunch of feelings buried deep inside. That's the male experience today. Self-censorship, self-doubt, and feelings of guilt associated with having your own views, which in turn leads to feelings of alienation, and then it just gets worse and worse and spirals out of control when you try to find help.\n\nIn the article in the Star, they highlight how he didn't speak up until the last 10 minutes of the session. Kind of with a tone that's blaming him for that. You know what I think was happening? I think until then, he was too afraid to speak.\n\nThe article in The Star calls this man's suicide an \"isolated incident.\" I find that shocking.",
    "title": "Richard Bilkszto, Kike Ojo-Thompson, pluralism, solipsism, and a culture clash that led to a man's suicide",
    "subreddit": "MensRights",
    "timestamp": 1690773568,
    "score": 9,
    "keyword": "white principal"
  }
]