[
  {
    "text": "\"Instafamous\" teen called out for having period accident caught on camera, sticks up for herself in a way I wouldn't have at 17 This instafamous girl I follow (don't judge lol) was recently photographed by paparazzi at the beach with her boyfriend. She was wearing a white bikini and unfortunately, as we have all feared and many of us have ourselves experienced, some blood soaked through. Someone posted the picture to instagram and people were absolutely TRASHING her in comments--more girls than guys even, wtf! \"Nasty\" \"Ew why would you even swim on your period that's disrespectful to other people in the water\" etc. She has over 7 million followers and dozens if not hundreds of fan accounts that exclusively post photos of her gathered from all over the internet so it wasn't just like a handful of people saying this stuff... it was quite a few. \n\nMadison commented back really eloquently, saying that periods can be unpredictable, accidents happen, and those who thought it was unclean and gross should \"get your head out of your ass\", and basically that she was proud to be human and not a sterile robot. It just made me feel good to see a young woman of 17 be brave and confident enough to stand up for herself (and all women) when faced with what has historically considered one of the worst embarrassments a girl can endure. She brushes it off like it ain't no thing, because it ISN'T! At her age I would've been mortified so it made me really happy to see her response. I thought it was very positive and it made me feel good so I wanted to share it with you guys. \n\nCan't find original post that people commented on, but was able to find a screenshot someone captured of her response to the comments below the circulating picture:",
    "title": "\"Instafamous\" teen called out for having period accident caught on camera, sticks up for herself in a way I wouldn't have at 17",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1483779188,
    "score": 783,
    "keyword": "white judge"
  },
  {
    "text": "I was raped on Wednesday and I just needed to write about it a little Why am I so focused on insignificant things? Why am I so bothered that I have to leave my favorite pair of thrift store jeans on a piece of paper spread across the bathroom floor? They cost me less than ten dollars and they were starting to get loose around my hips anyway. Why do I care when the detective and her partner take my bedsheets away in a brown bag? I got them with a coupon at Bed, Bath, and Beyond and the thread count wasn't even that high. Why do I fear that my nurse will judge me when I mention to her I dyed my pubic hair purple a few weeks ago after she clips away several strands? Why do I worry that calling the strawberry Zofran tablet I dissolved under my tongue an antiemetic will make me seem too knowledgeable about a process I've never been through? Will they think I'm lying because I circled around the parking garage a couple times across from the police station instead of just parking in a handicap spot right out front? Will they tell me it's too gray to proceed with charges? I had told him ahead of time that I didn't want a relationship or sex. I told him that things were moving too fast and I was still in love with someone else and I wanted to be celibate for the next year. I told him all of this before we met and he agreed that we should just be friends. And still he came through my door and hugged me and later said on the phone that I gave him mixed signals because I sat down on my bed. I was wearing a t-shirt and jeans. I wasn't trying to send any signals. He started kissing me and I hadn't even looked at his face yet. So he kissed me and I kissed him back even though I didn't want to. And he slipped his hand under my shirt and grabbed my breast and asked me to take my shirt off and I did. And he gnawed on my left nipple piercing and I looked at him for the first time and felt disgusted. And my pants were off and I can't remember how they ended up down at my ankles. Did he do that? Did I? He's biting at my stomach and touching me and licking me and I don't want this. I keep turning away and he asks me why I won't look at him and why I'm hiding my face. I tell him I'm shy because I'm scared if I tell him I think he's repulsive he'll get mad and sometimes when men get mad they hit you. Sometimes when men get mad they kill you. So I just roll over and lift my comforter over my face like a child watching a horror movie. His pants are off and he's standing on my bed looking down at me and I feel small. I don't want to look at his body. He doesn't look like the person in the pictures he sent me. He doesn't even appear to be the nationality he claims to be. He wedges himself between my legs and tries to fuck me and I tell him no and I'm so proud of myself. And he's says \"ok\" and I'm relieved. I explain to him that earlier in the week that things got out of hand at a photoshoot and I slept with the other model and even though it was consensual it wasn't something I felt good about. And he seems like he understands and he says he's sorry about that and then he asks when I'd last been fucked prior to that. I keep turning away. He holds me, spoons me like we're some couple and not strangers that met less than half an hour earlier. And he's touching me again and I feel his fingers near my vagina and then suddenly his fingers are gone and his fucking dick is inside of me and my body slumps like a scruffed cat. I'm lying there, I'm a body, just a body, I'm frozen, he's thrusting into me and I can't believe this is happening and he tosses my body around like I'm not even a person underneath all this flesh. I don't know how much time passes. It feels like a minute or two. He doesn't ask me if I'm okay or if I like this or anything. It's like I'm not even there. And finally I'm able to speak again and I say \"I don't want to do this\". He says \"do you not like me?\" and I can still picture his fucking pathetic face when he asks me this and all of a sudden all I can do is cry and repeat \"I don't even know you I don't even know you\". He says sorry and asks if I want him to leave and I say yes and then he insists that he's going to take me somewhere and I tell him to leave. He asks to use the bathroom and I give him permission and he leaves my house and before I can even get up to lock my door he rings the bell and I realize his sunglasses are on my dresser. I'm wrapped in my comforter and I hold the glasses through the crack in the doorway. Why the fuck do I offer him such courtesy? I shut the door and run back into my room and cry and I want to scream but I don't because I think if I start I'll never be able to stop.\n\nYesterday, the day after, I bought a white pages account and looked up his phone number. He had never told me his last name, just his first name. It turns out it wasn't even his real fucking name. I thought he didn't look Spanish and it's because his name is Pakistani. And when you Google his name it looks like he got married a little over a month ago. He's a rapist and a liar and a piece of shit and I'm so fucking angry.",
    "title": "I was raped on Wednesday and I just needed to write about it a little",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1503108495,
    "score": 87,
    "keyword": "white judge"
  },
  {
    "text": "A judge in White County, Tennessee has issued a standing order offering a 30-day reduction in jail time to male inmates who get vasectomies and female inmates who get a Nexplanon implant in their arms",
    "title": "A judge in White County, Tennessee has issued a standing order offering a 30-day reduction in jail time to male inmates who get vasectomies and female inmates who get a Nexplanon implant in their arms",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1500759691,
    "score": 40,
    "keyword": "white judge"
  },
  {
    "text": "Help me help my wife who is dealing with rampant sexism at work? I read through the rules and I think I'm okay but please let me know if I should be doing something differently or posting somewhere else.\n\nSo here's the situation: My wife is a criminal prosecutor operating in one of the biggest boys club jurisdictions within 500 miles. She's been a lawyer for less than two years and works on a contract basis. I'm still finishing school so she needs to hold on to that job for the time being.\n\nThe problem is that she is being disrespected by her co-workers, defence lawyers, judges, and court staff on a daily basis. Despite graduating at the top of her class from a good law school, being incredibly good at her job, and highly respected by the women she deals with, her direct supervisors don't trust her and are constantly trying to keep her down. Comments about her attire, mansplaining, inappropriate conversations, limited opportunities, the whole thing.\n\nThe office is also understaffed and there are a million other issues making her miserable, including working 70 hour weeks. She's complained to management before to no avail and is feeling hopeless. She left a lot of money on the table to pursue this line of work and it's the only job she's ever wanted to do. Leaving now likely means she'll never be able to return. We also aren't in a position where relocation is possible. She comes home every day fuming and wondering how she can possibly keep this up and I honestly have no idea what to say. I'm incredibly angry about the shit she gets put through but there's nothing I can do to change that.\n\nMy questions are about what I can do to help her when she's not at work. \n\n1) Reading is her biggest escape, so I'd love to get her some feminist(ish) to read that might offer some peace and encouragement during her non-working hours. Any recommendations?\n\n2) Has anyone received comforting words while dealing with this kind of situation? I'm a straight, white, male and while I can certainly appreciate what she's going through, I can't offer a whole lot of perspective.\n\nWould really appreciate your help. Thanks a lot!",
    "title": "Help me help my wife who is dealing with rampant sexism at work?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1489505092,
    "score": 21,
    "keyword": "white judge"
  },
  {
    "text": "My (now) husband has helped me a lot with my depression and anxiety, so I wrote a poem about it. I'm new to this so please don't judge too harshly. \n\n\nThe Unfinished House\nIt has taken me years to realize why an incredible man would choose a broken woman\nWhy he chose a project, an unfinished house \nGood bones, but the structure is weathered \nA nice exterior, but walls that are starting to decay\nWithout proper care they will rot. \nIt is an unfinished house, but instead of the flaws, he saw potential \nHe saw the character crafted by years of wear,\nThe dents and scratches from turmoil and adventures,\nThe damage caused by precious inhabitants,\nBut he saw past all of the flaws. \nHe saw what caused them, and what the house had withstood\nInstead of seeing its defects, he saw its resilience. \nIt stood through it all, and still it is standing. \nAnd that is what he loved. \nNo curbside appeal, no pretty white picket fence, \nBut he never wanted perfect. \nHe wanted it to be real, and he wanted it to be strong. \nAnd finally I know why an incredible man chose a broken woman.",
    "title": "My (now) husband has helped me a lot with my depression and anxiety, so I wrote a poem about it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1504515978,
    "score": 14,
    "keyword": "white judge"
  },
  {
    "text": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear. Hi everyone. I don't really have anyone to bare my heart to right now. I want to send this out to the universe and see what comes back. I would love to hear your perspectives.. whatever corner of the world you're in.. whatever life path you've walked. I really appreciate all your voices and Reddit so so much. I'll try to keep it condensed and simple. \n\nI dated a narcissist for eight months. He was incredibly cruel and selfish but hooked me with rare very special moments of revealing a deeply hurt.. damaged.. wholesome.. helplessly pure childlike heart. He would verbally and emotionally abuse me but sometimes with time, he would realize how hurtful or selfish his actions were. With sincere tears in his eyes he would apologize and express that he's learning and wants to change.. express that his cruel actions and words are purely from ignorance because even his own mother never showed him any love, open-heartedness, gentleness, morals. \n\nIt doesn't come as a surprise.. he experienced a horribly abusive heartbreaking childhood. He used that excuse almost always. And being an empath.. my heart opened and poured for him, I wanted to love him more. Help him see all women aren't money hungry and out to lie and cheat. Show him it's okay to open and be vulnerable. My upbringing wasn't perfect either. I honestly felt we were both \"breaking\" our cycles of hurt from the abuse and neglect our parents created. (My family was very poor growing up and my father abandoned my mother, sister and I when I was 12.) He always said such amazing things about growing old together.. building character through experience.. being there for eachother.. building a life and family together that's strong and confident (him) but sensitive giving and loving (me). He would say I am the best person he's ever met with character he values most above anything. That I have changed his life forever in all aspects of his life.. work. And I was learning a lot about patience, understanding, and forgiveness. No relationship is flawless and flatlined. I appreciate and value rolling with the punches of life. Struggle is what makes you grow.. its what broadens and builds your mind and heart, I love that. And I love the idea of a life partner who is down to walk the sometimes mountainous path of life with you. I appreciate open-mindedness and the will to adapt. Effort is so beautiful. Anyway.. I honestly believed we could awaken together.. Live more and more with awareness.. and mindfulness.. and learn together. But I was wrong. He would do things like tell me his ex was exceptionally beautiful.. she was a professional model.. but I'm pretty. His other ex is very smart. But I'm definitely not smart. I'm talented and creative. But not smart because my brain is not wired to be a coder or engineer. This is one of the most painful parts. I stayed with a man who fought me and defended himself for the right to call me stupid.. many times. He would tell me my problems are trivial.. that he doesn't care about my pleasure.. several times he would fuck me and just roll over. I would silently cry in the dark and masturbate next to him as he snored. We fought so many times about our sex life. It was always selfish and only about him. There were times I would be very ill or very drunk and he would just go ahead and fuck me.. even when I'm barely conscious. I would just lie there in the fetal position. He said that was one of the great things about me.. \"I never left him wanting.\" He was so proud that he's slept with 120 women. He told me I was the first one he gave eye contact with when having sex. And he said he typically didn't kiss the girls he'd sleep with. That I have no idea how much he's changed. I brought this up so many times.. that I want to make love.. sex should be us sharing how we feel physically.. it's about both of us..and he just didn't care. He would say sometimes sex is just carnal and sometimes he needs to be a man and take it. It's just about him. I never once orgasmed in the 8 months we dated. He never tried. It was always for him. He went down on me maybe 3 times in 8 months. He blamed it on me. He said some women aren't confident or comfortable orgasming in front of people. He would say some girls orgasmed as soon as he put his dick in them. Typing this out I know it sounds fucking heartbreaking and pathetic. I know. If I heard all this from my sister or if my future daughter were telling me all this... I would be utterly mortified and devastated for them. Sometimes it's very hard to see unobstructed reality when you're struggling in the middle of everything. He would fall asleep after I drove 22 miles to talk about how he's hurt me as I am crying next to him in his bed. He once dropped me on the side of the road with all my luggage to take an uber home after a road trip when I said I wanted to go back to my apartment, not his. \n\nHe has a very unhealthy relationship with sex. He was once over 500 pounds but with sheer will.. starving and lifting he lost 230lbs. From age 30 to 35 he overcompensated by \"fucking and conquering as many women as possible doing whatever it takes to make them comfortable\" His greatest fantasy is rape. He would often tell me his greatest \"id\" fantasy is to kick down a door like a Viking and violently rape a wife as his defenseless smaller frightened husband is forced to watch in horror. (My ex is 6'5) He used to \"jokingly\" say rape victims often orgasm because in a subconscious level they loved it. He would joke and say 50 shades of grey is about him.. and there's a reason why that franchise is insanely popular. Women love and want to be raped on a cave man level. He absolutely lovess the new Westworld for how brutal and fetishized rape, pleasures, violence, dominance, and indulgence is. He would often say when he looks around and thinks about it.. his character and life is similar to most leaders. The greatest leaders he knows arent emotional, overly caring, sensitive, \"squishy\" or giving. Superstar singers.. athletes.. businessmen like Steve jobs.. world famous video game designers.. they all have one thing in common. They \"lick the earth\" as he would put it.. and they dont hold back their id-driven desires. That is the source of their greatness and inspiration, especially as an artist. Being a sensitive \"squishy\" ..That all seemed so empty to me. \n\nHis dream is to have a line of hundreds of women waiting their turn to be fucked.. he impregnates them and doesn't take care of the babies. \"Like a Viking king\" He often said sex is a need. If he doesn't have sex in two weeks everyone starts to look like meat. He doesn't care. Men and women alike. I tried to understand the root of this manifestation. It was horrifying to hear but in all these stories.. all I saw was this nerdy obese kid who was ignored all of his life... a guy who was so ignored that he lost his virginity to a prostitute... this poor 7 year old boy who would be locked in his room for days by his horrible stepfather. His cries ignored by his cold mother to ensure her loans are paid by this new man. It all screamed suffering and heartbreak. Especially because I personally know several women who have experienced rape and I have been volunteering with The Rape Foundation for several years. I really tried not to judge. How can you.. life is crazy and sometimes devastating and sometimes you dealt difficult cards.. like your parents. And humans are capable of such cruelty.. a lot of times they genuinely think they're doing the right thing. We also got into many painful fights about his views on having children and marriage. He said he would absolutely test the blood of his babies. That was a deal breaker. I would explain how hurtful that is. He would say its not about me. It's statistics. Women will lie and have men financially support children that are not theirs. (This is what his mother did to his stepfather. When his stepfather found out. He began to abuse my ex from a very young age.) He also said 80% of women initiate divorce for the payday. So if marriage was a deal breaker he would consider \"many types of arrangements\" with the help of his lawyers. \n\nAnyway.. 8 months we dated. He made me cry 1-3 times a week. But when things were good we were both adventurous.. incredibly playful.. tender.. driven.. and affectionate. We both love similar music and movies. He would sing to me.. we loved going on long drives and talking about life.. this existence.. our hopes and dreams. We are both class clowns. But one thing was rawly clear. We were cut from different cloths. He's a big tall trump loving white guy from Texas who always lived in a big house.. no student loans.. went to art school.. atheist.. first job was after college for a video game company.. etc. I'm a Korean American from the east coast who was raised by a struggling single immigrant mother.. have had at least one job since high school.. lived in my car in NYC.. put myself through college thus have student debt (this was a big issue for us.. he said for him to even consider marrying me.. I would have to get rid of my debt. I'm the first one in my family to go to college).. insatiably curious about spirituality.. religions.. philosophy, the human condition. I am such a sensitive giving tender hopeless romantic easily hurt squishy. And he's just a confident iron fist, force. His mother and the rest of his family believe vulnerability and feelings equal weakness. A few times he was very vulnurable and shared how when he get married and starts a family, he plans to stay away from his family because they are all a very certain way. \"poverty mentality\" is what he would call it. He would share how his mom never cared.. and still doesnt care about his problems when he tries to open up to her. One time when he dumped me he said.. his mother is so strong she has never cried ever in his life. And I cry all the time. He would resent her for her hard coldness but I don't think he's aware of how attached and proud he is of her. He'd laugh and say \"my mom is a tempest. Shes the boss of the house, what she says goes, she gets her way, she's dominant she's fierce. She's a force.\" He would express how the other girlfriends he introduced to his mom were shredded apart and would end in tears going up against such an intimidating woman. I see right thru all that. His mom holds a tremendous amount of guilt. He never once talked to her about how her abandoned him while his step father would abuse him and lock him up. For days he would sleep on a bare mattress.. starve..  and go to the bathroom in the room. He said he became obese because of this feeling of having absolutely no control and not knowing when he'll eat again. It's so heartbreaking. When he got older his step dad and mom sent him away to a military school for delinquent kids. He would be locked in his dorm for days as well. He would beat kids up and created a group of friends that he \"protected\". Multiple times he told me about a very feminine kid who would massage him in exchange for his protection. My ex would explain if they locked him up in his dorm for a few more weeks he would have absolutely fucked that feminine kid. My gut tells me he did a lot at that school that he'll probably never tell anyone. \n\nI see thru all this. He and his mom have taught eachother to pretend like nothing happened. This is their way of comforting eachother.. pretending like it went away. As a woman.. as a super sensitive aware woman.. I know she's holding a lot of guilt and sadness. She's created such a tough persona she can't get herself to let it out. People will live a lifetime running from feeling. \n\nMy ex is incredibly charismatic to his coworkers and he's loved and well known at work. Many shy guys at his video game company idolize him and his ability to sleep with many women. He's this fearless jokester who is \"untouchable\". He is very proud of the fact that he hit the \"jackpot\" being born a tall white confident man. He has absolutely no one he's responsible for except for himself. Im very close to my mother and sister and when my parents divorced I pretty much stepped up and felt responsible for keeping the three of us together. Since high school I started to help financially support our family. He couldn't understand that. He'd simply say it's very good of me. \n\nAnyway..\nWe are such opposites and we knew this from day one. I was WAY too giving. I paid for amazing vacations because he had never snowboarded.. snowboarding was my life from middle school to college. I always drove to his place in Santa Monica (22 miles away from my place and my work.) I always planned amazing adventures.. things he's never done in LA. He surprised me with a candle lit dinner once. The first three times we ever went out to dinner was my idea and I treated him. He used to say I am the balance and light that will melt the ice and softened the thorns around his heart. I remember one time he was just in awe. He didn't own any plates or cups so we went to target and I got him some essentials. He said he had never been treated or cared like this. In the beginning, he did hand draw me pictures of me which was really touching. He had flowers sent to my work. Once after we fought and once after I stayed with him while he got a gal stone removed. He used to say he had never spent money like this for anyone. He used to never even buy girls drinks before taking them home. So many times I told him. I don't care about the money spent. Pick a dandelion for me. Let's share a mcdonalds apple pie on the beach. It's the thought care and effort that is so special. He just never got it. \n\nHonestly as the days pass and I continue to practice Shambhala meditation, contemplation and mindfulness.. I see I was YEARNING for that strong eternal male energy love... the love of an unconditionally loving caring father that I never had. He broke my heart 1-3 times a week for 8 months, honestly my heart and gut knew it was very wrong. But my yearning to fall in love.. to GIVE the love I hope to receive.. and the yearning to settle down blinded me. I gave the love that I wish to receive. Even though my ex didn't deserve it. The biggest lesson I am walking away with is why did I stay for so long. That's where I am going to learn and grow from. That's where my self love needs to focus on. Believing in someone.. believing in hope.. believing in good and forgiveness are all wonderful things but there needs to be an unbreakable boundary where my self respect and self worth isn't brutalized. And I need to have self love and strength to walk away. For good. Even when they're crying, apologizing, explaining, or making the most beautiful promises. \n\nThe very last week we spoke. I texted him in the morning after fighting the night before. He bit my head off about bothering him at work. I went silent after that. After several hours he emailed me explaining he fucked up and when he gets emotionally overwhelmed he doesn't know how to deal. He said he loved me.. loved what we've built.. that I am a ray of sunshine he has been able to capture and he will never give up. He said he was going to come over that night to fix things. \n\nI was so exhausted and broken.. I couldn't get myself to respond. I just didn't get it. Me caring.. me reaching out being affectionate.. texting him to see if he's okay.. all of that to him was nothing but an annoyance and a horrible burden. If you have so many excuses against it.. and so much aggression and aversion against it... why be in it? How can I apologize and be sorry for burdening you with my affection? Poisoning your life with my love? \n\nAfter getting no response for 5 hours he texted me. \"Actually I'm not coming tonight. I'm seeing other people.\" That was it. After a few days. I emailed him a couple times that I deserve a proper phone call break up. He unblocked my number and finally called me. Immediately he just unloaded his anger. He blamed everything on me. He said I have a personality disorder and as my friend he was begging me to get help. That everything was in my head and that I cry for no reason. He said he knew from the first week of dating that I was the problem but he felt bad for me and was tired of hopping from one girl to another so he stayed with me for 8 months. He said he is tall.. confident and white.. he makes a shit ton of money and he loves his life. He said \"I simply have TOO MANY choices.. our connection wasn't special at all and I will love again\" He said he had already fucked someone new and she is \"very sweet\". He went on a date with someone and \"she is fucking awesome\". I stayed on the phone as he said every single thing a hurt desperate person would say to try to convince himself that's he's okay.. he's in control.. he's not hurt.. and he's right and strong. \n\nWe often talked about the five love languages. He always said he only needs physical touch. And I need all five which he thought was crazy. I stayed on the phone with him as he described all the reasons why this new stranger he slept with was better than me. How her only love language is touch as well. He emailed me on Monday saying he will never give up, and by Thursday he had slept with someone new. As I listened to all this.. it finally clicked in my heart. That was it. All the hope and forgiveness and empty promises broke in me. He finally cut the remaining karmic tie between us. This was never about me. I was never going to make this guy happy and we were never going to work. All this horrible cruelty he was yelling into the phone... was his internal dialogue convincing himself that he is right, he is okay, he not hurt, he is not responsible. Having no control.. or being accountable for selfish hurtful actions causes him to lash out. He has such a fear of feeling things.. of getting hurt.. or having no control that he rather live a surface level life and cushion himself with yes people and agreeable circumstances that make his life easy and unchallenging in anyway. Control everything.\n\nThat, believe it or not is the shortish summary of my last 10 months. There are so many other examples and details but I have a feeling you guys get the picture. \n\nSo here I am today. It's been an up and down road to healing. Today my close friend sent me articles on the toxic relationship between empaths and narcissists. I am SHOCKED how accurate and to the T these articles capture our relationship. Our relationship was EXACTLY like how these articles explain it. Honestly... I wish fate would send these articles to him.. I even contemplated having my fiend or my sister email them to him. Is it wrong of me to care about his happiness and growth? Care about him opening his eyes to the destruction he's creating? Is it wrong of me that I don't violently hate him? I feel sad FOR him. I feel no need for relief by cursing him and saying cruel things. I have no need to fill any voids by sleeping with people and saying \"OH I am SO over him. OH he was horrible and I can do better.\" Life is vast and life is crazy. How can I condemn and judge anyone? That's just not me. You can't control certain cards you're dealt... like your upbringing. But you DO have the choice in how you live on from these experiences. That is what I do choose to examine. I wish him bravery and strength.. I wish that for anybody and everybody. I wish that for myself too! I'm working on it everyday. Strength to see myself and life without any veils. See my actions without any self deception. (Deception like cushioning your ego.. focusing on blame which is so empty and pointless.) Fear from not knowing what's gonna happen.. fear of having no control.. it's instinct to protect yourself. Your ego will protect itself with all kinds of destructive momentary relief (empty sex, alcohol, saying mean things to people and putting others down, etc.) I wanna see things for what they truly are. Be brave enough and have the wisdom to walk away when you know it's wrong and not meant for you. \n\nIs it wrong of me to hope that he'll learn the true root of happiness? It's not money or sex with hundreds of beautiful women. Or telling yourself how confident and awesome you are. How many people know you. (From the years of isolation.. all he did is draw alone in his room. Now he is a somewhat well known video game artist and director at a major video game company in LA.)\n\nLiving a full life is about living awake.. how much you open yourself to the world. How much you give and share. Vulnerability is true bravery and strength. Not cushioning your life with ease and agreeableness. But I realized.. who am I to force a lesson on anyone. Who am I to \"make\" someone wake up or realize things. Even if he were to have a.. \"shit.. now I see\" moment.. it takes consistent drive and desire to be awake and mindful... it takes time to change your habits. I just wanted to know what you guys think. Thank you for reading. I may be hurt and heartbroken but I am SO thankful for this experience. I think these lessons have really opened my eyes and I'm coming out stronger and a lot wiser. You definitely can be too open... too giving.. and too forgiving. \n\nhttps://dailyoccupation.com/2017/03/14/toxic-attraction-empath-narcissist/\n\nhttps://www.psychologytoday.com/blog/sense-and-sensitivity/201201/the-highly-sensitive-person-and-the-narcissist?amp\n\nAs the time passes I rawly see how completely lost I became. I lost myself and completely forgot who I am and what I'm worth. I became a deeply desperate and sad person. Everyday I yearned for the small crumbs of kindness and affection he would strategically give me.. especially in the form of verbal affirmation: telling me I'm the love of his life and he will never give up. But then check me by ogling and comment on women's bodies while we're out.. and keep me down on myself and insecure. He is truly manipulative with his words which in this world can take you far. It's rewarded. He was always very proud that he could get what he wanted.. especially with women. I also rawly see that how you treat and speak to others is a true reflection of how you treat and speak to yourself internally. If someone is so easily and freely able to be sooo mean and cruel to another living breathing FEELING human.. how is their internal dialogue with themselves and their self worth? \n\nThank you so much for the wonderful comments and messages. I cannot express how moved I am. Its even more special because we are all anonymous strangers yet we are all so interconnected in how we feel and the hardships we face. I am so thankful. I choose to take this painful experience and life lesson and continue to explore myself.. love myself... open myself to others.. and love. \n\nHe texted and emailed me a few weeks ago. He wrote:\n\nText:\nIt's been hard without you. I hope you're okay.\n\nEmail: \nIt's been hard without you. I hope you're okay. Sorry for how things went down. \n\nI couldn't respond.",
    "title": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1498231430,
    "score": 13,
    "keyword": "white judge"
  },
  {
    "text": "How to deal with catcalling-it's made me a reactive hot mess Twoxchromosomes, I need some advice on how to deal with catcalling? I know some women like it, and having spent time in countries where machismo culture is very strong I didn't feel endangered or nearly as angry in those cultures. I don't judge the women who feel sexy because of it.  But for me, I can't help but feel ashamed, righteous, humiliated and angry when it happens in my home city. Catcalling happens to me several times a day, no surprise here in New York.\n\n I'll go out of my way to avoid construction sites if there's one up ahead or if there's a group of men hanging out on the block. I try to dress so that I don't attract attention, and god help me when summer time shorts become necessary. I wish I could wear less covered clothing but every time I do I get way more attention and I regret my wardrobe choices. If I can \"feel\" a man's eyes on me as I pass by I can't help feeling disgusted, especially if he sticks his head in my path to leer at me as I pass. Some days I hate my face and body for attracting men, which duh isn't healthy. Among the most horrifying memories have been being followed down the street in the dark, cornered by groups of white men speaking to me in Mandarin (which isn't even a dialect I understand), Konichiwa-ed, grabbed on the ass, and jacked off to pants on and pants off. One time I gave some change to a guy and he had a blanket, I didn't realize he was jacking off as I spoke to him for a minute until he broke off mid-sentence saying \"UHN, I'm gonna come!\"\n\nIn part, I am angry because 3/4 of the time the comment I receive is about me being Asian, which I don't identify with as strongly because I'm a native New Yorker--not here to fill your passive Asian sex doll fantasy because I know just about as much as you do about China. Today, I lost control and I crossed a line for myself.\n\nA man was on his electric bike and whispered behind my ear, \"Hey pretty. Wanna come to bed sexy?\" Which I'm sad to say I don't consider that bad. But I reacted without thinking- turned around and shoved his bike down. He didn't even fall off, just put a foot down to catch himself and I lost my cool. Started yelling to him about how women don't like to be treated like objects. And he said, \"Don't take it so personally. YOU don't like it. YOU. You shouldn't be out here pushing people on the street.\" And then another guy came to his rescue and was like, \"calm down Mami, calm down\" (to further my outrage) and grabbed me by the shoulders and pushed me away from bike man. I walked away.\n\nUgh, what should I do? I've crossed my own threshold here--My reaction was rash and violent, and when I get catcalled I frequently replay violent scenes in my head of what I could have done instead of just walking away and ignoring them. I don't normally spend time thinking about the attention I get from men, and my anger usually subsides pretty quickly. But today was a game changer--I reacted with the intention of violence, and even though he wasn't hurt it's clear this whole catcalling situation is clearly messing with my thoughts and behavior. If you also hate catcalling, how do you deal?\n\nTLDR; sick of getting catcalled to the point where it's fucking with me big time and I don't want to think or act violently, advice?",
    "title": "How to deal with catcalling-it's made me a reactive hot mess",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1494464951,
    "score": 7,
    "keyword": "white judge"
  },
  {
    "text": "I've lived in Iran and in the U.S. Anti-feminists on both sides mirror (and feed off of) each other. Warning: Long post.\n\nI grew up in Iran but moved to the U.S. about a decade ago. You can say I've seen \"both sides of the coin\" as far as societal attitudes towards feminism is concerned. Here are some of my observations:\n\n* Here in the U.S. you often see people admonishing feminists for focusing on \"first-world problems,\" while women in developing countries are grappling with much more serious issues. \n\n\n    You might be surprised to know that a very similar argument is used against women's rights activists in Iran, not necessarily by the state, but by conservatives at large. Iranian feminists are told that their focus on the mandatory dress-code (including hijab), on [the right to ride bicycles in public](http://www.bbc.com/news/world-middle-east-37430493), or on [the right to enter sports stadiums](https://www.hrw.org/news/2016/06/30/banned-stadiums-being-woman-iran) is frivolous. \"What's the big deal about wearing a scarf on your head?\" \"Are you so defined by your attire that a piece of cloth is going to oppress you?\" \"You are diverting attention from real issues by focusing on getting women to stadiums.\" \"Not everyone can afford a bicycle. This is merely a middle-class issue.\"\n\n\n    Iranian women are also told they should be thankful to live in a state that keeps them safe from ISIS, because things could be a lot worse. Sound familiar?  \n\n* Statistics around issues like the wage gap, rape, and male-on-female violence have been contested over and over again in the U.S. They are called bogus, misrepresentative, and at best inconclusive. Meanwhile, statistics on mortality, longevity and well-being are used to show that American women have it better than men. \n\n\n    You'd think anti-feminists couldn't use the same argument in Iran, but they do. Longevity is similarly female-skewed in Iran ([and in most countries of the world](https://en.wikipedia.org/wiki/List_of_countries_by_life_expectancy#List_by_the_OECD_.282013.29)). So we're often asked: \"how come you live longer if you're so oppressed?\" These anti-feminists point out that [Iranian women have a higher penetration in STEM fields than American women](https://www.forbes.com/sites/amyguttman/2015/12/09/set-to-take-over-tech-70-of-irans-science-and-engineering-students-are-women/#7b9d107e44de). That Iranian women are not subject to compulsory national service, as opposed to some developed countries such as Norway. That Iranian women are [less likely to have body-image issues](http://www.npr.org/sections/goatsandsoda/2014/09/15/347083281/covering-up-with-the-hijab-may-aid-womens-body-image). In a way, we're told that we have it better than some Western women in some aspects, so we should stop being greedy about pursuing other aspects. Sound familiar? \n \n* Iran's theocratic regime has often argued that women have a natural tendency to nurture, and therefore need to stay home and take care of their children. Recently, they've discovered the fields of evolutionary/developmental psychology/biology and try to argue this point from a \"scientific\" perspective ([non-English link 1](http://webcache.googleusercontent.com/search?q=cache:iILWu2n5hOEJ:www.tebyan-zn.ir/News-Article/zanan/2010/10/10/5607.html+&cd=12&hl=en&ct=clnk&gl=us), [non-English link 2](https://www.youtube.com/watch?v=Mi0JZm_2vbc)). [Sound familiar](https://twitter.com/charlesmurray/status/837287933312909313)?\n\n* In the U.S., some people argue that family courts unfairly favor women, especially in issues related to custody and child support. You might be surprised to hear that there are similar arguments in Iran, not around custody (which almost always favors the father), but around [Mahr](https://en.wikipedia.org/wiki/Mahr). Anti-feminists have vehemently opposed and dismissed the mandatory Mahr payout as a law that disadvantages men, conveniently forgetting that the scale is tipped the other way in almost any other legal issue. \n \n* The red-piller ideology has also found its following in Iran (and other countries I imagine). I've seen an increasing number of my old college mates and friends turn to red-pill/mgtow-type communities, especially on reddit. They even have a prophet (Roosh-V, who was born to Iranian parents). You might wonder, what makes them think they're disadvantaged and oppressed by feminists, despite living in country where a woman is literally worth half a men ([+](http://iranhrdc.org/english/publications/legal-commentary/1000000261-gender-inequality-and-discrimination-the-case-of-iranian-women.html#3), [+](http://iranhrdc.org/english/publications/legal-commentary/1000000261-gender-inequality-and-discrimination-the-case-of-iranian-women.html#22))? Is the illusion of victimhood so pervasive that it can elude some of the most gender-privileged people on the planet?  \n\n* The Islamic Republic has repeatedly accused women's rights activists of being Western stooges, for defending Iranian women's right to dress as they choose. Feminists in the West are repeatedly called terrorist sympathizers for defending Muslim women's right to dress as they choose. Both arguments twist the reality and turn a very simple issue (the right to choose your attire) into a tool for geo-political conflict. \n\nI expect some of you to say: but anti-feminists in the U.S. *do* have more convincing points, seeing that their country doesn't deprive women of their most basic rights. The ridiculous rhetoric of anti-feminists in Iran doesn't undermine the fair points raised by anti-feminists in the U.S.\n\nWell I do agree that objectively and definitively, Iranian law is far\nmore backwards in terms of gender equality. But there are three points to keep in mind:\n\n1. U.S. law didn't use to be very progressive either. Progressive ideas had to be argued into the law, by people who fought for them. The law often doesn't change as long as public opinion around it doesn't start to change. In that sense, anti-feminist rhetoric in the U.S. is not as innocuous as it's made out to be. I'm sure 100 years ago when women did not have the right to vote, most people were able to rationalize it as a necessary disadvantage for women, similar to how denying women a decent maternity leave is rationalized now. \n\n2. It's always easier to judge a nation from the outside. But when you live inside a country, you are exposed to the nuances and complexities of social issues, and might lose sight of the big picture. For instance, a Swedish citizen might view the U.S. as remarkably backwards in terms of gender equality, when it comes to access to abortion and affordable healthcare, violence against women, representation in politics, etc. But to some people living in the U.S. the issue is not \"so black and white\" (to use a phrase so cherished by anti-feminists). Iranian anti-feminists use the same argument (\"it's not as black and white as the West would like to portray\") to justify their incredibly backwards ideas. Sometimes it's good to take a step back to look at the big picture. \n\n3. The Iranian regime has learned to play the Westerners' rhetorical game really well. For instance: studies [have shown](https://www.theguardian.com/education/2009/mar/18/secondary-schools-girls-gcse-results) that girls perform better if they study in gender-segregated schools. The Iranian regime has flaunted these statistics in defending its segregation policies, *as if they segregated schools to help girls succeed.* This type of hypocrisy can be illuminating when inequality (in any context) is discussed: **It's not enough when things work out. Things have to work out** ***for the right reasons.***\n\nIn conclusion, I think it's important to look at the global context when issues of women's rights are concerned, and it's also important to see beyond the rhetoric.",
    "title": "I've lived in Iran and in the U.S. Anti-feminists on both sides mirror (and feed off of) each other.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488838700,
    "score": 5,
    "keyword": "white judge"
  },
  {
    "text": "confession: I judge parents who misspell their kids' names Yes, I know there isn't a \"correct\" way to spell names (just a traditional way), and that all names are basically made up anyway, and that getting irritated over a tiny thing is petty.\n\nNonetheless, I judge those parents who can't spell their own kids' names. Names like \"Isaiah\" or \"Sheila.\" I've had three Isaiahs and only one of them spelled his name correctly (the other two were both \"Isiah\"). I've had four Sheilas but one was \"Shelia\" and two others were \"Sheela.\"\n\nAnd don't think I'm just complaining about the nonwhite kids, because upwardly-mobile white families are the worst with their made-up names and made-up spellings of names. I've lost track of all the different spellings of \"Allison\" I've encountered over the years.\n\nHospitals should offer a free spellcheck service when kids are born:\n\n\"I'll name her Malica!\"\n\n\"Uh ... do you mean 'Melissa'? With an 'e' and two esses?\"\n\n\"No, Malica!\"\n\n*fast forward ten years when the daughter gets angry at all the teachers who call her \"Militia\" or \"MaLEEKa\" or \"MAL-icka\" ...* \n\"OMIGOD *eyeroll* it's pronounced 'MELISSA!!'\"\n\njust had to get that off my chest, thank you and good night",
    "title": "confession: I judge parents who misspell their kids' names",
    "subreddit": "Teachers",
    "timestamp": 1495550322,
    "score": 216,
    "keyword": "white judge"
  },
  {
    "text": "Resources for Radical & Left-Wing Law Students [NLG Radical Law Student Project](https://www.nlg.org/radical-law-student-project/)\n\nThe National Lawyers Guild was the first racially integrated and gender-inclusive bar association in the United States. Since its founding in 1936, it has stood up for liberatory causes, including the Civil Rights Movement and the #NoDAPL struggle. NLG also publishes a \"[disorientation](https://www.nlg.org/disorientation/)\" manual for radicals entering law school.\n>It has become a truism that many are drawn to law school initially to further social justice, only to end up working in areas of the law that have little potential to serve these ideals.The most common reason cited for this is economic: the average law student emerges into practice with well over $100,000 in debt. However, this is not the only factor. In most universities, the culture and pedagogy of legal education tend to emphasize commercial law over public interest fields and the intellectual pressure of law school undermines student’s commitment to their ideals. ~Traci Yoder\n\n[A Handbook for Social Justice Advocates Thinking About Law School (pdf)](https://ccrjustice.org/sites/default/files/attach/2015/06/Handbook-for-Social-Justice-Activists_BJI.pdf)\n\nA wonderful resource compiled by students and recent law school grads practicing public interest and social justice law.\n>I couldn't comprehend how someone who wanted to practice social justice law could, three years later, feel obligated to resign to a different path—either because they had successfully been reprogrammed, or because they felt that their condition of indebtedness left them no other option but to “get a real job.” ~Nikki Demetria Thanos\n\n[For Those Considering Law School (pdf)](http://www.deanspade.net/wp-content/uploads/2010/10/For-Those-Considering-Law-School-Nov-2010.pdf)\n\nA good reality check for radicals and leftists thinking about law school. Authored by Dean Spade, founder of the Sylvia Rivera Law Project.\n>Law school is not like college. It isn’t about writing cool papers full of critical ideas. Many law schools, like academia in general, are perceived as “bastions of liberalism” in the context of our outrageously white supremacist, conservative country, but the intellectual and political environments are so mildly reformist (at best) that they will feel shockingly conservative to anyone who wants to see significant change [...] The traditional pedagogy of law school relies on humiliating students if they bring in other ways of thinking or knowing about the world, thereby whittling them down to a shadow of their former selves and reshaping them to make them think inside a very narrow box. ~Dean Spade\n\n[Letter to a Law Student Interested in Social Justice (pdf)](https://www.law.duke.edu/curriculum/pdf/interested_social_justice.pdf)\n\nA letter by Prof. William Quigley inspired by something one of his students told him: “The first thing I lost in law school was the reason that I came.”\n>There is a rich history of social justice advocacy by lawyers whose lives rise above the limited horizons of the culture of lawyers. We can take inspiration from social justice lawyers like Mohandas Gandhi, Nelson Mandela, Shirin Ebadi, Mary Robinson, Charles Hamilton Houston, Carol Weiss King, Constance Baker Motley, Thurgood Marshall, Arthur Kinoy and Clarence Darrow. ~William Quigley\n\n[“On Being a Happy, Healthy, and Ethical Member of an Unhappy, Unhealthy, and Unethical\nProfession”](https://lawyerist.com/weekend-reading-on-being-a-happy-healthy-and-ethical-member-of-an-unhappy-unhealthy-and-unethical-profession/)\n\nNot specifically radical or left-wing, but still a nice piece by U.S. District Judge Patrick Schlitz.\n>You cannot win the game. If you fall into the trap of measuring your worth by money, you will always feel inadequate.\n\n[Power With: Practice Models for Social Justice Lawyering](http://scholarship.law.upenn.edu/jlasc/vol15/iss1/3/)\n\nA constructive work by Michael Grinthal of South Brooklyn Legal Services.\n\nEdit: Added some readings and quotes.",
    "title": "Resources for Radical & Left-Wing Law Students",
    "subreddit": "LawSchool",
    "timestamp": 1502214385,
    "score": 25,
    "keyword": "white judge"
  },
  {
    "text": "White House Ends Bar Association’s Role in Vetting Federal Judges",
    "title": "White House Ends Bar Association’s Role in Vetting Federal Judges",
    "subreddit": "LawSchool",
    "timestamp": 1491182954,
    "score": 19,
    "keyword": "white judge"
  },
  {
    "text": "Livid.... So I came back from a night out with a friend of mine. And this Uber driver mentions the rally tomorrow and how he had a busy day. Then he goes on explaining what the rally is about and that it's a white nationalist rally and there will be counter protestors there. So obviously as any sane American, I dismiss it because obviously it's horrendous. And then the uber driver is like, now you don't know what they're all about, so he can't judge them and neither can I. And I'm like whaaaaaaaa. Wtf. And then my friend who's in the car with me AGREES with the Uber driver ...  \n  \nSo I'm like.... Me judging??? WHAT!? you can't be serious. And then the Uber driver is saying how they claim they're not Nazis and so yadda. And then my friend goes, you're not listening. Because I said I was not judging them based on nothing, but on their effing ideology. And so the car ride consisted of me actually having this surreal conversation with a friend and a stranger who is literally defending white nationalism and have reversed the conversation by saying that I'm being the short sighted one.  \n  \nSo we make it to our destination and I'm livid with this friend. And he's like chastising me that when I hear conversation like that, I'm not supposed to engage it. And I'm thinking, this friend was the one that started the conversation with him and engaged him in the first place. And he realized this after I stated it. Then I say that he agreed with the fool. And then he's like, he has to worry about being deported so he always is careful with what he says. And then says I HAVE PRIVILEGE for being a citizen. .......  I call him out on his paranoia and say that what you stand for is what you stand for and there's no fear that can make someone defend white nationalism.....  And by his absurd logic, the more \"American\" thing to do was to oppose.  \n  \nAnyway, I'm livid and honestly don't want to be friends with him anymore after that. I can't believe that happened.",
    "title": "Livid....",
    "subreddit": "blackladies",
    "timestamp": 1503646084,
    "score": 44,
    "keyword": "white judge"
  },
  {
    "text": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts https://sanfrancisco.cbslocal.com/2017/11/30/judge-suspensions-ok-albany-high-students-racist-posts/\n\nSAN FRANCISCO (AP) — An East Bay school district acted properly when it suspended five students who “liked” or commented on racist images on another student’s Instagram account that included nooses drawn around the necks of a black student and coach and comparisons of African-American women and students to gorillas, a judge has ruled.\n\nThe case raised thorny questions about how strictly schools can regulate student speech and whether “likes” on social media should be treated similarly to the original posts.\n\nU.S. District Judge James Donato said in his decision late Wednesday the five students contributed to disruption at Albany High School in the San Francisco Bay Area.\n\nThe judge rejected arguments that the Albany Unified School District violated the students’ free speech rights because the offensive posts were on a private account and made off campus.\n\nDonato said the accounts’ followers were mainly Albany High School students. The posts pictured students and school employees and created a risk of substantial disruption at the school, the judge said.\n\n“These cases establish that students have the right to be free of online posts that denigrate their race, ethnicity or physical appearance, or threaten violence,” he said. “They have an equivalent right to enjoy an education in a civil, secure, and safe school environment.”\n\nAn attorney for three of the students had no immediate comment. An attorney for the other two, Darryl Yorkey, said “liking” images does not necessarily express approval.\n\n“I think the judge took an opinion that many of us do in the older generations in assuming that a ‘like’ on its face is just that, ‘I like it, I approve of it,'” he said.\n\nHe said many of the students who were suspended over the images were Asian and were just trying to shock each other.\n\n“Taken out of that context, it definitely looks really bad,” he said. He did not immediately know whether his clients would appeal Donato’s ruling.\n\nA phone message left with the school district seeking comment on the ruling was not immediately returned.\n\nA male student identified in court documents only as “C.E.” created the account in November 2016 and posted on it over the next several months.\n\nOne post showed a screenshot of a female African American student that she had captioned, “I wanna go back to the old way.”\n\nC.E. juxtaposed an image on the student’s post of a white man beating a black slave hung by his hands, according to Donato’s ruling.\n\nSchool officials learned about the account in March. They called in mental health counselors to help calm students and contacted police over concerns references to lynching, nooses and the Ku Klux Klan in the posts could constitute threats of violence, Donato said.\n\nC.E. was suspended and later expelled. Donato upheld his discipline as well on Wednesday.\n\nBut the judge said the district went too far when it disciplined two other students. One followed the account but appeared to have done nothing else and the other commented that the account was “racism solely directed at black people” with an emoji of a laughing face, the judge said.\n\nThe judge overturned their suspensions.",
    "title": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts",
    "subreddit": "blackladies",
    "timestamp": 1512146276,
    "score": 28,
    "keyword": "white judge"
  },
  {
    "text": "Anyone ever go back to visit your respective Asian countries and felt more at home there than in the US? Went on vacation with my family in China recently and just got back. Find myself really missing my time there, though it may just be post-vacation blues. For once in my life, I did not stand out in a crowd, everyone looked like me. I didn't feel like I was being judged, even though that's probably not the case in the US but I just *feel* differently here. I have a good job in the US though I hate my coworkers but I could see myself working in China (specifically Hong Kong). I'm hoping to go back already sometime this year.\n\n\nMaybe it's because I'm not enjoying my current job, which takes up a lot of my time. My close friends here are all white and though we've known each other for a long time, it's just different not having any Asian or Asian American friends may who have gone through the same experiences I have. \n\n\nAnyone feel similarly after visiting their roots in Asia?",
    "title": "Anyone ever go back to visit your respective Asian countries and felt more at home there than in the US?",
    "subreddit": "asianamerican",
    "timestamp": 1490114314,
    "score": 16,
    "keyword": "white judge"
  },
  {
    "text": "Does My Wife's Grandfather Look Chinese? My wife was raised by her grandparents, a Chinese man and a white woman (she's 25% Chinese). However, she was talking to a Chinese lady the other day and when she showed her a picture of her grandfather, the lady said he didn't look 100% Chinese to her. This has completely freaked my wife out. \n\nPersonally, I think he looks pretty Chinese, but as a white guy I'm not a great judge. I was hoping some people from this sub could weigh in.\n\nHere are a couple pics: https://imgur.com/a/5Slne\n\nThanks in advance to anyone that comments! I know this an odd request, but my wife is seriously freaked out by the idea that the man who raised her might not be who she thought he was.",
    "title": "Does My Wife's Grandfather Look Chinese?",
    "subreddit": "asianamerican",
    "timestamp": 1511454703,
    "score": 0,
    "keyword": "white judge"
  },
  {
    "text": "Karen Straughan: \"In a patriarchy it's 'women and children first'; in a matriarchy it will be 'women, children and the woman's luggage first'\" Provocative quote from one of her radio appearances.   \n\nIs she right?  \n\nFeminist theory is based on the demonstrably [false](https://www.amazon.com/Privileged-Sex-Martin-van-Creveld/dp/1484983122) idea that men in power try to privilege men at the expense of women.   I'm somewhat puzzled how this bizarre notion has become dominant in academia considering it makes zero sense from either a biological or class based perspective.   Perhaps the relative unwillingness of male academics to debunk feminism is itself an example of chivalric impulses rooted in traditional gender roles.   Who wants to be the asshole who opposes a movement supposedly designed to liberate women?   Me -- that's who.  \n\nIn another incredible irony, it would appear that the history of the feminist movement actually disproves feminist theory.  \n\nConsider two scenarios from the 19th century: \n\n(1) Men living on starvation wages -- some of them dastardly \"straight white males\" from countries like Ireland and Germany and even mother England -- try to form a union.   Leaders have their legs broken.   Police beat them with billy clubs.   Pinkerton spies are sent in to set off bombs.   Men are hanged and engage in pitched battles with private armies.   Several decades and thousands of dead men later, men establish the legal right to form a union.   \n\n(2) Since they are responsible for providing for their wives and children under threat of imprisonment (not that such legal action was required for 99% of men, who WANT to provide for their children), men are given custody of the kids in rare cases of divorce.   Women write letters to exclusively male politicians asking them to institute the \"tender years doctrine\" because the current situation is making divorced women \"unhappy.\"   Male politicians -- those fiendish patriarchs -- respond by handing over custody rights to women, at the expense of their own sex.     \n\nNot only is feminist theory incorrect, it may have been based on a monumental act of projection.   Women who didn't particularly like men to begin with thought to themselves, \"How would I act if I were in power?\" and patriarchy theory was the result.   Studies have repeatedly demonstrated that males have out-group bias towards females, whereas females have in-group bias toward themselves.   \n\nThe majority of women have not yet demonstrated that they are capable of having anywhere near as much empathy for men as vice versa.   In fact, you may remember that episode of the View where Sharon Osbourne said it was \"marvelous\" when a woman castrated her cheating husband.  The entire female audience cheered.   Can you even imagine the reverse?   Men cheering on a man who sliced out his wife's vagina?\n\nWhat we now have is a group of men in overt positions of power (from politicians down to judges and police) enforcing what amounts to a [matriarchy](http://www.realsexism.com/).   This is fitting, since female forms of power tend to be indirect rather than in your face (plausible deniability), and women are more likely to use proxy violence.   The state is the most violent institution in history, and feminists are now in the driver's seat (or rather the passenger seat, giving the driver directions).     \n\nWas Karen right about the luggage quip?  Hyperbole?  \n\nConsider that we currently regard female irritation over \"manspreading\" a more pressing gender issue than the epidemic of male suicide.   Or \"Mansplaining\" a bigger travesty than baby boys having their genitals mutilated and the flesh used in female beauty products or men not being able to see their kids.   \n\nThis isn't a minor empathy gap.   This is an empathy gap the size of the grand canyon.   \n\nI certainly hope that women are capable of a great deal more empathy toward men than they have so far demonstrated.   I guess the success or failure of the Mens Rights Movement will determine whether \"patriarchy\" is actually necessary.   The current male-hating paradigm is based on privilege and narcissism -- but not of men.   Remember who keeps the electricity on the next time you talk about \"male privilege.\"   \n\nUnlike some red pill types I don't think the situation is unsolvable.   For example role playing exercises can teach women about what it's like to be a man.   See eg Norah Vincent.   I recently saw a reality show where women (all reasonably attractive) were forced to go into a bar and ask men out, buy them a drink etc.   A couple were turned down.    One woman said afterwards \"that was the worst day of my life.\"   The worst day of her life, spending one hour as a man, doing something that ranks rather low on the scale of shit men have to go through.   I really don't think women have the slightest fucking clue what it's like to be a man.   But they could learn.",
    "title": "Karen Straughan: \"In a patriarchy it's 'women and children first'; in a matriarchy it will be 'women, children and the woman's luggage first'\"",
    "subreddit": "MensRights",
    "timestamp": 1484091529,
    "score": 144,
    "keyword": "white judge"
  },
  {
    "text": "Feminism is about equality, it's NOT a hate movement - “The price of clinging to the enemy [a man] is your life. To enter into a relationship with a man who has divested himself as completely and publicly from the male role as much as possible would still be a risk. But to relate to a man who has done any less is suicide. . . . I, personally, have taken the position that I will not appear with any man publicly, where it could possibly be interpreted that we were friends.” – Ti-Grace Atkinson [Ti-Grace Atkinson, Amazon Odyssey, Links Books, 1974, pp. 90, 91]\n\n- Janet Bajan, a member of the New York Radical Feminists, drew applause when she said that man hatred was “a protective reaction, a survival mechanism to change the situation in favor of women.” – Janet Bajan [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “[Rape] is nothing more or less than a conscious process of intimidation by which all men keep all women in a state of fear.” – Susan Brownmiller [Susan Brownmiller, Against Our Will: Men, Women and Rape, Secker & Warburg, 1975, p. 6]\n\n- “Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat.” – Hillary Clinton, [speech by Hillary Clinton, First Ladies’ Conference on Domestic Violence in San Salvador, El Salvador on Nov. 17, 1998\n\n- “If life is to survive on this planet, there must be a decontamination of the Earth. I think this will be accompanied by an evolutionary process that will result in a drastic reduction of the population of males. People are afraid to say that kind of stuff anymore.” Mary Daly [from a 2001 interview with What Is Enlightenment magazine [referencing] Mary Daly, Quintessence...Realizing the Archaic Future: A Radical Elemental Feminist Manifesto, Beacon Press, 1998, p. ?]\n\n- “MALE:...represents a variant of or deviation from the category of female. The first males were mutants...the male sex represents a degeneration and deformity of the female. – Elizabeth Gould Davis [Elizabeth Gould Davis, The First Sex, 1971, G. P. Putnam’s Sons; reprinted in: Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996]\n\n- “All men are scum and must die.” – Clementine Ford [Twitter, @clementine_ford, Nov. 15, 2016]\n\n- “All patriarchists exalt the home and family as sacred, demanding it remain inviolate from prying eyes. Men want privacy for their violations of women ... All women learn in childhood that women as a sex are men’s prey.” Marilyn French [Marilyn French, The War Against Women, Ballantine Books, 1992, p. 186]\n\n- “The proportion of men must be reduced to and maintained at approximately 10% of the human race.” – Sally Miller Gearhart [Sally Miller Gearhart, “The Future - If There Is One - Is Female,” in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982]\n\n- “Why have any men at all?” – Sally Miller Gearhart [Sally Miller Gearhart, “The Future - If There Is One - Is Female,” in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982, p. ?]\n\n - “I have a great deal of difficulty with the idea of the ideal man. As far as I’m concerned, men are the product of a damaged gene.: –Germaine Greer [Germaine Greer publicly speaking at a Hilton Hotel literary lunch, promoting her book, The Change: Women, Aging and the Menopause, Knopf, 1992, p. ? -- from a news report dated Nov. 14, 1991]\n\n- “Probably the only place where a man can feel really secure is in a maximum security prison, except for the imminent threat of release.” – Germaine Greer [Germaine Greer, in “Security,” The Female Eunuch, Mcgraw-Hill, 1971, p. ?]\n\n- “And if the professional rapist is to be separated from the average dominant heterosexual [male], it may be mainly a quantitative difference.” – Susan Griffin [Susan Griffin, “Rape: The All-American Crime,” Ramparts 10, September 1971, pp. 26-35]\n\n- “if this book leaves the impression that men have conspired to keep women down, that is exactly the impression I mean to convey; for I believe that men could not have succeeded as well as they have without concerted effort” [Ann Jones, Women Who Kill, Ballantine, 1981, p. xvii; quoted in Peter Vronsky, Female Serial Killers: How and Why Women Become Monsters, 2007, Berkeley Books, p. 16]\n\n- “I believe that women have a capacity for understanding and compassion which man structurally does not have, does not have it because he cannot have it. He’s just incapable of it.” – Barbara Jordan [Barbara Jordan, speaking at a women’s political symposium in Sep. 1991; quoted in Lawrence Wright, “Are Men Necessary,” Texas Monthly,  Feb. 1992, p. 84]\n\n- “MAN:...an obsolete life form... an ordinary creature who needs to be watched...a contradictory baby-man...” – original source? [Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996, p. ?]\n\n- “Men’s sexuality is mean and violent, and men so powerful that they can ‘reach WITHIN women to fuck/construct us from the inside out.’ Satan-like, men possess women, making their wicked fantasies and desires women’s own. A woman who has sex with a man, therefore, does so against her will, ‘even if she does not feel forced.” [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- “I feel what they feel: man-hating, that volatile admixture of pity, contempt, disgust, **envy**, alienation, fear, and rage at men. It is hatred not only for the anonymous man who makes sucking noises on the street, not only for the rapist or the judge who acquits him, but for what the Greeks called philo-aphilos, ‘hate in love,’ for the men women share their lives with--husbands, lovers, friends, fathers, brothers, sons, coworkers.” [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- “Man-hating marks a turning point in the movement. We have been defensive long enough. People often ask me how women can be man-haters. And I wonder, hoe can we be anything else.” – Pat Mainardi [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “The only way to win liberation is to make men miserable so they will have no peace until women are free. Married women invented man-hating.” – Pat Mainardi [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “We have a moral cause for hating men for they have taken away all our power.” – Barbara Mirnoff [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “I claim that rape exists any time sexual intercourse occurs when it has not been initiated by the woman, out of her own genuine affection and desire.” – Robin Morgan [Robin Morgan, Going too Far: The Personal Chronicle of a Feminist - Theory and Practice: Pornography and Rape, Random House, 1974, p. ?]\n\n- “...rape is the perfected act of male sexuality in a patriarchal culture -- it is the ultimate metaphor for domination, violence, subjugation, and possession.” – Robin Morgan [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Women’s Liberation Movement, Vintage, 1970, p. ?]\n\n- “I haven’t the faintest notion what possible revolutionary role white hetero-sexual men could fulfill, since they are the very embodiment of reactionary-vested-interest-power. But then, I have great difficulty examining what men in general could possibly do about all this. In addition to doing the shitwork that women have been doing for generations, possibly not exist? No, I really don’t mean that. Yes, I really do.” [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Women’s Liberation Movement, Vintage, 1970, p. ?]\n\n- “Man is but one of a million humble fertilizers. Nature intended woman to reign supreme.” – Marie Petti [William M. Sweets, “Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head,” syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- “Modern man, in his pose of superiority, is but a mere contemptible imposter, who must be subdued. Woman’s superiority has been scientifically established. At the beginning of organic life, woman, created man, and ruled him. He was a parasite, and a slave. At best, man is but an afterthought of nature.” – Marie Petti [William M. Sweets, “Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head,” syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- “I honestly have been reassessing the fact that I am giving care to these little future rapists, and what that says about me and my separatism. I know it is kinda going against my principles to support and care for these little f****rs.” [quoted in John the Other, “Feminists: demented, stunned or cultists: Why Do MRAs Keep Attacking Feminism?” A Voice for Men, Jan. 2, 2012]\n\n- “The male is a biological accident: the ‘y’ (male) gene is an incomplete ‘x’ (female) gene, that is, has an incomplete set of chromosomes. In other words, the male is an incomplete female, a walking abortion, aborted at the gene stage. To be male is to be deficient, emotionally limited; maleness is a deficiency disease and males are emotional cripples.” – Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- “[Males should] ...go off to the nearest friendly suicide center where they will be quickly and painlessly gassed to death.” – Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- “We are, as a sex, infinitely superior to men.” –  Elizabeth Cady Stanton (Nov. 12, 1815 – Oct. 26, 1902;  feminist; suffrage leader) (USA)\n\n- “Patriarchy requires violence or the subliminal threat of violence in order to maintain itself... The most dangerous situation for a woman is not an unknown man in the street, or even the enemy in wartime, but a husband or lover in the isolation of their home.” – Gloria Steinem [Gloria Steinem, Revolution from Within: A Book of Self-Esteem, 1992, Little, Brown & Co., pp. 259-61]\n\n- “Only men kill in anger.” [from: Gerald Caplan, “Battered Wives,” National Review, Feb. 25, 1991]\n\n- “Only when manhood is dead--and it will perish when ravaged femininity no longer sustains it--only then will we know what it is to be free.” – Andrea Dworkin [Andrea Dworkin, Our Blood: Prophecies And Discourses On Sexual Politics - The Root Cause, Harper & Row, 1976]\n\n- “Men love death. In everything they make, they hollow out a central place for death, let its rancid smell contaminate every dimension of whatever still survives. Men especially love murder. In art they celebrate it, and in life they commit it. They embrace murder as if life without it would be devoid of passion, meaning, and action, as if murder were solace, stilling their sobs as they mourn the emptiness and alienation of their lives.” –\nAndrea Dworkin [Andrea Dworkin, “Why So-Called Radical Men Love and Need Pornography,” in: Laura Lederer, ed., Take Back the Night, Morrow, 1980, p. 148]\n\n- “...[W]omen and men are distinct species or races ... men are biologically inferior to women; male violence is a biological inevitability; to eliminate it, one must eliminate the species/race itself ... in eliminating the biologically inferior species/race Man, the new Ubermensch Womon (prophetically foreshadowed by the lesbian separatist herself) will have the earthly dominion that is her true biological destiny. We are left to infer that the society of her creation will be good because she is good, biologically good. Andrea Dworkin, Letters From a War Zone - Take Back The Day - Biological Superiority: The World’s Most Dangerous and Deadly Idea, 1977, Dutton Publishing, 1989, p. 146]\n\nCredit to unknown misandry for compiling these.  \n\nEdit: I wanted to add one of my replies from the comments: \n\nThese \"certain people\" include the founder of the feminist movement in the United States, the founder of the first gender studies department, the most well known figures in the second wave, and the quasi-intellectuals who developed feminist theory.\n\nFeminism is rooted in the hatred of men. That's why they've only ever looked at ways in which females are supposedly disadvantaged by the system (ergo, nothing to do with equality). \n\nThat's also why it is absurd to claim that \"feminism helps men too.\" Why would you want to help the people you consider your oppressors and class enemies?",
    "title": "Feminism is about equality, it's NOT a hate movement",
    "subreddit": "MensRights",
    "timestamp": 1486569871,
    "score": 136,
    "keyword": "white judge"
  },
  {
    "text": "MRA Demands The MRM is not yet in a position to make any demands.   But I'm sure I'm not alone in thinking the tide is gradually turning.   A documentary on the Men's Rights Movement (\"The Red Pill\") has received positive write-ups in mainstream newspapers and won awards at a small film festival.   An article was just published in the liberal NY Mag that acknowledged feminism's man-hating problem (though still painted men as historical oppressors).    Self-identified feminists have dropped to 7 percent of the population in the UK.  \n\nMRA's who've been at this for many years without achieving significant results are understandably pessimistic.   But at least some of the suggestions below are already the norm in other countries, e.g. shared parenting in ~~Germany~~ France.    As more and more women join the MRM and the conversation goes mainstream, I think some optimism is finally in order.   \n\nHere is my list: \n\n- Criminalize male genital mutilation.   The fact that hundreds of baby boys die from the procedure every year should be enough to ban it.   \n\n- End selective service.   Some tradcons may disagree with this, but the reality is that men have historically shown a willingness to fight for their countries if they are actually under attack.   At the end of the day, conscription is a violation of human rights.  \n\n- End the drugging of boys except in extreme circumstances.  \n\n- End gynocentric education models.   In Christina Hoff Sommers' \"War against Boys,\" she notes that education systems were changed in the 90's to favor girls.   As a result boys are now falling behind.    Teachers must acknowledge general differences between the sexes in terms of temperament, maturation, proclivities, etc.   We need much more physicality in school, much more hands-on learning, and when necessary some degree of sex segregation.   \n\n- An immediate end to feminist indoctrination in schools.   Boys are currently being taught that their gender is 'privileged', that their masculinity is 'toxic' and that men tried to oppress women historically.   This is child abuse.  \n\n- An immediate end to \"zero tolerance\" policies that punish boys for natural boyish behavior.  \n\n- More resources for boy victims of sexual assault, and appropriate punishment for their abusers, who are often female.   Education campaigns should also target men who think these boys are \"lucky\".   While some teenaged boys may be mature enough to handle and even enjoy sexual relationships with older women, the younger the boy the more likely it is that he will be harmed by such experiences.   A study cited by Karen Straughan noted that a majority of imprisoned adult male rapists were sexually abused by women as children.    Many serial killers also  cite abuse (sexual and otherwise) by their mothers.   \n\n- Recognition of mother-on child abuse in domestic violence.   This would mean that campaigns like the \"White Feather\" in Australia would have to radically alter their current exclusive focus on male perpetrators.  \n\n- Boys-only groups like the Boy Scouts should be encouraged; they should not be forced to be made multi-sex.   \n\n- Major efforts to recruit male teachers.   I do not support affirmative action in nearly all cases, but the current education system is in crisis.   Studies show that female teachers mark down boys and have a more difficult time dealing with their natural rambunctiousness.   Moreover, many boys are being raised in single mother households and have literally no positive male role models.  \n\n- In order to get more men in teaching, we must end pedo-hysteria.   It is absurd that in some districts male teachers are not even allowed to touch children, even if it's just a hand on their shoulder when the child is upset.  That is anti-human and does more harm than good.   Pedophiles will unfortunately continue to pursue careers involving children, and I'm not sure what the solution is, but I do know that it doesn't involve demonizing the 98% of men who are NOT pedophiles.   More controversially, it may be worthwhile educating the public that up to 40% of pedophiles are female; if women are forced to carry the burden of pedo-hysteria they may be more willing to do something about it.  \n\n- Speaking of pedo-hysteria, no more discriminatory policies like banning single men from public parks.   \n\n- An end to all scholarships favoring girls.   Girls are already doing *better* than boys in school and do not require scholarships.   To the extent that these programs are continued, they should have male equivalents.  \n\n- An immediate end to all campaigns terrorizing women into thinking there is a one in five chance they'll be raped on campus.    A crude joke or a clumsy come-on is not sexual assault.   This is not the Victorian era.  Feminists who spread these false statistics should be harshly condemned.    \n\n- An immediate end to \"affirmative consent\" madness and kangaroo courts on campus.   Affirmative consent makes all men rapists by default since that's not the way people have sex.   All sexual assault cases should be handled by police.    \n\n- An immediate end to \"safe spaces\", \"trigger warnings\" and anti-free speech campaigns on campus.   Grow the fuck up.  \n\n- No more state funding for \"gender studies\" courses.   These courses spread hate against men and are no more appropriate in academia than \"Nigger studies.\"   If gender studies professors and their financial backers insist on keeping these hate factories, we need \"men's studies\" equivalents that are rooted in science rather than feelings.   This does NOT mean that we can't value and celebrate the historical contributions of women, or specific ways in which women have been disadvantaged and even oppressed at various times and places in history.   \n\n- Anonymity for men accused of sexual crimes.   This is a controversial one.   The opposing argument is that it will discourage other victims from coming forward.   However I see no reason why a man should have his life ruined because some people lack the courage to do the right thing.   Look at the case of Gomeshi in Canada.   His life has been destroyed even after it was demonstrated in a court of law that his accusers were lying.   Feminists STILL won't accept his innocence.  \n\n- Severe punishment for false sexual allegations if they can be proven beyond a reasonable doubt.   Falsely accusing a man of rape is akin to libel, assault, kidnapping and forced confinement over a period of potentially decades.   Let the punishment fit the crime.  \n\n- Reform of rape shield laws.  This is another controversial proposal.   The logic behind rape shield laws is that promiscuous women shouldn't be doubted due their sexual history.   Fair enough.   However, these laws can be misused.  For example Marv Albert is widely considered a demented pervert because he was accused of biting a woman's buttocks during sex.   It turns out that the woman had a \"bite fetish\" and ASKED him to do it.  This evidence was excluded from the trial due to rape shield.      \n\n- A recommitment to due process rights in general.   Perhaps an education campaign about the history of lynching would help.   \n\n- Recognition of envelopment as rape.  \n\n- No more affirmative action in the business world.   Young women are now out-earning young men.   \"Positive\" discrimination is still discrimination.   As mentioned, I think male teachers qualify for an exception.   \n\n- Campaigns to get more women into dangerous jobs.   Men make up 95% of workplace fatalities.   Who am I kidding?  This ain't gonna happen.   However it might be nice for feminists to show some respect to the blue collar men whose labor allows them to live safely and comfortably rather than absurdly accusing them of being \"privileged.\"    I personally support strong unions to help ensure worker safety, but since this forum includes people from all political persuasions I won't make that a main point.   \n\n- Academics and journalists should be encouraged to analyze the earnings gap in the context of hours worked, taxes paid, social services allotted, danger of work etc.\n\n- Mandatory paternity testing.   Studies show that when men learn they have been raising someone else's child the trauma is worse than rape.   \n\n- Legal male parental surrender.   This proposal is the probably the most controversial and least likely to be enacted, even though the arguments against it are no different than tradcon arguments against abortion.   One feminist, Karen DeCrow, even agreed.   Perhaps we'll have to wait until male birth control makes the problem obsolete.   \n\n- Paternity leave.  \n\n- An immediate end to the Duluth and \"primary aggressor\" laws that allow male victims of DV to themselves be arrested.    Erin Pizzey has suggested that the majority of DV cases don't require arrests anyway, and are better handled by counseling.    Rare examples of actual \"patriarchal\" (or indeed \"matriarchal\") abuse can be handled as they currently are.   \n\n- Shared Parenting.   All studies show that it helps the kids.   Best interests of the child, right?    The single mother experiment has been an unmitigated disaster.    Let's celebrate fathers again and give them the rights to which they should already be entitled.    This will help women as well, even though NOW continues to oppose equal parenting rights.    \n\n- Alimony reform.   I'm not sure what this would entail but I do know the current laws are antiquated and absurd.  \n\n- No more imprisoning men who fall behind in child support or alimony.   Obama proposed such a change but it was blocked by Republicans.   Shared parenting and alimony reform would probably go a long way toward solving this problem.   \n\n- Help for men contemplating suicide.   Non-gynocentric focus in psychological treatment.   \n\n- Men-only groups should be encouraged rather than made multi-sex. \n\n- Some sort of attempt to redress the massive discrimination against men in the criminal justice system.   Men are twice as likely to be charged and receive 63 percent longer sentences.   According to Mike Buchanan, if men were treated like women in the criminal justice system then five out of six men currently incarcerated would be free.   Short of some sort of novel approach where a separate judge determines punishment without knowing the sex of the accuser, I'm not sure much can be done about this outside of education programs about female privilege and male disposability.    \n\n- Some sort of attempt to address the problem of prison rape.  \n\n- End the drug war.   Some tradcons may oppose this, but I see no reason why people (disproportionately men) should be sent to prison for smoking a plant.   The drug war also encourages organized crime.  \n\n- Speaking of organized crime: legalize prostitution and watch another revenue source dry up for the mob and the deep state.   Sex workers already want this.   The current Nordic/Canadian model, which criminalizes only the buyer, is opposed by Amnesty International because it just drives sex workers underground and makes their lives more dangerous.   If porn is legal then sex for money should be legal too.    \n\n- The UN gender equality index should be gender neutral.   Currently it only measures areas where women and girls are faring worse.    This led to the absurdity of Rwanda being placed at the top of the index after the genocide because most men and boys were dead (!)  \n\n- All government programs including the words \"women\" or \"girls\" should either be made gender neutral or include male counterparts. \n\n- State resources allocated to social problems should be based on incidence and severity, not gender.   This would include everything from health spending to money for domestic violence programs.   \n\n- End homelessness.  It is absurd that in the 21st century West we still have men living on the street.    Many of these men are mentally ill and/or veterans.  \n\n- More care for veterans.\n\n- No more demonizing men.    No more policing of male hobbies.   If feminists insist on continuing to demonize healthy male sexuality we should be talking about hypergamy at least as much.    By the same token, there is no \"toxic masculinity\" without \"toxic femininity.\"   If we are going to talk about ways that stereotypical male behaviors can harm society we should be doing the same with stereotypical female behaviors: damselling, blaming men, holding grudges, gossiping, failing to take responsibility for one's actions, using sex to exploit men, acting irrationality etc.   \n\n- No more lowering the bar to allow women into certain fields like fire fighting.   This puts people's lives at risk.  \n\n- Men and women should be celebrating all things male and masculine in order to correct the damage done by feminism.   We should be celebrating the glorious history of men acting courageously, making enormous sacrifices to help their fellow man, protecting women and children, creating art and civilization.    Boys should take pride in their gender rather than being cruelly shamed for it.    Women should be taught about their natural in group bias.   Celebrating men does not mean we can't also celebrate women.   It's time to end the sex war.    Feminists said they wanted equality: let's give it to them.",
    "title": "MRA Demands",
    "subreddit": "MensRights",
    "timestamp": 1488178542,
    "score": 75,
    "keyword": "white judge"
  },
  {
    "text": "About the Brock Turner case Let me see if I got it right about the Brock Turner case: he went out with a girl and they were both heavily drunk. They both consented to sex but she passed out, he didn't notice and couldn't get an erection (because of his intoxicated state) so he started fingering her.    \nThe judge decided not to convict him of rape.  \nThe MSM reported the whole thing as \"college kid rapes girl, they were both sober and he got away with it because he's rich and white.'  \nDid I miss anything?",
    "title": "About the Brock Turner case",
    "subreddit": "MensRights",
    "timestamp": 1504579751,
    "score": 21,
    "keyword": "white judge"
  },
  {
    "text": "Hooked on bell hooks, part 4: \"Sisterhood is still powerful\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n**\"Sisterhood is still powerful\"**\n\nWhen the slogan “Sisterhood is powerful” was first used, it was awesome. I began my full-fledged participation in feminist movement my sophomore year in college. Attending an all women’s college for a year before I transferred to Stanford University, I knew from firsthand experience the difference in female self-esteem and self-assertion in same-sex classrooms versus those where males were present. At Stanford males ruled the day in every classroom. Females spoke less, took less initiative, and often when they spoke you could hardly hear what they were saying. Their voices lacked strength and confidence. And to make matters worse we were told time and time again by male professors that we were not as intelligent as the males, that we could not be “great” thinkers, writers, and so on. These attitudes shocked me since I had come from an all-female environment where our intellectual worth and value was constantly affirmed by the standard of academic excellence our mostly female professors set for us and themselves.\n\n\n\nIndeed, I was indebted to my favorite white female English professor who thought I was not getting the academic guidance I needed at our women’s college because they did not have an intensified writing program. She encouraged me to attend Stanford. She believed that I would someday be an important thinker and writer.\n\n\n\nAt Stanford my ability was constantly questioned. I began to doubt myself. Then feminist movement rocked the campus. Female students and professors demanded an end to discrimination based on gender inside and outside the classroom. Wow, it was an intense and awesome time. There I took my first women’s studies class with the writer Tillie Olsen, who compelled her students to think first and foremost about the fate of women from working-class backgrounds. There the scholar and one-day biographer of Anne Sexton, Diane Middlebrook, passed out one of my poems in our class on contemporary poetry with no name on it and asked us to identify whether the writer was male or female, an experiment that made us think critically about judging the value of writing on the basis of gender biases. There I began to write my first book at the age of 19, Ain’t I a Woman: Black Women and Feminism. None of these incredible transformations would have happened without feminist movement creating a foundation for solidarity between women.\n\n\n\nThat foundation rested on our critique of what we then called “the enemy within,” referring to our internalized sexism. We all knew firsthand that we had been socialized as females by patriarchal thinking to see ourselves as inferior to men, to see ourselves as always and only in competition with one another for patriarchal approval, to look upon each other with jealousy, fear, and hatred. Sexist thinking made us judge each other without compassion and punish one another harshly. Feminist thinking helped us unlearn female self-hatred. It enabled us to break free of the hold patriarchal thinking had on our consciousness.\n\n\n\nMale bonding was an accepted and affirmed aspect of patriarchal culture. It was simply assumed that men in groups would stick together, support one another, be team players, place the good of the group over individual gain and recognition. Female bonding was not possible within patriarchy; it was an act of treason. Feminist movement created the context for female bonding. We did not bond against men, we bonded to protect our interests as women. When we challenged professors who taught no books by women, it was not because we did not like those professors (we often did); rightly, we wanted an end to gender biases in the classroom and in the curriculum.\n\n\n\nThe feminist transformations that were taking place in our coed college in the early ‘70s were taking place as well in the world of home and work. First and foremost feminist movement urged females to no longer see ourselves and our bodies as the property of men. To demand control of our sexuality, effective birth control and reproductive rights, an end to rape and sexual harassment, we needed to stand in solidarity. In order for women to change job discrimination we needed to lobby as a group to change public policy. Challenging and changing female sexist thinking was the first step towards creating the powerful sisterhood that would ultimately rock our nation.\n\n\n\nFollowing in the wake of civil rights revolution feminist movement in the ‘70s and ‘80s changed the face of our nation. The feminist activists who made these changes possible cared for the well-being of all females. We understood that political solidarity between females expressed in sisterhood goes beyond positive recognition of the experiences of women and even shared sympathy for common suffering. Feminist sisterhood is rooted in shared commitment to struggle against patriarchal injustice, no matter the form that injustice takes. Political solidarity between women always undermines sexism and sets the stage for the overthrow of patriarchy. Significantly, sisterhood could never have been possible across the boundaries of race and class if individual women had not been willing to divest of their power to dominate and exploit subordinated groups of women. As long as women are using class or race power to dominate other women, feminist sisterhood cannot be fully realized.\n\n\n\nAs more women begin to opportunistically lay claim to feminism in the ‘80s without undergoing the feminist consciousness-raising that would have enabled them to divest of their sexism, the patriarchal assumption that the powerful should rule over the weak informed their relations to other women. As women, particularly previously disenfranchised privileged white women, began to acquire class power without divesting of their internalized sexism, divisions between women intensified. When women of color critiqued the racism within the society as a whole and called attention to the ways that racism had shaped and informed feminist theory and practice, many white women simply turned their backs on the vision of sisterhood, closing their minds and their hearts. And that was equally true when it came to the issue of classism among women.I remember when feminist women, mostly white women with class privilege, debated the issue of whether or not to hire domestic help, trying to come up with a way to not participate in the subordination and dehumanization of less-privileged women. Some of those women successfully created positive bonding between themselves and the women they hired so that there could be mutual advancement in a larger context of inequality. Rather than abandoning the vision of sisterhood, because they could not attain some utopian state, they created a real sisterhood, one that took into account the needs of everyone involved. This was the hard work of feminist solidarity between women. Sadly, as opportunism within feminism intensified, as feminist gains became commonplace and were therefore taken for granted, many women did not want to work hard to create and sustain solidarity.\n\n\n\nA large body of women simply abandoned the notion of sisterhood. Individual women who had once critiqued and challenged patriarchy re-aligned themselves with sexist men. Radical women who felt betrayed by the fierce negative competition between women often simply retreated. And at this point feminist movement, which was aimed at positively transforming the lives of all females, became more stratified. The vision of sisterhood that had been the rallying cry of the movement seemed to many women to no longer matter. Political solidarity between women which had been the force putting in place positive change has been and is now consistently undermined and threatened. As a consequence we are as in need of a renewed commitment to political solidarity between women as we were when contemporary feminist movement first began.\n\n\n\nWhen contemporary feminist movement first began we had a vision of sisterhood with no concrete understanding of the actual work we would need to do to make political solidarity a reality. Through experience and hard work, and, yes, by learning from our failures and mistakes, we now have in place a body of theory and shared practice that can teach new converts to feminist politics what must be done to create, sustain, and protect our solidarity. Since masses of young females know little about feminism and many falsely assume that sexism is no longer the problem, feminist education for critical consciousness must be continuous. Older feminist thinkers cannot assume that young females will just acquire knowledge of feminism along the way to adulthood. They require guidance. Overall women in our society are forgetting the value and power of sisterhood. Renewed feminist movement must once again raise the banner high to proclaim anew “Sisterhood is powerful.”\n\n\n\nRadical groups of women continue our commitment to building sisterhood, to making feminist political solidarity between women an ongoing reality. We continue the work of bonding across race and class. We continue to put in place the anti-sexist thinking and practice which affirms the reality that females can achieve self-actualization and success without dominating one another. And we have the good fortune to know everyday of our lives that sisterhood is concretely possible, that sisterhood is still powerful.",
    "title": "Hooked on bell hooks, part 4: \"Sisterhood is still powerful\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1510565465,
    "score": 17,
    "keyword": "white judge"
  },
  {
    "text": "The real reason women are not represented in tech First, I want to clarify I do not agree with the basis that women are not biologically suitable for roles in tech. I am much more inclined to believe it has to do with culture, and a good hard example against women being biologically inferior would be the country of Iran, where women make up the majority of engineers. Now granted, Iran has segregated schools between men and women, and they are under a theocracy, but if your basis was of biological merit, then this would be a good hard example to prove otherwise.\n\nNow, I will say that culture, primarily American culture, plays a huge role. \n\nLet's think back to middle school tech-ed courses, and think of the demographic in play. White/Asian nerdy boys primarily, a few hispanic and black nerds, and once in a while a nerdy girl. \n\nThis demographic holds true throughout high school. I would know, I was a guy who took tech ed courses in middle school/high school between two secondary schools, and this demographic holds true in hackathons, coding conventions, tech conventions, and..... tech jobs!\n\nBut why? Why do women, aside from a minority number, shy away from tech? Because of nerd culture. Yep, I'm just keeping it 100% honest here. Nobody likes nerds, besides other nerds. As someone who graduated from high school in 2015, the same stereotypes from 2-3 decades ago still hold true.\n\nNerds don't have friends to sit with at lunch, they are too autistic to make friends, and ESPECIALLY girlfriends, they are easy to pick on, and on the social hierarchy in high school they are at the very bottom.\n\nSo they fall back on tech, video games, and porn. And now you know why 90% of league players are males, just as the majority of competitive PC gamers are males. Men have a culture to fall back on, women do not. If women try to join this culture, lets say they play league, they will get hit on constantly for being a women. It's not fun, unless your aim is to make money from it by being a titty streamer of course.\n\nCompare this to a country like Iran, where western high school culture is non-existent, girls and boys are separate until 18, and girls are brought into tech collectively, where they can enjoy the subject without being hit on constantly, and without being judged.\n\nThis is not to say we need a theocracy. Hell, I'm agnostic myself. But I am saying that different cultures breed different peoples, and that our current nerd-normal people-jock culture cannot produce an equal outcome for both genders.\n\nUnless of course we mandate the subject, which could change things drastically. \n\nLooking forward to hearing your thoughts.",
    "title": "The real reason women are not represented in tech",
    "subreddit": "Feminism",
    "timestamp": 1502563805,
    "score": 11,
    "keyword": "white judge"
  }
]