[
  {
    "text": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2] Hey r/jobs, it's me again, coming at you with all of the resume advice you could ever need, and more! I posted all of my resume tips and tricks a couple of months back, which led me to receiving an amazingly overwhelming amount of comments (THANK YOU!) and I wanted to clear up some things, and include some things I missed in my last post. I've put all of this advice in order so it's easy to find the info you need when you need it.\n\nTo introduce myself, my name is Holly, and I am an experienced resume writer and editor located in North America. Essentially, I love helping people make their resume the best it can be, and I often help out in the r/jobs discord, and a tech workers slack channel, giving free advice as often as I am able to.\n\nResume writing and editing has been a part time hobby/job for me since 2017. I work full time as a senior account manager in tech, plus I have a bunch of hobbies outside of work, so I give my time where I can, which is unfortunately not as much as it used to be. I guess that's why I've written these posts, because I can no longer help as many people as I used to, and hopefully this way it can assist hundreds or even thousands of people!\n\n***DISCLAIMER: Many of these tips are North America specific,*** ***and some/many don't apply to creative fields like designers/marketing resumes.*** *Also some of these are for people working in the corporate world and don't apply to food service or retail jobs.* ***Of course, some of these won't apply to you specifically, so use your common sense to take what is useful to you.***\n\n~\n\n# CONTACT INFORMATION AND TOP OF PAGE\n\n* **Contact details** \\- at the top when of your resume under or next to your name, you need to include the following things: your location (if you're willing to relocate to the area the job is in, put the jobs city in and not your current location) email address, and your LinkedIn profile. Phone number isn't essential, so include it or don't, it's fine. Other optional things to include - if you have a portfolio or GitHub, definitely include them. Don't paste them as a messy link, instead write \"GitHub\" and turn it into a hyperlink.\n* **Location:** Are you located in San Francisco, California, applying to jobs in your city, and/or remote? Write \"San Francisco, CA\".\n* **Location:** Are you in San Fran, but open to relocation, AT THEIR EXPENSE? Write \"San Francisco, CA (open to relocation)\".\n* **Location:** Are you in San Francisco currently, but you're willing to move **before** starting a new job to New York AT YOUR OWN EXPENSE, where your dream job is located? Or you've already planned to move to New York and you're only applying to roles there? Put your location as \"New York, NY\". Why? Because you're moving there on your own cost prior to starting work, at your own expense.  If it comes up in the interview, tell them the truth. \"This is my dream job and I'm planning to move prior to starting if I'm successful\", or \"I'm moving to New York on X-date - which is prior to the start date of this job - and everything is already organized, which is why I have my location listed as New York rather than San Francisco.\"\n   * If you want them to pay for your relocation fees, then use the (open to relocation) that I wrote above.\n* **DO NOT INCLUDE YOUR FULL ADDRESS IF YOU'RE IN NORTH AMERICA** \\- only include your City and State/Province, and use one of the above depending on your circumstances.\n* **Contact details (what not to include)** \\- don't include the word PHONE before your phone number, or EMAIL before your email address. They are not necessary. People know what a phone and email look like. You're just taking up space for no reason. Also don't include your social media accounts except for LinkedIn (unless they are professional accounts for marketing/design/media positions of course, etc.).\n* **LinkedIn link and info:** Make sure your LinkedIn profile link is customized. You can get a custom LinkedIn link from your LinkedIn profile on the right hand side at the top right, click on \"Edit public profile and URL\". Make sure your custom LI link includes your name and not just a bunch of random numbers. Be creative. Are you a John Smith and you're located in Texas? Maybe your custom link could be smith.john.tx or johnsmith.tx, or include your middle initial. Play around with it until you get the perfect LI custom link. When including your LinkedIn link on your profile, instead of including the whole URL, only include the last bit (for example, **in/johnsmith**) - and lastly, make sure you include the hyperlink on your resume so that people can click it while viewing your resume.\n* Do the same as above with GitHub or any other professional links you're including on your resume. Make it a hyperlink so you're not including some messy link that's killing the \"feng shui\" of your resume.\n* **DO NOT INCLUDE A PHOTO OF YOURSELF IF YOU'RE APPLYING TO JOBS IN NORTH AMERICA.** Companies have to prove that their hiring processes isn't based on race, gender, age, appearance, etc. Including a picture in NA can actually get your resume thrown out entirely. I know LinkedIn profiles include your profile picture, which is weird that we're just okay with this, but not with pictures on resumes, but here we are. Hey, I don't make up the rules, I merely abide by them and am here to ensure your resume is, *\\*chefs kiss\\**, perfectly formatted.\n* **Summary/Objective - to add or not to add?** I only recommend adding one if you're making a career move/change, and applying for jobs that aren't in your career ladder. The other alternative is if you've been out of your industry for a while, either studying or working in a completely different field, or if you took a break and need to explain the gap in work. I believe a summary should be no longer than 5 lines of the page maximum, which is typically around 3-4 sentences. You don't need a summary if you're looking for jobs on your current career ladder and don't have any gaps on your resume.\n\n# HOW TO ORGANIZE YOUR RESUME (IN ORDER)\n\n* If you HAVE had relevant experience since your education, then put your professional experience first. DO NOT INCLUDE YOUR HIGH SCHOOL EDUCATION (unless you're still in high school, or are looking for your first or second job out of highschool, or if you don't have university to add to it and you have less than 2 years of work experience). So it would go like:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it) 3. Experience 4. Education & Certifications 5. Projects (if you have any you want to add, and the space to add them, or simply link to your GitHub or LinkedIn and list them there) 6. Skills 7. Volunteering - if it's going to assist with your current career, or if you have the space for it 8. Languages spoken (only add this if you speak more than one language fluently) 9. Interests (if you have the space and want to add them)\n* If you HAVEN'T had relevant experience and your education was in the past 1-3 years and it's relevant to your job, then:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it - I do recommend it here to explain the direction you're heading) 3. Education & Certifications 4. Projects (if you have any) 5. Skills 6. Volunteering (if you have any) 7. Languages spoken (only add this if you speak more than one language fluently) 8. Interests\n* Basically, just put the best most recent and relevant info at the top that relates to the jobs you're applying to, and mark it in order from there.\n\n# ONE PAGE OR TWO?\n\nAh I love this question, people get so heated about it haha! There's a lot of variables and a lot of opinions on this, so let's get into it...\n\n* FIRST THINGS FIRST - If you're going to go to 2 pages, for the love of the flying spaghetti monster, DO NOT, I REPEAT DO NOT have it as less than 1.5 pages. If you're commiting to 2 pages, USE THE SECOND PAGE. Beef up some bullet points, make some of the text or the lines larger, whatever you need to do if you're absolutely convinced it will not fit on one page. Otherwise, REDUCE that bad boy to 1 page. Nothing quite grinds my gears as much as seeing an 8th of the second page being used. IT LOOKS AWFUL, REALLY REALLY AWFUL. Thanks for letting me get that off my chest.\n* Unless you're in senior management, your resume (for North American applicants anyway) should be one page ideally, two pages max if you have over 10 years of RELEVANT experience, but in saying that...\n* Do you have LESS than 10 years of university and work experience combined, and you're NOT in a high up VP/Director position? You are likely best to go with one page.\n* No education after highschool, but you've got 10 years or less of really amazing experience, but not in a higher up position? You are likely best to go with one page.\n* Do you have LESS than 10 years of university and work experience combined but you also have a few AMAZING projects you worked on separately, and you've done relevant volunteer work, and your resume is actually kind of incredible? Then hell yeah, go for 2 pages! Brag all you want and show them why they need to hire you!\n* I could go on. Just one page or two, either way, ensure you use the full page if you've got it, I hate seeing only 1.5 pages or less. Either bring it closer to 2, or bring it down to 1.\n* **\"What about 3 pages, or 4, or 5? I have so many jobs and I'm awesome and want to show them!\" In North America, NO, GET OUT OF HERE, ABSOLUTELY NOT!** They won't see it as \"Wow this person is amazing\", they will see it as \"Oh wow this person doesn't know how to write a resume, and this is way too long for me to bother to read\" and they'll delete it. In other parts of the world? Sure. I know some countries like the UK for instance that want a full CV (they are different from resumes, as they list every single job, achievement, certification, volunteer experience, and more) that are often 3+ pages long. Well, my advice isn't for UK resumes, because that's not my specialty. I'm just saying that 2 is the max for North America.\n* Need to find extra space on your resume to reduce it down to 1 or 2 pages? **Use narrow margins.**\n* **SO ONE PAGE OR TWO?** Honestly, either is fine if you're using the space efficiently, and aren't writing giant bullet points and paragraphs. ***If you're unsure, go for one page.***\n\n# GENERAL FORMATTING\n\n* **Make sure EVERYTHING is uniform**. If most of your dates are 3 letters only, like Jun 2016 - Oct 2020, then they ALL need to be the same. Yes, even the months of June and July with just one more letter. It looks much neater. Ensure you double check the spacing is correct too, for example, the most common error I see on resumes is some dates having a space and then a hyphen, and then no space before the next date (example Jan 2019 -Jun 2020 and then Jul 2020-Feb 2022, then Apr 2022 - Present) - this is a very small issue, but it shows you do not have attention to detail. Whichever format you choose for one, ensure they ALL follow the same format.\n* Double check if something is bolded, or underlined (like a title or date or company name), ensure that all the others are in the same format.\n* Is the font the same for each section? It's fine if you're using different fonts on your resume, but ensure that each section is the same. For example, if one job with all the bullet points are Times New Roman, then all jobs needs to be in Times New Roman. If one section header is Garamond, and the next section header is Times New Roman, it shows you don't have the attention to detail.\n* **Remember, your resume needs to be PERFECT. You seriously need to go through each line by line with a fine tooth comb.** Imagine not securing an interview with your dream job because of a few silly spelling mistakes or poor formatting. \"Well I didn't want that job anyway\"... yeah you did. It can be a hard pill to swallow and it's easy to make light of it, but you never know who is the one deciding on the yes or no pile and where yours will land.\n* **Ensure all line breaks are the same size**. If one blank line in between 2 paragraphs is size 7, and then the next blank line between paragraphs is size 11, it's a very noticeable detail to those looking at your resume.\n* **For your paragraphs and bullet points, use the \"justify\" align**. It removes a bit of the white space and brings your text fully to the right of the page. It's much neater and removes the jagged look of left align. The exception to this (as there usually are) is if none of your bullet points are longer than one line. I like justify align on a summary/objective if you're adding one, and on bullet points or any paragraphs that are 2 lines or longer. Play around with it and see what works best for your resume.\n* **DON'T WASTE AN ENTIRE LINE ON A HANDFUL OF WORDS!** I often see people when writing their bullet points taking up less than half a line, or only a couple of words on the 2nd or 3rd line. Not only does this create a lot of white space, but it's also selling yourself short. You have one, maybe two pages to sell the sh!t out of yourself. Make every single line of your page count. Make sure every single line of your bullet points is at least halfway across the page or more. Either beef up that bullet point, or condense it.\n* **5 bullet points max per job** (of course there are exceptions, but this is as a general rule). The older the job, the less bullet points. A job from 10 years ago will only require 1-3 bullet points (and only if it's relevant to your current career. Really think hard about whether to include it on your resume or not. Remember, all your jobs are on LinkedIn, not everything needs to go on your resume... again, North American advice).\n* **Use a different verb at the start of each bullet point.** I roll my eyes when I see the same word repeated multiple times as the first word in bullet points. Instead of just using the word managed, use words like Coordinated / Directed / Orchestrated / Oversaw / Spearheaded. There's a great article written by the Muse, you can find it here: [https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome](https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome). If you work in a field with specific wording, like Nursing for example, then google \"Nursing resume verbs\" or something like that. Put the work in to your research for your resume wording and you'll reap the rewards.\n* **DO NOT USE COLUMNS** (unless you're in a creative field like a designer, or your resume is being handed to someone in person) - Columns do not play nicely with ATS (AI resume reading software) and as the majority of companies now rely on ATS to quickly read resumes, you're shooting yourself in the foot by using columns or any other weird formatting.\n* Each bullet point should not be paragraphs long. Each bullet point should be 1-2 lines long only on the page, 3 maximum.\n* Each job should take up no more than 1/4 of the page, unless you've only had one or two jobs, or are more senior. Or in another unit of measurement, no more than 11 or 12 lines of the page. The more recent the role, and the more impressive the tasks, the more bullet points there should be, but don't just include the job description which leads me onto my next point...\n* Reiterating that each job should only include the achievements from that job, and only the most impressive things you achieved should be listed. Include KPIs, processes you implemented, articles you wrote, dollar amounts of your biggest sales or averages, include numbers of accounts you managed, or how many calls you took each day, if you went over your OTE what was the percentage, etc. It shouldn't read as a job description, you need to sell yourself and show them what you're capable of! (disclaimer - unless your jobs are more entry level or food service etc, then job descriptions are likely the norm).\n* Don't include irrelevant jobs/projects. If you worked at Starbucks for 6 months 5 years back, and you've had relevant experience in your field after that, then remove the Starbucks (or whatever other unrelated jobs you have) from your resume. Your resume should be tailored to the jobs you're applying for! To give you some more reference, I have been working since 2003, and my resume only has jobs from 2014 onwards.\n* **Try to have your dates on the right hand side of the page, and your position and company on the left (list the position first, then the company next to it or below it).** It's the standard, and makes the person reading your resume find the info much more quickly. Trying to make your resume too unique (again, unless you have a creative job then ignore this) will only hurt your chances of it being taken seriously. Of course you want to make it look nice, but try to follow the standard format where possible so it's easy to read.\n\n# SKILLS & INTERESTS\n\n* **Put your technical/software/program skills in one line**, separated by commas or | lines | like | these. Putting a single skill on each line is a waste of space, and will create too much white space. Your resume should be concise, to the point and get everything across in as little space as possible.\n* **Don't use the \"slider\" scales for your proficiency in various skills.** Why? Well, firstly, if the hiring manager wants to know your level in each, they will ask. And secondly, the dots or slider scales aren't measurable and take up extra wasted space that again is not going work well with ATS. Instead, as I mentioned above, list your skills and programs/software etc. in a line separated by commas | or | these | lines. Don't include software that you used 10 years ago and never progressed past a beginner level, but list pretty much everything else within reason. Most things you'll pick back up quickly even if it was 5 years ago, provided you were semi-decent with your knowledge of it.\n* What about interpersonal skills? Should you add them? I highly recommend adding them into your bullet points, rather than listing them separately. In saying that, though, there's going to be some industries, or some skills, that require them listed separately. If you're listing them separately, first ensure that you actually need them on the resume, and which ones are necessary and which ones can be removed if any. If you're still adament you want to list them separately, then put them in the same format as your technical/software skills as I listed above, either separating each with the | lines | like | these, or with commas, one on line. And that line needs to go below the hard/tech/software skills, not before, and ideally not together.\n* **Languages:** In North America, only list a languages section if you speak more than one language. Always list English first as this is a job requirement every time, and then other languages after that. If you're fluent in English, a native in Spanish, fluent in French, and have intermediate German, I would list it as such:\n   * \"Languages: Fluent in English, Spanish and French, intermediate in German.\"\n* **Interests - should you add them or not?** It's a highly debated topic and everyone will have a different view on this. I personally believe that you should include them. For example, I ride motorcycles and love stand up comedy shows, am coffee obsessed and love my local lacrosse team. Almost every single interview I land, my interests are brought up, with the interviewer connecting with one or more of my interests, or asking me more about them. It's a great conversation starter, and it makes you more than just an applicant, they will remember you as the person who they discussed their favourite sports team with, or the person who recommended them an amazing cafe that they've now added to their list. INTERESTS WILL MAKE YOU STAND OUT, I guarantee it. **Obviously, it can be negative depending on what you write, so be REALLY selective of what you include in your interests** (for example, don't include things like Anime or Manga, or the shooting range, or reading Holocaust novels, or your weapons collection, or anything political or religious, or anything you don't want to discuss during an interview - KEEP IT LIGHTHEARTED). I would make your interests 1 or 2 lines maximum on your resume, and don't go into detail (just list them out - for example, my interests on my resume are listed as \"Interests: Motorcycles, Warriors lacrosse, console and PC games, comedy shows, arcades, & searching for the perfect espresso.\") So basically, include them if you want, but if you do include them, make sure they aren't negative or controversial topics if it's brought up in an interview.\n\n# AVOID COMMON MISTAKES\n\n* \"References available upon request\" or adding references to your resume, is a BIG no no for North American resumes. Why? Because 1. it's assumed that you have references available on request, so including that is unnecessary, and 2. You don't want the company contacting your references if you've listed them, PRIOR to letting your bosses know, which is usually after you've received an offer, and 3. You don't want your references, whom have so kindly agreed to be one for you, getting inundated with calls or emails from the companies you're applying to, prior to the offer stage. Imagine applying to 50 companies, and all 50 call your references. Ouch. They won't be your reference for much longer.\n* Is your job across two pages? Nope, that's not going to work! I hate when I see a jobs bullet points going onto the next page. In my opinion, it's messy and just says \"poor formatting\".\n* **DO NOT MAKE YOUR RESUME TOO FLASHY! STOP WITH THE COLOURED TEXT!!** (this applies to non-design resumes only) Black text ONLY, with the exception of your name, contact information and section headers. You can put those in a colour other than black for a tiny bit of a \"pop\", but nothing overly in your face like red or bright pink. I personally use a dark blue, or dark green, or dark purple for the contact info and headers - DO NOT USE LIGHT COLOURS if you're going to use any at all. But objective/experience/skills/education etc, all the actual sections (not section headers) must be black text ONLY.\n* You absolutely should not have any images, and there should NOT be any background colour or background images whatsoever.\n* Do not use tables on your resume. That won't pass ATS and it looks pretty bad honestly.\n* Don't include a paragraph at the end along the lines of \"thanks for your time, please call me on 555-123-4567 if you have any questions or would like to set up an interview\". This isn't a cover letter. And even if it was, don't include your phone numebr or email in the cover letter body, that should be included with your contact details at the top of your cover letter, which should match the same format of your resume.\n* If you're going onto a second page, include the exact same name and contact information format as you have on your first (and other pages if outside of the US where more than 2 pages is common).\n\n# FINAL STEPS - SENDING YOUR RESUME\n\n* **NAMING YOUR RESUME:** And I'm not talking about naming him Resume McResumeface. Your resume name should be \"Firstname Lastname Resume\". Don't include the job title on there, or any periods, underscores, or any other information. \"J\\_Smith Customer Support Rep. Resume V2 Final\" is everything wrong with a resume title. I hear you asking, \"But holly948, how do I have multiple resumes then for the different jobs I'm applying to?\".\n* **ALWAYS SEND YOUR RESUME AS A PDF DOCUMENT!!** If you send it through as a Word document, their computer could mess with the formatting and it could ruin the perfect look of your resume. PDF will ensure they view it exactly how you have designed it to look. Sending through as a Word doc could ruin all of the hard work you put into the formatting. Devastating!\n\n# COVER LETTERS\n\nI'm sorry that's not my area, and I loath cover letters with a passion. Write them or don't, whatever. I personally never write cover letters as I find they are a waste of my time.\n\n# AKSHUALLY...\n\nLastly, I hear many of you about to furiously get into the comments with \"but my experience was...\" and \"in my opinion, you should...\", and \"actually, I think...\" and I get it! There is no \"one perfect way\" and everyone has different opinions. **This entire write up is in MY opinion and MY experience.** I'm not saying don't comment, just, please take this post as my opinion rather than \"it must be done exactly how I say or else you're never getting a job and your resume sucks\". Do whatever you want, man. Different things work for different companies and industries. This is my own general advice, and I know with resumes there is no \"one size fits all\". No two resumes I do are the same, because it comes down to the individuals experience, education, interests, what they're applying to and so many other factors. I'm just giving free advice from my own experience, in my own opinion, to serve the majority of people updating their resumes (primarily in North America).\n\n\\~\n\n**TL;DR** \\- **if you want to improve your resume, then I've given you everything you need minus the template.** **However, I'm doing up a template at the moment, and will share with you all, hopefully this weekend.** I want to give you all of the tools you need to succeed.\n\n*Enjoyed my advice from this post and/or the last? You can buy me a coffee!* [*https://www.buymeacoffee.com/holly948*](https://www.buymeacoffee.com/holly948)\n\nI sincerely hope this has helped, and I wish you all the best of luck in your job searches!",
    "title": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2]",
    "subreddit": "jobs",
    "timestamp": 1676641102,
    "score": 20,
    "keyword": "white director"
  },
  {
    "text": "Documented bullying - no other option but to quit. So, I’ve been with this company for 2.5 years now. Everything was okay in the beginning. I knew my boss was one of the mean girls but I always knew I’d have to be on her good side and I’d be fine. \n\nWith the change in leadership and other things at work things have gotten to become very cutthroat and toxic. I started looking for jobs on my personal computer after hours and was caught since I work for a recruiting company. My boss gets me on a meeting and says that she knows and she can fire me on the spot but she will spare me because leadership likes me too much to let me go. She said she’ll always know when I apply for jobs and I won’t ever be able to hide it. \n\nNow im on her bad side. Fast forward she makes derogatory comments to me in huddles, calls out my work for being terrible when it wasn’t like that. But still I was able to get a minimal raise I think to not raise eyebrows from leadership since my department all got mini like 3k raises. \n\nKeep in mind, I am the only person of color on my team and she has said I need to reach out to the other people of color to collaborate with for other projects and force me to use images of people of color for our content when we are 98% white company. \n\nThroughout her rude comments on huddles, she told me on a 1:1 one day since I started making weird faces when she’d single me out that her best friend is the director of HR and her and her go way back. Now im seriously put in a corner. \n\nThe one thing I have documented is me giving a company wide training and her going off mute saying “this is fucking stupid” and claims it was an accident and HR did nothing. They even refused to remove the video from the SharePoint. So it’s up there with me forming tears in my eyes finishing the training. \n\nI have an out as I plan on switching careers since I feel incompetent. And I hate my job now. All my previous workplaces have never been like this, I’ve always gotten along with people. I don’t understand. \n\nI plan on leaving January 1, I am promised my bonus sometime in December but she hasn’t mentioned it since. If I don’t get my bonus that was promised in my contract before I leave what legal repercussions can I do?",
    "title": "Documented bullying - no other option but to quit.",
    "subreddit": "jobs",
    "timestamp": 1699330388,
    "score": 3,
    "keyword": "white director"
  },
  {
    "text": "Getting an itchy feeling that I’ll be fired/replaced soon from my current job. For reference I work as the sole member in our Shared Services team as a manager.\n\nI have increasingly felt like I will be pushed out of my job fairly soon. 9 months ago a new employee was hired to be a “filing legal clerk” (we’ll call her Joanne). Very small workforce currently so Joanne is essentially our General Counsel (GC)’s only support, outside of things I was doing for the GC before I started running all our a/p processes. So the GC definitely needed filing help because I was overwhelmed with accounting and the CEO requested we hire Joanne. \n\nTurns out this new person and the CEO are RELATED. Don’t get me wrong, while Joanne doesn’t know everything she has been a very good worker and is skilled in quick-learning. She is charismatic, funny, accommodating, and has been a blessing to work with in general. Nothing against her. I joined and took over our accounts payable process last year and have been pretty overwhelmed as I was the only one doing it. This took up most of my work time for a long time. But while I was overwhelmed in accounting and falling off with some of my legal duties, without notifying anyone else via email, the CEO/GC randomly promoted Joanne to “HR Manager”, and Joanne has slowly begun to handle things that I would be doing in shared services (HR, hiring, assorted admin tasks, handling of outside vendors etc). \n\nOn another note, I have been trying to transition into our development team as a sort of junior project manager, because without a finished degree (dropped out due to COVID and have just been working since then) I feel as though I’ll never move up in administration/accounting at this business. It seems development does not require a degree, just specific training/classes/experience. It really interests me as well, and as a female/POC the opportunity to break into a long-held field by older white men was too good to pass up. I have an in with the head developer and we have great work rapport. He has been slowly training me on small things when he can find time (he is EXTREMELY busy--and our only developer). \n\nThe GC is aware and seemed supportive of my choice to train into development months ago. I found this amazing online training course that our head developer says will basically propel me into the development field; asked the GC months ago if I could enroll and she's just put it off/made excuses. She has stopped answering basic message requests from me. She just scheduled a meeting with Joanne and I for this week (literally entitled “Meeting” with no subject), and I’m increasingly suspicious that she wants to just fire me altogether and not have me join development. A couple of weeks ago she asked our director of accounting to fully transition me out, stating that she’d rather the a/p process “stay in accounting” (which DOES make sense, but the timing feels fishy and she did not tell me directly that she'd went to the director of acct). I trained the new person already and have fully transitioned back into just shared services. I did not study accounting but have some previous job experience running a/r so I was fairly good at this job and actually enjoyed it--bummed.\n\nNow I find myself with little to nothing to do, other than the occasional administrative tasks with our developer (he is transitioning me slowly), and other office management/admin tasks that come with my current shared services title.\n\nI have been loosely applying to other jobs for the last few months but feel a bit panicky as I was looking forward to getting this development industry experience under my belt. Without it, I'd probably end up in office management again--nothing wrong with the job/I am good at it, but I want to get my hands on something and be more involved in our actual industry, not just back-office stuff. \n\nNot sure if I can do or say anything to executive management at this point to save my skin, but any insight would be great. My favorite mantra is \"no one knows what they are doing\", which is comforting, but dealing with the underhandedness of the GC and my lurking Imposter Syndrome has been nerve-wracking. TIA\n\nTL;DR: Executive management hired someone the CEO is related to, and feels as though I am slowly being replaced. Trying to figure out if I should stay as long as possible to get developent experience/train into a different role or cut and run (and save myself some tears/sanity)\n\nEDITED: for relevance",
    "title": "Getting an itchy feeling that I’ll be fired/replaced soon from my current job.",
    "subreddit": "jobs",
    "timestamp": 1684177425,
    "score": 3,
    "keyword": "white director"
  },
  {
    "text": "22, can’t find a job & very depressed about my situation. I’m a 22 year old female, I have a bit of experience in hospitality & animal care, a decent resume. \n\nI left my job at an animal shelter around 3 months ago because of the director not paying me what she was supposed to (hr got involved) too much work place drama & at least seeing 1 coworker a day leave due to a panic attack(sometimes it was me).\n\nI don’t have my own car or license either, the family vehicle is always messed up & wouldn’t pass at the dmv. & I’m finding it so hard to get a job, it’s genuinely making me depressed I’m tired of eating ramen & white bread. I’m tired of not ever having money. Racking up debt just to keep me afloat for now. I’m tired of putting in applications, doing all the assessments, showing up in person just to be told they’re not sure if they’re hiring. So many places I’ve called says they’ll take my name & number but I never hear back.\n\nI feel like I’m doing everything I can but I can never seem to get lucky & I don’t understand, I try to be very friendly & extroverted in my interviews, I dress & carry myself very nicely, I always try to be super respectful & interested. I don’t know , I don’t know why I’m posting this when it’s not going to change anything but maybe someone can relate.",
    "title": "22, can’t find a job & very depressed about my situation.",
    "subreddit": "jobs",
    "timestamp": 1698361152,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "My boss won't let me post anything for black history month I'm a social media director for a well known tech company. I basically call the shots for what goes on our social media pages and make sure out content is engaging and eye catchy for the millions of people that will be seeing them. For the month of February I wanted to have a campaign around black history month and had the contents and planning ready since the middle of January. \n\nEverything was going smoothly until my boss asked me what my plans for this months social media campaign was. I told him my plans and he flat out told me that I cannot post anything about black history month. I thought I misheard him at first. I asked him if he could repeat himself and to my surprise he said it again. I was in disbelief. This comes as a bigger shock to me since he's never flat out denied something from me before and was always happy about what I had in the plans for the month. \n\nI went back to him on Friday about this before the weekend and had a lengthy conversation regarding the topic (how I had this planned for several weeks, how it's immoral to not let me talk about a crucial month for black people). He kept telling me no and his reasons had to do about not wanting to be political and none sense like that. Mind you he is a rich middle aged white man so he probably doesn't understand the importance of this month and I did try explaining this to him, but it wasn't getting to him. \n\nWhat should I do in this situation? I had this planned for weeks now and it's going to be very difficult to play catch up to plan out the campaign for February with the month already here. I'm just lost and hurt.",
    "title": "My boss won't let me post anything for black history month",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1675625391,
    "score": 56,
    "keyword": "white director"
  },
  {
    "text": "Sexism in the workplace is alive and well I recently joined a new company and am feeling like I stepped into an 80s corporate time capsule. I mean it's a corporate tech environment, but dang, this is still bad even for that. \n\nThe company is literally 75% white men, and 100% white men in senior leadership. There's a white man on my team who holds a director title in things he literally has never done before - let's call him Albert. Albert has been dominating every conversation we have, thinking his opinion trumps all, and saying diminutive things to me and others. I brought it up to my manager today (also a white man) in a very diplomatic way and here are the highlights of his response:\n\n-We don't want to start any unnecessary drama\n\n-He has never heard this from anyone else, so it's all hearsay\n\n-Albert isn't going anywhere, and he needs to know that I'm able to collaborate with him effectively\n\n-He's sure that Albert doesn't mean anything by it and is like him, simply \"direct\" with his communications (implying I'm not, even though I've been very direct)\n\n-When he spoke to Albert about this before (from the last time I brought it up), he was dumbfounded and had no idea what he was even talking about. So therefore Albert's intent isn't bad, so he doesn't \"mean anything by it\".\n\n\nI was left feeling like I'm the problem and just being dramatic. This is but a small dent in the sea of misogyny I see here. This is why women don't speak up about about issues they encounter in the workplace. I know for a fact other women here feel the same way bc we've talked about it - but they aren't being forthcoming. And it's bc they know this will be the reaction. \n\nUrrrrgggghhh. Why is it so freaking hard to believe our experiences and assume that maybe, just maybe,  Albert behaves differently towards me than another white man in a leadership position over him. Fuck all of this.",
    "title": "Sexism in the workplace is alive and well",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1703184842,
    "score": 36,
    "keyword": "white director"
  },
  {
    "text": "Night shift is destroying me Hi friends. I’m on a rotating schedule in a busy PICU/PCICU, and I feel like my night shifts are destroying me. Some background: I started my nursing career 2 years ago on this unit, and I have been rotating since day 1. I have a block schedule of 6 weeks of days and 6 weeks of nights. I precept our new grads as well as international nurses. And I’m a commuter. Additionally, I just became a mom a few months ago!\n\nI used to handle my night shifts just fine. I’ve never enjoyed night shift, but I loved the people and understood I needed to pay my dues in order to eventually go full days (our unit’s standard is 2 years until you can go full days and I’m 3rd on the list). Now for whatever reason, I’m not able to handle night shift. I’ve started getting migraines after each shift, along with breaking out in full body hives and have developed a few digestive issues. Plus I’m not sleeping before or after my shifts, even though I do the same rituals (blackout curtains, eye mask, white noise, sunglasses, no late caffeine, etc.). I have nodded off a few times behind the wheel despite all of the usual tricks. On my days off I can barely function, let alone try to take care of my baby and life at home.\n\nOur unit is going through some major changes as our PICU and PCICU are splitting and therefore, there are major personnel changes as well. Multiple nurses have left, opening up positions on both shifts. I recently brought up that I wanted to move to full days with our scheduling committee, but I was told with the split they cannot afford to move anyone to dayshift, even though they consistently send out emails requesting nurses to pick up on days. \n\nI truly don’t think I can sustain this schedule, and I feel very stuck. I’m planning a meeting with my clinical director to tell her how I’m feeling, but I’m looking for advice on how to handle it. I truly feel guilty for asking to move to full days when I know I’m not next on the list. Would it be too much to provide a doctor’s note requesting full days? Or should I request to lessen the number of night shifts until I can go full days? Or do I scrap it and look for a new position entirely? \n\nLike I said, I’m guilt ridden about even asking for full days, but I feel that if I don’t do something, I’m going to be a detriment to myself, my family, team, and patients. Appreciate any advice and thanks for making it to the end 🤍",
    "title": "Night shift is destroying me",
    "subreddit": "nursing",
    "timestamp": 1684868147,
    "score": 13,
    "keyword": "white director"
  },
  {
    "text": "I wish I would have broken up with teaching before it did with me. I’ve been a teacher for 8 years…and with my wife also being a teacher this last year was just too much. Our two small kiddos were sick all the time, and we don’t have family in the area. I went way over my sick leave the last two years (so did my wife), and admin could have cared less about our situation. I work for a charter and so we didn’t have a union. My job turned into filling in for all the gaping holes that the school year brings, and because “I’m flexible” and a “team player” I was doing everything but nothing well.  I was also driving a god damn bus route all year because there are no bus drivers anywhere. I was honest with admin that I was feeling overwhelmed, but they didn’t really care. Our new principal was more concerned about looking cute, hip, and shallow as hell. Oh….I also didn’t get a lunch. It sounds horrible but I honestly kinda liked it and I really loved some of the kids. Some of them were also horrible entitled rich white trolls. Trolls is generous too, because I watched that movie with my kids, and the trolls are gangster as fuck, it’s the Bergans that are legitimately evil but also just really sad. I also worked a year in Juvie, and behavioral schools most of my professional career….so that’s my framework. \n\nFast forward to April, and the state I live is cutting the education budget again. Sound familiar? So, our “executive director” aka “the king”, starts holding “all school meetings”, which are pretty rare. His language sounded like he wrote the film “The Purge”.  Immediately, I knew I was on the chopping block because the position I had was “ support staff” and not a core teacher.  Like Beanie Babies at Hallmark in 90s… I was fucking gone.\n\nIt’s now June and we have three days left of school and I find out my position is getting cut and I’m being laid off. I got excellent letters of recommendations from the directors, and that is worth something….but I was pretty devastated…..for like 2 days….and then realized I got unemployment, which is like 200 dollars less than what my salary was and I was free. Freedom.  I started floating…. levitating between heaven and earth with my actualization that I’m free.\n\nThe school I was at was a good school, full of people that legitimately cared about the well-being of their students. Some of them were also real life Bergans, but whatever. It wasn’t this school that made me realize I just got broken up with by a crazy person but by lots of lunatics. I also may be a lunatic, but I’m kind and realize I don’t have to play with mean girls anymore. Mean people are everywhere but the teacher mean girl is a special kind of evil.\n\nI’m no teamster but I understand now that if you have any shot at bringing down the meanies you need a god damn Union. \n\nKeep fighting the good fight Teachers!  My therapist used to said that a way to prevent burnout was having a solid plan b, and or c. My situation is making me figure out what that plan B is, but honestly, I wish I would have broken up with teaching before it did with me.",
    "title": "I wish I would have broken up with teaching before it did with me.",
    "subreddit": "Teachers",
    "timestamp": 1689703462,
    "score": 211,
    "keyword": "white director"
  },
  {
    "text": "[Vent] Why do admin encourage us to set goals that are out of our control? This is just something that bugs me. One of the classes I teach is 6th grade Curriculum Assistance, which includes study skills and social-emotional skills. I always have the students set SMART goals for the year/quarter -- meaning Specific, Measurable, Achievable, Relevant and Time-Bound. I know it's kind of a buzz-word-y thing but I do think it's a good way to help students take ownership of their learning and think critically about what they can do better. They learn that, for instance, \"get the lead role in the school musical\" isn't an achievable goal because they can't control who else auditions, who the director chooses, etc. A better goal would be \"practice my audition song every day and nail the key change in the third verse so I can give my best possible audition.\"\n\nWhen I model setting these goals for the quarter I always set a goal for myself like \"grade all quiz papers by the end of the week\" or \"schedule IEP meetings at least three weeks before the deadline.\" Something I can control and achieve with my own behavior, even if the circumstances don't always cooperate. That's the mindset that I want the students to take away.\n\nHowever, when we have to set goals in our staff Professional Development program, the administration always tells us to set goals based on student performance growth in standardized tests -- something that we can't actually control. Like look, I can teach my students the material. I can assess them and monitor their learning. But I can't control if they come to school on any given day. I can't control if they pay attention or if they're distracted for any reason, urgent (my family is going to lose our apartment) or otherwise (Stacy spilled chocolate milk on my new white shoes). I can't control if they have a learning disability that makes certain content inaccessible, even if I do my best to accommodate and scaffold it for them. I can't force them to take their time and take the standardized test seriously no matter how many times I tell them that it's important. I can't control if they come in healthy, well-rested and focused on test day, or if they have a cold, stayed up the night before playing video games, are furious because their best friend stole their girlfriend, or what. \n\nThe goals they tell us to list on our Pdp are not \"SMART goals.\" They are stupid goals. They are goals that hold us responsible for things we can't actually be responsible for. And I know it's just meaningless paperwork and it doesn't really affect anything, but it really annoys me!",
    "title": "[Vent] Why do admin encourage us to set goals that are out of our control?",
    "subreddit": "Teachers",
    "timestamp": 1674182372,
    "score": 3,
    "keyword": "white director"
  },
  {
    "text": "WOC who struggle to get my point accross as I move up the corporate ladder. Should I just chill and enjoy my 6-figure salary instead ? I am a woman of color who has been in the same international company for 10+ years. I climbed the corporate ladder and now is an Assistant VP managing my own team of directors. Since the last 2-3 years I started to find myself the only POC or the only woman (or both) in the meetings and also started to have issues explaining certain viewpoints or concept to other decision-makers. Two examples are \"menstral cycle might be a factor in user's content consumption habits\" and \"why a creative concept with the number 4 might not work in mandarin-speaking markets\".\n\nI have noticed that having my inputs brushed aside on a daily basis had started to have an impact on my motivation and mental health, and the extra time I have to invested in explaining these points to important stakeholder is gradually rolling me into a slow burn-out. Honestly I am exhausted being the only the WOC representative in the decision-making circle while seeing my white male colleagues agree with each other and go ahead with that idea anyways.\n\nI am tempted to just chill and enjoy life. I have a six figure salary and living alone in a nice and cozy duplex that I own. I have so many books to read and video games to play. It is very tempting to just sit back and blend in with my colleagues, stay low key and stop providing input based on my minority background, and enjoy the company of people I enjoy working with. Then after work I simply enjoy life.\n\nOn the other side I also felt guilty since I am the very few WOC who reached this level. I feel the obligation to make sure that our opinions and our voices are heard. By staying silent I am in compliance with all the wrong decisions that comes out of the group I am in.\n\nAny advice either from someone like me (or not like me at all) ? \n\n&#x200B;",
    "title": "WOC who struggle to get my point accross as I move up the corporate ladder. Should I just chill and enjoy my 6-figure salary instead ?",
    "subreddit": "careerguidance",
    "timestamp": 1696507894,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "Am I experiencing wage theft? Hey everyone - Could use some advice, trying to determine if what I’m experiencing is wage theft and, if so, what my best course of action is. TL;DR at the bottom. \n\nBackground: I’m in a white collar profession, and recently relocated overseas for work. Though based overseas, I work for an American company, contract governed by laws of Washington, DC. I’ve worked for this company for 2+ years, and this transition overseas is an internal promotion that came with a hefty pay bump. \n\nThe problem: My new role’s contract started 1-May. To this date I haven’t received pay at my higher rate (though I am being paid at my lower rate). That’s five pay periods and counting. I’m also allocated a 25% hardship allowance on top of salary, which has not been paid. The chances of them resolving this by our next pay period next week are slim to none. \n\nI have contacted everyone and their mother at the company about this. HR has, I am not joking, never answered a *single one of my emails* about this. My Director agrees this is outrageous but there’s not much else she can do besides follow up with them as well, and loop in higher ups, but they still aren’t communicating. There’s other issues besides pay, such as accrued leave from my old role they need to pay out, which continue to go unaddressed. \n\nAt this point a VP and two Directors are on the email thread about this, and HR is still ignoring me. I am at my wit’s end and not sure what to do.\n\nPart of me wants to stop working until I’m paid, but that’s not an option; my team out here is great, and without going into too much detail, I’m in a critical enough role that me not working could bring a high profile project with public scrutiny to a screeching halt. And I don’t want to penalize my local colleagues who frankly have nothing to do with this. \n\nLook I’m not hurting for money, and I *am* still being paid at my old, lower rate so no one is going hungry. But I’m working my ass off, am pretty good at my job, and just moved across the world for this role so paying my fucking salary seems like the bare minimum we could do. Or, I don’t know, answer a fucking HR email?\n\nSo do I start throwing around terms like “wage theft” and “exploring my options” in an email next week if this isn’t resolved by the next pay day? Is this even wage theft? (I am certainly no lawyer.) Might not seem like it but I love this job, and, barring, ahem, some teams, I have a deep respect for my colleagues and have no desire to leave the company or burn bridges. \n\nTL;DR: Company promoted me effective 1-May, has continued to pay me at lower rate for five (soon to be six) pay periods, is this wage theft and what should I do, keeping in mind I love this job and don’t want to burn bridges.",
    "title": "Am I experiencing wage theft?",
    "subreddit": "careerguidance",
    "timestamp": 1689878559,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "What should I expect? Hiring Process and Venting\n\n\n\nI’m raging and asking for feedback. That’s all. Capitalism is getting the best of me, who could be mad right? \n\nAbout 3-4 months ago I applied to what I and my current supervisors would call a dream job. My current management always talks shit on how I’m working here and I got a degree and they don’t have one and look at them. But, they always talk about getting a sales position. That’s the next step that they want for themselves. What I’m attempting to do is leap frog these guys job, and go straight to sales with a competitor. \n\nCurrently, I’m a supervisor at company “x” and a thorn in the side of company “y.” \n\nMy current company “x” has eaten up loads of their market share. So the company I’m applying to “y” is a competitor of my current company. My current company is the cream of the crop right now in the industry. My current position is a leadership position, and I’m grateful for it. However, I work many many hours. I average 140-180 hours a period (2 weeks). \n\nThe management team above me is 100% aware of the exploitation they exercise on me and others daily. I have a boss who will hire anybody who walks in knowing he is going to run them into the dirt. The listed position doesn’t accurately reflect the position, and there are different expectations for certain favorite employees vs. others. (Examples: one of the guys who works above me hired his dad, so there is nepotism. He also hired his drinking buddy. Both have the easiest jobs, and lowest expectations in the office.) \n\nWhile I know I’m in a leadership position, I know he doesn’t view me as any different from those who report to me. I essentially do their jobs for them while they do various fun summer activities when they should be working in the name of “taking care of customers.” \n\nThe management team is very poor, and is under qualified, and inexperienced. However, much like the rest of the world, positions are given out not on merit but on who you know and grace of god timing. \n\nOn top of all that, any suggestion for a change I bring forward with logic and reasoning is always met negatively, because it may have an impact on their “special” “fav” employees, but it would balance out the workspace and bring in a more positive culture overall. So pretty much it’s just a very negative workplace. Different expectations for different people with the same role, poor workplace culture and environment, poor salary management (some of the hardest workers make the least $) and very very poor leadership and on boarding. These are all compounding reasons of why I was looking for a new position in the first place. \n\nI’m looking for something that gives me a little more work/life balance, and this position with the competitor “y” is definitely an upgrade. It’s a technical sales position, a Monday-Friday 9-5 white collar position. My knowledge from working hands on with the product line in a blue collar position make me a great candidate for it. It’s exactly why I went to college, graduated, and moved to the industry hot spots with a hope of getting a position like this after I got my boots dirty and learned the trade the old fashioned way, nose to the grindstone, and never asking for anything I didn’t deserve. \n\nAnyways, as I stated above I applied 4 months ago, and 1 month ago I had my initial interview. I blew the initial interviewer away. I’ll call him Johnny. I blew him away to the point where he immediately began discussing the future, wanting me to meet the local team, and his boss. (The company headquarters is in Houston.) He told me he’d get me an interview with his boss “Harvard boy” and HR and then he wanted me to meet the local team. \n\nFast forward 2 weeks, I interview with his boss(Harvard boy), who by the way got his MBA at Harvard and is by far the most stressful interview prep I’ve ever engaged in. I found myself shaking in the interview with him, I’d never talked to a Harvard grad before and nerves may have got the better of me. I answered questions well, but I know I could’ve have performed better. While I didn’t leave with a horrible feeling, I knew I didn’t do as well as I could have. I also know you have to really check boxes with people like this, and my lack of direct sales experience may have pushed him away. For this position I have all the technical knowledge required, but I lack the direct sales experience. Everyone else in the candidate pool lacks the technical knowledge, but likely has sales experience. \n\nAnyways, a couple of weeks pass and I follow up, I ask very specific questions to my first interviewer”Johnny” , and he replies back with no direct answers to my questions, but he invites me out to dinner as he is paying my state a visit, and meeting his current team. \n\nFast forward again, I go to the dinner, I meet the local sales leader to my district. Blow it out of the water again. The guys love me. I’m personable, I have industry knowledge, I’m not afraid of going after my current company’s customers. He tells me he wants to move forward, and that I’m the best he’s interviewed and clearly the most qualified. The only Problem? His boss. Harvard nut sac boy must have it out for me or something. (This is anger\nTalk for me not doing as well as I could have) Johnny said he’s going to go back to his boss and tell him he’s wrong. He notes how sometimes these big executives and directors in companies are quick to judgement, and that there is no way he could have really gotten to know me over a teams interview. He loves me. Johnny loves me and his local team sales leader loves me, I blew them OUT OF THE WATER. They tell me so right to my face. \n\nIt’s been almost a week now, and I haven’t heard back from Johnny since the last time we spoke at dinner. \n\nThis has been the longest, most stressful hiring process I’ve ever been involved in. But I think the nature of the position warrants it. I’d have potential to make way north of 6 figures. (Likely 150-200k) And being a 29M w Bach degree I’m right where I wanna fuckin be. I get them wanting to make sure they get it right, but are they yanking my chain? Should I follow up? How much longer should I expect to wait?\n\nWhat do you guys think? If you had to assign a probability of me getting the job. What would it be? \n\nSitting waiting on a flight now, so I’ll try and be quick to respond to any questions.",
    "title": "What should I expect?",
    "subreddit": "careerguidance",
    "timestamp": 1690649384,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Should I Confront Descrimination? Seeking advice before I send my boss an email confronting the descrimination that I experienced when she denied promoting me, late October 2022.\n\nTimeline:\nI started in 2019 as a coordinator, promoted to senior coordinator November 2021, applied for 1 of 5 open analyst positions. Applied and interviewed in September 2022. Was denied promotion then promoted to a new position created \"just for me\" as an associate analyst, plus my duties as Sr. Coordinator (November 2022).\n\nI referred an employee to replace my coordinator position who was hired in April 2022. My trainee (white male) applied at the same time as me for the analyst position and was promoted in September 2022 to the analyst position. There are 2 analyst positions that have yet to be filled. \n\nDescrimination History:\nTrainee was assigned a \"high priority\" state that I assisted on (aka prepare everything and having the director approve before filing) for 2 years. I even trained the previous analyst how to do the job. \n\nI am a Hispanic female. The coordinator/admin positions have been filled with Hispanic and white employees for the past decade (at least) but only the white employees have been promoted to salaried positions. Not one Hispanic employee has ever been promoted to a salaried position in my department, that's 20+ years streak. There is one non-white salaried in the department and they were just hired. \n\nI am coincidentally the only \"analyst\" who is an hourly non-exempt employee; performing the same job as previous salaried analysts. I'm getting paid $20,000 less than my trainee now. They won't even approve overtime for me, I am seriously expected to do two jobs in 40 hours. Instead, I've been instructed to ask my manager to finish any of my tasks left at the end of each day. It's still extra work to delegate those tasks and sometimes they don't get done which then gets blamed on me!\n\nI complete my associates degree in paralegal studies this month, but a college degree is not required per the job description. \n\nMy education and/or race are the only two possible explanations for why I was denied the promotion. When the director met with me via video chat to let me know that I was denied the analyst position and would be promoted to a newly created associate analyst position, she said it was because she and the managers thought I would need too much training. But she is apparently fine with training a new employee who has only 5 months of experience on the hardest job on the team.  Starting to feel like opposite land yet? \n\nI haven't received any negative feedback on my annual review in 2 years. \n\n***********\n\nI want to email pretty much all of what I wrote here, albeit more concisely. \n\nAt the end I want to lay out some acceptable solutions:\nA) Promote me to a \"real\" salaried analyst position and assign me CA. \nB) Promote me to the new salaried operations manager position.\nD) Give me unlimited overtime each week to complete both jobs.\n\nThey will probably fire me under the guise of being 1 minute late clocking in or whatever. But if they do then I will file a complaint all the way to the top. I'm planning to find a new job anyway, just can't leave this month. \n\nI've already spoken with an employment attorney and following their instructions. But this post is mostly to vent, hear about similar experiences, and advice on how to phrase my points listed above.\n\nThanks!",
    "title": "Should I Confront Descrimination?",
    "subreddit": "careerguidance",
    "timestamp": 1673399483,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "What types of positions should I be applying for to switch from blue collar to white collar? aerospace purchasing experience. I posted this last week, and I had a few interviews this week which makes it seem like I'm over qualified for the positions that I'm applying for. \n\nOP:\n\n\"I've been at my current job for almost two years now, and while I love it, there is no growth opportunity or room to make more money. I'm looking to finally make the transition from blue collar to white collar, and I'm hoping that my current position will help me make the transition easier.\n\nI currently work in aerospace, where I manage the tool room (one person). I setup the jobs for the machinists, but I also manage all the inventory of tools in the shop.\n\nI do the purchasing for the shop, which includes things like maintenance, oils, coolant, tooling, and other oddities. I fill out my own purchase orders and have the boss sign off on them each day, and make the purchases myself. I keep track of lead times, etc as well.\n\nI do NOT use the ERP system.\n\nMost of the purchasing is done through a few suppliers, so it is asking for a quote or adding to cart and checking out. There isn't negotiating, or extended lead times.\n\nIn the two years that I've been there though, I've made huge improvements to what, where, and how they purchase items. I've been permanently been able to eliminate some key supply chain issues. I've saved them measure amounts of money as well.\n\nI'm applying for purchasing positions, but I'm wondering if there is anything that I'm not thinking of.\n\nThe entry level purchasing positions pay so little that I wouldn't be able to support myself, and while I'm able to take a pay cut (I currently make $65k), I won't be able to take a pay cut all the way down to $42k, which I'm seeing a lot of.\n\nI don't have a college education, but I have some college and will be going back soon.\n\nDoes anyone have suggestions on job titles that I should be looking for when I'm applying?\n\nI appreciate any help.\"\n\nThe interviews I had this week were for a buyer I position, and an expeditor position which were both entry level. \n\nI nailed the expeditor position interview but during the interview it definitely came off as if I were more speaking and understanding on the director's level and also the person who worked under them. \n\nAt one point during the interview they asked me what the timeframe would look like for me being able to leave my current position, and they also looked at my linkedin 20 minutes after the interview ended. \n\nThe Buyer I position, I started interviewing with the person, and about ten minutes in the stopped me and asked what I was looking for in terms of pay. I told them and they said they thought so and that it was fair based on my experience, but the position was entry level and not near what I was looking for. \n\nI'm at a loss at what I should be applying for. An entry level position definitely seems like I'm over qualified for, but there are a few skills I'm missing for that. ERP experience is a good example of what I'm missing. The mid level positions that I see posted seem way beyond my skill set.",
    "title": "What types of positions should I be applying for to switch from blue collar to white collar? aerospace purchasing experience.",
    "subreddit": "careerguidance",
    "timestamp": 1678545612,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "How to transition careers? To sum up my background, I am a 22 year old working as a plumber in new construction, I got 4 more months of work left before I can go write my Red Seal (Plumbing License In Canada). I’m very proud that I’ve been able to come this far. However, the job sucks. I don’t mind it in my 20’s, but one day I’m gonna hate it. I can always work for myself and make lots of money, but I’m still working out in the hot sun and cold winter, using my body. \n\n\nSo recently I’ve been looking into white collar careers. I live in the Pacific Northwest where a 1 bedroom condo is almost $900,000 😂😂. I’m not opposed to moving away where it’s more affordable, but all my loved ones are here, but that’s a different story. Anyway, to make it here, you need to make at least $150,000 a year…… roughly \n\n\nSo basically, the extreme high cost of real estate, with the desire to own a home and have a family, along with the desire to leave the trades has brought me to the conclusion. That I need to find a “high paying, white collar” job. But what are these jobs? Im not talking about accountants, lawyers, real estate agents and mortgage brokers. I’m talking about these people with euphemistic titles who make a shitload of money. \n\n\n“Hi what do you do?”\n\n“I am an executive creative marketing assistant director for the HR team in a tech company who specializes in software development \n\nUmmmmmm, fucking what? 😂\n\nOr it could be a simple as a salesman for a cardboard box company, which sounds like a great career \n\n\nSo my questions are this. How can I transition from my current job as a plumber into one of these “hidden jobs”? And more importantly, where can I find these jobs? \n\nSorry for the novel 😂",
    "title": "How to transition careers?",
    "subreddit": "careerguidance",
    "timestamp": 1684125221,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Should I report him to HR? Hi everyone.  I have been working in an all-white office space for the past 2 years or so.  The coworker who I work most closest with is a fake progressive white man who spent nearly every day asking me questions about my racial/ethnic background, sharing gruesome details of minority trauma/suffering stories he has heard on the news to me, or wanting to debate problematic views he has in order to learn from me why they are racist.  For a brief period I think he had a crush on me and he would detail his dating history which included past exes of a similar background to mine (but he doesn’t do this anymore).  I would try to ignore him the first year I was there, and then later onwards I would mention to him in various ways that I did not want to discuss such matters (let’s focus on work, I feel too tired or depressed to talk about this, I find it traumatic to discuss this, I am too busy, etc)\n\nI finally worked up the courage to ask my boss for permission to let me set up a meeting with him and be more direct.  He said ok.  The meeting I had with my coworker went alright - he apologized for his behavior and said he would change although it would be unrealistic for him to be 100 percent perfect overnight.  I said I understood.  It has been about 2 weeks and so far he has left me alone.  Two times since then he said he wanted to mention a story to me but didn’t because it was on a topic I requested him not to discuss, and that the reason he was telling me this was because he wanted me to know he was working on it.  We then went back to discussing work.\n\nMy manager told our director, who then called me into his office to discuss the issue.  He would like me to report this all to HR because he is worried my coworker could do this sort of thing to another person in the future too.  He said that 7 years ago he did something similar to another coworker, and that he only got a slap on the wrist for it, so he wants to show HR what happens when you ignore a situation.  He said that if I report him he will be able to physically separate us so I don’t have to be around him anymore & that he can look into creating a new position for me since they have more money coming into the budget.\n\nShould I report him to HR?  A part of me feels like an asshole for doing so because it seems like he is trying to change now, but another part of me still feels shitty around him (I can’t un-hear some of the things he has said even though I am trying).",
    "title": "Should I report him to HR?",
    "subreddit": "blackladies",
    "timestamp": 1687470120,
    "score": 52,
    "keyword": "white director"
  },
  {
    "text": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies? Hi all, apologies for the long post below that is likely full of some grammatical errors! :)\n\nI have been with my partner for 5 years. He works for a very intense advertising company and is the only Black individual on his team. His managers are White/Asian and have started using terms such as, “disrespectful,” “angry”, “isolative.” I want to be clear, my partner is loved by his team/ “mini” managers (those who he supervises). He has received very good reviews and is extremely engaging/polite. He’s truly lovely. His colleague in the exact same position is vocal and will often raise his voice during calls, to which my partners bosses simply reply with, “that’s fine. We hear you.” \n\nToday, my partner worked from 7am-7pm and a 30 minute call was put on his calendar at 6pm. There has been some financial issues going on with their company, so everyone is feeling the pressure. My partner wrote in the teams chat, “I’m a bit blinded sided by this meeting. What is it in regards to?”  to which his manager said, “that is a disrespectful response. WE have been working harder than you the entire weekend.” My partner responded with: “Okay, let’s just do this then” to which they wrote “you’re so angry and disrespectful.”\n\nThis resulted in a very heated, 30 minute Teams call in which his superiors called him paranoid, disrespectful, and angry. He highlighted that his White colleague has said much worse and even hung up on calls, to which they responded, “we have no memory of this.” My partner refused to say that being labeled as such is damaging to but he did say he felt unsafe (they ignored it).\n\nI wanted to jump in this call SO fast but held my tongue. My partner was extremely defeated and I was livid the entire time. As Black women, how do you all navigate your partner experiencing bias, racism, labeling, etc? I am exhausted and this was just ONE 30 minute call.  He has been at this company for 4 months and wants to stay at LEAST 1-2 years to make Director. Part of me wants him to find a new job ASAP but I also know that isn’t feasible.\n\nI just feel defeated and watching him experience this hurts me deeply. Any tips?\n\n****EDIT:*** The only thing we can think of that has contributed to their perception of him changing is that he took a Monday off (approved leave) to move apartments. He didn’t log on at all to check accounts/budgeting and one of his Supervisee’s had made a mistake with an account. This was caught the next day but resulted in everyone having to work this error out. This was about two months ago.\n\nUpdate: Thanks so much everyone for your feedback! He has started documenting everything, as you all have noted. Not sure how this will turn out but it is definitely concerning. He’s also started updating his resume and making sure everything is followed up with an email documenting what was/has been talked about in meetings. He noted that he is fearful to use “the race card” because there is no coming back from that, which I understand but still I am still encouraging him to address how damaging language can be as the ONLY Black male on his team. It’s not the race card, it’s the reality and race is ALWAYS present (whether conscious or unconscious). \n\nFor right now, he is keeping his cool and maintaining professionalism.",
    "title": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies?",
    "subreddit": "blackladies",
    "timestamp": 1688601081,
    "score": 37,
    "keyword": "white director"
  },
  {
    "text": "Do older white men hit on you for no reason? Posting it here, because my post was refused by the black people facebook group.\n\nA question to all black women out there : Do older white men pursue you for no reason? I mean like as if they think that all black women like older white men and so they pursue you without even knowing exactly if they like you or not?\n\nLike I am in college rn and all my older male professors try to impress me or just stand there and observe me. I had an exam yesterday and there were three male professors (for 3 classes writing exam) and all three like stood there at the front and observed me while writing my exam. I felt sooo uncomfortable that I could not concentrate, they always like looked straight at me ( I am the only black girl in the study program, no other black people). I sat in the very last front (behind) and they were always coming near me, one (the study director who was one of the males) even came to behind me and stood there for like three to five minutes. I just feel very umcomfortable in class and constantly thinking why they cannot leave me alone. They do not pay as much attention to other students, not even the girl beside me, who was cheating by either looking at my paper (which I did not care) or the other girl on the side of her. Still, they were full concentrated on me. I also feel like maybe they mistrust me (because I am black) and think I will cheat because I did not study. Even then, why did they accept me then, if they think so negatively about me? Recently, I got a bad feeling about my study director, as if he could not like me and has prejudgments against me but still pretends. \n\nI hate this university, I hate these professors and I hate my student life. Most of my fellows are white and so superficial, so it is very difficult making friends, that is why I feel so lonely. Since I got there my mental health got worse and now I cannot even concentrating in studying for my next exam because I keep thinking about how horrible my life got and that I just want my peace (study stress included). \n\nP.S. I live in Europe and my university is predominantly white. I wish I could go to an HBCU, but the registration process is so complicated and I do not know if they would even take me or if I would have the time now to send my application til the deadline with all the stress I have rn ...\n\nIf I could turn back time and go to another university, I definetely would. This is hell. \n\nWhat do you think?",
    "title": "Do older white men hit on you for no reason?",
    "subreddit": "blackladies",
    "timestamp": 1674388883,
    "score": 28,
    "keyword": "white director"
  },
  {
    "text": "I don't trust my study director and I don't know why. So for context, I have been skipping most of my classes at university because I was having major anxiety when visiting the lectures (due to being stared at by lecturers and because of having no friends, feeling depressed). So I \"took a time off\" unofficially and was working on everything from home. \n\nMy lecturers noticed this and told our study director about this and he contacted me for a online conversation today morning. We then talked and he seemd rather annoyed and impatient with me than empathic. His tone was kinda judging me like first told me that he noticed I was skipping classes and then asked me what was going on. I told him I was not doing well because of my anxiety (I left out the part of the being stared at ... bc most of my lecturers are white and I didnt want to come off as complaining about race and yada yada). He then proposed for me to take a semester off but I told him that I already did a gap year before starting my degree and didnt want to lose any more time during my studies. He was like \"That's not an excuse for me for saying that.\" and for me it came off as very judgementful and my guards were up even stronger at that moment. \n\nHe then gave me contacts of psychologists on campus, bla bla bla, then told me that he wants to be my \"go-to\" person when I need something and to tell him how things turn out in the future but I dont trust him and I also don't want to tell him anything about me. I just don't know, I get a kind of dishonest, sneaky energy of him, especially what he did to me during the exams (like standing behind me most of the time and staring at me like he was controlling me). I have noticed in general, that he is more tensed up and serious with me than with my other white fellow students even though I am very quiet, don't act up, the only bad thing I did is having not so good grades but even then ... \n\nI really want to trust him but I just don't get that close \"teacher-student\" trust bond with him and mostly hold my distance. \n\nWhat do you think?\n\nP.S. I am the only black person in the whole study program, all others are white, including the lecturers and my study director.",
    "title": "I don't trust my study director and I don't know why.",
    "subreddit": "blackladies",
    "timestamp": 1683223183,
    "score": 17,
    "keyword": "white director"
  },
  {
    "text": "Shopping while Black I need help. I am being harrassed while shopping at my local grocery store. I have tried everything to get them to stop.  I have reached out to store directors, directors of operations, corporate you name it. It stops and then it escalates again. I live in a predominantly White/Hispanic/Asian area in California.  Its now at the point where I have to address the situation legally.  Any assistance would be greatly appreciated",
    "title": "Shopping while Black",
    "subreddit": "blackladies",
    "timestamp": 1679849089,
    "score": 11,
    "keyword": "white director"
  },
  {
    "text": "White Women Supervisor (Black Men) Yes, you read that correctly I am a Black man, but I was unsure where to go with this and I decided who could sympathize w/ what I’m going through other than other black men, it would be y’all! Black women. So, hopefully y’all could help a brother out.\n\nLong story Short: I spent 7 years as a Middle School ELA teacher and I am now transitioning to an Educational non-profit as a Tutoring Manager who runs the tutoring center and coaches undergraduate tutors. I supervise two other people and I have a supervisor (the Program Director) who, yup you guessed it! She’s white. I’m trying my best to keep an open mind/be optimistic but I really believe I can read people well (especially white people). She just gives off fake-woke I support you and I’m here for you vibes, she loves to say I have all the freedom in the world to implement what I see fit in regards to programming because my extensive teaching experience, but each time I have an idea, it’s complimented but then given “feedback” on how it needs to align more with the company’s vision aka her vision lol and I see right through it!\n\nHave y’all ever experienced this/any advice? This job is more of a stop gap for me to gain leadership skills and eventually in a year or so moving into an Instructional Coach role at a school or another company. Anyway, thank you in advance!",
    "title": "White Women Supervisor (Black Men)",
    "subreddit": "blackladies",
    "timestamp": 1694212342,
    "score": 10,
    "keyword": "white director"
  },
  {
    "text": "Managing grief in a toxic work environment with toxic people There’s a TL:DR at the bottom, but I must provide some back story and character arcs. Apologies if this is too long. I could be making a mountain out of a molehill. But this has just been on my mind for the past few days…\n\nMy grandfather passed away this week at 90. He was declining in health and was my last living grandparent. This is my first loss of an immediate family member in decades, so my emotions have been all over the place. My grandfather’s health was a sore spot for me (he had dementia). I have mixed emotions; I find comfort that he gets to be with the love of his life, our family gained an ancestor, he’s no longer in pain, and he lived a good life.\n\nI’ve been trying to be really private with my grief and only telling people that I trust: family, close friends, and some close work associates. Our office typically announces when there’s been a death in someone’s immediate family. I’m a very private person at work. I also feel jaded and ambivalent about my job. Last year I was dealing with hostile managers who constantly berated me and nitpicked over the smallest things (currently looking for an escape plan). So I am uncomfortable broadcasting this information in this toxic work environment.\n\nI’m just getting back to work after an extended vacation for the holidays. My office is very touchy-feely and over-emotional to the point it’s really cringe and off-putting. I’ve already told my direct manager (let’s call her Karen), and I told her that I need privacy because my grandfather's passing has been difficult to process. She was very understanding and asked if she should share the news with two of our managing Directors (E and H) and my other manager (Jason, which is temporary). I also support two other people, Paul and Ashley. However, Paul has left, and Ashley is on maternity leave (she and I are very close, so she already knows). I think Karen assumed that I had already told my managers. I politely said she could only tell the Managing Directors, E and H. I have another manager (the subject of this post) who is pretty much the main source of my agony at work; let’s call her Rosemary.\n\nRosemary is very patronizing. We have a strange working relationship. We’re around the same age, which makes our manager/admin assistant dynamic awkward.  She was very well aware of my grandfather’s health; she ALWAYS asked about him or if I’d talked to him. I would give a short answer and change the subject quickly because it was painful for me to talk about his condition.  I’ll add she lost two of her grandmas this past year; I’ve been supportive by sending comforting notes. However, I don’t want anything from her. We’re nowhere near close, so I don’t feel the need to go into detail on anything with her (I’ve been giving her the same answer for two years whenever she asks me about my weekend). There’s so much I can say about this person, but I’ll try and keep it brief. But there have been times in the past she has used sensitive information against me when she’s lashed out at me under the guise of offering feedback. This is actually a common thing in my toxic work environment.\n\nFor example: This past October, I got Covid at a work event and couldn’t attend my childhood friend’s wedding and bachelorette party, something that I was looking forward to after putting in overtime and extra manpower for a month working on another work event. Before all of this, I screwed up on something and thought it was resolved, but to her, it wasn’t, so she brought it up when I was fully back at work (still sick, mind you). At the end of her tongue-lashing, she told me, friend's “I know you know this work is important, but it’s not as important as you missing your best friend's wedding because you got Covid” as I was developing symptoms right after our work event she told me, “well no wonder you’re not feeling well, you’ve just been overworked and rundown.” Who says crap like that?!?\n\nI’ve finally confirmed my travel plans and the days that I’m working from home. We have a department-wide day in the office on Monday, which I begrudgingly said I would go to (kind of used it as a bargaining chip to work from home the following week). Anyways, the department policy for leave is to talk to your direct manager (done), alert your managers (need to do), and put it on our department calendar tagging your managers (need to do). No matter how I slice it, I have to tell Rosemary about my leave, but I really don’t want to give her the details. Telling her, “FYI I’m going to be OOO” and putting it on her calendar with short notice before a three-day holiday might set her off, maybe not now, but probably in a couple of weeks. If I say, “I have a family emergency,” she will poke and ask questions (which I know will get me emotional in the raw state that I’m in). (Side note: she never alerts me about her leave, I’ve gone half a work day not hearing from her only to realize that she’s OOO). So does anyone have any tips on how they try to reinforce privacy during difficult times?\n\nTL:DR - How do I maintain privacy while grieving in a toxic office setting that doesn’t understand boundaries?\n\nThank you for your help! ♥️\n\nEdit: if you're wondering if they are...yes, most of my coworkers are white. I'm one of two black women in our department. And I think race has played a huge part in my overall treatment at work.",
    "title": "Managing grief in a toxic work environment with toxic people",
    "subreddit": "blackladies",
    "timestamp": 1673126701,
    "score": 6,
    "keyword": "white director"
  },
  {
    "text": "Joy Ride Director Adele Lim on Claim That Film “Targets White People”",
    "title": "Joy Ride Director Adele Lim on Claim That Film “Targets White People”",
    "subreddit": "asianamerican",
    "timestamp": 1688607169,
    "score": 82,
    "keyword": "white director"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 70,
    "keyword": "white director"
  },
  {
    "text": "A 25-year old Managing Director applies the best from the East and the West in a podcast interview Rick Hu, who became the youngest Managing Director of Northwestern Mutual at the age of 25, was the keynote speaker at the Asian Hustle Network conference that happened last month in Vegas.\n\nMy friend also interviewed him on his podcast. I wanted to share some highlights on what resonated with me:\n\nImposter syndrome - imagine what it felt like being a 25-year old Managing Director in a room full of 50-year old white men. Rick struggled at first but eventually led his office to becoming the number one district of the company.\n\nRelationship with your parents - Rick earned the respect of his parents through success. At the same time, he remained humble. He was able to build a relationship with his immigrant parents on equal footing and shared with them the abundance over scarcity mindset.\n\nBeing uncomfortable - he cites his successes to his failures, which he goes into deep (like getting put on probation in his first job). It’s amazing how far he’s come.\n\nI think this story is pretty closely tied to the Asian American experience and it’s good to have a role model like Rick to learn from: [https://podcasters.spotify.com/pod/show/afterhourprojects/episodes/Episode-15-Rick-Hu-Mindset-Matters-e24sn74](https://podcasters.spotify.com/pod/show/afterhourprojects/episodes/Episode-15-Rick-Hu-Mindset-Matters-e24sn74)",
    "title": "A 25-year old Managing Director applies the best from the East and the West in a podcast interview",
    "subreddit": "asianamerican",
    "timestamp": 1685481129,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "Interviewing the Man Behind the Scenes of the Birth of a Cultural Icon: Canadian Feminist Activist \"Big Red\" In this clip from a full length interview that will be posted this week, I am talking to Justin Trottier. In 2005 at the age of only 22 Justin started the University of Toronto Secular Alliance. Within 2 years this small grassroots project would go national, becoming the biggest atheist organization in Canada. During his time as National Executive Director for Canada’s most influential atheist organizations he began a personal side project shining light on issues faced by men and boys.  \n\n In late 2012 the atheist movement would become engulfed in a feminism and social justice related culture war that functioned as a prelude to the culture war that has engulfed all of us for the past 8 years. As an open supporter of advocacy for men and boys, Justin - a straight white male in a position of power - found himself in the middle of a bulls-eye. The toxicity of the conflict led Justin to eventually leave the atheist organizations that he birthed, devoting himself fully to what was initially simply a side project: boys and men’s issues advocacy.   \n\nJustin would launch the Canadian Association For Equality, or CAFE, which would host educational events that, unexpectedly, garnered international attention. Well, more specifically, the angry protests that these events inspired would garner international attention. In this video, Justin and I discuss how one of the angry protesters would become a cultural icon known to many of her critics as \"Big Red\". [https://youtu.be/GHC-KR23Uc4](https://youtu.be/GHC-KR23Uc4)",
    "title": "Interviewing the Man Behind the Scenes of the Birth of a Cultural Icon: Canadian Feminist Activist \"Big Red\"",
    "subreddit": "MensRights",
    "timestamp": 1675019290,
    "score": 49,
    "keyword": "white director"
  },
  {
    "text": "Men have it easier in the workplace? Thoughts? The stories below are from trans-men, who found it easier to be a man in the workplace. They were taken more seriously, were up for promotion, had papers published in journals when they were men, noticed other male colleagues being misogynistic, but not when they were women or transitioned to being women.\n\n[https://time.com/transgender-men-sexism/](https://time.com/transgender-men-sexism/)\n\nMEN AT WORK\n\n**One day in court, Ward and his opposing counsel** were making a big request to a judge. Ward knew their question would not go over well, so he wasn’t surprised when she reprimanded both him and his opposing counsel for asking. What he didn’t expect was for the opposing counsel lean over to him and call the judge the c-word. “We weren’t out the courtroom door when he said that to me under his breath,” Ward says. “He never would have said that when I was female.”\n\nMany trans men I spoke with said they had no idea how rough women at work had it until they transitioned. As soon as they came out as men, they found their missteps minimized and their successes amplified. Often, they say, their words carried more weight: They seemed to gain authority and professional respect overnight. They also saw confirmation of the sexist attitudes they had long suspected: They recalled hearing female colleagues belittled by male bosses, or female job applicants called names.\n\n“If I’m going off-the cuff, no-one really questions it,” Ward says. “It’s taken as, ‘He’s saying it, so it must be true.’ Whereas while I was practicing as female, it was ‘Show me your authority, you don’t know any better yet.’”\n\nMitch Davis is now a director of organizational development at Planned Parenthood Federation of America in New York City, but he’s worked in HR for many different companies since coming out eight years ago. In one previous job, he heard his boss call female colleagues “old cows” and refer to a middle-aged job applicant as “Dame Edna” after she’d left an interview. “Evidently men say things like that to each other all the time,” he says.\n\nOther trans men say they’ve heard male co-workers sexualize female colleagues when no women are present. “There’s some crude humor, some crass humor,” says Cameron Combs, an IT consultant in Olympia, Washington. He says he’s heard male colleagues do “appraisals” of women in the office or observe how female co-workers used their “womanly wiles” to rise up the ladder, conversations he says he never would have heard when he was a woman. “When they saw me as female, it was kind of an automatic stop,” he says. “It’s a little less censored, the jokes I hear, the comments.”\n\nSome trans men have noticed the professional benefits of maleness. James Gardner is a newscaster in Victoria, Canada, who had been reading the news as Sheila Gardner for almost three decades before he transitioned at 54. As soon as he began hosting as a man, he stopped getting as many calls from men pointing out tiny errors. “It was always male callers to Sheila saying I had screwed up my grammar, correcting me,” he says. “I don’t get as many calls to James correcting me. I’m the same person, but the men are less critical of James.”\n\nDana Delgardo is a family nurse practitioner and Air Force captain who transitioned three years ago. Since his transition, he’s noticed that his female patients are less open with him about their sexual behavior, but his bosses give him more responsibility. “All of a sudden, I’m the golden child,” he says. “I have been with this company for 6 years, no ever recommended me for management. Now I’m put into a managerial position where I could possibly be a regional director.”\n\nTrans women have long observed the flip side of this reality. Joan Roughgarden, a professor emerita of biology at Stanford and a transgender woman, says it became much more difficult to publish her work when she was writing under a female name. “When I would write a paper and submit it to a journal it would be almost automatically accepted,” she said of the time when she had a man’s name. “But after I transitioned, all of a sudden papers were running into more trouble, grant proposals were running into more trouble, the whole thing was getting more difficult.”\n\n“As a man, you’re assumed to be competent unless proven otherwise,” she says. “Whereas as a woman you’re presumed to be incompetent unless proven otherwise.”\n\n&#x200B;\n\n**Many white trans men said they felt it was easier to walk through the world, freed from the myriad expectations placed on women.**",
    "title": "Men have it easier in the workplace? Thoughts?",
    "subreddit": "MensRights",
    "timestamp": 1686255385,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "The Barbie movie is a feminist milestone in cinematic history (no spoilers) I saw Barbie over the weekend and loved it. I dressed up in a pink dress and biked to my theater in a pink helmet and the white sunglasses she wears in the first scene. I felt so cool. In line I met other girls, all dressed in pink and let me tell you, the vibe was so wonderful and welcoming. \n\nAs I've watched the news following Barbie this week, I'm realizing this is even bigger than Barbenheimer. This is bigger than I ever thought it would be. \n\nBarbie is the highest grossing movie with a woman director, followed by Wonder Woman and Captain Marvel. I went to both of these movies on their opening weekend as well, but I'll get to that. First, a quick comparison:\n\n\"With $162 million in ticket sales from North American theaters, according to studio totals Monday, “Barbie” catapulted past both “Captain Marvel,” which was co-directed by Anna Boden and opened to $153.4 million in 2019, and “Wonder Woman,” Patty Jenkins’ 2017 film that debuted to $103.3 million\" (https://www.csmonitor.com/The-Culture/Movies/2023/0725/Barbie-box-office-bash-Gerwig-s-opening-weekend-shatters-records#:~:text=With%20%24162%20million%20in%20ticket,that%20debuted%20to%20%24103.3%20million.) \n\nAs I said, the vibe at Barbie was amazing. I dressed up, which is something I did for both Wonder Woman and Captain Marvel. What can I say? I love dressing up and I'm a nerd at heart. \n\nAt BOTH Wonder Woman AND Captain Marvel,  I had at least one man criticize my outfit. \n\nAt Wonder Woman I wore a WW T- shirt, a WW purse, and those WW socks with the capes on them. I show up early and I'm 2nd in line. The middle aged man in front of me looks me up and down and condescendingly says, \"Cute. But Wonder Woman doesn't wear a cape.\" For once in my life I had a good retort: \"Lynda Carter wore a cape for the Wonder Woman TV show.\" This dude, unphased, says \"Well, I haven't watched that since the 70s\" as though that changed the fact that he was incorrect. I was mad, but I did walk away feeling like I got the better of that convo.\n\nFor Captain Marvel, I didn't have (or franly want) anything Captain Marvel themed. She's great, don't get me wrong, I just really didn't have anything. So I rewore my Wonder Woman shirt as a throwback to the last woman-directed superhero movie. No less than FIVE MEN informed me I was wearing the wrong shirt. I wasn't upset at this, more amused. \n\n But in retrospect, it says a lot about how men feel so comfortable policing women's clothing and gatekeeping fandoms. Like I said, COMPLETELY different vibes. \n\nI remember a comedian when Wonder Woman came out (I wish I could remember her name so I could give her credit). She pointed out that if WW tanked, it would be taken as a sign that women-led movies don't do so well. The quote I remember was \"Batman v Superman sucked, but no one said, 'I guess we gotta stop making man-movies now.'\" And it's funny because it's true. It has long been assumed that movies with a female audience aren't worth it because men won't go to them. Even WW and CM were tied into superhero franchises in the hope it would attract more men into the audience.\n\nAnd then you have Barbie. There is no effort to make this pink masterpiece attractive to men. It is a movie about a girl's toy and it was 100% marketed for women. I don't remember ever seeing something like this in my lifetime.\n\nOn top of that, Margot Robbie is 33, which means a lot when you have Andrew Tate out here telling incels that women aren't pretty once they turn 30. \n\nBarbie takes the piss out of patriarchal values and toxic masculinity in the most delightful way possible. Women are walking out of the theater feeling seen in a way they have never experienced. \n\nI've also heard the take on how monumental it is for a Barbie to own her own house and her own car back in the 60s when women couldn't even have their own bank account until 1974! But her house and car are pink, they are clearly hers. She probably bought them with the money she made from her bajillion careers. \n\nWonder Woman ran so that Barbie could float. Ladies, this is what progress looks like. It looks like a pissed off Ben Shapiro. It looks like women feeling seen and empowered. It looks like girls dressed in pink complementing each other. \n\nAfter RBG's death, after Roe v Wade was overturned... this is the most hopeful I've felt in a long time.\n\nThank you, Greta Gerwig.\n\nEdited for grammar",
    "title": "The Barbie movie is a feminist milestone in cinematic history (no spoilers)",
    "subreddit": "Feminism",
    "timestamp": 1690407516,
    "score": 816,
    "keyword": "white director"
  },
  {
    "text": "Teen girls ‘engulfed’ in violence and trauma, CDC finds There was/has been an increase in domestic violence in general during the COVID pandemic. That fact is somewhat widely known. According to this Washington Post article, there has also been an increase is rape against teen girls and increased depression among teen girls.\n\n\"... Almost  15 percent of teen girls said they were forced to have sex, an increase  of 27 percent over two years and the first increase since the CDC began  tracking it.\n\n'If  you think about every 10 teen girls that you know, at least one and  possibly more has been raped, and that is the highest level we’ve ever seen,' said Kathleen Ethier, director of the CDC’s Division of  Adolescent and School Health, who said the rise of sexual violence  almost certainly contributed to the glaring spike of depressive  symptoms...\n\n... Ethier said it’s important to determine who is perpetrating the  violence, which the survey did not address, and how it can be stopped.\n\n... Lesbian, gay, bisexual and questioning students were significantly more  likely to experience violence than their heterosexual peers. They were  also more likely to be electronically bullied and to report persistent  sadness or hopelessness. \n\n... Black and Hispanic students were more likely than White and Asian students to avoid school because of safety concerns...\"\n\n[https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl\\_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp\\_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87](https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87)",
    "title": "Teen girls ‘engulfed’ in violence and trauma, CDC finds",
    "subreddit": "Feminism",
    "timestamp": 1676335624,
    "score": 634,
    "keyword": "white director"
  }
]