[
  {
    "text": "Miserable at somewhat new job (The 50% raise not worth it) Hello all:\n\nAmerican here.  28y/o, Engineering manager for a pharmaceutical company.  Live in the middle of nowhere for work.  For clarity, it's the sort of town where every adult in town works at the same place.  Racism in the area and towns nearby is the most extreme I've ever seen in my life in the US (I've literally seen non-whites coworkers have people walk up to them at the gas station filling up their gas and scream racial profanities in their face).  \n\n&#x200B;\n\nWork/life balance is close to null because of the lack of things to do where I live. Good pay, decent insurance, vacation time is lacking (only 10 days, which accrue over the course of the year).   Mornings start at 3:45 in the morning and I'm lucky if I'm home by 8pm.\n\n&#x200B;\n\nTook this job last December for a 50% raise in pay after leaving a business where the CEO was openly committing fraud and I was retaliated against for speaking up against him.  The wife and I agreed we could use the money.  It has NOT been worth it.  I seriously considered handing in my 2 weeks today and moving the F out of here.\n\n&#x200B;\n\nPS: The wife equally hates this place too; mainly because as a Latina who happens to have dark skin, and due to the racism here, she does not feel safe living here.  We drive 4 hours every weekend to visit my parents in order to get away from here.  \n\n&#x200B;\n\nWife is INSISTENT that we move to her home country, Colombia, as every job I've managed to land after college have been typically in places where she has been miserable living due to lack of diversity, things to do, and unwelcoming people, amongst other things. I.E., it's been nearly impossible landing jobs in the bigger cities.  However, I'd have to give up a near 6 figure salary for the equivalent of $20,000 to $30,000 a year, and we still have 22k in student loan debt to finish paying off.\n\n&#x200B;\n\nReddit: any advice?",
    "title": "Miserable at somewhat new job (The 50% raise not worth it)",
    "subreddit": "jobs",
    "timestamp": 1563413583,
    "score": 3,
    "keyword": "white ceo"
  },
  {
    "text": "Torn between jobs - help So I recently started a new, full time position with a company. I feel I was deceived during the interview process. I interviewed in a totally different area and floor from where I'd actually be working. The floor I interviewed on had a 'normal' office environment with appropriate lighting and aesthetics. \n\nWhen I came day 1, and was walked to my seat, I was very disappointed. The place is horribly lit. The place where my team sits is dark, shadowy, with only a fluorescent overhead light to light the space. The ceiling isn't even painted white or pushed down to reflect light. For whatever reason, my body and brain isn't doing well with this. I have headaches and have been depressed ever since starting this job. It's tough because I really like the people here, and has a nice family feel, but the spot where I sit/my team sits is really having physiological effects on me. \n\nI started looking for a back up week 1, and found it, but it's a 6 month contract job. The responsibilities are the same. I've seen the office and it's beautiful; I could definitely work there. I'm now in a dilemma. \n\n**Do I ask for some concessions at my current employer, like sitting away from the team, or take the contract job and hope it turns into something / keep looking for a better fit?** \n\n**Full time role**\n\n90K salary\n\nDecent but not great benefits\n\nStruggling company, $14 share price. New CEO who might even close the office within a year. \n\n**Contract role**\n\n$55/hr\n\nNo benefits\n\nExcellent company, $142 share price\n\nPotential to convert into full time, could also network around to different departments.\n\n6 months, flexibility to WFH",
    "title": "Torn between jobs - help",
    "subreddit": "jobs",
    "timestamp": 1572362658,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "What is the circumstance of the commerical for the wet dog food, with the little white dog and the man with glasses and the shirt with the weird epaulets? Like is he a pilot on break with his dog? Is he a eccentric CEO?",
    "title": "What is the circumstance of the commerical for the wet dog food, with the little white dog and the man with glasses and the shirt with the weird epaulets? Like is he a pilot on break with his dog? Is he a eccentric CEO?",
    "subreddit": "AskReddit",
    "timestamp": 1572966353,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "I work at a start up entirely run/owned by women And let me tell you, it’s a special experience. \nA bit of background on me. I have been in product development/marketing for over 15 years. I have a few patents, I have many products that are probably in your homes. But, until 2018, I was the only woman in the room, working to make white men richer and richer. \nFast forward years and I end up where I am now, as COO of a company made for and run by women. I want to try to describe what is so special and amazing about my day to day.\n1. We wear whatever. Literally whatever. No one cares. Bra straps out? Yoga pants? Bah! But when you look cute? YOU KNOW. The minute you walk in the door you are greeted with ‘oooh gurrrlll’ and it’s fucking amazing.\n2. No second guessing. No having to reiterate thoughts and plans and couch them so a male speaks it into existence. NOW. I am not saying it’s perfect. I still have to make my female CEO think that my idea is hers before she enacts it. That doesn’t change. But at least I don’t have to be a male to say it.\n3. Understanding. Sick kid? Parent? Bleeding out? Whatever, go. It’s literally (yeah I said it) fine. We all know. As long as you do your work, fucking fine. \n4. Multitasking. My god. The amount of work I have a small team of women doing is staggering. Not ONE says ‘not my job’. They all just do it regardless of title. Today I was in the warehouse tearing down racks, sweating to death. Fine. We all have to pitch in, regardless of title. \n\nThere’s so much more that I am forgetting. But I did just want to give a shout out to broads 😊",
    "title": "I work at a start up entirely run/owned by women",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1569029810,
    "score": 5,
    "keyword": "white ceo"
  },
  {
    "text": "You're using 'Patriarchy' wrong **TL:DR at the bottom**\n\n&#x200B;\n\nWhat is a hierarchy?\n\nEssentially, it’s just another way of saying prioritization. So if two people go into a debate, one to assert that men are marginalized, one to assert that women are marginalized, it’s a debate on prioritization. Which sex does our system favor unfairly? The mainstream sentiment is that the plight of women is way direr than is the plight of men (both historically and currently), and men’s advocates are coming out of the woodwork in response saying, “hang on, that’s not how this looks on the ground.”\n\nIf our society is hierarchical, which it undoubtedly is, then there is a prioritization of certain groups and individuals over others in specific ways. But I think this is an emergent feature (not a flaw) of our society. The fact that a hierarchy emerged over time is essential to how we progressed to this point. This is not to say that it will automatically get us to a better place in the future, but we should acknowledge that there were factors we as a species were dealing with across existence that necessitated a hierarchical setup, which emerged as:\n\n1. as groups, adult women and youth take higher priority over adult men\n2. at the top, our most valuable men take higher priority over our most valuable women.\n\nThis is what male advocacy and female advocacy have trouble reconciling. Feminist critique will focus on point 2 as evidence of patriarchal tyranny (why are most CEOs male?). Rebukes of that critique will focus on point 1 as evidence against, or even as evidence of unfair prioritization of females (why only men drafted for war?).\n\nWe can accept Point 1 easily because it relies more on biology and statistics than our perceptions. If humans dwindled to near extinction, we have a better chance at surviving in populations with more women than men. Men, as a group, are much more expendable because of the mechanics of how we procreate.\n\nPoint 2 can be demonstrated via thought experiment. Let’s call it the Black Box Test.\n\nSay an alien came down to earth with a small black box. The alien explains telepathically to all humanity that in one year it will allow 50 humans of uniform sex to board its ship and attempt to solve the contents of the black box. If they do not do so within an indeterminate time (no idea when/if the task ends), the alien will kill all conscious life on Earth. So highest stakes imaginable with very little info to work with. The selection of candidates is overseen by the alien (for fidelity) and has two parts.\n\nFirst, a selection of 50 representatives for each sex (male, female, and intersex) are chosen via democratic vote. Then, a second vote is cast for which of the 3 groups is selected to tackle the black box. Everyone votes in both rounds.\n\nBased on an honest appraisal of humanity’s collective psyche, it would be foolish to presume that the group chosen will not be comprised of men. I don’t care who you are or what you believe is rightful and fair, it is bad logic to think that most of humanity would vote otherwise, given those circumstances. The result is self-evident.\n\n**This is not to say that the 50 men chosen were the objectively** ***better*** **choice for the task**, but it illustrates an objectively real phenomenon in how we think. When the stakes are high, more men will be elevated to the task of *doing*. More women will be elevated to the task of *being*. It’s a trade-off pattern that’s been at work since our species’ infancy. My ultimate challenge to men’s and women’s advocates is that if one imagines a society where either sex is elevated to the task of both, *then and only then* is that society tyrannical (and, therefore, bound for cataclysm).\n\nSo is the USA one of those societies? Are we tyrannically in favor of men? How do we reconcile perhaps the most black-and-white example of patriarchal dominance – the gender pay gap?\n\nIf we scale down this thought experiment from the preservation of our species to the preservation of businesses, we will see the same trend of male elevation almost universally. Men will be elevated to decision-making roles at the behest of the whole group (all sexes) more often than women. Decision-makers are the ones making more money, hence a disproportionate pay grade. It may not be the cause of *all* the pay gap, but it demonstrates how one arises not because of tyranny, but because of this hierarchical decision pattern playing out repeatedly.\n\nAgain, this is not to say that elevating men is the objective right choice for any given business or pursuit. I'm highlighting this to remove the animosity and resentment from how we reconcile an apparently unbalanced system. I don’t think a patriarchal hierarchy developed because of the criminally dominating nature of men, but because *some* kind of arbitrary hierarchy of roles had to emerge for our species to thrive.\n\nMen’s advocates need to accept that we’ve written all the history books not because of an innate superiority, but because of an arbitrary (but beneficial) arrangement with our mates. And we must also accept that the bedrock of that arrangement means most of us are utterly inconsequential when considering our species’ advancement.\n\nTo women’s advocates, I pose that the plight of the average female (in America at least) is not as obvious as is commonly accepted. Yes, we do live in a patriarchy, but using that term as shorthand for male tyranny or domination is frankly bogus. Revealing true injustices in our patriarchal system requires that we demonstrate where men are being elevated to **be** and **do**. You need both for it to be truly unfair. I think examples of this can be found and should be swiftly dealt with (looking at you, organized religion), but actually finding those examples will almost always require more than a casual glance – or tweet, post, etc.\n\nPersonally, I’d like to see the patriarchy reformed into something else, but that will take a sort of gradual renegotiation of roles – a conversation that will last decades or longer. I’d prefer that happen sooner than later, but it’s going to be real slow process if men and women keep posturing against each other. The patriarchy has done its part to hurt *and* help throughout human history. We’re not obligated to keep it intact, but rejecting it outright and calling it 'tyranny' is not the same as reforming it.\n\n&#x200B;\n\n**TL;DR – A patriarchy exists in the US (and elsewhere, generally) but is not tyrannically in favor of men except for specific instances where men are being elevated to do** ***and*** **be. These instances are much rarer than is generally accepted, and we’re all worse off until that perception has changed.**",
    "title": "You're using 'Patriarchy' wrong",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548284399,
    "score": 0,
    "keyword": "white ceo"
  },
  {
    "text": "What would be the middle-ground works in between politics/power (lawyer, politicians, CEO) and art (artist, philosopher, nurse)? \nHi,\n\nMy family background is quite extreme, it seems my dad is narcissistic and my mom is codependent. He is a CEO, my mom was a nurse. Now she is a housewife and it is apparent how their relationship is functioning and I do not like it at all. I don’t want ‘black or white’. It took me long time to get over this and finally set my boundaries and work on myself. \n\nI want to set a goal at this point to motivate myself, but I don’t want to be too extreme.\n\nI hold a BA degree from Fine art, before that, I used to be a class leader often in my middle/high schools. \n\nI do want to find a middle ground, something not too political neither so vulnerable.\n\nWould science be helpful? \nWhat I’ve considered are- design, sports science, teacher, professor. \n\nThanks!",
    "title": "What would be the middle-ground works in between politics/power (lawyer, politicians, CEO) and art (artist, philosopher, nurse)?",
    "subreddit": "careerguidance",
    "timestamp": 1572811115,
    "score": 1,
    "keyword": "white ceo"
  },
  {
    "text": "How do you feel about working for a giant \"evil\" tech company? Hey guys,\n\nJust wanted to pose a question to people who may have thought about this before or, like me, am currently thinking about. For context, I've been in the job search for a bit, and now have 2 offers to consider. One is at a small company with a great work culture while the other is a fairly big tech company, with a more \"intense\" work culture. By intense, I mean they are known for longer hours, but with higher pay and very unique experiences (think like special gov contracts). At both companies, I know I can grow a lot in many different ways and regardless of how I grow, they all align with my personal career goals.  \n\n\nThe question I'd like to present today is how much weight would you personally put when considering to work for a company that has a controversial history. For instance, Facebook or Amazon would be great examples because both have unfavorable CEOs and have issues with data privacy or unfair workplace conditions. But... at the same time, I know my friends working at these companies or people I will be working with obviously don't agree with the CEO/board's opinions and decisions.  \n\n\nOn one hand, yes, by working for this company, you are indirectly supporting these malpractices because you are helping the company grow and succeed, and thus continuing their bad behavior... but is it really so black & white? Should we really disregard opportunities that would be great for our careers but kind of morally questionable? Is it hypocritical to say you don't support a company's practices but still get that juicy paycheck?",
    "title": "How do you feel about working for a giant \"evil\" tech company?",
    "subreddit": "cscareerquestions",
    "timestamp": 1574212448,
    "score": 4,
    "keyword": "white ceo"
  },
  {
    "text": "Do you think minorities are well represented in this industry?  This is probably a more US-centric question, but I guess could apply to the rest of the West.\n\nI don't see many latino/as and black people in software development except for maybe one per medium sized company or one out of a 100. They seem to be more represented in hardware IT.\n\nAmong minorities, I definitely see many Indians and Chinese men on the software side and many of them have gained the highest positions in companies (Microsoft CEO, Alphabet CEO, Nvidia CEO, etc.). Off the top of my head, I can't even think of a black or hispanic CEO in tech or among tech VCs.\n\nAmong white women, the representation is growing, but not necessarily in dev. It's usually positions like PM, UX or maybe front-end dev. Chinese and Indian women are more represented on the software side, though I've seen it more in quality than development. As for black and latina women, I've only seen representation in the Bay Area and even then, that's next to nothing.\n\nI know there are hiring biases and other factors that get in the way such as CTCI tests, salaries, perceptions, lack of interest among the groups, social climate and so on.\n\nDoes anyone here think it's a problem that can ever be fixed? Doesn't think it's a problem at all? I'm trying to get perspectives for career reasons.",
    "title": "Do you think minorities are well represented in this industry?",
    "subreddit": "cscareerquestions",
    "timestamp": 1546286980,
    "score": 3,
    "keyword": "white ceo"
  },
  {
    "text": "8 months ago, I accepted a full-time role with a lower-end salary. One of my old contract-work companies offered me a full time role now with a higher salary. My current job came back with a crazy good offer, am I making mistake? Hi all. I'm using a throwaway because I have a lot of personal stuff on my regular account, but I would really value input from anyone who has been in this position or can give me insight.\n\n&#x200B;\n\n&#x200B;\n\n**TLDR:** Current company paid me $60k. After 8 months working there, a company I did freelance/contract work for offered me a full time job at $70,000 with better benefits and work-life balance. I turned in my two weeks on Friday, and yesterday my current company offered me $85,000 and a lead/manager/supervisory position to stay. I still want the new job / lower pay and I don't know if that's a mistake or not.\n\n&#x200B;\n\n**Some background:**\n\nI'm 23, I graduated college two years ago with an unrelated degree. I've been working in webdev for several years as freelance/contract, though, and throughout college took gigs to pay my way through college as much as I could. Long story short, 8  months ago I was tired of working contracts/freelance and wanted a full time role.\n\nI did great in the interview, white boarding, etc. and was given a full time job offer at a corporation with an IT department that offers websites to their clients; I work alongside 2 other web developers who have been here for 3 years, 1 backend / database developer, and then I have a manager and a department head. This is kind of important later.\n\nThey offered me 55,000 starting out for salary, and I was able to get them up to 60,000 because I had two other offers for 60 and 65. Which where I live, is a starting salary for a junior developer. Even though I had done freelance/contract work in the past, so I had about 4 years experience - the portfolio and references to support it - this current job made me feel like they were taking a 'risk' in hiring me since I didn't have a 'conventional CS background' and agreed after 1 year with good performance, they'd bump me to 65,000.\n\nI have about 70k in student loans, which is also kind of important, but with my current salary I'm able to make my payments just fine.\n\nMy current job is very 'corporate', which is fine. However it can be a bit exhausting and redundant. We've had two slow periods now where I have had maybe 3-4 sites in a 3 month period. I also learned from my manager and two of the other web developers that a few years ago, everyone took a dip in their salary in order to keep the company afloat and prevent any layoffs. No one has gotten a raise since then, including the web developers who have been there 3-4 years.\n\n&#x200B;\n\n**Currently**\n\nOne of my old companies I did contract work for contacted me. Their lead front end developer is starting a family and will be leaving her role in 3 months. They want someone to come in under her, learn what she knows and what she's got going on, and then take over that lead role once she leaves. They contacted me first before posting the job, because they have worked with me in the past and know that I know the stack and liked my work.\n\nThis company is a digital marketing agency, very 'modern', offers a lot of great things - like fully remote work after a period of time, tuition reimbursement, a new laptop, etc. that I don't get with my current job. They offered me $70,000 and after I take over the lead developer's position, we will sit down and re-discuss the salary. This is all in writing, in the contract/offer letter they sent me, among all the other great things they promised.\n\nThe company is stable, has been around for 15 years, the people are hilarious and great, the environment is very 'relaxed' (compared to where I am now) and all the employees who are there end up staying for a long time, which is why they couldn't offer me a full time role 8 months ago when I began looking for a full time position (I had spoken to them about this before job searching, because I love the company and the people there).\n\nSounds perfect, right? Clients and work I'm excited about, aptitude for growth, and a relaxed policy that gives me a lot of autonomy.  The benefits are also much better and they are just overall a great company and people with really exciting projects and clients.\n\n&#x200B;\n\n*WELL.*\n\n&#x200B;\n\nI turned in my resignation on Friday after happily accepting the offer at the new company. Yesterday, I had a meeting with my company's CEO and department head and they were not excited about me leaving, and were almost in panic mode.\n\nThey counter-offered me with a lead/supervisor position, with $85,000 salary, and in 6 months a meeting to discuss further increases in salary.  I did not tell them the salary I was offered or the company I was going to (I just simply said I was given a competitive offer and I think it better propels me in my personal and professional goals), and that's what they came back with. I'd be over-seeing the other developers, who have been there for several years, which ... I'm not sure how I feel about.\n\nIn addition to THIS, the manager (not supervisor) told EVERYONE at the company the day I turned in my resignation, saying I got a really good offer somewhere else so I'm leaving. So now, the other developers who have been there for years without raises will know I was given a raise that's pretty good, enough to keep me to stay. This makes me feel... well, uncomfortable I guess. I feel like there is going to be some toxicity because I know they haven't gotten raises in years, and I was just offered a 25k raise after being there 8 months.\n\nIt all just sounds 'too good to be true' and extremely strange to me. They gave me the whole rundown about how valuable I am, how I've proven through my work I know what I'm doing, how I've helped them with huge clients and retaining $500k-$750k clients with their business, etc. and they can't afford to lose me.\n\nWhen I mentioned that I was wary about the raises being far and few between (prior to them making this offer in the interview) they said something to the effect of, 'those developers do the bare minimum and we honestly see you as a lead developer already, which is why we give our big clients to you. You go above and beyond what we expected... etc etc etc.\"\n\n&#x200B;\n\nThey gave me until today to make a decision, and I still feel like I want to take the new job / lower paying job. Like I said, I have student loans, so the extra money is super helpful, however I feel like the opportunity for growth at the new company is there enough so that I'll make that money within a year and a half, if not sooner when I finish training for the lead role they want me to take over.\n\n&#x200B;\n\nSo am I being paranoid, or is that whole counter-offer kind of... strange? I've never head of anything like it, and I appreciate that they even made a counter, but holy shit - that's a huge jump. I feel in my gut I would be much happier at the new job, I would be able to grow, and I would be passionate about my work. But am I stupid for doing this, considering how much money my current job offered?\n\n&#x200B;\n\nI guess I just want to hear what peoples thoughts are, what they think about the situation, or if anyone has been in a similar position. At the end of the day, it isn't alllll about money, and the new company offers me intangible things that are beyond a salary amount. But considering my student loans, I feel kind of  weird about taking less money. I don't know. I feel scrambled.\n\n&#x200B;\n\nIf you read this all thank you lol",
    "title": "8 months ago, I accepted a full-time role with a lower-end salary. One of my old contract-work companies offered me a full time role now with a higher salary. My current job came back with a crazy good offer, am I making mistake?",
    "subreddit": "cscareerquestions",
    "timestamp": 1556715403,
    "score": 2,
    "keyword": "white ceo"
  },
  {
    "text": "Should I aggressively push for the promotion or let it slide? Hello everyone, first post here.  \nHoping to be in the right place.  \n  \nI work as one of the two IT people in the Company, it's a small-medium business with ~200 employees; blue collars and white collars. It's owned by a very big Holding.  \n  \nOn February of this year my Boss (CFO) asked me to help him interview new hires (very new thing for me) for a position in Finance, my role was to understand theirs skills levels in regards to \"PC\" (basically about Excel and programming).  \n  \nDuring those interview I discovered that a new hire get payed nearly exactly what I make.  \nQuite surprised I had a chat about it with my boss and he agreed something wasn't right (?!).  \n  \nFast forward to March I talked again with my Boss and the CEO, both agreeing about a deserved raise. They have to talk to the higher-ups and involve the HR.  \nCEO literally said \"It could happen in June but surely before end of year\".  \n  \nNow, nothing happened; HR, at the end of June, came to have a talk with me to \"know each other\"; at the end of the meeting I raised my concerns about my pay but eventually nothing happened.  \n  \nI'm quite frustrated by this situation. I'd like to talk about it with CEO, but I'm not sure if I've to be pushy or brush it off.  \n  \nThank you for your help :)",
    "title": "Should I aggressively push for the promotion or let it slide?",
    "subreddit": "cscareerquestions",
    "timestamp": 1574535766,
    "score": 2,
    "keyword": "white ceo"
  },
  {
    "text": "this sub sucks... This is the first time I have taken the time to look at this and legitimately create a post in disgust. This sub is almost all shit posting. I'll sort the posters I have read into a few simple categories. Those who have no experience, no idea how the industry works, and are desperate for advice or to gloat how many algorithms and internships they have. Those with a little bit of experience who feel their 130k salary is below market average despite having no leadership experience and freeze and mumble every time their manager has them speak up. Those with \"lots of experience\" who actually know next to nothing and might have spent a few years programming, watched a bunch of recent YT videos on CS and taken a few recent community college classes. And then the select few rarities who are normal and honest...\n\n&#x200B;\n\nI'm 35. I've generated 4 startups, served as everything from an entry level engineer to a CTO/CEO. Spent time at many of the major companies I see people gloat about on this sub. Irrelevant. There are two commas on my tax returns each year.  Hopefully three in another year or two. If you are young, get off this sub and focus on becoming a more ambitious and driven engineer. Have some drive, something it's all for. Work hard, and build the most important element, soft skills. So many keyboard warriors on this site if I had you sit down at the table with a VC you'd shit yourself and scurry up your own ass. If you are older and honest, you'll understand my point. A liar, you'll pass a dislike and spew some bullshit.\n\n&#x200B;\n\nThese recommendations to have kids spend hours and hours, weeks and weeks, sometimes more, on sites like leetcode trying to master useless algorithms... Come on now. There are jobs that pay just as well that don't require you do all that. Enjoy your youth. I never white-boarded an algorithm and nobody I have ever hired ever has either. I know who gets shit done. And it isn't the guy sitting at home 6 nights a week practicing deleting from a binary search tree. It's the guy who grinds his hours out during the week, hits a bar with me and a big client on a Friday night and closes a deal on the software they themselves are developing... All of you are valueless without this...\n\n&#x200B;\n\nI'm tired of this being the community attached to this industry. It needs to go away. It is trash and a pollution and a reason for me to not hire you. Get off reddit and start making the best of what you are passionate about. Because it isn't this shit posting forum you read everyday.",
    "title": "this sub sucks...",
    "subreddit": "cscareerquestions",
    "timestamp": 1568091888,
    "score": 0,
    "keyword": "white ceo"
  },
  {
    "text": "Afraid that my little sister is forgetting who she is. What should I do?? My mother worked her ass off to send us to independent schools because the public (and Catholic) schools in our neighborhood were shitty.  We started in independent school when I was 12 and she was 8. The school did have way better teachers and resources.  It was also predominantly rich white kids. And I mean crazy rich, like the sons and daughters of CEO's of companies.   Meanwhile we were there on almost full scholarships. \n\nI'm now 19 s a sophomore in college and she is 15, a sophomore in high school. Like I said, most of the kids at the school were rich and white and I was not, so there were a lot of times where I didn't feel like I fit in socially.  I never tried to fit in because I could see that they were certain things that I just was not.  That's a big part of why I chose to go to an hbcu for college. I was so tired of that.  \n\nMy sister, on the other hand...I know it was different for her because she was younger when we started.  So for her she's been in independent school for most of her life.  She's always tried so hard to fit in even though my parents and I try to explain to her that we're NOT fuckin rich and will not be like the white families because we don't come from a long line of generational  wealth like they do.\n\nRight now I'm home for Thanksgiving and my sisters behavior is getting worse. It's almost like she's a different person. She's been acting so shallow. She's doing obnoxious stupid shit for attention just like the white girls at my high school did. And obviously she talks the same way they do. I know she's a really smart girl. She does better than I did in school. She has always been a straight a student.  Recently her grades are starting to dip.  My mom had called me last month telling me she has an F in math. Normally my Dad would be the one to discipline her but my parents just got a divorce this summer.  He's not our biological father so he's not required to see us. \n\nI wish I could be here to be supportive while she goes through highschool, but I go to school in another state. I know hs was miserable for me, and she won't talk about how she feels about our parents divorce but I know she was really close to our Dad.\n\n I don't know what to do but I feel like if I don't do something I'm going to lose my sister. She's going to turn into one of these black girls that doesn't know they're black.  \n\nAlso she doesn't want to hear anything about going to an hbcu. She wants to go to school either in our home state or in Cali, and neither of those states has an hbcu. \n\nPlease, if anyone has been through this with a relative of their own, I'd really appreciate any and all advice.  As her sister what should I do??\n\nEdit: also idk if it really matters but I thought I'd add. My mom put her in this Saturday program up in Harlem that is supposed to teach the youth about black history and black artists (it's in the Schomburg center if anyone here is from NYC). So she does have some black friends but clearly not enough to make a big difference",
    "title": "Afraid that my little sister is forgetting who she is. What should I do??",
    "subreddit": "blackladies",
    "timestamp": 1574842264,
    "score": 12,
    "keyword": "white ceo"
  },
  {
    "text": "Leaning In with Alex P. Keaton - Born with serious CEO aspirations, Nicole Cyrus found her role model in a white kid from an ’80s sitcom.",
    "title": "Leaning In with Alex P. Keaton - Born with serious CEO aspirations, Nicole Cyrus found her role model in a white kid from an ’80s sitcom.",
    "subreddit": "blackladies",
    "timestamp": 1575811542,
    "score": 4,
    "keyword": "white ceo"
  },
  {
    "text": "Low pay gender discrimination in Australia If you live in Australia - and this applies generally in Western countries - you will hear the moaning and complaining about women having a pay gap with men. Women have all the bad jobs, men are arseholes who murder their wives, and we need to rape the reputation of men as a group and provide the good jobs to women not men on the basis of gender to make all this iniquity right.\n\n&#x200B;\n\nYou've heard the spiel, right.\n\n&#x200B;\n\nTo this I have two words of response: Taxi. Driver. \n\n&#x200B;\n\nOf course women usually primarily care for young children, and schools during the day primarily care for older children. Sure there are exceptions, higher earning mum goes out to work, dad stays home and enjoys himself with baby - good on them. Not many women want that, they want to mother the babies and they want hubby to earn well to make it easy. \n\n&#x200B;\n\nGiven this, and how competitive it is to reach senior positions in competitive workplaces (ie. all workplaces), I find it not surprising that there are so few married women with children in the highest levels of management, eg. board level or senior exec. I find it extraordinary and manipulated - although given the endless rounds of women promotion (literally, like into the juicy senior job everyone wants) and male reputation tarnishing I'm not surprised - that THAT THERE ARE SO MANY WOMEN IN VERY SENIOR POSITIONS. Sometimes you get a talented go-getter who gives up everything including family for career - Julie Bishop, the former foreign minister of Australia, is a good example of this. She earned it. However, given the time out for family commitments, it boggles my mind that married women with multiple children would make it to the top without being given the job based on their possession of a vagina. In other words, you need manipulation in the extreme in favour of female applicants and against male ones to get the numbers of senior women in the workplace we have now, let alone this being an example of discrimination AGAINST women.\n\n&#x200B;\n\nLet's get back to taxi drivers. In Australia being a taxi driver has been one of the lowest status jobs out there. They work insane hours to support families and typically earn somewhere around $8 an hour, in a socialist country like Australia where minimum wage is set at around the low $20s per hour. They have to sit all day long, which is awful for health and posture, they're exposed to the sun, they have to deal with sometimes drunk and abusive customers and not uncommonly physical assaults. Surely if we want to help low income earners, taxi drivers would be the perfect place to start. Surely a few rallies to parliament house, some politicians speaking out for them, the charities and social services organisations prioritizing taxi drivers income. Well....not exactly.\n\n&#x200B;\n\nAny guess why not? It wouldn't be anything to do with the fact that something like 98% of taxi drivers are men, would it? In Australia, Indian immigrant men, by the way.\n\n&#x200B;\n\nLook, if like me you have a dick, and one or two testicles swinging on either side of it, you're not going to get any airtime. You're the aresehole, remember? So that taxi driver who earns $8 an hour is the arsehole, oppressing that focused white or Asian early 40s women who gets promoted to chair of the board and earns a few million yearly. But he's got a dick, so we already know he's bad, so why am I even writing this?\n\n&#x200B;\n\nMen I have no idea what to do in a society that hates my gender so much. I mean for us as a group, on an individual personal level there's usually plenty we can do. The way I see it, things went so nuts so quickly all I can see is at least making men INTERNALLY aware of how the system is stacked against them. I share many others' skepticism of any positive change to men's conditions through the political process, or even a willingness to block their further erosion through more and more man-hatred expressed through law and social beliefs. The only thing I believe I can do beyond the personal level is to at least make as many men as possible aware of the how under siege we, as a gender, have become.\n\n&#x200B;\n\nGood luck to all, but most particularly to Indian male taxi drivers, and least particularly to wealthy early 40s CEOs of large companies who got there mainly because they had a vagina.",
    "title": "Low pay gender discrimination in Australia",
    "subreddit": "MensRights",
    "timestamp": 1550710749,
    "score": 17,
    "keyword": "white ceo"
  }
]