[
  {
    "text": "Advice on salary Negotiation with an Indian Director I received an offer for around $54,000 for a procurement position with pretty good benefits (great medical) in SOCal. The director is from India with a couple years in the US and I am white. I feel he is trying to lowball me on a job offer.\n\nHowever, I have great experience with procurement and purchasing in a different field. The director has said he will have to train me on the new terminology so he would not pay me the $66,000 i asked for. \n\nThe interesting part is he was animated/rude about the negotiating process and that I was being sort of a pain for asking more. I am familiar with the software and processes his company uses so I feel the training I need is not a huge factor. The comparisons on salary sites for the industry/size of the company suggest I am well within the salary ranges.\n\nIs this a cultural thing should I push again for the $66,000? I had an Indian friend say they will haggle me down on salary pretty hard.",
    "title": "Advice on salary Negotiation with an Indian Director",
    "subreddit": "jobs",
    "timestamp": 1486452048,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Looking for advice on what to wear to an interview at a private liberal arts college I'm interviewing at a very exclusive private liberal art college in the midwest next week. The position is Assistant Director of Development and Alumni Relations Communications. I'd be writing content (among other duties) for the development and alumni relations office.\nI'm looking for advice on what to wear. \nAt the moment I've got nice suit gray pants, black flats, and a navy blue shell blouse. \nDo I need to buy a gray suit jacket? or will a black or white cardigan sweater work?\nI'm getting my nails polished--which color should I pick?\nAny other tips?\n\nEDIT: Thank you so much everyone for your help. I sincerely appreciate it.",
    "title": "Looking for advice on what to wear to an interview at a private liberal arts college",
    "subreddit": "jobs",
    "timestamp": 1499122060,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Fellow Redditors, were any of you fired from a job faster than White House Communications Director, Anthony \"Mooch\" Scaramucci, and if so, why?",
    "title": "Fellow Redditors, were any of you fired from a job faster than White House Communications Director, Anthony \"Mooch\" Scaramucci, and if so, why?",
    "subreddit": "AskReddit",
    "timestamp": 1501599909,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear. Hi everyone. I don't really have anyone to bare my heart to right now. I want to send this out to the universe and see what comes back. I would love to hear your perspectives.. whatever corner of the world you're in.. whatever life path you've walked. I really appreciate all your voices and Reddit so so much. I'll try to keep it condensed and simple. \n\nI dated a narcissist for eight months. He was incredibly cruel and selfish but hooked me with rare very special moments of revealing a deeply hurt.. damaged.. wholesome.. helplessly pure childlike heart. He would verbally and emotionally abuse me but sometimes with time, he would realize how hurtful or selfish his actions were. With sincere tears in his eyes he would apologize and express that he's learning and wants to change.. express that his cruel actions and words are purely from ignorance because even his own mother never showed him any love, open-heartedness, gentleness, morals. \n\nIt doesn't come as a surprise.. he experienced a horribly abusive heartbreaking childhood. He used that excuse almost always. And being an empath.. my heart opened and poured for him, I wanted to love him more. Help him see all women aren't money hungry and out to lie and cheat. Show him it's okay to open and be vulnerable. My upbringing wasn't perfect either. I honestly felt we were both \"breaking\" our cycles of hurt from the abuse and neglect our parents created. (My family was very poor growing up and my father abandoned my mother, sister and I when I was 12.) He always said such amazing things about growing old together.. building character through experience.. being there for eachother.. building a life and family together that's strong and confident (him) but sensitive giving and loving (me). He would say I am the best person he's ever met with character he values most above anything. That I have changed his life forever in all aspects of his life.. work. And I was learning a lot about patience, understanding, and forgiveness. No relationship is flawless and flatlined. I appreciate and value rolling with the punches of life. Struggle is what makes you grow.. its what broadens and builds your mind and heart, I love that. And I love the idea of a life partner who is down to walk the sometimes mountainous path of life with you. I appreciate open-mindedness and the will to adapt. Effort is so beautiful. Anyway.. I honestly believed we could awaken together.. Live more and more with awareness.. and mindfulness.. and learn together. But I was wrong. He would do things like tell me his ex was exceptionally beautiful.. she was a professional model.. but I'm pretty. His other ex is very smart. But I'm definitely not smart. I'm talented and creative. But not smart because my brain is not wired to be a coder or engineer. This is one of the most painful parts. I stayed with a man who fought me and defended himself for the right to call me stupid.. many times. He would tell me my problems are trivial.. that he doesn't care about my pleasure.. several times he would fuck me and just roll over. I would silently cry in the dark and masturbate next to him as he snored. We fought so many times about our sex life. It was always selfish and only about him. There were times I would be very ill or very drunk and he would just go ahead and fuck me.. even when I'm barely conscious. I would just lie there in the fetal position. He said that was one of the great things about me.. \"I never left him wanting.\" He was so proud that he's slept with 120 women. He told me I was the first one he gave eye contact with when having sex. And he said he typically didn't kiss the girls he'd sleep with. That I have no idea how much he's changed. I brought this up so many times.. that I want to make love.. sex should be us sharing how we feel physically.. it's about both of us..and he just didn't care. He would say sometimes sex is just carnal and sometimes he needs to be a man and take it. It's just about him. I never once orgasmed in the 8 months we dated. He never tried. It was always for him. He went down on me maybe 3 times in 8 months. He blamed it on me. He said some women aren't confident or comfortable orgasming in front of people. He would say some girls orgasmed as soon as he put his dick in them. Typing this out I know it sounds fucking heartbreaking and pathetic. I know. If I heard all this from my sister or if my future daughter were telling me all this... I would be utterly mortified and devastated for them. Sometimes it's very hard to see unobstructed reality when you're struggling in the middle of everything. He would fall asleep after I drove 22 miles to talk about how he's hurt me as I am crying next to him in his bed. He once dropped me on the side of the road with all my luggage to take an uber home after a road trip when I said I wanted to go back to my apartment, not his. \n\nHe has a very unhealthy relationship with sex. He was once over 500 pounds but with sheer will.. starving and lifting he lost 230lbs. From age 30 to 35 he overcompensated by \"fucking and conquering as many women as possible doing whatever it takes to make them comfortable\" His greatest fantasy is rape. He would often tell me his greatest \"id\" fantasy is to kick down a door like a Viking and violently rape a wife as his defenseless smaller frightened husband is forced to watch in horror. (My ex is 6'5) He used to \"jokingly\" say rape victims often orgasm because in a subconscious level they loved it. He would joke and say 50 shades of grey is about him.. and there's a reason why that franchise is insanely popular. Women love and want to be raped on a cave man level. He absolutely lovess the new Westworld for how brutal and fetishized rape, pleasures, violence, dominance, and indulgence is. He would often say when he looks around and thinks about it.. his character and life is similar to most leaders. The greatest leaders he knows arent emotional, overly caring, sensitive, \"squishy\" or giving. Superstar singers.. athletes.. businessmen like Steve jobs.. world famous video game designers.. they all have one thing in common. They \"lick the earth\" as he would put it.. and they dont hold back their id-driven desires. That is the source of their greatness and inspiration, especially as an artist. Being a sensitive \"squishy\" ..That all seemed so empty to me. \n\nHis dream is to have a line of hundreds of women waiting their turn to be fucked.. he impregnates them and doesn't take care of the babies. \"Like a Viking king\" He often said sex is a need. If he doesn't have sex in two weeks everyone starts to look like meat. He doesn't care. Men and women alike. I tried to understand the root of this manifestation. It was horrifying to hear but in all these stories.. all I saw was this nerdy obese kid who was ignored all of his life... a guy who was so ignored that he lost his virginity to a prostitute... this poor 7 year old boy who would be locked in his room for days by his horrible stepfather. His cries ignored by his cold mother to ensure her loans are paid by this new man. It all screamed suffering and heartbreak. Especially because I personally know several women who have experienced rape and I have been volunteering with The Rape Foundation for several years. I really tried not to judge. How can you.. life is crazy and sometimes devastating and sometimes you dealt difficult cards.. like your parents. And humans are capable of such cruelty.. a lot of times they genuinely think they're doing the right thing. We also got into many painful fights about his views on having children and marriage. He said he would absolutely test the blood of his babies. That was a deal breaker. I would explain how hurtful that is. He would say its not about me. It's statistics. Women will lie and have men financially support children that are not theirs. (This is what his mother did to his stepfather. When his stepfather found out. He began to abuse my ex from a very young age.) He also said 80% of women initiate divorce for the payday. So if marriage was a deal breaker he would consider \"many types of arrangements\" with the help of his lawyers. \n\nAnyway.. 8 months we dated. He made me cry 1-3 times a week. But when things were good we were both adventurous.. incredibly playful.. tender.. driven.. and affectionate. We both love similar music and movies. He would sing to me.. we loved going on long drives and talking about life.. this existence.. our hopes and dreams. We are both class clowns. But one thing was rawly clear. We were cut from different cloths. He's a big tall trump loving white guy from Texas who always lived in a big house.. no student loans.. went to art school.. atheist.. first job was after college for a video game company.. etc. I'm a Korean American from the east coast who was raised by a struggling single immigrant mother.. have had at least one job since high school.. lived in my car in NYC.. put myself through college thus have student debt (this was a big issue for us.. he said for him to even consider marrying me.. I would have to get rid of my debt. I'm the first one in my family to go to college).. insatiably curious about spirituality.. religions.. philosophy, the human condition. I am such a sensitive giving tender hopeless romantic easily hurt squishy. And he's just a confident iron fist, force. His mother and the rest of his family believe vulnerability and feelings equal weakness. A few times he was very vulnurable and shared how when he get married and starts a family, he plans to stay away from his family because they are all a very certain way. \"poverty mentality\" is what he would call it. He would share how his mom never cared.. and still doesnt care about his problems when he tries to open up to her. One time when he dumped me he said.. his mother is so strong she has never cried ever in his life. And I cry all the time. He would resent her for her hard coldness but I don't think he's aware of how attached and proud he is of her. He'd laugh and say \"my mom is a tempest. Shes the boss of the house, what she says goes, she gets her way, she's dominant she's fierce. She's a force.\" He would express how the other girlfriends he introduced to his mom were shredded apart and would end in tears going up against such an intimidating woman. I see right thru all that. His mom holds a tremendous amount of guilt. He never once talked to her about how her abandoned him while his step father would abuse him and lock him up. For days he would sleep on a bare mattress.. starve..  and go to the bathroom in the room. He said he became obese because of this feeling of having absolutely no control and not knowing when he'll eat again. It's so heartbreaking. When he got older his step dad and mom sent him away to a military school for delinquent kids. He would be locked in his dorm for days as well. He would beat kids up and created a group of friends that he \"protected\". Multiple times he told me about a very feminine kid who would massage him in exchange for his protection. My ex would explain if they locked him up in his dorm for a few more weeks he would have absolutely fucked that feminine kid. My gut tells me he did a lot at that school that he'll probably never tell anyone. \n\nI see thru all this. He and his mom have taught eachother to pretend like nothing happened. This is their way of comforting eachother.. pretending like it went away. As a woman.. as a super sensitive aware woman.. I know she's holding a lot of guilt and sadness. She's created such a tough persona she can't get herself to let it out. People will live a lifetime running from feeling. \n\nMy ex is incredibly charismatic to his coworkers and he's loved and well known at work. Many shy guys at his video game company idolize him and his ability to sleep with many women. He's this fearless jokester who is \"untouchable\". He is very proud of the fact that he hit the \"jackpot\" being born a tall white confident man. He has absolutely no one he's responsible for except for himself. Im very close to my mother and sister and when my parents divorced I pretty much stepped up and felt responsible for keeping the three of us together. Since high school I started to help financially support our family. He couldn't understand that. He'd simply say it's very good of me. \n\nAnyway..\nWe are such opposites and we knew this from day one. I was WAY too giving. I paid for amazing vacations because he had never snowboarded.. snowboarding was my life from middle school to college. I always drove to his place in Santa Monica (22 miles away from my place and my work.) I always planned amazing adventures.. things he's never done in LA. He surprised me with a candle lit dinner once. The first three times we ever went out to dinner was my idea and I treated him. He used to say I am the balance and light that will melt the ice and softened the thorns around his heart. I remember one time he was just in awe. He didn't own any plates or cups so we went to target and I got him some essentials. He said he had never been treated or cared like this. In the beginning, he did hand draw me pictures of me which was really touching. He had flowers sent to my work. Once after we fought and once after I stayed with him while he got a gal stone removed. He used to say he had never spent money like this for anyone. He used to never even buy girls drinks before taking them home. So many times I told him. I don't care about the money spent. Pick a dandelion for me. Let's share a mcdonalds apple pie on the beach. It's the thought care and effort that is so special. He just never got it. \n\nHonestly as the days pass and I continue to practice Shambhala meditation, contemplation and mindfulness.. I see I was YEARNING for that strong eternal male energy love... the love of an unconditionally loving caring father that I never had. He broke my heart 1-3 times a week for 8 months, honestly my heart and gut knew it was very wrong. But my yearning to fall in love.. to GIVE the love I hope to receive.. and the yearning to settle down blinded me. I gave the love that I wish to receive. Even though my ex didn't deserve it. The biggest lesson I am walking away with is why did I stay for so long. That's where I am going to learn and grow from. That's where my self love needs to focus on. Believing in someone.. believing in hope.. believing in good and forgiveness are all wonderful things but there needs to be an unbreakable boundary where my self respect and self worth isn't brutalized. And I need to have self love and strength to walk away. For good. Even when they're crying, apologizing, explaining, or making the most beautiful promises. \n\nThe very last week we spoke. I texted him in the morning after fighting the night before. He bit my head off about bothering him at work. I went silent after that. After several hours he emailed me explaining he fucked up and when he gets emotionally overwhelmed he doesn't know how to deal. He said he loved me.. loved what we've built.. that I am a ray of sunshine he has been able to capture and he will never give up. He said he was going to come over that night to fix things. \n\nI was so exhausted and broken.. I couldn't get myself to respond. I just didn't get it. Me caring.. me reaching out being affectionate.. texting him to see if he's okay.. all of that to him was nothing but an annoyance and a horrible burden. If you have so many excuses against it.. and so much aggression and aversion against it... why be in it? How can I apologize and be sorry for burdening you with my affection? Poisoning your life with my love? \n\nAfter getting no response for 5 hours he texted me. \"Actually I'm not coming tonight. I'm seeing other people.\" That was it. After a few days. I emailed him a couple times that I deserve a proper phone call break up. He unblocked my number and finally called me. Immediately he just unloaded his anger. He blamed everything on me. He said I have a personality disorder and as my friend he was begging me to get help. That everything was in my head and that I cry for no reason. He said he knew from the first week of dating that I was the problem but he felt bad for me and was tired of hopping from one girl to another so he stayed with me for 8 months. He said he is tall.. confident and white.. he makes a shit ton of money and he loves his life. He said \"I simply have TOO MANY choices.. our connection wasn't special at all and I will love again\" He said he had already fucked someone new and she is \"very sweet\". He went on a date with someone and \"she is fucking awesome\". I stayed on the phone as he said every single thing a hurt desperate person would say to try to convince himself that's he's okay.. he's in control.. he's not hurt.. and he's right and strong. \n\nWe often talked about the five love languages. He always said he only needs physical touch. And I need all five which he thought was crazy. I stayed on the phone with him as he described all the reasons why this new stranger he slept with was better than me. How her only love language is touch as well. He emailed me on Monday saying he will never give up, and by Thursday he had slept with someone new. As I listened to all this.. it finally clicked in my heart. That was it. All the hope and forgiveness and empty promises broke in me. He finally cut the remaining karmic tie between us. This was never about me. I was never going to make this guy happy and we were never going to work. All this horrible cruelty he was yelling into the phone... was his internal dialogue convincing himself that he is right, he is okay, he not hurt, he is not responsible. Having no control.. or being accountable for selfish hurtful actions causes him to lash out. He has such a fear of feeling things.. of getting hurt.. or having no control that he rather live a surface level life and cushion himself with yes people and agreeable circumstances that make his life easy and unchallenging in anyway. Control everything.\n\nThat, believe it or not is the shortish summary of my last 10 months. There are so many other examples and details but I have a feeling you guys get the picture. \n\nSo here I am today. It's been an up and down road to healing. Today my close friend sent me articles on the toxic relationship between empaths and narcissists. I am SHOCKED how accurate and to the T these articles capture our relationship. Our relationship was EXACTLY like how these articles explain it. Honestly... I wish fate would send these articles to him.. I even contemplated having my fiend or my sister email them to him. Is it wrong of me to care about his happiness and growth? Care about him opening his eyes to the destruction he's creating? Is it wrong of me that I don't violently hate him? I feel sad FOR him. I feel no need for relief by cursing him and saying cruel things. I have no need to fill any voids by sleeping with people and saying \"OH I am SO over him. OH he was horrible and I can do better.\" Life is vast and life is crazy. How can I condemn and judge anyone? That's just not me. You can't control certain cards you're dealt... like your upbringing. But you DO have the choice in how you live on from these experiences. That is what I do choose to examine. I wish him bravery and strength.. I wish that for anybody and everybody. I wish that for myself too! I'm working on it everyday. Strength to see myself and life without any veils. See my actions without any self deception. (Deception like cushioning your ego.. focusing on blame which is so empty and pointless.) Fear from not knowing what's gonna happen.. fear of having no control.. it's instinct to protect yourself. Your ego will protect itself with all kinds of destructive momentary relief (empty sex, alcohol, saying mean things to people and putting others down, etc.) I wanna see things for what they truly are. Be brave enough and have the wisdom to walk away when you know it's wrong and not meant for you. \n\nIs it wrong of me to hope that he'll learn the true root of happiness? It's not money or sex with hundreds of beautiful women. Or telling yourself how confident and awesome you are. How many people know you. (From the years of isolation.. all he did is draw alone in his room. Now he is a somewhat well known video game artist and director at a major video game company in LA.)\n\nLiving a full life is about living awake.. how much you open yourself to the world. How much you give and share. Vulnerability is true bravery and strength. Not cushioning your life with ease and agreeableness. But I realized.. who am I to force a lesson on anyone. Who am I to \"make\" someone wake up or realize things. Even if he were to have a.. \"shit.. now I see\" moment.. it takes consistent drive and desire to be awake and mindful... it takes time to change your habits. I just wanted to know what you guys think. Thank you for reading. I may be hurt and heartbroken but I am SO thankful for this experience. I think these lessons have really opened my eyes and I'm coming out stronger and a lot wiser. You definitely can be too open... too giving.. and too forgiving. \n\nhttps://dailyoccupation.com/2017/03/14/toxic-attraction-empath-narcissist/\n\nhttps://www.psychologytoday.com/blog/sense-and-sensitivity/201201/the-highly-sensitive-person-and-the-narcissist?amp\n\nAs the time passes I rawly see how completely lost I became. I lost myself and completely forgot who I am and what I'm worth. I became a deeply desperate and sad person. Everyday I yearned for the small crumbs of kindness and affection he would strategically give me.. especially in the form of verbal affirmation: telling me I'm the love of his life and he will never give up. But then check me by ogling and comment on women's bodies while we're out.. and keep me down on myself and insecure. He is truly manipulative with his words which in this world can take you far. It's rewarded. He was always very proud that he could get what he wanted.. especially with women. I also rawly see that how you treat and speak to others is a true reflection of how you treat and speak to yourself internally. If someone is so easily and freely able to be sooo mean and cruel to another living breathing FEELING human.. how is their internal dialogue with themselves and their self worth? \n\nThank you so much for the wonderful comments and messages. I cannot express how moved I am. Its even more special because we are all anonymous strangers yet we are all so interconnected in how we feel and the hardships we face. I am so thankful. I choose to take this painful experience and life lesson and continue to explore myself.. love myself... open myself to others.. and love. \n\nHe texted and emailed me a few weeks ago. He wrote:\n\nText:\nIt's been hard without you. I hope you're okay.\n\nEmail: \nIt's been hard without you. I hope you're okay. Sorry for how things went down. \n\nI couldn't respond.",
    "title": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1498231430,
    "score": 15,
    "keyword": "white director"
  },
  {
    "text": "I'm underpaid and doing the work of someone three job levels higher than me... Advice needed. I work at a large New York creative agency. I was hired as a mid-level designer, and I get paid like one. Over time I was gradually given a lot more work, and more responsibility --which has been great in a lot of ways, as I've gained a lot of experience and knowledge. Unfortunately, it's gotten to the point where I'm starting to feel taken advantage of, and I'm totally underpaid/under-ranked. Unlike a typical mid-level designer, I'm not just responsible for my own projects: I am the creative lead on many projects; I manage a team of people; I interact directly with clients and high-level executives; I come up with concepts and execute on them all on my own; I often work late nights or weekends without overtime pay.\n\nI need to discuss this issue with my boss (who, wouldn't ya know it, is white and male.) I've conferred with more senior people I work with, and have confirmed that from their outside perspective I am doing the work of an Art Director or Associate Creative Director, which means that I'm currently about $65,000 underpaid... I realize that I could always get a job at a different company, but I'd rather get a title bump before I leave. I don't want to start over somewhere else as a mid-level designer. Plus, I love the people I work with.\n\nI'm trying to figure out what to say to my boss, and I figured that you fine ladies might have some tips or pointers. Any advice would be appreciated.",
    "title": "I'm underpaid and doing the work of someone three job levels higher than me... Advice needed.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1489359503,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "If the ACGME Were Like the NCAA... Headlines might read:\n\n[Southern California medical school and teaching hospital caught up in a massive scandal](http://www.espn.com/mens-college-basketball/story/_/id/20824193/ncaa-basketball-coaches-10-charged-fraud-corruption).   \n\nResidency directors were arrested by the FBI for bribery and wire fraud related to bringing in the \"most sought after\" medical students and residents, and attempting to offer kickbacks to several major medical supply companies for their endorsements.  Incoming residents were offered tens of thousands of dollars to secure their Letter of Intent to the institution.  A school official was quoted as saying \"We were just about to land some really huge endorsements of 'blue chip' students and first-year residents\".    \n\n[Texas medical school and teaching hospital locker room for residents now a palace of medicine](http://www.expressnews.com/sports/college_sports/longhorns/article/Longhorns-locker-room-now-a-football-palace-11738209.php)  \n\nThere are 126 of them, each constructed of stainless steel, adorned with milky white doors and Bevo insignias. A 43-inch television hangs atop every newly installed locker like a hi-tech crown. On Aug. 2, the Residency Director finally welcomed his new residents to the swanky new digs. Residents flooded through the entrance and gasped. Or roared. Or stared in stunned silence. The chief of Medicine was quoted as saying \"It’s about luring the best students and residents in the nation to Austin. It’s about wowing colleges. It’s about winning the arms race.\"  \n\nThis coming after [Oregon spent almost $68 million on their new medical facility, complete with a cafeteria and barber shop for residents](https://www.sbnation.com/college-football/2013/7/31/4574556/oregon-football-building-new), the faculty there vowed to \"tear it all down and go even bigger just because we can\".  A letter has already been drafted to Medical School boosters asking to help raise almost another $100 million to \"stick it to those dirty Longhorns\".  \n\n[In other recent news, the ACGME settled with EA sports for featuring likenesses of residents](https://www.cbssports.com/college-football/news/college-athletes-react-on-twitter-after-receiving-ea-sports-lawsuit-checks/) in popular video games such as \"Operation\", and \"Emergency Room 2015\".  \n\n[Another scandal at a Southern California medical school](http://www.live5news.com/story/17857928/ncaa-to-announce-penalties-against-south-carolina) and teaching hospital unfolded a few years ago, related to \"improper benefits\" and overworking of the Residents.  Facing potential massive sanctions from the ACGME, USC self imposed penalties of:  \n\n* A 10% reduction of attending salaries to be transferred to the Residents \n* A 5% reduction in Resident work hours with no pay cut  \n* Public reprimand and censure of the school and hospital\n* An increase of 10 residency slots  \n* A Match process time reduced by 15%",
    "title": "If the ACGME Were Like the NCAA...",
    "subreddit": "medicine",
    "timestamp": 1506607885,
    "score": 40,
    "keyword": "white director"
  },
  {
    "text": "Currently at my community school, many girls are opting to leave the nursing program to go to other nursing schools. (Huge fail rate, high nclex pass) Is this normal? Nurses at my hospital are telling me to transfer. Hi,\n\nI currently go to a community collage. I worked so hard to get into this nursing program. We had to be CNA certified, do a nursing interview with the director, have a 3.0 gpa, and pass an admission HESI with an overall 85%+ in Chemistry, Math, Reading, AP, and Biology.  \n\nI'm in my first semester of classes, and there are some red flags that are popping up. \n- Girls regularly crying in the halls.\n\n- Teachers tell us to ask if we have questions; when asked we get berated for \"not knowing our stuff\" and \"they won't be there to hold our hand.\"\n\n- They single out girls who work, and often embarrass them or are more harsh towards them. (During my nursing interview I was told to quit my job.)\n\n- During my nursing interview I was asked \"What are you willing to sacrifice for this?\" and I jokingly said \"my happiness and well being.\" and the director said \"Good, you are realistic\"\n\n- They pressure mothers to drop out, say they are going to have to neglect their children to stay in the program and asks if they can live with that.\n\n- We are not allowed to laugh or smile during labs, as \"Nursing is serious, not fun.\"\n\n- Student written up and has to attend weekly meetings with teacher and assistant director on \"attitude\" after she made A VERY VERY VERY mild joke to another student about 'critical thinking' when moving furniture around in lab to do a skill.\n\n- Action plans for student who come to class with seat belt wrinkles in scrubs. We have to line up and be inspected. Shoes have to pure white. Scrubs no wrinkles. \n\n- We are not allowed to have discussion (about material) in class or during breaks in between. \n\n- Signed contracts saying we have to study during breaks at school.\n\n- Mandatory tutoring sessions: 3 hours long, on a scheduled day. Side note: I took pharm early last semester and I asked for tutoring before it was mandated, they said they had no tutor available. \n\n- I received an 80% on HESI. I was told that they had to lower the bar for everyone, that I was going to fail the nursing courses due to my \"low score\", I was the third highest in my class. Highest being a 95%, Lowest 65%.\n\n- Only male student receives special attention. Gets called brilliant a lot, and dress code doesn't apply to him. He puts down other girls in class. \n\n- We self teach dose calc, I don't have a problem with this but we were expected to know this first day of class. Yet we were not told.\n\n-On average they accept 25 students, only 7 graduate. 90% nclex pass rate. \n\n- During nursing interview when asked about family, I was told to dump my boyfriend since he was a paramedic. \n\n- Paramedic and previous emt students belittled. \n\n- The staff proudly admits to weeding people out\n\n- Often compare nursing to doctors, openly admit to being harder then med school.\n\n- Wouldn't let me enroll into an additional course to get full time status for my grant.\n\n- We are not allow to ask about clinical sites, they said it sends red flags. I believe most girls do because we are located in the woods and most of us have to drive an hour or two just to get to school. So some ask for closer sites as to not drive in snow so early in the day. (non plowed roads.)\n\n- They take digs at confidence levels when ever they get a chance.\n\n- 2nd and 3rd semesters are leaving, warning first semester to get out while they can.\n\n- Teacher said we need to believe in god or else we won't make through nursing. (I swear I'm not taking this out of context.)\n\n- They are known for changing clinical sites the day before going.\n\n- Changed my whole class schedule a week before classes began,  I was told it shouldn't be an issue since I shouldn't be working anyways. (we are not allowed to sign up for our own classes which is common.)\n\n- Horror stories of girls being kicked out of clinical for odd reasoning. \n\n-  Nurses at hospital say to leave my collage as many them attended there and switched schools midway as it gets very catty between teachers and students. They felt happier at other schools, some claim they were learning more instead of being afraid to go to class.\n\nAt this point, I feel overwhelmed with all the negative emotion and reactions, especially from teachers. I'm afraid to ask questions. I don't mind course work. I have to figure out how to starch my scrubs now and its difficult to hide that I work night shift on a med surg unit. (There are only two hospitals in the region that people can work at/clinical).\n\nSeeking advice. Is this normal? I want to learn and ask questions but don't feel like I can.",
    "title": "Currently at my community school, many girls are opting to leave the nursing program to go to other nursing schools. (Huge fail rate, high nclex pass) Is this normal? Nurses at my hospital are telling me to transfer.",
    "subreddit": "nursing",
    "timestamp": 1485219766,
    "score": 6,
    "keyword": "white director"
  },
  {
    "text": "[PA] [11/12] - Having a terrible student teaching experience. Advice please **TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**\n\nI am at a AA-sized school in western PA outside of the city. When I was first assigned to this school I was excited as the mentor teacher had received some awards and plaudits both statewide and even a national one. I thought \"what better person to learn from that this person\".\n\nWhen we first started it was going great. She was excellent at teaching me the ins and outs of contracts, etc (which I realize now was totally off-topic and shouldn't have even come up), the mechanics of school politics (again, some bells going off) and so forth.\n\nDuring the first week, I could see how she was a really good teacher. The kids respect her and she has great classroom management. On Tuesday of the first week, she said she would want me to start teaching the following week. So she would take the first Econ class of the day and I would teach the two in the afternoon. She wanted me to start drafting lesson plans for these days and then we'd go over them on Friday.\n\nThe first week of doing Econ in the afternoon went well, so she had me take over that class full time in Week 3, while I took over the second of her two Psych/Soc classes in the same format. In Week 4, it was all me for everything.\n\nWhile I was excited to jump into teaching full time, I should have had a few alarm bells going off:\n\n* why wasn't she modeling her preferred style of lesson planning to me?\n* why was she moving faster than my university's suggested timetable for giving me more responsibility?\n* how was I going to be expected to extrapolate from her incredibly abridged lesson plans?\n\nI took comfort in the fact that, at the beginning, she would sit down with me and go over what she would expect to me to cover the next week and so forth M-F. And it became our ritual, in a sense, for us to sort of broadly go over the next week on Friday and then for me to turn in an overview of the week by Sunday, which she would comment on if there were any concerns.\n\nFast forward to last weekend. She is busy on Friday with students asking about extracurricular stuff and my attempts to connect on the following week's material are rebuffed. So I do my best on Friday evening and Saturday to map out the week, extrapolating from a very thinly detailed syllabus to try to use as a pacing guide. I text her on Saturday evening asking if we could go over the plans for the week, and she responds \"I'm busy right now, I'll call you tomorrow at 5\". (bear in mind, she told me from day one that if I EVER need help to call and she'll \"talk me down from the ledge\" and work with me\".\n\nThe next day, I reach out by email ahead of time, sort of detailing all of my concerns about the upcoming week, my confusion over the pacing and wording in the syllabus and uncertainty as to her suggestions from the past. \n\nThen 5 comes and I get no response, then 7, then 9 - and by this point I'm freaking-the-fuck out. So I send another follow up text stating that I had sent an email with some questions and I was hoping to discuss the following day, at least, as well as the week moving forward.\n\nI get a text at 11:30 pm asking \"have you figured it out yet\". To which I of course responded no and that I thought i at least had a plan for the next day but that I really needed some clarification on the rest of the week. She responded \"**i can keep holding your hand forever, but you'll never learn anything that way. I need those lesson plans before 7 tomorrow. See you then**\n\nSo when she came in the door in the morning, I was hastily wrapping up the weekly overview lesson plan to be turned into the office - basically just going off of whatever she did last year.\n\nThen all week long, there was this tension in the classroom. I could feel it growing. I was frustrated with her for essentially abandoning me with little preparation (a strategy which many of my teacher friends derided as unprofessional and extremely unhelpful). She seemed annoyed with me for seemingly needing any help at this point.\n\nOn Wednesday, I get an email from the director of field placements at my university wanting to have a phone meeting the next day. On that phone meeting is literally everyone in the chain from the top of the school of education down to me. \n\nMy site director first allows me space to give my side, and then proceeds to list a rapsheet of complaints and errors on my part that have been privately communicated to her over the past week or two about my untimeliness in turning stuff in and unpreparedness for the day each day and needing to have my hand held for every little thing...yadda yadda.\n\nI was so taken aback and felt so cornered, but i swallowed my tears and the lump in my throat and did my best to give a fair account of everything from my end, to include - which I've yet to mention - that the previous week she broke her tooth in half and had 2 miss days of school in pain after getting it pulled and i was left with subs, etc. Then the following days she was in pain because she couldn't take her percocet before coming to school and so was always in a foul mood, but I did my best to steer clear, etc.\n\nThe school seemed understanding of my side, and said they aimed to support me in whatever way possible to help get me across the finish line.\n\nThen yesterday was teacher in-service. Teachers are supposed to be given an itinerary at least a week ahead of time. Our teachers were given them on Wednesday. My MT forwarded the email to me, but i notified her that as it was a Google doc, and she was not the creator, it wasn't able to be opened unless shared by the creator. She said she'd follow up, but never did.\n\nSo I arrive at 8 the on Friday morning, and go to meet her in the classroom, which is where we met previously. She's not there; door locked. I go to the auditorium, which is where in-service began last time, and no one is there. Finally I hear an announcement and see teachers walking toward the collaboration center, so I join them and we all walk in the door at 8. I get a text from her at 8:02 saying \"in-service started 2 minutes ago and you aren't here\". So i responded \"im here, in the back of the room\". She turns around and makes eye contact.\n\nLater in the day I get a call from my site director asking how the day is going, if I'm feeling any better after the ambush on the phone the day before, etc. Then she asks, what time did the in-service start this morning? I said, \"8\". \"And when did you arrive?\" \"just before 8\". \"Well, your mentor teacher sent me an email notifying me that you didn't arrive until 9\".\n\nI was PISSED. I forwarder her the texts proving that I was there at 8 and that I had notified my mentor teacher of my presence in the back of the room.\n\nI got ANOTHER call from the university and after some back and forth, they sort of seemed to agree with my suggestion that I felt that I was being sabotaged at this point for whatever reason. They said to not go into school on Monday, don't contact my mentor teacher, don't contact the school - they'll take care of it. What they want is to have a meeting where all the expectations of all parties are laid out in black and white, on paper, so there's no confusion, and then we'll figure out a path forward from there.\n\nI'm so frustrated and confused and exhausted and exasperated over the whole thing. I don't even know what to do going forward. I was told to not make any more lesson plans at this point and to just take the weekend to spend time with my kids and wife and think about some solutions to help get me across the finish line on December 8.\n\nI'm so furious I don't even know what to do. I'm also worried that my MT, if I remain in her classroom, is going to sabotage me by switching subjects this week to throw off any lesson planning I've already done (both classes are combined Psych/Soc and Gov/Econ) and we go back and forth. Everything I've planned for the rest of my time there is in Sociology and Gov, so I half expect to walk in the door tuesday and she'll have been teaching Psych and Econ and tell me to hurry up and make some lesson plans for the rest of the week.\n\nAnyway. Suggestions?\n\n**TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**",
    "title": "[PA] [11/12] - Having a terrible student teaching experience. Advice please",
    "subreddit": "Teachers",
    "timestamp": 1507998970,
    "score": 34,
    "keyword": "white director"
  },
  {
    "text": "Is the writing on the wall that I should look for a new job? Created a throwaway for this. The facts: I'm a senior marketing manager working in my dream job at my dream television network in NYC. (I realize how rare this is, and I am grateful every day.) I'm well-respected in my department, my reviews are really solid, and I'm given many opportunities to travel, work on high-priority accounts, do public speaking, etc.\n\nMy company has been very open and vocal over the last several months about a conscious initiative to hire more diverse candidates, both in our work force and in our talent on-air, which I happen to completely agree with. As a major media company, I think it's important that we represent all voices, and that people of all backgrounds can relate to what they see when they turn on our network.\n\nThe way my department is structured, there is no way for me to move up to the director level without one of the existing directors leaving - but there are about eight, so turnover does happen. About six months ago, there was an opening, which I applied for. I was told by the hiring VP that I was absolutely qualified and that I'd be an asset to the team, but they ended up hiring someone from outside the company, who happens to be of a minority ethnicity. (She's great, so I can't argue with the hire.)\n\nThat said, I now find myself in a pickle. They've basically said outright that any new hires will be diversity candidates, and I am a white woman. (Our offices are pretty 50/50 men and women, so being female doesn't count as diversity here.) I hate even considering that I might need to leave my dream job, but I also think the writing is on the wall that I most likely won't be able to move up because of this new initiative.\n\nWhat would you do if you were me?? Is it time to start looking elsewhere? I'm getting choked up just thinking about it, but I know I need to do what's best for my career. Thanks for any advice.",
    "title": "Is the writing on the wall that I should look for a new job?",
    "subreddit": "careerguidance",
    "timestamp": 1510086302,
    "score": 8,
    "keyword": "white director"
  },
  {
    "text": "Interior stylist or interior designer or interior architect? How to get a career in interior design. INTERIOR STYLIST OR INTERIOR DESIGNER OR INTERIOR ARCHITECT? \n\nThe definitions are a little loose and confusing. I myself was completely baffled by it all at the start, I knew what I wanted to do but had no idea how to define it which is essential when looking for your first dream job in the industry. Firstly, there is a big difference between interior decorators and interior designers/architects. To sum up the difference in one word, the difference is — Education. \n\nInterior Stylist – Photoshoots for editorials and advertising, trend forecasting, artistic/creative direction and show home styling.\nInterior Designer – Furniture specification, concept design, design management, design programmes and client management.\nInterior Architect (often found within an Architecture studio) – Room layouts, architectural detailing, a degree in Interior Architecture or Architecture, building regulations and planning applications.\nI personally define what I do as both interior design and styling. Even though I have a Bachelors Degree in Architecture, my passion is all about interior design. But I know for one thing, studying Architecture RIBA Part I at university was the best thing I ever did. It is respected in the design industry and gives you a professional chartered qualification that you can use anywhere, even if you decide to take a break from interior design for a couple of years.  The British Institute of Interior Design is a great tool for budding interior designers from specifying accredited universities to posting job advertisements.\n\nHOW DO I GET THE JOB?\n\nBuild your portfolio. This is YOUR selling tool, so make it look professional and slick. Try not to go ‘wacky’ with colour (my portfolio is a grey and white monochrome scheme), keep it clean and minimal so they are looking at your work not the graphic design. Leave as much white space as you can and take tips from graphic designers in the way they lay out pages (try to use Abode InDesign if possible).\n\nIf you can, try and get an internship. Internships, long or short, give you experience of the industry that you want to be in and allow you to find out if it is the right one for you. It means that you start from the bottom and you get access to amazing talent in the real world. And you can add the work to your portfolio to show to potential employers. You can find job advertisements everywhere but here are the best places to look.\n\nBritish Institute of Interior Design\nDezeen Jobs\nRIBA Appointments\n\nSHOW ME THE MONEY! HOW MUCH WILL I GET PAID?\n\nOf course, this depends on a lot of factors such as, education, prior work experience, size of the firm/company and location. A designer that is employed by a furniture company will most likely make less than a designer that is employed by a high-end architectural firm. Starting salaries for junior designers range from £18,000 to £23,000 a year. Experienced interior designers earn between £25,000 and £40,000. Senior designers can earn £45,000+, while creative/design directors can earn up to £75,000, and sometimes more. Salaries vary widely and depend on location and your reputation and contacts. It is possible to command high earnings, particularly when there’s involvement with high-profile ‘prestige’ projects.\n\nKeep in mind though, interior design is not all about plumping up cushions and selecting beautiful fabrics. You will be expected to work evenings and some weekends as your role will be integral to a large construction and development process, the client will always expect (almost) EVERYTHING for yesterday.\n\nMost of all, find a job in interior design that you love and you will never have to work a day in your life. This may take time but be patient. I know that if you are passionate and driven enough, you can achieve your dream. JUST GET OUT THERE AND START THE FIRST DAY OF YOUR FUTURE!",
    "title": "Interior stylist or interior designer or interior architect? How to get a career in interior design.",
    "subreddit": "careerguidance",
    "timestamp": 1486163483,
    "score": 6,
    "keyword": "white director"
  },
  {
    "text": "How to mentally get over managers that get paid double you but half the work? Disclaimer - I am specifically talking about white-collar jobs\n\nI really fail to understand the concept in corporate America where managers/directors/VPs get paid double the amount for half the work. Of course, I know there are those that work really hard and lead by example, but those are exceptions.\n\nIt's just hard to stay motivated with this growing in the back of one's head...",
    "title": "How to mentally get over managers that get paid double you but half the work?",
    "subreddit": "careerguidance",
    "timestamp": 1504213902,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "MMPA (Masters in Management & Professional Accounting) program at University of Toronto Mississauga plagued by a culture of secrecy Due to a minor conflict with the secretary, the MMPA program sent to the Big Firms via their secret personality profile that I had a communication problem (without asking my side of the story). I was criticized for attending few social functions as I had a parent with dementia (they of course, never asked me, but they assumed I was being unsociable without asking me).   As such, despite a prior Masters degree and a recipient of numerous scholarships, I was not interviewed by any large or mid-sized firm - confirmed by partner of firm I worked at.\n\nHis use of a personality profile without the adequate understanding of psychology highlights his overconfidence in his decisions and incompetence.  The use of a director's list for student he personally think will excel lacks objective criteria leading him wide open to biased decision making.  Not surprisingly, many white males make the list.  \n\nI approached the director of the program at the time, Leonard J Brooks about my profile issue per the firm Partner but he denied everything but then offered help to find suitable employment. He tried covering everything up and denied everything. Not very ethical, is it?\n\nAfter 3 years, he changed his story to, \"I haven't put enough effort to find work.\" This is deeply unfounded as I applied to positions and worked with a career counselor. The disturbing part is lying (unethical for an ethics prof), and not taking ownership for his co-directors mistake about my \"communications problem\" by using deflection.\n\nSo, MMPA assigned my friend to golf with a small firm representative, despite her A grades. Our Organizational Behaviour prof in the program verified existence of the confidential personality profile and criticized their overconfidence and lack of psychology training to be able to accurately construct this (these are accountants).  Thankfully, Leonard Brooks has moved on to semi-retirement as this situation highlights questions about his competence.  He was over 80 years old.\n\nRegarding the situation, the concern of Len Brooks lack of transparency, lying, and over use of power (eg not responding to emails; deflecting the situation to make it all my fault) He is the ideal example of a person who at the top has forgotten to listen to those below. My recommendation for him, based on our teachings in Organizational Behaviour, read the Harvard Negotiation Project for effective open leadership styles.\n\nMany negative posts I wrote to tell my story, Len Brooks had removed.  His attempts to quell freedom of speech is simply not ethical.  We must strive to be open and transparent.  This is the ethical way and is in-line with current research in OB.  Yet, Brooks lack of professional qualifications (no PhD) highlights his knowledge gap.",
    "title": "MMPA (Masters in Management & Professional Accounting) program at University of Toronto Mississauga plagued by a culture of secrecy",
    "subreddit": "Accounting",
    "timestamp": 1486666740,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "How to deal with a Pro-Trump client? Aware that being Pro-Trump is a democratic choice. The problem is that all day they are quoting Fox News level of reasoning: \n\nTrump is not against muslims, but he just wants to know who they are and wants them to stop killing Americans every day. \n\nHe should golf every weekend because he needs a clear mind to make important decisions.\n\nClimate change is made up to take away energy jobs from America.\n\nObama's kids lived in the white house surrounded by top secret stuff, so why can't trump's family get the same information. \n\nThe biggest problem is that these are educated Senior Directors at a large institution. I want to correct them, but I just nod along. Should I try to engage in a dialogue, or just put my head down and keep working?",
    "title": "How to deal with a Pro-Trump client?",
    "subreddit": "consulting",
    "timestamp": 1496895054,
    "score": 11,
    "keyword": "white director"
  },
  {
    "text": "Shout out to Spider-Man Homecoming for diversity? I know a lot of ladies feel like diversity in Hollywood shouldn't be celebrating like it's a victory but should be expecting at this point. I get that I'm still happy as fuck that the new Spider-Man movie has so much melanin. The movie actually looks like the town I grew up in!😄 Thanks casting/director for not pretending Queens is still white as hell. \n\nIt's also refreshing to see that Laura Harrier's character (Liz Allen) had a mixed race family. I love our light skinned, mixed race sisters but it's so annoying (and offensive) that they are often given dark skinned parents. It reeks of colorism and it doesn't represent black families or mixed families at all! Unrealistic casting only appeals to white minds who are only comfortable with a light face.\n\nNow… if only we could get a Miles Morales movie... In the meantime, I'm looking forward to Black Panther!",
    "title": "Shout out to Spider-Man Homecoming for diversity?",
    "subreddit": "blackladies",
    "timestamp": 1499802006,
    "score": 27,
    "keyword": "white director"
  },
  {
    "text": "Should I tell HR? I'm finally leaving my job of 2+ years. I work in the food industry, and while here, I've dealt with the some of the most disrespectful things. Minus the unfortunate normalcy of backstabbing coworkers and a shady boss, I have been sexually and verbally harassed on a consistent basis. The last incident was when a cook cursed me out (which he's done several times to just about all of us managers). I was left shaking. He is very tall and larger than me. Gets in my face and is physically threatening. This isn't the first time. But his immediate boss and my director have refused to fire him. They do these \"talks\" in which he blows up at them, he walks off the job for a few days (they allow him to \"cool off\") and then he's back like nothing ever happened. \n\nI work for a global contract company that holds significant weight in my industry. I know for a fact that neither my district or Regional manager care much about how we are treated. As long as the client is happy. I have voiced concerns about other things to my DM, and he pacifies me in the moment and then I don't see or hear from him for several months.\n\nMy question is, is it worth opening that can of worms when I'm leaving next week anyway? I fear that since I'm leaving so soon, I won't be able to defend my name or stance once shit hits the fan. I would like to leave in good standing but I feel as though with so many white, powerful men above me, they could easily paint me out to be the problem. I don't have faith that my female coworkers would come to my aid even though they've dealt with similar. \n\nTldr; is it worth telling HR about all I've been through at my current job when I'm leaving next week? I fear it will get turned around on me.",
    "title": "Should I tell HR?",
    "subreddit": "blackladies",
    "timestamp": 1505776355,
    "score": 20,
    "keyword": "white director"
  },
  {
    "text": "Director, performer resign after Calgary Opera plans to cast white woman for Asian role",
    "title": "Director, performer resign after Calgary Opera plans to cast white woman for Asian role",
    "subreddit": "asianamerican",
    "timestamp": 1491711063,
    "score": 28,
    "keyword": "white director"
  },
  {
    "text": "Press Advisory for The Red Pill screening in Washington D.C. Tuesday, March 7, 7:30 pm.\nLandmark E Street Cinema (E Street NW between 10th & 11th), Washington DC\n\nFive men's rights activists -- two of them female -- who appear in The Red Pill, a new documentary -- by a female director -- about the Men's Rights movement will be in town for the film's DC premier.\n\nAll five will be available for interviews following the screening:\n\n    Harry Crouch, president of the National Coalition for Men\n    Paul Elam, founder of A Voice for Men\n    Tom Golden, social worker specializing in men’s need for empathy and compassion\n    Karen Straughan, men's rights activist and YouTube sensation with more than 150,000 subscribers, writing and vlogging on gender issues \"fearlessly\" since 2010 under the moniker GirlWritesWhat.\n    Alison Tieman, member of the Honey Badger Brigade, a group of women Men's Rights Activists.\n\nIn addition, two others who appear in the film will be available for interviews via Skype:\n\n    Warren Farrell, Ph.D., chair of the Coalition to Establish a White House Council for Boys and Men\n    Fred Hayward, director of Men’s Right, Inc.\n\nThe movie's synopsis:\n\"When a feminist filmmaker sets out to document the mysterious and polarizing world of the Men’s Rights Movement, she begins to question her own beliefs. The Red Pill chronicles Cassie Jaye’s journey exploring an alternate perspective on gender equality, power and privilege.\"\n\nThe screening is sponsored by the Coalition to Establish a White House Council on Boys and Men, a group of researchers, practitioners and male-gender activists whose proposal to establish a White House Council on Boys and Men (whitehouseboysmen.org) was ignored by President Obama for nearly eight years after he created a White House Council on Women and Girls in March 2009.\n\nGet your tickets here: https://www.tugg.com/events/the-red-pill-q5rw",
    "title": "Press Advisory for The Red Pill screening in Washington D.C.",
    "subreddit": "MensRights",
    "timestamp": 1488563104,
    "score": 60,
    "keyword": "white director"
  },
  {
    "text": "\"Equality\"... or, \"When was the last time a feminist...\" I rarely engage a feminist for the same reasons i rarely engage with KKK, Muslim Jihadists, Marxists, Holocaust deniers , etc etc.\n\nThat said, feminists are far far more powerful and numerous than i'd like to admit (and not just in the West), and so i've recently started compiling a list of issues on which feminist hypocrisy truly shines. Y'know, for fun.\n\n\nSo anytime a femmy pulls the '**bububut we stand for equality**!\", i say:\n\n\n\"When was the last time a feminist seriously advocated equalizing...\n\n- the suicide rate?\n\n- homelessness rate?\n\n- mental illness rate?\n\n- drug use rate? \n\n- death rate from unnatural causes?\n\n- workplace injury and fatality rate?**\n\n- divorce rape rate? child custody rate? \n\n- time spent with family rate? or more generally: free time rate? \n\n- tax contribution rate? (remember, in general males contribute to taxes more than they receive in welfare, females are the opposite)\n\n- military conscription rate?*\n\n*this one is personal for me. In the country i come from, military service is mandatory for males. Imagine being forced to give up X number of years of your most fruitful, prime years for the drudgery/harshness of being a private. Yet NOT ONE of the feminists in my country mention a damn fucking thing to change it. But you know what they DO mention? The fact that males who've completed military service get networking/career opportunities that are not afforded to females.\n\nLet me reiterate that: the feminists are angry that females dont get the benefits of being forced into military conscription, but have zero issues with the female lack of obligation of being forced into conscription. \n\nYa gotta love these terrorists....\n\n\n\n.....anyone else think of other bullet points to add? \n\n----\n\n**EDIT: just to add on about the 'workplace injury/fatality' part:\nwhen was the last time a feminist advocated equalizing the gender ratio of blue collar jobs: the dirty/dangerous/unhealthy/isolated jobs that are dominated by men? \n\nwhen was teh last time a feminist talked about equalizating coal miner jobs, or garbage truck collectors, or bus/taxi drivers, or construction workers?  Nah, it's only the white collar jobs: CEOs, execs, board of directors, the presidency. \n\nEquality^TM !",
    "title": "\"Equality\"... or, \"When was the last time a feminist...\"",
    "subreddit": "MensRights",
    "timestamp": 1493625760,
    "score": 38,
    "keyword": "white director"
  },
  {
    "text": "I just saw \"I, Daniel Blake\", and it's one of the most important MRA movies made to date- highly recommend. The movie \"I, Daniel Blake\", about a man who has had a heart attack and struggles with the social system to receive his benefits and entitlements. I'm English and spent half my childhood in England, and  lived in London for 2 years, and this movie really resonated with me. So many times I heard from homeless men that the councils turned them down for being \"single white males.\" The first 90 seconds of the movie were haunting. I don't want to give too much away, but see this if you can. The movie covered a myriad of social issues and a key character is a single mother, so it expanded beyond a basic MRA scope, but its excellent, and the director/writer was obviously someone who 'gets it.'",
    "title": "I just saw \"I, Daniel Blake\", and it's one of the most important MRA movies made to date- highly recommend.",
    "subreddit": "MensRights",
    "timestamp": 1498435338,
    "score": 30,
    "keyword": "white director"
  },
  {
    "text": "An open letter to the Chair, Board of Directors, White Ribbon Australia.                                 Robert Brockway\n                                President\n                                Australian Men's Rights Association Inc.\n                                Email: [redacted]\n\n                Nicholas Cowdery AM QC\n                Chair, Board of Directors\n                White Ribbon Australia\n                Email: [redacted]\n\nMr Cowdery,\n\nWhite Ribbon Australia bills itself as \"preventing men's violence \nagainst women.\"  Within this context much of the activity of White \nRibbon Australia is focused on domestic violence (DV) and intimate \npartner violence (IPV).  Taking this approach, while ignoring the larger \npicture of DV and IPV, disadvantages not just men who are victims of \nDV/IPV but women who are victims of DV/IPV as well.\n\nReciprocal IPV involves intimate partner violence in which each person \nin the relationship is both a perpetrator and victim of IPV.  The \nPartner Abuse State of Knowledge (PASK) Project, the largest \nmeta-analysis of DV/IPV research ever undertaken, shows that more than \nhalf of all IPV is reciprocal.[1]\n\nThe Dunedin Multidisciplinary Health and Development Study found high \nrates of reciprocal IPV among study participants.  The document \n\"Findings About Partner Violence From the Dunedin Multidisciplinary \nHealth and Development Study\" released by the US National Institute of \nJustice found:\n\n\"When the data were analyzed, victimized women were 10 times more likely \nto be perpetrators than other women and male perpetrators also were 19 \ntimes more likely to be victims than other men.\"[2]\n\nThe National Longitudinal Study of Adolescent Health also found that \nabout half of all IPV is reciprocal IPV.  The study examined differences \nin injury rates between reciprocal and non-reciprocal IPV and found that \ninjury rates are higher in reciprocal IPV than non-reciprocal IPV.[3]\n\nOne of the key indicators of whether a woman will be a victim of IPV is \nwhether she is a perpetrator of IPV.[3] It follows then that one \nimportant way that a woman can avoid being a victim of IPV is to not be \na perpetrator of IPV.  Research by Capaldi has found that this holds \ntrue.[4]\n\nModels that ignore reciprocal IPV can inhibit violent women from \nreceiving the support they need to stop their violence.[5]\n\nWhite Ribbon Australia completely ignores reciprocal IPV as it advances \na gendered narrative. By ignoring the prevalence of reciprocal IPV White \nRibbon Australia is preventing effective interventions as its approach \ndiscounts the need to intervene with violent women. This will contribute \nto the continuation of reciprocal IPV and actually make it more likely \nthat the women involved will be injured. By ignoring reciprocal IPV \nWhite Ribbon Australia is contributing to violence against women.\n\nThe evidence overwhelmingly shows that the approach taken by White \nRibbon Australia is fundamentally flawed.  I encourage White Ribbon \nAustralia to respond, explaining whether the organisation intends to \naddress the shortcomings in its approach to IPV and if so, how.\n\nPlease note that this is an open letter and will be published in various \nlocations online.  In the interests of transparency we strongly \nencourage White Ribbon Australia to publish a response.  From time to \ntime we will report to our readers as to whether a private response has \nbeen received or a public response published.\n\n                 Robert Brockway\n                 President\n                 Australian Men's Rights Association Inc.\n\n[1] PASK \"Partner Abuse State of Knowledge\" project, the largest \nmeta-analysis of DV/IPV research ever undertaken. \nhttp://www.domesticviolenceresearch.org\n\n[2] \"Findings About Partner Violence From the Dunedin Multidisciplinary \nHealth and Development Study\" http://www.ncjrs.gov/pdffiles1/170018.pdf\n\n[3] \"Differences in Frequency of Violence and Reported Injury Between \nRelationships With Reciprocal and Nonreciprocal Intimate Partner \nViolence\" https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1854883/\n\n[4] \"Researcher Says Women's Initiation of Domestic Violence Predicts \nRisk to Women\", discussing the work of Dr Deborah Capaldi. \nhttp://www.huffingtonpost.com/glenn-sacks/researcher-says-womens-in_b_222746.html\n\n[5] \"Domestic violence is most commonly reciprocal\" \nhttp://pb.rcpsych.org/content/35/1/33.1",
    "title": "An open letter to the Chair, Board of Directors, White Ribbon Australia.",
    "subreddit": "MensRights",
    "timestamp": 1511447518,
    "score": 10,
    "keyword": "white director"
  }
]