[
  {
    "text": "I JUST GOT MY DREAM JOB You guys I’m freaking out. I’m going to be the HEAD COACH AT A CERTAIN COLLEGE SPORT. Imma give you a timeline of events. This has been an exhausting process but I’m so happy. So worth it.  \n  \nApplied for a head coaching position in November. I never coached at the college level, only youth and high school. My current job is part time at the club level. They called me in January and I had a brief chat with the athletic director. He said they would email me for an interview. A few weeks go by, nothing. Heard from a friend in our industry that lots of people already had interviews for that job. I decide that’s over.  \n  \nI get a notification on a FB group. Someone posts the same position at a different school.  I immediately message her and apply on indeed. This was Friday evening. I get a call first thing Monday morning from the athletic director. She tells me what she’s looking for and schedules a zoom interview for the next day!  \n  \nTuesday I’m ready for the zoom Interview. I try to log on 10 minutes before but there’s an error. I try and try and still getting the same error. I call the athletic director 5 minutes later and she gives me a new code. STILL DOESNT WORK. I made a post about it here too. I did audio only white she and the other directors of the school are on zoom. The interview goes well but as soon as it ends I start bawling my eyes out. Kind redditors assured me it would be fine (thank you) and I felt a bit better but not exactly hopeful.  \n  \nWell she calls me the next day to schedule an in person interview! But this isn’t your normal interview. There is an itinerary for this interview. I had to meet with the directors, HR, other coaches, and even the athletes. My husband helped me write tons of questions to ask each person. Thank god I did this. It was about 3 hours of these people interviewing me and me asking them questions. My favorite part was meeting with the athletes. They told me exactly what kind of coach they wanted, and I feel like they got to see what kind of coach I was.  \n  \nAt the end, what I took was they could see I was knowledgeable and passionate about the sport, but I didn’t have the recruiting experience which is 70% of the job. I’m willing to learn and expressed that to them the best that I could. I will work my Ass off to get us some good kids. I will travel, do whatever I need to do. I want to learn.  \n   \nSo I wasn’t feeling super great about it because they said they were doing more interviews and I figured anyone applying probably has college coaching experience. I just hoped that she would see I’m not just another coach college hopping. I’m actually passionate about the sport.  \n  \nWellllll.... she did. She called me at 8pm tonight (Sunday evening) and offered me the job. Full time w benefits and all. I can’t even believe it guys I’m still in shock.  \n  \nDONT GIVE UP ON YOUR DREAM. KEEP TRYING",
    "title": "I JUST GOT MY DREAM JOB",
    "subreddit": "jobs",
    "timestamp": 1616384091,
    "score": 468,
    "keyword": "white director"
  },
  {
    "text": "Was the interviewer bringing up my race and gender illegal? I went through three interviews with a government agency. During the third one, the hiring director decided to have \"an honest conversation\" with me. She noted that hiring a white male for the position would be poor optics and wondered how I would react to that. She insisted that our conversation \"was not an interview\" but that she was just giving me intel about the atmosphere to help me make a decision. She also said that she'd get back to me with a formal job offer the following Monday leading me to believe that I was not in fact being (at least formally) evaluated for my conduct during the conversation. However, the interviewer got back to me several days after she said she would and informed me that they decided to go with someone else. The whole experience left a bad tase in my mouth. They told me they would make me an offer and decided not to, it seems to me, clearly based on my responses to questions about my race and gender. And it's not like I said anything abrasive, I just gave a standard PC milquetoast response that I imagine most people in my position would give. I am not trying to play the victim card--I don't think white men are systematically discriminated against in the job market--but I found the whole thing very unprofessional and am wondering now if they crossed a line legally.",
    "title": "Was the interviewer bringing up my race and gender illegal?",
    "subreddit": "jobs",
    "timestamp": 1626745137,
    "score": 81,
    "keyword": "white director"
  },
  {
    "text": "I'm legally blind. I keep being rejected for jobs in the field of mental health when I mention during interviews that I (obviously!) cannot drive a car to transport clients when needed. That's it – I give up! I'm DONE! I'm currently an undergraduate college student in my junior year majoring in Psychology with plans to attend graduate school and get a Master’s degree in mental health counseling to become a therapist (MFT licensure). I live in southern California.\n\nI'm legally blind so I am unable to drive a car. I am completely blind in my left eye and have 20/200 vision in my right. It's blatantly obvious because I wear glasses with one centimeter thick prism-like concave lenses. I have no depth perception nor peripheral vision, but I do have enough functional central vision for ambulatory vision (being able to see objects and move around a room without stumbling or bumping into things) without the need for a white cane. Especially here in southern California where public transportation is nonexistent, not being able to drive makes it nearly impossible to be independent.\n\nI'm trying my best to look for internships or part time jobs where I could work directly with clients struggling with mental health issues. I decided to apply to mental health treatment programs near me (inpatient care, residential treatment facilities, day treatment programs, etc) for direct care staff/mental health technician floor staff positions. I have chosen treatment facilities where clients stay in one place all day long so it's doable for my limitations (i.e, no home based therapy or field based work driving from client to client, so ABA therapy is out of the question – believe me, I've already tried). Every place I have applied to requires a driver's license to transport clients to medical appointments, community outings, etc.\n\nI've managed to land about 7-8 interviews throughout the past month, so I think my resume is pretty good for a college student with limited experience. I do not mention that I am legally blind or anything of that nature on my resume.\n\nHowever, in every single one of these interviews, things go great until I mention \"I'm legally blind so I am unable to drive a car. I do have reliable transportation (paratransit/Uber) to get to work on time and I do not require any additional accommodations otherwise. I just cannot drive clients to appointments or other services in the company vehicle when at the facility. Is that OK?\"\n\nI've received the following responses from the program directors that have interviewed me:\n\n-\t\"Good question. I'm not sure. Let me ask HR and get back to you.\" The next day I was told \"Your interview was great and we'd love to have you, but being able to drive is considered an essential function according to HR. If a client has an emergency and needs to go to the ER or something, staff needs to be able to drive them. I'm very sorry.\"\n-\t\"Sorry. Our insurance company requires that all employees be able to drive for liability purposes.\"\n-\t\"Sorry. We require all of our employees to be able to drive. And no, it can't be another coworker with you who does the driving for you.\"\n\nOne residential treatment center for substance abuse I interviewed at back in January made my blood boil. I was told during the interview that being unable to drive wouldn't be an issue. I was offered the position – signed the offer letter, W-2, direct deposit information, employee handbook, etc and turned in all the hiring paperwork. I was then told to expect an email soon from HireRight to proceed with the background check...3 days passed and I hadn't yet received any emails. Worried, I went back to the website where I had applied for the job – and sure enough, I found the job opening for the exact same position with the exact same shift schedule and pay had been reposted. I called the treatment facility and was told that they had changed their minds, being unable to drive would unfortunately be an issue.\n\nJust today, I followed up with HR about another Residential Aide position I had applied for at a long term residential facility in California specifically for blind adults over the age of 21 with multiple disabilities who cannot live independently. It sounded like a perfect fit! I was interviewed on March 2nd about a Residential Aide position. When I explained that I'm actually legally blind myself and don't have a driver's license, the facility manager told me it wouldn't be a problem because there's plenty of other staff members that can drive if needed. She was so impressed, she offered me the position on the spot and told me that HR would be calling me shortly.\n\nUnfortunately no one ever did, and HR called me Friday morning to inform me that – yep, you guessed it – the position requires a valid driver's license. Umm...excuse me? All of the clients are blind or visually impaired themselves – so that is beyond terribly hypocritical – and it makes my blood boil even more than the last incident described above!\n\nI'm just so frustrated with all this discrimination I'm facing all because I am legally blind and cannot drive a car – all things that are not even within my control. I am well aware that the rate of employment for persons with disabilities (17.9%) is much lower than that of the general population (61.8% as of 2020), but I had never experienced first hand exactly why that is until now. I don't know what to do or who I could contact that would be able to help me with this. I'm on the verge of giving up, quite frankly – and even if my determination wasn't dwindling, there's only so many companies around the area and I'm actually running out of places to apply to!",
    "title": "I'm legally blind. I keep being rejected for jobs in the field of mental health when I mention during interviews that I (obviously!) cannot drive a car to transport clients when needed. That's it – I give up! I'm DONE!",
    "subreddit": "jobs",
    "timestamp": 1617661116,
    "score": 10,
    "keyword": "white director"
  },
  {
    "text": "Does anyone have any tips on how to move on from a traumatic work experience? I was let go from my previous job where the work environment was toxic and systemic racism was around. Even though the organization is a rather small nonprofit, every few months, it seems like someone or groups of people would be let go - and not a lot of people would know why as there were no formal performance reviews ever. Despite that, I spent a few years there building my role and outperforming quite a bit in comparison to other similar roles in other organizations. I did this working extra hours often and covering roles as needed despite not being paid for it, as going above and beyond was the norm. There was a culture of bullying where the executives would judge people on what they wore, their weight and such. They forced people to always be \"positive\" and they wanted things to be sugar coated and a culture of fake happy is promoted. This is in addition to reckless spending that everyone was supposed to be ok with.  Because of this and the fact that people were always being let go, everyone was on edge and when COVID-19 started, that made me on edge too. People started to backstab each other, like one of my direct reports started to backstab me by saying things about me to my superior - that said I have never done anything that betrayed my integrity. This way of management is hidden behind a the mission, and because of the marketing of the mission, funds keep coming in despite poor staff treatment and management. \n\nThe hardest pill to swallow is the advancement opportunities here. As a BIPOC person, I never received any advancement opportunities. However, everyone who is white seems to be advanced continuously. For example, the executive director's assistant was promoted 3 times in 2 years and despite them not having the merit or leadership abilities to really warrant a senior level position. \n\nThe day I was let go, I remember going into the office and a cab was waiting for me outside. It was a 3 minute conversation where they told me my position was eliminated for business reasons and then papers were asked of me to sign. I didn't even have a chance to say goodbye or clean up or anything. It was so traumatic. \n\nI am worried if I move into another role at another organization, I am worried about the following things:\n\n* If I moved into a similar role at another organization, how would I answer why I left?\n* What if I run into the person who takes my role after me, how would I confront them (mind you - the person before me was let go too)?\n* I feel a lot of injustice still, and lots of anger and resentment, but because I signed papers (I learned now that you have to talk to a lawyer before you sign an employment contract and after) I can't say anything to anyone. What can I do to get my justice back?\n* I can't help but blame myself and look for what I did wrong, but I know it's not me. It's just a hard pill for me to swallow.",
    "title": "Does anyone have any tips on how to move on from a traumatic work experience?",
    "subreddit": "jobs",
    "timestamp": 1611509428,
    "score": 10,
    "keyword": "white director"
  },
  {
    "text": "Vent: Still in underemployed pool after graduating 2x from college over 10 yrs ago, found out housekeeping dept at work makes more money than I do. How do I answer these annoying questions... TL, DR: What is the best responses to:\n\n\"Why do you want to leave your current job\"\n\n\"I feel like you would be bored in this position I am hiring for, why did you apply\"\n\nI have no good answers, other than vague stupid answers. Anything else I wanna say sounds like I'm one of those entitled college grads that think they deserve everything like those blogs say to say lol.\n\nAlso:\n\nHow do you prevent the recruiters where you are employed at from coming across your profile on LinkedIn, Indeed, etc to see that you want to work somewhere else?\n\n===================================\n\nGuess I should've skipped college and just went into housekeeping at work since they make more money than I do... mid-30s female minority...also found out a mid-20s yr old white male coworker who has 0 college degrees makes almost $4/hr more than I do, which is understandable coz the average person won't accept such low pay unless they were desperate like me so employer can take full advantage paying low rates. Can't even get a seasonal job at Target, which pays $15/hr, immediately get the rejection letter a few hours after submitting it yet they have signs everywhere they are hiring.\n\n&#x200B;\n\nSo many people quitting and everybody is hiring at all these businesses starting at $15/hr yet I can't get any interviews or even transfer into another department at my employer for entry-level positions that only require a HS degree for departments that require my degrees to get promoted.\n\n&#x200B;\n\nCurrently only make $599 after taxes every 2 weeks. Absolutely pathetic. Have probably sent out over 10k applications since I've graduated college over 10 yrs ago :( I graduated from 1 of the top 5 largest state universities in the US not an unpopular school.\n\n&#x200B;\n\nI'm the most educated person in my department but my coworkers all think I'm lazy since I'm not doing anything with my degrees as if I'm stealing/occupying a position from someone who was not able to attend college smh. They have no idea how much I want to get out of the department. My mgr only has an AA, my director only has a BA in Business Admin, both are like my parents' ages, I have zero interest in either of their positions so I would need to transfer since there are no positions to be promoted to in my dept. Totally grateful the hiring manager 9 years ago took a chance on me before leaving coz I would probably be unemployed all this time.\n\n&#x200B;\n\nWasted time in college changing majors so many times so I missed my 2007 graduation, didn't graduate college until 2009 and then took 3 more classes to finish 2nd BS a few months later when I was 25. Had random part-time jobs after my internship with my state's health department and wasn't able to get a full-time position at the hospital I'm at until 2012 since the economy was so terrible back then. Exhausted all my scholarships and grants so ended up graduating with like $25k in loans that were mostly spent on living expenses, which I'm glad I paid off within 5 yrs after graduating living incredibly frugally since I started paying it off while I was still in school.\n\n&#x200B;\n\nHad hopes and dreams of working hard for about 20 years and saving & investing so I could leanfire around 45 years old but that's not happening with so many years of poverty-level income.\n\n&#x200B;\n\nWhat is the best way to answer \"why do you want to leave your current position\" on the application without sounding like I'm stuck up and entitled? lol ofc I wanna put some variation of \"have a higher income\" lol or \"do less mundane work\". I've just been putting \"interested in other opportunities\" which sounds stupid in itself coz everyone is always looking for other opportunities.  What's the best way to answer this in person?\n\n&#x200B;\n\nHave tried to transfer departments as soon as my 6 months required in current department was met. There are plenty of jobs at my hospital that require my degrees but they also require like at least 1 year of relevant work experience, unfortunately I've been stuck in a department for almost 10 years that doesn't provide any growth opportunities or experiences that are relevant to really anything anywhere.\n\n&#x200B;\n\nUsed to have more interviews when I was in my 20's like every 2 months for the 1st few years. As I've gotten older, I rarely get them, maybe 1 every 6 months now. Some years I had no interviews after hundreds of applications. And when I do get them, the hiring managers are usually like 5-10 years younger & just have just 1 of the 2 degrees I have...so this may be the reason why I rarely get any interviews or the fact that I haven't transfer or been promoted this whole time I've been here, even tho there are no promoting opportunities in my dept, so they probably all think I'm lazy and not worthy of interviewing. I took my graduating years off my resume and thankfully I look like I'm 18 yrs old haha so they don't really know how old I am lol...but given the years I worked near my school in my work history they can figure out approximately how old I am along with the fact that some ppl are starting college at an earlier age nowadays even though I started at 18 lol.\n\n&#x200B;\n\nAlso encounter the ones who flat out say they think I would be bored working in their department near the end of the interview given my education, lol geez if I did I would not even apply. Everything is more exciting than my department! I have no good answers when they say that other than this position I'm interested in is a lot more interesting than my current position, lol.  What is the best way to answer this?!\n\n&#x200B;\n\nSo incredibly discouraging when I come across something like [https://www.reddit.com/r/Fire/comments/pbh1ou/anyone\\_feel\\_like\\_theyre\\_fired\\_even\\_when\\_theyre/.compact](https://www.reddit.com/r/Fire/comments/pbh1ou/anyone_feel_like_theyre_fired_even_when_theyre/.compact) this person is 37, has a wfh job from before the pandemic, makes over 100k and only works several hours a week, has no team meetings to attend, etc. Feels like I've failed at this whole miserable life when I work 40 hrs a wk making literally minimum wage, take myself into work where we are all less than 6 feet away from each other during this whole pandemic smh. Even tho we have no patient interaction, we were not allowed to work from home even though 20% of the hospital is working from home permanently.\n\n&#x200B;\n\n[https://www.burning-glass.com/research-project/underemployment](https://www.burning-glass.com/research-project/underemployment) makes me so miserable with \"A bachelor’s degree has been, and continues to be, the clearest and most accessible path to a good job and middle-class wages. Over the course of a lifetime, the average college graduate makes $1 million more over a career than a worker with just a high-school diploma.\" ... well making just $20k/yr for 45 years is only $900k, pathetic.\n\n&#x200B;\n\nInterested in pursuing a MS but afraid that would put me even more overqualified for entry level positions within the departments I'm interested in. I've taken an ICD coding class, Visual Basic coding class, Clinical Research Trials class, some classes part of a Health Informatics Graduate Certificate program which consist of some masters level classes that were all paid for by the hospital coz they're all reimbursed by the hospital therefore free lol... since they won't let me transfer I guess I will waste their money paying for my classes while I'm bored in my dept lol, but haven't been able to do anything with the knowledge I've gained.\n\n&#x200B;\n\nI wanna move into Health IT/informatics/analytics or biotech or CR or RevCycle areas or really anywhere that's working remoting but they all require relevant experience in addition to educational experience, so no interviews ever after applying to transfer, only rejection notifications. Have looked at bigger cities but I'm not rich enough to fly out for every interview they want to do in person if that happens to happen. Have only gotten a few interviews with the other hospitals in this area. Plus I have banked too much time at this hospital, have over 220 PTO hrs and accrue 8.5 hrs per paycheck. This rate didn't kick in until the 7th year here, before that I was only accruing like 6hr/paycheck. If I was able to switch companies like every 2 yrs like everyone else I wouldn't care, but now I feel sick thinking about starting over at another company, unless it's not unheard of for a company to start a new hire off at something other than a new hire level as part of negotiation of benefits? But I'm a nobody so ofc they won't do that.\n\n&#x200B;\n\nThere's an upcoming like 50 page \"project\" that is probably going to fall into my lap only coz I'm the best with computers in my dept as well as the fastest typer.  This is something I feel like my mgr or director should do just coz they're paid more. Previous coworker who did it for \"free\" has left for a non-healthcare company that pays like 2x as much. I only type like 60-70wpm, faster than that former coworker but nothing lightning fast. I don't want to do it because I know I would still be paid the same with no promotion or raise. There are no merit raises in my department for anyone ever, only hospital-wide raises where everyone goes up 2-3% or so at the same time, so I don't want to waste time doing more when I'm being paid like everyone else in my department. I know merit raises don't exist in my dept because I got 2 different things implemented in the past which improved our workflow, 1 of the 2 made a huge difference in saving so much wasted time and I got no raise. I got a silly paper reward, which is meaningless to me, only after I jokingly mentioned I should I get one from the hospital. I guess that gives an additional thing to talk about during the few interviews I get.\n\n&#x200B;\n\nEveryone here says to post ur profile on Indeed & LinkedIn & etc that ur a job seeker but I'm terrified that the recruiters at my hospital will see that and have HR find a way to get rid of my unloyaltyness so they can fill my position with someone who wants to be in my department. How do y'all deal with that? Its not like u can block certain ppl from viewing your job seeking profile as far as I'm aware of, I don't understand this at all, lol? I wanna put a fake name on my profile so my hospital's recruiters won't come across my profile and know who I am, but then again recruiters from other companies won't be able to verify my employment coz there's nobody in my dept with my fake name lol.\n\n&#x200B;\n\nMy hospital uses the ICIMS platform...I used to get \"Reviewed, not selected.\" nowadays I get \"Submitted, not selected.\" more often in the application updates...I'm not applying for things I don't have the qualifications for, but I guess HR is tired of seeing my transfer applications all the time. I've never had a single interview for a job that requires a college degree, all the interviews I've gotten only require a HS degree.\n\n&#x200B;\n\nLive with my family coz I'm too poor with my crap pay. Have put my life on hold coz I highly doubt anybody wants to date an unsuccessful chick who has not started their career yet working at an \"easy\" job who is almost 40. I haven't had any meaningful dates since like college that wasn't a 1 night stand lol. Afraid of casually dating  and getting too attached in meaningless relationships just to move away from family and end up like [https://www.msn.com/en-us/lifestyle/love-sex/dear-fiona-my-boyfriend-and-i-haven-t-had-sex-in-years-and-barely-talk-but-we-re-just-drifting-along/ar-AAOaxGb](https://www.msn.com/en-us/lifestyle/love-sex/dear-fiona-my-boyfriend-and-i-haven-t-had-sex-in-years-and-barely-talk-but-we-re-just-drifting-along/ar-AAOaxGb) Some days I just want to blow my brains out after dealing with all the ppl who unleash their anger on my dept coz I can't see this ever ending ☹",
    "title": "Vent: Still in underemployed pool after graduating 2x from college over 10 yrs ago, found out housekeeping dept at work makes more money than I do. How do I answer these annoying questions...",
    "subreddit": "jobs",
    "timestamp": 1631082604,
    "score": 4,
    "keyword": "white director"
  },
  {
    "text": "A manager posted on LinkedIn \"We're looking for several persons for Position_that_interests_me_a_lot, send me your resumes directly!\" how do I go about it? Hi, \n\nThe thing is that I don't know a lot about LinkedIn, the post mentioned in the title is for a white collar job in a ministry, and it's really not an entry level job, so I find a disconnect between how informal the director is about the process and the kind of job that is offered, but I really don't want to go overboard and be more informal that required here.\n\nAFAIK, if I want to send someone my resume over LinkedIn, I should connect with them, wait until they accept, then start a conversation and I guess there'll be an option to join a file? Is there a more straightforward process? I couldn't find their professional email on the ministry's website.\n\nAlso, when someone asks \"send your resume directly\" does it mean *just* the resume with maybe a couple of sentences in the message where I attach the file that act as a short substitute for a cover letter, just enough to give my application some context, or should I write a complete cover letter as well?\n\nThanks for any help!",
    "title": "A manager posted on LinkedIn \"We're looking for several persons for Position_that_interests_me_a_lot, send me your resumes directly!\" how do I go about it?",
    "subreddit": "jobs",
    "timestamp": 1620600814,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "Advice to get over this feeling of dread I finally got a job that meet my expected salary after 2 years of searching. I was previously working 8 years in a fashion company and now I’ve moved to health company but still same industry.\n\nThe thing is it’s starting of 3rd week now and I don’t feel anything. I don’t hate the job but I don’t have this passion that I used to have in my previous job in the beginning years.\n\nIt’s now my training week and they gave me a crash course where I need to learn everything in 3-4 weeks and the director has such high expectations of me cos of my background and experience. I feel anxious and worried that I won’t live up to his expectations and have nothing to bring to the table cos the employees here all worked more than 10 years and they’re groomed internally.\n\nI’m not sure if I’m already feel this pressure because of the expectations or because I feel so stupid at the job cos I need to learn from ground up and I feel judged. Cos when u enter a company with a position they always expect u to be fast and know everything and I don’t. I treat myself like a white sheet of paper trying to learn the ropes cos I want a fresh start.\n\nAfter 2 years of rejection, I also learn to survive without a job so while a job is precious to me, I also seem to do what is easy- quit. I’m not sure if I feel this way cos the job or company isn’t for me or it’s me not dealing things well? Any advice on how to cope? My friend has been advising me not to job hop or take the east way out otherwise I will start to like the feeling of not working and this will stay with me for a long time and it shouldn’t Cos I’m already 35.",
    "title": "Advice to get over this feeling of dread",
    "subreddit": "jobs",
    "timestamp": 1615853724,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Waiting for decision for a job I really want (+2 days and counting) I was terminated last December from a hedge fund due to a very toxic fallout (the person doing the firing couldn't look me in the eyes). And I spent about a month and a half after that trying to heal from the situation. I was burnt out going into the job search, and only applied to 2 companies that I was sure would not be toxic (I am in tech so there are always jobs available and almost every well-known place there is reputation of a bro culture). One of them turned out to be a dream job. I never knew I would be excited to work again. Anyways, final round went smoothly, or so I thought, and the recruiter said they'd reach a decision sometime a week later. It's now been 8 days and a follow-up email later, and I still haven't heard back anything. I restarted the application process, now armed with the optimism that maybe I can find a job that I love in an environment that doesn't belittle or despise me. It was hard coming to terms with a job that felt so right was not meant to be yesterday, but I suppose that is a part of life.\n\nEdit (Context): I am an Asian female in STEM. As the only woman on all teams I've been in, it feels like I've been fighting to belong my whole life. Yesterday I watched a tiktok video of a black woman receiving feedback about being perceived as aggressive and threatening despite sitting at a meeting quietly and saying nothing while a white guy jumped up and down and cursed at the same meeting and received no feedback. My problems are probably not as egregious, but I am struggling with the same question: how do you act on feedback that is about what you are instead of what  you did? My mother tells me that it is okay and just do my best. But today when I talked to recruiters that don't see any limits for me and were talking about aiming for directors and principals, I just feel like crying ||\\_\\_\\_\\_||.",
    "title": "Waiting for decision for a job I really want (+2 days and counting)",
    "subreddit": "jobs",
    "timestamp": 1613688212,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "How much of a raise do I deserve? I was hired in Nov 2019 as a Social Media and Marketing Coordinator at the company I work for. 2 weeks after they hired me, they fired the VP of marketing. Leaving me to completely take over the marketing \"department\". My End of year review is tomorrow, and I want to discuss salary. I currently get paid $50,000 base pay, with $1,800 a year for phone/internet, plus many a small bonus around Christmas. \n\nMy original duties were social media content creation and video, pretty much helping with whatever tasks the VP needed. But after they fired him, I was left having to do that, as well as white papers, case studies, blog posts, press releases, magazine articles, email marketing, advertising, partner marketing, presentation decks, literally everything....etc. \n\nI know for a fact that the VP was making $75k a year. But Im 24 and this is my first professional career, and now they're finally hiring a director of marketing and technical writer/marketing manager, so I feel like I will be less important.\n\nHow much should I ask for?",
    "title": "How much of a raise do I deserve?",
    "subreddit": "jobs",
    "timestamp": 1615907653,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture. In 2012, while running for the US Senate, former Missouri House Representative Todd Akin stated, [\"If it’s a legitimate rape, the female body has ways to try to shut that whole thing down.”](https://www.politico.com/story/2012/08/akin-legitimate-rape-victims-dont-get-pregnant-079864)  As someone who [worked for IBM selling computers and ran the maintenance department at his father's steel company](https://news.stlpublicradio.org/government-politics-issues/2012-10-02/akin-embraces-image-of-minuteman-as-he-battles-establishment-including-his-own-party), it clearly gave him the expertise necessary in women's anatomy, biology, and physiology to be able to make this assertion.  Of course, as an anti-choice usurper of rights, what type of man would he be, unless he [physically restricted access to reproductive healthcare clinics for women in need](https://archive.thinkprogress.org/todd-akin-was-arrested-multiple-times-for-physically-blocking-womens-access-to-abortion-clinics-7dda2f38d322/)?\n\nAkin's son, Perry, said, [\"As my father’s death approached, we had people from all different walks of life share story after story of the personal impact he had on them.\"](https://apnews.com/article/former-rep-todd-akin-dead-0a1b944f96eee4b63d9ea57e04c44ca4)  Of this, I have no doubt.  I'm certain that there are millions of women across the globe who would have liked to share the impact your father's life had, and will continue to have, on them.\n\nIn 1990, Lawrence Lockman, a Republican member of the Maine House of Representatives wrote, while serving as director of the Pro-Life Education Association, [\"If a woman has (the right to abortion), why shouldn't a man be free to use his superior strength to force himself on a woman?  At least the rapist's pursuit of sexual freedom doesn't (in most cases) result in anyone's death.\"](https://archive.vn/5cKpD)  Well, in that case, since you make such a perfectly reasonable, rational argument...\n\nIn 1990, Texas Republican gubernatorial nominee Clayton Williams, lamenting poor weather conditions that threatened to cancel a cattle roundup at his West Texas ranch, likened the atmospheric conditions to rape, stating, [“Rape is kinda like the weather. If it’s inevitable, relax and enjoy it.”](https://www.snopes.com/fact-check/personal-foul/)\n\nIn 2018, former US Rep for Iowa, Republican Steve King was asked about his stance of not allowing exceptions for either rape or incest in anti-choice legislation.  He said, [\"What if we went back through all the family trees and just pulled out anyone who was a product of rape or incest? Would there be any population of the world left if we did that?\"](https://www.desmoinesregister.com/story/news/politics/2019/08/14/steve-king-abortion-rape-incest-westside-conservative-iowa-representative-birth-iowa-civilization/2007230001/)  Steve King, everyone; noted critical thinker, [construction worker](http://kingconstruction.net/), and [avowed](https://thehill.com/homenews/house/413601-steve-king-members-of-nazi-linked-party-in-austria-would-be-republicans-if) and [unabashed neo-Nazi](https://www.vox.com/policy-and-politics/2018/6/13/17459908/steve-king-neo-nazi-tweet-retweet).\n\nFormer Republican Senator from Pennsylvania, Rick Santorum, most recently in the news for attempting to erase all remnants of Native Americans from North American soil ([\"We birthed a nation from nothing. I mean, there was nothing here. I mean, yes we have Native Americans but candidly there isn't much Native American culture in American culture\"](https://twitter.com/JasonSCampbell/status/1386685340522536961)), when asked what his views were on abortion in cases of rape and incest in 2012, stated, [\"...the right approach is to accept this horribly created--in the sense of rape--but nevertheless a gift in a very broken way, the gift of human life, and accept what God has given to you...We have horrible things happen.  I can't think of anything more horrible.  But, nevertheless, we have to make the best out of a bad situation.\"](https://archive.thinkprogress.org/santorum-to-rape-victims-make-the-best-out-of-a-bad-situation-a8388910c907/)  Apparently, in the case of rape, it's a gift.  It's a horribly created gift, yet nonetheless, a gift.  However, in the case of incest, it's what?  Just a regular, everyday gift?  A normal byproduct of a fully-functional family life?\n\nAlso in 2012, Richard Mourdock, a Republican candidate at the time running for Senate in Indiana, stated, [\"...I came to realize life is that gift from God.  And I think even when life begins in that horrible situation of rape, that it is something that God intended to happen.\"](https://www.cbsnews.com/news/richard-mourdock-even-pregnancy-from-rape-something-god-intended/)\n\nIn 2014, Montana Judge Todd Baugh sentenced a 54-year-old, admitted child molester, convicted of repeatedly raping his 14-year-old female student, who committed suicide during the course of the trial, to 30 days in jail.  At sentencing, he stated that the victim [\"seemed older than her chronological age\" and was \"as much in control of the situation\"](https://thelede.blogs.nytimes.com/2013/08/29/protesters-demand-montana-judge-resign-over-rape-sentencing/) as her rapist.  One month later, in an interview, he defended his decision, stating, \"Obviously, a 14-year-old can't consent.  I think that people have in mind that this was some violent, forcible, horrible rape.  It was horrible enough as it is just given her age, but it wasn't this forcible beat-up rape.\"  [He also added that her death complicated the case](https://www.usatoday.com/story/news/nation/2013/08/28/teacher-rape-montana/2722817/).\n\nIn 2019, a Tennessee Judge Steven Sword sentenced former pastor, David Richards, to 12 years in prison, 60 short of the maximum prosecutors had sought, for repeatedly having raped his adopted daughter over the course of two years, beginning when she was 14-years-old.  Richards maintained his innocence throughout trial, attempting to portray his victim as a rebellious teenager, who only made the allegations, after he had imposed strict rules for his children.  However, his DNA profile was lifted from a seminal fluid sample recovered from the girl's bed frame.\n\n[The judge, in handing down his lenient sentence, stated that he took into account Richard's longtime ministry, the Bible study he began in jail while awaiting trial, and the community support he received from family, friends, and fellow Christians](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/).\n\nAt sentencing, over 30 friends and parishioners sat on Richard's side of the courtroom in support of him, while only six appeared for his victim.  One of those appearing on behalf of Richards to argue for sentencing leniency, David Thompson, who shared ministerial duties w/ Richards at their church, said, [\"I find it impossible for me to believe he's guilty of this. His business needs him. His family needs him. Our church needs him.\"](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/)  Clearly, his family needs him, since he's such a wonderful father.\n\nAnd, of course, there's the new breed of vitriolic misogynists who, in a single breath, deny rape culture while proliferating it w/ their toxic ideology.  They refer to themselves as \"[Western chauvinists](https://www.splcenter.org/fighting-hate/extremist-files/group/proud-boys),\" but in reality, [they're nothing but neo-Nazi terrorists](https://www.timesofisrael.com/not-nazi-enough-proud-boys-leader-wants-group-to-fully-embrace-white-supremacy/), and [that's all they've ever been](https://www.adl.org/blog/proud-boys-bigotry-is-on-full-display), so don't be fooled by their rhetoric.  They've now taken to wearing suits and ties and [holding yearly conventions that promise to make \"men masculine again,\" while \"Making Women Great Again.\"](https://the21convention.org/)  Since last year's conference was such disgrace, [this year's conference promises to be an even more hatefully misogynistic experience w/ 17 featured speakers, and in a first, they're actually going to allow to women to speak](https://22convention.com/)!\n\n>Women today are being taught to act more like men. Where has that led us? Skyrocketing rates of broken families, a documented decline in female happiness since the 1970s, endless social and dating dysfunction, and America at the #1 spot in the world for single motherhood. No longer will you have to give in to toxic bullying feminist dogma and go against your ancient, biological nature as a woman, great men and women have arrived to help #MWGA.\n\nIt's pretty clear that this toxicity has led to a rape culture that's just intolerable, and this is just a snapshot of what's taking place in America.  [Gender-based violence has rooted itself in some of the most populous countries in the world, and the problem only appears to be getting worse](https://www.atlanticcouncil.org/blogs/southasiasource/understanding-rape-culture-in-bangladesh-india-pakistan/).  In other parts of the world, the abuse of women is absolutely horrific, [akin to something the Third Reich did to Jews in the death camps](https://scholarworks.lib.csusb.edu/cgi/viewcontent.cgi?article=1233&context=history-in-the-making).  In 2016, an [Indian woman from the state of Rajasthan was gangraped by her husband and his two brothers](https://www.indiatvnews.com/news/india-woman-gangraped-by-husband-in-laws-tattooed-with-expletives-over-dowry-336883), then tattooed across her forehead and hands/arms w/ expletives, b/c her family failed to meet the husband's dowry demands.  In 2018, [a 17-year-old Moroccan girl was abducted, tortured, and gangraped by 13 men over the course of two months](https://www.aljazeera.com/news/2018/8/27/morocco-outcry-after-girl-is-raped-tattooed-with-swastikas).  They burned her w/ cigarettes and tattooed her all over her body, including w/ symbols of swastikas.\n\nThis could go on (and on and on and on and on), but there's only so much space available on the Internet.  What's clear is that those who perpetuate this violent culture are the same who propose and legislate the wholly ineffectual laws designed to deal w/ this problem, and they're also those who enforce, prosecute, and adjudicate said laws.  In a sense, it's allowing predators to sit in judgment of predators, while, at the same time, giving them the option to dismiss those they victimize.  I'd say that it's a broken system, except that it's not.  It's a system that's working exactly in the way in which it was intended.",
    "title": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633547326,
    "score": 2038,
    "keyword": "white director"
  },
  {
    "text": "I just saw something really sexist happen in class and I’m not sure how to address it. I’m at university studying music, and one of my classes is to be in a performing ensemble that the conducting students can practice on. The students run the rehearsals but the department directors are there to jump in and give advice or correction if needed.\n\nToday we had two student conductors, a woman originally from China and a white American man. For the half hour the woman conducted, one of the directors basically never left the stage, contradicting her instructions, or just addressing the musicians directly with what he wanted and ignoring her altogether. Me and several other musicians made eye contact like, “what is going on?” Of course, when the male conductor went the director did not say a single word the entire time. \n\nA lot of us in the class are upset but the music business is so based on reputation I don’t know if anyone else would be willing to risk calling them out. The directors are actually nice people and I thought maybe if I just point out to him what happened and how it came across, it might have been completely innocent and something he’d be willing to work on. I’m hesitant to go above his head directly to the administration but I also don’t want this teacher to put me on his shit list if I confront him directly. Does anyone have any ideas on how I should handle this?",
    "title": "I just saw something really sexist happen in class and I’m not sure how to address it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633030127,
    "score": 33,
    "keyword": "white director"
  },
  {
    "text": "Sexist, classist, or both?   I work at a well-known rec center/gym (there’s a song...). Last night, I had to go in to help out with a kids gymnastics class in the gym/basketball court. Since the outbreak, we’ve had court use be by reservation, but people have been sneaking in when it’s empty. \n\n  While we’re setting up, our sweet custodian, an older woman, is kicking out the last couple of ballers and this jerk starts talking back/down to her. He’s going on and on about how he ‘runs a business’ so his time is valuable and he checked the website and nothing was listed for this time so he should get to play. He keeps interrupting her to condescend, so I (gwm) walk over to get bitched at, because IDGAF. \n\n  The sack of smug is all reasonable with me. And why shouldn’t he be? I’m another white male. He doesn’t have to explain how he runs his business or the value of his time because I already know. So I tell him my solution to all member problems: “That is frustrating. I’m not sure what you read on our site, and I can’t change it, but grab one of our executive director’s cards on the way out and let him know so we can get that fixed.”\n\n  As a lady-ally and proud member of the proletariat, it enrages me when women (especially women of color or women who seem ‘working class’) are treated like that. I can’t imagine talking to someone like that. And despite the fact that I’m a dumpster-fire of a person, I’m never spoken to in that manner. I know it’s privilege, and it’s BS. I’m sorry, ladies. You work too hard to have to put up with that crap.",
    "title": "Sexist, classist, or both?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1612913250,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "FBI Director Wray Interview: Capitol Attack, Atlanta Shootings : NPR Direct quote:  \"And while the motive remains still under investigation at the moment, *it does not appear that the motive was racially motivated*. But I really would defer to the state and local investigation on that for now.\"  \n\nWhat now, head of the FBI?  Six of the victims were Asian women.  If it were random, at least half of the victims would be white and half would be men. Why even say that if it hasn't been assessed? Why even say it if he defers to local law enforcement? Because a white guy said it the motive was sex addiction? \n\nPrivilege makes you blind.     \n\nSally Yates for next Director of the FBI.",
    "title": "FBI Director Wray Interview: Capitol Attack, Atlanta Shootings : NPR",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616167011,
    "score": 0,
    "keyword": "white director"
  },
  {
    "text": "John Lewis slams UK education system and offers staff literacy lessons John Lewis Partnership chair Sharon White has said the company will provide basic literacy and numeracy classes to young staff because they have been “completely failed” by the education system.\n\nWhite criticised the UK’s education set-up and said that some of the 16 year olds at John Lewis did not have “functional literacy and numeracy” skills.\n\nShe also warned that children who are less academically inclined are not always able to reach their full potential.\n\n“To have done ten years, 11, 12 years of education, and not having, in many cases, functional literacy, certainly, pretty typically not having functional numeracy beyond the age of, I’d say, ten, 11, means that they may then have fabulous people skills and fabulous skills in terms of operating in a team but that’s almost out with the education system,” White said.\n\nThe Times Education Commission is currently examining the future of education in light of the Covid-19 crisis.\n\nIt will also look at the decline in social mobility, as well as how technology can help improve education for children in the UK.\n\nFormer Labour prime Minister Tony Blair, children’s laureate Cressida Cowell and director of the National Theatre Rufus Norris are among those giving evidence to the committee.\n\nThe year-long commission is set to produce a final report in June 2022.\n\nWhite’s comments came after it was announced earlier this month that John Lewis’ 5000 office-based staff will work from home three days a week.\n\nEmployees will only be required to come into the office for two days a week.\n\n[https://www.retailgazette.co.uk/blog/2021/06/john-lewis-slams-uk-education-system-and-offers-staff-literacy-lessons/](https://www.retailgazette.co.uk/blog/2021/06/john-lewis-slams-uk-education-system-and-offers-staff-literacy-lessons/)",
    "title": "John Lewis slams UK education system and offers staff literacy lessons",
    "subreddit": "Teachers",
    "timestamp": 1625400808,
    "score": 23,
    "keyword": "white director"
  },
  {
    "text": "New student teacher noticing potential racism with cooperating teacher and needs advice Hi everyone,\n\nSo my fiancée just finished her first week of student teaching for her master’s program, and is assigned to kindergarten. She loves her students and has a good relationship with her cooperating teacher, who has been teaching for 5 years and went through the same program.\n\nHowever, my fiancée has noticed that her cooperating teacher appears to treat the one African-American boy in the class more harshly than the others, who are mostly white and Latina. The little boy had a rough first day—as can be expected for a kindergartner on their first day—and from then on, she has described him as “defiant”; which she hasn’t described any other student as. My fiancée has a good relationship with all of the students and says that he’s really sweet, really smart, and has been no more defiant than any other student.\n\nToday, he apparently swept some plastic fruit toys off of a kitchen counter toy—the cooperating teacher claimed as he was looking her in the eyes—and she grabbed him by the upper arm and forcefully sat him in the timeout chair. My fiancée thinks she seems to be overly scrutinizing him—not in an obvious way but in what seems like an insidious, possibly subconscious way.\n\nMy fiancée questions whether her newness to teaching and proclivity for leniency might be clouding her thoughts but it’s gnawing at her—especially given the effects of the pandemic on kids and this having been the kindergartners’ first week of school ever.\n\nShe doesn’t feel like she can tell the program professors or directors because they’re still close to the cooperating teacher, and doesn’t want to overstep with the elementary school principal and staff. She also doesn’t know whether it’s appropriate to bring it up with the parents or with the cooperating teacher—especially as the cooperating teacher is the main person determining her grades.\n\nHas anyone dealt with anything similar, or does anyone have any advice? \n\nThank you so much!",
    "title": "New student teacher noticing potential racism with cooperating teacher and needs advice",
    "subreddit": "Teachers",
    "timestamp": 1630106255,
    "score": 7,
    "keyword": "white director"
  },
  {
    "text": "Marcus Lemonis rewards teachers and staff at his alma mater This is incredible.\n\nMarcus Lemonis donated to his high school, Miami’s Columbus High School, and also gave each staff member $18,000 each!!\n\nFrom The Miami Herald (link below):\n\nTV star and entrepreneur Marcus Lemonis lacks the white beard and red coat, but after announcing Thursday he will give $18,000 checks to each employee at his alma mater, Christopher Columbus High School, many may start calling him Santa Claus.\n\n“It’s hot as s*** out here. I know we’re not supposed to cuss — all right — I will try to be brief about this,” said Lemonis, 48, as soon as he took the stage in front of about 1,600 people during a 9 a.m. schoolwide meeting on the Columbus football field.\n\nThe school administration had told students, teachers and staff to gather for a special guest appearance but hadn’t revealed the details. The last time they all gathered there was two years ago when the football team won the state championship.\n\n“When we think about the people that make this school run, the people that make it tick, the people that take care of the grounds and the classrooms, that teach us, that take care of us, those to me are the most important service providers on the planet,” Lemonis said. “It’s not a glamorous job; it’s not a high-paying job; it’s a job with a lot of stress.\n\n“Today, I’ll be providing a $3.1 million tip to everybody who works here. You’ll be sharing it,” he said. “Whether you’re a school teacher, whether you are in the maintenance department — every single employee will receive a check for $18,000.”\n\nLemonis, who hosts CNBC’s “The Profit,” graduated from Columbus in 1991 and was inducted into the Columbus Hall of Fame in 2015. In August 2020, the school partly named a new facility, the Center for Science and the Arts, after him.\n\nHis donation comes as part of his new initiative, The Great American Tip Off, a nationwide call to action to tip servers across the country.\n\nLemonis will dole out about $3.1 million to cover the one-time payments to the 180 Columbus employees — about 145 teachers and about 35 support staffers. Cristina Cruz, the school’s marketing director, said she couldn’t disclose the average employee salary at Columbus.\n\nAs soon as Lemonis broke the news, the crowd exploded in cheers.\n\n“What the h*** just happened?” said Jannette Rojas, who teaches English at Columbus, 3000 SW 87th Ave. “Oh my God. Oh my God. Oh my God. Is this what kids feel like with Santa? Is this what my kids feel on Christmas morning?”\n\nRojas, 44, has worked at Columbus for about seven years and has two boys, ages 8 and 11. “This the most wow thing that has ever happened,” she said.\n\nErin McGrath, a colleague of Rojas in the school’s English department, described what happened as a “great example” of giving back and following the mission of the school’s Marist Brothers, an international organization of religious men dedicated to education. She has worked at the school for about 13 years.\n\n“If you could’ve taken a picture of my face, it would’ve been a meme,” said McGrath, 36. “My heart is happy. It’s so full. I’m speechless.”\n\nBoth said they would follow Lemonis’ advice and use the money to pay off debt and invest. “Don’t go shopping!” Lemonis had told them a few minutes earlier.\n\nYovani Alvarez, the head of maintenance at the school and an employee of about 14 years, said he wants to invest it for his future.\n\n“I’m very grateful,” said Alvarez, 43. “Very excited.”\n\nSchool will also build two new centers, cancel class Friday\n\nLemonis also announced Thursday he will contribute an additional $7 million to build a college guidance center and a success center for students of disadvantaged backgrounds. Cruz said 35 percent of students at Columbus receive financial aid.\n\nHe requested the guidance center be named after two former teachers of his: Pat Call and Irene Culmo, and the success center after the Desmond family, his former neighbors. They all helped him get to where he is now and he wanted to recognize that.\n\n“Two of the families were school teachers of mine when I went here, and the other family, the Desmond family, is the reason that I came to Columbus. They drove me to school every day. They shepherded me and gave me all of the instructions I needed,” he said.\n\nCall, who taught biology and math at Columbus for nearly 45 years before retiring last spring, said “it was a total surprise” and she was “floored” when Lemonis said he wanted to honor her.\n\nLemonis’ most recent donation of more than $10 million is the largest the private, Catholic, all-male school has ever received since its founding in 1958. Cruz said she couldn’t disclose how much Lemonis has donated on other occasions, but that “he has been a great supporter of the school for many years.”\n\nLemonis was born in 1973 in Beirut, Lebanon. His birth mother dropped him off at an orphanage as a four-day-old baby. His parents, Sophia, a Lebanese, and Leo, a Greek, adopted Lemonis and moved him as a nine-month-old baby to Miami, where they raised him.\n\nAt about 25, after graduating from Marquette University in Wisconsin, Lemonis founded Camping World, which grew from a single store in Bowling Green, Kentucky, to the nation’s largest retailer of RVs, headquartered in Lincolnshire, Illinois.\n\nLemonis still leads the $5 billion-a-year company, which has more than 160 locations across the country, as its CEO and board chairman. \n\nIn “The Profit,” Lemonis finds struggling businesses and offers them cash in exchange for a piece of the profit, then tries to save the venture. In 2022, he will star in another show — The Renovator for HGTV — in which he will help people transform their homes. \n\nBefore he wrapped up Thursday, Lemonis said he had a third announcement that he hadn’t cleared with the administrators, pointing to the school’s president Thomas Kruczek: “There is no school tomorrow!” he said. Kruczek looked at him in surprise and raised his arms.\n\n“Marcus! Marcus! Marcus!” the students chanted. Asked later if he meant it, Lemonis said: “Oh, they’re definitely having school off tomorrow — I’m going to lock the fence, the door.”\n\nCruz confirmed afterward that the school canceled classes for Friday.\n\nRead more at: https://www.miamiherald.com/news/local/education/article256436921.html#storylink=cpy",
    "title": "Marcus Lemonis rewards teachers and staff at his alma mater",
    "subreddit": "Teachers",
    "timestamp": 1639503276,
    "score": 4,
    "keyword": "white director"
  },
  {
    "text": "Afterschool care--Child feeling underrepresented? Hi all! I'm hoping to get some advice or directions to resources to help me talk to a specific student about race. For context, I am White and the student is Black/mixed, so I want to make sure I can answer her questions in a manner that is situational appropriate, knowledgeable, and sensitive, so that she feels supported.\n\nFor context, I am currently working at an elementary afterschool program in a \\*heavily\\* White state. We are one of the most diverse schools in the state, and there are many BIPOC children in the program, but in the Kindergarten group where I work, of the everyday students, only this one girl is mixed, and the rest are White. One of the directors of the program is Black; but other than that, all of our staff is White, and I believe most if not all of the regular school staff is as well.\n\nThe one girl I mentioned has started asking questions about \"Why aren't there any Black teachers?\" and the like, and I want to give her solid, age appropriate answers, but have been finding myself somewhat unsure of what to say. My instinctive internal answer is along the lines of \"there is still inequality and discrimination, and although this program tries to address this by incentivizing applicants of different identities and backgrounds, there just aren't many BIPOC people in the area\" but that seems a bit discouraging/like its never going to happen, and I feel like telling a 5 year old \"this is just how it is\" is a bad approach on several levels. Because of that, I've kept more to just validation, saying \"you're right, there aren't many Black teachers here and we should have more\" but she doesn't seem satisfied with that answer (considering she keeps asking) and I am not entirely sure what else to say. I've also tried to help her feel represented in other ways--the district \\*does\\* try with diversity, so we have plenty of books with Black characters and written by Black authors, coloring pages with popular characters from those books, etc, which I have been making an effort to request as afterschool materials we can use. \n\nHowever, I still feel like there must be ways to answer her questions at least a little more directly, instead of always deflecting. She's very smart and very self-aware, so my inclination is to try and give her a real answer, but she's also five, and one student among around 10 that I am responsible for, and we are only together for a few hours every week. I don't want to oversimplify a complex situation, but I don't know that I have the time or ability to really get into it. I have also passed all of this on to my director, who clearly sympathizes very closely and personally, but does not have the time to do much more than pick out some books for us to read together. \n\nSorry this post turned into something so long and rambly--TLDR; White afterschool staff, Black Kindergartener, how to talk to her about the lack of diversity she sees at school.",
    "title": "Afterschool care--Child feeling underrepresented?",
    "subreddit": "Teachers",
    "timestamp": 1621387740,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Moving upward in industry vs. returning to the family business -- Any advice? Currently trying to decide on what to do with a new situation. Thanks to anyone trying to weigh in or lurking.\n\nI (M/25) was recently informed of an upcoming open position for a director level job at an industry non-profit by an old boss of mine who told me to apply. The interview for the position is Wednesday. The total comp for this job should be around 80k-85k. I would be working in advocacy for statewide healthcare and other industry programs. On the other hand, my father has offered me a manager position at the family agriculture business, total comp would be slightly lower. The plan is to purchase the business from him down the line with siblings, approximately 3 - 4 years. This pathway would be the best chance at making a high net worth relatively faster.\n\nInitial thought process is I don't have a particular love of the family business. Maybe some anxiety from my youth, but it would be based around horticulture operations in a blue collar environment at a new location, minutes away from the old one. Completely different from my current industry.  The director position would be in a white collar environment and managing a larger operation with more support staff and more responsibility, more stress, etc. \n\n I'm wondering if anyone has been faced with similar decisions? Maybe the route they took or if anyone has constructive advice. Thanks in advance!\n\nP.S. At this time, there won't be anymore good entry points down the line for the family business, unless drastic actions occur.",
    "title": "Moving upward in industry vs. returning to the family business -- Any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1630977135,
    "score": 2,
    "keyword": "white director"
  },
  {
    "text": "Any suggestions on career options? I would like to take what transferable skills I have and find a career that offers more pay and possibly remote. Thinking about Netsuite admin or other CS avenues. Not really sure about additional schooling. I have mostly done production work in the recent years and am aging out. Thanks for any advice.\n\n**Experience**\n\nWhite Labs\n\n* Fulfillment Lead\n* Inventory management (Netsuite)\n* Efficient management of packaging line and staff\n* warehouse organization\n\nBartlett Tree Experts\n\n* Plant Health Care Specialist\n* Customer Service, Sales, and Treatment Recommendations\n* Ornamental and Structural Pruning\n* Soil testing/ Management\n\nAnonymous Mountain Lodge\n\n* Vegetable Garden Production for kitchen\n* General Maintenance (electrical, plumbing, painting, carpentry)\n* Hiking Trail Maintenance and Landscaping\n\nAnonymous Farm\n\n* Farm Manager\n* Market Sales\n* Greenhouse Operations\n* Orchard Care\n\nEmployment Solutions\n\n* Direct Support Professional and Activities Director for Adults with Developmental/Intellectual Disabilities\n* Horticulture and Art Therapy Program Coordinator for Adults with Developmental/Intellectual Disabilities\n* Produce Warehouse Manager (job skills training in food production for adults with disabilities)\n\n**Education**\n\nWestern Kentucky University Interdisciplinary Studies, Social Sciences\n\nBachelor of Arts May 2010\n\n**Transferable Skills**\n\n* Netsuite experience\n* OSHA 10 certified\n* Microsoft Office certification\n* Problem solving\n* Organizational\n* Leadership",
    "title": "Any suggestions on career options?",
    "subreddit": "careerguidance",
    "timestamp": 1614173514,
    "score": 1,
    "keyword": "white director"
  },
  {
    "text": "Tips for going out on your own I’m manager level at a big 4, looking to go out on our own with a senior manager and director. \n\nDirector is well connected, can sell and knows how to run a business (basically ran the consultancy I worked for previously, that a big 4 bought, where we work together now).\n\nSen manager is super technical, absolute gun at delivering in our space. Not much of a seller (specialist technical manager)\n\nMyself, all rounder, like being on the tools and delivering but also really enjoying selling work.\n\nWe know our trade well (data and analytics) and we know what areas and market segment to sell to. We literally tially have an opportunity to act as a white label for another big 4 after some prodding and conversations. We will also be partnering with Microsoft for azure implementations etc. so should expect good work flowing from them.\n\nIv always wanted to go out on my own, run a business etc. I have always worked  stupidly hard for other people, so I think I will go nuclear knowing I can directly effect my income based on my inputs to the business etc. \n\nAnyone done this? Specifically interested in anyone who’s white labeled before? Or had a shit experience as an MS partner",
    "title": "Tips for going out on your own",
    "subreddit": "consulting",
    "timestamp": 1626786961,
    "score": 3,
    "keyword": "white director"
  },
  {
    "text": "Help dealing with a super toxic/ racist work environment For background im black 23 year old Muslim woman and work for a super large media company based in London.  Its my second corporate job after university.  My last role was for the same company but in a start up section (if that makes sense) and the vibe was super chill.  We could work from home, the director wore jeans and t shirts and everyone was super chill and pretty diverse.\n\nI have now moved to a different role in the company in the main area of business and it is super corporate.  It is mostly white and most of these people are straight out of Oxford and private schools.  I am the only black woman out of 90 people and 1 of 2 black people and I cannot help but feel like I stand out especially because in my old team I had a older black woman who acted as my big sister.  In my first week whilst on a call with the Italian and German markets they remarked they could not have a 'black man' in a TV ad as it doesn't work in their markets I had my camera off so they weren't aware a black person was  on the call ( my name is generically ethnic) however I was told this was going to be taken very seriously and had a meeting with my team director who remarked that he was indian and one of the people on the call had a black husband.  This made me feel super disheartened as they were once again resorting to the black friend trope but I tried my hardest to move on.\n\nThe next week I was sitting in a communal area when another director was speaking to two white colleagues, he remarked that he used to live in a area of North London ( which is very nice but has a significant black population) and joked that he called the area stab central before laughing.  This hit very close to home as I am from a neighbourhood where stabbings are unfortunately quite common, one of my friends was stabbed a couple of years ago and now is paraplegic and my younger sister witnessed a classmate being stabbed to death on the train and is still traumatised.  This white privileged man joking about London's stabbing epidemic made me so mad and disgusted and I spoke to a colleague who was active in the diversity network (east asian male) about how horrified I was.  He proceeded to say that this kind of language is normal and he has heard way worse, so much for POC solidarity.  I spoke to a colleague and she said it was horrible but I don't think anything is being done about this. \n\n I am 3 weeks into the job and honestly I feel like the environment is so toxic I don't think I can last much longer.  What should I do, its a very hierarchical organisation so people will be scared to talk against directors if I need witnesses and such but I really don't want this to be swept under the rug and I really want to make things better for the other young working class black girls coming up after me. Any advice is appreciated.  Thanks so much!!",
    "title": "Help dealing with a super toxic/ racist work environment",
    "subreddit": "blackladies",
    "timestamp": 1638981406,
    "score": 17,
    "keyword": "white director"
  },
  {
    "text": "Johnnetta B. Cole (84) & Tiffany D. Loftin (32) have an amazing intergenerational conversation https://www.facebook.com/watch/?v=516562173062841\n\n- Dr. Johnnetta Betsch Cole is an American anthropologist, educator, museum director, and college president. Cole was the first female African-American president of Spelman College, a historically black college, serving from 1987 to 1997. She was president of Bennett College from 2002 to 2007. During 2009–2017 she was Director of the Smithsonian Institution's National Museum of African Art.\n\n- Tiffany Dena Loftin was the National Director of the NAACP Youth & College Division at the NAACP.  She was appointed by President Barack Obama to serve on the White House Initiative on Educational Excellence for African Americans in Higher Education",
    "title": "Johnnetta B. Cole (84) & Tiffany D. Loftin (32) have an amazing intergenerational conversation",
    "subreddit": "blackladies",
    "timestamp": 1619671246,
    "score": 3,
    "keyword": "white director"
  },
  {
    "text": "Need Advice About Reasons for Wanting to Leave Job? Hey lovelies!   \n\n\nFirst off, just want to thank this sub for being so wonderful and positive. I've been dealing with some dark days lately and coming here usually ends with me feeling a little better, so I thank everyone for making that happen here.  \n\n\nI need some advice, and I find because of certain reasons, I have no one in my life I can ask, so I thought I could seek some advice from yall! Without revealing too much about myself, I currently work at a startup that helps small musical acts with their online presence. Like with most startups ran by predominately white people, I have dealt with microaggression after microaggression since being there (ie - I had to tell my very white boss not to call me 'girl' when he messaged me tasks to do), but I was able to work throughout the pandemic at home with no issues, so I felt guilty and try to express my gratefulness while trying to quell any complaints I've had for the past year.\n\nMy boss and I managed most of the talent that comes to our company, and recently, we had a \"controversial\" (racist) white musician who joined our roster. Normally my boss and I vet these people before bringing them onboard, but with this guy, my boss communicated privately with him/his team and didn't tell me about it until after he was already within our company. I was more than pissed but I figured since he's my boss, he ultimately gets the final say and brushed it off. I did complain about it to a coworker though, who then brought it up to a director and asked me to talk to him about it (he apparently didn't know about the musician either). We did, and from there the director and my coworker brought it up to our leadership team. I wasn't present in the meeting, but when the news of the musician came up, I was told near everyone questioned the decision and why we needed him. The ones who opposed the criticism? My boss and another director, both of whom essentially said, \"Well, he's not saying the N-word, so is it really racist??\" (this became really insulting when, after doing a little digging, I found out this musician is connected to this right-wing media group)  \n\n\nI can't deny it hurt me a lot hearing about that (myself and two other coworkers are the only Black people in the company). Coworker A, who was in the meeting, also tried to defend them a bit, saying they didn't mean it that way and are well-meaning idiots, but I had to break it down to her why something like that is offensive to hear even through the grapevine. Now it's become a thing where I've been asked to meet with leadership and \"help\" them vet people like this better and make sure they're up to speed with their anti-racism training, but tbh, I really don't want to do that. It just makes me feel like a token even more than I already do. My boss hasn't said anything directly to me, but I have noticed he's been \"nicer\" to me - asking for things instead of telling, thanking me more, etc. Honestly, it's been tripping me up a lot and making it hard to focus on work. I have begun looking for another job (and even managed to score an interview), but I feel defeated and worry I'll still run into these types of issues regardless of where I go.  \n\n\nMy question to you all - with this in mind, do you think it's worth looking for a new opportunity? My biggest hesitance is that we're still working from home and might continue to do so for the rest of the year, and that works better for me because I run errands during the day for my family and take care of my dog, so I don't want to jump into new work that might require a huge schedule change. Plus, I can't deny, I feel like a failure leaving because I was fired from a job before joining this one. But I'm not sure how much my mental and emotional well-being can take - I dread even getting up and seeing my boss's name on emails, and the weird gaslighting going on between my boss, my other coworkers, and I is driving me up the wall.  \n\n\nThanks yall for reading this word vomit and I appreciate any advice any can spare! Thank you!",
    "title": "Need Advice About Reasons for Wanting to Leave Job?",
    "subreddit": "blackladies",
    "timestamp": 1624401911,
    "score": 3,
    "keyword": "white director"
  },
  {
    "text": "The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead",
    "title": "The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead",
    "subreddit": "asianamerican",
    "timestamp": 1617918532,
    "score": 108,
    "keyword": "white director"
  },
  {
    "text": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community Related post: [Bao Tran: Hollywood Wanted Me to Make My Martial Arts Characters White, But My Ancestors Wouldn’t Have It](https://np.reddit.com/r/asianamerican/comments/n6vh71/bao_tran_hollywood_wanted_me_to_make_my_martial/)\n\nNotes from [Well Go USA's press kit](https://www.wellgousa.com/films/the-paper-tigers):\n\n**DIRECTOR’S STATEMENT**\n\nTell someone you’re making a Kung Fu movie and everybody has a clear idea of what they’re in for. For a  genre that has such vivid connotations also comes preconceived expectations and, dare I say,  stereotypes.\n\nA Kung Fu movie about out-of-shape fighters should have been easy for us to finance, but it took us 9  years of conversations like this:\n\n**Savvy White Financier**: “I love the Kung Fu movies. Love the wirework where they fly around, so  cool.”\n\n**Me**: “Great. Except we’re not doing wirework, our characters are schlubs past their prime. We want to  show them struggle with gravity, not defy it.”\n\n**SWF**: “But you gotta have the dubbing, that’s so hilarious.” \\*mimes dialogue while contorting their  mouths\\*\n\n**Me**: “Yeah no, our characters speak English in their own voices without any accents.”\n\n**SWF**: “They’re all American?”\n\n**Me**: “Ensemble piece with Asian and Black American lead characters. See, it’s a reflection of how I grew  up in Seattle…”\n\n**SWF**: “Can you change them to be white?”\n\n**Me**: “Hm. Okay. Well, this is about characters stuck between two cultures. The Kung Fu world is steeped  in Confucian, arcane, hierarchical values that is so at odds with modern American sensibilities.”\n\n**SWF**: “Bruce Willis!”\n\n**Me**: “Sorry?”\n\n**SWF**: “If you get Bruce Willis, we’ll fund your movie. Right now it’s too risky with no real names  attached. There’s no bankable Asian or Black stars that can sell your movie.”\n\nThen you have the militant fellow Asian American:\n\n**Militant Asian American:** “Why are you setting our people back? Hollywood has only portrayed us  Asian men as Kung Fu masters or Triad henchmen. We have to tell different stories.  #RepresentationMatters!”\n\n**Me:** “But I like Kung Fu. And Jackie Chan was really the one who inspired me to make movies.”\n\n**MAA:** “No, you need to do something like The Farewell or Saving Face. You know, real Asian American  experience stories.”\n\n**Me:** “Can’t we do it all and support each other in telling whatever stories we want to tell? This is not  Highlander, there can be more than one.”\n\n**MAA:** “You’re just perpetuating stereotypes. Bullies used to call me Bruce Lee and tease me because  they thought all Asians could do Kung Fu.”\n\nSo if your tribe doesn’t find you, you go out and build it. We eventually turned to Kickstarter and our local  community of private investors. The ones who “got it” recognized themselves in the story and/or Asian Americans in lead acting, producer, and director roles. But through it all, we always aimed for more,  hoping to expand the idea of what a Kung Fu movie or an Asian American film could be.\n\nI found this in my old director notes, written for various grant proposals or some investor documents  throughout the years: “We want that blue-haired grandma in Iowa, who has not a mean bone in her  body, to root for Danny by the end of the movie.”\n\nAt the end of the day, you can’t please everyone, but watch us try. Grannies of Iowa, be ready!\n\n\\--\n\nBao Tran",
    "title": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community",
    "subreddit": "asianamerican",
    "timestamp": 1622247264,
    "score": 9,
    "keyword": "white director"
  },
  {
    "text": "Quoc Bao Tran's \"The Paper Tigers\" movie screening locations and streaming options for next week * [List of screening locations](https://www.facebook.com/tranquocbao/posts/10161539002213636) - Opens May 7\n\n(The director will update that post if he adds more confirmed theaters)\n\nStates not in alphabetical order. Cinemark also has an option to book a screening for yourself and a group up to 20 people for $149\n\n\n**Rental streaming options:**\n\n* Apple TV / iTunes\n* Prime Video (Amazon)\n* Google Play / YouTube Movies\n* Vudu\n* Microsoft Store / Xbox\n* Sony / PlayStation\n* FandangoNOW\n* Comcast Xfinity\n* Charter / Spectrum\n* DirecTV\n* AT&T U-verse\n* Cox Communications\n* Verizon\n* Frontier Communications\n\n**Other info:**\n\nYuji Okumoto from The Karate Kid 2, Cobra Kai is one of the producers and guest appearances. Other appearances include MartialClub (YouTube), Roger Yuan and other martial artists.\n\n**Previous threads:**\n\n* [The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead](https://np.reddit.com/r/asianamerican/comments/mn2exb/the_paper_tigers_may_7_crowdfunded_martial_arts/)\n\n* [The Paper Tigers - Kickstarter for Kung Fu Indie Film](https://np.reddit.com/r/asianamerican/comments/9tdb74/the_paper_tigers_kickstarter_for_kung_fu_indie/) - The director posted on here a couple years ago with their Kickstarter",
    "title": "Quoc Bao Tran's \"The Paper Tigers\" movie screening locations and streaming options for next week",
    "subreddit": "asianamerican",
    "timestamp": 1619540356,
    "score": 9,
    "keyword": "white director"
  },
  {
    "text": "UK: Two men at ad agency JWT win sex discrimination case after gay female director vowed to 'obliterate' Mad Men reputation of being full of 'white, straight men'",
    "title": "UK: Two men at ad agency JWT win sex discrimination case after gay female director vowed to 'obliterate' Mad Men reputation of being full of 'white, straight men'",
    "subreddit": "MensRights",
    "timestamp": 1627064612,
    "score": 712,
    "keyword": "white director"
  },
  {
    "text": "Some common gender myths and their rebuttals It seems like the same discussions come up around Reddit a lot, so I figured I'd gather up some common topics, and their rebuttals.\n\nMany of these arguments can be expanded with more points and sources but I'm trying to keep this as compact and to the point as possible.\n\n####Myth 1: \"Sexism against men is never institutional or systematic\"\n\nMany forms of sexism and discrimination against men are *explicitly* institutionalized or systemic in society.\n\nExamples include police violence, court biases, incarceration, child custody discrimination, military service, educational biases, health research and spending, insurance, housing discrimination, reproductive rights, bodily autonomy rights, and many others.\n\nThe widespread ignorance and denialism around these issues can itself be interpreted as a form of systemic discrimination against men as well.\n\nNote that some of these are institutional because they boil down to statutory legal rights which exist in the realm of government policy and administration.  And the government is obviously an institution.\n\n#### Myth 2: \"Most politicians and CEOs are men, and this has led to a society that privileges men and disenfranchises women\"\n\nThe fact that many positions of formal power are occupied by men does not translate into measurable privileges for the average man.\n\nThe assumption this is based on is the idea that men have an in-group bias and prefer other men over women.\n\nWhich is an idea that has been debunked over and over again in the academic literature.  The gender bias among men is almost zero, and sometimes manifests as an out-group bias sightly in favor of women, not other men.\n\nIn-group bisses do exist among women though.  In fact some research has found evidence for very strong gender biases among women.  Including when it comes to educators, bosses, and hiring managers.  Women in formal positions of power do actually seem to prefer other women over men, in much the same way that men are accused of behaving. So maybe this is just projection: people who themselves have gender biases assume that everyone else does as well.\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/15491274\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0022103101915112\n\nhttps://link.springer.com/chapter/10.1007/978-3-030-04384-1_9\n\n####Myth 3: \"Women were uniquely oppressed in history compared to men\"\n\nMuch like today, sexism in history was often two sides of the same coin.  If it was unfair that women had to stay home and take care of their children then it was also unfair that men had to work long hours outside the comfort of their homes.  Many people try to equate sexism to the history of racism, as if men were unilaterally oppressing women for their own benefit. And that's simply not an accurate view of history (nor is it a very healthy belief to have).  \n\nGender norms were often unfair to women. But for most of history, women could own property, get divorced (where they usually took most of their husband's money), run businesses, and even be heads of state.  Many large empires were ran by women, for example.\n\nThe reality of the situation though is that pregnancy (and breastfeeding) often dictated the need for women to have men supporting them. Birth control and baby formula didn't exist. So your options were basically abstinence, or marriage. Which was the same choice that men also had.\n\nhttps://books.google.com/books/about/The_Privileged_Sex.html?id=4szznAEACAAJ&source=kp_book_description\n\nhttps://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article\n\nhttps://www.oxfordhandbooks.com/view/10.1093/oxfordhb/9780199582174.001.0001/oxfordhb-9780199582174-e-036\n\nhttps://archive.org/details/legalsubjection00baxgoog/\n\nhttps://www.marxists.org/archive/beard/woman-force/index.htm\n\nhttps://pdfs.semanticscholar.org/1855/f217b082603d0ab37ea80c4741fceb8a4a23.pdf\n\n**\"What about voting rights?\"**\n\nVoting rights were historically tied to military service and the draft. It was never something that men got \"for free\" just for being men.\n\nIn England, most men couldn't vote until 1918, and that was only because they instituted a draft for all men during WWI.\n\nWomen aged 30 and older were also given the right to vote in 1918, and this came without the same obligation to serve in the military that men had.  Women over 21 were given voting rights just 10 years later in 1928, which was the same age that men could vote.  And that temporary age difference had a practical purposes: so many men died in WW1 that there was a need to even out the gender ratio.\n\nSo men have been allowed to vote for a whopping 10 years longer than women, *at most*.  And that was only because of the mass, involuntary slaughter that they experienced around the world during WW1.\n\nOther obligations that men had were paying taxes, attending caucuses, and signing up for bucket bridges to fight fires.\n\nIt took a few decades in some parts of the world for people to decide that it was fair for women to be able to vote without giving anything back to the state, but I think it's important to understand the context here. It wasn't misogyny or oppression but political theory.  Specifically the question of whether or not it was fair to give women voting rights without equivalent responsibilities that were required from men (something known as a [moral hazard](https://en.wikipedia.org/wiki/Moral_hazard), and that can be contextualized as *\"female privilege also sometimes harming women\"*).\n\nhttps://www.parliament.uk/about/living-heritage/transformingsociety/electionsvoting/womenvote/parliamentary-collections/collections-the-vote-and-after/representation-of-the-people-act-1918/\n\nhttp://www.familyofmen.com/when-did-men-and-women-have-the-right-to-vote-in-canada/\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/iu2ebj/women_could_and_did_own_property_and_have_rights/\n\nhttps://www.reddit.com/r/LeftWingMaleAdvocates/comments/l1byes/suffrage_was_primarily_a_class_issue_not_a_gender/\n\n####Myth 4: \"Domestic violence and sexual assault are primarily women's issues\"\n\nDomestic violence and sexual assault affects everyone, and at nearly identical rates between men and women.\n\nIn the US, roughly 37.3% of women have been victims of domestic violence, stalking, sexual harassment, and sexual abuse.  Including 1.4 million women who experience sexual assault annually.\n\nFor men that same figure is 30.9%. Including 1.7 million men who experience sexually assault annually (defined as \"made to penetrate\").  The vast majority of these men are also victimized by women, not by \"other men\" (which is another myth).\n\nThis pattern is similar across the world, including in poor and underdeveloped nations (see [here](https://www.reddit.com/r/MensRights/comments/koinom/some_sources_on_the_sexual_abuse_of_men_and_boys/) for a collection of studies), and is consistent with a wide range of research demonstrating \"gender parity\" between men and women for this topic.\n\nhttps://www.cdc.gov/violenceprevention/pdf/NISVS-StateReportBook.pdf\n\nhttp://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf\n\nhttps://1in6.org\n\nIt's also not true that there's a significant difference in severity between male and female victims.  Around 66% of intimate partner homicides do have women as victims (which is hardly a staggering majority), but when you include intimate partner related suicide deaths (including assisted suicides), a greater number of men are killed because of domestic violence than women.  These statistic also ignore the fact that lesbian relationships are more violent than heterosexual and gay male relationships.  Which inflates these numbers and doesn't necessarily back up the idea that women are being uniquely victimized by men.\n\nWe should obviously work to fight against abuse in any form, but our current, gendered approach to this doesn't seem to be helping very much.  It is also commonly used as an excuse for misandry.  Many people who discuss abuse against women do not actually care about female victims.  All they care about is advancing a culture of hatred and sexism against men.\n\nhttps://web.csulb.edu/~mfiebert/assault.htm\n\nhttps://www.emerald.com/insight/content/doi/10.5042/jacpr.2010.0141/full/html\n\nhttps://www.frontiersin.org/articles/10.3389/fpsyg.2018.01506/full\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/f4rvop/some_sources_on_the_severity_of_domestic_violence/\n\nhttps://www.reddit.com/r/MensRights/comments/koinom/some_sources_on_the_sexual_abuse_of_men_and_boys/\n\nhttps://www.reddit.com/r/MensRights/comments/f5tes5/gender_parity_for_sexual_assault_academic_studies/\n\n**\"But women are afraid to walk down dark alleyways at night!\"**\n\nAs they should.  And as do men.  Most violent crime targets men. And fear is subjective. This is hardly evidence of some kind of unique oppression against women (at least one that doesn't also affect men), and it ignores the fact that men are usually afraid of finding themselves in those same situations as well.\n\nMen are stronger and more capable of defending themselves so I wouldn't blame someone for having gendered views or assumptions here.  But let's try not to minimize male victimization or blame it on things like \"male oppression\".\n\n####Myth 5: \"False allegations are extremely rare\"\n\nMultiple studies have found alarmingly high rates of false allegations in society.\n\nAs many as 1 in 7 men have been falsely accused at some point in their life, and they often have to live with those allegations even after proving their innocence.\n\nIn addition, around 1 in 20 women have also been falsely accused at some point during their life.\n\nFalse allegations are particularly common when it comes to child custody and divorce, where well over half of all allegations have been estimated to be false.  There is also a common racial element that targets minority men.  Especially in history during the era of lynchings in the US.\n\nhttp://www.saveservices.org/dv/falsely-accused/survey/\n\n http://www.prosecutorintegrity.org/pr/survey-over-20-million-have-been-falsely-accused-of-abuse/\n\nhttps://quillette.com/2019/04/16/divorce-and-the-silver-bullet/\n\nhttps://www.gutenberg.org/files/14977/14977-h/14977-h.htm\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/e6w4yc/i_call_bullshit_on_the_false_rape_accusation/\n\n####Myth 6: \"Men commit suicide more often than women, but women still *attempt* suicide more often than men\"\n\nThis idea has its origins with faulty hospital reporting which lumps suicide attempts in with self-harm (which is something that's more common among women).  Women are also more likely to report their suicide attempts than men. And even if this statistic were accurate, it ignores the obvious fact that a suicide survivor can attempt again, thus artificially inflating this statistic.\n\nThe fact is, most suicid deaths are men, and most evidence points to there being more unique attempts by men. Any evidence that men are \"better\" at it than women has been interpreted as evidence for greater motivation of success, due to the very same factors that lead them to attempt suicide to begin with. Not as evidence that women are somehow attempting suicide at rates similar to men in the background.\n\nhttps://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-017-1398-8\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/cvpyve/comment/ey5xeda\n\n####Myth 7: \"Men make more money because of their gender, and this is evidence of male privilege\"\n\nExisting gender norms encourage men to earn money in order to meet the financial demands that are placed on them by women.\n\nThis causes them to work harder and sacrifice more for their careers than women. Which they do in part because their income is tied to how successful they are with women, and whether or not they qualify as \"marriage material\".\n\nThe wage gap is therefore an example of a gender norm that harms men just as much as it does women.\n\n92% of workplace deaths are men. Men work on average an extra 4 to 10 hours a week (depending on your source) than women. They start working at a younger age (often skirting child labor laws). They retire later (which is also during their peak earning years). And they die sooner than women. Men have worse health outcomes than women and that's largely because of the pressures that society puts on them to be successful and earn money to spend on women.\n\nThis is the other side of the wage gap that is equally as important, and that is equally as harmfully to men as it is to women. And it's really just the tip of the iceberg.\n\nIn many ways the wage gap is just a reflection of the financial exploitation of men in society.  Which is facilitated by things like hypergamy and unfair marriage and divorce practices.\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/kzvfcg/about_the_wage_gap/\n\nhttps://www.reddit.com/r/MensRights/comments/dxaimc/the_wage_gap_is_created_by_women_and_reflects/\n\n####Myth 8: \"Men don't go to the doctor because of toxic masculinity\"\n\nThe main reason that men sometimes don't seek help is a lack of time to see a doctor.\n\nMen work longer hours than women at jobs that are less flexible, and more stressful, than jobs that women usually work at. [Men overall engage in an extra hour of paid and unpaid labor per day compared to women](https://www.pewresearch.org/fact-tank/2019/06/12/fathers-day-facts/ft_18-05-01_fathersday_time/), and an extra 45 minutes commuting to jobs that are further away. Meaning men on average have quite a bit less free time to go see a doctor than women do.\n\nThis is also something that changes during retirement: retired men are just as likely to go to the doctor as retired women.\n\nhttps://bmjopen.bmj.com/content/3/8/e003320\n\nA general lack of help and support, especially financial support, for men who need medical help also contributes to this.  There is a myth that men are better taken care of than women which has resulted in gendered policies that help women, but exclude men.  Even though it's men who often need that help more.\n\n####Myth 9: \"Men don't speak up about sexism as much as women, so it's obviously not as big of an issue\"\n\nThis is because people are less likely to care or listen to them. In part because many men who do speak up are silenced and accused of being misogynistic. A situation known as testimonial injustice or [epistemic oppression](https://newdiscourses.com/tftw-epistemic-oppression/).\n\nMen are told to keep quiet and many end up internalizing the idea that only women can be discriminated against, since this is what society tells us to believe.  Instead, men often adopt different terminology when they discuss gender issues.  Like referring to differences in treatment between men and women as \"double standards\" instead of sexism or discrimination.\n\n####Myth 10: \"Most men's issues are caused by men themselves\"\n\nMost men's issues are caused by gender norms and those gender norms are enforced by women just as much as they are by men.\n\nMen's issues are often just one side of the coin, and usually reflect disadvantages that women face as well.\n\nOne of the biggest gender norms in society is hypergamy, or the tendency for women to try to marry up, and for men to marry down.  And this gender norm is mostly enforced by women, not by men.\n\nTwo other gender norm that are enforced by women is the providership gender norm, and the childcare gender norm. Which also causes women to perform more unpaid work and earn less money than men in the labor market.\n\nA fourth gender norm that is enforced by women more than men is the \"boys don't cry bias\". Which is mainly instilled in young boys by their mothers and by female school teachers.  In fact, fathers and male school teachers actually fight against this gender norm.\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S1053535711000321\n\nhttps://www.theatlantic.com/sexes/archive/2013/04/messages-of-shame-are-organized-around-gender/275322/\n\nhttps://www.pewsocialtrends.org/2014/09/24/chapter-1-public-views-on-marria\n\nhttps://scholar.harvard.edu/files/akillewald/files/money_work_and_marital_stability.pdf\n\nhttps://www.fatherhood.org/fatherhood/maternal-gatekeeping-why-it-matters-for-children\n\nhttps://news.uoguelph.ca/2019/11/mothers-push-gender-stereotypes-more-than-fathers-study-reveals/\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/gjtj10/most_people_regardless_of_gender_prefer_to_stay/\n\n####Myth 11: \"Toxic masculinity is harming men and their mental health\"\n\nThe concept of toxic masculinity has never been empirically tested, and some research questions the validity of it in the context of psychology and mental health.\n\nEven if you do think it is valid though, it is still commonly used in a way that is sexist and hateful torwards men.\n\nIn recent years it has become associated with female supremacy, feminist hostility towards men, and misandry in general.  And as a result, the vast majority of men find the term to be sexist and offensive.\n\nMen who identify with traditional masculine values have greater self-esteem, better mental health, better relationships with women, and are usually better educated than men who are opposed to masculinity or who accept feminist views about the patriarchy and toxic masculinity.\n\nThe key to better mental health for men might therefore be an embracement of masculinity, not a shunning of it.  Instead of trying to redefine masculinity, we should work to understand it better, and offer men better services based on an honest acknowledgement that men's and women's mental health might require different approaches.\n\nMen are not \"defective women\", and treating men's mental health in that context does not seem to be working very well.\n\nhttps://www.nytimes.com/2019/01/17/opinion/apa-guidelines-men-boys.html\n\nhttps://zenodo.org/record/3871217#.X-p1ji2l2J_\n\nhttps://link.springer.com/chapter/10.1007/978-3-030-04384-1_5\n\n####Myth 12: \"Most men's activists just hate women or are opposed to feminism.  They don't really care about men.\"\n\nThis rhetoric is normally used to silence the voices of men (and women) who support men's rights and prevent them from expressing themselves.  Which makes it another example of testimonial injustice or epistemic oppression.\n\nThe fact is that many people do care about men's issues, and that's why they become MRAs.  Feminism does get discussed in the men's movement, but there are a couple reasons for that:\n\n1. Many feminists, \"radical\" or otherwise, have advocated against men and have even pushed for public policy in ways that are harmful to men or discriminates against men. Feminists themselves tend to not fight against this, meaning it's often up to MRAs to address it.\n\n2. Many MRAs are themselves current or ex-feminists who were ostracized for daring to take the feminist rhetoric about *\"also caring about men\"* a little too seriously.\n\nWarren Farrell is a great example of this. He used to be on the board of directors for NOW, the world's largest feminist organization.\n\nAnd then he said that we need to work on child custody equality and reproductive rights for men. Topics that he assumed should fall under the umbrella of feminism since they are issues pertaining to gender equality.  Instead of agreeing with him though, he ended up being excommunicated from the feminist movement. And now he's often regarded as the \"father of the modern men's movement\" for carrying on his advocacy outside of feminism.\n\nThe problem that many MRAs have with feminism is that it usually stops half way when advocating for gender equality.\n\nSo sometimes what MRAs are doing is just taking it the rest of the way towards actual gender equality. Our frustration with feminists comes from the fact that they refuse to see this as valid (or do it themselves to begin with).\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/ihmb2p/by_denying_that_the_feminist_establishment_is/\n\nhttps://www.reddit.com/r/MensRights/comments/9v6tqj/a_list_about_feminism_misandry_for_anyone_who/\n\n####Myth 13: \"Men don't receive custody of their children because they're bad fathers and don't bother requesting custody\"\n\nAcademic research simply does not back this up.  [The only study that ever found something like this was discovered to be purposefully fraudulent](http://www.breakingthescience.org/SJC_GBC_analysis_intro.php), although that hasn't stopped people from trying to repeat this. The fact is that men are widely discriminated against on numerous different fronts when it comes to child custody and other areas involving family court law.  \n\nNote also how hateful this rhetoric is.  This is the kind of stuff that you find repeated by feminists, and it simply doesn't treat this topic in a fair and honest manner.  Fathers love their children and many fight tooth and nail just to get a few hours a week to spend with them. The system is broken and it represents a grave social injustice that is deeply unfair to fathers and their children.\n\nhttps://www.sharedparenting.org/2019-shared-parenting-report\n\nSee also:\n\nhttps://www.reddit.com/r/MensRights/comments/ilzceq/cmv_equal_child_custody_for_mothers_and_fathers/\n\n####Myth 14: \"Most child abusers are men\"\n\nA majority of child abuse is actually committed by women, and especially by mothers.  This is even more true when you include emotional abuse and neglect instead of just physical abuse.\n\nBy some metrics, the biological father is the safest person for a child to be with. This is because when men do abuse children, it often happens while under the custody of the mother.  Who is sometimes complicit in the abuse or even encourages it.\n\nClose to half of child abductors and traffickers are also women, not men.  And many of their victims are boys.  Boys face sexual abuse and are also used for forced labor and organ harvesting. They are less likely to survive or escape, are less likely to be reported on or identified, and they suffer from higher rates of abuse than girls who are trafficked.\n\nAnd yet very little attention is given to this.  Missing boys, and especially missing minority boys, are often ignored by society and the media. To the point that people often assume that most of the victims are girls.  Something which is known as the [missing white woman syndrome](https://archive.is/mRIJL) (although in Canada there is a lot of attention given to missing indigenous women, even though 71% of missing indigenous people are men and boys).\n\nNote that I'm not saying these things to attack women, imply that they shouldn't receive custody, or to downplay the plight of girls.  Which is a lot more than you can say about people who try to paint men as the villains in this picture.  We should however be fair about what the facts are, and give male victimization, including victimization by women, the attention that it deserves.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/16165212\n\nhttps://www.cdc.gov/violenceprevention/pdf/childmaltreatment-facts-at-a-glance.pdf\n\nhttp://www.breakingthescience.org/SimplifiedDataFromDHHS.php\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0145213416302599\n\nhttps://www.savethechildren.org/us/charity-stories/child-trafficking-myths-vs-facts\n\n*Fair is fair and equal is equal.  Gender equality will never be fixed if we refuse to look at both sides of the coin.  We need to be honest about what the problems are, and stop ignoring them when they involve men, fathers, and boys.*",
    "title": "Some common gender myths and their rebuttals",
    "subreddit": "MensRights",
    "timestamp": 1612387192,
    "score": 264,
    "keyword": "white director"
  },
  {
    "text": "Gender Disparity in College Attendance & Scholarships [WSJ had an interested/depressing article](https://www.wsj.com/articles/college-university-fall-higher-education-men-women-enrollment-admissions-back-to-school-11630948233?mod=hp_lead_pos12) on the decline in male college attendance and the disparity between female and male graduation rates. The article is surprisingly pro-male. Here are some facts from the article:  \n\n\n*Women increased their lead over men in college applications for the 2021-22 school year—3,805,978 to 2,815,810.*  \n\n\n *The gender enrollment disparity among nonprofit colleges is widest at  private four-year schools, where the proportion of women during the 2020-21 school year grew to an average of 61%.*  \n\n\n*The proportion of male undergraduates at UCLA fell to 41% in the fall  semester of 2020 from 45% in fall 2013. Over the same period, undergraduate enrollment expanded by nearly 3,000 students. Of those spots, nine out of 10 went to women.* \n\n*Young women appear eager to take leadership roles, making up 59% of  student body presidents in the 2019-20 academic year and 74% of student body vice presidents, according to W.H. “Butch” Oxendine, Jr., executive director of the American Student Government Association. “Across all types of institutions, particularly two-year institutions, but also  extending into public and private four-year institutions, women  dominate student government executive boards,” Mr. Oxendine said.*\n\n*Young men get little help, in part, because schools are focused on  encouraging historically underrepresented students. Jerlando Jackson, department chair, Education Leadership and Policy Analysis, at the University of Wisconsin’s School of Education, said few campuses have been willing to spend limited funds on male underachievement that would also benefit white men, risking criticism for assisting those who have historically held the biggest educational advantages.*\n\nIt can be inferred from the last paragraph that anti-white male bias is negatively affecting men in minority groups.\n\nAnecdotally I hear people bring up the need for female scholarships, as if it's common knowledge that there are more males than females both attending and graduating college. I checked [scholarship.com](https://scholarship.com) and found that there are 78 male-specific scholarships and 304 female-specific scholarships.  \n\n\n[https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/male](https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/male)\n\n[https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/female](https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/female)",
    "title": "Gender Disparity in College Attendance & Scholarships",
    "subreddit": "MensRights",
    "timestamp": 1631022158,
    "score": 32,
    "keyword": "white director"
  },
  {
    "text": "Light-hearted feminist-friendly film recommendations? I like watching rom-coms and teen movies because I generally watch movies to relax at the end of the week, whereas I read when I want to be challenged. However, most of these kinds of films are painfully sexist, among many other '-ist's. I really just want to watch films that have a light-hearted tone and are about the way people connect with each other, romantically or otherwise, and those two genres seem the closest thing I can find to doing that. I'm sick of movies that are depressing or violent.\n\nAs a queer woman who practices relationship anarchy, I don't expect to find movies that reflect my values exactly, but I was just hoping for something better than the bullshit I find on 'top 10 rom-coms' listicles. I also would like to watch more indie and international films (I'm Australian) as I don't vibe with most mainstream American humour, but I don't know how it is that people hear about those kinds of movies. If someone has a recommendation for an American movie that fits the bill, though, please share anyway, even if it's well-known!\n\nMy own recommendations for things that others in my position might like include Ladybird, Edge of Seventeen, Maggie's Plan, Juno, Little Miss Sunshine, An Education, and any of the films by the director Hirokazu Koreeda (my favourite movie is his Shoplifters, though it's not as lighthearted as the other films on this list. Like Father Like Son is a good one to start with).  The 1931 version of Madchen in Uniform is good too, and queer, though it gets dark towards the end. I also love You've Got Mail, and I enjoy older British rom-coms like Four Weddings and a Funeral, and Notting Hill. The quasi-polyamorous set-up in part of Bridget Jones' Baby was something I enjoyed as well. My Australian recommendation is Top-End Wedding, which is lots of fun and is one of few rom-coms I know that isn't from a completely white perspective.\n\nI'm sure there are others who feel similarly to me, so all recommendations would be super appreciated!",
    "title": "Light-hearted feminist-friendly film recommendations?",
    "subreddit": "Feminism",
    "timestamp": 1612143187,
    "score": 13,
    "keyword": "white director"
  }
]