[
  {
    "text": "So this is how it ends! A student had been acting strange towards me for a few weeks. Never had this kid as a student, never in any club I ran, didn't have any connections to her. As a male teacher this made me uncomfortable and I reported her behavior to my supervisor and the students guidance counselor.\nLess than a week later I was called to office with my union rep and informed that this same student had made an allegation against me, touching her hair and back and arm in a sexual manner.\nBeen placed on leave now pending investigation....\nIt's as if I've been determined guilty because this student said so.\nFor the record: all accounts she reported have been refuted by witnesses, she had been showing up in my class for no reason for a few weeks, she had left drawings and notes on the white board, all reported to supervisor.\nNow I wait....life in the balance... career in limbo... Because a vague / unsubstantiated accusation.\n \n\nUpdate!\nHad meeting with superintendent and asst. Super... student accusations= unsubstantiated\nWill be back in class following BOE meeting... building admin we're reprimanded for not disclosing all found info to me and child services... Principal and VP didn't turn over all relevant information most of which exonerated me!?!\nHate to use this word but \"collusion?\" ..I know the principal has an axe to grind but didn't know of VP...",
    "title": "So this is how it ends!",
    "subreddit": "Teachers",
    "timestamp": 1546283253,
    "score": 814,
    "keyword": "white principal"
  },
  {
    "text": "My outfit was “not impressive”??? I recently was hired and went to the school board meeting where my approval was on the agenda. I wore a nice pair of Tommy Hilfiger summer slacks and a white shirt tucked in. My hair was brushed and I had a little makeup on. After the meeting, my admin told my principal he was “not impressed” with the way I looked at the board meeting. I was in shock when I heard this. Most people were wearing jeans; my principal himself was wearing cargo shorts. I feel as though it was inappropriate for my admin to say this and I also feel like had I been a male, my outfit would not have been mentioned. Am I wrong to be upset about this? There’s nothing I can do now but I already feel as though there’s somewhat of a negative view of me going into the school year.",
    "title": "My outfit was “not impressive”???",
    "subreddit": "Teachers",
    "timestamp": 1566874228,
    "score": 644,
    "keyword": "white principal"
  },
  {
    "text": "How to deal with toxic relationship with my kids I've come to realize that my relationship with my students is toxic following a very jarring Friday. I'm a first year teacher and came into the year into a Title I Middle School. I'm a 6'4\" white man and I can be told at times that I'm intimidating. Even though I was really tough I still tried to build relationships early on. I made football jokes and told stories about Halloween and really let my kids know about me while still enforcing the rules. My homeroom said I was \"cool\" on the first day. \n\nIt quickly turned toxic. This one girl who is seen as a bully accused me of trying to hit her and another student. The whole class believed her and turned on me. Also kids in that class cry EVERY DAY and whenever I don't tell five of them to sit down and stop interrupting my class I'm called heartless for not letting them comfort a friend. \n\nMy homeroom who was good for me at first suddenly flipped a switch after winter break. A girl in my class curses me out and threatens me constantly and the class LOVES it. On Friday I told her to sit down and she called me a pervert and told me that's why I get fucking cursed out. I called security to have the student removed and the class said she did nothing wrong. She refused to leave and I had to take my whole class to another classroom and a couple wanted to stay with her. When in another classroom students refused to work. And I told one boy to read and he refused. I told him that he could choose not to do his work, but I asked what he wanted to do with his life. He replied \"Be better than you.\" He also wanted to know when I was getting fired. The girls next to him laughed. The same girls who laughed reported me a couple months earlier for sexual harassment saying I got too close to them and was hugging them without permission (complete lies). They also said I needed to fired because I told them to be quiet in a rude way. The rest of the class has sandbagged me other than a few so instead of doing the work they play on their computers on Minecraft. I'm at the point where I'm done telling them to put their computers away. Or taking them and just let them do it and fail them. They even do it in front of the Principal.\n\nMy 7th grade class isn't too awful. However there's this one student who plays music over me on occasion. I also had my desks vandalized on Friday. \n\nHow can I survive the rest of the year? How can I improve on building a rapport with my kids next year? I'm just a first year teacher looking on ways to grow and improve.",
    "title": "How to deal with toxic relationship with my kids",
    "subreddit": "Teachers",
    "timestamp": 1552861112,
    "score": 226,
    "keyword": "white principal"
  },
  {
    "text": "The only job that people ignorantly think they can do better yet won’t. Am I the only one that feels this way? \n\nI was a high school math teacher. I was also a baseball coach. Spent 5 years between 2 low socioeconomic schools. Just recently got out.\n\nI can’t begin to tell you how great it feels to be out of the classroom in the middle of October. Working in the private sector; actually getting rewarded monetarily for your extra time and efforts and knowledge. Also being able to work without having to be on the edge of your seat worried about some random outburst of insubordination and/or a “go fuck yourself” or a “I’d fuck you up.” Or feeling a pen or wad of paper fly off your back while you are writing on the board. Or worrying about that inevitable investigation by principals and HR (which is amusing because HR is for the protection of the workers, not the students, but I digress) making sure you aren’t the reason for these outbursts, when all you did was try to teach a simple lesson. \n\nSound familiar? Then you’ll love what I have to say next...\n\nOne thing that pisses me off about the profession (besides the inadequate pay you receive to make apathetic children with zero work-related skills appear useful to the ever-growing workforce) is that EVERYONE thinks they can tell you how to do your job. After all the college classes, observations, student teaching, appraisals, professional developments, lessons taught, clubs supervised, etc., people actually have the nerve to expect that you take their criticism into consideration. That’s one reason why I left education, and if you’re on the fence about it, you should, too, because the job definitely ain’t for you.\n\nThink about it...\n\nEvery teacher with more experience than you is telling you about what you should do in your classroom, even if they’ve surfed the internet every day for the last 25 years. Peers that have a better relationship with superiors than you (not better teachers) are running professional developments. Principals that haven’t been in the classroom for the better part of the decade (or more) think they know what is best for your classroom.\n\nMy favorite critic is the parent, though. Especially the ones that raise their kids in front of an iPad and Xbox; on junk food and an unhealthy sleep schedule. Decided to stick a smartphone in their child’s hands way too early because they’re the “cool parent.” Have no education or work ethic either. Yet they have all the reasons why their child is failing, ignore the educated, specific reasons that I tell them they are failing, and then want to make a suggestion on how I should be teaching and giving assignments. On multiple occasions I threatened that I would get a substitute, drive over to their job, stand over their shoulder, and tell them what to do and how to do it.\n\n“But hey, teaching isn’t about the money or the problems, it’s about the relationships and students,” said about half of you that have read this. \n\nFirst of all, give it a rest. That self-righteous crap is why teachers (and you) don’t get paid enough. You keep martyring yourselves like that, and straight white males in suits that are in your state and local government are gonna keep taking your word for it. They don’t care. They know how screwed up the system is and have no solution for fixing it (because quality education starts with solid parenting/guardianship, but again I digress) so most of their children are enrolled in private schools anyway.\n\nSecondly, most of the average students don’t give a crap about you or your lessons (3.5 to 4.0 college-bound students are going to get it done no matter what). They think teachers and the school system are jokes, even if their justification is ignorant. It also doesn’t help that parents ALLOW their children to think like this (which is why they don’t need to be telling us how to run a successful classroom). \n\nThen for whatever reason (probably ignorant parents and social media), children of today think that they’re the only kids to have gone through public school I guess? Nah. More like the only generation to have unlimited platforms to whine about hard work. Too much homework because it causes a lack of sleep? Bullying might still be a problem? Can’t chew gum? There’s a dress code? These are all wimpy claims that students are making right now on social media to justify that school is useless and the “system is broken,” and society just buys in. Somehow these people forget that while they agree with these ignorant, whiny children on social media, they are doing it with a $1000+ smartphone, paid for with the money they earned from the job they do so well at BECAUSE of their “old school, pencil/paper” education.\n\nDon’t even get me started on the fact that a bunch of humans without high school diplomas (aka students) are being allowed to give input on their education, and that input is even being entertained. What kind of backwards ass logic is that? We are the ones that are educated and experienced, society should be listening to us and supporting our needs because our needs regard successful futures for children, not making sure there’s time to get a battle royale winning streak in on fortnite. \n\nInteresting how there’s a bit of a difference in motivation for why teachers do what they do and why students do what they do. Logically, it would make sense to listen to teachers, but too many of you got in the school and started bringing sympathy and emotion (instead of motivation and critical thinking), so logic has gone out the window as far as American public school is concerned.\n\nThe bottom line of my message is don’t feel bad if you want to quit and leave education. You don’t owe anyone anything. Tomorrow it may feel like you’ve betrayed everyone, but years from now you will be commended for the time you spent in the classroom doing what everyone else THINKS they can do and will never do.\n\nAnd to those of y’all that plan on staying in: work hard and quit martyring yourselves. Don’t give these people in a much higher tax bracket than you any reason to say you don’t deserve better. You deserve adequate pay for your efforts, and so do your peers that are working towards the same goal as you miles away. Give each other a chance and stand up for what you deserve, but you have to come together. You have to quit feeling sorry for kids and push them to do things that they don’t want to do. Otherwise, enjoy that non-merit-based, near poverty line, salary.",
    "title": "The only job that people ignorantly think they can do better yet won’t.",
    "subreddit": "Teachers",
    "timestamp": 1572025797,
    "score": 107,
    "keyword": "white principal"
  },
  {
    "text": "What are your thoughts on why there aren’t many African American teachers. Black teachers only make up 7 % of public school educators across the nation. Black males is even lower. Each year more and more black teachers are leaving the profession due to reasons ranging from feeling “pigeonholed” into only serving black students, being pressured into being the unofficial disciplinarian of students of color, to feeling ostracized by their administration and colleagues. These are ALL things I faced as an African American teacher my first couple years of teaching and had I remained at the school where I was, I would have most likely left the profession as well, but like most teachers, the students kept me motivated to keep going. My last year there our school had a “ Black History Month” Assembly which ONLY focused on the achievement African-Americans have made in sports and music. When I spoke to my principal about it she told me she didn’t feel offended and that neither should I. SHE as a white woman was not offended so ME as a black man shouldn’t. Now, at my current school things are much better as I feel valued and appreciated as a staff member and as an individual, but we ALL have a long way to go.",
    "title": "What are your thoughts on why there aren’t many African American teachers.",
    "subreddit": "Teachers",
    "timestamp": 1553136932,
    "score": 56,
    "keyword": "white principal"
  },
  {
    "text": "Well that's an ...interesting choice for a victory speech So I'm a school resource officer (cop in a school, only deal with actual criminal stuff, also kind of a backup nurse) at a let's say \"disadvantaged\" school in a large metropolitan area. \n\nSo we recently had the end of year meeting which for me usually just means I clean out my office, hang out with some of the teachers, and then go home early. This school the principal had food at the traditional end of year meeting so I sat in on part of it and it was shall we say unusual. \n\nShe opened by saying \"we made it\" and then quickly transitioned to \"when it got back to me that people were speaking about me behind my back it felt like getting raped\" (let's ignore the fact that she emailed my captain to complain about me going easy on the kids instead of talking to me or my lieutenant and focus on the \"y'all raped me\" comment. All I'll say is it's a good thing I had my sunglasses on because there was some eyerolling) \n\nThen it translated into complaining about Christmas because it was the only time people were nice to each other\n\nThen she told a lovely story about how she almost didn't hire a teacher because she was white (principal is African american, the students are almost all African american so I get what she was getting at but holy shit) but was glad because that teacher had done well\n\nThen she went on an anti union rant because it made it hard to fire low performers.\n\nThen she told us to take care of ourselves but not use sick days\n\nThen she told us not to eat meat\n\nThen I stepped out to take a call from my lieutenant. \n\nBut yeah a far cry from the traditional \"good job, here's what worked, here's what we're doing next year\"",
    "title": "Well that's an ...interesting choice for a victory speech",
    "subreddit": "Teachers",
    "timestamp": 1559840306,
    "score": 52,
    "keyword": "white principal"
  },
  {
    "text": "New Principal Worries and a Rant We have a new principal. This is a regular occurrence at our school. I have very little faith in principals in general - they often cause more problems for teachers than they solve in my experience. \n\nListening to new principal's first speech, three things were very strongly implied:\n\n1) New principal believes that teachers working extra long hours beyond contract time is just how it is because teaching is a calling (one that the principal was called to then moved on to admin, hmm...) \"no excuses\" \"just get it done\" \"teachers lose a lot of family time\"\n\n2) New principal is very religious and says god called them to our school (we are a public school) and they believe this means they will be the one to fix us \n\n3) New principal seems to believe that our issues will be solved with more accountability, \"proof\" \"evidence\" and \"data\" to show we are doing our jobs, and \"cultural awareness training\". \n\nNone of the above makes me more confident that this is going to be a good, or even better year than the last. I do not appreciate being told that teachers \"just know\" we don't get paid for all the hours we work, or that we had better be able to prove we are making the school a better place, or that my professional job is a semi-religious calling, or that we're probably being racist when we write referrals (implied, not explicitly said) because our data shows that in our 60/40 split white/minority school that white kids get less referrals (but still a large amount!). \n\nBe warned - the rest of this is a rant on the last point. \n\nOur school lines are drawn around an affluent neighborhood of mostly white kids, and a large swath of underprivileged neighborhoods of black and hispanic families. The poor white neighborhood in our district is on a line that is split with a neighboring school district, so our white student population is skewed to the well-off families, with two parent households, a stay-at-home parent, a lot of family support, and less behavior issues (I was honestly surprised, given this fact, that our white rate of referrals was as high as reported). I've also worked in a school district that was at least 90% white, mostly poor kids, and they had the same behavior issues, because most of it is a childhood trauma and poverty issue, NOT an issue of teachers wanting to write up the black and brown kids, or ignoring bad behavior of white kids. No teacher likes writing referrals, and everyone I know avoids it at all costs! But at a certain point, you have to remove the kid that is keeping everyone else from learning and causing a disruption, or cursing you out, or flat out refusing to follow a rule (for example, taking a video call in the middle of a class discussion and when told to put up the phone, talking louder, and telling the person on the other end how stupid the teacher is). \n\nIt is not our faculty's fault our school lines are drawn in a way that highlights the racial divides in our city, especially in the data related to behavior issues and grades. There are plenty of poor white kids who are friends with black and hispanic kids, but apparently they don't exist. Today I was told the white and black kids in my school don't associate with each other, despite seeing plenty of evidence with my own eyes to the contrary in my classes. The divide is mostly socioeconomic, and yes, many of the rich white kids aren't friends with the poor kids, many of whom are not white. However, plenty of them are friends with the middle class and wealthier minority students - I see them walking through the halls with linked arms every day! \n\nAll this to say, I don't trust the new principal, and I am concerned the district is going to actually make morale and the school culture worse by the way they are addressing racial issues in our school. It's one thing to remind teachers to be careful that they are not favoring or appearing to favor one racial group over another in discipline, in classroom cultural references, historical references, and to strive for equal representation, etc. It's another to ignore how racism over decades has shaped our community into socioeconomic and racial divides, and blame data that looks bad on teachers being racist.",
    "title": "New Principal Worries and a Rant",
    "subreddit": "Teachers",
    "timestamp": 1565655476,
    "score": 44,
    "keyword": "white principal"
  },
  {
    "text": "Dress Code Double Standard This might just be my school, but as a man I have to wear dress pants a long sleeved dress shirt, tie and dress shoes every day. Doesn’t matter if it’s 95 degrees out and we have no AC: pants, shirt and tie.\n\nWomen, on the other hand, get to wear skirts and pants and jeans (that aren’t blue) and tshirts and uggs and flip flops and nobody says ANYTHING.\n\nI get that women have faced plenty of double standards through the years. I get that high heels, corsets and bras are things that exist. But it’s not like I invented those and I’m gay, I could give a crap if women wear them. If this is some sort of revenge, you have the wrong guy!\n\nMen’s bodies literally produce more heat then women’s - I look ridiculous covered in sweat stains for the last 2 months of the school year while my coteacher kicks back in a tank top and shorts.\n\nMostly just pissed because my principal (female) just lectured me for wearing plain, white leather trainers to work. I leave her office and literally walk by a female coworker wearing a pair of Nikes. Wtf!?",
    "title": "Dress Code Double Standard",
    "subreddit": "Teachers",
    "timestamp": 1575657001,
    "score": 37,
    "keyword": "white principal"
  },
  {
    "text": "Students have a problem with Frederick Douglass? Help! Alright... I have 2 students, siblings, who do not want to read *The Narrative of the Life of Frederick Douglass*...because of the way white people are portrayed.  They approached me about it--adamantly stating, \"We NEED a new book.  I do not want to learn about slavery.\"  They said that they were uncomfortable about how white people come off in this text.   I told them that for now, my answer was no because this a classic piece of literature, it meets the standards, and works with the interdisciplinary unit we're in with their US History class.  After this conversation I conferred with my department head and she was with me on this.  We even sent an email to admin and our principal said that a parent would have to call in for this to change... so of course, after school, I get an email from my principal that I have to meet with this parent.  This is a big enough problem for them that I have to meet with their parent and my principal about it!  I'm just taken aback by this...\n\nThey didn't want to read *Kindred* with the rest of the class because there is sexual abuse in it, which is completely understandable.  I developed an independent study for them.  They do a little bit of googling for each section about historical context, and then they read and answer guided questions.  I looked over the questions--and really they're mostly about Douglass himself.\n\nYes--the first chapter is a bit gory and violent.  This is the only thing I could see the students have a qualm with, however, based on the work they've completed, it seems that they've only read the introduction--which is written by William Lloyd Garrison.\n\nAnd, of course, I can't ignore the race thing here.  The students here are white.. and have expressed to another teacher that they've been accused of being racist before.  Clearly they are uncomfortable with race--but discomfort happens when people learn.  Learning is hard and uncomfortable..\n\nHas anything like this happened to you before?  I'm kind of shocked... and a little lost at what to do.  This text is a classic--I've seen it taught anywhere from middle school to college level.  It may be the first time these kids have come across it--but it won't be the last.\n\n&#x200B;\n\nEdit: I should add that this is a 10th grade English class.\n\nEdit: I added more details about what happened.",
    "title": "Students have a problem with Frederick Douglass? Help!",
    "subreddit": "Teachers",
    "timestamp": 1572749164,
    "score": 18,
    "keyword": "white principal"
  },
  {
    "text": "This is why racial “jokes” are never okay \n\nLong post, bear with me.\n\nLast Thursday a 6th grader (white) went up to several classmates (black) and called them the n-word. Immediately of course, there was an uproar. The student claimed that in his Latin class they learned the names of the colors and that the word for the color black is “niger,” which is what he was referring to as a joke. Personally I don’t believe him, but regardless, the matter was dealt with and he was suspended for a day last Friday. His parents were very supportive and horrified that their son did this. The students he had said it to seemed alright after they talked it out with the principal. \n\nThe problem is that since then, we’ve had numerous race related issues pop up, which never seemed to be much of an issue before. Sure we have fist fights and arguments and such happen, but it always seemed to be normal teenage drama shit, not necessarily motivated specifically by race. \n\nExample 1: On Friday, a black male student in my homeroom (7th grade) shouted at a white girl and called her racist, and she screamed back at him that he was a jerk and was always running his mouth at her. In talking with them both, the boy claims that she was taunting him, claiming she was going to call him the n-word if he didn’t shut up. When I spoke with the girl, she claimed this was not true, and that he had referred to her as a “stupid white hoe.” \n\nExample 2: That same day, two black girls in my class were having a conversation in which I heard one of them say “I can’t believe that kid didn’t get expelled. This school hates black people.” (Many black students are outraged that the 6th grader who started this got “only” a suspension).\n\nExample 3: again on Friday, an 8th grader wore a shirt to school that said Black Lives Matter. The problem is this is a parochial school so we have a uniform. When he was told he had to change into his uniform, he said “so you think Black lives don’t matter?” And he repeated that all day.\n\nExample 4: in one of my 6th grade classes I’ve got two students who sit sort of near each other who tend to annoy one another. One is a black girl and the other is a white boy. Sometimes they bicker, just about stupid shit- like “stop tapping your foot, it’s *so annoying!!*” But the point is it’s always petty stuff that has nothing to do with race. It’s just kid stuff. And to be fair, the boy tends to annoy just about everyone no matter where he sits, and the girl argues with lots of other students too. Today they were arguing about the fact that the boy apparently found a pen on the ground earlier that day that the girl claimed was hers. One thing led to another and the girl shoved the boy, who shoved her back. It only happened once, I stepped in and shut it down, talked to each of them, and separated them. After that they were fine the rest of the class. At the end the girl even went up to him and apologized for starting it. I thought it was over, although I did plan to speak with both their parents just to alert them to what happened.\n\nAbout 5 minutes later as we’re switching classes, there’s a ton of kids in the hallway saying “did you hear? L & R got in a fist fight in class and are getting suspended!” I explained that was not what had happened at all, and that it had been already dealt with. But despite what I said, that version of events must have gotten around. Because after school my principal calls me in and asks what happened in class. I explained that it was a disagreement that led to shoving, but it was over with quickly and that I had dealt with it, and that the girl had apologized to her classmate. My principal sighs and shows me an email she had just received from a parent (not one of the students involved) who was berating her for allowing so much racially motivated violence and inappropriate language within the school. The parent also claimed that her daughter told her in my class two students got in a fist fight over race and punched each other in the face (not true), that I had done nothing to stop it (again not true), and that she wasn’t sure she felt comfortable sending her daughter somewhere where teachers hold no regard for black people. And she again references the situation last week and believes the student who said the n-word should have been expelled and not just suspended. \n\nAfter speaking with my principal, she said I handled it just fine and that she would deal with this mother.\n\nI’m just concerned that one incident (albeit a serious one) has opened up a whole can of worms. I feel that people are making everything out to be racially motivated when I don’t actually think that’s the case. Just because two students argue about something, it doesn’t mean one of them is racist. But because this happened, now all of a sudden everything is about race. It’s very frustrating and I worry that something larger is going to happen if this doesn’t get addressed.",
    "title": "This is why racial “jokes” are never okay",
    "subreddit": "Teachers",
    "timestamp": 1574135145,
    "score": 13,
    "keyword": "white principal"
  },
  {
    "text": "[Vent] I know teaching is for me but my admin is absolutely the worst. I have taught at this school for three years. It's all I have known since I am a young teacher. Every year the admin has gotten more and more delusioned and abusive. I tried to get out last year and did not and am absolutely terrified of the prospect of not getting out this year. \n\nConstant gaslighting and fear mongering. Private office meetings of abuse and insults. Being told we are lazy and do not try hard enough and it's our fault the kids abuse us even though they refuse to discipline to keep the numbers low. Accusing of us of not caring if we do not bleed for our students.\n\nOur principal sent out an email yesterday saying he expects no more teachers to take days off. Our kids are not doing well because we all take too many days off. So no more. If your kid is sick you still need to show up. If you are sick you need to too. I have not taken a single day off except for this upcoming week for Jury Duty. The kids are failing because there is no accountability. You do not let us fail them and they know it so they do not try. Your scores are low on state testing because you falsify data and bully teachers into passing them. \n\nOur director of instruction has been through six secretaries in two years!! She abuses them out the door!!! Our turn over rate is insane and that is with them refusing to accept transfers and trying to block them! (No idea how they can but they do.) I got told I do not have good relationships with students because I am white teaching in title one even though I have had no write ups in two years! Because I work on relationships and know it would be a waste too. \n\nMy anxiety and depression are attacking me lately. I tried so hard to be strong but I do not know how I will survive until May like this. Everyday is some new rule, expectation, pressure. I cannot even put into words how much stuff has happened and what they do. We have a group that meets every other week to just talk and support each other. Texas unions are not super strong but we are reporting and yet they get away with this abuse daily. \n\nI am so tired. I love teaching but I can barely get out of bed and yes I am in therapy and I do take meds but the constant teacher abuse is getting to me. \n\nThanks for coming to my Ted talk.",
    "title": "[Vent] I know teaching is for me but my admin is absolutely the worst.",
    "subreddit": "Teachers",
    "timestamp": 1550373945,
    "score": 13,
    "keyword": "white principal"
  },
  {
    "text": "Questions about Accounting Advisory? (how does it compare to audit) Hello,\n\n(sorry for wall of text, cliffs at bottom)\n\nI currently work in audit, and I have recently made the decision that I don't wanna work in it anymore. It is miserable work and I think my talents are better served in other roles. I 100% will never work in audit again, I think I would take a job at McDonald's over working in audit seriously, I hate the nature of the job and I am not good at it, much more a sales/people person. I'm pretty close to quitting anything accounting-related altogether, but I just got contacted by a recruiter for an advisory position (accounting advisory). Advisory is the only thing public accounting I will consider at this point, being that it is further away from debits and credits and rule checking, and closer to finance/deal-making/client-focused.\n\nBeing that I am more interested in finance and deal-making, when I first went into accounting, this was my long term goal, to start in audit and make the transition into advisory (I learned that not all advisory is the same), and then eventually into high finance. I am not sure how much client facing and strategy is involved in \"accounting advisory\" as opposed to transaction services or strategy consulting; my goal is to get as far away from journal entries and accounting BS and closer to bottom line figures, growing future revenue, and closing deals.\n\nSo I have a few questions, for anybody who has experience in advisory:\n\n1. For those who have worked in advisory, how much different/better is it than audit? (I know better/worse is subjective, but audit is generally known to be the shittiest of accounting jobs, or even financial services jobs as whole. Low pay, no respect, nobody likes you, the \"janitors\" of the white collar world I have heard it described lol)\n\n2. If you have little talent/desire for tickmarking workpapers, being the regulatory compliance guy who's up everyone's a$$, hate law/regulation/administrative BS, but like interacting with people, and even a good amount of number crunching and finance, will I also struggle in accounting advisory? Is it one of the advisory lines that is just a \"glorified auditor\", and am I going to be doing the same thing again?\n\n3. How much does traveling all the time suck? The idea of it sounds fun, but I'm not sure how much of a toll it will take on my health, fitness, relationships, etc. I like to be a gym guy, maintain muscle mass, get back to my room, my temple, play with my electronics/toys, etc. maybe a year of traveling to new cities will do me well and grow me as a professional, but I also read about people who despise traveling all the time.\n\n4. Is it generally harder or easier than audit? Almost everyone I've met who works in advisory tells me it's way better and more interesting than audit work, just flat out objectively better, but I worry that I won't have the talent to perform in a position like this if I hate audit/accounting in general. I just like wearing a suit and working with people, and I love all things finance. Audit was hard for me because you have deadlines to meet while waiting on documentation/information from the client, management is upset because you have no work until the information arrives, so you look like you're slacking off, you have to be pushy/annoying, the processes are so tedious and pointless (to me at least), ex: check if this entry was properly recorded in the right time period, and was properly capitalized or expensed, or this entry was unusually high, you must question this and ask client for documentation/backup, meanwhile I'm thinking OMG who the F cares lol, let them record it how they want lmao. Of course, my job is to make sure they are following the rules, but I hate being that guy. I wanna help you grow your business, not the compliance nerd who's telling the principal that the jocks are cutting class and smoking pot and getting BJs in the parking lot. Nobody likes that guy.\n\n5. CPA exam: is the CPA exam as desired in advisory fields as it is in audit? I hate this exam and I would love any excuse to stop studying, and I absolutely do not want to be an accounting guy long term. I only wanted the CPA as a ticket into finance, but the more I learn, it's not even as desired in the finance field as I originally thought. Another question: if the CPA is still a good idea, how realistic is studying for this test while working full time in advisory, flying back and forth between different states each week?\n\nSorry for language, I tend to get overly angry/expressive when I think about my job in audit lol. Cliffs:\n\n-OP might be moving from audit to advisory\n\n-OP hates audit (accounting is boring too, but especially hates audit)\n\n-OP is not good at audit, not a natural accounting/audit type\n\n-OP is hoping advisory (accounting advisory) is closer to OP's natural interest and talent (people skills and finance)\n\n-OP wonders if he will be good enough or if he will be miserable again with a higher paycheck\n\n-OP wonders how good/bad the travel is\n\n-OP seeks anybody in r/accounting's advice who has worked in audit and accounting advisory or both, or has any input/knowledge",
    "title": "Questions about Accounting Advisory? (how does it compare to audit)",
    "subreddit": "Accounting",
    "timestamp": 1551726582,
    "score": 7,
    "keyword": "white principal"
  },
  {
    "text": "Being confused for other people of color? Hopefully this is an appropriate sub, and appropriate flair for this subject. I have a tendency to ramble, please forgive me\n\nI am biracial - half black and half white. I look black. Growing up I spent the majority of my time with white friends. White family members as well due to which parent I lived with. So I never really had anyone to bring up this subject to, but it's been heavy on my mind tonight and I would like to talk about it.\n\nAs a child in elementary and middle school I often experienced people who were white confusing me for other POC classmates even though the only things we had in common were similar skin tones and same hair color. It was never the normal mistake that sometimes happens like when you're meeting new people. It was people who had known me for a long time, like good friends, school principals, and classmates, and it was often a common occurrence, it never happened just once. As a child I never saw much of an issue but once I got older I began learning about how this seems to actually be a common issue between non-POC and POC, and that's when it all started to make sense.\n\nMy question for you guys is, have you ever dealt with things like this? How did you deal with it? How's it make you feel?\n\nIt makes me feel... embarrassed. Why? I don't know, I can't begin to explain why.. but it does.\n\nThank you, and apologies for the long post.",
    "title": "Being confused for other people of color?",
    "subreddit": "blackladies",
    "timestamp": 1569037822,
    "score": 12,
    "keyword": "white principal"
  },
  {
    "text": "Elite schools snub £1m gift for poor white boys https://www.thetimes.co.uk/edition/news/race-row-as-1m-gift-is-snubbed-by-elite-schools-winchester-dulwich-mhsr75d85\n\nTwo leading private schools have rejected scholarships of more than £1 million for poor white boys from a philanthropist for fear of breaching anti-discrimination laws.\n\nDulwich College and Winchester College turned down an offer from Professor Sir Bryan Thwaites, 96, to leave the funds in his will.\n\nSir Bryan, who attended both schools on scholarships, wanted white British boys from disadvantaged homes to benefit because they did worse at school than almost every other ethnic group. Studies have shown that they perform relatively poorly in exams and are less likely than their peers to attend university.\n\nStormzy, the rap star, established Cambridge University scholarships exclusively for black British students. The refusal of leading boys’ schools to allow financial help exclusively for white pupils has prompted a row about equality laws.\n\nSir Bryan said: “If Cambridge University can accept a much larger donation in support of black students, why cannot I do the same for underprivileged white British? Winchester said it would harm its reputation by accepting my bequest, but in my opinion it would gain enormously by being seen to address what is the severe national problem of the underperforming white cohort in schools.”\n\nTrevor Phillips, former chairman of the Equality and Human Rights Commission, said that well-known schools had turned down more than £1 million of financial help for white boys in recent months. He blamed a “lethal cocktail of inverted snobbery, racial victimhood and liberal guilt” for the reluctance to help white boys, whom he described as “today’s educational left-behinds”.\n\nHe said: “I doubt that I’ll ever work out why the British appear untroubled that so many of their children emerge from over a decade of expensive, compulsory education with scarcely more in the way of literacy and numeracy than the average Neanderthal.”\n\nWriting in the online magazine Standpoint, he continued: “On half a dozen occasions over the past five years I’ve been asked to advise on whether it is acceptable to offer bursaries or scholarships to one minority group or another. Invariably, I have said yes; but donors remain nervous, and beneficiary institutions are routinely discouraged by their lawyers.\n\n“I have no idea how many such generous offers have been turned down, but I do know that in recent months two well-known fee-paying schools have lost bequests totalling over £1 million that might have supported some of our most disadvantaged children for one reason: the donor, like Stormzy, wants his money to go to people of his own background — poor but talented white British boys.” Mr Phillips said that such a proposal was not racist and that the Equality Act of 2010 was not called the “Be Kind to Blacks Act”, adding: “In circumstances where the racial group that is disadvantaged is white, there should be no bar to doing for them exactly what we would do for so-called black and minority ethnic groups.”\n\nSir Bryan was principal of Westfield College, part of the University of London, for 17 years. He planned to bequeath £400,000 to Dulwich College in south London and £800,000 to Winchester College in Hampshire.\n\nHe attended Dulwich until the outbreak of the Second World War, when he was sent to Winchester. Scholarships paid for him to attend both institutions. He has long supported both schools and taught at Winchester, where he founded the School Mathematics Project that reached 80 per cent of schools by the early 1970s. Both schools are understood to have consulted widely with lawyers, trustees and charity experts before declining the bequest.\n\nUnder the Equality Act positive discrimination, where someone is given preferential treatment because they have a specific characteristic, is generally unlawful. However “positive action” is permitted for efforts aimed at encouraging someone to overcome a disadvantage attributed to their race or other protected characteristic.\n\nA spokesman for Winchester College said: “Acceptance of a bequest of this nature would neither be in the interests of the school as a charity nor the interests of those it aims to support through its work. Notwithstanding legal exceptions to the relevant legislation, the school does not see how discrimination on grounds of a boy’s colour could ever be compatible with its values.”\n\nA spokesman for Dulwich College said: “The community at Dulwich is proudly diverse, both socio-economically and ethnically, reflecting our location. Bursaries are an engine of social mobility and they should be available to all who pass our entrance examinations, irrespective of their background.”\n\nHow ‘positive action’ works The protected characteristics that enable “positive action” under the Equality Act 2010 are: age, disability, gender reassignment, pregnancy and maternity, race, religion or belief, sex and sexual orientation (Billy Kenber writes). A school or university offering a scholarship or bursary for a particular group of students must be able to demonstrate that the group being helped suffers a disadvantage because of their protected characteristic. These scholarships are lawful as long as they are also a proportionate means of overturning the disadvantage.\n\nhttps://i.imgur.com/oFI3I2V.png",
    "title": "Elite schools snub £1m gift for poor white boys",
    "subreddit": "MensRights",
    "timestamp": 1577705652,
    "score": 60,
    "keyword": "white principal"
  },
  {
    "text": "Curvy High School Swimmer Disqualified for a Wedgie For those who have exceeded their Washington Post free article limit:\n\n\"The teenage girl clambered out of the pool, ready to accept victory. A champion swimmer for Anchorage’s Dimond High School, she had crushed her competition in the 100-yard freestyle during Friday night’s meet with a rival from across town.\n\nBut as soon as she stepped out of the water, she learned that she had been disqualified.\n\nThe reason? Her swimsuit was exposing too much of her buttocks, an official ruled.\n\nThe referee’s call, which is now under investigation, has generated intense debate among Alaska’s close-knit swim and dive community, and prompted a larger discussion about how female athletes’ bodies are policed and scrutinized. Lauren Langford, who coaches swimming at another high school in the area, told The Washington Post that she believes racism, in addition to sexism, may have been a factor, given that the teen is among the few nonwhite athletes in a predominantly white sport.\n\n'All of these girls are all wearing suits that are cut the same way,' Langford said. 'And the only girl who gets disqualified is a mixed-race girl with rounder, curvier features.'\n\nThe teenager didn’t pick out the swimsuit — her school chose it and issued it to her. But even though all the girls on her team were dressed identically, she was the only one cited for a uniform violation. Annette Rohde, who was working as an official during the meet, told the Anchorage Daily News that another female ref explained that the bottom of the girl’s suit 'was so far up I could see butt cheek touching butt cheek.’\n\nRohde froze in disbelief, she said, and warned the referee, who has not been identified, 'This is going to blow up.' Sure enough, the decision reverberated throughout the community, where the teen is known as a top-ranked swimmer likely to go on to compete at the collegiate level.\n\n'In a world where young girls are told at every turn that the skin they’re in is not good enough for a thousand reasons, the last thing we need to do in youth athletics is add to that unhealthy dialogue,' Langford, a swim coach at Anchorage’s West High School who coached the teenager and her sisters when they were younger, wrote in a widely shared blog post on Medium after Friday’s meet. She added, 'If you do not like the way that swimsuits fit on these girls’ bodies then don’t look; they are minors, children, and no one should be looking at them anyway.'\n\nSpeaking with The Post on Monday night, Langford said she was angered at the treatment of the teenager, whom she described as 'literally the nicest young lady.' It wasn’t the first time the girl had been made to feel that her curvy figure was problematic: Last year, a parent took a photo of her backside and shared it with other parents to demonstrate that girls on the team were wearing inappropriate swimwear. (District officials said Monday that Dimond High School’s assistant principal 'indicated to the parent who took the photographs that it was not permissible for him to take pictures of others’ children and that he should stop immediately.')\n\n'That to me is so inappropriate,' Langford said. She noted that the teen girl has been accused of hiking her suit up on purpose, but anyone who has competed in swimming would know that suits often ride up unintentionally.\n\n'We have a term for it — it’s called a suit wedgie,' she said. 'And wedgies happen. It’s uncomfortable. No one’s going to walk around that way intentionally.'\n\nOver the years, the conservative one-piece swimsuits traditionally worn by competitive female swimmers have been phased out in favor of a higher-cut style that has less fabric and is more hydrodynamic, but also more revealing. The changes in the cut and fit, Langford said, make it 'even more frequent that you’re picking a wedgie.' But a minor, if annoying, wardrobe malfunction is also likely to be the last thing on the mind of a swimmer intently focused on her form as she nears the finish line.\n\n'If you’re in the water, you’re not thinking about it,' Langford said.\n\nRohde and another local swim coach told the Daily News on Monday that they, too, had never seen the teenager deliberately adjust her swimsuit to make it more revealing. There’s some dispute about whether the referee’s call, which Dimond’s coach has protested, would have been correct if the girl had done so, or if swimmers can be penalized for failing to realize that their suit has bunched up. Officials with the Anchorage School District, who announced Monday that they are reviewing the decision, wrote that the disqualification 'appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms.'\n\nThe National Federation of State High School Associations, the governing body for high school athletics in Alaska, simply states that female swimmers must cover their buttocks and breasts. In August, the organization issued a memorandum alerting coaches that 'suits are being worn in such a way as to expose the athlete’s buttocks,' and provided an illustrated example of what constituted appropriate coverage. District officials said Monday that Dimond High School 'made deliberate efforts over the last year' to meet those requirements — in particular, picking out the regulation swimsuit that the teen was wearing when she was stripped of her victory.\n\n'If the suit was a problem, they all should have been disqualified,' Langford said. 'But they weren’t.'\n\nMeagan Kowatch, the teenager’s mother, told KTUU on Monday that the referee who made the call had previously embarrassed one of her other daughters by critiquing the fit of her swimsuit during a meet. She wants to see the results of Friday’s competition overturned, and for that ref to be kept away from her daughters’ races in future, she said.\n\nThough there’s also been some debate about whether racism played a role in the decision, 'no one seems to be arguing about if it’s sexism,' Langford said. The National Federation of High Schools also published guidelines for appropriate male swimwear in August, and she said she’s seen young men competing in lower-riding suits than the organization deems appropriate. But to her knowledge, it’s never become an issue.\n\nBy contrast, Langford said, Kowatch has been told by other parents that her three daughters on the team, who are all talented swimmers, need to cover up for the sake of their sons. The disqualified teenager, though usually 'tough as nails,' turned teary on Friday night over the referee’s decision, and was 'heartbroken' to learn that people were accusing her of purposefully hiking up her swimsuit, the coach said.\n\n'The fact that she’s been told she’s intentionally trying to draw this sexual attention has really crushed her,' Langford said.\"\n \nBy Antonia Noori Farzan\nSeptember 10 at 6:58 AM\nhttps://www.washingtonpost.com/nation/2019/09/10/anchorage-swimmer-disqualified-wedgie",
    "title": "Curvy High School Swimmer Disqualified for a Wedgie",
    "subreddit": "Feminism",
    "timestamp": 1568221201,
    "score": 14,
    "keyword": "white principal"
  }
]