[
  {
    "text": "Work environment as a major reason to join a company? After working a few jobs, I've come to realize that work environment is the most important factor to me in a job. What I mean mostly is having reasonable bosses that are positive, supportive, and respectful, and having a relatively relaxed environment. I work my best when I don't feel under pressure (like if I'm being graded or micromanaged) and feel like I can openly communicate with others and ask for help without being judged. For me, this is kind of a make-or-break deal, because I feel like if the environment is positive and relaxed, then other factors like pay and work hours are likely to be reasonable as well.\n\nI'm asking for advice because I'm looking into moving to Japan, which is not exactly known to have the kind of work environment that I'm looking for, although I think it's gotten better over the years. The term \"black corporation\" is commonly used to describe companies with tough working conditions like mandatory overtime with little to no pay. However, I recently discovered that \"white corporations\" is a term now, that describes companies that have good work environments. One such corporation (according to some websites) is Panasonic, which happens to be a vendor at a career fair that I'm planning to attend. My background is in computer science and I currently work in IT, so it's not a field that I would be not suited to work in, but honestly, the biggest draw for me is the (supposedly) ideal work environment. When they ask, \"why do you want to work here?\", would it be committing a faux pas to compliment them on their reputation as a company with a good work environment, and tell them that that's one thing that is very important to me? I would try to explain it as professionally as I can (it motivates me to work hard, etc.), but I don't want to come off as being someone who just wants the easy way out, because that's not true at all. I work with integrity and am very flexible in most other aspects, but I just don't believe in being overworked and not respected.",
    "title": "Work environment as a major reason to join a company?",
    "subreddit": "jobs",
    "timestamp": 1555963949,
    "score": 0,
    "keyword": "white judge"
  },
  {
    "text": "I lost my beloved MawMaw (Grandmother) 4 years ago today. I want to share the story of her extraordinary life of giving 0 fucks about anything besides her loved ones and her own happiness. (VERY long, sorry) My grandmother's name was Virginia but everyone called her Jenny. She was born in 1930 and lived through the Great Depression with her 3 sisters and parents. At one point they all lived in a cave in the mountains (we're in Appalachia). Her father would hitch onto coal trains and ride them for miles, throwing a bit of coal off the train here and there and then walk home, picking up the coal so his family wouldn't freeze. \n\nUnfortunately, my great grandmother turned to prostitution to support the family (with the awareness of my great grandfather). My mawmaw lived through all of this and told these stories not as the traumatic experiences they were but through the lens of how fiercely her parents loved her, that they'd go to that extent to care for her and her siblings. \n\nShe eloped with a nice fella from the Navy who shipped off to Asia for awhile. They had my oldest aunt together and she loved him very much. He died at age 21 of a random brain aneurysm in the kitchen while my mawmaw watched, holding my baby aunt. She grabbed a package of diapers and never went back to that house again. Though she had many men after that, she would always cry over her first husband. She was barely 20 when he died.\n\nShe jumped into the workforce with gusto and did a bit of everything. She owned a restaurant for decades, back when females didn't open new businesses in small rural towns. She was indeed a wonderful cook and introduced me to frog legs, escargot, and pig's brains! I openly wept in a cafe in Paris a few years ago when I saw that escargot and frog legs were on the fixed menu... like she was there with me (oh and here's the tears again). \n\nI digress. She worked hard for everything she had but boy, she loved men, lol. She was absolutely unabashed that she always wanted a man in her life and she had many. Remember this is the late 50's or so in a very small Bible belt town! When she was 30, she gave birth to my mother. My biological grandfather was 18 but had to lie and say he was 21 on the birth certificate since their age difference was illegal back then. They had a second child together a year or two later, my only uncle and her last child. She never married my biological grandfather and this was in the early 60's! \n\nShe had difficulties being a mother. She loved all of us very fiercely but at age 32 she found herself alone with an 11 year old, a toddler and a newborn. My great grandmother ended up raising my uncle in the next state over. My oldest aunt helped a lot with my mom but she was left to her own devices a lot too, since Mawmaw was working full time, usually overtime, to support them. \n\nShe remarried when my aunts were teenagers (except my eldest; she had already married by then!). This was the man who was my only living 'grandfather', who passed about 2 years before my mawmaw. He lived a hard life, was a Navy vet, but was very compassionate and kind to me all throughout my life. They had a turbulent relationship but did truly love each other. \n\nMawMaw is into her 80's now and had been living in one of my aunt's properties. They were making arrangements for her to live in an assisted living apartment facility (you have your own apartment with your own things, they just  keep staff on hand to help people out who are elderly or mentally disabled). Arrangements stopped when we found out that she had eloped again! She married a man 15 years younger than her!! We asked why the rush and she said \"You have to take happiness as it comes, especially when you're old. I want my last years to be happy\". \n\nAnd they were. I had lived abroad for years but had moved back a couple of years before her death. She had health issues all through her life so she was in and out of hospital a lot. I remember being in my mid 20's and my now ex husband was being neglectful and abusive (though I didn't exactly say the last part.. just said \"He's not being good to me.\"). I was selfish enough to ask MawMaw for advice. Even though she was in the hospital, she told me that my happiness is worth more than ANY man, and that a person can never give up hope. \"Look at me laying in this hospital bed\", she said. \"Doctors have given me up for dead for over a decade (true) and I still have hope because I know that nothing in life lasts forever, good or bad. The only way you can ruin your life is to give up hope.\"\n\nWhat an extraordinary woman she was. She was a wife, a widow, a business owner, a mother and grandmother. A woman long before her time, who chose to live for herself and loved ones, disregarding the opinions of others. \n\nShe LOVED events and even set up a small banquet hall in her house (before she moved to my aunt's property) and would constantly host dinners and events. She LOVED parties, cooking, and people. She also loved holidays, especially Christmas. She put those crazy decorators on TV to shame! \n\nShe was a Christian woman, particularly near the end, but she didn't judge my sister's best friend for being gay or me for marrying a non-white, non-American man. After she died we learned that when she was younger and more able, she'd fix meals for older people and people she knew were hard up, though she never had much money herself. \n\nBut one of my very favorite things about her was that, even though she had money and health issues throughout her life, she was HAPPY. Every single time I saw or spoke to her she had something nice to stay about the day, even if it was just looking at a pretty dress or something on her favorite channel, QVC (lol). As someone with Major Depressive Disorder, that's something I really wish I could do.\n\nShe always gave the best advice. I'd sell my soul for just an hour with her now... God I miss her. But I'm so glad that I had her. I need an ounce or two of her strength just about now. \n\nIf anyone read all of this, I thank you from the bottom of my heart. \n\nRest in peace, MawMaw Jenny. Until we meet again  <3",
    "title": "I lost my beloved MawMaw (Grandmother) 4 years ago today. I want to share the story of her extraordinary life of giving 0 fucks about anything besides her loved ones and her own happiness. (VERY long, sorry)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1553175916,
    "score": 15,
    "keyword": "white judge"
  },
  {
    "text": "I've always considered myself pro-life, but... ...I don't think I can call myself that anymore because I am completely appalled, horrified, enraged, and disgusted by the ridiculous and terrifying laws that have been enacted in several states in the U.S.\n\nI believe ALL life is sacred. I believe ALL life is worthy of protection, regardless of ethnicity, country of origin, gender, whatever. I'm pro-life because life is not just the unborn, and not just a political point. I don't understand how you can say \"I support this life\" at the expense and punishment of another.\n\nI want to find another way of describing myself and people like me, because I'm sure I can't be the only one who thinks like this. I hate that we have 2 black-and-white terms to describe beliefs on this issue, because the reality is there's a whole lotta grey.\n\nI created an account because I'm going crazy keeping all this inside. Almost everyone else I know (minus my husband) is of the rabid political pro-life mindset...yeah, grew up sheltered conservative. I just wanted to share in a place that hopefully I won't get judged for, because I know if I shared my actual views with certain family/friends, there's be a whole lot of judging.",
    "title": "I've always considered myself pro-life, but...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558193486,
    "score": 15,
    "keyword": "white judge"
  },
  {
    "text": "Happy Mother’s Day to... This Mother’s Day, in addition to all the fantastic mothers I know, I’m thinking about:\n\n- single mothers\n- immigrant mothers who are in fear of being separated from their children, and those who are living the trauma of separation \n- mothers who lost their babies or children, in pregnancy, or after birth\n- mothers of color who worry about their children in a different way from white mothers, and who get judged for parenting in a totally different way too\n- foster mothers and adoptive mothers\n- mothers overcoming addiction\n- mothers of children with special needs\n- grandmothers who are the absolute rock for their children and grandchildren\n- mothers who are living in domestic violence hell and are worried for the safety of themselves and their children\n- and many many others who will or will not get the obligatory card. \n\nMothers, the care workers in this society, are its most valuable members. We move mountains for our babies. Our love for our children is boundless. \n\nHappy Mother’s Day!!!\n🌺🌸🌼🌺🌸🌼🌺🌸🌼🌺🌸🌼🌺🌸",
    "title": "Happy Mother’s Day to...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1557631864,
    "score": 13,
    "keyword": "white judge"
  },
  {
    "text": "I've been the victim 3 times Trigger warning: Sexual assault. This is cathartic writing that I want to share. Thank you for reading.\n\n  \n\nI’ve been the victim three times, each a punishment for the crime of being born female. My mother should have known better than to have a girl, but she did her best to warn me. She told me not to go out at night, not to travel far from home, not to date casually, not to leave her embrace. \n\nThe first time I was guilty of finding a boyfriend, one that was tall, handsome, and in medical school. He was perfect on paper and in front of others. Alone he’d belittle me under the guise of concern. He was going to be a doctor, if he said my body was off it was under the guise of medical opinion and concerned advice. Our last night together he was kicked out of a party for peeing off a balcony, but I was at fault for not running away from security with him. I took him home and tried to calm him down. He pet my hair kindly and asked what was wrong then like Jekyll and Hyde, he’d pull my hair and threatened to break my nose if I didn’t stop crying. I stayed still, afraid any reaction would trigger something worse. This continued for hours while I waited until he fell asleep, grabbed my things and left. I never looked back though he tried to find me. \n\nThe second time I was guilty of confronting carnival in Rio de Janeiro. Guilty of dancing, sight-seeing, and wearing makeup. My greatest crime this day was my refusal to kiss a stranger. He was tall and white, body so smooth he must have waxed his arms the day before. He grabbed me and I said no, but he wouldn’t let go of my body. I struggled against his muscular arms and he grabbed my face, pinching my cheeks painfully and moving his weirdly hairless lips closer to mine. I grabbed his baseball cap and threw it far away. The shiny sticker on the lid shined in the sun as it vanished underneath the hundreds of sambaing feet. Finally free, I turned around and then saw stars. My body crumpled to the ground as I realized I’ve been sucker punched, right in the back of my head. A bystander was quick to judge, “you should have just kissed him.” My head burned and my eyes stung with tears. Maybe I should have. \n\nThe third time I’m not quite sure exactly what crime I was punished for. I’m guilty of living abroad, of drinking alcohol until 3 a.m., of skinny dipping with girlfriends and dancing around the fire to both dry our bodies and celebrate our goddesses. Women were burned at the stake for doing something similar, luckily my punishment was less severe. I was grabbed from behind and my vision blurred from the speed. My body hit the soft sand and I was stunned. Was this a joke? I couldn’t see anything in the dark but I felt his weight on my body. His feet aligned with mine and his voice was soft. “Don’t make noise, be quiet” he commanded. His hands were applying pressure on my legs and I screamed. Twenty years ago I’d brawl like this with my brother, rolling on the ground like two senseless animals. This felt similar. I tried to roll my body but his weight kept me still. My arms were free and they flew against his face and back. Just as quickly as it started, he was gone. I could see a figure running and I sat up on the ground. Within seconds I was surrounded by familiar voices and friends. The physical trauma was over, and now I’m left to contend with the emotional trauma. \n\nCan I counter sue, is this not triple jeopardy? How much longer will I be punished for possessing two X-chromosomes? I suppose the world will try again because I haven’t learned my lesson. I continue to travel, to drink, to smoke, to dance, love my body (somedays more than others), Y-chromosome be damned! I was made the victim thrice but I refuse to live with this label. Sorry mama, but I’m not going to change my life. I know you love me and you’re just afraid. You’re right to be afraid of this world, but I won’t be reduced by what has happened to me. \n\nBecause I am not the victim, I am the fighter. I haven’t lost a battle yet.  \n\n*She was powerful,* \n\n*not because she wasn't scared* \n\n*but because she went on so strongly* \n\n*despite the fear*\n\n**Atticus**",
    "title": "I've been the victim 3 times",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1557931871,
    "score": 6,
    "keyword": "white judge"
  },
  {
    "text": "Getting into top-tier tech company with multiple years of experience...? Hey guys,\n\nI live in AZ with two kids and my wife and have worked in the industry for about 5 years. I'm mostly self-taught (my degree was more focused on design and I worked as a designer for ~4 years prior), though I am starting a Master's degree in CS next year, as I enjoy learning CS topics and an official \"certification\" on my resume would be nice... Plus my employer will pay 100% of it, so why not? 🤣 Currently, I hold a position as a Senior Front End Developer and enjoy my job, however, I really want to move into a more \"skill agnostic\" position as a full stack engineer. I'm honestly tired of just being put into one bracket because most of my work experience is on the front end. I love FE work, don't get me wrong, but there's generally a stigma in the companies I've worked at where I'm not a \"real\" engineer. I want to be judged on my skill, problem solving  and ability to deliver results than on how well I know xyz framework and the only companies that seem to get this are \"FAANG\".\n\nI've always kind of felt like working at a larger tech company, like Google , Amazon, etc was above my skill and education level, but the more I work in tech, the more I feel like I have a really good chance to getting in, as I don't see things as black and white as so much of the industry in smaller companies seems to.\n\nI hear a lot of talk above recent grads getting into these companies, but what about those of us who have experience? I guess, mostly my hesitation at this point in my career is I have a family (plus, I'm almost 30) and I only ever hear about people working at these companies who just pour all their time into their work. I LOVE what I do, but I also love my family and wouldn't want to sacrifice them for better career prospects. I assume moving into an L5/E5 would be out of the question for me, since my senior experience probably doesn't equate to someone at a company like these, but that's ok.\n\nHas anyone made the move in a similar situation to me?? Would love to hear your thoughts!",
    "title": "Getting into top-tier tech company with multiple years of experience...?",
    "subreddit": "cscareerquestions",
    "timestamp": 1573951901,
    "score": 4,
    "keyword": "white judge"
  },
  {
    "text": "Is it just me or is CS a shady field? I was an electronics technician for the first decade of my adult life and maybe because of the nature of the work, I didn't notice it, but it seems to me like I have a lot of run ins with shady and immoral people in this field. I mean, I did some time in the military so I've seen some shady stuff, but it was mostly a couple of reallly shady people and then just normal people stuff. My time working as a professional before IT was, well, professional. Since I've been in IT I've seen so much back stabbing, complacency, favoritism and just flat out lying done all so one person could get ahead or because someone didn't want to look bad. It's not terrible stuff, but just this low level, can't trust anyone shit. \n\n  \nAlso, wtf is up with the interview process? Not only have I been working 50-60 hour weeks the last four years to play catch up in my career, and been taking classes on the side to get my degree, but now I have to do ridiculous take home challenges and  do free work for others (\"open source\") and do my own projects in my free time and put them on Github and study for these ridiculous coding interviews!?! My sisters an electrical engineer, do you think she's ever had to stand in front of a room full of sweaty dudes and calculate the volume of liquid an oblong container can hold on a white board without a calculator during an interview? My other sister was VP of logistics at a shipping company and she has never once asked a candidate what about trucking makes them so passionate about the field and then judged their answer to see if they'd be a good \"culture fit\". God. \"Culture Fit\". I have a feeling that those words mean that the company is probably sooo cool and fun because they're trying to cover up the absolute inadequacies of the leadership.  \n\n&#x200B;\n\nI don't know. Maybe it's because I'm older that I notice it? Maybe I'm just not cut out for the culture? I don't have enough experience to be a leader, but my last job the sr dev there couldn't code his way out of a paper bag, but I don't have the energy to work as much as I do, go to school and then come home and code some more just to try and get a better job at a company that I already know I'm not going to fit in for.   \n\n\n&#x200B;\n\n  \n\n\n  \n\n\n&#x200B;",
    "title": "Is it just me or is CS a shady field?",
    "subreddit": "cscareerquestions",
    "timestamp": 1550978404,
    "score": 4,
    "keyword": "white judge"
  },
  {
    "text": "Why do companies recruit the stupid way the do, why not do something more akin to real world projects? So...i kind of hate answering leetcode style questions over the phone or on a white board. Mostly because its in no way similar to the work you do at an actual job. My last job had loads of mediocre coders who apparently interview real well\n\nWhy not do this instead? Give the candidate a smallish size project and ask them to send it in after x amount of time (say a week/few days). They can do *anything* to get it done and get it polished to code review standards. The company can judge if they really want to have to deal with code of that caliber and then move on to the onsite if they do.\n\nThe onsite should be focused more on big picture/system/code design questions that at least *try* to seem like something that might come up for real. Do the typical HR interview stuff/lunch interview, and then have a final pair coding test thats completely \"open book\" so to speak. Or alternatively dump all that shit and have them do 1 point worth of work and do a mock scrum somehow.  \n\nI get the \"idea\" that they want to see how you think when stumped by a hard question. but I've found this isn't a realistic way to find great candidates. you instead find people who most recently did a practice question that was just like it or some shit",
    "title": "Why do companies recruit the stupid way the do, why not do something more akin to real world projects?",
    "subreddit": "cscareerquestions",
    "timestamp": 1546974962,
    "score": 0,
    "keyword": "white judge"
  },
  {
    "text": "Three Indiana judges have been suspended for \"behaving in an injudicious manner\" after a failed attempt to visit a strip club led to a drunken brawl outside an Indianapolis White Castle that ended with two of the judges being shot",
    "title": "Three Indiana judges have been suspended for \"behaving in an injudicious manner\" after a failed attempt to visit a strip club led to a drunken brawl outside an Indianapolis White Castle that ended with two of the judges being shot",
    "subreddit": "LawSchool",
    "timestamp": 1573956934,
    "score": 73,
    "keyword": "white judge"
  },
  {
    "text": "Resources & Reflections for Radical Law Students (Updated) From the [smoke](https://www.reddit.com/r/LawSchool/comments/6sf56n/resources_for_radical_leftwing_law_students/?utm_source=share&utm_medium=ios_app) this post got two years ago, I have to assume the above moniker doesn’t describe most of you. To those it does apply to, though, I think it’s important to know that you are part of a proud tradition of fierce advocates who work within the essentially conservative field of law to make space for marginalized people and movements for justice. This post is for you.\n\n**Personal Reflections**\n\nI have practiced deportation defense for the last two years. Our legal community has created openings for fierce lawyering and creative litigation, even as the black-letter law has been manipulated to deny protection to those fleeing the imperialistic and environmentally ruinous policies of the Global North.\n\nIf I’ve learned anything, it’s that the courts and traditional lawyering alone won’t save us. Indeed, much of our success in the last two years, from fighting ICE raids to holding off the Muslim Ban for more than a year, was because lawyers and movements worked hand-in-hand to push the boundaries of the law, both in the courts and on the ground.\n\nThis kind of creative, base-building work is systematically devalued in even the most “liberal” legal education. Indeed, law schools seems to favor condescension and professional hazing over building strategies that win. I hope the following resources will help you survive law school so you can get back into the fight.\n\n**Resources & Readings**\n\n[10 Things You Can Do Right Now](https://docs.google.com/document/d/1KLWpt4rNiMvGlyldV-404dC41b7qMZ8x_FhUxojqCW0/edit?fbclid=IwAR3Nf5D-BmMA0QNMGZJ6retSwpVHbaaacAlsv40B2wM8rSXHgvfrJy3n3Pg)\n\nReflections by movement lawyer Purvi Shah from just after the 2016 election.\n>We are often taught law in a manner that is disconnected from history--especially the history of social movements. So our analysis of power, our understanding of strategy, and our approach to change is incomplete. Take it upon yourselves to learn from the past and to learn from an international lens. Learn about social movements in the past--and examine what lawyers did in the struggle for a free South Africa or read up about the National Union of People's Lawyers in the Philippines. Study the non-legal strategies used by social movements and figure out how lawyers can help create space for those strategies.\n\n[NLG Radical Law Student Project](https://www.nlg.org/radical-law-student-project/)\n\nThe National Lawyers Guild was the first racially integrated and gender-inclusive bar association in the United States. NLG also publishes a \"[disorientation](https://www.nlg.org/disorientation/)\" manual for progressives, radicals, and leftists entering law school.\n>It has become a truism that many are drawn to law school initially to further social justice, only to end up working in areas of the law that have little potential to serve these ideals.The most common reason cited for this is economic: the average law student emerges into practice with well over $100,000 in debt. However, this is not the only factor. In most universities, the culture and pedagogy of legal education tend to emphasize commercial law over public interest fields and the intellectual pressure of law school undermines student’s commitment to their ideals. ~Traci Yoder\n\n[A Handbook for Social Justice Advocates Thinking About Law School (pdf)](https://ccrjustice.org/sites/default/files/attach/2015/06/Handbook-for-Social-Justice-Activists_BJI.pdf)\n\nA wonderful resource compiled by students and recent law school grads practicing public interest and social justice law.\n>I couldn't comprehend how someone who wanted to practice social justice law could, three years later, feel obligated to resign to a different path—either because they had successfully been reprogrammed, or because they felt that their condition of indebtedness left them no other option but to “get a real job.” ~Nikki Demetria Thanos\n\n[For Those Considering Law School (pdf)](http://www.deanspade.net/wp-content/uploads/2010/10/For-Those-Considering-Law-School-Nov-2010.pdf)\n\nA good reality check for radicals and leftists thinking about law school. Authored by Dean Spade, founder of the Sylvia Rivera Law Project.\n>Law school is not like college. It isn’t about writing cool papers full of critical ideas. Many law schools, like academia in general, are perceived as “bastions of liberalism” in the context of our outrageously white supremacist, conservative country, but the intellectual and political environments are so mildly reformist (at best) that they will feel shockingly conservative to anyone who wants to see significant change [...] The traditional pedagogy of law school relies on humiliating students if they bring in other ways of thinking or knowing about the world, thereby whittling them down to a shadow of their former selves and reshaping them to make them think inside a very narrow box. ~Dean Spade\n\n[Letter to a Law Student Interested in Social Justice (pdf)](https://www.law.duke.edu/curriculum/pdf/interested_social_justice.pdf)\n\nA letter by Prof. William Quigley inspired by something one of his students told him: “The first thing I lost in law school was the reason that I came.”\n>There is a rich history of social justice advocacy by lawyers whose lives rise above the limited horizons of the culture of lawyers. We can take inspiration from social justice lawyers like Mohandas Gandhi, Nelson Mandela, Shirin Ebadi, Mary Robinson, Charles Hamilton Houston, Carol Weiss King, Constance Baker Motley, Thurgood Marshall, Arthur Kinoy and Clarence Darrow. ~William Quigley\n\n[“On Being a Happy, Healthy, and Ethical Member of an Unhappy, Unhealthy, and Unethical\nProfession”](https://lawyerist.com/weekend-reading-on-being-a-happy-healthy-and-ethical-member-of-an-unhappy-unhealthy-and-unethical-profession/)\n\nNot specifically radical or left-wing, but still a nice piece by U.S. District Judge Patrick Schlitz.\n>You cannot win the game. If you fall into the trap of measuring your worth by money, you will always feel inadequate.\n\n[Power With: Practice Models for Social Justice Lawyering](http://scholarship.law.upenn.edu/jlasc/vol15/iss1/3/)\n\nA constructive work by Michael Grinthal of South Brooklyn Legal Services.",
    "title": "Resources & Reflections for Radical Law Students (Updated)",
    "subreddit": "LawSchool",
    "timestamp": 1565883467,
    "score": 36,
    "keyword": "white judge"
  },
  {
    "text": "What now? TL;DR: Over the last three months I was 1. Fired from a job I was aggressively recruited for, 2. Rejected from jobs I was qualified for, and 3. Finally offered a job beyond my wildest dreams in my favorite city.  I am more lost and scared now than ever before.  How do I make this work?!\n\nThrowaway for obvious reasons.  Anyway, story time:\n\nAfter graduating in 2017, I clerked for a federal district judge in an uncompetitive district in the Midwest. \n\nWhile clerking I was courted by a local 12-attorney law firm for post-clerkship employment.  I’m a woman of color and this was an all white plaintiff-side civil rights firm, trying to get noticed by the plaintiffs bar and my judge.  They specifically said “we want to support women of color.”  They didn’t ask me anything about myself or my skills or my background or work habits.  They simply begged to hire me.  They didn’t even bother calling my judge for a reference. I was arrogant enough to think my resume spoke for itself and that they hired me because I was capable and qualified.  \n\nThe work was extremely fast paced and disorganized.  I was assigned to pretrial briefing in a state court case, despite my total lack of experience, with no one to guide me or answer my questions.  My only instruction was: “do all the pretrial shit in X case.” They would just shout when I made mistakes (I never made the same mistake twice).  I also had various random assignments for other attorneys that I had to make time for.  I was frustrated and crying almost daily.  My colleagues were mean and nasty from the get go, I can’t tell you how many times I was called a cunt during my time there.  Any time a partner praised me, one of my senior associates would be there to humiliate me.\n\nMy father died during this time, they knew and sent supportive text messages, but soon after I returned from the funeral, I messed up a draft of a settlement letter (not my case and not urgent) and got fired.\n\nThree months after starting my first post-clerkship job I was fired.  I wanted to die that evening.  Instead, I scheduled a three hour session with my therapist and I got back on the job hunt. \n\nI worked with recruiters who got me interviews with a few firms in my hometown, but all were for small civil defense firms.  2/3 passed saying I didn’t have the necessary experience, even though I was qualified on paper and they liked my writing.  The last firm was only willing to hire me as a contract worker. \n\nFinally, in a nothing-to-lose, balls-to-the-wall moment, I sent out an application to a firm for an entry level position I knew I had no shot at.  Their attorneys are a totally different breed than me.  (I graduated somewhere in the middle of my T14, they graduated magma cum laude from YHS.)  And then I left town for the weekend to attend my ex-boyfriend’s wedding.  \n\nI woke up on Monday (hungover and miserable) to an interview invite and then found myself in my dream city two weeks later for interviews.  Over the course of two days I interviewed with 8 partners and 4 associates.  The following week, I had five more phone interviews.  They were all serious interviews, everyone was kind and personable, but they pushed and challenged me.  They also called all of my references and read all three of my writing samples.\n\nI’m relieved that they want to hire me despite knowing everything there is to know about me. But I’m scared to death that I won’t be good enough and will get fired again.  I don’t know how to avoid failing like I did at my old job and I really want this to work.  I would appreciate any advice any of you new attorneys may have on how not to get fired or any advice on how to move past my recent failures .  Thanks!",
    "title": "What now?",
    "subreddit": "LawSchool",
    "timestamp": 1565313959,
    "score": 26,
    "keyword": "white judge"
  },
  {
    "text": "Can white people genuinely not tell wether we’re attractive or not? So today I was sitting with some (white, like really white) girls at school. For fun we were looking through tinder, as one does. And I noticed that when it came to the black guys they’d often say things like “he’s sooooo hot” at certain types of boys, even when they were legitimately ugly/unattractive. This type was usually the bleached tips/short dreads/wannabe SoundCloud rapper type. When it came to the more normal/grunge looking black guys they’d always just say things such as “basic” or “he’s okay”. It wasn’t like this at all with the white boys were they, regardless of style, just judged them off their faces and bodies. \n\nIs it a fetishization type thing? Or are white people just genuinely not able/care to tell when black people are good looking?",
    "title": "Can white people genuinely not tell wether we’re attractive or not?",
    "subreddit": "blackladies",
    "timestamp": 1556147836,
    "score": 57,
    "keyword": "white judge"
  },
  {
    "text": "Quick Poll: Does this happen to you, too, ladies? Hey ladies,\n\njust wondering... do ya'll have the experience of constantly having strangers walk up to you in stores (grocery, clothing, best buy, whatever) and asking you employee questions, even though you \\*clearly\\* are a customer, not someone who works there? \n\nI mean, I get that sometimes people make mistakes, but half the time this happens to me, I'm wearing a winter jacket, carrying a shopping bin, obviously not in a uniform, listening to music, and actively shopping. \n\nIt's not the biggest deal in the world but it's been getting under my skin lately. This past holiday season it was like I couldn't shop anywhere without being followed or having some older white lady ask me to remove my headphones so I could direct her to the restrooms or show her how to read a price tag... \n\nFor the record, I'm over 30, living in a pretty segregated area of New England. I'm no Tyra Banks but I'm a pretty snazzy dresser, so I usually feel baffled when this shit happens. It drives home how many visual cues these people are ignoring so that they can focus exclusively on my skin color in order to judge me and figure out why I'm there.\n\nI will admit, I truly relish watching the embarrassed faces people make when I narrow my eyes at them and say: \"I don't work here.\"",
    "title": "Quick Poll: Does this happen to you, too, ladies?",
    "subreddit": "blackladies",
    "timestamp": 1546802363,
    "score": 36,
    "keyword": "white judge"
  },
  {
    "text": "Growing up as a fatherless daughter and the trauma behind that. Hey guys, this is gonna be a long post of me venting about my dead-beat father. So if embrace yourselves! I am seeking for advice too and perhaps connect with other people who grew up fatherless. \n\n&#x200B;\n\nI am a love child. I am a product of man cheating on his main chick with a side chick (my mother) and nearly 23 years later, this ish is so messed up and there is still lot of drama and a lot of trauma to unpack. My dad already had two older children with the main chick (my older half sisters, they were kids and teens at the time when I was being born), so yeah y'all see where I am going through this. \n\n&#x200B;\n\nOn the night I was born, my father was nowhere to be found. He had never signed my birth certificate (til this day, my mom's name is the only person on that ish) and I guess he was too busy doing something else that night instead of making sure if his child had entered the world okay and if the mother of his child was straight and didn't have any birthing complications. I mean, my mom was in labor for like over 12 hours or some ish and they ended up having to C-section me out, all cuz I've refused to come out of the womb lol. But other than that I was a healthy 7lb (3.1kg) baby girl with no complications at all. Anyways, growing up, I didn't have a father except my maternal grandfather. That was the only man in my life who had took me in as his own 'daughter' and had raised me. I barely saw my dad around and I didn't even know I had a father until I've learned how conception worked (when I was 10 years old, kids aren't suppose to know that stuff lol). I mean, I would see my dad occasionally at the gas station when I was a little girl and he would give me $5 every time to buy me ice cream, but I did not know that man was my legit biological father. I always thought and assumed \"Oh, I just don't have a dad unlike the rest of my classmates in my 1st grade class\". Growing up and being in grades such as K-3rd grade, I just thought it was hella strange that I did not have a dad unlike the rest of my classmates and peers. All my classmates' fathers would pick them up from school, spend time with them, take them to their sport classes, and do whatever father/child bond shit that goes down. I didn't have that experience unlike everyone else and it would make me feel so sad and I've felt so neglected as a kid. \n\n&#x200B;\n\nAs the years gone by and I've gotten older, I got to meet some of my dad's family for the first time and I even met my older half sisters too (I was not aware of their existence until I was 11 years old) and as an only child, I always wanted siblings! Especially older sisters! But I've felt like they weren't too thrilled to meet me as much as I wanted to meet them. I understand our father fucked around y'all mama with mine, but it that's not my fault though. My dad was slowly trying to be in life by showing up to my high school graduation back in 2015, inviting me over to holidays gatherings at his house or coming over to my grandma's house to our gatherings and calling me more frequently (like 3-5 times a year) and even wishing me happy birthday.\n\n&#x200B;\n\nThat all changed when I've moved up to NYC in hopes to become a model. I was not ready to move up there all by myself with no money and I was depending on my dad A LOT financially. He helped me out with rent/bills sometimes and I had my oldest sister on my Facebook friendlist and she was witnessing all the drama and fuck shit that I was going through with people in NYC/the problack online community I was once apart of and my mental health going awry. She didn't want to be involved with me and told me she would have to think about having a relationship with me. Around early 2018, I've moved out to Arizona in hopes to change my life around and for the better. I was turned on by their huge job market and their affordable living cost, so I was super keen to make that move happen! Also around that same time my maternal grandfather had passed away and that put my family through so much grief, financial burdens, and hard times. Last year was really terrible for me, yo! It was a huge wake up call letting me know that nothing lasts forever. \n\n&#x200B;\n\nWhen I was facing homelessness last June while I was out in Arizona, I've called and asked my dad for some money to see if he could help me out so I could find another living arrangement. I understand him being mad n salty at me all cuz I did not called him for Father's Day, but I was really going through a lot at that time and I really needed his help! My mom and grandmother couldn't help me cuz they were still paying for my grandfather's death expenses (even though he died three months prior) and they were still trying to get by. My dad being a little privileged man he is and being a republican (yes he is blackity black, yall lmao), he could've at least helped his own kid out and shit! When I told him my mom and my grandmother couldn't help he said some shit like this \"THAT MAN IS LONG DEAD AND GONE! THAT SHOULDN'T BE NO EXCUSE ON WHY THEY CANNOT TAKE CARE OF YOU! THEY (my grandma and my mom)  NEED TO TAKE CARE OF THE LIVING!\". The moment he said that shit, I had to get off the phone with his ass and I started crying my eyes out in the streets of Scottsdale in like 1,000 degree weather (Y'ALL, ARIZONA GETS SUPER HOT IN THE SUMMER hahaha). I had to call my then boyfriend at the time to calm my ass down. Like my dad could've simply said \"Sorry, I cannot help out this time\" and I would've left it at that. I would've respected that more than him shitting on my late grandfather.  I COULDN'T BELIEVE HE HAD THE AUDACITY TO SAY SOME SHIT LIKE THAT TO ME!!!!!!!!! WTF MY GRANDDAD DID A FABULOUS JOB OF RAISING ME AND BEING A POSITIVE CIS DUDE ROLE MODEL IN MY FUCKING LIFE THAN MY FATHER COULD EVER BE! AND TO SPEAK ILL ON MY DECEASED GRANDFATHER WAS INDEED FUCKED UP!!!!!!! So my father and I haven't spoken to each other since. Throughout the remainder of 2018 and even earlier this year, whenever he would see my aunt, grandma, or mom at church he would asked them about me and my whereabouts and how I'm doing. I keep telling them not to tell this nigga what I am up to. I don't want him to know what I am doing nor how I am doing. He could find out by the randos from the town he lives in. He doesn't give a fuck. So why all y'all being so passive towards him?! If he seriously cared, he could've called me and find out his own damn self. He has my number and it hasn't changed nor has he been blocked. Fuck that bullshit! For real. There's no excuses.\n\n&#x200B;\n\nThis weekend my mom and I went down to my grandma's house. I forgot to mention my mom and I live 200 miles (320km) away from the town where my grandma and dad lives. Anyways, my dad saw my family at church yesterday and he was asking them about me and gassing them up by telling them he was gonna come see me before my mom and I head onto the road. Lmao, this nigga never came through and once my mom and I got on the road, he fucking called me first (but I've rejected his call) then he called my mama's phone. My mom picked up and they spoke and my dad wanted to talk to me. I seriously did not want to talk to him, yo. I am still angry and furious about the shit that he said about my grandpa being dead and everything. Idgaf if 11 months has passed since he said that, I am still angry! I kept signaling my mom \"NO\", but she insisted and she was driving. So I answered the phone all rudely and my dad kept asking me all these questions on like if I am working and what I was up to and all I said \"I am being a productive person, yes\". It isn't none of his business if I am working or not. Then I just brought up the shit that he said to me last year. My mom kept signaling me to not bring that up and to get over it, but I didn't care. I am hurting, I am in pain in what he said, and if he seriously wants a relationship with me then he needs to take accountability, apologize, and we can move on from there. DON'T TALK ABOUT MY GRANDDADDY LIKE THAT! This nigga wanted to act like he did not remember what he had said nor didn't have any idea on what I was talking about, then I said \"Excuse my french, but what you've said about my grandpa being dead and my mom & my grandma not being to able to help me was very fucked up\". My mom tried to tone police me right then and there by saying I should say he was being \"insensitive\", but I wasn't having it. He was silent for a second then said some things like \"THE MAN IS DEAD blah blah blah blah\" and I fucking hang up the phone on his ass right then and there and started crying. He did try to call back, but I didn't pick up. My mom was trying to tell me to get over and just let it go and be 'passive'. But honestly fuck all that! My dad and his family has caused a lot of trauma and pain among us and you trying to be in my life after these long damn near 23 years ain't gonna cut it!\n\n&#x200B;\n\nMy dad is involved in the agriculture farming scene and he only recognizes me as his daughter for clout. Seriously! On his bio for his agriculture club shit, it said he had three daughters. Lmao, he should've put two, my nigga. Cuz I feel like such a stranger to him and he does way more for my older sisters than he done for me. On top of that, his older sister scrutinized my mom for dropping out of her HBCU university back in late 80's and not going back to school to finish her degree. I mean shit happens and life gets in the way, why judge my mom for making a personal life decision that isn't your concern? Also, my dad's cousin scammed my mom out of $700 back in the 80's for an apartment or some shit and my mom still hates that man very much til this day lmao. Like fuck my dad's family, yo. They are a bunch of assholes and I feel for my mom so much, cuz she wanna front and act like she's over it. But yet she is still hurting and in pain on how these people treated her, neglected their own kin, and she got a kid by this man too! I feel like my mom will forever be in pain by these people and she gonna take this shit with her to the grave. Which is sad af. I wish we could all sit down and have like some type of 'Iyanla Vanzant' therapy session, but I do not think that will never happen (especially during this life time). We are so busy with our own little lives and I feel people don't wanna come forward and face the truth and facts.\n\n&#x200B;\n\nI feel like a lot of my BPD stuff, attachment issues, and picking wrong potential significant other partners and hanging around toxic evil people stems from the fact that my dad hasn't been around. Yes my mom, my grandparents, and my step dad all did a fantastic job on raising me, but my biological dad by simply not showing up and being there for me all cuz I've live too far away from him or he doesn't associate with my mom, is just all BS! If he serious gave a fuck about my existence, he could've at least made an effort to come by and be in my life. And I'm so conflited by his passive aggressive antics. I appreciate him trying, but if you are gonna shit on my actual family members who actually gave a fuck about me when they were alive, then why should I give a fuck about you and give you a chance? Y'all feel me?\n\n&#x200B;\n\nI have a lot of trauma that I need unpack from being sexually assaulted/violated a couples times to working in sex work, from dating shitty abusive partners/hanging around fake ass people, to even being a unambiguous black woman in this White Man's World. I am trying to better myself and get on my feet. New positive beginnings are on my way and at the end of the day, if my dad won't acknowledge his wrong doings, then so be it. I am not trying to force people in my life if they don't wanna be apart of it. \n\n&#x200B;\n\nParts of me wants to write a handwritten letter to him on how I feel about everything, but another part of me wants to just let it go and move on. What do y'all think?",
    "title": "Growing up as a fatherless daughter and the trauma behind that.",
    "subreddit": "blackladies",
    "timestamp": 1557169633,
    "score": 32,
    "keyword": "white judge"
  },
  {
    "text": "I can’t determine what’s being aware and what’s being prejudice. I want thoughts and opinions. I’ve come to hear your thoughts about race relations. \n\nI’ve become conflicted about how hyper aware I have become and feel I“should” be about white and black relations especially in terms of micrgoaggressions.\n\nA few weeks back, I went to a white college bar with some friends because it was happy hour. Being on social media, I feel I’ve become trained to be very critical of white people and their actions and to judge how they treat and interact with black people.\n\nWhile I was at the bar, there were very few black people and some interactions that really made me think. \n\nThere was one black girl dancing and the people around her were hyping her up, and some danced with her. My first thought was “why is she entertaining them?” in a Shiggy type of way, but then I had to think ... she’s probably just dancing and enjoying herself and others are just enjoying her energy. \n\nThen, a guy was trying to get the attention of that same girl and a white girl next to her noticed him. She stretched her arm out and pointed at her to confirm she was who the guy wanted, and when he confirmed, she leaned over and tapped the girl on her hair. Again, my first thought was “why is she touching her hair?” But immediately after, the girl stumbled and I realized she was trashed and just reached out without thinking, not deliberately trying to touch her hair or anything. \n\nThen, from a different perspective, I went out to a white club with some of my cousins recently. They were kind of making fun of how the people were dancing and I took that as a sign to hold up a wall because that was a scene I like, I will jump up and down and I can shuffle my ass off, but I wasn’t trying to be made fun of by family. They were doing (please don’t drag me for the semantics) black dances to the music and tbh I’m not coordinated enough for that. But white people in passing would try to do what they were doing and my cousins would dance with them because it was good vibes. They didn’t see it as them trying to be or make fun of my cousins and the dancing. I have seen other situations that were the same play out differently, where the black person would stop dancing, kind of look at them like “what are you doing”, and get them to move along. \n\nNow, I’m torn. I’ve been living in the south for the past 5 years as racial tensions have been rising. I feel as though I’ll be pained as anti-black if I don’t take note of microagressions and the way white people treat us, but I also feel prejudice judging white people I don’t know based on interactions that could be innocent.\n\nI’ve come for your thoughts, opinions, and viewpoints. \n\nEverything is love.",
    "title": "I can’t determine what’s being aware and what’s being prejudice. I want thoughts and opinions.",
    "subreddit": "blackladies",
    "timestamp": 1557968846,
    "score": 7,
    "keyword": "white judge"
  },
  {
    "text": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist This post was created as a response to this thread and [comment](https://www.reddit.com/r/asianamerican/comments/bvxtgs/snapshot_of_miss_india_finalists_renews_debate/epuj6hq?utm_source=share&utm_medium=web2x) discussing beauty ideals\n\nI started typing up a message then lost it. I was gonna forget about it, but it really bothered me, as I see this kind of responses ALL the time in discussions involving asian beauty ideals. and judging from the replies and votes, the thread was no exception. So im typing up this post.\n\nFor some reason, we Asians have a hard time admitting that our beauty ideals have been heavily influenced by colonialism and eurocentricism. I think it happens because we don’t like to admit how much western ideals have been ingrained into us. Even as I’m writing this, I can’t help finding larger eyes, slimmer faces, and long legs more attractive than their counterparts.\n\nOther cultures have to face the self hate stemming from Western ideals outright, because they don’t have our convenient excuse of \"pale skin was always considered beautiful in Asia!!1\" I know I've said that more than a few times before I was forced to look beauty ideals beyond skin tone.\n\nI'm going to compare a few major old vs. modern beauty ideals below. Since I’m Korean, I’ll be mentioning a lot of modern Korean ideals and referencing older Korean texts, especially from the Choson period since that was the last period before Korea was introduced to the West, but I believe they’re pretty applicable to the rest of East Asia as well.\n\n&#x200B;\n\n1. Eyes\n\nLarge, double lidded eyes is the ideal eye shape in East Asia currently. However, this was not always the case. Many people will argue that large eyes are youthful and all cultures prefer large eyes, but this is an unsubstantiated claim.\n\nThe argument becomes even more unconvincing when we look at older Asian texts. In Korea, during the Choson era (which is the latest era before Western influences entered Korea), beauty was judged according to nine factors, called \\[gu-saek (구색)\\]([https://m.blog.naver.com/PostView.nhn?blogId=noa\\_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F](https://m.blog.naver.com/PostView.nhn?blogId=noa_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F)).\n\nThe text never mentions eye size or even differentiates between double lids and monolids. The only requirement is that the \"eyes must be dark like midnight\" and that \"the eyes must be spaces appropriately.\" Other texts also mention that the contrast between the black and the white of the eyes are important, but again, never size or double-lid.\n\nSome texts even specify that (monolids with a slight slant upwards is preferred.)\\[[https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\\] This is in direct opposition to the large, double-lidded, almond eyes that are hailed as “beautiful” in Asia today.\n\n&#x200B;\n\n2. Face shape\n\nThere’s all kinds of plastic surgery in Asia focused on narrowing your face. Having a small face and head is an important part of “having good proportions.”\n\nHowever, an ideal face shape in the past was a round one, like a “full moon,” with a straight, broad forehead.\n\n&#x200B;\n\n3. Body shape\n\nCurrent beauty ideal is tall, leggy, with a short torso. People with longer torsos are considered to have worse “proportions” and there are calf reduction surgery being done to elongate our “stubby” Asian legs.\n\nHowever, in the choson period, long waists highlighting a woman’s curves was considered beautiful.\n\nFinally, we have older paintings and photos to draw upon. None of these women would be considered beautiful in Asia today. \n\n* [https://www.instiz.net/pt/4393935](https://www.instiz.net/pt/4393935)\n* [https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\n* [http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document\\_srl=13409659](http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document_srl=13409659)\n\nI'm sure there are a lot more we could discuss, but the examples above clearly show how radically East Asia has been influenced by Western ideals of beauty as much as any other cultures. It’s time for us to start confronting our self-hate of our natural, predominantly occurring asian features instead of trying to deny it.",
    "title": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist",
    "subreddit": "asianamerican",
    "timestamp": 1560845348,
    "score": 27,
    "keyword": "white judge"
  },
  {
    "text": "Are Portuguese people Hispanic? I’m Portuguese, and to be honest, it’s confusing to think about my ethnicity. I mean, I lived the white experience all my life, since I’ve seen myself as such out of lack of knowledge and also watching other Portuguese people judge people from other ethnicities, including people from Brazil. But I begin to think we could actually be Hispanic. I mean, our country literally came from Hispania. What is your opinion?",
    "title": "Are Portuguese people Hispanic?",
    "subreddit": "Hispanic",
    "timestamp": 1568768491,
    "score": 8,
    "keyword": "white judge"
  },
  {
    "text": "Fired Google engineer James Damore's discrimination case can proceed - Judge denies tech giant’s motions to dismiss lawsuit alleging bias against conservatives, men, white people",
    "title": "Fired Google engineer James Damore's discrimination case can proceed - Judge denies tech giant’s motions to dismiss lawsuit alleging bias against conservatives, men, white people",
    "subreddit": "MensRights",
    "timestamp": 1559962163,
    "score": 303,
    "keyword": "white judge"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 121,
    "keyword": "white judge"
  },
  {
    "text": "Musings: Why the Fall of Classical Chivalry Mirrors the Modern Feminist \"Toxic Masculinity\" Situation I'm going to start this off by saying that, as someone with a passion for history, I have a fondness for classical Chivalry. You might notice that, in that sentence and in the post's title, I say \"classical\" Chivalry and not simply \"Chivalry.\" There's a reason for that. Classical Chivalry, as the knights of Europe lived and died by, is in fact dead. The \"Chivalry\" and so called \"white knights\" we have today are, in fact, subversions and corruptions of the concepts and terms used by feminists in, what I feel, is an underhanded way to undermine all traditional concepts of masculinity. Since I've established that modern \"Chivalry,\" or \"defend women at all costs,\" is not the Chivalry knights upheld and modern \"white knights\" are an insult to the original white knights, I feel it'd be best to explain *what* classical Chivalry was and who the classic white knights were.\n\n&#x200B;\n\nClassical Chivalry, as I call it, was an informal code of conduct upheld by the various knights of Europe and the specific rules and expectations varied between realms. A number of common facets, however, were:\n\n1. Loyalty to one's liege lord. Knights were expected to remain dedicated to their lords. Not much else to say here.\n2. **Forebearance:** A knight **was expected to show restraint and self-control** when dealing with other warriors and at their lord's court. The knightly virtues of mercy and forbearance were well-established long before there *was* a code of Chivalry.\n3. Hardiness: beyond the obvious requirement for them in combat, it was believed that strength and endurance, along with confidence, were marks of a noble individual.\n4.  *Largesse* or Liberality: A knight was expect to not only be charitable and generous, but also incorruptible. A knight who made his disinterest in gifts and disgust for bribes clear would often be held in high regard.\n5.  **The Davidic ethic**: **a knight, particularly one who was to lead others, was expected to help protect the weak and helpless**, respect/provision widows and children, and to oppose the encroachment of corrupt or tyrannical individuals wielding power (be they black knights or robber-barons). In a practical sense, this meant that it was a **knight's duty to seek out threats to those who could not protect themselves and deliver justice fairly**. This is particularly the case of the Knights-Errant, knights who either put less emphasis on their feudal obligations or were currently lordless and would travel the land in an effort to prove their valor and capability in combat, win honor, possibly attract the favor of a woman, and (in the case of landless knights) potentially prove themselves worthy of patronage by a landed noble. The Knight-Errant was the original white knight as some would abandon all feudal and worldly attachment in order to find honor and glory while righting wrongs.\n6. **Honor:** **knights were expected to try to act with honor and prove themselves to be honorable at all times. Dishonorable acts on the battlefield were often the fastest way for a knight to lose all standing.**\n\n&#x200B;\n\nAs you can see, in many ways classical Chivalry was very much a collection of ideals with masculine values. Pay close attention to those six points. Women are only properly mentioned once, in the fifth facet, and even then it's talking about widows. While many knights tried to win the favor of a woman, usually a noblewoman, this wasn't a real part of their code, which obligated them to **defend** the weak. You might also have noticed a mention of \"black knights\" in the fifth point. What are black knights? **A black knight is a knight who, either lordless or hiding the heraldry of his lord, willingly commits misdeeds that would have them shunned as a knight.** Pay attention to everything in bold and compare it to modern \"white knights\" and modern \"chivalry.\"\n\nHere's modern \"chivalry\" just for comparison: \"defend women no matter what, even if they're the instigator, against anyone who they claim or appears to have wronged them, no matter how slight or if the person even did anything wrong.\" Modern white knights, if you look at classical Chivalry, would more than likely be considered thugs *at best* and black knights deserving of being hunted down by a Knight-Errant at worst.\n\nSo what happened? How did we get from classical Chivalry to this? Well, as time went on the code of Chivalry slowly changed and became a number of different tiers (warrior chivalry similar to the above, religious chivalry, and **courtly love chivalry**) before falling out of use around the time of the War of the Roses as the prominence of knights dwindled. The last Knight-Errant died in Brittany in 1488, marking the final end of the Age of Chivalry. During the Romanticism, Chivalry was partially revived with heavy emphasis on the \"courtly love\" part of the code, with many of the longstanding core facets fading from use. From the 18th century to today, this \"Romantic\" Chivalry has shifted and changed to become the modern \"Chivalry\" white knights and feminists harp on about being dead. It's important to remember one thing, though: if we look at Classical Chivalry, modern white knights are not chivalrous. Knights do not attack people who are not able to defend against them. They do not attack someone who is distracted by another battle. They also most certainly do not attack or murder someone who is defending themselves or on behalf of a woman who was not wronged by the \"knight's\" target.\n\nClassical chivalry does, however, exist in a fractured way still, although feminism has made an effort to attack it at every opportunity. Chivalry exists in everyone who tries to help the poor and homeless in spite of their gender and feminism's insistence that women need it more. Chivalry existed in the Good Samaritan, who was accused of sexual assault by the woman he spent an hour helping with her car despite the fact that he didn't have to. Chivalry exists in the few judges that believe the law should apply equally regardless of the gender of the victim and the perpetrator, in spite of feminists insisting women shouldn't be put in jail.\n\nWhen you stop to look at it, \"Toxic Masculinity\" is actually feminism's attempt to do to masculinity in general what the modern age did to classical Chivalry: declare it detrimental to society and reshape it into something more \"fitting\" to their world view.",
    "title": "Musings: Why the Fall of Classical Chivalry Mirrors the Modern Feminist \"Toxic Masculinity\" Situation",
    "subreddit": "MensRights",
    "timestamp": 1561639800,
    "score": 88,
    "keyword": "white judge"
  },
  {
    "text": "The Mis-Education of Boys and Men. I wrote this article last year in reaction to the fact that boys and men are falling further behind in our education system. The article is a bit long - 1600 words but I felt it was my duty to express my opinion on the difficulties and obstacles boys and men face trying to get an education. \n\nThe Mis-Education of Boys and Men\nBy Red Pillis\n\nQuestion. If you want to disempower and disenfranchise a whole class of people to reduce them to serf-like status, what would be a good way to do it? Answer. Don’t educate them.\n\nDeny them a good education. Educate them just enough so they can handle the basics of reading, writing and arithmetic. Don’t educate them any further. This way they will be able to work the jobs that don’t require a good education – the manual, dreary, dirty, dangerous and disgusting jobs needed to make profits or to keep our infrastructure and society running. \n\nTry to keep them from learning too much. Don’t let them acquire critical thinking skills, advanced knowledge, good grammar and spelling, and the ability to speak articulately and convincingly. Don’t give them the ability to think for themselves, form their own opinions, make independent decisions and be skeptical of the propaganda they see, hear and read. This way you can easily manipulate, control and contain them and have them do your bidding. Keep them as an underclass – useful beasts of burden.\n\nThis technique has been successfully used many times during our history. In ancient and not-so-ancient times only a small percentage of the people, the elite ruling class, were educated and had the ability to read and write. The lower classes were kept illiterate or near-illiterate. In modern times it was done to the blacks by the ruling whites in South Africa during Apartheid and to the blacks by the whites in the American South during slavery and the Jim Crow years.\n\nNow it is being done on a much wider scale. It’s being done to half the population – the male half. \n\nStudy after study is showing that boys and men are falling behind in education. From kindergarten to college, there is a strong anti-male bias that creates a hostile environment for them in school.\n\nBoys are constantly being told they are bad, their masculinity is toxic, they need to respect girls and never hit girls even in self-defense \n\nBoys learn better by actively engaging in a project or task than by just passively listening to the teacher. But in primary school, and even secondary school, they are forced to sit still in class, even though boys as a rule need to move around and expend energy more than girls do. \n\nRecess, which used to be part of the school day, has been eliminated at many schools, which means that kids, especially boys, have no way to burn off that youthful energy. So, with all that unspent energy, they may be somewhat high-spirited or rambunctious in the classroom, which these days will be diagnosed as ADD (Addition Deficit Disorder), and they will be given drugs such as Ritalin to ‘help them focus’, turning them into virtual zombies and setting them up for disorders later in life.\n\nIn a female-oriented, zero-tolerance classroom, the slightest infraction of the rules or a bit of horseplay or any display of impertinence on the boys’ part immediately results in disciplinary action such as detention, suspension, expulsion or even arrest by school police – the school to prison pipeline. Watch how fast the authorities converge on a boy if he draws something remotely resembling a weapon. \n\nAlmost all teachers in primary school, and increasingly in secondary schools, are women, and they do tend to favor girl students. When being graded, girls are constantly being given better grades than boys, even for the same quality of the completed assignment.\n\nBy the time they reach college, things get really bad for the boys who are now young men. They are told that a ‘rape culture’ exists on campus and that they are all potential rapists. They are told that they are part of the ‘patriarchy’ that oppresses and subjugates women. They are forced to take sexual harassment classes and sensitivity courses. The straight white males have it the worst. They are automatically labeled racist, homophobic and sexist and are blamed for every bad thing that has ever happened in human history. \n\nThere are also the rape tribunals on campus. They should be called what they really are – Kangaroo Courts. A male student accused of sexual assault or harassment is automatically presumed guilty. He has no legal rights, no access to due process that an ordinary criminal would receive. He is expelled from campus with a damaged reputation that can ruin his whole life.\n\nAll this is creating a hostile environment for boys and men, and as a result, they are dropping out of school and not attending college. On some campuses, female enrollment is nearly double that of male enrollment. And the situation is getting worse. Male enrollment is dropping even further as women surge ahead in Academia.\n\nThere have been so many articles, reports and studies about the plight of males in education, that one would think everyone is aware of it by now and that measures would be taken to correct the imbalance. \n\nBut nothing is happening. In fact, the opposite is happening. It seems Academia is doubling down on the exclusion of males from higher education.\n\nWhy?\n\nI may sound like a conspiracy nut, but this is my theory. I think it is deliberate.\n\nThere are plenty of well-paid jobs that don’t require a college degree. Our First-World society needs a vast amount of manual workers, technicians and skilled tradespeople to build and maintain our complex, sophisticated infrastructure. There is always a great need for electricians, plumbers, carpenters, welders, machinists, masons, bricklayers and so on – people who use their hands and brawn (mostly men) to build and fix things. Many of these jobs pay very well, and one can make a very good living from them.\n\nBut, these kinds of jobs do not give the worker any power or influence. The jobs that do convey power and influence are ones like politicians, legislators, professors, teachers, doctors,  judges, lawyers, writers, journalists, reporters, media pundits, to name a few. \n\nPeople in these professions can profoundly affect and control society. Legislators can set policies and pass laws, judges can pass sentences, politicians can shape public policy, teachers and professors can influence and shape students’ opinions and beliefs, and reporters, writers, TV pundits and journalists can influence public opinion. \n\nWhat all these jobs have in common is that you need a college degree, at least a Bachelor’s Degree, or better yet, a Master’s Degree. If you don’t have a degree, the chances are slim to none that you will be able to enter one of these professions. So it becomes important for groups with certain ideologies to prevent certain other groups from obtaining the requisite education and degrees to enter these professions.\n\nA skilled welding specialist can easily make a six-figure income, but he can’t pass laws. A good carpenter can make a lot of money building houses, but he can’t set policy. \n\nThe Leftist, Feminist, Marxist, Multi-culturist, Social Justice Academics know this. They are fully aware that males have to be kept out of education, especially higher education. But they can’t just suddenly stop males from going to school. There are too many laws and social precedents that would prevent this, and the public outcry would be deafening.\n\nSo it has to be done slowly and stealthily over the course of years or even decades. The Leftist Academics are ratcheting up the pressure on males a little bit at a time. They are turning schools and colleges from places of learning into indoctrination centers and gradually making males feel ever more unwelcome. Their goal is to create a permanent, uneducated, docile underclass – mostly male. The educated class, mostly female, will be the leaders and masters who will set policy, make the laws and control and dominate the underclass.\n\nIf you think I am a paranoid conspiracy nut, just pay attention to some of the Feminist slogans being uttered. ‘The Future Is Female’, ‘Girls Rule’, ‘The End Of Men’, ‘Women Are Better Than Men At – (Practically Everything)’. \n\nSo what is to be done? How do we reverse this? \n\nTake action. Fight back.\n\nThe first step is to get the word out. If you know individuals or families with young boys, let them know about the plight of boys in education. Do your research and gets the facts, then tell everyone. \n\nSecond, if you are a parent or guardian of a boy in school, monitor his progress closely. Take an interest in his education. Ask him to tell you what is going on in the classroom and how his teachers treat the boys. Document this. If you discover any bias or discrimination against boys by the teachers or the school itself, say or do something. Make sure your allegations are valid, and then talk to the teachers. If you get no results from teachers, take it to the next level and complain to the school authorities.\n\nForm associations and groups for the single purpose of helping the boys to do better in school and go to college. Go after colleges and universities that practice discrimination against males. Do this by use of lawsuits, demonstrations, boycotts and any other kind of legal non-violent means.\n\nWe need to help or boys and young men realize their potential and succeed in life. If we don’t, and we let our boys flounder and fall further behind, we will be doing them a terrible disservice. It will also be very bad for our society. This is not to take away any of the advancements and achievements by females. This is simply to level the playing and be fair to both sexes – to achieve true gender equality. If both sexes are equally well-educated and equipped to succeed in the workplace, both sexes and our society will benefit.",
    "title": "The Mis-Education of Boys and Men.",
    "subreddit": "MensRights",
    "timestamp": 1553368390,
    "score": 86,
    "keyword": "white judge"
  },
  {
    "text": "False Allegations and Wrongful Arrests - My story I spontaneously decided to share part of my story in the hope that it might help someone. For context, this all happened here in the UK. There's a lot more history behind this story, in particular years of abuse from my ex, but I'm not addressing that history here.\n\nMy ex left us at the end of 2016. 2017 was a shitty year for me - I was arrested THREE times based on false allegations made by my ex. \n\nOn one occasion, after initial Police investigation, they decided to drop the case when they (presumably) saw she was a prolific liar. On the other two occasions it went to criminal court where both times the magistrates (panel of judges) declared \"No Case to Answer\" which means nothing actually happened, so there's nothing to respond guilty/not guilty for - Put simply, \"no case to answer\" is basically a \"turbo-charged Not Guilty\". I'm thankful that the courts saw sense.\n\nIt's sad and extremely frustrating that the Police acted hastily to the point of misconduct and gender discrimination against me - They arrested me THREE times based on NOTHING. On one of those occasions there were two supposed \"witnesses\", however one was a strong young guy who wanted to muscle in to white knight when my ex and I were in a non-physical verbal dispute - He disappeared after giving his statement when the Police discovered that he physically assaulted me unprovoked - The only physical contact that actually took place! The other \"witness\" was a middle-aged woman, a total gossip merchant yelling at me for being a \"wife beater\" referring to what was a two-way shouting match.\n\nHere's the shocker... To the Police on the scene (and again later in criminal court), my ex explicitly stated that \\*no physical contact took place whatsoever\\*.\n\nI heard my ex's conversation with the officer on the scene when the bodycam video footage was played openly to the judges in court. In the recording my ex clearly stated she was not assaulted and no physical contact took place. Despite this, after being told by the alleged victim that NO PHYSICAL CONTACT TOOK PLACE, the Police still arrested me for PHYSICAL assault (\"Battery\" as it's recorded). They were determined to \"get me\" even after the alleged victim had clearly said it never happened.\n\nOn one of the other occasions of false allegations against me, my ex tried to assault me but instead struck our child. This under UK law is known somewhat informally as \"Reckless Assault\" as follows:\n\n*\"Assault (or common assault) is committed if one intentionally or* ***recklessly*** *causes another person to apprehend immediate and unlawful personal violence.\"*\n\nWhen I went to the Police station, the Police officer kept me outside, took my statement, then came back with with two other officers. They surrounded me and tried to intimidate and antagonise me into some kind of aggressive response. The officer argued with me verbally, insisting that I accept that the harm to my child was an \"accident\", not reckless assault. Eventually once it was clear I was remaining calm and cooperative, they gave up on the pressure tactics and agreed to see my child. When he did, he noted that my child's hand appeared to have been hurt.\n\nGuess what they did about it? LESS THAN NOTHING!\n\nThey buried the \"accident\" in one short sentence in the middle of a Police report detailing the assault my ex falsely claimed she endured from me (That was the second \"no case to answer\"). Put simply, she got to the Police station with a false story before I got there; Early bird gets the worm. I should have dialled 999 (equivalent to 911) immediately instead of going to the station a couple of hours later after caring for my child. End result: No further action was taken to obtain justice for my child. My child was assaulted by the mother and the Police made every effort to bury it to protect my child's attacker.\n\nSo the perspectives I'm left with are:\n\n1. The local courts seem to still operate fairly, although I say that specifically referencing only my personal experience - I can't presume to speak for all men.\n2. My local Police force are systemically prejudiced in favour of women, inadvertently (unintentionally?) reducing men and children to second-class citizens. I say \"local police\" because I can't generalise to \\*all\\* Police; They might be different in other places and I can't comment outside of my local experience.\n3. My ex, just like many other women nowadays, think they can game the system with false allegations. Unfortunately they're often successful. Again, I can only speak from personal experience, however social media is saturated with reports of this kind of thing happening.\n4. I'm lucky. It's not right that I feel lucky to have avoided wrongful conviction, but I do feel lucky. It's not right that I feel lucky to have residence (custody) of my child, but I do feel lucky.\n\nI'm not sure what specific advice I can offer up from my story; I just wanted to share.\n\nI suppose the best advice I could give is to remain calm and never let emotion dictate your perspectives or mindset. It's easy to \"hate all women\" or \"hate all cops\", but those are self-defeating attitudes that will eventually eat you up inside.\n\nKeep cool and calm, and keep it real.",
    "title": "False Allegations and Wrongful Arrests - My story",
    "subreddit": "MensRights",
    "timestamp": 1568801958,
    "score": 67,
    "keyword": "white judge"
  },
  {
    "text": "Why Feminist Dating Advice is shit. **This is a repost I felt was worth posting here.** \n\nWith this post, I'm hoping to do two things.\n\n1: find a better way for us to talk about (and to) the kind of frustrated, lonely young men that we instead usually just mock(*nice guys and etc*)\n\n2: discuss the impediments that generally keep us from having this honest discussion and talk about how to avoid them in the future\n\nThe things young women complain about when it comes to love and sex and dating are much different from the things young men complain about, and that has always been interesting to me. Check my post history - it’s a lot of me trying, at a high level, to understand young-male-oriented complaints about relationships.\n\nWhat young men complain about (“friendzoning”, being a “nice guy” but still feeling invisible, lack of sexual attention, never being approached) is so much different from what young women complain about (catcalling, overly-aggressive men, receiving too much attention, being consistently sexualized).\n\n\n*Seriously, nerdy dudes: care less about creeping women out. I mean, don’t deliberately do things you suspect may creep a woman out, but making mistakes is a natural part of learning. Being creeped out by one random dude is not The Worst Pain People Can Ever Experience and it’s certainly not worth dooming you to an eternal life of loneliness over. She’ll live.*\n\nIn my experience, this is not generally advice you'll get from the average young woman online. You'll get soft platitudes and you'll get some (sorry!) very bad advice.\n\n[Nice Guys: Finish First Without Pickup Gimmickry](https://goodmenproject.com/featured-content/nice-guys-finish-first-without-pickup-gimmickry/)\n\n>Be generous about women’s motivations.\n\n>Believe that sex is not a battle.\n\n>Make a list of traits you’re looking for in a woman.\n\n[Dating tips for the feminist man](http://www.mediacoop.ca/blog/norasamaran/19018)\n\n>learn to recognize your own emotions.\n\n>Just as we teach high schoolers that ‘if you're not ready for the possible outcomes of babies and diseases, you're not ready for sex,’ the same is true of emotions\n\n[All The Dating Advice, Again](https://captainawkward.com/2014/08/26/617-all-the-dating-advice-again/) (note: gender of writer is not mentioned)\n\n>Read books & blogs, watch films, look at art, and listen to music made by women.\n\n>Seek out new activities and build on the interests and passions that you already have in a way that brings you into contact with more people\n\n>When you have the time and energy for it, try out online dating sites to practice dating.\n\n>Be really nice to yourself and take good care of yourself.\n\nAs anyone who’s ever dated as a man will tell you, most of this advice is godawful nonsense. The real advice the average young man needs to hear - talk to a lot of women and ask a lot of them on dates - is not represented here at all.\n\nAgain, though: **WHY?**\n\nWell, let’s back up.\n\nBeing young sucks. Dating while young especially sucks. No one really knows what they want or need, no one’s planning for any kind of future with anyone else, everyone really wants to have some orgasms, and everyone is incredibly judgmental.\n\nWomen complain that they are **judged for their lack of femininity.** That means: big tits, small waist, big ass. Demure, but DTF, but also not too DTF. Can’t be assertive, assertive women are manly. Not a complete idiot, but can’t be too smart. We work to empathize with women’s struggle here, because we want women who aren’t any of those things to be valued, too!\n\nTo me, it's clear that the obverse of that coin is young men being judged for their lack of masculinity. Young men are expected to be\n\n- confident\n- tall\n- successful, or at least employed enough to buy dinner\n- tall, seriously\n- broad-shouldered\n- active, never passive\n- muscular\n- not showing too much emotion\n\nIn my experience, these are all the norms that young men complain about young women enforcing. I can think of this being the case in my life, and I think reading this list makes sense. It's just that the solution - **we as a society should tell young men that they need to act more masculine towards women if they want to be more successful in dating and love and sex!** - is not something that we generally want to teach to young men. “Be more masculine” is right up there with “wear cargo shorts more often” on the list of Bad And Wrong Things To Say To Young Men.\n\nBut if we’re being honest, it’s **true**. It’s an honest, tough-love, and correct piece of advice. Why can’t we be honest about it?\n\nBecause **traditionally masculine men make advances towards women that they often dislike.** Often make them feel unsafe! The guys that follow Ye Olde Dating Advice - be aggressive! B-E aggressive! - are the guys who put their hand on the small of her back a little too casually, who stand a little too close and ask a few too many times if she wants to go back to his place. When women - especially young, white, even-modestly-attractive feminist women - hear “we as a society should tell young men that they need to act more masculine towards women if they want to be more successful in dating and love and sex”, they hear, “oh my god, we’re going to train them to be the exact kind of guy who creeps me out”.\n\nWomen also don’t really understand at a core level the minefield men navigate when they try to date, just as the converse is true for men. When young women give “advice” like **just put yourself out there** and write things like the **real problem with short men is how bitter they are, not their height!**, they - again, just like young men - are drawing from their well of experience. They’ve never been a short, broke, young dude trying to date. They’ve never watched Creepy Chad grope a woman, then take another home half an hour later because Chad oozes confidence.\n\nTheir experience with dating is based on trying to force the square peg of their authentic selves with the round hole of femininity, which is a parsec away from what men have to do. Instead, the line of the day is \"being a nice guy is just expected, not attractive!\" without any discussion about how the things that **are** attractive to women overlap with traditionally masculinity.\n\nThat's bad, and that's why we need to be honest about the level of policing they face by young women on the dating market.",
    "title": "Why Feminist Dating Advice is shit.",
    "subreddit": "MensRights",
    "timestamp": 1557988549,
    "score": 51,
    "keyword": "white judge"
  },
  {
    "text": "The role of false accusations during the temperance movement and in the lynching of blacks in the Deep South False accusations get a lot of attention, but much less attention has been given to how false accusations have helped shape history.  For example, false accusations have often been used to push a false victimisation narrative.  And the interaction between false accusations and false victimization narratives can be found throughout history.\n\nThis kind of argument should create more sympathy for the problem given that most people (feminists and SJWs included) already accept the historical narrative around these topics.  In fact, SJWs often go to great lengths to discuss the prison disparity among black people in terms of wrongful convictions.  The fact that many of those convictions were because of false accusations (including false accusations of sexual assault) seems to go over their heads.\n\n###**Temperance (prohibition)**\n\nAround the turn of the 20th century, the issue of temperance was split by gender.  Women usually supported it, and men were against it.  As a result, the early women's movement got involved.  In fact, their later support for suffrage was largely the result of their belief that women would vote in favor of prohibition (and not, for example, [in a belief that women were being oppressed](https://www.reddit.com/r/MensRights/comments/dxtdqd/addressing_a_few_foundational_assumptions_of/)).  Evidence for this comes from the fact that [most women who supported suffrage were against giving blacks the right to vote, including other black women](https://www.npr.org/2011/03/25/134849480/the-root-how-racism-tainted-womens-suffrage).\n\nThe main argument for temperance was that men who drank too much neglected their responsibilities to women.  A husband who drank too much would loose his job, he would neglect his children, and he would beat his wife. The narrative of female victimization was so powerful that some women [took it upon themselves to go around the country and start fights in bars](https://dp.la/primary-source-sets/women-and-the-temperance-movement).  The harm that women faced at the hands of drunk men, both real and imagined, was used to push their political narrative.\n\nOf course women eventually got their way.  Prohibition was established in 1920 and lasted for 13 years (and only ended because [women eventually changed their minds](https://books.google.com/books?id=7mc8QsyUMjAC&printsec=frontcover#v=onepage&q=Women's%20organization%20for%20national%20prohibition&f=false)).\n\nAnd this wouldn't be the last time that women's safety in society was used to outlaw a substance, either.\n\n###**The lynching of blacks in the Deep South**\n\nIf you were a black man living in the South, the last thing you wanted to do was get involved with a white woman.  Simply looking at a white woman could get you hung by a violent mob.  And while the lynching of blacks is usually seen as something that white men did to black men, the role of white women is often overlooked.\n\nSeveral studies reveal that white women were not only complacent in the lynching of blacks, but that they often took an active role in it. They would accuse black men of looking at them, of stalking them, and even of raping them.  Simply pointing their finger at a black man was enough to get him hung.\n\nOne prominent black woman who was alive at the time noticed this and took it upon herself to document and analyze hundreds of cases of lynchings.  What she found was that many lynchings were enabled by white women who spoke \"falsehoods\" about black men, and that most of their claims were dubious at best.  Even the judges who presided over these trials (when there even were trials) were said to know that the claims were false.\n\nHer stories can be found in *[The Red Record](https://archive.org/stream/theredrecord14977gut/14977.txt)*.  Another source on this topic is *The Killing Fields of the Deep South: The Market for Cotton and the Lynching of Blacks, 1882-1930*.  The role of feminists and the early women's movement (who at the time had close ties to the KKK), in enabling this can be found [here](https://docs.lib.purdue.edu/dissertations/AAI1469917/) and [here](https://digitalcommons.iwu.edu/cgi/viewcontent.cgi?article=1014&context=constructing).\n\nIn terms of numbers, *The Red Record* found that 36% of lynchings were motivated by accusations of rape (or attempted rape).  Allegations of rape, and the safety of white women, [definitely dominated the social narrative of the time](https://www.jstor.org/stable/25119509).  And let's not forget that sexual assault is not the only crime where false accusations can be found.\n\nWhile the lynchings eventually stopped, black men are still put in jail because of racially motivated allegations.  Recently the case of the \"[central park 5](https://en.wikipedia.org/wiki/Central_Park_jogger_case)\" made headlines due to the wrongful imprisonment of five young minority boys who were forced to confess to the rape of a white woman.\n\n###**The war on drugs**\n\nIt has been stated that many of our drugs laws were drawn up based on race.  White people drank alcohol and used tobacco, so that's why those substances are legal.  Black people used cocaine, and Hispanics smoked marijuana, so that's why those substances were outlawed (see: *[The New Jim Crow: Mass Incarceration in the Age of Colorblindness](https://en.wikipedia.org/wiki/The_New_Jim_Crow)* by  Michelle Alexander).\n\nOne piece of propaganda that was particularly effective was the claim that [black people would use cocaine and then run around raping white women](http://lh.journals.yorku.ca/index.php/lh/article/download/5410/4605).\n\n###**Most of the social narrative surrounding gender to this day is shaped by a victimization narrative**\n\nEverywhere you look people are trying to manufacture a victimization narrative.  And while some issues may be more legitimate than others, many are simply made up out of convenience.  It could be stated that feminism itself relies on a false victimization narrative.  The idea that women are oppressed through a patriarchal conspiracy follows a well established pattern that doesn't seem all that out of place given the historical context (and the parallels to the neo-Nazi rhetoric of a Jewocracy oppressing white people [hasn't exactly gone unnoticed](https://www.newstatesman.com/politics/feminism/2018/10/dog-rape-and-mein-kampf-feminist-text-why-we-hoaxed-journals-terrible) -- see also: https://www.reddit.com/r/Menkampf).\n\nPeople aren't shy to make false accusations when it benefits them.  While the rate of false accusations of rape is debatable, there are very clear statistics that indicate the extent of this happening in [divorce and child custody cases](https://quillette.com/2019/04/16/divorce-and-the-silver-bullet/).\n\n[False accusations of child abuse](http://ohiofamilyrights.com/Reports/Special-Reports-Page-3/Sexual-Abuse-Allegations-in-Divorce-and-Custody-Disputes.pdf) occur in about 6% of child custody cases, with 33% being provably false, and another 17% being baseless. [Allegations of domestic abuse](http://www.saveservices.org/downloads/False-DV-Allegations-Cost-20-Billion) occur in 25% of cases, with 70% being false. And it's estimated that [85% to 90% of restraining orders are completely without merit](https://www.huffpost.com/entry/order-of-protection-and-j_b_974970).\n\n[Most perpetrators of false accusations are women, and most victims are men](https://leb.fbi.gov/articles/featured-articles/false-allegations-of-adult-crimes) (about 80% of cases), and this contrasts strikingly against the fact that [women are just as abusive against men as the reverse](https://domesticviolenceresearch.org/domestic-violence-facts-and-statistics-at-a-glance/), [women rape men at a similar rate as the reverse](http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf), and [women abuse children at greater rates than men](https://www.ncbi.nlm.nih.gov/pubmed/16165212).\n\n###Why is the victimization narrative so successful?\n\nHumans have a biological imperative to listen to, and help women.  [Study](http://www.ncbi.nlm.nih.gov/pubmed/15491274) after [study](https://journals.sagepub.com/doi/pdf/10.1177/1948550616647448) after [study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5112287/) demonstrates how strong of a bias this is.  When a woman needs something, it is almost always the case that a man will get it for her.\n\nA man can claim a victimization status all he wants, but he will never get the same amount of attention that a woman would.  That's why you don't find as many men making false accusations as you do women.\n\nIn a lot of ways, the use of a victimization narrative to grant privileges to women is just a reflection of society acting this way in aggregate. And again, there are [studies](https://www.sciencedirect.com/science/article/pii/S0022103118304633) and [more studies](https://ideas.repec.org/p/hhs/nhheco/2019_006.html) indicating that this is likely the case.\n\nMany issues that men face in society are caused by this phenomenon. Men receive far less empathy than women do. And men are pushed aside, and are often harmed, to advance the privileges of women.\n\nAs such, the phenomenon of false allegations should be viewed through the wider lense of \"manufactured victimization\".  Its relationship to the empathy gap is also obvious, and that makes it a major force behind the wider persecution of men in society.",
    "title": "The role of false accusations during the temperance movement and in the lynching of blacks in the Deep South",
    "subreddit": "MensRights",
    "timestamp": 1575386071,
    "score": 34,
    "keyword": "white judge"
  },
  {
    "text": "Help: Counter Responses Needed to examples of \"Male Privilege\" A few months ago, I came across a list of 160+ examples of \"male privilege\" from a site, Everyday Feminism. After reading it, it quickly became apparent that a lot of it was a bunch of nonsense, either deliberately cherry-picking or using narrow data (as if they were living in a bubble) such as \"men are less likely to be murdered by a partner\" but according to the data given by the United Nations Office on Drugs and Crime, worldwide, 78.7% of homicide victims are men.  So as a man, I am far more likely to be murdered over all, yet somehow I'm the \"privileged\" one and women are the oppressed ones??? How many Feminists would like to trade that \"privilege\" with men? I bet not a single one would.\n\nThe list was so full of nonsense I was compelled to start making responses to counter every single on of them, which turned out to be unbelievably easy and I've already refuted over 100 of them.\n\nHowever, there were a handful of pointers that I have trouble responding to. It's with these last ones I need help putting together counter responses to. **Any help would be much appreciated. Please stick to responding specifically to the points given below instead of going off road, like asking \"was X on the list\" or arguing \"women have more # of privileges overall than men.\"** (I'm not saying that they don't, I just want to stick on point and finish countering this 160+ list. But if a specific female privilege can over-rule or even-out an example given below, feel free to include it and argue why)\n\nHere's the list:\n\n1. Perceptions of how much your gender is represented[ skew in your favor](http://www.dailydot.com/opinion/all-female-ghostbusters-backlash-male-tears/). When a group is comprised of 17% women, men think it’s 50-50, and at 33%, men believe women are the majority.\n2. You can forgo regular grooming during travel, like growing a[ “backpacker’s beard,”](http://matadornetwork.com/life/6-things-traveling-women-deal-traveling-men-dont/) without people judging you for not keeping up with your gender’s expectations, like women shaving their legs.\n3. You can get praise for ordinary parental duties or for being a single father, while mothers are simply expected to do the same and even[ criticized for single motherhood](http://everydayfeminism.com/2014/08/single-parent-double-standard/).\n4. You’re not said to be going against your gender’s “natural instinct” or your role in society by not having children.\n5. If you’re in a relationship with someone of another gender, you’re not expected to[ do more emotional labor](http://www.slate.com/articles/double_x/doublex/2015/12/the_year_we_wondered_if_emotional_labor_should_come_with_a_price.html) in the relationship.\n6. For diseases that affect your gender more, you don’t have to[ face skepticism](http://www.scientificamerican.com/article/fibromyalgia-maligned-misunderstood-and-finally-treatable/?&wt.mc_id=sa_hlth_20140528) about whether or not it’s a “real disease,” like women with conditions like fibromyalgia and chronic fatigue do.\n7. You’re less likely to have[ mental health issues dismissed](http://www.ncbi.nlm.nih.gov/pmc/articles/pmc3480686/) as being “hysterical” or “oversensitive.”\n8. Fiction can depict the everyday, mundane lives of people of your gender without being labeled as “men’s fiction” and taken less seriously than so-called “real” literature – like[ “women’s fiction” and “chick lit.”](http://www.theguardian.com/books/booksblog/2014/may/16/women-fiction-sign-sexist-book-industry)\n9. People of your gender in the media can age[ naturally without scrutiny](http://mic.com/articles/135131/gillian-anderson-just-tore-apart-the-tabloid-that-age-shamed-her#.BRcpxgyvW), even being said to get “finer with age.” Women in industries like modeling, acting, and TV journalism are more likely to be pushed out of their careers as they age.\n10. Your gender is[ more represented in the documentary industry](http://variety.com/2016/film/news/gender-bias-documentary-industry-1201708404/), with people more likely to trust men with documentaries and give them funding, resources, and recognition for their projects.\n11. A political candidate of your gender won’t be penalized by the idea that they can’t balance both family life and public office.\n12. You can make choices to have both career and family without people[ assuming it’s a challenge](http://www.huffingtonpost.com/2015/06/11/kirsten-gillibrand-women-debate_n_7561684.html) or an unusual achievement for you to “have it all.”\n13. If you choose to have children, you’re not questioned about how having a family would hurt your ability to do your job.\n14. You’re not stereotyped at work as not belonging in higher paid roles, like being mistaken for the nurse if you’re the doctor, or for a secretary when you’re a lawyer.\n15. You’re[ not stuck between](http://everydayfeminism.com/2015/09/judging-dependent-women/) the stereotype of your gender being dependent on a partner and the shame directed at women who choose to be or have to be.\n16. You’re more likely to have[ your work cited](http://host.madison.com/ct/news/local/education/university/womenalsoknowstuff-is-a-handy-list-of-experts-including-several-from/article_14614c91-576a-5be5-b3af-161da1ad614a.html) in journalism and political science. Women experts are cited so rarely that some political scientists created[ Women Also Know Stuff](https://womenalsoknowstuff.wordpress.com/) to encourage people to also include the expertise of women.\n17. You’re less likely to have people justify not hiring people of your gender with the belief that there are simply[ “no qualified candidates”](http://www.huffingtonpost.com/entry/qualified-women-board-members-survey_us_56c35030e4b08ffac1268df5) of your gender in the field.\n18. You’re less likely to have clients and colleagues ask someone of another gender a question that should’ve been directed to you.[ In one survey,](http://motto.time.com/4226297/silicon-valley-gender-discrimination-data-elephant-in-the-vallet/) 88% of senior-level women in Silicon Valley reported this happening.\n19. People give you toys that are[ more likely to be educational](http://everydayfeminism.com/2015/04/girls-vs-boys-toys/), to develop a range of skills, and to let you imagine a range of career possibilities – while toys considered “girls’ toys” are often limited to beauty,[ housework and childcare](http://everydayfeminism.com/2015/04/girls-vs-boys-toys/).\n20. [School dress codes](http://everydayfeminism.com/2014/12/school-dress-code-myths/) don’t suggest that your body is inherently shameful or unprofessional, unlike girls who are told that it’s up to them to cover up.\n21. Your grades don’t depend on your appearance –[ studies show](http://www.npr.org/sections/ed/2016/01/14/462135458/pretty-girls-make-higher-grades) that girls are given higher grades based on physical attractiveness, reinforcing that their value is in their looks, not their brains.\n22. You get more[ “esteem building” rewards](https://www.narst.org/publications/research/gender.cfm) in school, like being called on first even when you’re not raising your hand.\n23. Your energetic behavior and creative energy is encouraged or dismissed with phrases like “boys will be boys.” Girls are taught to be[ “lady-like,”](http://everydayfeminism.com/2014/09/4-reasons-never-to-tell-your-daughters-to-be-ladylike/) which includes being more reserved and less outspoken.\n24. Academic resources are[ more likely to cite](https://www.washingtonpost.com/news/monkey-cage/wp/2016/02/11/heres-a-list-of-smart-women-political-scientists-they-know-stuff-too/) the work of people of your gender.\n25. If you’re in college, you’re more likely to be[ judged as knowledgeable](http://feministing.com/2016/02/17/study-finds-male-undergrads-assume-other-men-are-the-most-knowledgeable-in-class/) by your peers.\n26. If you’re in college, you’re more likely to have[ professors respond to your inquiries](https://www.insidehighered.com/news/2014/04/24/study-finds-faculty-members-are-more-likely-respond-white-males-others), especially if you’re white.\n27. At school, you can learn about your gender’s contributions to the world without needing extra electives or men’s studies departments to be included in the curriculum.\n\nThat's all.",
    "title": "Help: Counter Responses Needed to examples of \"Male Privilege\"",
    "subreddit": "MensRights",
    "timestamp": 1572811114,
    "score": 18,
    "keyword": "white judge"
  },
  {
    "text": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education   \n\nOrwell’s famous dystopia *1984* is often cited as a parable  about the banality of administrative evil. The ever-vigilant bureaucrats  of Oceania position themselves not only on the Left side of history,  but also at its *end.* To err from their ideology is treason.\n\nThe citizens of Oceania live in a state of self-imposed hypnosis  where they have to pretend that even the simplest of words signify their  exact opposites. The government agency that specializes in espionage  and torture is thus called *The Ministry of Love*. The Ministry views every sexual act as a potential crime unless proven otherwise via affirmative surveillance.\n\nImagine a federal agency that has invested itself with the authority  to monitor the most private details of citizens to root out sexual  heresy. Imagine a federal  agency which once contemplated [installing security cameras](http://pgbovine.net/OET-Draft-Grit-Report-2-17-13.pdf) in every classroom in order to monitor the facial and optical muscles of all students nationwide.\n\nThis agency was so devoted to its ideological mission that it never presented its [unconstitutional rules](https://www.thefire.org/did-the-office-for-civil-rights-april-4-dear-colleague-letter-violate-the-law/) to the American public to consult their opinion, considered itself to be [a superior alternative](https://www.huffpost.com/entry/why-students-are-fighting-for-title-ix_b_58e27314e4b0ca889ba1a848) to the criminal justice system, granted itself [universal jurisdiction](https://www.insidehighered.com/news/2018/01/19/feds-find-buffalo-state-failed-investigate-alleged-sexual-assault-created-hostile), threatened many colleges with financial death unless they punished [constitutionally protected speech](https://www.nas.org/blogs/dicta/ocrs_new_sexual_harassment_guidelines_threaten_academic_freedom_due_process), sought to abolish the [“reasonable person” standard](https://reason.com/2016/09/12/ocr-to-frostburg-state-university-common), and created [a class of imitative bureaucrats](https://www.nas.org/blogs/dicta/gender_inequity_among_the_gender_equity_enforcers) in academic institutions to perpetuate an industry of victimhood.\n\nImpossible, you think? We have just objectively described the record  of the Department of Education’s civil rights branch, the Office for  Civil Rights.\n\nThe Office for Civil Rights (OCR) received bipartisan and  professional criticism for its unconstitutional actions during the Obama  administration. Formal critics include the [Federalist Society](https://regproject.org/wp-content/uploads/RTP-Race-Sex-Working-Group-Paper-Campus-Misconduct-Proceedings.pdf), [Heritage Foundation](https://www.heritage.org/crime-and-justice/report/campus-sexual-assault-understanding-the-problem-and-how-fix-it), [National Association of Scholars](https://www.nas.org/articles/nas_applauds_secretary_devos_decision_on_title_ix),[ California Governor Jerry Brown](https://www.wsj.com/articles/jerry-browns-title-ix-veto-1508280834), [Justice Ruth Bader Ginsburg](https://reason.com/blog/2018/02/19/ruth-bader-ginsburg-due-process-me-too),  [American College of Trial Lawyers](https://www.actl.com/docs/default-source/default-document-library/position-statements-and-white-papers/task_force_allegations_of_sexual_violence_white_paper_final.pdf), and [Reason Foundation](https://reason.com/blog/2017/09/07/betsy-devos-rape-ocr-title-ix-campus).\n\nMoreover, courts that have heard cases involving OCR’s Title IX  procedures have often strongly denounced them. Examples include  condemnatory opinions from the [Second Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca2/15-1536/15-1536-2016-07-29.html) and the [Sixth Circuit of Appeals](http://www.opn.ca6.uscourts.gov/opinions.pdf/18a0200p-06.pdf). In a recent [Seventh Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca7/17-3565/17-3565-2019-06-28.html)  opinion, Judge Barrett stated that “Purdue’s process fell short of what  even a high school must provide to a student facing a days-long  suspension.” Professor KC Johnson [has covered the case in greater detail. ](https://www.city-journal.org/john-doe-v-purdue-univ)\n\nObama’s OCR espoused a particular brand of radical feminism.  According to this doctrine, taught across the nation in women’s studies  departments, men have brutalized women since the beginning of history.  Past oppression must be remedied through government intervention,  eliminating the due process principles that are meant to protect every  American.\n\nThe perils of government tyranny aside*,* the fundamental  assumptions of the “patriarchy theory” cannot survive rational scrutiny.  While it is true that women were historically denied various rights,  they have also been sheltered from grievous harm (combat, for example).  Also, analysis of federal aggregate data from the United States  demonstrates that women are [as likely to engage in sexual coercion](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) against men as [vice versa](https://www.sciencedirect.com/science/article/pii/S1359178916301446?via%3Dihub), which undermines the “patriarchy” narrative.\n\nAt any rate, past historical wrongs cannot be rectified by unfair treatment in the present, as the Eighth Circuit stated in [this ruling](https://cases.justia.com/federal/appellate-courts/ca8/18-3077/18-3077-2019-03-06.pdf?ts=1551889833).\n\nOCR’s historical record speaks to its lack of fairness. The agency  authored a total of 255 resolution letters (formal decisions in a case)  from 2012 to 2019.\n\n[Pekgoz summarizes the circumstances in a Synthetic Analysis](https://static.wixstatic.com/media/ea7b71_a751c44c74dc4e8fa8f35666ab9b81a1~mv2_d_3812_2108_s_2.jpg/v1/fill/w_3812,h_2108/PrintScreen%2C%20Synthetic%20Analysis.jpg).\n\nThe analysis shows that whenever OCR wrote a resolution letter  between 2012 and 2019 to adjudicate adversarial proceedings between  female and male parties, they sided with the female 216 times but only 9  times with the male (2400% more likely to side with the female). Their extreme partisanship is clear in every  aspect of Title IX.\n\n&#x200B;\n\n* **Athletics.** The Department’s athletics compliance tests have been [rightfully criticized](https://www.nccivitas.org/2010/title-ix-blind-quota-system-or-how-kneecap-college-sports/)  for imposing unconstitutional quotas. The agency sided with female  athletes 63 times, but sided with the male only once between 2012 and  2019. The only resolution letter favorable for male athletes is the [Temple University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03142257-a.pdf).\n* **Grading.** The Department sided with female students who alleged [discrimination](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/06112126-a.pdf) in [grading](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11162077-a.pdf) on [multiple occasions](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15132147-a.pdf), while dismissing [very similar allegations by male students](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/07132238-a.pdf).\n* **Retaliation.** The Department sided with female  complainants alleging retaliation on many occasions. There are at least  23 letters in this category, such as the [Jacksonville State University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/04142086-a.pdf)  where the agency sided with a “falsely accused” woman. There is no  clear example of the Department siding with a male student alleging  retaliation on the basis of sex, [but dismissal letters do exist](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10111376-a.pdf).\n* **Sexual Harassment.** Male students who petitioned the  agency to allege bias in sexual harassment disputes (either as the  accused, or the accuser) had a success rate of 1.1 percent during  2012-2019 (6/532). The Department was very aggressive when it came to  siding with female accusers while consistently dismissing the concerns  of accused males. This is despite male students often suffering  life-altering consequences, such as expulsion or a permanent notation on  their transcript, in addition to severe emotional distress. [Some have committed suicide](https://www.insidehighered.com/news/2017/05/02/title-ix-cases-resulted-suicide-suicide-attempt-two-colleges-prompt-fresh-debate).\n* **Reasonableness.** OCR urged schools to get rid of the  “reasonable person” standard at least twice:  One letter involved a  female student who accused a male teacher of [staring at her breasts for 3-4 seconds](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09141376-a.pdf). Another letter involved a costly systemic review because very young students [were playing “National Grab Ass Day”](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131106-a.pdf) during play time. The agency even sided with a female student whose claims of sexual violence [were disproven via DNA evidence](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15112115-a.pdf).\n* **Due Process.** While sending a dismissal letter to an accused male student, OCR argued that [“due process” is not covered by Title IX](https://www.scribd.com/document/426012564/Samuel-Meritt-University-Dismissal).  As long as the accused is a man, that is. Federal bureaucrats  aggressively sided with women who were accused of various sexual  infractions. On one occasion, the Department condemned a university for  allowing a male [to file a counter-claim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11116001-a.pdf) of misconduct against a female student. Another time, the agency [threatened a university](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/01102089-a.pdf)  with loss of federal funding for pressing fraud charges against a woman  who made false accusations. There is also an example of OCR using [defamation theory to side with a female complainant](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11141175-a.pdf), even though the agency has never accepted any complaints concerning the damaged reputations of accused men.\n* **Single-Sex Programs.** Women are the majority of college students, but many colleges offer dozens of support programs [for women only](https://www.jamesgmartin.center/2019/05/identity-politics-versus-basic-logic-should-colleges-offer-affirmative-action-for-the-female-majority/).  Whenever male complainants challenge female-only programs, such as  women’s centers or STEM camps for girls, the Department has dismissed  their complaints on various pretexts. One popular pretext is that these  female-only programs cannot be challenged unless men specifically apply  to them and receive rejections, thus creating a putative victim.  However, OCR has resolved [procedural complaints in the absence of any victim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/02152290-a.pdf) on many occasions, as long as the objective [was consistent with their agenda. ](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03121217-a.pdf)\n* **American Psychological Association (APA) Guidelines.** OCR dismissed a Title IX complaint challenging the APA guidelines, which sought to [classify masculinity as a mental illness factor](https://www.dailywire.com/news/46458/foia-request-reveals-boston-title-ix-office-has-ashe-schow).  This was despite serious public outcry against those guidelines. In the  dismissal letter, officials argued that Title IX cannot be applied in a  manner that would interfere with curricular materials. That was false.  OCR has aggressively interfered with [the training materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11142219-a.pdf) and [the curricular materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131096-a.pdf) of [various colleges](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10131040-a.pdf) as long as doing so furthers their gender agenda.\n* **Administrative Closure.** OCR has a rule requiring  the dismissal of pending complaints if similar allegations have been  filed elsewhere. This rule is rigorously applied [to male students to dismiss their Title IX complaints.](https://www.documentcloud.org/documents/3479594-Stanford-University-09-15-2324.html) However, when [female students file complaints against their institutions](https://www.ed.gov/news/press-releases/office-civil-rights-launches-investigation-university-southern-californias-handling-sexual-harassment-claims), administrative closure is not applied to dismiss their allegations.\n\nSome might assume that OCR has received few meritorious complaints  from male students. According to a Freedom of Information Act request,  however, the Department received [532 complaints](https://www.scribd.com/document/426016051/FOIA-All-532-Cases-With-545-Relevant-Allegations) from men in the sexual harassment category alone between 2011 and 2019.\n\nThe Department of Education became a hive of identity politics under  Obama and there is little evidence of improvement. The modest reforms  proposed by Secretary Betsy DeVos have not yet been implemented.\n\nResolution letters published under the Trump administration perpetuate the Obama doctrines. For example, [the Stanford University letter](https://provost.stanford.edu/wp-content/uploads/sites/4/2018/04/OCR-Redacted-Stanford-Letter-of-Finding.pdf) tried to eliminate the reasonable person standard. [The Butte-Glenn Community College letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09132096-a.pdf) involved a retroactive review of many old complaints, demanding the creation of a complex bureaucracy. [The Buffalo State University letter](https://www.insidehighered.com/sites/default/server_files/media/OCR-SUNY-Buffalo-State.pdf) wrongfully claimed that off-campus incidents fall under the jurisdiction of Title IX, [despite case law to the contrary.](https://caselaw.findlaw.com/us-8th-circuit/1410731.html)\n\nUnsurprisingly, some politicians want to abolish the entire Department of Education. Representative Thomas Massie has [introduced a bill](https://massie.house.gov/newsroom/press-releases/rep-massie-introduces-bill-to-abolish-federal-department-of-education)  to do just that. While we cannot predict whether the Department will  ever be abolished, we must never cease our vigilance against our very  own *Ministry of Love.* \n\n*Kursat Christoff Pekgoz is a PhD student at the University of Southern California.*\n\n*James E. Moore, II is professor of industrial and systems  engineering; public policy and management; and civil engineering at the  University of Southern California.*\n\n[*https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/*](https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/)",
    "title": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education",
    "subreddit": "MensRights",
    "timestamp": 1570815774,
    "score": 15,
    "keyword": "white judge"
  },
  {
    "text": "The Pressure on Female Superhero Movies and the Captain Marvel \"Controversy\" Too much pressure can be placed on superhero movies with female leads. This is a topic that I have thought about a lot recently with the “backlash” Brie Larson (star of *Captain Marvel*) received from an angry group of people online. Hopefully, this post can spread a little bit of awareness about the massive pressure and criticism that is placed on female superhero movies and why there have been so few in the past.\n\nIn the past it has been an industry standard to not make female superhero movies, assuming they would not earn enough money from ticket and merchandise sales. The only two major superhero movies that have been released in the 2000s were *Elektra* and *Catwoman.* Both failed miserably at the box office and with critics not because they featured women, because they were poorly made films. 2004’s *Catwoman* was an example of a female superhero movie that was made by men for men as you can see from how they dressed Halley Berry’s Catwoman in what can be described as leather lingerie. This sort of depiction is a perfect example of feminist theorist Laura Mulvey’s concept of the male gaze and represents an aspect of shallow storytelling. After 2005’s *Elektra* also failed, studios decided not to take a chance, resulting in a 12-year span of no female superheroes. All it took was two failed movies.\n\nAs time passed it became clear that female superhero movies are in demand. According to a study of movies in various budget brackets from 2014 to 2017, female led movies bring in greater profits than those with male protagonists ([CNBC](https://www.cnbc.com/2018/12/12/movies-starring-women-make-more-money-than-movies-starring-men.html)). And, considering 51% of moviegoers were women in 2018 according to the MPAA ([Women and Hollywood](https://womenandhollywood.com/mpaa-report-2018-women-represent-51-of-moviegoers-47-of-ticket-buyers/)), there is sufficient evidence to show that it is profitable to make female superhero movies. Some have argued in the past that there is not demand for female superhero movies because women don’t like those kinds of movies. Turns out the demand is there, with 2017’s *Wonder Woman* earnings at $821,847,012 and *Captain Marvel* currently around $1,067,648,08 ([Box Office Mojo](https://www.boxofficemojo.com/)). Bloomberg reported that Wonder Woman merchandise alone had brought in $500 million to $1 billion ([Independent Retailer](https://independentretailer.com/2017/07/04/wonder-woman-breaking-glass-ceilings-conquering-retail/)), a good sign for Captain Marvel merchandise. The problem was a supply of low-quality movies and a lack of merchandise, not a lack of demand.\n\nDespite the high ticket and merchandise sales, some still try to apply unfair pressure to female superhero films. Most recently, Brie Larson’s comments about increasing critic diversity was focally criticized by a group of people online. Here are her exact words:\n\n“About a year ago, I started paying attention to what my press days looked like and the critics reviewing movies, and noticed it appeared to be overwhelmingly white male. So, I spoke to Dr Stacy Smith at the USC Annenberg Inclusion Initiative, who put together a study to confirm that. Moving forward, I decided to make sure my press days were more inclusive” ([Marieclair](https://www.marieclaire.co.uk/entertainment/tv-and-film/brie-larson-641750)).\n\nThe study she is referring to was most likely the one that looked at 2015-2017 and found that critics are 78.7% male and 83.2% white ([USC](http://assets.uscannenberg.org/docs/critics-choice-2.pdf)). What she is saying is that she wants to give diverse press interviewers the opportunity to interview her. But it seems when any norms are challenged, a group of people on the internet will be angered and attempt to create controversy. After these comments, multiple YouTube videos and blog posts popped up accusing her of being sexist by discriminating against men, with some making claims without providing the quote. There was even an effort to sabotage the movie by user review bombing on RottenTomatoes, prompting the site to remove pre-release comments and ratings. This type of controversy is fueled by the fear of change. In the end, it doesn’t matter if you are not a fan of one movie or what the lead actress said. What matters is that movies that break gender and race norms can continue to be made without unfair pressure.\n\nFemale superheroes movies have had a rough time in the past. Pressure and assumptions have been placed on these movies, leading to the entire sub-genre being judged on the performance of two failed films. This kind of structural inequality for women is common in patriarchal societies (system that gives power to men) like our own. Thankfully, filmmakers took a chance *Wonder Woman* and *Captain Marvel.* As a result, we can now prove that female superhero movies are profitable at the box office and through merchandise despite old industry norms saying the contrary.\n\nIt is unfortunate that female superhero movies have been repressed for so long despite rising demand. The sexist ideas that place damaging pressure on these movies (and brought us *Catwoman*) need to be cast out. Female superhero movies don’t need to be universally acclaimed and make $1 billion at the box office to have a place in cinema; the pressure isn’t needed. People that are threatened by more female roles need to recognize that things change. Yelling at the clouds may attract attention, but it won’t stop the weather from changing. What is important is that female led movies will lead to more female led stories told by people with different perspectives that might not have had the opportunity do so in the past. Hopefully the unfair pressure placed on female superhero movies will lessen over time.",
    "title": "The Pressure on Female Superhero Movies and the Captain Marvel \"Controversy\"",
    "subreddit": "Feminism",
    "timestamp": 1555789944,
    "score": 80,
    "keyword": "white judge"
  },
  {
    "text": "Is Intersectionality used in too much of a blanket way? First off I could definitely use more education on the subject so I'm asking in good faith. I would also like to provide a trigger warning for the second article I have linked.\n\n&#x200B;\n\nWhile I believe that some groups are more oppressed than others, I don't believe that every member of a group is more or less oppressed as a whole. Intersectionality seems like a good guideline to me but I think it can be overused. I've seen before protests like this one: [https://www.independent.co.uk/news/world/americas/student-protesters-campaigning-safe-spaces-block-white-students-from-attending-classes-racism-a7383676.html](https://www.independent.co.uk/news/world/americas/student-protesters-campaigning-safe-spaces-block-white-students-from-attending-classes-racism-a7383676.html) and seeing them block out all of the people as a whole makes me wonder if some take intersectionality to mean that \\*every\\* person from a generally more oppressed group is more oppressed than someone from a generally less oppressed group. \n\n&#x200B;\n\nI am a genderqueer person. I have had an abusive father and I've endured stares and aggressive behavior in public by strangers; to the degree that I've had an aversion to visiting public places. But I haven't had it as bad as the white, possible cis (you can't really know when people are that young.) children, some of them boys, in this case: [https://www.news.com.au/world/north-america/homeschooling-allowed-abuse-of-13-children-to-carry-on-undetected/news-story/742a0c146d3412ff0e7928fef58f95c6](https://www.news.com.au/world/north-america/homeschooling-allowed-abuse-of-13-children-to-carry-on-undetected/news-story/742a0c146d3412ff0e7928fef58f95c6).\n\n&#x200B;\n\nI've seen stories like the one about the protest and have assumed that the general position among Feminists is that Intersectionality applies in all cases, but I realize this might not be the case (obviously it's not the case among all Feminists, but I'm wondering about what's the \"norm\"). \n\n&#x200B;\n\nIn general I think Intersectionality is good for determining which groups should have a higher priority when it comes to political action, however, If it is used to judge all people within a group it is excessively Modernist.",
    "title": "Is Intersectionality used in too much of a blanket way?",
    "subreddit": "Feminism",
    "timestamp": 1552087655,
    "score": 0,
    "keyword": "white judge"
  }
]