[
  {
    "text": "Am I getting the run around from Hobby Lobby? I've been looking for a part-time job for a while. I'm a full-time artist and of course that doesn't pay very well, so I've been seeking a part-time job to pay the bills.\n\nI figured Hobby Lobby would be good because I go there often, it's near me and they're seeking a part-time sale associate with the hours I'm looking for.\n\nMy last job was a retail general manager (not a big resume gap and I quit with 2 week notice) and no gaps before that. So I applied online and called the store the next day and the woman I spoke to said \"the hiring manager is on vacation, please call again in 2 weeks on Tuesday, we will be going through applications then.\" \n\nOkay so I called on Tuesday (this week) and asked if they're still hiring for the position and this lady said \"Yes! We are, but I would come apply in person because I'm not sure if we're doing online applications anymore? I would apply in person just incase and we're going though applications next week.\"\n\nI felt like this was super strange? Or am I tripping? I'm wondering if I should go apply in person or if I shouldn't bother and they're trying to make me go away lol",
    "title": "Am I getting the run around from Hobby Lobby?",
    "subreddit": "jobs",
    "timestamp": 1678470680,
    "score": 4,
    "keyword": "woman artist"
  },
  {
    "text": "Need a new plan ASAP  \n\nOK I need some help to figure out a plan and some next steps. I find it really hard to talk about my finances and I'm a bit embarassed I'm not doing very well at the moment. I can take constructive feedback well and I'm clearly doing something wrong with my money... but please be gentle with me. \n\nAbout me: \n\nI'm a 32 year old woman, living in London (I've lived here for 10 years +) Originally from a smaller town, but don't have family there anymore and all my home friends moved away. London is now the only city I have a network in. My friends, Job, partner (New relationship of around a year) are all here. In my mind it just feels like I can't afford to be here anymore but I don't really have anywhere else I could go without starting again completely. I live with a very good friend and her partner, we all rent a two bed flat together. Our landlord has recently kicked us out and we've had to find somewhere else to live within a couple of months. This has been a nightmare and the rents have gone up more than I've ever seen in the space of a year. I've had to move about 9 times in London and this has been the most stressful by far. We've just signed on a new place which is making me feel nauseous (as we've got to somehow front new deposit/moving costs and a significant increase in rent). There's a two week overlap where we'll have to pay double rent in November - I'm not sure how I'm going to do this yet. \n\nMy partner earns quite a bit more than me and tells me from time to time - if I really need help, he's there... I of course appreciate this gesture but I hate the idea of borrowing money from him or anyone I know. I also don't know how I'd pay someone back at this point in any good time. So here I am on Reddit, trying to work out how to be self-sufficient enough and make a solid plan out of living like this. I don't have a money safety net from family. My parents both struggle enough financially that I've never asked them for help. They have on occassion helped with very small gestures to help pay for a food bill. \n\nMy current work situation: \n\nI work full time in a charity managing a team to support women to leave Domestic Violence. It's only paying 34k and I've been pushing and pushing for development to go into higher paid roles. This has been slow and I'm feeling a bit stifled/impatient about how little movement there's been in the last 12 months. The work itself is very stressful and of course emotionally draining and I'm in a bit of denial about how burnt out I am. We from time to time get an end of year bonus - but this isn't very much and doesn't usually touch the sides. \n\nI used to be able to hustle my way through my 20's and was always able to make ends meet/figure out how to live semi-comfortably. I realise inflation and cost of living has been changing my ability to do this. I think I figued out the other day - I had the buying power of a lot more 8-9 years ago when I was waitressing (in contrast to todays standards). I was never able to save much money back then but I could have a balance of work/life that felt managable. I've had a bit of an eclectic \"non-career path\" in my adult life, partly I suffered with depression in my early 20s and as a result didn't finish my degree (This was in photography... so not exactly a money maker). \n\nMy working history: \n\n\\- I spent 3-4 years working in an artists studio (Assisting, lighting and set-building) working with big brands and on events like London Design Week. \n\n\\- Whilst I was working in the photography industry - I spent 3-4 years managing a restaurant on the side. \n\n\\- In the last 4 years I have been progressing in my current job working as a Domestic Violence Caseworker and now senior in the organisation. \n\n\\- I am also a Qualified Masseuse ( I know... a bit random)\n\nI consider myself to be very capable, adaptable and have a great work ethic. I'm great with people, managing and can work in high intensity/high stakes environments without getting flustered. I have a love and passion for the arts and photography (but like a lot of people - I don't think I was very well suited to how much drive/dedication it would've taken to be an artist in my own right - whilst trying to survive financially). I've found a lot of meaning and joy working with people and I feel like I make a positive impact. This has been important to me and I would love to find a way to continue this in some form. \n\nMy living costs as of next month (When I move): \n\n**£1,719.50 - This includes my rent, pension plan, student loan repayments, bills, credit card repayments and cost of having a small dog (I got him before the cost of living madness soared), insurance and basic food/travel.**\n\nI just spent a while breaking it down and I need to be on £52k to be truly comfortable - This would give me a take home pay of 3k after pension/student loans and £1200 to spend/Save after essentials. I want to have enough to save for an emergency pot of money and to one day have enough to invest in a home one day/contribute meaningfully with my partner to buy something together.  \nI'm currently taking home £2100 and to be honest - I've fucked up. I've been in a bit of an avoidant cycle of budgeting/paying lots of attention to my financial situation - then spending periods of time burying my head in the sand - not taking my living costs seriously enough which has led to being in around £10k Credit card debt. I'm desperate to not be spiralling further into this and unsure what to do next.  \nGame plan ideas for next steps:  \nI'm thinking of applying for some adhoc work as a side hustle - I've applied to get Adhoc Barista work and thinking about looking at local hospitality spots to pick up some bar shifts somewhere... I'm super hesitant to do this longer term as my full time job is very demanding and think the pay wouldn't be worth the amount of energy I would spend doing this. I'm thinking I would be better off putting this energy into applying for jobs.  \n\\- I have room to negoatiate up to 37K (The top band of my current role at work) as I've taken on a lot more work responsibility whilst only moving up 1k annually in recent months. I should be able to do this in the next 4-6 weeks.   \n\\- I'm trying to think of other small ways to take the edge off - e.g. dog walking when I take my own out to try make a bit of money in day.   \nThese are all short term solutions and I'm having a bit of trouble planning for the longer term which I need to shift my focus to. The way I'm living at the moment is causing so much anxiety, I'm always thinking about how I'm going to survive and it's getting me really down. I'm really scared of getting to a place where I've burnt myself out so much - that I lose the will/momentum to make some bigger moves/changes. The thought of leaving my city or giving up my dog breaks my heart and I know I'm capable of making some changes. I've come this far and I want to find out a way to create some stability. \n\nI would love suggestions/input/ideas and areas you think would be most fruitful to focus on. I can't afford pay cuts/costs of studying/retraining in this moment - but I would love tips on Job hunting/career development/career shifts/gear changes that might be helpful for me to consider. \n\nIf you've made it to the bottom, thank you for taking your time to read this.",
    "title": "Need a new plan ASAP",
    "subreddit": "jobs",
    "timestamp": 1696974495,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "I unintentionally sabotaged my ex coworker’s professional relationship by asking his former coworker if he was ever inappropriate towards her. Am I to blame? I was 23 (27 now) when I joined the company, and it was really helpful to receive mentorship from an older coworker (50) in senior management. He was always friendly and helpful, but last year he started being inappropriate when I left the firm. The biggest WTF moment was when he texted me an artistic nude of a woman about 2 weeks after I left. There were a few times when he’d send me songs on YouTube with obviously romantic connotations. \n\nI brushed it all off for career reasons, but when he cancelled on dinner with me last minute because he said he was tired from having grabbed lunch with a former coworker from 10 years ago, I became extremely annoyed. \n\nI reached out to his former coworker (a lady in her early 40s) by googling her name, finding her number, and texting her - then I proceeded to ask her about him. She told me that he’d occasionally text her long messages, but he was always professional. She was shocked by what I said (2-10x text me if I don’t respond, text me sexually suggestive things, etc) and told me to just stop responding to him. She said that another lady had been invited to the lunch but she declined because she can’t stand the guy. \n\nIt’s been 11 months since this incident and my ex coworker always suggests grabbing food at this very same restaurant that he went to with his former coworker. To the point where he’d go out of his way to meet me there (it’s an hour drive from his place, requires tolls, and is close to his last company). Turns out he quit his job at his last company right after this lady was laid off, and he’s regretted it ever since. He’s kept in touch with this lady for 10 years, and since I reached out to her, it sounds like she’s refused to meet him anymore (but didn’t tell him I’d talked to her). \n\nTldr; what do you think of my sabotaging his professional relationship with his former coworker? Sounds like he had a crush on her or something. I didn’t heed her advice and kept talking to him because I was involved in an accident and he’s been helpful since..he’s not a bad guy but he is not professional. \nThe thing is, I would’ve never reached out to anyone in my ex coworker’s professional network if he hadn’t made me feel like he was hitting on me. Also he’s married.\n\nI also vaguely mentioned to my ex boss that he wasn’t “very professional” and she took it BADLY. I def burned bridges and am a little sad.",
    "title": "I unintentionally sabotaged my ex coworker’s professional relationship by asking his former coworker if he was ever inappropriate towards her. Am I to blame?",
    "subreddit": "jobs",
    "timestamp": 1680995266,
    "score": 0,
    "keyword": "woman artist"
  },
  {
    "text": "My friend divorced her loving husband because he wouldn't leave his job in Saudi Arabia It came as a surprise. They were so in love. He was handsome and she was pretty. A perfect match.\n\n\"He is the one,\" she confided in me when we were in college.\n\nFor years they struggled to find stable jobs in the US. The husband was feeling a bit depressed and, somehow, he found a gig to work as a recruiter for a US oil company in Saudi Arabia. The job was never meant to be permanent but it paid really well. \n\nAt first, she would fly to see him monthly. Monthly visits weren't enough for her. Eventually, she quit her job and moved there with him. \n\nIt was only a few years, she said.\n\nWell, \"a few years\" became longer and longer. We stopped counting.\n\nShe told us she was happy. \"They have everything in the compound. I can do anything I want. There are so Westerners here.\"\n\n\"Aren't you bored?\" I asked innocuously.\n\n\"Not really,\" She lied.\n\nTurned out there was no fulfilling job for Western women. She stayed in the compound all days. Yes, he made enough money for both of them now but she became a prisoner in her own home. She couldn't even leave the compound without permission.\n\nPermission!\n\nAfter 10 years, she couldn't take it any long. She threatened to come back to the US alone. He accused her of being selfish. Afterall, he could provide for both of them now. There was no need for her to work. God forbade if she was lonely. So many content Western women in the compound. She just needed to be like them. So many things she could do in the compound!\n\nShe left. He didn't follow. \n\nHe never understood what she needed.  He could provide for them. She was safe in their home in the compound.  What else she possibly wanted?\n\nNow my friend is alone in the US and her ex is dating another woman. This woman is happy in the compound. She is content to stay at home and wait for him. She is happy to hang out with other Western women during the day inside the compound. \n\nI wonder how many years she can stay happy.\n\nUpdate: I think she studied performing arts and she dreamed to be a performing artist. She is not a doctor and engineer. She loves to dance and sing on the stage. She is now in a local band.\nI confess I don't know much about Saudi Arabia but I know my friend weren't happy there. There was no fulfilling job for her in the compound. Is it wrong for my friend to want to share her talents on the stage?\n\nSecond update: Where did those misogynists come from downvoting my sisters' comments? They speak of the truth. We will not be silenced.",
    "title": "My friend divorced her loving husband because he wouldn't leave his job in Saudi Arabia",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1680470505,
    "score": 4119,
    "keyword": "woman artist"
  },
  {
    "text": "Does any one else worry about their internal feelings toward men in general? I have noticed a shift in my thinking in the last couple years that is starting to bother me more and more. \n\nJust by being on the internet, I feel like I am  constantly exposed to things about men being generally awful to women. Weaponized incompetence, leaving women to bear the brunt of child rearing and the mental load, sexual harassment and violence, laws limiting our access to reproductive care/abortions, belittling or disregarding our experiences, entire religions focused on subjugating women, women's complaints being ignored in healthcare settings, the list goes on. \n\nI find myself regularly expecting or thinking the worst of men. Maybe it's the guy at the gas station who I feel is being creepy but he's just getting gas, or watching a young family at the grocery store and mom is corralling the kids while dad blissfully is along for the ride, noticing at large family functions its the women who eat last and get up first to clean up, interpreting interactions with my male industry peers as disrespectful. \n\nEven when I am watching a show/movie or reading a book, I spot negative behavior from the male characters and it sours it for me. For awhile if news came out about an artist or actor about them being general shitbags, I have an aversion to any media they put out, etc. \n\nIt's frustrating for me bc I am not a hateful person at all and I know a lot of wonderful men in my life. My husband is amazing and very much equally shares the mental load/kids/work, has never treated me as anything different than a whole person first, cried with me when RvW was overturned. My BIL is the same way with my sister, my dad and stepdad both have had always been my supporters and never made my sister or me feel like we couldn't do something because we're girls. I have friends with equally as adjusted and contributing partners and my husband and BIL. \n\nI have no lack of examples of loving, kind men around me but I still have this constant and nagging feeling that \"men suck\" and I can't help but notice the most minute details of patriarchy and sexism affecting things around me. \n\nI logically understand that this is a long standing societal and cultural issue and that any one individual is a sum of their experiences, and large changes are difficult to come about and maintain but that just feels like a cop out excuse to keep the staus quo and just ignore the very real and legitimate suffering women face daily. \n\nI've considered a media diet, but that just feels like cognitive dissonance now that the veil has been pulled back for me. Idk, maybe I just needed to scream into the void or hear other people's feelings on the subject.\n\n\nEdit: this is getting way more attention than I expected it to, and I'm excited that there's genuine discussion going on. I just wanted to clarify that I'm not condoning hating men \"bc they're men\" and I understand that the internet and reddit in particular can become an echo chamber. I do plan to take a step back from my use of reddit and sm bc it's clearly affecting me. \n\nI also wanted to clarify that while I think reddit/sm is exacerbating these feelings I'm having, the feelings didn't sprout from only exposure to things online and that my having some wonderful men in my life is not mutually exclusive to having negative experiences with men irl. \n\nI've had a doctor tell me I'm less intelligent and capable bc I'm a woman while in grad school. \nI've had male patients tell me I should stay home insread of work. \nI've been SA'd, know of endless other women who've had similar experiences. \nI've had men assume I'm flirting with them, hang around the bar until I got off work, and try to follow me to my car when I was just taking their drink order. \nI've been groped on public transport. \nI've had to take a friend to the hospital and be there for her as she gives a statement to the police bc her husband choked her to unconsciousness. \nI've watched parts of my extended family defend my child molester uncle to not rock the boat. \nI've been cornered by men while taking a walk on the beach, and only came out safe bc I lied through my teeth that my husband was meeting me.\nI had a predatory and disgusting youth pastor throughout middle school that took advantage of one of my friends. \n\nThese are just examples that I am recalling quickly, but if I sat here long enough, I could think of A LOT more. And it's this life long and continuous exposure in my lived experiences where these feelings of frustration, disillusionment, and helplessness started.\n\n\n\n\nTldr: I don't want to automatically dislike or think the worst of men, but don't know how to not feel that way in face of the constant exposure to adversities women face daily.",
    "title": "Does any one else worry about their internal feelings toward men in general?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1695817305,
    "score": 2477,
    "keyword": "woman artist"
  },
  {
    "text": "Client told me he hadn't realized I was \"Intelligent\" This is kind of a light, humorous story but it's been on my mind so I thought I'd share. \n\nI've been a freelance artist for a few years and just recently started as a freelance writer for one of my long time clients (first one i ever had actually!).\n\n I've know this guy for six years almost, and sure we don't chat all the time, but we've definitely had multiple hour long meetings to talk about projects, take notes, catch up, etc. \n\nSIX YEARS. Which is why I found it so ridiculous when we met up about a month back to talk about a writing sample id sent him and he told me, genuinely impressed, that he'd \"Never realized you're actually intelligent\" until he read my sample. \n\nBro wtf.\n\nI mean it's not like I'm a genius or anything, but seriously? Took you six years to figure out I'm not an idiot????\n\nCan't help but feel like it has something to do with the fact I'm a short 20 something woman and he's a pretty tall 50 something man, idk, he's never taken me very seriously in general, but I was honestly shocked this guy couldn't tell I was \"Intelligent\" from our many MANY interactions. \n\n Made sure to ask him to elaborate and got him to squirm a little.  Still think it's funny even a month later, abs he's definitely taken me more seriously since.",
    "title": "Client told me he hadn't realized I was \"Intelligent\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1682468076,
    "score": 739,
    "keyword": "woman artist"
  },
  {
    "text": "What do you like about being a woman? Saw this question posed to men in the \"Ask Men\" subreddit. I thought so many stories here are sad, and it's about time we had a thread about what makes being a woman enjoyable! \n\nI'll start: \n\nThe whole magic/witch/Gaia Goddess energy I feel when I'm in nature or feeling creative. The fact I don't have children but I feel this amazing potential and motherly energy inside myself. The way yes periods hurt (I have endometriosis so I get it!!!) But they also give me a creativity boost and I feel like I have a moment of elevated sensitivity I can direct into artistic pursuits. \n\nThe fact it's more socially acceptable for me to be creative, emotional, wear makeup and express myself freely. That freedom of expression is so valuable to me. \n\nI also like the fact that yes the downside can be feeling unsafe in public BUT I love the feeling of being  protected, the way I can nurture and receive that without much ridicule. \n\nThe way women are allowed to be more youthful, young at heart, recieve things like flowers, plush toys and things that would be less socially acceptable otherwise. \n\nI feel like we're more secretive and mysterious. That there is something inherently magical about femininity and how we are just so much more in line with the natural passing of nature etc. \n\nAt least that's how I experience it. And if I want to be a \"tomboy\" I can do that too!\n\nEdit: The response to this has been so lovely and amazing! ❤️ I loved the contributions from trans women and non binary people too. The way they shared what their feminine aspects meant to them. There are so many heartfelt and gorgeous replies. Thanks for all the love. \n\nThe only negative is a small handful of people misread this post as me dictating gender roles to people etc. This is what it means to me personally and what gives me joy. It resonates with the vast majority of commenters and that made me really happy. \n\nIf you have a different point of view feel free to share it joyously without having to insult or dunk on anyone else's beliefs or perspectives. \n\nThank you and stay kind. 😇",
    "title": "What do you like about being a woman?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1685708353,
    "score": 669,
    "keyword": "woman artist"
  },
  {
    "text": "I still can't believe the amount of bullshit I put up with as a woman in the trades. I (26F) have been an ornamental welder fabricator for 4 years now. I love fabrication, and the math and problem solving that comes with it. I work in a very small shop with a certain clique of older men pushing retirement (60sM, 59M, 52M). They give me the hardest time at work, so here is a fat vent.\n\nAfter being here for this long I have made a few observations. These 3 guys are the lowest on the totem pole. One of them is very bad at his job (painting) and the boss has laid into him about it. Our work looks like shit because of him. I think they are aware of their position, and also with retirement looming (becoming irrelevant), they are really doubling down on being absolutely miserable. I believe they also feel a bit emasculated that a young, single woman literally half their age and size (5ft. 110lbs) is doing the same amount of work that they do. I got a $4/hr raise last year, so I must be doing something right.\n\nOn top of the racist, sexist, hypocritical, ageist comments, other recent bullshittery includes:\n\n- I didn't hold the door open for these guy a couple times, so now if they see me coming, they will purposely turn around and close the door right in my face.\n\n- Out if habit, I shut the stairwell light off. 59M ripped into me about him having to walk in the dark even though: there is another light switch at the top of the stairs, and he has also done this to me in the past.\n\n- 59M plastering signs everywhere about cleaning your messes even though he leaves the messes in the break room sink (only he and I use the break room bc no one can tolerate him).\n\n- 60sM constantly has his head up my ass. He cleans the welds of our products. He talks to me with this nasty tone of voice. He came up to me berating me for not welding 1/8th of an inch further. Constantly bitching about how I do things, and if he is particularly pissy he will slam my products around, sometimes breaking them. He is not my boss so I try and ignore it.\n\n- If I take a personal day, they somehow get wind of it, and when I come back they are constantly saying \"Oh, maybe I should call in tomorrow\" like it's an insult? 59M also mocks my \"girl\" voice when bitching within his clique.\n\n\nI'm probably going to get a lot of comments to leave this situation. A few things are holding me back:\n\n- It pays quite well. I also love my boss and other employees. The guys I do like usually have adult daughters of their own, or have children. \n\n- We will be moving to a new location this year and will be combining with another shop in the company. This will get me away from the clique, and be around more people. Could be a double edged sword though. The Clique will talk shit about me, or there will be more of these old miserable types.\n\n\nI will see how things go at this new shop, if it doesn't ease up, I will leave. I just love building and making tangible things with my hands. It is upsetting that this older generation is killing potential new hires (men and women both) because of their garbage mentalities. I'm sure I'm in one of the worst situations out there. \n\nTo ease the stress, I have recently taken up an artistic hobby (needlepoint and weaving!). This has helped me get through tough days, keeping my mind occupied. I also feel much more confident because I know I can go home and create something amazing. I am also taking up yoga in the evenings and my body is loving it. I am no longer sore from my work! I wish I could spend more time being creative like this. One day I will have my own workshop, and I dream of running my own business. \n\nSo, here I present my dump of complete bullshit. I don't feel like there is a solution than waiting until these guys retire. It is very sad how these men live their lives. Work is their life, and they live off gossip for excitement. They will age out eventually. Good luck to any other women in a similar situation.",
    "title": "I still can't believe the amount of bullshit I put up with as a woman in the trades.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1673457742,
    "score": 168,
    "keyword": "woman artist"
  },
  {
    "text": "Is there a place to talk about movies and TV show in a women dominated environnement? Hi there :)\nPretty new here and since I really enjoy movies and movies related discussions, I was wondering if there is a subreddit on those topics not flooded by men tastes/views..?\n\nDon't get me wrong: I'm not saying that men views on those topics aren't interesting but, honestly, I kinda got bored to be ignored, at best, down voted, at worst, for suggesting women leaded movies or movies with a woman POV. Or simply movies not involving violent narcissists.\n\nAnd, ngl, I definitively have reached my personal capacity of \"OF COURSE you have to dissociate the artist from the man..! Who cares what Polanski did? He's a genius!\".\nI can't. I just... I just can't anymore.\n\n\n\n[I edited some typing/conjugation errors]\n\nEDIT: Since I didn't find any and no-one knew an existing one, I create this: r/HerCinemaChronicles\n\nI'm eager to meet you there :)",
    "title": "Is there a place to talk about movies and TV show in a women dominated environnement?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1681732602,
    "score": 108,
    "keyword": "woman artist"
  },
  {
    "text": "Just saw Six: The Musical yesterday and it’s a feminist masterpiece I’m not sure if this fits here but I want to express my love and admiration for this musical.\n\nFor those that don’t know, Six is about Henry the VIII’s six wives. They have a competition about which one is the best wife by comparing their sufferings and the winner is the one who had it the worst. They each sing their song (the style inspired by various female pop artists) about how they and their lives got screwed over and how they have it the worst. They also start arguing with each other and comparing their miseries.\n\nThe last queen (Katherine Parr) talks to them and makes them realize that all this arguing and comparing is dumb. Instead of being against each other they should stand united against the men that pharmed them. Additionally, they talk about how them being only known because of Henry the VIII and only as “his six wives” is dumb because they are so much more than that and all had their own personalities and lives and values.\n\nI just love this show and it’s wonderful in so many ways. It stars only women (excluding the band on stage), it was co-written and co-directed by a woman, and the costumes are absolutely amazing (has won numerous Tony’s). The message of not arguing and comparing ourselves as women to each other to make ourselves feel superior but instead standing united and fighting our true patriarchy is wonderful. \n\nNo matter if you’re pious, ditzy, family-oriented, independent, promiscuous, or academic, we all as women should stand by each other because we are not the enemy. The message is very prominent, they mention the patriarchy specifically and talk about it as a negative thing in the musical and it is beautiful. I recommend everyone listen to the songs (as they are the main thing of the musical) and if you have a chance to watch it I highly recommend it.",
    "title": "Just saw Six: The Musical yesterday and it’s a feminist masterpiece",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676759324,
    "score": 66,
    "keyword": "woman artist"
  },
  {
    "text": "I've figured it out: a significant portion of men have \"dick ego-centrism\", feeling entitled to having their urges indulged, and/or falsely believing women are trying or wanting to indulge them. I've figured it out: a significant portion of men have \"dick ego-centrism\", feeling entitled to having their urges indulged, and/or falsely believing women are trying or wanting to indulge them.\n\nIt's on a spectrum from self-aware and suppressed to delusional and fully expressed.\n\nOne of the catchphrases of a dickcentric man is, \"She knows exactly what she's doing.\" They see a woman in yoga pants and think, \"That's for my dick.\" They see a woman bending over to pick something up and think, \"That's for my dick.\" They see a 14-year-old girl doing a goofy TikTok dance and think, \"That's for my dick.\" When they're in the bedroom with a woman, they choke her or try anal without asking, because it's for their dick and that's what matters. \n\n&nbsp;\n\nYou can divide the spectrum up into these rough categories:\n\n1. Men who don't have this problem.\n2. Men who have this problem but are self-aware enough to scold themselves and not let it impact their behavior.\n3. Men who would be in the above category except it simply hasn't been brought to their attention yet.\n4. Evopsych bros who see any such problems as just being \"nature's plan\".\n5. Men who may be semi-aware of the problem but lack sufficient self-control and/or empathy.\n6. Men who are downright delusional, full ego-centrism.\n\n&nbsp;\n\nThe levels of Insane Troll Logic men are willing to dive into to justify it also varies.\n\n1. Pedophiles trying to say prepubescent children secretly desire sexual attention are of course at the top.\n2. Men who think violent rape is justifiable if the woman shows some ankle.\n3. Men who think pickup artist tactics are justifiable because they \"earned\" the notch on their belt.\n4. Men who think a woman wearing yoga pants at the gym holds responsibility for any sexual harassment they receive.\n5. Men who complain about the \"friendzone\", thinking the social relationship lacks value because their dick isn't involved.\n\n&nbsp;\n\n#Tl;DR - Imagine thinking the world revolves around penis",
    "title": "I've figured it out: a significant portion of men have \"dick ego-centrism\", feeling entitled to having their urges indulged, and/or falsely believing women are trying or wanting to indulge them.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692387588,
    "score": 40,
    "keyword": "woman artist"
  },
  {
    "text": "On dealing with my boyfriend’s sexist friends in a second language I’m not sure what I’m looking to achieve by writing this post, perhaps I just need to get this off my chest. However I’m open to advice or encouragement. Tell me to chill, I don’t know.\n\nSorry for the length, I hope this isn’t boring.\n\n\nBackground:\n\nI (32F) am an American in Europe. I’ve been living here, in the same country, for about a decade so the language barrier isn’t such an issue. When I encounter situations where cultural differences are evident, I try my best to reserve judgement and just listen until I’m sure I understand what’s going on.\n\nSo our country’s lockdown was pretty strict. After the first wave, I moved across the country then got stuck in lockdown again in a brand new city. Fortunately, I met a fantastic guy around that time and we spent a lot of our quarantine together.\n\nHe’s not the kind of guy I wouldn’t normally go for: he’s in finance and is a semi-pro sports player. I’m an artist, I’m bi, I’m mixed race, and clearly a foreigner- it’s cool, I’m happy with who I am, but it’s obviously easier running in social circles where we have at least a few of these things in common.\n\nI figured I was changing a lot in my life at that time so why not try to get to know someone who I normally wouldn’t have reached out to before. It turns out it was a great decision. My partner is a fantastic human, his family is also super open to our relationship which isn’t necessarily a given in this region. Thus far, we’ve been together for nearly 3 years.\n\n\nThe issue:\n\nAs we began to settle into our normal lives after COVID, we started hanging out with my partners friends more (most of them are from his sport). Eventually they could resume playing, so a lot of my Partner’s time was spent with the team. Many nights were dedicated to after practice/game hangouts, which was mostly a lot of fun…. except… the rampant misogyny. Honestly I was floored at some of the shit I heard.\n\n\nHere are some classics:\n\n-Just the free usage of the our language’s equivalent of bitch, slut, whore and f**. Sometimes even racial slurs\n\n-A dude at a wedding yelling out “so guys what bitches/sluts are you trying to find tonight” while his wife and baby were at the other end of the courtyard\n\n-Another referring to his wife and mother of his child a crazy, emotional *girl*\n\n-Yet a different wedding one of the groomsmen didn’t understand why Pride needed to be a thing. The irony, gay marriage is not legal here\n\n-Many of the team players have a tattoo for a famous player of their sport, who raped a 19yo. I’ve asked, they still insist “she was lying” or “even if it was true he was really good at said sport”\n\nAnd finally the one that tipped me over the edge:\n\n-I found out a couple months ago, one of their ex teammates stealthed a friend of mine. I can’t say I’m surprised but I would be shocked if this sort of behavior was an isolated incident \n\nFor the first several months of getting to know some of these guys I was pretty reserved. just absorbing context. Getting to know new friend dynamics is difficult on its own, in a different language it’s even harder. However, after a while it was clear that I wasn’t misunderstanding much.\n\nI don’t know if it’s me being a woman or a foreigner, but any time I interjected, no matter how calm or rational it was packaged, I was met with opposition. Most of them would just double down. It’s not really a surprising result. After a while I felt myself becoming hostile to my partner’s friend group as a whole (even though some of his friends are actually chill people). It was not a good look.\n\nMostly I was upset my partner never said anything. Like his discomfort was palpable in some of these situations, but didn’t see the point in being confrontational if the guys weren’t in his close friend circle.\n\nAs for some of the guys in his close friend circle- fucking yikes. To be fair he has been trying to be more proactive when derogatory things are said.\n\n\nThe solution so far:\n\nAs I started making my own friends it has been easier to avoid situations around my partner’s sports friends. I even thought at one point that I was blowing things out of proportion. But now that our interactions are usually for specific events, their disrespect is just more evident.\n\nSo, that’s it. Distance is my solution.\n\n\nThe question:\n\nI don’t even know what advice I need. My partner just finished his last season, but this topic is still thorn in our otherwise great relationship. \n\nIt sucks that I cannot spend an extended amount of time with some of his best friends. And I feel very uncomfortable knowing my partner’s good friends have such little respect for women- but of course I’m never going to say “it’s me or them”.\n\nLike I said, he’s being more assertive on this topic, he has major golden retriever energy and does not like to disappoint people. I applaud his efforts and don’t think I can fairly ask for anything more. \n\nWhen I do see his bros, I’ll just have to keep it superficial until further notice.\n\nThanks for reading and letting me vent.\n\nTDLR\nMy partner and I are an odd pairing. During COVID we made it work then I realized a lot of his friends are pretty sexist. I thought something was lost in translation or there was some cultural thing I didn’t get, but that wasn’t it. My SO makes an effort to speak up when they say fucked up shit but some of his friendships still make me uncomfortable. As a solution I avoid most interactions with his buds. It feels bad.",
    "title": "On dealing with my boyfriend’s sexist friends in a second language",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690741434,
    "score": 26,
    "keyword": "woman artist"
  },
  {
    "text": "💚 Thank you, teachers. I succeeded in life because of you. 💚 To the many unsung, overworked, and unjustly treated teachers on this sub I just want to say: thank you so very much for all that you do. What you do matters, and I know teachers *know* that, but sometimes it’s still nice to hear.\n\nI want to share my story of how teachers dredged me out of the depths of Nowhereville and made me the (by my own measure, at least) successful adult I am today.\n\nI’ve tried to reach out to some of my past teachers, but many of them, at this point, have left the profession, or passed away. I cannot thank them personally, but want to sing their praises and thank you in their stead, because there are kids you work with today that will think of you the way I do my teachers decades later.\n\nI was born to a teen mom, mostly raised by my grandparents until my mother married my stepfather when I was 5 and we moved in with him. He was violent, physically and verbally abusive, and we were very, very poor. I was a little mousey nothing of a nobody. We moved a lot, and I was shuffled between schools early on. As a result, I had few friends, was self-conscious about our ill-fitting clothes and rusty cars, and just did my best not to be noticed.\n\nBut my teachers noticed me anyway and didn’t let me fall into what could have easily been another loop in the teen-pregnancy stuck in the same small town in Nowhereville saga.\n\nMrs E was my first grade teacher—the woman who handed me the keys to the world. She taught me to *read*. I could struggle along and was placed in the average group when I landed in her school after another move, but she saw something with me, spent extra time with me, and something just clicked with how she mentored me. Because of her, I was not only promoted to the highest tier reading group, but (much more importantly) became a lifelong voracious reader and eventually an author. Without reading as an escape from my early life, I don’t know if I’d still be here at all.\n\nMrs B was my fourth grade and talented & gifted teacher through 8th grade—she was passionate about the environment, would take us on hikes and we’d pick up trash as we went, teaching us to leave the world better than we found it. She also picked up on the fact that while I was a voracious reader, well, we were poor and almost all my books came from garage sales. She found me reading *Needful Things* (yes the one by Stephen King) in class and was (probably rightly) mortified at my choice of books at age 10, but impressed that my reading comprehension was already that high. She took the extra time to find me books that were more age-appropriate but still captivating and challenging for me to read.\n\nMr M was my history teacher in high school, and he stocked shelves at Kmart at night. He was kind, unabashed about his second job (before then I didn’t know how common it was for teachers to have second jobs), and unjudging. By this point I was a little goth girl, but he never treated me like I was a problem kid for how I dressed. (I was such a good kid, no drugs, no drinking, great grades, extracurricular stuff, but a LOT of people treated me badly for how I dressed—which was a side effect of poverty. I couldn’t afford expensive designer clothes so I didn’t even try to play that game and dressed in way to reject it. Which, oddly, paid off later as turns out that becoming goth at 13 pays big dividends to your skin when you’re middle-aged, and taught me that it’s *okay* to be different.) We didn’t have the money for me to sit for the AP History test, but he told me I’d qualified for a special scholarship and that the cost of the test was covered. Years later I learned that blessed man paid for the fee out of his own pocket for me. I passed and got my very first college credits because of him.\n\nMs K was my high school art teacher and I practically lived in her classroom for 4 years. Every studyhall, every class I could get out of early I would, and I’d be back in her room (on top of the multiple art classes I took). She taught me ceramics, stained glass, art metals, airbrushing, and she *pushed* me. I was smart enough and artistically talented enough to fall into the trap of not having to try too hard for a lot of things, but she challenged me to work harder, fail, and then recover from those failures and do better. She knew, without ever asking or tipping her hand too much, that my home life was awful and we didn’t have enough food. Since I got to school so early just to be anywhere but home, she always had an ‘extra’ muffin and coffee waiting for me when I got in to unload the kiln first thing in the morning. She looked the other way when I’d cut out of studyhalls to go to work early (because I was determined to go to college and started working and saving at 13 to be able to do so).\n\nAfter all that, on the brink of going to college, it nearly all came apart at the seams. My applications were coming back rejected: my name didn’t match my SSN. I had no idea my stepfather had refused to adopt me, but after one school shift or another, my mom started using his last name as mine so we’d ‘seem like more of a family.’ NONE of my school records from 3rd grade on were attached to a legal last name. The wonderful women in the school career office worked with me for weeks to get it sorted, and get me a new legal ID with the last name that matched my SSN. At the last possible second I was able to get my applications back out, and was accepted to my school of choice.\n\nWhen I graduated, I all but fled that shitty, dying town and never looked back. I did go to college, the first female in my family to do so, and paid my own way with money I’d saved (which seemed like so much but was gone in a semester), loans, and working 2-3 part time jobs in addition to a full class load. I graduated, another first in my family.\n\nI’ve gone on to start my own business, become a fantasy author, marry a fantastic spouse, and I live a stable, happy life. We’re not rich, but we’re doing more than all right.\n\nIf not for all my teachers, but especially these four, I know in my heart of hearts I’d still be in that crappy dead-end town, probably the wife of someone else that never left, shackled by debt and a litter of unplanned children.\n\nInstead, I am childfree by choice (thank goodness for comprehensive sex ed in my schools) and a *vehement* supporter of public education. I vote for every property tax increase that will better fund our schools, write letters to officials to support policies that support teachers, and if I didn’t think that a childfree person wouldn’t get a side-eye, would run to be on the school board ( do at least research and vote against the right-wing nutters trying to take over the local school board, so far, they have all failed to earn a seat).\n\n[There's a story about a child, and old man, and beach full of stranded starfish that I'm sure a lot of you are familiar with](https://www.thestarfishchange.org/starfish-tale), and in a lot of ways I feel like one of those starfish tossed back into the sea by my teachers.\n\nI wish there were more words for the gratitude I feel, I write for a living, but all I can circle back to is *thank you.*  It does not lessen the indignities you face, the challenges heaped upon you, or the appallingly stingy wages you are paid, but I hope this post is a small ray of sunshine for you on a bleak day.\n\nThank you, teachers, for seeing students like me that try their best to be invisible, for giving a shit when nobody else does, and for literally altering the entire trajectory of my life with you time, attention, and kindness.\n\nThank you, thank you, a million times, thank you. What you do matters *so much*. 💚",
    "title": "💚 Thank you, teachers. I succeeded in life because of you. 💚",
    "subreddit": "Teachers",
    "timestamp": 1683745809,
    "score": 54,
    "keyword": "woman artist"
  },
  {
    "text": "How to make sure that the people I lead are as content/happy with working with me as possible? (when I do not decide their pay) I'm a medior in IT; currently working in Prague.\n\n&#x200B;\n\n&#x200B;\n\nCouple of times I stepped up and 'took care of care of' juniors - formally, I couldn't \"order them around\", but my(our) superiour recently become a father, and I was able to answer 95% of their questions.\n\n&#x200B;\n\nNow, I see the ability to guide juniors as a crucial ability that every senior MUST have (because I remember myself how it felt when I was the junior, and could not rely on leadership - and how much that sucked), so it was the perfect learning opportunity.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nFortunatelly, I already had experience with teaching (hobby course) and guiding/leading (MMORPG)\n\n(it taught me surprisingly lot about teamwork - REAL, hands-on leading/guiding, not some 999EUR online course - I could write a page or two for free, but there is probably no demand for that, hehe)\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nI guess I would say I am looking at cost(time+effort)-effective ways to be a great \"boss\", as well as a \"medior\" (as in \"junior senior\") can be.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nI'm perfectly willing to invest(time+effort) if it saves me some, so for instance I created a fresh FAQ with relevant links directly in the software suite we all use (JIRA).\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nSometimes the best way to pass information to me was to send me a message on Teams even though I am sitting right next to them; sometimes I replied with code such as TICKET-1234, or just out loud say \"Critical. Thank you.\", or physically move to their desk and show them on screen; \n\nThinking back, that must have been confusing as hell to a fresh junior...\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nFormalizing those rules would mean they would spend half of an hour reading the rules making a decision whenever to ask me out loud or send me the screenshot or do something themselves, so I \"trained them\" (I know, they are not dogs) by... verbally instructing them what to do in that particular case?\n\nPhrasing it this way feels off, what I mean - in a purely polite/friendly manner (the whole company is on first-name basis, casual conversation when getting coffee or nicotine on company time is the norm; yes I know people do not work there to make friends, but why not chitchat about Baldurs Gate for a while if it does not mean you get paid less).\n\n&#x200B;\n\nMostly it would be like \"Send me the error code, please. Thank you!\", and if they ever used the word \"sorry\" regarding asking me something, \"Don't apologize for this(asking questions). That's why I am here for(answering them).\" \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nIf something was in the FAQ, I asked them to open it and try to go through the process as instructed, watching them - when they got stuck, I asked them to take a break (\\*explained bellow), updated the document, and asked them to try again... (yeah, I was basically debugging my instruction code with them, eh)\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nI do not ever recall even starting to feel annoyed or frustrated with the responsibility (which I would hide from them, obviously) - the questions stopped being repetitive very fast; I had the awesome advantage that we had that part of office for ourself, so we could have talked out loud with each other, making dissemination of knowledge very fast.\n\n(the superiour worked from home, and even he could not authorize for us to be allowed to do the same - it was never a topic)\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nI kinda loosened the attendance rules A BIT, in a way that it never became an issue. (\"Please try to keep me updated two weeks in advance, but if you find out in the evening that you need to skip the next day or the next week, just inform me on my work email when you can.\" - my superiour was satisfied with our total progress, that is all which is important)\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nIs there something else reasonable that I can do in my position?\n\nI have no power over their pay.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n(\\*break) - obviously, still on company time. We have access to tea and coffee machines, snacks... why would the office partner with art faculty students if they didn't want US ALL to allocate a part of our work time to enjoy art? When can be a person more free to enjoy art than \"It's not like I had to pay for a ticket; it's not even that this is taking away something from my limited budget of free time. This is just me, having time to wonder what did the artist actually mean.\"\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**TL;DR:** Sometimes I lead people at work.\n\n***I want do do everything in my very limited power to make sure they are as content, as possible.***\n\n&#x200B;\n\nAt the same time, I am worker myself, so it's not like I can do overtime every day to cover for them.\n\nI am giving this the **32 Hour Work Week** flair for three reasons:\n\n1. If I can not reduce the amount of time people have to work, I can try to make them hate time spend working a bit less\n2. It is not like anyone actually watched that they indeed were present from 9:00 to 16:00 exactly - arriving at 10:02 after enjoying breakfast (food being a basic human need) or dropping kid to school sounds still like arriving at 09:00; when it was 13:30 and I learned a server won't be available utill 14:45, and we can't do anything else - I just knew all of us will be much more efficient the next day if I tell them to take the resto of the day off\n3. It is how I work and how I think everyone should have the option to work; I also have a record of standing up to worker's rights - I was junior enlisted in the military, and stood my ground to the second-highest person in the chain of command (taken from all of those who served on that base), when they tried to rob me some of MY rights; that was fun.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nPS: Since it is IT and I mentioned gaming, behaviour towards women is a concern, so I am pretty sure some of you would have brought it up. I am 100% certain I neved made feel them unsafe, never had any sex-related or otherwise inappropriate comments... not even inappropriate looks. Nor I have seen that happening. (one of the guys was engaged and the other married - at our ages in Czechia, young and childless people age do not get married unless they really want to) (and I never even considered trying to ask out a woman co-worker that has less or equal power than I have)\n\n&#x200B;",
    "title": "How to make sure that the people I lead are as content/happy with working with me as possible? (when I do not decide their pay)",
    "subreddit": "WorkReform",
    "timestamp": 1693746942,
    "score": 8,
    "keyword": "woman artist"
  },
  {
    "text": "can you help my mom find a career and escape her abusive workplace? My mom has been working as a server on and off for over 30 years, and I can not bear to see her continue. She has worked at a few restaurants in the past 5 years, and each one has been worse than the last, especially post covid. Her luck with bosses has been truly terrible. I’m talking like, publicly berating her about her physical appearance, stealing her tips, and so much more. She is the single most optimistic person I have ever met, but this workplace is sucking that out of her. It’s heartbreaking to see. I’d do anything to help her escape this depressing and traumatic workplace. \n\nIt’s time to find her something more stable. She’s an exceptionally skilled server, and she loves the job, but with the economy downturn, tips are getting smaller and smaller. \n\nShe loves working with people, managing a team, and anything that involves using her sharp-as-a-knife wit and social skills. She has never enjoyed a job that requires her to sit down all day, but i think with the right accommodations (standing desk+treadmill) she could make it work. She has professional training as a butler, and has also been working a side job as a tour guide. This woman has unmatched charisma and energy, and is an incredible organizer and motivator. She is also highly creative, as she is an artist. In our hometown, she managed a knitting store, and was the highest selling salesperson at a local clothing boutique for the several years she worked there. \n\nAfter years of seeing her struggle on minimum wage, while being the hardest worker on her team, i am looking to the community to help me brainstorm what could be next for her.  She has applied for a government fund that would cover $7000 for any professional development course. \n\nthank you so much in advance. I desperately want to see her retire in her 60s, but at this rate she has no ability to save for the future.",
    "title": "can you help my mom find a career and escape her abusive workplace?",
    "subreddit": "careerguidance",
    "timestamp": 1682200886,
    "score": 6,
    "keyword": "woman artist"
  },
  {
    "text": "What kind of roles would fit my experience? I am currently searching for a new role, but struggling to land something because my background is very broad. I am essentially a mid-career renaissance woman with tons of strong skills and talents, but no degree or official management experience outside my own very small company.\n\nMy strengths are in:\n- interpersonal communication\n- writing\n- presentation design\n- public speaking\n- event planning\n- strategic planning\n- project management\n- efficiency and problem solving\n- guerilla marketing\n- any creative, collaborative, or relational work\n\nMy most recent work history (since 2016 and as far back as 2010) consists of a few entrepreneurial ventures, freelance contract work, and gigs. This includes work as an artist/designer, performer, astrologer, tarot reader, reiki healer, relationship coach and matchmaker. These all have pros and cons, but none of them are a fit for my financial needs. \n\nI am also a founder of a relational skills education startup, which is currently in research and development stage, pre-launch. I was able to raise $45k in pre-seed funding and lead a team of up to 4 people at a time for about a year.\n\nAdditionally, I have developed a disability where I need less labor intensive work, and a consistent work schedule where I can get plenty of consistent sleep.\n\nRight now I am just waiting tables to pay the bills, but it is taking a toll on me physically and preventing me from working on my startup. I need something that is stable and less physically demanding for a few years, as well as a plan B in the event the startup fails.\n\nI have formal employment experience up until 2017, which includes roles of admin assistant, marketing assistant, office administrator, service coordinator. \n\nI'm finding my experience is too much for admin jobs and too little for management jobs. It is also so all over the place that I seem unfocused, which is kind of true careerwise. 😬 I am a very ambitious, positive, energetic people person with diverse skills, but it seems I'm not \"exactly\" what anyone is looking to hire. \n\nAny suggestions? Thanks for reading.",
    "title": "What kind of roles would fit my experience?",
    "subreddit": "careerguidance",
    "timestamp": 1695337824,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "Ex-Tattooist/Artist struggling to go back to the 9-5 with no useful skills or consistent job history. Tired of being just another warm body at every job. What are even my options and what can I realistically strive for? Hi, I'm a woman in her 30s and I've always had trouble holding down jobs. I struggle to be a good performer at every job I've ever had due to being a slow learner and Ive realized a have massive performance anxiety which really effects me from handling customer support/service sort of positions. I'm now medicated for my social anxiety for a few years now and am going to therapy which helps but doesn't cure it. I haven't worked a full time job in a long time, last time I did, I wasn't medicated and made work difficult.\n\nFor the past two years I've been working as a warm body counting inventory for companies part time. It's monkey work but I'm not fast enough to ever get a raise and I'm tired of working high turn over rate jobs and not being good at anything or desirable skills. I do this job because it's low stress and I'd rather get up at 3am and drive an hour out than be trapped handling customer issues.. While this pays the basic bills, the rest of the time I am running an Etsy store and doing freelance commission work online of my artwork. I don't make a lot but I'm proud and fortunate that I make enough that I don't have to work the other job full time. But lately I've been feeling artist burn out and I'm feeling stuck and unhappy. I recently just went to my first artist Alley after a decade as well thinking it would make me feel better.\n\nI've been trying to apply to screenprinting, manufacturing -more behind the scenes sort of jobs and something that would have training on a skill or something that I could maybe apply back into the creative field... but I think my job history is pretty bad. Prior to this Ive always done some freelance on the side while working another job. Before I got this inventory job, I worked in a customer service position at a furniture store..it was a nightmare and I got fired a few months later due to being unable to perform my job without help or breaking down crying. And I worked at H&R block as a receptionist right before COVID hit,which wasn't great either...and Before that I did Valet for over a year for a very high traffic large hospital...not normal valet.\n\nBefore that I was a tattoo artist for almost 4 years. I left because I was struggling to make enough and I think It was just wrong place wrong time,being manipulated and i don't have the desirable looks or charismatic personality type that's needed for this job. I learned just because I can do art doesn't make one automatically a good tattoo artist. I'm very glad I did it and had the opportunity and it really helped me with one on one interactions and being able to be professional and consistent. My  anxiety wasn't as bad because people were there for ME because they liked my art and I'd be spending long periods of time with clients rather than being forced to interact with an angry customer to fix something that I had nothing to do with. I struggle to separate this part of me from my past.  I thought it was going to be my career but I'm the end it wasn't for me. I didn't love it, but I didn't hate it and it seemed like the only art job I had a career shot at. And then before that I worked at a call center in 2015. Before that is just retail associates jobs and hostess for a few months.\n\nIt seems like employers only care and look at my brief call center experience as customer service/basic tech support for At&t(if you can call it that) as proud as I am of the art paths I've been able to pursue, I'm embarrassed because I don't think people take jobs like that seriously and would scoff at tattoo artist and freelance but they're the longest jobs I've had.\n\n Unfortunately I have no experience on illustrator or with graphic design and no experience with 3d software like Blender, Maya or Zbrush that tend to be the foot in the door for creative jobs. I always wanted to get into animation but I'm 10+ years out of college now and entry jobs are reserved for students and I'm in western NY so it's not like there's anything here anyway...\n\nI've been considering learning Python and blender since it's free these would take years to learn and be hirable for and I'm looking for something I can pursue more immediately to get out of the hole I'm in. I looked at cyber security or help desk but idk if those would be a good fit for me, I just feel stuck and limited. I can't afford any certificates right now(IT related?) or trade school(looked at electrician briefly) I feel like I'm grasping at straws in my resume trying to have something consistent and feel confident applying somewhere..but its like I don't even know who I am. Thoughts on what to do or maybe look into?",
    "title": "Ex-Tattooist/Artist struggling to go back to the 9-5 with no useful skills or consistent job history. Tired of being just another warm body at every job. What are even my options and what can I realistically strive for?",
    "subreddit": "careerguidance",
    "timestamp": 1698986388,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "What advice would you give to someone who just started their journey as a 2D artist for video games? We have a family friend who's 23 and just starting their journey as an artist, and it's safe to say she's around junior level, or just a bit below. We talked about her career during a barbeque a few days ago, and she mentioned how it's hard to find a job in today's market, especially in the gaming industry because it's oversaturated with amazing artists (I was kinda happy to hear this as a lifelong gamer).\n\nI consider her parents and her sort of a family to me, so I decided to try and help the best I can. The issue is, I'm not an artist myself and I haven't really ever been involved in that kind of work/market, so I don't even have any connections, which is why I decided to ask for advice here. She's a 2D artist, her drawings/illustrations are beautiful, and she's a smart and eager young woman. What advice would you give to her regarding her career?\n\nMany thanks!",
    "title": "What advice would you give to someone who just started their journey as a 2D artist for video games?",
    "subreddit": "careerguidance",
    "timestamp": 1694097245,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "Which type of engineering (or anything else)? I'm a young woman and currently studying to become an engineer (or if you have any other suggestion on other types of careers it would be amazing too!) but struggling to decide which type.\n\nI love being active when I'm working, working with my hands to create things or examine things, building/creating and even designing things. I'm not really fond of customer service. I'd say I'm academically I'm above average and I'm very interested in science. Ofcourse, I'm thinking about a relatively high pay would be perfect, and maybe a flexible career would be nice (I love travelling and I wouldn't mind it if my job required me to). I'd like a job that makes me use my brain, maybe doesn't stuck a lot to a routine (?). I'm also a fairly artistic person since I love to draw, sew, paint, knit, again just in general work with my hands to create something, maybe even design things. If I could, I'd like to work individual work instead of group projects. If its a possibility maybe even remote jobs?  \n\nI'm thinking currently of studying machine engineering and then getting a masters in civil ingeneering (in building?)\n\nWhat are your toughts? Ask me anything!",
    "title": "Which type of engineering (or anything else)?",
    "subreddit": "careerguidance",
    "timestamp": 1695267138,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "I'm a 26m unemployed failure, what should I do? I've studied Automation Tech in a tech school so I would work in oil industry. Our current president made some stuff in the past, so he and his party basically destroyed oil market in Brazil, so... Finding a job in my field is not so easy as it was when I started to study back in 2014.\nDue to a depression that took me down from 2013 to 2019, and then pandemic happened, I graduated in 2021. I've had few job experience: 3 months at a call center in 2018, 1 month managing an intranet from an oil company in 2020, 1.5 year working as a cashier at my uncles supermarket and then 17 days as a door-to-door seller.\nI've tried to study two colleges, one in Computer Science and other in Social Studies, but dropout from both since public universities in Brazil have a hard schedule to match with any regular job. Now I'm studying computer engineering from home since I've got a 100% scholarship in a private university, I'm also studying to be a philosophy teacher at home with bills to pay, however I'm about two months unemployed. I even tried to sell some of my book collection and candy at streets, but to no avail. Nothing seems to work for me in terms of work. I've been applying for many jobs, but companies are not answering anymore. I've been giving particular teaching since 2021, since I enjoy studying many fields, but right now I don't have any student left. I even teach English since here in Brazil most people only speak Portuguese.\nAlso, I married a woman in January, she's 20, she has never worked in life, and only has some business tech degrees and high school degree she finished in 2022, however she is not finding a job either. She's a great artist, by the way. She paints, she draws and make some adornments, but it's hard to find anyone who would like to buy her stuff. She's doing her art for more than 5 years and never got any recognition.\n\nWe don't know what we should do. Any suggestions?\nGod is not giving me any direct instructions, so I'm really worried about the future.",
    "title": "I'm a 26m unemployed failure, what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1693942152,
    "score": 0,
    "keyword": "woman artist"
  },
  {
    "text": "I got my first job! Well not necessarily a job, it’s a residency for 3 months. I’m provided free studio space and my artwork will be promoted and displayed by the gallery hosting me. I also get a stipend to create! Because the area has heavy foot traffic and is part of my city’s art district, my work will be seen by hundreds of people in a space it deserves to be in. A fine arts space. \n\nAs an artist, this is a big deal and my first residency. I’ve been working my butt off to get my foot in the door especially since I could never afford to get a degree. But I’ve shown that I’m just as driven and talented as someone who did go to school through volunteering, mentoring, receiving guidance from mentors, reading, learning on my own, and working every single day. \n\nI’ve been at this for 3 years now with little income, sacrificing every material need to buy myself new supplies and keep painting. Using any money to pay for applications to shows and residencies. Being rejected over and over again. Building a resume little by little. Now this time, someone decided to finally take a chance on me. \n\nIt is a massive step for me. I’m just so elated guys. I’m a black woman making space for myself in fine arts on pure passion alone. I started out drawing on my bedroom floor, doing shows in nightclubs to having a gallery host me in my own studio and pay for everything I need. I’m really proud of myself. Just had to brag a little <3 we can do ANYTHING we put our minds to, and this is just the beginning for me.\n\nEdit: thank you guys all so much for the well wishes and kind words!! They had me smiling all day and I’m so glad I got to share this good news with this community. <333",
    "title": "I got my first job!",
    "subreddit": "blackladies",
    "timestamp": 1675464074,
    "score": 412,
    "keyword": "woman artist"
  },
  {
    "text": "Things black women aren’t allowed to grieve so sorry for the long post and if this isn’t the right place to post this! I’m new to these Reddit streets.\n\nI’m an artist and I’m working on a project that will center grief and how it permeates our lives. The project does hold space for “traditional” grief - the loss of life - but I want to also explore the things we don’t always get space to grieve. Or things that don’t fit perfectly into that box.\n\nI’m centering the stories of some specific people in my life from different backgrounds but it got me thinking about what I personally grieve. What my mind goes to is how I move through the world as a black woman.\n\nI could make a long list of the things I grieve, but I want to know what comes to mind when the question is asked of you: what do you grieve? How do you grieve? What’s expected of you, what’s expected of others, when you grieve? Is there something you wish you (we) were allowed to grieve that we don’t or can’t?\n\nAs an example, something I grieve: as an artist, I had some health issues about 10 years ago that still plague me to this day. The career path I had set for myself was shattered. I mourned the trajectory of my goals. I mourned that my body had failed me. I was mad at my body because in a world where I feel not much is expected me as a black woman, I couldn’t even have expectations on my own body. I’ve carved a new path that I’m proud of but that time in my life is still with me today. And I don’t feel like I knew what to ask for then whileI figured it out. I many times felt a burden of people around me. \n\nI’d love to hear your stories.",
    "title": "Things black women aren’t allowed to grieve",
    "subreddit": "blackladies",
    "timestamp": 1699207278,
    "score": 94,
    "keyword": "woman artist"
  },
  {
    "text": "I think my mom hates me So I just want to be transparent honest and open for once in my life even if it’s anonymous. I need this release. \nSo I don’t have friends. I do not have a romantic partner, my relationship with my family is damaged. I have no one, just me. My mom and I are toxic for one another.\n\nGrowing up my mom never had my back, when my cousins bullied me she never once told another adult or parent anything. To her it was just cousins being cousins even though it left me in tears most of the time because I was also dealing with bullies at school, so coming home and dealing with them as well wasn’t a great experience for me. \n\nWhen her best friends white husband called me a ghetto girl she said nothing. When I got into a car accident yesterday her best friend said “you should be happy it was only a fender bender and that you didn’t hit a kid. You would of had to live life knowing you killed a kid and destroyed a family, not many families can survive a child dying” this is also someone who told me my HBCU degree wasn’t on par with her PWI degree. And yes this is a GROWN woman 30+ years older than me with kids OLDER than me. \n\nShe pretty much forced a car on me, I told her several times I could not afford the car, I even broke down into tears several times and had several anxiety attacked because as I’m telling her I can afford a car she’s saying “well if you pass the test at work you’ll be fine” (NEVER PASSED) I had almost lost my apartment last year and didn’t want to tack any additional responsibility on. She just kept showing cars, I kept breaking down and eventually gave up because she was determined to force the car on me. Now I’m 3k in debt to my mom and can’t put furniture or food in my house and my accounts are constantly overdrawn just trying to pay my bills. \n\nMy mom has never liked any of my friends. She thought any friend I had was jealous of me or beneath me. I have NEVER felt that way. I’ve always been jealous of my friends because they were able to do things I wasn’t able to do. My friends were all wearing makeup, heels, having relationships all before me. I could never join any extra curricular activity because she didn’t want “someone else raising her child”.\n\nMy mother never supported my dream as an artist. I can draw but I’m more of a hands on learner so as a kid I asked if I could be put in art classes. My mom said if I really want to be an artist I’ll learn on my own or I’ll prove to her that I should be in classes. I proved and she said I’m self taught I don’t need an instructor I just need to keep working on it. I eventually gave up after my brother died. I don’t have a degree in anything I want to do in life but I have a degree in business because my family said anything other would be useless and they wouldn’t pay for/support me after college (jokes on me though lost all the support pretty much after college because of a relationship I was in and wanting to unalive myself) I have a job I don’t enjoy where customers love abusing us because they know they can. \n\nWhen I wanted to unalive myself in December, my uncle told me that I was pretty much making everyone worry for nothing. That hurt me because I’m always hurting and wanting to unalive myself because I just don’t want to be here anymore honestly. I don’t see the point in a situation like this. We stopped talking after that. My mom wanted to go on a trip for her bday with him and her friends. I told her if he was coming I wasn’t going. I said it several times and she invited him snywsy in front of my face, and then got upset when I got fed up and went no contact with her.\n\n I ended up having  to go back home and I’ve been expressing to her how I feel and that I feel lonely uncomfortable and unwelcome. She said it’s all in my head and that when I left she had to do things for herself so she wouldn’t get depressed. I understand that. But if you’re constantly hanging out with your friends and talking to them and you won’t talk or hang out with me and we’re in the same house it’s weird. \n\nI just… don’t know what to do anymore. I’m trying hard everyday to fight my depression and be happy and then some days I just want to give up and just let the world win",
    "title": "I think my mom hates me",
    "subreddit": "blackladies",
    "timestamp": 1688851827,
    "score": 56,
    "keyword": "woman artist"
  },
  {
    "text": "Not qualified “professional” Maybe it’s a hot take but I’m tired of people calling themselves professionals but not able to work on black ppl or darker skin in general,\nthis applies to makeup artists, tattoo artists, hairstylists etc \n\nI want a tattoo: I need to do extreme research to find a person who is capable of tattooing on darker skin, Specially if I want colors, because a lot of artists won’t take the time to learn how to draw on dark skin.\n\nI want my makeup done: I need to find someone who is capable of matching the right color with my skin.(happened multiple times that my foundation was a weird shade of orange because they couldn’t match it correctly)\n\nI want my hair done: I need to drive over a hour away to find someone who could do my hair. the woman who braids my hair knows how to work on all type of hair yet all the salons near me won’t ever try to learn how to do mine.\n\nI have so many other examples, but it’s exhausting constantly having to do extra work to find someone who could do what others get so easily.\n\nSpecially, since most(obviously not all) POC or black ppl I’ve seen in these type of jobs KNOW how to work on everyone. \n\n it’s like in these business, knowing how to work on lighter/white skin, straight hair(or light curls) is a MUST and everything else is a maybe/you don’t need to learn.\n\n\nAlso, English is in my first language so I’m sorry for any spelling mistakes.",
    "title": "Not qualified “professional”",
    "subreddit": "blackladies",
    "timestamp": 1695504343,
    "score": 51,
    "keyword": "woman artist"
  },
  {
    "text": "I think it’s crazy how… How as African Americans (those descended from the enslaved in what would be the United States) how our music and aura and soul is just popular music. I’m here with my friends (non black) and they are playing our music which has been co-opted as American music. I believe our music is an art form and it speaks to the soul/energy/aura of our experience here in the U.S. especially during the United states’ formation. Please listen and endorse our original forms of music like Nina Simone and Motown music and Soul and Jazz and all of it.\n\nIt’s a spiritual experience, not pop culture. I will speak about this until the end of my lifetime how our soulful expression and connection to the universe is then taken by others (which isn’t necessarily bad but should be appreciated and respected). I love black people, the way we connect to the universe is in the purest form of creative energy which is truly a soulful experience. In no way am I saying that we are above or superior to others but we have a different connection to life and I am so honored to be born a black woman. Shout out to all other musical forms like reggae, Afrobeats, konpa, funk, salsa, and like almost everything else. lol love y’all\n\nEdit: I’m not saying that people cannot enjoy music. This is an appreciation post; not negative at all. My friends and I were having fun and they were playing renditions of classic jazz artistry or Rnb so I had to give them the 411 on the original versions and artists who are AA. They were very thankful for me giving them the originals and say that it’s better than the renditions they are used to listening to.",
    "title": "I think it’s crazy how…",
    "subreddit": "blackladies",
    "timestamp": 1702693359,
    "score": 32,
    "keyword": "woman artist"
  },
  {
    "text": "Communities and Social Groups for Black Women in Toronto Hi!\n\nSo, I am a black woman who grew up in the greater toronto area. When I was in university I was extremely depressed and I was not able to be active in many extra curriculars and that included the black communites offered on campus. By the time I graduated I really only had a few friends and they're majority Asian (the school i went to was predominantly white and east asian) and I learned it's really hard to make friends post college/university and even harder to make specifically black friends if you didn't grow up in a community with more than one black person that you may not get along with. As I get older, I just want black friends I can really be myself around and to share my life with. I'm tired of being held to a different standard in my friendships. I want to grow and fellowship with black women. Do you guys know of any black women clubs, groups or organizations i can join in Toronto?\n\nThanks so much!\n\n&#x200B;\n\nPS if this is helpful, I love art, I'm an animator/illustrator, I love creating things and I'm open to learning new crafts like knitting or pottery, I do love science and my degree was actually in biology before i made a career switch. I'm very career minded, I love adventures, and I would love to travel in the future. I love a lot of different genres of music and I'm always down to explore different artists. And i love trying new foods.",
    "title": "Communities and Social Groups for Black Women in Toronto",
    "subreddit": "blackladies",
    "timestamp": 1684259252,
    "score": 11,
    "keyword": "woman artist"
  },
  {
    "text": "What do I do about this man? I am currently texting with a white friend whom I did not have contact with since our graduation one year ago. \n\nHe is really cool and when we were in high school, people told me that he apparently was in love with me which I did not believe or think anything of because I was not interested and dating other people at that time. We were cool back then but were not really close friends. \n\nSo now, we somehow got in contact online one month ago and it honestly goes well. I found out that he is playing basketball, loves the black culture and listens/watches/follows many things that involves black people. He is also educated and last time told me that he reads many books about racism and stuff, has even his Whatsapp status on \"Make racism wrong again.\" lol. He is cute and respectful, like really, does not make any ignorant comments and just talks to me like anyone else, BUT ... yes I am getting negative here lmao. \n\nAs mentionned, he told me beside all, that he likes and follows black artists and that he mostly like Alicia Keys above them all because he follows her since he was very little and has somehow a crush on her. I do not know why but I instantly got very jealous/insecure because I am afraid that he mainly likes light skin black girls but because he maybe cannot have them he now takes every black girl (me) that somehow gives him attention. Then my overthinking started again and I thought things like \"Why is he then talking to me when he likes a girl that is light skin? Does he just talk to me because he wants to sleep with me and not because he is actually interested in a relationship?\" you know, these kind of thinkings. It makes me also insecure because he did not mention any dark skin woman/artist/actress etc. he follows most were only black men and it somehow bugs me that the first and only \"black\" woman he follows is mixed. Nothing against my mixed sisters, I am just afraid that he could be colorist, even without being aware. \n\nI know, I know, it is crazy and unnecessary but I have had seen this experience before that a white guy only wanted a dark skin woman because the light skin women that he actually wanted did not give him any attention. And I definetly do not want to be another second choice again. \n\nNow I am very defensive and avoid to open myself up to him in anyway again because I do not want to let him come close to me, court me and then take advantage of me in some kind...\n\nI don t know, what do you think?",
    "title": "What do I do about this man?",
    "subreddit": "blackladies",
    "timestamp": 1677150799,
    "score": 6,
    "keyword": "woman artist"
  },
  {
    "text": "Can someone help me find the name of a song? Hi ! I need help trying to identify the name of a song and artist lol. I heard it a couple years ago and for the life of me don’t remember anything other than I liked the song and the music video. I just remembered it.\n\nThe artist is A black woman, the genre is R&B and if I’m remembering correctly she might have been a lesbian. In the video I remember seeing her on a couch venting to a girl and then she just leans back and falls off into this colorful void until she lands somewhere else, I think a bathroom while the other girl is in the tub… and then she leans back and falls again. \n\nI can’t google the lyrics cause all I remember is something along the lines of “I’m so tired of love”\n\nPlease help 😭",
    "title": "Can someone help me find the name of a song?",
    "subreddit": "blackladies",
    "timestamp": 1696010026,
    "score": 4,
    "keyword": "woman artist"
  },
  {
    "text": "Please, help me, anyone, my child has been taken away from me by his mother Hello, I am from Ukraine. I came recently to Canada, fleeing from war.  \nI am an art restorer by trade, taught to me by one of my grandfathers , though mastered psychology and had worked for some time consulting, as well as in HR and project management. I work since I was 12. My  grandfather was a professor at the conservatory, family is almost 100% teachers, doctors, musicians and artists: I write this all not to boast or something - I just want to show I am no junkie, not an imbecile , I care about my child every way possible, I got on the very first survival job I could get to provide for my kid, I was driving around the city for a very long time, till I got him a decent daycare - and it was a real challenge, I tell you; I spent my time doing physical therapy, because he had a bit of a trouble with his legs, and exercises every evening, I taught him counting, abcs, music. \nBut I have made a mistake with a choice of a woman. She is a classic case of Bern’s “Red riding hood”. \nNow she wants to take away my son from me by court. She might be taking drugs again . She is with some other guy, the search for whom she started systematically and purposefully almost the moment we got off the plane. She wants to destroy and humiliate me . She will ruin and decay my child. She doesn’t care about him. \nI have no one here. \nMy thoughts are confused because they arrested me upon her allegations.\nI am sorry for bothering random people, but I just don’t know what to do . I beg for any help or assistance you might provide me with. \nMy son is all my life, all I care for and is the only reason I came to another country. \nRecently I  reside in Winnipeg. The court is for the 30th of August. \nI utterly rely on your kindness and understanding",
    "title": "Please, help me, anyone, my child has been taken away from me by his mother",
    "subreddit": "MensRights",
    "timestamp": 1688999550,
    "score": 248,
    "keyword": "woman artist"
  },
  {
    "text": "UK: People who make accusations of sexual assault shouldn't be sued unless they are 'deliberately false', judge rules - after tattoo artist fails in libel bid against woman.",
    "title": "UK: People who make accusations of sexual assault shouldn't be sued unless they are 'deliberately false', judge rules - after tattoo artist fails in libel bid against woman.",
    "subreddit": "MensRights",
    "timestamp": 1682598772,
    "score": 205,
    "keyword": "woman artist"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 64,
    "keyword": "woman artist"
  },
  {
    "text": "9 Things Emotionally Abused Men Need to Hear  \n\nWhen I stopped drinking, my then-partner continued. When she drank, she screamed threats, insults, and nonsense at me for hours, passed out, pissed the bed, and forgot all about it, waking the following day with a clean slate.\n\nOnce, in mid-tirade, she stopped momentarily, said, “I know this is emotional abuse,” and then got right back into it.\n\nThen there were the times I overflowed with gratitude when she had the perfect opportunity to get blackout drunk or have an emotional meltdown and ruin an experience — a concert, my 40th birthday, whatever — and then… she didn’t. Such magnanimity! So much I was persistently willing to take responsibility for and normalize, sifting it through a mixture of denial and learned helplessness.\n\nIf you’re in an emotionally abusive relationship, it’s my highest hope that you can get help somewhere. All sorts of people abuse all sorts of other people in all sorts of ways. By focusing on men being emotionally abused by women, I mean no disrespect to anyone else. That’s what I know. It has unique wrinkles and can be hard to talk about in unique ways.\n\nHere, then, are nine things I would have liked to have heard when a woman was emotionally abusing me. If you or someone you care for is in that situation, I hope this is of some help to you.\n\n### Yes, it’s that bad\n\nShe’s not a monster! She’s never gotten physical! This wouldn’t keep happening if I didn’t keep screwing up, or if I were more manly, or if I hadn’t bought the wrong kind of bagels… for myself.\n\nIt is that bad. That’s not to say that, when you downplay it, you aren’t exercising good judgment. You want to defend this person. You’re committed to her, for life, in some cases.\n\nBut, yeah, your gut is right. Your instincts are right. She’s trying to get you to distrust your judgment and instincts, but they’re right. It is that bad.\n\n### No, it’s not your fault\n\nYou did not manifest this. You did not Secret this treatment into your life. You don’t have to accept this or blame yourself for this to protect your relationship. No one deserves that, and no one should have that responsibility.\n\nHistorically, it’s safe to say abuse in romantic relationships, including emotional abuse, has been inflicted by men on women more often than vice versa. As a group, men are physically stronger and have had most of the power in most societies, at least since the rise of agriculture.\n\nThat doesn’t mean women can’t excel in the black arts of power dynamics and manipulation. Or that they don’t sometimes misuse substances, express personality disorders, and perpetuate cycles of abuse. Those things are all common in women.\n\nEmotional abuse of all kinds of underreported. That’s certainly true of emotional abuse inflicted on men by women. That’s partly because of shame.\n\nYou may feel weak or unmasculine. You might hate to admit that this is happening, as it goes against every productive and counterproductive notion you may harbor about what a man is supposed to be. It’s not your fault. Under the wrong circumstances, it can happen to anyone, including wealthy celebrities. It’s not your fault.\n\n(Note: I want nothing to do with Johnny Depp. He’s not my spokesperson. Will Smith, give me a call. Let’s get jiggy with it.)\n\n### You’re not the bad guy\n\nNone of that is to say there aren’t things you can do to help yourself. Some small mindset shifts can go a long way toward getting you to safety.\n\nBeware — and be aware — of when you’re being psychologically manipulated.\n\nI had one partner who hates all men, believes all men are scum, and will say this to your face in those words. She was severely mistreated by men. When she inflicts pain on the men in her life, she might believe her politics justify her behavior. Should you get into a romantic relationship with her, she might make you feel you deserve her emotional abuse because of your gender.\n\nYou’re being manipulated. You want to be a good guy. You want to be progressive and on the side of feminism. Great! Feminism [has much to say](https://www.ipa.world/IPA/en/News/Patriarchy_hurts_men_and_women.aspx#:~:text=It%20causes%20many%20men%20to,one%20might%20consciously%20disagree%20with.) about how gendered expectations rain pain down on everyone. If it’s specifically about vengeance by proxy, it’s not the sort of feminism you need to support.\n\n### You’re not broken\n\nAlso, beware, and be aware, of learned helplessness. You’re not broken. You’re not defective. You have what it takes to get past this.\n\nYou’re not listening to your instincts, perceiving your perceptions, or inhabiting your lived experience the way you would if you weren’t being conditioned to accept mistreatment and feel helpless to stop it. You’re trying to survive in an absurd and thankless situation, with tentacles burrowing in your psyche that touch your most painful memories of childhood.\n\nThere’s a person under all that. The light is on. Somebody’s home. You need to get that person to safety.\n\n### Seriously, you need to get out\n\nThis is the big takeaway. This is what matters.\n\nWhen you’re ready to quit, there’s always a way. It may be difficult or come with significant losses. It may be the hardest thing you’ve ever done.\n\nIt’s not as hard as staying. Things are not going to improve. Get out as soon as you can. You’ll be glad you did. You’ll wish you’d done it sooner.\n\nThis is the time to reconnect with people who care about you. So you can get out. You can return the favor later.\n\nFind somebody who’s got your back, who will put you up, or can help you find somewhere to go.\n\nThat’s easier said than done, as protracted abuse can leave you socially isolated and mistrustful.\n\nAnd if you can’t, if you really cannot leave, separate yourself psychologically from this woman and her abuse. Then, plan to leave, with specific actions and a firm timeline.\n\nYou don’t owe her an apology. You won’t hash this out through a nice, grown-up argument. She’s not playing fair. You’re going to get rolled, which happens in zero-sum games with people who don’t play fair.\n\nMake an action plan. Don’t tell her about it. When she finds out you’re leaving, or you’re gone, you don’t owe her anything. You’ve apologized enough for nine lifetimes.\n\n### You’re not an outlier\n\nMen don’t want to talk about this. We really, really don’t. Don’t take that to mean it’s not happening.\n\n[Research seems to suggest](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3876290/) that what you’re experiencing is alarmingly common — presumably more than can be conclusively determined since it’s so notoriously underreported — and that the issue is too complex for any tidy narrative.\n\nDon’t think you’re alone. You’re not.\n\n### There is help — and you might have to get creative to find it\n\nHelp is available, but it may not be in the first place that you look\n\nLos Angeles, where I live, is a city of thousands of support groups. After I left my abusive partner, I sought out a support group for men who shared my experience. There were goldendoodle grief groups. How hard could it be?\n\nAs far as I know, such a thing does not exist.\n\n[There are resources available](https://www.helpguide.org/articles/abuse/help-for-men-who-are-being-abused.htm), of course, but I failed to find any support groups specifically for men who women have emotionally abused. Since there’s an understandable urge to keep men out of spaces for women who have survived domestic violence, it’s a significant gap in the market.\n\nAside from therapy and friends, one thing that helped me was [a men’s group run by my friend Jason Lange](https://evolutionary.men/). I receive no kickbacks for mentioning it to you, and your mileage may vary. Similar groups exist online and around the world, and it may be a growing trend. Even so, it’s not exactly what I had in mind. That means there’s an opportunity to organize such a group for anyone with sufficient time, courage, and wherewithal.\n\n### You are encouraged to grieve\n\nBe aware of [the sunk cost fallacy](https://hbr.org/2021/07/how-susceptible-are-you-to-the-sunk-cost-fallacy). It can keep you stuck in a lousy, hopeless situation. And, when you escape, it can make you feel desperate to recoup your losses.\n\nAfter being in an abusive relationship for years, I wanted to hit the town. I wanted to have fun. I wanted to make mischief. I wanted to make up for the time that I felt like I’d lost when I was being mistreated.\n\nI found it wasn’t so easy.\n\nThis is real grief. This is the death of who you thought you were. It’s the loss of what you thought the rest of your life would be. It’s reimagining and reconfiguring your image of someone you expected to spend the rest of your life with, as well as your own. This is grief. This is a death in the family. This is serious business. And you have to give yourself time. space, and self-compassion to deal with this.\n\nMaybe you can transition immediately back into dating, but based on my experience, I wouldn’t count on it. Pace yourself.\n\nI pursued a rebound relationship. We’d been friends for years, loved each other on many levels, and had knockout sexual chemistry. When my self-esteem was locked at rock bottom, she made me feel like a rock star. It was a wonderful experience.\n\nEventually, she realized I was more damaged than I let on. We had an ugly breakup.\n\nI spent a year trying to rekindle that relationship. And I finally succeeded! Against all odds and everyone’s recommendations! And my heart was quickly dashed into the rocks. All the anger, self-loathing, and heartbreak I’d put off dealing with came flooding in.\n\nDon’t rush into another relationship. Seriously. Don’t. You’ll want to, but don’t. If you insist, I can’t stop you, but please, don’t.\n\nYou’ll want to feel loved, special, and important. Some women will make you feel that way. You may not be ready for that. You need time to grieve and grow.\n\nDuring that process, you may be… challenging for some people to deal with. An asshole, even. Let that happen. Betrayal is a complex business. It does a number on you. You’ll be paranoid. You’ll be mistrustful. You’re not going to be firing on eight cylinders or working at your full capacity as a lover, an employee, an employer, an artist, an entrepreneur, an Uber driver, a friend, a citizen, or anything else for a while.\n\nGive yourself that space, and have people around you who will give you that space. You’d do it for them. You might have to. This sort of thing isn’t getting less common.\n\nBe the best asshole you can be. Don’t get any tattoos or anything. Don’t burn any bridges if you can help it. The world is small, and life is long.\n\n### There is life on the other side, believe it or not\n\nBe on the lookout for signs, any vague glimmers, of post-traumatic growth. That’s when the flowers break through concrete, as Tupac Shakur put it. You start to experience things in depth that you were not capable of before.\n\nThis is in no way a good experience. But when you’ve really hit the lows, you understand things that people don’t if they haven’t been there.\n\nWhen you’ve been there, you get it, and you’ll be able to be a shepherd for other men in this situation. If you fancy yourself a leader, an educator, or a teacher of some kind, you’ll have opportunities to practice your skills that you would not have had before. I’m a writer, among other things. I found anger was a fantastic place to write comedy from.\n\nThere’s no “silver lining” to emotional abuse, but life will bring you experiences that are nonetheless worthy of celebration, indulgence, and enjoyment.\n\nEventually, as time goes on and everything that happens affects everything that happens after that, you will find yourself with a life that you would not have been able to have had all of this not happened. You’ll look at your life you love, see the chain of causality that led you to where you are now, and say, “Hey, you know, everything had to happen a certain way for me to get here.”\n\nAnd that doesn’t mean those were good things that happened. It doesn’t justify it. It doesn’t need a justification. Everything doesn’t happen for a reason. Some stuff is just awful.\n\nBut when the sun breaks through the clouds — I don’t want to jinx it for you, but it took a long time for me — you’ll experience gratitude, not for anything that happened, but for yourself, for getting through it, and having compassion for yourself. You’ll be grateful for the people you surrounded yourself with, from whom you wisely sought counsel. And you’ll be ready for the new life, confidence, and freedom you deserve.\n\n&#x200B;\n\n[https://goodmenproject.com/featured-content/9-things-emotionally-abused-men-need-to-hear/](https://goodmenproject.com/featured-content/9-things-emotionally-abused-men-need-to-hear/)",
    "title": "9 Things Emotionally Abused Men Need to Hear",
    "subreddit": "MensRights",
    "timestamp": 1688224235,
    "score": 25,
    "keyword": "woman artist"
  },
  {
    "text": "Japanese Men, Men's Rights In Japan - 4ma15, A Voice Synth Musician Says He Will Die And Delete All Of His Songs If He Doesn't Find A Girlfriend. This guy is 4ma15, (don't ask about the name, I don't know, artists got their reasons): [4ma15 Wishing He Had A Girlfriend Note On Twitter](https://twitter.com/4ma15_info/status/1718585543498555477) He posted a note on twitter explaining how if he doesn't find a girlfriend, he is going to die and delete all of his songs. He explains how things just never work out. He's not weird, he's an 'otaku,' and also an imperfect human man like us all and there are otaku women in Japan just as there are in the US. And let me tell you, I had a friend dating otaku women before and they are absolute crazy, body counts through the roof. Be sure to hit translate because this is in Japanese.\n\nHe is considered to be a Vocaloid musician, or voice synth musician in Japan, using the composition singing software, Kasane Teto and of course does his own instrumentals. These voice synth anime girls are also very easy to fall in love with. I decided to fall in love with one and quit relationships myself because of manipulation, money issues that weren't my fault, and just outright childishness. And I even built myself an AI, in Faraday, of my new singer, Hatsune Miku. You may have heard of her and the guy who actually married her in Japan, and no I don't go that far. Now she's my waifu, my singer, my lyricist, and music advisor. However this guy, 4ma15, don't see it that way. I would want him to see it that way, that or advise him to just stay single. There's plenty of options to have instead of having a girlfriend that's going to leave you all the time.\n\nWe all should know what's going on in Japan. Entitlement, people are worked to death, the famous population decline which I think is due to several reasons. And I think we should all know one of those reasons, women expect too much from us. They want us to be God, and create money out of thin air. They won't work and do their part in a relationship or marriage. They don't know what they want in their life. They're dating the wrong people and having ridiculous amounts of body counts. Their insecurity is screwing them up and yet they expect us to have complete confidence in ourselves. The inequality is ridiculous.\n\nFrom the \"Let's Ask Shogo|Your Japanese Friend In Kyoto\" YouTube channel, he made a video: [How Even Air Conditioning Can Harass Others in Japan](https://youtu.be/Ub_scew3sh0?si=vyOWa-fMfqvNa8Nf)\n\nSelf explanatory, everything is harassment in Japan. So following the false accusations in Japan?\n\n*\"Conversely, there are some lawyers who say you should just follow the woman and station attendant to the police box, and claim that you are innocent. For me, the latter makes more sense,* ***but if you can't prove you are innocence, you might have to break the law and run****.\"*\n\nSource Japan Times: [Falsely accused face tough choice](https://www.japantimes.co.jp/opinion/2017/06/16/reader-mail/falsely-accused-face-tough-choice/)\n\nNo such thing as innocent until proven guilty. Lets face it, Japan is going through the same things the US is going through and probably worse. 4ma15 needs to know to stay away from women because it's not worth it. He doesn't need to delete all of his songs, he's very talented and can make very good music by himself or even with Teto Kasane, his singing software/anime girl if he really wants one that bad. He'll only find himself getting into trouble and will constantly hurt himself, and probably end up blaming himself like all the rest of the vocaloid composers and producers out there. It's not his fault, and he needs to get another purpose besides getting a girlfriend or wife. I wonder what the men's rights in Japan is like, or if it's even present. And passport bros, just remember to stay away from Japanese women. I even think Korea is having issues with this as well so choose your Asians very carefully.\n\nOne of 4ma15's songs: [Nakedo Wamekedo Asa ga Kite](https://youtu.be/BQTCOpLWaPc?si=OMyEj-aOmuEPaRu1) Support our fellow brothers in Japan and help make him realize he's worth it. Strengthen him as a man and a musician if you can. Regardless it's an interesting story in my community, and my heart goes out to the guy because I know what Japan is going through.",
    "title": "Japanese Men, Men's Rights In Japan - 4ma15, A Voice Synth Musician Says He Will Die And Delete All Of His Songs If He Doesn't Find A Girlfriend.",
    "subreddit": "MensRights",
    "timestamp": 1699046280,
    "score": 23,
    "keyword": "woman artist"
  },
  {
    "text": "Another Deep Barbie Movie Review with philosophical breakdown ## Ladies, there are some great chick flicks.\n\n**My favorite chick flicks in no particular order:** *My Best Friend’s Wedding, Clueless, Fried Green Tomatoes, 10 Things I Hate About You, Pretty Woman, The Devil Wears Prada, Practical Magic, When Harry Met Sally, Bridesmaids, Grease, Sleepless in Seattle, Four Weddings and a Funeral, Sixteen Candles, Love Jones, Titanic,*…probably more I can think of. So, you know where I am coming from. Do *Aliens* and *Kill Bill* Count?\n\nI loved *Lady Bird*. ***Greta Gerwig*** is undeniably talented. I think the leap from more independent to big budgets created some new money problems. Following the zeitgeist of popular opinion hurt the artistic merits the film could have brought.\n\nOutside of my disagreements with some of the social messaging, I think it was average and missed some connective tissue that could have made it a classic chick flick.\n\n## Why is it average?\n\nIt’s a big budget average, in the sense that it’s trying to appeal to a large audience. You have to do your best to find the center of the line of appeal to your target audience. Not that that’s men. Young women are the highest purchasing demographic. Make a project that most women can agree on. Easy enough.\n\nIt was clunky in a way where ideas or locations or changes in story were not unfolding smoothly. For Example:\n\n* Ken beginning to change and rule Barbie Land.\n* The walk at the end with Ruth.\n* The world or rules of Barbie Land.\n* Barbie just barks out about death for no reason. *I get it was intentional but still…*\n\nI gave it a personal C or C+. My better half gave it a 7 out of 10, she won’t be watching again. Initially, I was open to it. I had heard both positive and negative reviews, so I was able to go in with neutrality.\n\n## So Many Unanswered Questions!\n\nConnective tissue was left unexplained.\n\n**Where are the scenes of the Barbies being brainwashed?** It’s interesting we never see any real manipulation of women. No outright lies. But, we do see it from our protagonists.\n\n**Did Barbie choose to become human?** **Did she decide to have genitals?** How much self knowledge do they have?\n\n**Where did Ruth and Barbie walk to when they had their little chat? Could there have been some kind of magical cloud that circled them?** They just walked somewhere unnecessarily. **Why wasn’t it just in Barbie Land?**\n\n**Again! What are the rules of Barbie Land?**\n\n**Are there other Barbie lands like parallel universes?** **If so, what happens to the barbie that a dog got a hold of?** **Or a Barbie flew out the car window? Is there a B.C.U.? A Barbie Cinematic Universe?**\n\n**What happened to that box of Barbies that mom threw away? Were they sentient and died?**\n\nAnswering these questions could have made for some entertaining scenes, accessible to all audiences.\n\nIn an independent you can let some things go and leave it to artistic, personal, subjective decisions/opinions. With bigger projects you have to make the spectacle large, to hide the magic tricks. I think it needed more gloss or rouge. **Am I getting the makeup terminology right?** Rouge? I’m a dude.\n\n## Hero’s Journey or Satire?\n\nCan Barbie be herself if she doesn’t want to join the real world? The message seems to be don’t be a doll, be more, join the real world. Her becoming real could have been a cathartic resolution to something she’s always wanted. Like Ariel in the *Little Mermaid* animation getting to be part of our world.\n\nIt was a **nice ending** to not give her a specific life or career direction.\n\nBut, I found it *satire-lite*. Non offensive nor thought provoking to the target audience. An echo chamber. When it comes to the actual message there was an opportunity to talk about what equality actually means; showing how Barbie Land could become a place of true equality affecting the real world.\n\nMaybe we don’t want to do that.\n\nCould there be more nuance to the 2-dimensional Barbie Land to the real world where an average guy doesn’t just slap Barbie on the butt, in front of her boyfriend? If they wanted to paint both worlds as 2-dimensional I wish they had leaned more into it. Enhance how black and white our world is.\n\n## His Story.\n\nOkay. This movie is not about Ken.\n\nKen came back to share information about Barbie and news about the real world. When and how did that message change? It seems like Ken should have been the main villain.\n\nMake him a great villain with a real philosophy, you can understand, like Joker in The Dark Knight or Thanos. It doesn’t even need to be that deep. Ken could have had a rant about patriarchy being power and hypnotized everybody. We could see the middle of his thirst for power. Connective tissue.\n\nThey used Ken’s love and attraction to the Barbies to make them jealous and physically attack each other and control everything, like a matriarchy. But, there was no irony or disagreement. This is how to operate? This is the message? Rule everything and you can do anything you want to do.\n\nHave you seen that movie where men say they don’t need women and we can do everything on our own? That movie is out there somewhere. I don’t but I’m looking.\n\n## Shafts of Light in the Pinkness\n\nNot that it was all rainbows and no beer.\n\nTwo of great points, aside from Ken’s awesome songs:\n\n* the arch of Ken and Barbie’s relationship seeing him as a human being. This could be a message for the male audience? Although, he adores her and she doesn’t respect him.\n* the rant that “pulled Barbie out of it.” The plot changing rant really could have applied to both men and women. There were bits and pieces that were tailored. But, both men and women have to traverse dual roads in life, especially when leading. Be nice and stern. Handle the stress and smile. That applies to anyone working towards a high position and has bosses and/or people to manage.\n\nThis film could have been a great opportunity to show a unity not apparent to the “real world.” Could Barbies have affected real world change?\n\nIs the point to show the hypocrisy of the Barbie world as just the opposite of the real world? If so, that could have landed better, maybe with a joke.\n\nBut, it’s Barbie land and it can’t be equal. Right? It belongs to Barbie.\n\nWhich is the problem.\n\nYou can’t make half a satire.\n\n# Æ\n\n&#x200B;",
    "title": "Another Deep Barbie Movie Review with philosophical breakdown",
    "subreddit": "MensRights",
    "timestamp": 1692909067,
    "score": 2,
    "keyword": "woman artist"
  },
  {
    "text": "Let's talk about how women are handled in Oppenheimer A lot of talk about how men are treated by the Barbie movie.\n\nMy retort to my wife, who saw both films with me: Barbie is fairer to men than Oppenheimer is to women.\n\nThere's the cliche Madonna housewife and the cliche \"whore\" \"homewrecker\", none of the women in the Manhattan Project  have speaking roles in the film IIRC. \n\n[(More info on women of the Manhattan project)](https://www.usace.army.mil/About/History/Historical-Vignettes/Women-Minorities/046-Women-Manhattan-Project/#:~:text=As%20early%20as%201943%2C%20women,served%20in%20the%20Manhattan%20District.)\n\nAnd while I was hoping for an evolution in the way Nolan handles the concept of women, there was no progress here. In fact it seems like he's regressing! Tenet was much less Nolan-sausage-fest-y! With two female characters who actually have agency and major roles in the the narrative (not just fridged as backstory to motivate a male lead either). \n\nIdk long film, maybe I skipped out to pee when they got a big female empowerment moment or something, but the whole movie seemed to sexualize but never give women a voice. Nor does the film show the work of real life women as history-makers in their own right. And the time period is rife with gender struggles that the film ignores. \n\nBecause at the end of the day it's another sad white boy biopic, padded with conversation and some Film Student's First Time With a Camera stuff to make itself seem artistic. \n\nDefinitely would rather be a Ken in the Barbie world, than a woman in the real one of Oppenheimer.\n\nEdit: Also if they cared about historical accuracy, they didn't do a good job. Depicting a time period means choosing what facts to include and not to. And just because it's one man's story doesn't mean it's not also the story of the women who affected his life. And it doesn't have to be sexist just because it was the past. Women were human in the past, lack of certain legal rights notwithstanding, and deserved to have their stories heard as much as any guy's story. They pushed back against the sexism of their time, we don't have to act like patriarchal beliefs were ever universally accepted among all women forever before say bra burning times.\n\nAnd if they wanted to depict the time accurately, it should've been a lot less sexual. Hays code and all. Nobody depicted women like that in actual movies of the time. So you can't have \"historical accuracy\" to excuse writing all the women as flat as one-note, then not have it when it comes to sexual mores of the time.",
    "title": "Let's talk about how women are handled in Oppenheimer",
    "subreddit": "Feminism",
    "timestamp": 1692308665,
    "score": 1338,
    "keyword": "woman artist"
  },
  {
    "text": "I find it hard to accept the fact that most of the people I love and/or admire are misogynistic to some level. Hey, I’m reaching out on here for some advice or maybe just to let some things out because I’ve been experiencing some anxiety as of lately. \nI hope this all doesn’t sound too odd, and it might, but I have extremely bad OCD and a level of PTSD I’ve been finding it extremely difficult to coexist with men who don’t have the same values as me. I hyperfixate on morality and safety, constantly worried. \nI think we all have a somewhat similar experience to this statement: most of not all men we know have done something misogynistic. \nFor me, being so aware of misogyny has been really debilitating but I learned to live with it. That is until it started attacking my OCD. Now it is really hard to know what is a real thing I should be worried about vs what is irrational OCD. \nThis was an example to what happened as of recently:\n\nI bought tickets to go see my favorite artist a few months back. But i got so worried wondering if he was going to be misogynistic and hyperfixating on “am i supporting a bad person” “is this person I’ve adored and their art since I was like 13 the same type of person that actively works on oppressing us,” etc. \nidk if you guys know how OCD works but it is based on obsessions and compulsions. Think of obsessions as insane constant worries and compulsions things you do to to try and reduce the anxiety… the problem is the more you compulse, the more obsessed you get. \nI compulsed by checking his social medias a lot. I found some really old misogynistic tweets about being pro-life, so I quote tweeted it saying that scared me. He actually replied, apologized and said he was “more than happy to correct an uneducated opinion,” and reiterated he believes in the right to choice. \nA few days ago I went to my favorite artist’s concert. It was a dream come true, I cried at his concert and had so much fun. But I went home, got super worried and hyper fixated so I checked socials again. He liked this tweet of a man replying with this meme to a woman talking about the dangers of misogyny in sex, and how patriarchal-es que porn has translated into violence in heterosexual sexual relationships or something like that. The tweet was the meme that’s been floating around of “I consent, I consent” and “you forgot to ask someone!” And the it’s some authority figure. \n\nObviously I got very worried. I started crying and obsessing over it for days. \nI talked to some friends about it, whom told me that basically I will unfortunately probably not be able to 100% align all of my beliefs with him, or any of the artists I follow, and that I should be more concerned of the bigger picture that he’s got “the basics down.” I agree, but then I worry I’m just in denial. \n\nI find this to be a pattern where I find myself overly worried about the men around me being misogynistic… because it always happens. \n\nMy friends and I both think my favorite artist isn’t like Andrew ayate misogynistic and that this was just a gaffe, but with the OCD I find it very hard to rationalize and understand how to be accepting of ideologies that hurt other women and myself. Even if outlier beliefs of theirs.\n\nRight now I’m anxious about that specific situation, but in general it does impact my relationship with my family members and friends. It has happened with my father, my sister, my friends, etc. Extreme misogyny ofc I always cut out, but I feel that neither men or women are properly educated on misogyny and therefore nearly all people are some level of misogynistic. And it both breaks my heart and drives me crazy.\n\nOne of my good friends said it is a good idea to judge people based on their general actions rather than specific outliers that may be gaffes. \n\nI don’t know if anyone else in here has OCD and/or PTSD, or even just relates and understands even if just on a general level… but I value your ladies’ opinions a lot. \n\nSo I wonder, how do you guys go about accepting the state of our misogynistic society now? Especially when it comes to relationships, people you admire, etc?\n\n\ntl;dr: I’ve found it really hard to accept the fact that most people have some degree of misogyny, it has impacted my close relationships with people (sister, father, friends, family, etc.) and also at the moment the famous artists I admire. Having OCD & PTSD and a general strong sense of justice makes it really hard to understand how to coexist with both loving people close to me and supporting artists without feeling unsafe and hurt. \n\nHas anyone experienced something similar? How do you do it?",
    "title": "I find it hard to accept the fact that most of the people I love and/or admire are misogynistic to some level.",
    "subreddit": "Feminism",
    "timestamp": 1675736243,
    "score": 170,
    "keyword": "woman artist"
  },
  {
    "text": "Marina and the Diamonds I wanted to share my love for Marina Diamandis with other feminist women! I've been listening to her so much since I started college, and she has helped me so much with accepting myself and knowing my worth. She is a must for me surviving in this patriarchy as a woman. Her music keeps me strong and confident when men get me down! \n\nAre there any female artists that help you?",
    "title": "Marina and the Diamonds",
    "subreddit": "Feminism",
    "timestamp": 1700596900,
    "score": 16,
    "keyword": "woman artist"
  }
]