[
  {
    "text": "I gave them a week notice I was quitting. Tomorrow is my last day and no one has responded to me. Fuck em. This is my first professional job. I work in the engineering field. I’m a tech. I told them September 4th I am moving to a different state and requested a transfer. I told them specifically December 29th I’m moving and would like an answer by December 4th. They have been stringing me along this whole time telling me I “should” get a call from the office I want to work in “sometime this week.”\n\nI’m the only woman here of a team of 30 in the electrical field and I feel like they don’t listen to me or care about me at all. It’s so annoying. I’ve had so much anxiety about whether or not I’d get a transfer, but it seems to me they keep stringing me along so I can just quit. \n\n\nI found a new job with a $8 raise and a $2,000 sign on and a work from home position. Emailed my boss a week ago my last day will be in a week. No response. Good enough for me. Peace out. Don’t really care about their reference anyways.",
    "title": "I gave them a week notice I was quitting. Tomorrow is my last day and no one has responded to me. Fuck em.",
    "subreddit": "jobs",
    "timestamp": 1640644618,
    "score": 2318,
    "keyword": "woman engineer"
  },
  {
    "text": "You are worth double. I am a woman in tech as QA and project management. After almost 4 years at my job, my work/life balance has become non-existent. I could list a lot of reasons why this job is no longer a good fit or why the culture has become so bad, but this is more important.\n\nI had a lot of supportive colleagues who knew that I was unhappy and thought I could do better. My friend and director of engineering told me repeatedly, “you are worth double.” He has already given notice at our company.\n\nAfter referrals, interviews, a lot of tears and reflection I got a call back today from a dream job that I could expect an offer. I’m on the final step and even if something manages to go wrong, I found confidence in how well I’ve handled this process. My mind is made up and I am moving forward.\n\nMy fellow women in tech have a bad thing in common and that is low confidence. We have shortchanged ourselves. I talked to my friends and therapist about this and I really want to empower anyone reading to test your limits.\n\nAside from the new role being a huge turning point in my career, I want to emphasize that my pay is going to be over double. I NEVER would have that that was possible.\n\nTo everyone else struggling at work, or shortchanging yourself, or feeling unsupported - you are worth double.",
    "title": "You are worth double.",
    "subreddit": "jobs",
    "timestamp": 1634720175,
    "score": 410,
    "keyword": "woman engineer"
  },
  {
    "text": "Got denied a position, but want to email hiring manager about other positions...Good idea? I was recently not chosen for a Lead engineer position after a technical interview.  It was a longshot so I am not really upset.  However, I know I am qualified for a mid-level, maybe Senior level position within this company.  \n\nI basically want to email the IT manager who interviewed me and say, \"Hey, I don't really care that you didn't hire me for that lead position - it was a long-shot, but I really want a mid/senior level engineer position.  Do you have any openings?\"\n\nIs this a good idea?  I'm struggling to write an email to convey this properly and afraid that they would \"blacklist\" me especially if I had to work underneath the man/woman that got hired instead of me, even though I don't care.  I really want to work at this company for better work/life balance.",
    "title": "Got denied a position, but want to email hiring manager about other positions...Good idea?",
    "subreddit": "jobs",
    "timestamp": 1628519148,
    "score": 3,
    "keyword": "woman engineer"
  },
  {
    "text": "For video interviews, do you wear a blazer with a blouse? Am I overthinking this? Help\nI’m a 25 year old woman interviewing for an engineering consulting firm. An $89 blazer couldn’t hurt my chances right",
    "title": "For video interviews, do you wear a blazer with a blouse?",
    "subreddit": "jobs",
    "timestamp": 1639098826,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Help with negotiating a salary for the first time? Hey all, looking for some help (sorry for the long post... want to be detailed!). I had an initial phone screen with HR for an administrative position at an engineering company. The woman set me up with a face-to-face interview with a panel and asked what my salary requirements were so that she can tell the hiring manager. I didn't have an answer, because I've never had that option in any other job I've had. She said that's fine and to think about it before I meet with them. How should I do this? Details below:\n\nSo I'm 26 years old and coming off a medical discharge from a police academy due to an injury. I've applied to this administrative assistant role now since I have some experience with that and enjoyed it. But my past \"experience\" is working as a admin. assistant for my mom's tutoring company where I did pretty basic stuff, nothing too complex. I don't have experience with software other than MS platforms. Obviously, I played it up some on my resume. I researched the company, and the average salary for an administrative assistant is $47K-$61k. \n\nI really just want to make enough money to live in the county where I grew up. It's on the wealthier side, so it would probably take around $55k-ish (maybe a little less). How do I go about asking for this salary given that I don't have \"real\" experience and am on the younger side? Or do I have no shot at that? Any advice, in general, as to how to go about negotiating a higher salary than the minimum would be really helpful. Especially since this conversation is going to happen before I know if I'm being offered the spot or not, so I don't want to overstep and not get the job because of it. I'm more on the quiet, reserved side, so this isn't really my wheelhouse lol.\n\nAlso, I am taking digital marking certification courses to maybe try and break into that career field later.. .should I bring that up as something that might increase my salary if I suggest I could also do some digital marketing for the company now or one day (it's a large company so they already have a marketing company)? Or would that be a turnoff, like they think I would leave the position quickly? \n\nThanks for any help!",
    "title": "Help with negotiating a salary for the first time?",
    "subreddit": "jobs",
    "timestamp": 1640182982,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Transition from Professor to Analyst advice \\*This is a long post so thanks in advance and feel free to ask me for advice as well! I advise my students all the time! And I just love reddit in general lol\n\nSo I'm 31. I did my Masters in Data Analytics and came into teaching pretty quickly after grad School and stuck with it for the last 10 years or so. I was a technical recruiter in the beginning too and was an analyst for a few months. The atmosphere was pretty bad pre Me too times. As a woman, I didn't even know it was a thing and just accepted it. It was in Wall Street, just graduated and was super nice to everyone but no one was that nice back to me besides one work friend. Programming was very new to me and they just made me feel stupid for asking reasonable questions. My boss would whistle at the team and just harass us in different ways. Sometimes I think that maybe my questions were dumb but I realized over time that it's not always like that in every work environment. My brother had a much easier time doing the same exact thing I'm doing and is doing well.\n\nI'm much better at programming now but I'm terrified of having that environment again. I also love teaching more than anything in my life. I've always been so passionate about it. I am doing pretty well moneywise but of course as an Adjunct, the contracts are temporary. Still I get a good amount each year with my universities and my husband does well. He wants me to take risks more. I've had steady jobs for the last 10 years. I also thought of doing a PhD but honestly I'm more into teaching than the research. My husband who is a PhD says a PhD doesn't always mean everything. I know PhDs who make less than me.\n\nLong story short I used to still get interviews for Analytics jobs but then it stopped for the last few years. When I got certifications they would pick up again but not always.  After a very long time I just took an interview with a good company just a few days ago. Part of me really doesn't want to take the job due to the fear or maybe because I just don't like programming in that kind of setting. I'm much better at fixing student's problems or inspiring them then having to deal with 10 data projects on my own. I actually ended up studying a little too much on certain aspects (SQL, and Statistics) and I was interviewed on things I don't know as much on (but at least I've heard of the things basically macros and more on data quality of giant datasets etc.). I always say I can pick it up and nail the interviews but I'm 50-50 on whether I'd actually be able to do it.\n\nI'm just feeling a little insecure since I was always the one teaching it but over time it gets kind of boring and it's not what's actually being done in corporate analytics (tho I learn new tools all the time for my teaching like R, Python, MySQL, Neo4j, etc).\n\nMy husband is doing very well and is always constantly trying to get into bigger and better jobs. He does having a very stable Software engineering job. So it would be ok to take the risk and go for it even if I lost my job after a few months. Most likely at least in one of the schools I'd be able to get my contract renewed if I couldn't teach during the fall semester.\n\nI'm not the biggest fan of coding (I know sounds weird coming from an analyst) but I did this for my education and my husband is encouraging me. Should I try it one more time or should I stick to doing what I love (albeit it gets boring at times teaching Stat all the time. I always change it up by learning new things)",
    "title": "Transition from Professor to Analyst advice",
    "subreddit": "jobs",
    "timestamp": 1627505287,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Woman at work trying to train me up to do her job It’s not my job. I’m training to be a textile engineer. This woman is a weaver and I can actually do this job well enough to help out, which is what I do when I’ve got nothing to do. But why should I train up to do another job that isn’t mine? How do I say no to her without arguing with her. She’s suddenly become obsessed since this new guys started to ‘train me up’ which in reality means taking the rolls off of the looms. Which nobody else does who isn’t a weaver so why should I? \n\nI can see her convincing my boss to make me do this. It’s going to end up with me getting another job elsewhere which I really don’t want to but I will. I don’t need training as I can do the job well enough to say it’s not even my job. My company is obsessed with people being multi skilled as they want to save money and can’t get anybody else in to work for them. I am actually multi skilled in a lot of jobs in textiles as I’ve worked my way up from the bottom. But these are not my jobs.",
    "title": "Woman at work trying to train me up to do her job",
    "subreddit": "jobs",
    "timestamp": 1638441373,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Women are given easier/less strenuous jobs than men I mean why is it kind of taboo to make this omission. I searched up the same inquiry in search engines such as Google/Bing and the algorithm presented headlines completely unrelated to my query, such as “Women are discriminated against in the work place” or “X amount of reasons why women tend to be more productive/multitask oriented”\n\nI often hear about this supposed discrimination of women. But in the various manufacturing, production or warehousing jobs I’ve worked over the year, they always get preferable and comfortable job positions that pay the same as some guy who has to physically exert himself even more.\n\n\nThey also have work policies and safeguard legislation specifically in a place to benefit them, such as maternity leave. Now other countries this happens to be a standard for men as well, who happen to be new fathers. But that’s a fringe sentiment in the United States.\n\nWhen it comes to what our society feels woman can or cannot do and what their physical limitations are, in tandem with preferential career paths they choose, which happen to pay less (Education, Human Resources etc) - do you feel like this gender wage gap “inequality” has gotten politically distorted and derailed from the actuality of the everyday circumstances and reasoning behind it?",
    "title": "Women are given easier/less strenuous jobs than men",
    "subreddit": "jobs",
    "timestamp": 1617304760,
    "score": 0,
    "keyword": "woman engineer"
  },
  {
    "text": "(Vaccinated) Coworker who sat right next to me tested positive for Covid. Went to get tested and OF COURSE it becomes about reproduction Right now, I am scared and furious. Not the best combo.\n\nI'm fully vaccinated (with a booster thanks to the immunosuppressive meds I'm on) and attended a work function on Friday. It was required that every employee be fully vaccinated to attend. I was a bit concerned, but it was the first real thing I've done like that since February of 2020. We went to a nice restaurant and had a great dinner.\n\nThen this morning the coworker I sat directly next to sends out a group text saying he had just tested positive after waking up with a fever and urging everyone who attendedto get tested.\n\nI've had cancer 3x and am still undergoing treatment for the last round. My husband is immunocompromised. I'm terrified that one of us will get a serious breakthrough infection. I lost my godson to Covid last year and it's close to home, and scary.\n\nSo I went to get tested. My husband did as well, just to be safe. He was in and out in 5 minutes. I waited an additional 30 minutes to be called in, and then 45 more for the actual test. Weird, right?\n\nThen the old doctor comes in and asks \"Who I have at home?\" I answer \"My husband\" and he jumps to \"Will he be able to help with the kids if you get sick?\"\n\n\"We don't have children.\"\n\n\"Yet? I see you have a birthday next week. You know it's dangerous to get pregnant after 35? You shouldn't put it off any longer.\"\n\n\"We don't want children.\"\n\nHis disposition immediately shifts.\n\n\"What line of work you in?\"\n\n\"I'm a software engineer.\"\n\n\"Oh, a modern career woman, huh? Well, you'll regret it. Who will take care of you when you're older? Doesn't your husband want children? Have you thought of that?\"\n\nI am pretty non confrontational. I should have said something. Instead I scowled and asked when I would get my test done so I could leave.\n\nNow that I'm home, I'm shaking I'm so angry. I'm supposed to be able to trust a doctor with my care. I'm supposed to be able to confide in a doctor. I'm not supposed to be devalued because I don't have kids WHEN I SURVIVED CANCER 3 TIMES BEFORE I WAS 35! Those are genes that shouldn't be passed on regardless of my personal decisions.\n\nI'm scared waiting for my test results and I feel angry and humiliated.",
    "title": "(Vaccinated) Coworker who sat right next to me tested positive for Covid. Went to get tested and OF COURSE it becomes about reproduction",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633300598,
    "score": 5560,
    "keyword": "woman engineer"
  },
  {
    "text": "\"You proved them wrong\" I'm a NASA engineer and founder of a small startup company fighting climate change. When I tell people about my career, I loathe the \"way to go you proved them wrong\" response. Yes, being a woman in STEM is challenging, and yes, there are idiot people that think women aren't as capable of working in science fields. But my hard work is in no way motivated by proving anything to those people, and we shouldn't have to go through life constantly trying to prove ourselves. \"You proved them wrong\" isn't a compliment, it's a reminder of how some people view women and the constant unequal playing field that we have to deal with every day.",
    "title": "\"You proved them wrong\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1636118843,
    "score": 2915,
    "keyword": "woman engineer"
  },
  {
    "text": "My daughter is a new mechanical engineer, and I'm so proud of her My daughter is the youngest of four and the only girl. She's been my buddy since the day she was born. At nine months old, we found out that she had a muscle disorder that made life that little bit harder. \n\nStill, she worked hard to make the volleyball team. After three years as a manager, she finally made the team. For three more years, she worked incredibly hard to get play time, a premium for her. Her senior year she finally had enough and moved on because she'd made her point: she could do it. \n\nThis year, my strong, independent, bullheaded baby girl graduated from one of the top engineering schools in the country. It wasn't easy. She fought every day to succeed, to be taken seriously by the men in her classes and by her instructors, too succeed in her studies. She took mechanical engineering - a field with a 15/85 women to men ratio - because making things makes her happy (even if she cut off part of her finger in shop class in high school). It wasn't uncommon for her to be the only woman in her class. A month ago, she graduated. She made her point: she could do it. \n\nToday, she received her second job offer in a week. Next month, she moves to a new state and starts her life as a mechanical engineer. \n\nMy baby girl who spent two years in physical and occupational therapy to learn how to walk and talk has proven that she can do it. And I'm so damn proud of that girl that I had to share.",
    "title": "My daughter is a new mechanical engineer, and I'm so proud of her",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1623899895,
    "score": 1189,
    "keyword": "woman engineer"
  },
  {
    "text": "I am so sick of potential MILs wanting an educated maid for their dear sons! I (26F) had a conversation with my mum recently, where she was telling me her friend is looking for a wife for her son. \nFor a short background- this guy is my age 26M, well educated and working as a software engineer in an egalitarian northern European country same as me. \nSo his mother is looking for a wife for him so  her son has some company and doesn't feel lonely. But then she goes on to add how it will be nice if the potential wife enjoys doing house chores ( she said it as if it's a hobby) so it helps out her son, and he can focus more on his work!\nThis really triggered me as I'm his age, and living in this same European country which really gives the women the same respect as men. To me this country gave me the freedom to walk on the streets at night alone without being scared and wearing whatever I want without anyone saying anything. I love my freedom, the equality I get and more importantly love my career. \nAnd I couldn't imagine how could someone ask another girl my age to give up their dreams and ambitions to do house chores as a hobby in this country ? Didn't the guy pick up any nice qualities living here ?\nAlso I was so mad at my mother for being okay with what this woman said. And being a woman herself how could she do this? \nFew weeks ago I came across this post that said brown people just want a maid as a wife and then I came across a real life example!\nAlso unlike my home country, here in Europe everyone has a dishwasher and if you spend a little more money you can buy the robotic vacuum cleaner as well if you think manually vacuuming is a pain! Then why marry a whole person to do this????\n\nEdit - the woman stays in my home country and is looking for a wife there, for her son who lives in North Europe. I realized the way I wrote it can be a little confusing",
    "title": "I am so sick of potential MILs wanting an educated maid for their dear sons!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626798896,
    "score": 385,
    "keyword": "woman engineer"
  },
  {
    "text": "I hate when you finally feel comfortable in your own skin and men have to ruin it. I’ve always suffered from self esteem problems due to being abused as a teenager and almost being SA as a adult.\n\nRecently I’ve started to be more confident so decided to wear clothing that would reflect that.\nFor some context I am wearing lots of shorts and crop tops without bras.\nA week ago I decided to head out and pick up some food, on my way back home I had one dude stop for me at the crossing and as I was almost over the lines he revved his engine and drove past me really slowly making me incredibly uncomfortable.\n\nThen about 1/2 minutes later a older man pulled his car over and offered to drive me home. This dude didn’t understand no until I said it to him a few times.\nI managed to get him to leave but I was still terrified as fuck and came home a complete mess.\nI actually walked the rest of the way home with my shopping bad clutched to my chest because I was so scared it would happen again.\n\n\nCAN WOMAN PLEASE BE ALLOWED TO FEEL COMFORTABLE IN WHAT THEY WEAR WITHOUT A MAN VOICING HIS OPINION.",
    "title": "I hate when you finally feel comfortable in your own skin and men have to ruin it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616458443,
    "score": 294,
    "keyword": "woman engineer"
  },
  {
    "text": "My Diploma is Her Revenge I need a moment to rant and to criticize some people who have openly threatened my life in the past, hence, throwaway account.\n\nSo, anyway: before my last relationship ended, when I was still in the closet, I was part of a student religious association at my university and the people I met there were basically my entire social circle. Over the course of four years, I watched normal, well-intentioned people be sucked into a religious movement called Radical Traditionalism.\n\nI don't want to get too deep into the details. Suffice it to say that Radical Traditionalism is a controversial religious movement whose defining religious belief is that a return to all social norms which existed before the birth of Karl Marx, including but not limited to traditional gender roles, is necessary in order to save us from an impending apocalypse.\n\nSo...I was a closeted lesbian and a female engineer, forced to slowly watch my friends and family be sucked into this madness, while I was their easiest target for regurgitating angry propaganda and threats.\n\nI was a high school debate captain and I can handle myself in an argument, so, at first, I would just fire back when these zealots would start calling me a sinner. But things just got worse and worse. I found myself the only person arguing against a room full of twelve other people (led by another female engineering student), who claimed that the downfall of America began with the passage of the 19th Amendment.\n\nI pointed out to this woman that I knew she voted: she was a pro-life protestor, she marched on Washington multiple times, and a staunch Republican organizer. Her response was that she had no choice but to vote if the government allowed her to vote, but that she wished the government did not allow her.\n\nTheir argument was that if there were no women voters, there would not be liberals and that none of the \"progressive\" legislation of the 20th century could have got through Congress.\n\nSomehow, this topic got onto education and how women either don't need or shouldn't have college educations, which was an absurd conversation to have with other female engineering students at a large public university. They decried the fact that they were FORCED to attend school by a society which doesn't take care of its women anymore but that one REALLY got to me.\n\nWhen my great-grandmother was born, American women could not vote. I still remember her. Her life is not in the distant past. But both of my grandmothers are still alive, and neither of them completed high school. My American grandmother never graduated because the school refused to let a disabled woman even turn in homework or take exams. She sat through class every day and completed all her homework assignments, only to watch the teachers throw her work in the garbage without reading it. Every. Damn. Day.\n\nMy Irish grandmother never graduated high school because her family needed her to work--so she took a job as a priest's secretary. This priest was a professor at a college which did not admit women. \n\nAnd that insult still stings in my chest. I am their revenge. My diploma is their revenge. \n\nThere is no moment of revenge like four elderly Irish women pulling out their savings from a lifetime of being secretaries and nurses and bank tellers and assembly-line workers, a lifetime of being paid less than men for the same work, by the Catholic Church, by the NHS, by American corporations--to buy textbooks so that an American teenager could become an engineer.\n\nAnd to see these students--secure in their college funding and their citizenships and their civil liberties--start complaining about the burden of opportunity: That broke me inside.\n\nAnd it broke me again and again to watch them drop out to pursue this movement: brilliant physicists, neuroscientists, chemists--it still hurts, wondering that's become of them. Wondering if they're free to call for help if they're being abused. Wondering if they're happy.\n\nI miss them. I am angry at them. I am worried for them.\n\nBut I did not follow them. This diploma is MY revenge.",
    "title": "My Diploma is Her Revenge",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626388096,
    "score": 197,
    "keyword": "woman engineer"
  },
  {
    "text": "I wish hyper feminine women would stop making assumptions about gender nonconforming women like me who wish to not be valued by their looks, especially in male dominated fields. I'm someone who supports all women, especially hyper feminine women with anything feminine being sneered at. My sister is hyper feminine and I would love for her to feel like she has a place in STEM. What I feel is missing from the discourse is understanding why STEM attracts a handful of tomboys/gender nonconforming women.\n\nThe issue had with femininity growing up is that it seemed to only cater to those who could afford it. My family was working class during my formative years, so my style resulted in a certain aesthetic, and hyper femme girls made fun of me for not wearing what they were wearing, and a whole lot else since I'm not conventionally attractive (I'm underweight and my hair doesn't grow past my shoulders). Despite all of that, I don't have a problem with hyper femininity---I have a problem with *specific* hyper feminine women who berate other women for not conforming to their standard of beauty.\n\nI find solace in STEM because I felt it was a space where I'd appreciated for my mind. I understand that women can be both smart and beautiful, and I support it! It just neglects to acknowledge why unconventionally attractive women in STEM aren't as keen to presenting femininely, possibly because they don't identify with the aesthetic, difficult experiences  with hyper femininity, the list goes on. I'd hate to be overshadowed by conventionally attractive women because they're easier on the eyes than I am when we both want to contribute to the same goal. Tech I feel is one of the only spaces where I feel I'm valued for my brain first.\n\nIf we can accept that hyper feminine women exist not for the consumption of men, I'd love for people to recognize that gender non conforming women exist for the same reasons. We just want to exist as women without people accusing us to conforming with masculinity, or accusing us of hating hyper femininity because of the patriarchy.\n\nUpdate: Just want to clarify some points here\n\n1. I think labels are stupid. I shouldn't have used them, and I'm sorry for using them. I think not categorizing women is what'll solve the problem here. When I say hyper feminine, engineers like [Naomi Wu](https://www.asian-sirens.net/uploads/2016/11/1549-500x666.jpg) come to mind (who I highly recommend watching for kick ass builds), or anyone from the Miss America circuit. It means a woman is just extremely girly, and exaggerates the look (think Bratz dolls or Barbie!). **I agree it is important STEM is a welcoming space to different types of women.** Part of my angst was that the discussion surrounding certain women gatekeeping is often inflicted towards gender non conforming women who've often had negative experiences with people valuing them for their appearance and interests, especially feminine women.\n2. I DO believe women can be both beautiful and smart. I've said this multiple times in the original post, and there was a group of women who believe I believe otherwise, which isn't true. There is also another women accusing me of wanting to look like a man, which is frankly classist and sexist just because I deviate from her standard of beauty. I could have articulated this better. What I was trying to say was that just because there are some women who want to put in the extra mile to be beautiful as well, doesn't mean that same standard should be applied to all women. Moreover, I wish femininity wasn't just about the aesthetic, but the character traits like patience, warmth, empathy, etc, all of which I feel isn't reinforced enough. Women should just be allowed to be themselves. By assuming I *want* to look like a man, be like a man necessitates the need for this post, which is a plea to let me be myself\n\nUpdate 2: Thank you so much for the awards!! They mean a lot! And thank you to the users who listened, understood, and offered support. It means a tremendous amount.\n\nI'm really sorry if my initial post caused some knee jerk reactions. I just didn't want people, men or women, to further pit women against each other because some happen to appear conventionally feminine while others didn't conform to traditional beauty standards. I've faced so many micro-aggressions here because I'm a gender non conforming women sharing my personal experience. I also could have responded to some of the knee jerk comments in a more civilized way too, and I apologize for my approach. To be called an incel, a man, a misogynist, etc because I'm a gender non conforming women sharing my experience with the discourse involving SPECIFIC women is egregious. This post was never to attack women who are traditionally feminine, and I hope we can all come to a better understanding about our different lived experiences in STEM with the goal of improving the culture for ALL women!",
    "title": "I wish hyper feminine women would stop making assumptions about gender nonconforming women like me who wish to not be valued by their looks, especially in male dominated fields.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634697498,
    "score": 188,
    "keyword": "woman engineer"
  },
  {
    "text": "Are my male classmates not thanking me because I'm a woman of color? I'm in an international engineering program with 90% men. They are from different backgrounds ​and I have faced so many misogynistic, racist, homophobic incidents, though I made very few amazing friends.\n\nThere is this mandatory class notorious for its difficulty, and I'm a top student in the class.\n\nThe final's coming up and yesterday I decided to do something nice, which is to upload past exam solutions with explanations to two different group chats. (Our university usually has a database to access past exams for subjects but some don't have solutions)\n\nI was already getting so many desperate requests for the solutions via personal chat from classmates I never even talked to, and I remember them practically begging the professor for the past exam solutions. \n\nOur grading system is absolute (we don't have to compete) and I learned even more answering questions when I was a tutor before, so it doesn't even harm my grades, so why not.\n\nI wasn't expecting praises, but it was so odd that nobody except one person in each group chat thanked me, who happened to be women, and  instead I am swamped with male classmates' questions and *requests for solutions for other past exams* via private chat.\n\nAlso, I know for sure that a few days ago, three people thanked this white guy for uploading something that a tutor asked him to upload on behalf of him(the tutor), which is not even his notes. \n\nI shouldn't feel bad for not getting rewarded for what I did out of good will, but honestly I lost all will to help others. Not sure if it is because I'm a woman of color or people are just dicks, but I feel weirded out by the disconnect between how desperate and begging they are in private and how silent they are in public.",
    "title": "Are my male classmates not thanking me because I'm a woman of color?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624869782,
    "score": 159,
    "keyword": "woman engineer"
  },
  {
    "text": "Yall can we quit making women feel like oddballs out based on their dressing style! It goes both ways I know there are lots of great motivational posts on here about not having to wear makeup and dressing for yourself and fanciness level you want.\n\nIm an engineer where women are pretty much no makeup, jeans/slacks and a sweater.\n\nEverytime i wear a dress there is at least one shocked person commenting \n\nThe first time i wore lipstick, so many people commented that i felt like i was in a petri dish being analyzed .. people asking why am i wearing it, something happened in my life and on and on?  I felt so hounded i didnt wear it again for months \n\nCompliments on style (not body ) are good, acting like its earth shattering because a woman dressed outside of what your normal is .. whether it’s dressing up or down.. is not",
    "title": "Yall can we quit making women feel like oddballs out based on their dressing style! It goes both ways",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1629790390,
    "score": 151,
    "keyword": "woman engineer"
  },
  {
    "text": "I made this song about some of my experiences of being a woman in a male-dominated field (I'm a software engineer, B.S./M.S. in math). So far it's made it to 3 radio stations, and I'm donating all the $$ from streams etc. to Girls Who Code! I thought it might resonate with some of you. :)",
    "title": "I made this song about some of my experiences of being a woman in a male-dominated field (I'm a software engineer, B.S./M.S. in math). So far it's made it to 3 radio stations, and I'm donating all the $$ from streams etc. to Girls Who Code! I thought it might resonate with some of you. :)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1609973589,
    "score": 122,
    "keyword": "woman engineer"
  },
  {
    "text": "Health Issues as a Young Woman I just need a safe place to vent. I'm having some health issues at the moment, I feel mostly fine, but my symptoms are rather concerning. I went to urgent care Wednesday and Thursday this week. The doctor I saw both times was a woman and she took the time to ask questions, get a full overview of my symptoms and tried to help. At first she thought I might have COVID, but my test came back negative. The second visit I had developed some more concerning symptoms and she ran an EKG and decided I needed to be sent to the ER and offered me an ambulance ride. I didnt feel like I needed it, so I drove myself. \n\nI got to the ER and my doctor had called ahead to let them know I was coming. I sat and waited for only an hour before getting a room. I saw a PA first then a Dr. Both were men. \n\nThe PA interrupted me over and over again and didn't ask for a full symptom run down. Everytime I tried to go into further detail about my symptoms he interrupted me. He ran off to talk to the Dr. and when the Dr. came in he didn't really ask questions and everytime I tried to mention \"other\" symptoms he didn't say a word and just went back to the \"main\" symptom. \n\nThey discharged me and told me to take over the counter medicine. \n\nSo now I still have no idea what is wrong with me. I dont want to try a different ER and pay another $75 copay. I went from being told I need a CT scan, ultra sound, blood test, a second COVID test, etc. to being told to take over the counter medicine. My symptoms are all still present and all still concerning, but some male doctors decided that the full picture wasn't necessary. I dont even think they looked at my chart, which I know for a fact was available to them, because my urgent care Dr sent me there specifically because they had access to my medical records.\n\nI tried advocating for myself. I tried expanding on my symptoms, I tried pushing when they told me to take some over the counter medicine (which I had already tried an at-home treatment which was known to be effective for the \"diagnosis\" they gave me), I kept bringing up my other symptoms that they were uninterested in hearing about.\n\nI have work, but I've missed a lot already due to Dr's appointments. I have a Dermatology consult today because one of my symptoms looks like it could be a melanoma. The derm should be able to tell me if the over the counter medicine the er prescribed is worth trying.\n\nI'm just so frustrated. I feel overwhelmed and powerless. I'm only 25, I'm a full grown woman, an engineer, and I've been clear about my symptoms. I'm a reliable source of info about my own body and symptoms and yet the men at the ER did not seem to agree. Idk what to do, but I needed a place to vent. So thank you to whoever has read this far.",
    "title": "Health Issues as a Young Woman",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1614956480,
    "score": 110,
    "keyword": "woman engineer"
  },
  {
    "text": "My dad saw my perspective for once So to start off my dad is pretty traditional. I was a teenager who liked to do things my own way and was very independent, didn't like any help, and I'll admit, was a little bit of a smart aleck. So we butt heads a little bit but nothing super major. \n\nThree years ago he brought me to this mechanics garage to surprise me with a car he bought and that I'd pay monthly on. I was elated I had a rusty old car (that I loved) from a police auction that was like $500 but needed work constantly so I was excited to get one that I knew wouldn't leave me stranded anywhere. \n\nThe shop was run by this old man. When showing me the car, he spoke to me like I had never even seen a car before. He explained what/where the engine was, how to start the car, how to do the turn signals, and how to put it in gear. He then sat in the car and had me drive it around the block so he could show me how to drive it....it was an automatic car. He chastised me on my turns, my braking, and my speed. We literally drove in a circle about a block...\n\nAnyways I just washed it off and was polite because he was just an old man. \n\nWell today I'm home and I needed an oil change. Since having the car, I had the exhaust replaced and the windshield, and I'm friends with a mechanic in my home town so I get it checked out if I have any questions. \n\nI told my dad I was going for an oil change and I heard a rattling this morning and wanted him to listen to it and he suggested we take it to the old man we bought it from. I was hesitant. He asked why and I explained that I didn't like that guy. My dad seemed surprised at this and asked why. I was finally able to put into words that I didn't like being spoken down to. I don't like when people assume I'm dumb. He brushed it off and said he was \"just an old man\" and was \"trying to help\" and I explained that he had acted like I had never seen a car before. I said I didn't like to be mansplained. I once I said that, my dad said, \"he wasn't mansplaining. What are you some sort of feminist?\" I said \"fuck yeah dad, I think women are equal\" and he goes \"me too, I have four daughters and your mom\" (to his credit, my mom is a badass and super strong independent woman). I explained that women currently aren't equal and he asked how. I knew this could go two ways, but I explained that more women in america have died since 2000 from their partners, than men have died in the war. He asked if it was true and looked it up. He didn't really say much after that. But on the way to the shop he said if the guy says anything like last time he would say something. I said no, that I will say something. I was nice to the man and the man mostly spoke to my dad at first. But then I chimed in explaining the work ive had done on it, the tires, and new exhaust I bought and said I think the exhaust just needs to be tighted since it was recently installed. And when the man asked for my dads phone number for when the car was ready I spoke up and said \"actually you can call me!\" And my dad beamed and put his arm around me. \n\nI know it's nothing huge, and I truly think my dad has good intentions, but I am just happy he was able to see it from my side instead of this starting an argument like it would have before. \n\nTo strong women! May we know them, may we be them, may we raise them.",
    "title": "My dad saw my perspective for once",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615573955,
    "score": 108,
    "keyword": "woman engineer"
  },
  {
    "text": "My proud moment with workplace sexism This actually happened a few years ago but I think it's still relevant.\n\nI'm a software engineer so you can guess the hidden sexism I work around. There was this one guy who was a bit of a difficult person and borderline asshole to many, including me (of course). He seemed like he thought he was smarter than everyone else (he was an extra smart guy, truth be told, but he had no concept of humility) and acted like it. I'm  a woman, plus I graduated from a uni with a bad rep so of course he thought I was stupid and he acted all high and mighty with me too.\n\nThen it so happened that we were attending a workshop together and out of the dozen people there (many of them highly qualified) only the two of us managed to keep up with the expert and engage him in deeper questions. We were nerding out 200% and I was having fun. The whole workshop went on for a few days like that.\n\nSo a day or so after this the guy stopped me in the corridor and APOLOGIZED. He literally said the words \"I was a total, sexist dick and I was wrong\". I thought I heard wrong for a moment. I actually got this dude to realize how much of a jerk he'd been and he reflected on it! And I didn't even try! One of my most successful (not to mention satisfying) moments at work.\n\nPS: we actually got on good terms after this and were work buddies. This was the only time a guy apologized to me for being an asshole so he did earn himself a lot of respect that day. Even though I've since realized that this was the basic human thing to do, it was still a rare thing to actually see someone with the integrity to call himself out on his sexism.",
    "title": "My proud moment with workplace sexism",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1639441789,
    "score": 96,
    "keyword": "woman engineer"
  },
  {
    "text": "A Facebook engineer abused access to user data to track down a woman who had left their hotel room after they fought on vacation",
    "title": "A Facebook engineer abused access to user data to track down a woman who had left their hotel room after they fought on vacation",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626382321,
    "score": 93,
    "keyword": "woman engineer"
  },
  {
    "text": "Four women issued complaints with HR about our CEO's nephew. She made him COO a week later and asked me to apologise for issuing my complaint. I thought working at a lab that was owned and directed by a woman would mean that I could avoid the sexism that is so common in STEM-fields. But I guess I was wrong. \n\nThe nephew,  who we will call John, is under 30 and has had only one other job prior to working at this lab. His degree is in civil engineering. \n\nThe complaints issued against him:\n\n1. 25 year old tech who felt John was being extraordinarily condescending and blocking her ability to do her job properly. Her duties were fixed so she no longer worked in the same area as him.\n2. 60s year old sales representative who has worked with the company from the beginning; she complained to HR after John was condescending towards her and another sales rep in a conference call.\n3. 40ish year old specialty consult who complained once again about John being condescending, not listening to a level that impeded her work. She walked out and quit (I forget if it was shortly before John was made COO or shortly after).\n4. Me, 25, another tech. I was validating a new assay and it did not produce the results we were hoping; I discussed this with our scientific director (PhD in the field) , came up with a list of potential issues, and sent it to him (along with the lab director and scientific director). He sent back an email to me saying that I was \"not thinking deeply enough\" about the issues and I was wrong. Mind you, my degree is in the field and I have worked in labs for several years. I should also note a week before this, I had asked for help on something and he said I did not need help. He got heated and left abruptly, slamming a door on the way out. I brought up this incident with HR as well (also had 3 coworkers witness this). I mentioned that I felt his attitude towards female coworkers was condescending and inappropriate. The next day, he followed me into a hallway (empty) and told me that I was bad at my job and need to change (IMO very much not true; both the scientific director and lab director frequently praised my work). Admittedly, this is when I fucked up and told him that he needed \"to change his attitude towards women\"  who worked there (exact words). I was asked by the lab director to apologise for this comment to him, since apparently it really hurt his feelings to be told that he was sexist. I agree that it was entirely unprofessional of me to have made that comment, however I also felt it was rich that I was being asked to apologise after he basically followed me into an empty hallway to verbally accost me, one or two days after my original HR complaint.\n\nI stayed at the job 6 months after he became COO but finally quit after being asked to do something I felt was unethical. In that time, I observed him continue to talk to qualified women with condescension despite him having absolutely ZERO experience or expertise to put him in the role that he held, nor to weigh in on the matters that he did. \n\nI don't know if there is any legal action I can really take, nor do I really want to pursue any. I just needed to vent about this; it's been on my mind a lot since leaving the company and really recognising just HOW inappropriate his promotion was. I felt like I was gaslight for months there, being told that his promotion was deserved, and now I am waking up to it. \n\nObviously nepotism plays a huge role in this, but it really makes me sad that my lab director, who is a fierce promotor of women in STEM, would tolerate and reward someone who demonstrated a pattern of being condescending towards female employees. I never saw him do this with men who worked there. \n\nAnyway, thanks for reading if you did. Feels good to be able to type this out and recognise just how insane that was.",
    "title": "Four women issued complaints with HR about our CEO's nephew. She made him COO a week later and asked me to apologise for issuing my complaint.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1610402701,
    "score": 92,
    "keyword": "woman engineer"
  },
  {
    "text": "What is the best part of being a woman and how has your womanhood positively impacted your life/the lives of those around you? Title says it all. I appreciate all of the shared stories relating to problems with consent, boundaries, abortion rights (aka lack of...), workplace sexism, and relationship sexism. These topics are really important and I think it might be time to share what makes us feel powerful and impactful in our day to day lives. \n\nI'll go first-\n\nOne of the best parts of being a woman, in my opinion, is the friendships I share with other women. The connection I have with my girlfriends is unlike anything i've ever experience in male friendships. Women look out for and support each other in a unique way. I consider myself so lucky to have incredible friendships that fall into this category, \n\nAlso, I feel so lucky to be a woman at a time where we have more opportunities to chart our own paths, especially in STEM fields. I returned to school in my early 20's to get my BS in mechanical engineering and appreciate the skill set it provides me with. I hope that I'll be able to support other women entering STEM fields in the future, once I am employed in the field. \n\nOften, people are taken aback when they hear I'm studying MechE. I always think its because my personal interests align with those often stereotyped as \"girly.\"  I like to think that embracing my career interests without altering how i approach my femininity to be \"one of the boys\" breaks down stereotypes of what engineers \"should\" look/be like. \n\nI look forward to reading your responses.\n\n\nEdit: All of the responses on this post are so heartwarming and wonderful. Also, please know that all women are welcome to respond to this post, not just cis women. \n\nI figured that goes w/out saying but just in case there was a question (:",
    "title": "What is the best part of being a woman and how has your womanhood positively impacted your life/the lives of those around you?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1639262933,
    "score": 72,
    "keyword": "woman engineer"
  },
  {
    "text": "Woman in engineering Hi, \n\nI am a woman studying mechanical engineering and throughout all of college I have had to deal with other male engineers telling me I get interviews, acceptance into university/school of engineering, attention professors, etc. mainly because of my gender. It's disheartening and after being told it so often I kind of start to believe it. Are they just putting their insecurities upon me or do they have a point?",
    "title": "Woman in engineering",
    "subreddit": "engineering",
    "timestamp": 1611297091,
    "score": 7,
    "keyword": "woman engineer"
  },
  {
    "text": "Is it unreasonable to tentatively plan to become a teacher later in my life? So I'm in college right now getting my undergrad in Computer Engineering with a minor in Biology.  I love my degree, love the career options it opens, everything.  However, I'm a person who throughout my life will probably want to pursue a few different career paths.  I really value exploring different areas and I feel like I'm going to hate my life if I work in the same career for 30 years.  So, I'm kinda making some backup plans for my inevitable mid-life crisis, lol.  Alternate backup plan is genetic counseling or being a vet technician.  Yes, these are very different, I'm interested in everything because everything sounds amazing and I want to do it all (if you can't tell I have ADHD lol) which is why staying in the same field forever sounds awful!\n\nI had a lot of teachers in high school that started out in industry and switched to teaching.  For example, I had a physics teacher that was an engineer, and a chem teacher who used to work as a chemist.  Could I possibly do this someday after working in industry for a while?  How exactly *do* you become a teacher?  Do you have to study something specific in undergrad, or just go back for a masters in teaching?  I figured I could be a math teacher, engineering teacher, computer science/IT teacher, or a science teacher.  Really, anything but history lol... Probly something in STEM!! I also feel like high schools are very lacking in female representation in engineering and compsci classes esp and would love to teach to help motivate girls to pursue STEM (I struggled w/ this a lot in high school and could've used a role model)\n\nI've always kind of wanted to be a teacher because I love explaining things and helping people learning and working with kids and teens (even tho I'm 19 I'm still a teen lol).  I used to want to be a math teacher actually.  I also volunteer tutored in high school.  I tutored elementary school children, high schoolers, and special needs kids in just about every STEM subject, and LOVED it!!! It was so rewarding and I hope to find an outlet for this passion somehow.  However, I knew I didn't want to do teaching in undergrad, and my parents pressured me not to anyway.  I thought maybe working in industry could get me some other life experience, as well as maybe a chance to build up some money... Sorry guys, teaching doesn't pay well or I probably would've been more tempted to do it instead of engineering rn :(  Is it totally weird to kind of aspire to some day become a teacher, maybe in my 40s or something?  I just feel like after a while working in STEM (especially as a woman) is going to get emotionally taxing and I could use a change of pace... Of course, not to say that teaching isn't extremely emotionally taxing!!  What do yall think is that crazy?",
    "title": "Is it unreasonable to tentatively plan to become a teacher later in my life?",
    "subreddit": "Teachers",
    "timestamp": 1624554266,
    "score": 3,
    "keyword": "woman engineer"
  },
  {
    "text": "Why no promotion to engineer manager after years of experience & top marks on review? My question is why? Is there something glaringly obvious I am missing? I suspect it's because companies just need developer butts in chairs and I'm very good at \"getting things done\" and communicating tech stuff to every person involved. I'm not the most engineery engineer AKA I don't spend free time coding unless it's for an indie game or something.\n\nAnother possibility might be I am very reality based and don't drink a lot of company kool aid. Don't get me wrong, I am good at putting on the company face - but I'm very democratic socialist. It's annoying when we get told \"we're making so much money!! we will retire early!!\" at a company that doesn't really give stake to employees and it's not a damn co-op.\n\nAnother possibility is maybe I'm not as good as I think I am? Imposter syndrome creepin in?\n\nLastly, I am a woman but I really don't think this is any cause for concern promotion wise.\n\nI'm generally well liked, have a great relationship with my boss and over 10 years experience in the tech industry under my belt INCLUDING managing teams of engineers on top of regular job (without the title). I always have good quarterly and yearly reviews. I've been in a senior role for quite some time.\n\nI'm just burnt out and tired and daydreaming of buying a food truck because everything seems so futile anymore. Moving to a new company always ends up \"SO YOU CAN CODE??\" instead of moving up and I don't want to play anymore.",
    "title": "Why no promotion to engineer manager after years of experience & top marks on review?",
    "subreddit": "careerguidance",
    "timestamp": 1618415580,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Pivoting from a career in hospitality/retail to the tech industry? Hi, I'm a 30 y/o woman currently managing a small team for an IT-adjacent company although my job specifically doesn't deal with much IT work. My work history for the last decade has largely been hospitality/food service, although at jobs that have dealt with technology I've been a resource for them (Facilitating a shift from on-site to WFH for my current position, helping implement a new POS system at a previous job, etc) and only in my last two jobs have I been able to make the jump to an actual management position. My current position was a hiring as management, although I still work hourly and I think I may make less than one of my employees.\n\nWithout a degree in any particular CS field, I feel like it'll be an uphill battle to pivot into the tech industry but that's always been where my interests lie and this year feels like a prime opportunity to try. I'm not really sure where to start, should I be applying for IT Operations Engineer positions with my background in hardware setup/troubleshooting or maybe Junior Dev with my (very) limited JS skillset, should I try and find a lower level management position within a tech company and figure things out from there? I'm a little lost. Any suggestions are appreciated! Thanks!",
    "title": "Pivoting from a career in hospitality/retail to the tech industry?",
    "subreddit": "careerguidance",
    "timestamp": 1626445165,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Am I too old to become a programmer?  \n\nRobotics was my pandemic hobby. I printed 3D parts, wired servos to the Arduino, tried to get it work, but I was frustrated that my robot didn't work. I'm all self taught, which I felt was holding me back. So I decided to learn programming, to improve my robots. I work as a graphic designer at a university and can take classes for free. I've taken python and java, aced them both. Next semester I'm taking data structures. (Yes, my robot works now!)\n\nI'm making $43k, but with a CS degree I could double that. The thing is I'm a 61 year old woman. I think the tech industry is biased against both older workers and women. Should I go for a degree and try to get a job? Should I get certification? How do I do that?\n\nOther info: I love being a designer. I do html5 ad, as well as print work like postcards, flat sheets, billboards, signage, magazine, etc.\n\nSometimes I have a dream of doing a STEM class for girls. Call it Mom's Robot Co, and have 4-6 week classes with kits to purchase, to encourage girls to go into engineering and computer science. I dream of it scaling up into a franchise.",
    "title": "Am I too old to become a programmer?",
    "subreddit": "careerguidance",
    "timestamp": 1639329308,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "This week marks one year since the day I was fired out of nowhere, and now I make more money than the guy who fired me This is mostly a spite post, but I was also at the lowest point of my life 365 days ago, and it'd be neat if I could help even one person who's in the same position I was a year ago.\n\nMy first job out of college paid $71k in LCOL area. That's the median salary for new SWEs in that city, and I always saw myself as an average person, so I was happy with the median. The company had kind of a bad reputation for giving horrible raises, to the point where new software engineers often made more than ones who'd been there for a few years--because offers for new employees kept up with the market, but raises didn't (A salary for a senior SWE was around $78k, only about 10% more than I was making as a new grad). They also had a nasty penchant for laying off senior engineers and replacing them with busloads of recent college grads. But my plan was to just leave before I became a senior. I was a new grad without a lot of experience so I guess I just didn't think it through.\n\nI graduated January 2020, worked there for a few months until early April 2020, and got positive feedback literally up until the week before I was fired. No one ever communicated to me that I had done anything to put my employment in danger. When I was fired, my manager brought up that I had left work 7 minutes early a month beforehand, and that I had merged my branch into master on Github instead of doing it through the command line *on my literal first day on the job.* It might also be worth pointing out that I'm a woman and that another person from my team was fired that day, also a woman. I don't know if it was a coincidence or not.\n\nIn retrospect, I think this was effectively a layoff. I didn't really see it that way at the time. I kept thinking that I must be so bad at my job if I thought I was doing well but then ended up getting fired. I suffer from low self confidence, and this didn't exactly help.\n\nI managed to get a new job 2 weeks later, making a bit more money in a similar COL area. I excelled at the new company and was given a 4% raise at my performance review, plus a 3.5% bonus. Meanwhile my friends at the old company were telling me that their performance reviews were pushed back multiple times, and when they finally got their raises, they barely even outpaced their rising health insurance costs.\n\nNow that it's been about a year, I decided to start job searching and just signed a 6 figure offer. I never pictured myself making 6 figures, much less that I'd be making that much a mere 18 months after I graduated college. My confidence is at an all-time high, I feel *good* about myself as an engineer for possibly the first time in my entire life, and I'm excited about what the future holds for me.\n\nThe absolute cherry on top is that the average salary for a manager at my previous company is around $90k. I don't just make more than the guy who fired me; I make a *lot* more. Hell, I make more than I likely ever would've made at that company, even if I'd worked there my whole life.\n\nThe message I hope anyone struggling takes away from this is that no one manager or company can define your value! Getting fired was the absolute best thing that ever happened to me. I really don't know how much time I would've wasted in that horrible, toxic environment before I got it together and left on my own. I can't believe the difference 365 days can make, and I'm so, *so* grateful that I didn't let my old manager destroy my confidence.",
    "title": "This week marks one year since the day I was fired out of nowhere, and now I make more money than the guy who fired me",
    "subreddit": "cscareerquestions",
    "timestamp": 1617497683,
    "score": 2248,
    "keyword": "woman engineer"
  },
  {
    "text": "My work is hiring for a Head of Software Development and I really love the candidate we have narrowed down, but the other guy I'm with says no for petty reasons. Any advice? I currently work for a tech company in a bi\ng city as a lead manager. I've been assigned with another delivery manager to find a new head of software engineer/development for the team.\n\nWe have interviewed this one woman who is very early 30s. She has a very impressive resume and conducted herself very well over Zoom. She passed our programming tests in half the time as other candidates and got everything correct. She says she's been teaching herself code since she was around six and likes to build PCs. She dropped out of college where she was earning a computer science degree and went elsewhere to get a degree in a non-science field because of costs. She has spent her entire 20s working for the same social media company as a software engineer and then spent one year as a senior head of department where she was unfortunately made redundant due to the current climate.\n\nI know she doesn't have a lot of experience leading, but she definitely shows that she can do it. I've looked her up and she's done a few TEDtalks on women in tech as well as had a tech crunch article published about her.\n\nThe other person I'm tasked with on the hiring process thinks she won't fit in with the company for petty reasons such as she doesn't drive, age, she admitted she doesn't own a home or have children, etc. He said he would rather someone on the team like the rest of them: homeowner, married, kids, longer time as head somewhere else, etc.\n\nShe can't help her circumstances though and she seems nice. Are these valid reasons or a lost cause?",
    "title": "My work is hiring for a Head of Software Development and I really love the candidate we have narrowed down, but the other guy I'm with says no for petty reasons. Any advice?",
    "subreddit": "cscareerquestions",
    "timestamp": 1612439725,
    "score": 830,
    "keyword": "woman engineer"
  },
  {
    "text": "HR sitting in on 1-1s Foo\n\n\n\nI am the lead software engineer at a small, pre-series A company.  I have been working there for over a year.  All of my colleagues have loved working with me and I had nothing but a stellar performance review.\n\nThe communication between me and my boss has been a bit shaky.  although, I feel as if it has gone downhill.   Come last April, I had moved to Iceland and I was having breathing problems.  It was a combination of the withdrawals from a medicine I can’t get here and a bit of anxiety.  We were nearing a deadline and my boss asked if I was ok.  I told him I was struggling to breathe.  I got the rest of the work done but he told me to still take a few days off.\n\nThis is where it gets weird.  When I got back from taking a few days off, our HR woman was sitting in our 1-1.  She has continued to be sitting in our 1-1s and it is so awkward.  The weird part is that like, my job security isn’t unstable.  When all of this started happening I asked where I stood, and I was told that I was chill.  My boss the other day even asked me if/when I wanted to move back to America and we’ve talked about the upcoming work for the rest of the year.\n\nWe don’t have any sort of leadership in place other than the CTO (my boss).  Our CEO is completely useless and doesn’t do shit and there’s no one else that can do anything really.\n\nSo, it’s been 2 months and every single time our HR lady has been sitting in on our meetings.  It makes me extremely uncomfortable that my boss doesn’t feel comfortable talking with me in a 1-1 situation.  Supposedly we are going to be getting a PM and VP of engineering, but empty promises are pretty common here.  From my understanding, she has occasionally sat in on other folks 1-1s.  But the key word is occasionally - she shows up to all of mine. \n\nThings blew up a bit during our last 1-1.  At the very end of our conversation, my boss was like “we need to add postman tests to this.”   I was confused because in order to get postman working, I needed him to review my code that was open for two weeks.  I told him I was confused because we needed to get this merged in before I could do postman.  (As a background I have several pull requests 1-3 months old, waiting for his review).  I felt like he started to put the blame on me when I told him that I was concerned about how we can do postman tests.  He said things like “you are supposed to take ownership why don’t you know how to do this” and started like, man-splaining really hard to write unit tests.  Which i already know how to do lol.  My concern was that we didn’t have it integrated in and he was being the blocker, and we haven’t written any postman tests as a company (because again, he was holding me up).\n\nThere isn’t anyone I can turn too.  The HR woman doesn’t do shit.  Our CEO doesn’t do shit (I have literally never seen her on a single zoom call all of 2021).\n\n\nSo i am not fully sure what to do?  I like my work and my colleagues beyond my boss.  I hate how dysfunctional and all over the place my company is.  I know that I am getting low balled but I chose this job because I liked my boss and the product originally.\n\nIdk have you run into this situation before?  Where like your boss has a person from HR sit in every single one of your meetings?",
    "title": "HR sitting in on 1-1s",
    "subreddit": "cscareerquestions",
    "timestamp": 1623591868,
    "score": 76,
    "keyword": "woman engineer"
  },
  {
    "text": "Should I take an AI software marketing job? I am a 23F with a BA in Physics and Math and also took about a majors worth of CS classes across a broad range of topics. After graduation I do a few small personal projects with AI/ML but I am certainly a beginner still. I take a QA engineer position because I’m desperate for a job and I think it will be a foot in the door. I meet a director with 20+ years at <very large company> and he’s so very excited to meet a young woman interested in AI, especially with a Math and Physics degree. We meet and he sounds really jazzed about getting me a AI/ML software engineer position there. He told me to apply to anything that looked interesting and to let him know if I don’t hear from a hiring manager in a week, that was mid October. I got ghosted a bit and just received an email tonight about doing AI software ***marketing.*** Maybe I am just being ungrateful but it really bums me out to think that after doing four years of nothing but Physics, Math, and CS the best I can do is QA or Marketing. I do not think I'm well suited for marketing at all, but I suppose it could maybe be a foot in the door(but I think the foot in the door thing is a bit stupid). Should I try to pursue it?",
    "title": "Should I take an AI software marketing job?",
    "subreddit": "cscareerquestions",
    "timestamp": 1639719781,
    "score": 7,
    "keyword": "woman engineer"
  },
  {
    "text": "Got conned into a wrong job and don't know what to do to get out of the situation So I graduated in the middle of the pandemic and couldn't land a job for 7 months. Finally got a role at a small company in a Illinois suburb. In the interview they made it seem that they already had engineers at this office whom I will be working with, they said the current engg team is small but they plan to hire more people and that they currently have a larger offshore engg team in India. Now I had read some negative reviews about this offshore team and the CTO but I figured I will only deal with them occasionally and will mostly just be working with the team here in the US. \n\nBoy was I wrong, I come to my first day at work (yes they are working from the office every day, during the pandemic) and I find that there's literally just one other woman in the \"engg team\" who joined a couple of months before me and has no prior work experience, I have 2 years of experience and about 1.4 months of experience as a software developer, working in C, C++ and JavaScript Web Dev, current job is a Java Server Faces full stack role, a framework I have no prior experience with. The people in the American office while friendly are all just Sales and Platform Support. I was not excited about this company but decide it would be okay for like a year or so before I get a better job.\n\nThen when I finally had a meeting with the CTO and the Offshore engg team and I lost all hope for this job. It turned out to be a really negative and down right disrespectful and condescending bunch of people. The CTO is a micromanaging maniac who preys on desperate new grads and then puts them through the grinder until they quit within a year, there's only 1 engg on the devops \"team\" (just 2 people, one of which is a new grad like me) who has stayed for 3 years but she is related to the CTO so of course. I am expected to spend 2 hours or more every night to train with a offshore team member and join their daily standup, they expect me to work all day even on weekends and I am berated on every standup about not getting familiar with the framework and their code base fast enough. The CTO insults me and the other woman on my \"team\" about not being as productive as their offshore engineers who have worked at the company for many years and have the benefit of actually working with senior devs in person. According to him someone having a Master's degree should automatically be as good at their specific code base as a senior engineer, even if they have no prior experience. \n\nI have been at this company for less than a month but already I am feeling quite depressed and stuck. I feel I cannot even begin to apply for a new job for at least 5,6 months without it becoming a red flag on my resume, but I don't want to ruin my mental health over the next 6 months working with such people. I feel like I have barely any time left outside of work. They have given me a study project to do to learn the JSF framework but I barely feel any interest towards it, because no matter what I do they keep moving the goal posts and criticize how I code it, even though I am just following the tutorials available online and I have no help here. \n\nI even had to manually setup the work laptop on my own and I am still dealing with the clusterfuck of a codebase that they have, outdated codebase with not even Maven for dependency management, no Git, using SVN for version control, with junior devs having to submit patch files for seniors to verify and check in manually, no Test or Dev environment for devs to test their code changes, the source code has hardcoded paths for so many config files and dependencies that you have to manually figure out and fix from the console errors, have to setup everything locally including the database, also database changes almost every day and requires you to download a SQL dump file shared in a email and run it on your local DB to get the latest changes. I have no idea if the skills I learn here (JSF, PrimeFaces ) will even help me in the future since it seems to be an old and outdated framework compared to Spring.\n\nWhat should I do to get out of this situation as fast as possible. Should I start applying to jobs while keeping this job off my resume or wait for a few months and then add this job to my resume and then start applying. Should I personally contact recruiters/ hiring managers through LinkedIn or stick to blindly applying through job portals. I can dedicate a hour or so every day to LeetCode, but the thing that has led me to failing to crack interviews a lot is DB and Architecture design, as I don't have a lot of experience with those areas and don't know how to prepare for them.",
    "title": "Got conned into a wrong job and don't know what to do to get out of the situation",
    "subreddit": "cscareerquestions",
    "timestamp": 1613981887,
    "score": 5,
    "keyword": "woman engineer"
  },
  {
    "text": "Attractive women in software development Throw away account,\n\nI think I’m somewhat an attractive woman(natural curves top and bottom to boot) and I’m trying to break into the field of software development.\n\nI’ve attended some virtual events where either I’m completely ignored, told I don’t look like an engineer, or I should be doing something else like marketing, recruiter, streaming on twitch, or even fashion.\n\nI had an interview where the interviewer was an older man and he seemed very nervous and I figured that it was probably me. It felt awful. \n\nHow should I get over these barriers or respond to people when they say I should be doing xyz instead of software?  Or when my looks are mentioned?\n\nEdit: Im not a troll lol, but I do wish I looked like a troll but in real life I look kinda like gal gadot",
    "title": "Attractive women in software development",
    "subreddit": "cscareerquestions",
    "timestamp": 1631740126,
    "score": 5,
    "keyword": "woman engineer"
  },
  {
    "text": "Dealing with elitist culture ? I (31, F) am a software engineer working for a reputable civil engineering firm, in a small IT group. I am the only woman and person of color in the department. The type of software engineering we do requires us to have a background in civil engineering, which I do, as it requires understanding highly quantitative elements to the software.\n\nI joined a new organization some months ago. I was brought in by a former colleague (non SWE), that was a DBA while I was just starting as an entry level civil engineer, to work underneath him in his new role as an IT Business Partner.\n\nAt times he can be narcissistic. I have noticed he does complain to me about some other co workers, and I suspect that I am also being talked about too. I don’t agree with some of the comments he makes about people as not everyone works the same way— and for that reason I always try to play devils advocate in a nice way. I have been misunderstood many times in my life.\n\nI don’t talk about others much at work, as I really enjoy workplace positivity. I don’t go to lunch with people as there are established cliques. And my manager and other co workers generally only take 30 minutes at most. \n\nI notice I am getting avoidance treatment from other women in the workplace — those that do payroll, HR functions, and other admin roles. I know they all work together, and I am the only female and ethnic minority in this department. I always tell people good morning, but some days I don’t even get eye contact. I have difficulties assessing girl code and if it’s cattiness or if it’s jealousy... or if it’s just a snobby culture. \n\nI have a feeling if it is avoidance it may because of my income, which is very low given the industry standard, but may be seen as a lot given age, etc. Or it may be that my manager has badmouthed me, or even praised my recent successes. I am concerned because of course during these times we can’t ignore subtle hints at work. And maybe I’m not catching the hint? \n\nTLDR: I am a minority female SWE getting singled out by others — is it snobby tech/engineering culture or should I take the hint ?",
    "title": "Dealing with elitist culture ?",
    "subreddit": "cscareerquestions",
    "timestamp": 1610648439,
    "score": 4,
    "keyword": "woman engineer"
  },
  {
    "text": "How to handle working with incompetent manager and founder? This is my manager's first time being a manager. We are an engineering team of 9 people, 2 are founders. My manager isn't a founder. Here are some of the things I've had to deal with:\n\n\\- When I was first hired my manager said I could change our version control from SVN to git. This process took over 6 months to do, not because it was a hard technical change, that was the easy part, but because one founder was so not cool with needing to learn git for the first time and we had to painstakingly get his buy in every step of the way.\n\n\\- I was told I could add React to our frontend when I was first hired. It's been over 2 years and I've had every proposal dismissed as totally dead in the water because the same founder has never used React and doesn't want to learn it.\n\n\\- The same founder lost 8 months of work because he claims he accidentally wiped his hard drive twice. He did this twice.\n\n\\- One week before we needed to ship a project I was leading for 2 months, the founder didn't respond in slack for over 48 hours. He requires that he review all of my code before we ship. I had to escalate on the last day before we shipped to the CTO to say we were at risk. The founder magically appeared in seconds ready to review my code and I somehow still shipped on time.\n\n\\- Normally, I would think a coworker being MIA for 2 days was because of a crisis, but he regularly just doesn't show up to work. He never explained why he dipped. No one in leadership said they would talk to him or even said \"that wasn't ok\". We all just know that he does this.\n\n\\- My opinion is never genuinely factored into any code change. It's always whatever this founder wants ultimately. I've explained this to my manager as being undesirable and he said \"you need to reach alignment\" which we both knew meant \"just agree with him\"\n\n\\- My manager followed all of his subordinates on Instagram, which I saw as wildly unprofessional (it's not like I can really not accept a follow request from my manager) and then randomly unfollowed me in December.\n\n\\- My manager hired a known transphobic guy to our team knowing a trans woman I worked with didn't want to work with this person. That trans woman quit shortly after.\n\n\\- My manager allegedly (according to the trans woman I worked with) went to a concert with her, a coworker, by themselves and bought her flowers. He is married with two kids.\n\n\\- The founder and that transphobic guy had a yelling match in a meeting for 2.5 hours in a 1 hour scheduled meeting. The transphobic guy was fired. The founder wasn't. I was never pulled aside by leadership and told that this kind of meeting behavior is not ok.\n\nI've seen over 20 people quit within two years at a \\~50 person company. Everyone hates working with this founder, it's not personal and it's not just me. I am exhausted though. I really, really like working with basically all other coworkers expect for these two. I like the company mission. I just hate feeling completely unsupported by my manager and working with a founder that's like this. Any ideas on how best to cope with this or ways I can somehow make this situation less awful?",
    "title": "How to handle working with incompetent manager and founder?",
    "subreddit": "cscareerquestions",
    "timestamp": 1621302200,
    "score": 3,
    "keyword": "woman engineer"
  },
  {
    "text": "Struggling to Find the Confidence to Ask People Who Talk Down to Me to be More Polite I work a part time job as IT and am moving into a new job as a software engineer somewhat soon.\n\nAnyways, in this job two people constantly say \"no no no no\" or \"no, bad, wait a second\" like a dog if I try to do something that is wrong. That is not to say what I am doing is right, it is wrong, but wow it angers me when they do this. I wanted to ask my coworker to stop it today when he said it to me but there was a woman in the room we were helping and I did not want to start a fight in front of her.\n\nAll I want to do is just say \"look I understand I am making mistakes but when you talk to me like that it makes me feel really insecure, so can you please stop?\" and I cannot find the courage to do it. I just always sit there and take it, its a bit annoying. These people are all higher up than me, one is my coworker (1 position above me) and the other is the 3rd highest in the company.\n\nKind of posting this to vent and also wondering if anyone has been in other situations",
    "title": "Struggling to Find the Confidence to Ask People Who Talk Down to Me to be More Polite",
    "subreddit": "cscareerquestions",
    "timestamp": 1620167734,
    "score": 3,
    "keyword": "woman engineer"
  },
  {
    "text": "Should I quit my first engineering job? TLDR: first engineering job is toxic and I feel isolated and depressed. Got stuck doing shitty work and not learning. Working with senior dev who drives good engineers away and management has no intention to address it. Should I quit and focus on my mental health and interviewing? Or will that hurt my second job hunt a lot 🤔 \n\nHi all. I’ve been in my first engineering job for about 10 months and I’ve been seriously contemplating quitting for about a month. It started off as a good experience because I had a great senior engineer mentor on my team but once she left I realized that she shielded me from working with the senior developer who everyone dislikes. She left during a reorg where both my supportive manager and coworkers that I like got moved to a different team and I was left working with people who are all doing their own things. The senior developer is the only one I get to work with and his code is bad, the whole team depends on him, and I got stuck doing shit work for months (moving an app to production) so I basically just spend all day trying to get his code to run on my computer and he’s constantly changing it so I have to constantly meet with him. All of the code stuff I’m doing is shitty configuration stuff and it’s never ending. I’m not learning or building and everyday I have to say “still working on the same thing” in scrum. The senior dev is not friendly, very condescending, mansplained the terminal to me, and basically just does what he wants since he’s been here forever. Adding on to all of that, I started my first job during the pandemic and throughout everything that’s been going on with BLM, Stop asian hate, etc. no one on my team talks about what’s going on. Add on to that that I’m the only woman of color on a team of 20 men and I’ve started hating and resenting my job to the point where I have crying breakdowns everyday. I’ve also expressed my frustrations to my manager months ago and asked to get put on a different project but nothing has happened. I hate the company culture and a bunch of people have left my team as well. I’ve given up on pushing for change here and I’ve started job hunting. I’m trying to hold out longer but part of me is wondering if I should just quit and focus on my mental health and interviewing. I have about 3-4 months of savings saved up as well. I’m mostly concerned about losing negotiating power or having to job hunt/explain my situation in interviews. I’m also concerned about not having my first job tenure be a whole year & the idea of potentially not finding a job for months. Any thoughts? I’m trying to hold out but my mental health is worse than it’s ever been. \n\nAdvice would be much appreciated especially from people who have found a second eng job during Covid!",
    "title": "Should I quit my first engineering job?",
    "subreddit": "cscareerquestions",
    "timestamp": 1620355700,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "How to catch up after career change? Hi,\n\nI'm a 35 year old woman, about graduate with an eng/cs degree. I've secured a graduate role in a top tech company after having done an internship there previously. I'm applying for other graduate programs as well, as the tech company is not my preferred choice although the salary is very good and it is probably wise to take it. \n\nAs a career changer, I'm very conscious of the fact that I have less time to develop a successful career. Coming from a completely different background, I feel that I have to work so much harder to catch up on the years I wasted in my former (unrelated) career.\n\nWhat can do to accelerate my career and make up for lost time? I have no kids or family, so I'm happy to work 80-100 hours a week. I'm happy to work 24/7, travel anywhere and never take leave if it will benefit my career. I've also put in an application to do my masters in the evenings online (although people say a masters makes little difference). My ultimate goal is to start as an engineer, and work up to CTO, executive partner or even higher,  and do so as quickly as I can. It is not the money, it is thought of being successful that drives to be so ambitious. I don't want anything else in life.\n\nFor people in the industry, what can I do given that I am starting my career so late? What can I do to better my career given that I won't start the graduate program until Jan next year? Is it too late for me to achieve any of these goals? Thanks",
    "title": "How to catch up after career change?",
    "subreddit": "cscareerquestions",
    "timestamp": 1617352770,
    "score": 0,
    "keyword": "woman engineer"
  },
  {
    "text": "How to Make the Most of 6 Months? First off, I just want to apologize if this is not the right place for this kind of post. This post is not for people to tell me what to do with myself and my career, rather, I want to get lots of different insights and opinions into my situation and then make an educated decision based on what's best for me.\n\nThe situation is this. I am a recent graduate of a rather decent CompSci school and now have a few months in front of me of idle time. My gf of 3 years is going to graduate school and has gotten into schools in Pittsburgh, Atlanta, Washington DC, and even NYC. She has not made a decision as to where she wants to go, and most likely will not for quite some time, so I haven't been applying to jobs simply because I don't know where I am going to end up in a few months. For the people that think that I shouldn't follow my gf or make a decision based on her: that's not an option. I love this woman more than anything and would follow her to the end of the Earth. We have done long distance before and that is not something I want to do again. I want to be able to be there for her and to support her, and that's simply something that I can't do long distance, that's non-negotiable.\n\nNow what I would love some insight into is what to do with these next few months. I want to make myself as competitive as possible of a candidate for wherever we end up going. We will not be moving till the summer (she starts school in the Fall) so I have a few good months to get myself as competitive as possible. My plan is this:\n\n&#x200B;\n\n* (Already started working on this) Work on leetcode/code wars -- I hope to be able to do some medium problems by the end of May/June\n\n&#x200B;\n\n* (Already started working on this) I am currently working with a professor from my school on some research work, hoping to be published before we move so that I may some day be able to attend graduate school myself\n\n&#x200B;\n\n* (Not yet started) Study for the OSCP with the three month access package and take the test before moving\n\n&#x200B;\n\nThe major thing I am unsure about is the OSCP. I have taken security classes, and done well in them, and I want to get into the security field of Computer Science if possible, however, I am unsure about how to get a foothold in the industry in an entry level position. I am not gunning for a Pentesting position as my first job, however, I believe that the OSCP would be a good way to show that I have the \"try harder\" mentality that is often cited in the security field. Is there some other certification I should try for first?\n\nThis is the only time in the near future I see myself having the flexibility for a few months needed to dedicate about 6-8 hours a day for studying for a certification, so should I just knock the OSCP out now while I can?\n\nI am also not opposed to having a software engineering job, in fact I already have a software engineering job lined up for me in ATL, they are just waiting to see if I end up living there. Is there anything I can do to make myself more competitive for these kinds of jobs?",
    "title": "How to Make the Most of 6 Months?",
    "subreddit": "cscareerquestions",
    "timestamp": 1612627791,
    "score": 0,
    "keyword": "woman engineer"
  },
  {
    "text": "Diversity & Inclusion I just got the most uncomfortable diversity and inclusion in my life. Basically just openly pointing to white men being problematic.\n\nAt my previous company half my group was a racial minority. Most of the managers in my direct line of reporting were women. One was even a woman of color. They did a great job of promoting inclusion in a manner that didn't put anybody down.\n\nEDIT:  Since so many of you have commented this. I was highlighting that having a diverse manager made the employees hired in the group more diverse. I apologize for not making that clear. Additionally, Half of all managers at that Engineering company of almost 10k employees were women.",
    "title": "Diversity & Inclusion",
    "subreddit": "consulting",
    "timestamp": 1621366123,
    "score": 39,
    "keyword": "woman engineer"
  },
  {
    "text": "Feeling ugly and undesirable as a black woman. Hey everyone this is my first time posting on here and I'd like to ask for some advice. I'm a 25 year old black female going to school at a predominantly white college. I come from the Caribbean(Jamaica to be exact) where it's mostly black people and I'm having a really hard time making friends with other black people. It seems to me that the few black people who live in this neighborhood don't actually mess with other black folks especially the black men I come across. They tend to ignore you completely or if you speak to them they are very passive aggressive. I also noticed that when they speak they speak with a Caucasian American accent and for the most part every black guy I see only has white friends or they only date white women. I think this is kinda bizzare I'm not saying that people can't date who they want but it's so odd to see other unambiguous black people completely disassociate themselves from people who look like them. Idk how to explain how isolated I feel. \n     I do chemical engineering so my class is pretty much all white men I'm the only black woman in my class. There were 2 black guys in the class so I sat next to one of them hoping I could make friends. The teacher told everyone to partner up with the person next to you and he literally went out of his way to try to avoid me even though I was the one sitting closest to him. By the time I came to class the next time he had switched seats just to avoid me. I cant fully explained how worthless he made me feel. I was reading something on reddit where people were talking about an interview with Gabriel union. She said when she was young she would go out of her way to avoid other black people and only hang out with white girls. She said she didn't want to be looked down upon like the white girls looked down on black women so she would avoid them at all cost so she wouldn't be isolated by her white friends. This is the first time in my life I've ever come across black people who didn't like other black people. Don't get me wrong I don't expect you to be my new bff but at least don't treat me like I'm less than you. I feel like some of these black kids grew up in a predominantly white school so they don't have the same experience like other black people so they think they are above you or think racism is just all in your head. \n    My question is have any of you gone through this and do you have any advice for how to deal with microaggression from white people and having no solidarity with other black people. This morning I was driving to work and I saw a black girl in the car in front of me. When I looked on her bumper it was a ton of pro trump stickers......I feel like I'm in the Twilight zone cause nothing here makes sense. Btw I moved to Alabama without doing much research I was so happy to get accepted at a college that I didn't even think of the people there. Oh one last thing I was in the supermarket shopping for groceries a couple weeks ago there was a black guy with his white girlfriend standing in front of the milk I was waiting for them to move so I could grab a gallon for myself. And this dudes gf gave me the nastiest look when she saw me it was one of those looks like \"yah bitch Ik you're jealous of me\"....... But in actuality I not even mad he's with her neither do I have any desire for the guy she was with I was just trying to get some milk and they took forever to move... The black guys are passive aggressive and so are their gf's. I'm sorry this post is so long but I'm just so genuinely confused by it all. These days I feel so ugly and undesirable people having me feeling in some kinda monster people should avoid. This is my first time truly experience discrimination for my skin color so it's all so traumatizing idk how to manage it. 🥺 Please I need some help.",
    "title": "Feeling ugly and undesirable as a black woman.",
    "subreddit": "blackladies",
    "timestamp": 1623873865,
    "score": 43,
    "keyword": "woman engineer"
  },
  {
    "text": "Looking to hire someone for a quick sound engineering/audio editing job? I need my audio edited on a video series for my students, and I wanted to hire another black woman specifically!  Hi everyone! I'm a black woman myself who runs a nonprofit where I teach homeless youth how to program in order to help them escape their homelessness (since it's what helped me!). I'm currently working on a video series for my students, as I like providing them with multiple ways to learn, and I've realized that I'm bogged down for time and other speaking engagements. I want to hire someone to handle my sound engineering for me; In short, I'm recording one long take for each video, and you need to cut out the mistakes and trailing sounds, and just all-around make my audio sound good.\n\nI specifically wanted to hire either someone on the spectrum (it's another demographic I belong to) or a black woman! It's a really quick job, and we'll need to turn over a lot of audio for these videos in a few days. If you do well, I have more content that I need edited, so it can turn into continuing work. It'll be a plus if you know how to video edit, because I'm eventually hiring someone for that too (I'm handling it for now, as it's what my budget allows).\n\nIf you're interested, please comment below, then DM me, and please come through with samples of your work, detailing what parts you worked on specifically (links to those projects are good, but a website also works too!)\n\nThanks in advance!",
    "title": "Looking to hire someone for a quick sound engineering/audio editing job? I need my audio edited on a video series for my students, and I wanted to hire another black woman specifically!",
    "subreddit": "blackladies",
    "timestamp": 1631913664,
    "score": 46,
    "keyword": "woman engineer"
  },
  {
    "text": "I’m a female for Men’s Rights As a woman engineer who has undeniably benefited from affirmative action programs and did very well in school. However, I don’t think it’s right. Sometimes I wonder how much of my success is my own merit and how much is political. \n\nI have a 1year old baby boy and I’m worried for him. I worry that he will grow up being told that everything he accomplishes is because he’s a white male. I want to give him all the advantage I can, but I worry that will make people say he doesn’t deserve success or happiness. \n\nI don’t know how to make this better for him or for other men who have to sit quietly while society tells them they aren’t important or worth of recognition anymore.  \n\nBut I just wanted to say something, and I don’t think it’s just men who feel this way either",
    "title": "I’m a female for Men’s Rights",
    "subreddit": "MensRights",
    "timestamp": 1620482075,
    "score": 2039,
    "keyword": "woman engineer"
  },
  {
    "text": "Mansplaining 101 So, some woman made a chart that helps her male coworkers to determine whether they are mansplaining or not. \n\nI pointed out in the comments that this means that if I explain technical details or terms to a newly hired and completely green young woman, I'm \"probably mansplaining\" according to the chart. \n\nIn my field, if I explain something to a younger, new engineer, I'm being a good mentor. If I do the same with a peer, I'm knowledge sharing. If I do it with a woman, I'm a bad bad cis white male who is mansplaining. \n\nShit like this makes me want to not help women and just let them figure stuff out by themselves. \n\nIf I start to explain something to a male coworker that he already knows, he'll just say \"oh yeah, I already know about that\". The end. \n\nBUT! Do the same with a female coworker? MANSPLAINING!\n\nYou just can't make them happy. \n\nSee the chart and my comment here:\n\nhttps://www.reddit.com/r/WhitePeopleTwitter/comments/qsw3z4/this_honestly_helps/hkger6x?utm_medium=android_app&utm_source=share&context=3",
    "title": "Mansplaining 101",
    "subreddit": "MensRights",
    "timestamp": 1636829856,
    "score": 658,
    "keyword": "woman engineer"
  },
  {
    "text": "[RANT] I'm tired of men getting verbally abused by feminists online or in person; modern women don't realize how valuable men are to society. It's always the kill all men and the we don't need men we can reproduce with \"bone marrow technology\", which is funny because men need women to reproduce while women NEED MEN TO SURVIVE. It's because of modern conventions that feminists think they can survive without men. They have these delusions of being independent of men while waking up to their phone alarm, taking a warm shower and driving to work. The world was created by men and everything is run by men, and its not sexist, it's by FEMALE CHOICE. I'm sick and tired of men getting disrespected by feminists. Men die at war to protect your freedom so you can speak your mind. Men risk their lives protecting the streets so you can be safe. Men work dangerous jobs so that you can have running water, gas, heat, electricity, food and a roof over your heads. Men gave rise to modern medicine so you don't die from a flu, pharmacology so you can control your pregnancies, engineering so you can cross a continent in hours, physics so you can survive a high speed crash, architecture so you don't get trapped under rubble, and math so you can use the supercomputer you have in your pocket right now. WHAT WOULD WE DO WITHOUT MEN?? WHERE WOULD THE WORLD BE WITHOUT MEN? Because even though we have one of the most egalitarian societies to date, women STILL avoid these jobs. Men deserve the ultimate respect.\n\nWhile I was scrolling through reddit I saw this post: [https://www.reddit.com/r/MensRights/comments/qerk7l/woman\\_on\\_twitter\\_claims\\_feminists\\_only\\_want/](https://www.reddit.com/r/MensRights/comments/qerk7l/woman_on_twitter_claims_feminists_only_want/)\n\nI scoffed in anger. Are feminists really that arrogant that they think they can nihilate men in WAR, especially a war that is fought with spears and swords? This post beautifully highlights the true underlying intentions of feminisms; it's not about equality, its about revenge. \n\nAnyways, I just wanted to get this off my chest, since my family members and friends are very liberal. I'm really sick of this pointless gender war. I wanna hear your thoughts about male abuse in modern day society. And remember, if a feminists comes up to you, arguing about how society doesn't need men, she is probably on her period and using a tampon (brought to you by men).",
    "title": "[RANT] I'm tired of men getting verbally abused by feminists online or in person; modern women don't realize how valuable men are to society.",
    "subreddit": "MensRights",
    "timestamp": 1635544757,
    "score": 205,
    "keyword": "woman engineer"
  },
  {
    "text": "Recruitment Discrimination in Engineering Hi people, just wondered if anyone else had come accross this kind of discrimination?\n\nI work in oil and gas / engineering. \nA recruiter recently told me that if 100 people applied for a job and two of those applicants were female, the famales would get interviews EVERY TIME. \n\nThis is regardless of whether the woman were better or worse than their male counterparts. \n\nThe companies just want to be seen as diverse and to be able to have “we support women in engineering” on their advertisements because it looks good for marketing to a 2021 audience. \n\nHow is this equality? \n\nSurely their efforts should be placed on making sure more women apply for the jobs in the first place. Instead of preventing two more talented / qualified male candidates from getting a position.",
    "title": "Recruitment Discrimination in Engineering",
    "subreddit": "MensRights",
    "timestamp": 1635911573,
    "score": 206,
    "keyword": "woman engineer"
  },
  {
    "text": "I may be (falsely) accused of assault, and I’m scared to death I just got out of this mess happening and thought I needed to vent a bit to get this thing out of my mind and move on with the movie I was watching beforehand\\*... So I, a 5’5 (165cm) engineering student, live in a condo (many houses enclosed by a wall) with my family for the time being during the pandemic. My brother was playing football in the courtyard when out of nowhere a dog comes running in his direction and grabs the ball out of his feet and proceeds to destroy the ball. We my family is pretty close to our neighbors, and the dog was not familiar (which directly led him to think it might have rabies, which is why we didn’t fight back). He get’s home, is very sad and irritated because it was his only birthday present for last year (of course no party thanks to COVID) and says the dog is still in the courtyard and is worried he may go after the balls that were still there from the younger kids from the other side of the street. My father, who has a history of very complicating diseases and if catches the virus is sure to be dead within the week, goes out to help me pick up the other balls and we proceed to lock the dog in the court to keep it from running away before we find it’s owner.  \n \n\nRight after we do that, we hear one of our “what pandemic?” female neighbors who parties every week coming out calling the dog’s name and, obviously, does not have a mask on. I repeat 5 five times calling her to “put your mask on” as she hurries down the hill. She stops, no more than 30cm (1 foot) from my face when I tell her “will I have to hold you back?” and she replies with “If you touch me, I’ll call the cops on you!”. Nervous but level-minded as I could be, I reply with “No problem, now put on your mask”. She goes right back to her house, picks a mask, goes down the hill no problem and I even make sure to get at least 12 feet away from her. She picks up her dog, says we can put the destroyed ball on her mom’s check, and we both head back to our respective houses.  \n \n\nNow, it is important to point out that this was only the second time I really interacted with this woman, and the first one was when we she threw a party right when I had just come back from São Paulo doing some volunteering at a hospital there (I’ll just say I could not last long there). It’s also very critical to point out that nobody is vaccinated yet, and she know my fathers medical history pretty well.  \n \n\nA few minutes after we get back, this girl’s mother calls saying that her daughter was threatened by my, that I grabbed her and basically assaulted her. I would not be too worried in many circumstances, but the damn girl in a freaking lawyer with 3 month old baby (who did not deter her from partying like crazy, of course) and threatened to sue me for assault!  \n \n\nAnd the worst part is, my parents are now shouting at me saying that I’m on my own and that the whole judicial system is geared against me, and if there are expenses I’ll have to find a job to pay it. All because I DID NOT WANT MY FATHER DEAD!  \n \n\nI’m gonna be honest that I really want to move out and get on with in-person school as soon as I possibly can. Those friends who really know me know I could not hurt a damn bee if I wanted to (generally I just spend way too much time trying to get them to fly back through the window to safety 🐝) and now I’m scared to death because I now that just an accusation like that, regardless of court decision, could haut me for the rest of my life. According to my parents, she won’t bring charges or anything, but I should not be so scared for my life just because of standing my ground and telling her to put on a mask during a fucking once-in-a-hundred-years pandemic that, may I just remind you guys, has killed more Americans than the entirety of WWII!  \n \n\nI’m just angry, scared, tired and just want to get back to working on telescopes and spacecraft like I was a year ago...  \n \n\nIf you guys have any advice, I would greatly appreciate it. I’m just a young person and have never felt so scared of having been born with the wrong bits down there... If it helps, I’m based on the southernmost state of Brazil.  \n \n\n\\* Just to prove how non-“alpha male” I am, the movie I was watching in Notting Hill (I know, I know)",
    "title": "I may be (falsely) accused of assault, and I’m scared to death",
    "subreddit": "MensRights",
    "timestamp": 1613867100,
    "score": 41,
    "keyword": "woman engineer"
  },
  {
    "text": "‘Dear sirs’ Does this email opening irk anyone else beyond belief? I work in a male dominated field (engineering) and I get this email opening ALL the time. I have my name and she/her pronouns in my email signature, and even then people still reply to me with ‘dear sirs’. \n\nIt’s hugely outdated and assumes that there couldn’t possibly be a woman on the other end of an important decision making email, or that any supervisor or senior with expertise in this field such as myself would automatically be a man. I can’t stand it.",
    "title": "‘Dear sirs’",
    "subreddit": "Feminism",
    "timestamp": 1639754914,
    "score": 311,
    "keyword": "woman engineer"
  },
  {
    "text": "Comment on the video made on a woman engineer (2nd picture). Backhanded compliment and also bringing men into the picture.",
    "title": "Comment on the video made on a woman engineer (2nd picture). Backhanded compliment and also bringing men into the picture.",
    "subreddit": "Feminism",
    "timestamp": 1629832593,
    "score": 285,
    "keyword": "woman engineer"
  },
  {
    "text": "How long till misogyny will at least stop being normalised....? Not exactly writing up a rant but I honestly do not understand what to expect from the 'world' out there anymore...\n\nSo here's a link to the lovely article that has excruciating details of what treatment a hard working/ capable woman employee (who was probably hoping to excell in her field or just invest her energy & efforts into her work) was subjected to, at a very 'promising' organization...\n\nhttps://www.vice.com/en/article/wxdn3x/ex-spacex-engineer-claims-elon-musk-is-sadistic-misogyny-is-rampant?utm_source=reddit.com\n\nTo write highlights,\n• The \"intern\" himself did not hesitate in being utterly unconcerned of a someone's dignity - groped her (This tells us how encouraging the existing culture is  for someone new to have the balls to do it)\n• Colleagues made sexual advances throughout her tenure\n• Subtle molestation here & there\n• All incidents were reported but nothing done, no action taken. (I interpret it as \"Focus on better things Ms. Victim, we're meant to do great things here, all this is trivial and that's how we work, better get used to it, it's a part of your responsibilities to endure it\")\n• Colleague tried to break in to her residence at around 4am - not Sure of this one\n\nMy simple concern is, that these so called bunch of genius/ educated/ powerful/ promising/ bright/ 'inspirational' people (men) carry around such deep rooted misogyny in their heads which they don't hesitate in spewing around with their utterly ridiculous predatory behaviour, what can we expect from the \"less intellectual\" aka regular average \"men\"?\n\nIt is often mentioned how these things are \"pretty common\" & how one should \"be a strong & smart woman & know how to get her way\", but it all has started to sound like Bs to me lately & this is exactly my point, that I don't see any betterment until these masochists stop normalising this misogyny...",
    "title": "How long till misogyny will at least stop being normalised....?",
    "subreddit": "Feminism",
    "timestamp": 1639523986,
    "score": 30,
    "keyword": "woman engineer"
  },
  {
    "text": "Molly the Mechanic [https://www.webtoons.com/en/challenge/molly-the-mechanic/list?title\\_no=577981](https://www.webtoons.com/en/challenge/molly-the-mechanic/list?title_no=577981)\n\n[https://www.facebook.com/mollythemechanic](https://www.facebook.com/mollythemechanic)\n\nTLDR: I'm making a comic about my job in the S.T.E.M. (Science, Technology, Engineering, and Math) field, in hopes to interest other ladies, and to provide some media representation that I didn't see growing up.\n\nI've started making this comic after starting a job as an equipment tech in a manufacturing facility. Molly is a character I've made, based on myself. She is a peppy, purple-haired 22 year old who is scared of bugs, wants to put googley eyes on the machines she works with, and LOVES her job. My goal is to introduce high school and college ladies (ANYONE AND EVERYONE who identifies as a woman!) to the big wide world of S.T.E.M., through stories about my job and my experiences. I hope to cover topics like; funny work stories, not funny work stories and times where I have failed, educational explanations of things like DC circuits and fluid power, how to navigate a work environment where there is sexual or gender-based harassment (and how to have hard conversations about it), and more!\n\nA little about me:\n\nI grew up as an artist, a musician, and a hater of math class! I was raised in an environment where \"girly girls\" were often portrayed as cute, pink-loving, humanities-minded people in the media, and not as kick butt S.T.E.M. workers. Every time I did see a woman mechanic or scientist, she didn't look or act like me. I want to change that narrative. I think I would have absolutely loved to learn more about engineering in high school, if I'd seen more media representation of people like me in that role. Not tom boys, working with their dads in their garage. Not super smart \"nerds\" (I say, lovingly), who ace every math and science test they take. Any and all archetypes can and should work in S.T.E.M.\n\nP.S. You'll have to forgive me, I have never done electronic drawing before the start of this project, and my skills have progressed a lot! However... I can't say that my earliest posts are the best quality. I don't have time to make new episodes and also fix the old ones. Have mercy with your art critic comments <3",
    "title": "Molly the Mechanic",
    "subreddit": "Feminism",
    "timestamp": 1615566314,
    "score": 4,
    "keyword": "woman engineer"
  }
]