[
  {
    "text": "Graduated college but having trouble finding a good job. Should I join the military? I'm a 26 year old woman in Florida, I graduated with my Bachelor's of Science in Psychology exactly 1 year ago now. Before I went to University I worked for several years in cell phone sales and did alright but always wanted more for myself than to become a retail manager. I genuinely wanted to become a psychologist or a therapist but I underestimated how much school actually would cost me both financially and energetically--by the time I graduated last year, I was fully burnt out on the student life and 30k in federal student loan debt. I was eager to find a good job and start working and making money, and although I attended some job fairs at my University, I really did not see much that I really wanted to do or was qualified to do.\n\n Part of the reason I chose Psychology (instead of something more marketable like Health/Nursing or Technology) is because I have very, very weak math skills, but my reading/language skills are through the roof. I literally practically failed the math portions on the SAT/ACT but was in the top national percentile of the reading/writing/language portions of the tests, which is how I managed to even make it into college at all.\n\nSince I've been graduated I have avoided going back to typical retail jobs or jobs at the mall and tried to focus on more professional roles. I tried a call center job briefly during college (awful). I served as a substitute teacher for several months before I realized I don't actually want to be a teacher (the public education system is fucked right now, seriously) and it would ultimately cost me a couple thousand to get certified as a real teacher and recieve the pay and benefits (I have no money and no credit options, and no interest in taking out more loans). \n\nI decided to get certified to work in insurance so I studied for about a month, got a 4-40 license, and worked for a few State Farm agents. I can't even explain how ridiculous my experience with SF agents has been, the most weird employment where the businesses are failing or only a few years old yet the agents are only in the office a couple hours out of the day or don't come to work at all, yet are upset wondering why they are at the bottom in sales in the area. Weird office politics where there's one older person basically running the office for the agent and one spanish person to handle the spanish customers but otherwise extremely high turnover in the office. One office I worked for, the agent told me she had 30 employees come and go in the last two years, but had no idea why (because she was literally only in the office one day a week). A different agent convinced me to decline a job offer with a different company so I could be the only sales person in his office (more money for me and less competition) and then fired me two weeks later (over text message) after paying me half of what we agreed on and having no reason or explanation for what I did wrong besides \"you're just not a good fit\". I even asked for constructive criticism and he refused to give any. Very confusing, infuriating and weird! \n\nAt this point I'm just very frustrated, broke and losing hope in my job search. I always played with the idea in my mind of joining the military  to get some experience, structure, travel, benefits, etc. But if I'm being honest, I'm a hippie and I don't bleed red, white and blue like I know you probably should if you're going to serve. Still, the idea of going on an adventure and getting in better shape, meeting loads of new people, gaining new skills and hopefully making it through the four years with a GI Bill and some benefits at the end, seems like a much better deal than sitting on my computer everyday shooting off emails and applications for $10 - 12 an hour jobs, having no health insurance, and just feeling like a loser. I live with my boyfriend and my lack of stable income is killing our relationship with stress, seems like we'll probably break up soon. My mother died last year and no one else in my family really seems to care at all about me. If I die, I'm pretty sure only my grandfather would be hurt, but he is very old now and will probably pass away soon. I don't feel I have as much to lose as I have to gain.\n\n Should I do it or is it a bad idea?\n\nTl;dr: Graduated college a year ago, a good job with a good company has been difficult. My family is pretty estranged from me and my relationship is on the verge of breaking up anyway. Should I go join the military?",
    "title": "Graduated college but having trouble finding a good job. Should I join the military?",
    "subreddit": "jobs",
    "timestamp": 1560025629,
    "score": 37,
    "keyword": "woman nurse"
  },
  {
    "text": "Doctors and nurses of reddit, how do you emotionally handle it when a woman has miscarried?",
    "title": "Doctors and nurses of reddit, how do you emotionally handle it when a woman has miscarried?",
    "subreddit": "AskReddit",
    "timestamp": 1575779733,
    "score": 4,
    "keyword": "woman nurse"
  },
  {
    "text": "Delivery room doctors, nurses or husbands what’s the funniest/strangest things you’ve heard a woman in labor say?",
    "title": "Delivery room doctors, nurses or husbands what’s the funniest/strangest things you’ve heard a woman in labor say?",
    "subreddit": "AskReddit",
    "timestamp": 1550181238,
    "score": 3,
    "keyword": "woman nurse"
  },
  {
    "text": "Texas lawmakers advance bill that could make abortions punishable by death -- everyone involved in providing abortion care — from physicians and nurses to patients seeking this type of care — would face murder charges. No exceptions for rape, incest, or cases where woman's life is in danger.",
    "title": "Texas lawmakers advance bill that could make abortions punishable by death -- everyone involved in providing abortion care — from physicians and nurses to patients seeking this type of care — would face murder charges. No exceptions for rape, incest, or cases where woman's life is in danger.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554943566,
    "score": 16695,
    "keyword": "woman nurse"
  },
  {
    "text": "I am NOT the help My boyfriend lives in a swanky neighborhood complete with guarded access. Every time a new guard is on duty and I roll up in my non-luxury car, I’m asked if I’m from a cleaning service. \nAs a black woman I cannot tell you how infuriating it is to be mistaken for the help. When I’m with his grandmother at her doctor’s appointments or with her as she’s visiting with friends then I’m a nurse or a hired companion. When I’m with his sisters then I’m a nanny. I could perhaps live with these racist slips but it also happens at work. I’m studying for the bar and I cannot tell you how many people assume I’m a defendant if I’m in court or a mere paralegal if I’m in an office. \nI wonder if I’ll ever been seen as the kick ass black woman that I am and not some nanny, maid, or defendant.",
    "title": "I am NOT the help",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1555772726,
    "score": 15676,
    "keyword": "woman nurse"
  },
  {
    "text": "I was not able to afford an abortion. I gave birth to my first son while I was homeless, in an abandoned apartment. I should have never been a mother in the first place. Since I see others doing this I guess I will too. I’m not a political person really and normally I don’t really care about shit like this but lately I have been reading stuff and I figure if my story could raise awareness for why it’s important for women to have abortions then I’m okay with that.\n\nGrowing up I was in foster care. Before I turned 18, my foster mom let me know that I would have to move out as soon as I was legal age. I didn’t have a great relationship with them and really, I had no relationship with anybody. I had no friends and I had also dropped out of school because I was bored. That’s not exactly the recipe for success when you’re about to be out on your own. So I became homeless. It was better than staying at my foster home since sometimes they beat on me.\n\nI adapted well and honestly I didn’t mind living that way. I’d sleep anywhere or with anybody... I just had fun. Then I got pregnant. From a guy I met off here actually. He messaged me and we met up and started having sex. I liked him but it wasn’t serious. When I found out later, I was dumb enough to think that we would be a family. He’d have to take care of me right? I was carrying our baby that he had helped make. I was completely wrong. This nice, sweet guy who had messaged me online and who was a fun hook up, immediately turned into a jerk. One of the last things he said was, “I don’t care if both you and your kid starve to death.” When I asked if he’d help me pay for an abortion, he said I was a liar and a slut and that it wasn’t his kid and I was trying to use him for some cash. Once again, I had no one and nobody. I wanted an abortion but I didn’t have any money or support. I was homeless with no job. I felt like I had no options.\n\nI was too scared to go to a hospital because at the time I was convinced they would take my baby away. I grew up with social services so I knew how that worked. Looking back I was misinformed. But when I was 20 years old, I ended up going into labor behind a dumpster. I gave birth to him in an abandoned squatter apartment. I wrapped him in a towel I had found. That’s how my son was born.\n\nI was never meant to have a kid. I wasn’t prepared to have a baby. I slept with guys to get food because I had to eat to be able to nurse my son. When I couldn’t feed myself, I would just steal formula from the store. Some nights I would hook up with guys just to have a place to bring my kid that was warm. That’s the reality. I was not prepared to raise a child.\n\nI wasn’t prepared to get pregnant again either. But I did. I had another baby, my second son. After that, I realized that I couldn’t raise two kids on the street. I have a job now with a place to live. I can feed my kids but that still doesn’t make me a great parent. I’m not a good mom. But I do okay. And although both my kids don’t have a dad around, I don’t really think they notice (not yet at least lol). One thing I never could have done was give them up for adoption. I was in the system and I know what it did to me. I could never abandon my kids.\n\nBut I honestly wish I could have had an abortion. I had access to clinics but couldnt afford one. I had no information. I didn’t know what to do. The point is that if I had a rough time getting one, girls in other places like Alabama where it’s going to get banned are going to have it even worse. We are not all meant to have babies. We are not all meant to be mothers. Some think if you have the baby and keep it that it will come “naturally” to the woman and she will love her baby and oh yay! A life is saved. But when you think about an unborn baby you aren’t thinking about the woman who has to care for that baby. We all have to start thinking about that.\n\nUpdate: thank you for all the stories and comments. I am still reading. I wasn’t even going to post my story bc I honestly didn’t think anyone would care or believe me or would judge the fuck out of me. Some did and that’s ok but most of these comments were really sweet :) Thank you.\n\nEditing again: I find it very telling that most of the rude comments are from men, asking me why I didn’t keep my legs shut, why I didn’t use a condom, and why I’m a crappy mom. I keep checking the posting history and it’s always a man telling me these things. It’s also these same men that are messaging me and asking me for nudes or asking if they can teach me a lesson for being such a whore. Interesting.\n\nJust something to think about.",
    "title": "I was not able to afford an abortion. I gave birth to my first son while I was homeless, in an abandoned apartment. I should have never been a mother in the first place.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558537336,
    "score": 13829,
    "keyword": "woman nurse"
  },
  {
    "text": "Today I Found Out I Don't Have Breast Cancer, While Another Woman Found Out She Did I was called into the doctor's office as a follow-up to the conclusion that I have cancer in both breasts to talk about what the plan of action was going to be for me.\n\nMy doctor gets pulled aside by one nurse, and she frantically whispers to him while holding a folder in her hands. He sighs in a way that seemed to be out of sadness instead of annoyance, as he took the folder out of her hands and handed her the one on the counter top that had my X-rays in it.\n\nThe nurse dashes off as my doctor sits back down and looks at me dead in my eyes as he says,\n\n\"There's been a mistake.\"\n\nI was shown my real X-rays and they were clear from any tumors or anything. Clear in Betty (the bigger one) and Tina (the smaller one).\n\nThe X-rays of myself and another woman were switched, somehow.\n\nIt was such a bittersweet thing to feel. Relieved that I wasn't diagnosed with cancer at 18, but still regretful at feeling that way because someone else received the worst news of their life. Who am I to be relieved? \n\nEven worse since I knew exactly who it was, a woman I had sat next to while waiting. Same last name, with the same first initial, which is what I learned the office organized by (why not the full first name I don't know). She is a wonderful mother of 3 and still has a successful career despite the odds of the expectations of her time  that wives are to be housewives. We talked to deal with our nervousness about the situation, and we walked out friends after 3 hours of combined waiting over 4 visits.\n\nI didn't see her before I went home today, but I hope she kicks cancer in the ass like she did all other things that stood in her way in life.\n\nI'm not religious, but God bless you Adelaide.\n\nEdit: Some people have been actually sending me a lot of messages *and* leaving some comments on the integrity of my post. It is a somewhat unbelievable, one-in-a-billion experience, so that is all fair. So I'm just going to answer all the question marks here and now. If anyone has any further questions, you are welcome to ask respectfully. \n\nA lot of people questioned how Adelaide and I have each other's numbers is as simply put is that when you are sitting waiting for a long while with not much to do, any conversation is welcome. We weren't talking about little small talk things like the weather, we had genuinely deep and meaningful conversations where we really learned a lot about each other even if the time was so short. She offered me her number and I gave her mine. I feel that people are sometimes overly cautious about other people. Like what is an she going to do with my number, in a malicious sense? I don't have any reason to do anything bad with hers either.\n\nAnd then let's get to how I don't know what the doctors were doing to me as far as mammo/ultrasound on the breast and biopsies. I didn't do research on the process of how to achieve a diagnosis, I did research on the possibility of the lump I had found being cancer for a woman my age. I was focused more on the what than on the how do we resolve the what if that makes any sense. I am the kind of patient that won't question what you're doing as long as it seems pretty legit to me, I just want you to get the information that you need so you can help me get better. I asked my mom, she described two different things as a mammo, and the person who did my \"mammo\" called it a mammo so I was under the impression that it was a mammo. \n\nThen onto how Adelaide and I happened to have the same appointments, for me the one day a week I have off is the day that she goes into work later than usual so she can squeeze in the appointment then. It wasn't perfectly the same time every time, there was one occasion where I was going to leave and she was coming in, and we stopped and had a quick chat before going on about our days.\n\nI'd really appreciate it if you all could hope for Adelaide's return to good health, this is what's the important matter here.\n\nBelieve me or don't, that's your decision and all decisions are fair.\n\nHave a good one, and please keep tabs on yourself and your health. If it wasn't for me randomly brushing a lump I would have never thought of anything like this could be.",
    "title": "Today I Found Out I Don't Have Breast Cancer, While Another Woman Found Out She Did",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1564655741,
    "score": 7793,
    "keyword": "woman nurse"
  },
  {
    "text": "Nurse at Arizona health care center charged with sexual assault after incapacitated woman gives birth",
    "title": "Nurse at Arizona health care center charged with sexual assault after incapacitated woman gives birth",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548260487,
    "score": 1458,
    "keyword": "woman nurse"
  },
  {
    "text": "PSA: LISTEN TO YOUR BODY **TLDR: I had remnants of a broken-down tampon in my cervix, which caused a pretty bad vaginal infection that could have turned into Toxic Shock Syndrome.**\n\nHi all, this is my first post here so I hope you can be understanding, kind and learn something from my experience today. I know it may seem like common sense but even if it helps one woman on here, it’s worth it.\n\nTo preface, I am a 26F, work a full-time job. I have an IUD (Mirena), struggle with anxiety and depression that is currently treated with Zoloft. I am very adamant about my personal hygiene and make sure to have a supply of pads, tampons, sanitary wipes, Advil, and other things to help when my time of the month hits..  but also because I try to take pride in how I present myself to the world and don’t want to smell like a fish market.\n\nFor the past month and a half - since mid-May - I have been struggling **heavily** with my depression, anxiety, and general health and motivation, way more than usual.  Usually I keep a positive attitude and have several interests outside of work, but this was different. I was feeling absolutely shitty, my muscles were sore, my body ached, I was stress eating and gained several pounds. I was grouchy, sad, and pessimistic; I would come home from work, take a nap for three hours, then stay up a couple hours and then go to bed for the whole night. Repeat the cycle daily until I had no interest whatsoever in any of my hobbies, chores, to-do lists... just avoiding all but the most necessary tasks to get by with life. I was completely miserable, thinking I was just getting over my nasty cold I had that month too.\n\nAlong with the mental and physical setbacks, I had the worst problem of discharge, odor, itchiness, and spotting. I thought that I obviously had an infection at that point **as the icing on the cake for my other issues** but couldn’t get in to see my usual gynecologist for several weeks. So I tried some over the counter medicine and it helped with the itchiness and odor, but not the discharge.\n\nThrough my work, I have access to a nifty app where I can instant message a licensed doctor and discuss my history, symptoms, and they can prescribe me medication. It helps to not have to schedule an appointment, wait an hour, take time from work, then have them Google it in front of you (this happened to me before, not cool to do it in the room with me).  The Dr. thought it was [bacterial vaginosis](https://www.cdc.gov/std/bv/stdfact-bacterial-vaginosis.htm) and prescribed me an antibiotic to help. \n\nIt did help calm down the discharge and odor, but it came back a couple of days later in full force. At this point I thought it was my IUD - there were recent class-action lawsuits for these symptoms and I thought I was one of those unlucky people.  My husband told me he was really concerned for me, noticed my struggles and said he wanted me to schedule an appointment with someone else until I can see my usual doctor. So I remembered Planned Parenthood from my pre-health insurance days and set up the soonest checkup I could, which was tonight (Thursday).\n\nThe nurses there were wonderful - they were so understanding when I told them my story. They assured me they’d do what they could to help my lady bits, so into the stirrups I went.\n\nThe one thing you don’t want to hear from a nurse probing your coot-coot near your poop-chute is an audible *gasp*. While she was examining my vagina and cervix, she found broken-down bits and fibers of a tampon. How this happened in the first place is beyond me - I try really hard to make sure I clean my cookie. But somehow a tampon was missed and my body spent 6 weeks attempting to break it down and dispel it the only way it knows how - using the discharge and spotting. It had been 6 weeks since my last period and I thought everything was fine, but clearly my body was trying to tell me otherwise.\n\nIt turns out that I did have bacterial vaginosis, and the original antibiotics helped. But because the tampon matter was still stuck in me, I was quickly reinfected.\n\nShe immediately got another nurse and they had already checked my temperature, my heart rate, and my swabs to confirm the above diagnosis, but they were amazed I didn’t have [Toxic Shock Syndrome](https://wwwn.cdc.gov/nndss/conditions/toxic-shock-syndrome-other-than-streptococcal/case-definition/2011/). If I had waited until my July appointment, it very likely could have gone that way.\n\nThey had to MacGyver one of their abortion suction tools and use saline solution to help move the matter along and get it out. While I was in the stirrups they were strategizing how best to proceed with different sized tubes and different angles. It didn’t hurt, but it wasn’t pleasant. They said it didn’t go all the way into my cervix, just in the entrance and the walls of my vagina. My IUD was right where it should be, strings in place, all was well there. They removed as much of the fibers and discharge as they could and sent me home with more antibiotics, which should take care of the rest.\n\nAll this to say, **listen to your body**. I am so glad I had a local Planned Parenthood and two wonderful nurses to help me. And a husband that loves me and was concerned enough to push me to ask for more help. I feel 100 pounds lighter just a couple hours later. I’m not sure if I feel better because I know they cleaned me up and it’s a mental “placebo” effect, or because my body is actually healing from that. So it may turn out that my infection was not the icing on the cake but the cake itself, causing all of my crappy symptoms above.\n\nI will definitely be using pads from now on. I will keep my July appointment as a check-up and see if anything else needs.. MacGyvering.\n\nTalk to your doctor. Actually go and *see* your doctor so they can actually take look at you. And if you can’t, then go to Planned Parenthood- *they’re amazing*. Thank you for reading to this point -  I hope it helps someone else. ❤️\n\nEdit: words.\n\n**Update:** I am literally dancing around my office this morning, to the amusement of my coworkers! I feel 1,000 times lighter. I really appreciate you guys giving me your well wishes, tips and alternatives. I’m glad this community is so supportive and open, and that people can learn and ask their “silly” questions. 💕 thank you all.",
    "title": "PSA: LISTEN TO YOUR BODY",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1561692872,
    "score": 1366,
    "keyword": "woman nurse"
  },
  {
    "text": "I (F28) finally believe that my vagina is not dirty. I was molested as a child. The memories are bits and pieces of blacked out questions of what really happened, but it happened several times, and I'll never forget his face. Therapy and a lovingly supportive significant other, who makes me feel safe and sexy, have helped a lot. I have a normal and happy sex life. But even with this support I had long accepted that my insides are innately... dirty. That most likely my sex parts are diseased, rotting away ever since my childhood trauma. That I most likely will not be able to have children, even though I want to.\n\nI've held onto these beliefs so strongly that I avoided going to the gyno, to the extent that I've only been twice in my 28 years of life. Both experiences were awful. They were with women nurses and doctors who both happened to be in rushes. The pap smear was forceful and both ended up leaving me sore down there for days. They also brushed aside my concerns. I have short irregular periods where I get multiple clots every day I menstruate. My last exam was in 2016.\n\nWith the new turn of the year, I decided to face my fears. One of them being the gyno. So a few weeks ago I booked my appointment. As I was about to hang up, the receptionist told me the doctor's first name - Robert. A man. I paused. A strange man looking down there? Are you kidding me? No one other than my significant other has been down there... not since... that time. So I asked the receptionist to book me an appointment with a woman - but all the women were fully booked out for the next 3 months. I kept the appointment, and spoke to a few girlfriends on their experiences and was surprised to find out that some actually prefer male gynecologists - supposedly they're more gentile and professional. I figured well, let's do this, I want to face my fears then let's fucking do it. Let's try. And if I change my mind last minute then I'll call and cancel and set a new appointment. I kept the appointment with Dr. Robert.\n\nToday was the day. I went into the doctor's office and was greeted by the warmest receptionist. I was taken in back by a friendly technician who not only listened to my concerns, but she wrote them down and let me know the doctor would most likely be interested in doing a bit more testing. Handed me the gown and let me change. By the time I changed, I felt much more at ease with my decision.\n\nThe doctor came in, and to my surprise my friend was right - very professional, no rushing, he took his time and listened. When I told him about my irregular short periods and clots, he offered to do a vaginal ultrasound to make sure there were no growths. The ultrasound... was normal. Everything inside looked perfect. Nothing was irregular shaped, there were no dark splotches all over my uterus like I had imagined, it was perfectly shaped. And my ovaries! I got to see them in the process of actively making eggs. I'm making eggs. I'm normal, healthy, and most likely fertile.\n\nI'm normal inside.\n\nI went home smiling, and then sobbing. For the first time in 28 years... I know that I'm not dirty inside.\n\nWhat happened to me as a child was awful, but it in no way defines me. I can finally know that it has not broken me inside the way I thought it had.\n\n&#x200B;\n\nTLDR: molested, thought I was dirty inside and couldn't possibly have healthy sex organs. Doctor did an internal vaginal ultrasound and showed me that it all looks healthy and normal. My insides are good to go. Then I ugly cried in the car, out of joy.\n\n&#x200B;\n\n\\~edit\\~\n\nJust wanted to say I'm overwhelmed by the amount of encouragement and support I'm receiving from both men and women here. Ugh. I can't. Hope you all get your parts checked by doctors who respectfully listen to your concerns, and that you have happy sex.\n\nAlso wanted to add that I in actuality am not actively making eggs - they're already there as pointed out by u/kelserah hahah. Many thanks for the correction. I'm now just a little bit less proud of my ovaries.\n\n&#x200B;\n\n\\~\\~edit 2\\~\\~\n\nI received some gold for my perfectly normal vag and ovaries, in honor of the incredible people who treated me like a human-being.\n\nMy lady bits are worth gold. haha - thanks [/u/thatpaulbloke](https://www.reddit.com/u/thatpaulbloke) :) I think your bits are worth gold too.\n\n&#x200B;\n\nAlso... I'm really proud of the people who have read this, the people who have opened up... the people who have encouraged me and the people who are encouraged by this. I didn't realize how... not alone... I was in experiencing this.",
    "title": "I (F28) finally believe that my vagina is not dirty.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548968255,
    "score": 992,
    "keyword": "woman nurse"
  },
  {
    "text": "Nurse sends pregnant woman home without doctor review, patient dies of meningococcal sepsis",
    "title": "Nurse sends pregnant woman home without doctor review, patient dies of meningococcal sepsis",
    "subreddit": "medicine",
    "timestamp": 1564437850,
    "score": 588,
    "keyword": "woman nurse"
  },
  {
    "text": "Nurse arrested in case of incapacitated woman who gave birth",
    "title": "Nurse arrested in case of incapacitated woman who gave birth",
    "subreddit": "medicine",
    "timestamp": 1548258681,
    "score": 501,
    "keyword": "woman nurse"
  },
  {
    "text": "Brno University Hospital [Czech Republic] doctors and nurses overwrote the history of medicine. For 117 days they were maintaining vital functions in a pregnant, brain dead woman. Then a healthy baby girl was born.",
    "title": "Brno University Hospital [Czech Republic] doctors and nurses overwrote the history of medicine. For 117 days they were maintaining vital functions in a pregnant, brain dead woman. Then a healthy baby girl was born.",
    "subreddit": "medicine",
    "timestamp": 1567628967,
    "score": 72,
    "keyword": "woman nurse"
  },
  {
    "text": "Unexplained migratory inflammatory reaction in a patient with severe sarcoidosis This is a patient I am currently following that I've been perplexed by, and my staff doesn't seem to have any better ideas than I do.\n\nThe patient is a 56 year old woman with a history of biopsy proven stage 4 pulmonary sarcoidosis (on 3 L baseline) who originally presented with what turned out to be a drug eruption, but has had an interesting course in the hospital characterized by a migratory inflammatory reaction which I cannot explain. She originally presented to her dentist January 8th complaining of tooth pain. He wrote for a course of clindamycin. After 4-5 days, she developed rash on her bilateral hands (sparing the palms). She called the dentist, and he switched her to amoxicillin. She took a few doses, but the rash got worse and progressed to involve her trunk, so she stopped. Wary of medication side effects generally, she started taking her prednisone (prescribed 10 mg daily, long term) more sporadically.\n\nDuring this same period of time, she complained of decreased appetite, new onset dry cough, and severe malaise. She says she barely left her bed for a few days because she felt so weak. She also noticed swelling of her face and right breast, as well as decreased urine output despite large volume intake. No fevers, chills, night sweats, myalgias, arthralgias, diarrhea, abdominal pain, nausea, vomiting, recent travel, sick contacts, outdoors exposure, or pets.\n\nEventually, a relative who is a nurse persuaded her to seek care. Dermatology biopsied her as soon as she presented and we (medicine) admitted her. We checked daily CMPs and CBCs with differential (concerned for DRESS), which were basically unremarkable. LFTs were never elevated, no significant AKI, highest eosinophil count was 1000, which is right in the middle of our reference range. They started her on steroids, and the rash improved over the course of the next week or so. Final path on the biopsy was\n\n> Dermal telangiectasia, neutrophil vascular margination, interstitial eosinophils. These findings would be more compatible with a dermal hypersensitivity reaction including a drug eruption.  These are not the histologic features of erythema multiforme, Stevens-Johnson syndrome.  These histologic features would militate against viral exanthem.  The histologic features of DRESS are variable so that clinical pathologic correlation will be necessary to exclude this entity.\n\nBack to the migratory inflammatory reaction: On presentation, she had visibly asymmetric breasts, right larger than the left, mildly tender but no palpable masses, and mammography was read as\n\n> Bilateral skin and trabecular thickening with mild axillary adenopathy. These findings are compatible with a systemic etiology.\n\nHospital day 2, she developed submandibular swelling, which was also mildly tender. [Contrast CT neck](https://imgur.com/8JkgnBq) showed bilateral submandibular sialadenitis with inflammation of the overlying subcutaneous tissue, no abscess. This has since resolved.\n\nHospital day 4, she had hugely edematous left leg (to the thigh), tachycardia, and acute on chronic dyspnea. Venous duplex was negative for DVT, and CTA chest was negative for PE (I was shocked), but showed new right sided pleural effusion and small pericardial effusion. We have since been diuresing her. Initially, the leg got better, but then it seemed to get worse. Concerned for some other process impeding venous return, we got MRI venogram of the pelvis, which was normal. We have been aggressively diuresing her, and the leg seems a bit better today.\n\nSome other aspects of the workup:\n\n* She had elevated protein:creatinine ratio but negative urine dipstick for protein. UPEP showed mixed tubular and glomerular proteinuria consistent with chronic inflammation with no monoclonal spike.\n* Free light chains both elevated, but ratio normal, and SPEP consistent with chronic inflammation.\n* C3/C4 normal\n* Anti-SSA/SSB: negative\n* IgG4 level: 26 (ref. 1 - 123)\n* ANA panel: negative\n* Mumps antibody: negative\n* EBV antibody: negative\n\nI guess the diagnosis has to be explained by sarcoidosis, but the bilateral submandibular sialadenitis and enormously edematous left leg don't strike me as classic sarcoid, but then again I'm an intern. It just seems peculiar that she's having this apparently migratory inflammatory reaction (face by history, right breast, left leg, possibly right lung, and pericardium).\n\nThoughts?",
    "title": "Unexplained migratory inflammatory reaction in a patient with severe sarcoidosis",
    "subreddit": "medicine",
    "timestamp": 1549144290,
    "score": 19,
    "keyword": "woman nurse"
  },
  {
    "text": "I patient died and I need to talk about it. Today my patient died. \n\nI came onto the floor and night shift was frantic. Phones ringing, call lights alarming, papers all over the place. Not a good sign. I get report for three patients from one nurse, then find another nurse for the other 2 reports. Let’s call her Jen.\n\nJen gave me report on one patient- he’s fine, stable, peacefully asleep. But the second patient... this poor man. Jen gives me report on Jerry (fake names of course), informing me that he has come in on hospice and is suffering from a severe cancer diagnosis. My eyes flicker over to Jerry in the bed, he is tachypneic and pale, his eyes rolling in the back of his head as he moaned in pain. Jen tells me that he’s only been here for about an hour and a half. No family is here yet. No admit can be done as he is unable to communicate. He is alone and suffering. \n\nJen proceeds to inform me that although the doctor has seen him and it is clear that Jerry is on comfort care, no orders are in the computer. No pain meds, no palliative consult, and no code status. With an undetermined code status, the patient will be treated as a full code and will be resuscitated if he arrests. Jen shrugs, tells me good luck, and leaves for the day. \n\nThe first thing I do is call the doctor. He answers after a few rings and manages to groan out, “This is doctor Smith.” Clearly I have interrupted his sleep. “Hi Dr. Smith,” I say politely. “It’s aaaaasowenyaaa from med-surg. I have your patient in room nine that was admitted from the ER this morning, and we don’t have a code status on him. Can you please put in that order along with the comfort care procedures as well?”  The doctor sighs loudly and says, “Why can’t you just put it in yourself? He is a DNR.” I take a deep breath. This is a doctor that won’t do anything for himself if he doesn’t have to. I close my eyes and say, “Look, only doctors are qualified to put in a code status so I really need you to do that. I can do the comfort care if you really need -“ but Dr. Smith interrupts me and says, “I’m busy right now I’ll do it later.” Now I’m upset. This is not the first time I’ve had to confront him like this. “Dr. Smith, if this patient dies and you wait to put in that order then I am required to do CPR. I have to do CPR on a frail old man who is about the take his last breath, whose body is riddled by cancer. Please. Put in the order.” He finally agrees. \n\nSo I sit and click refresh on my computer a hundred times waiting for that DNR to pop up, but it doesn’t. At this point my patient is getting worse, he is breathing less and just looks like he’s in agony. I tell my supervisor and she immediately calls Dr. Smith. Another 10 minutes passes. Finally! The order pops up.\n\nI draw up 4mg of morphine (that’s all I can give so far) and practically run into the room. Now I feel it’s safe to give this narcotic without fear of my patient dying. But he is still. Alive, but still. A woman sits at his bedside now, her eyes red and puffy. “What the hell is happening to my husband?” she manages to choke out. I get a lump in my throat but swallow it down. “You must be Sara. I am so sorry to meet you under these circumstances.” She scoffs as a flood of tears roll down her face. “Let me explain what’s going on,” I begin, but she interrupts me. “He shouldn’t be in this much pain! How could you let this happen? I want to speak to the director of the hospital. I’ve worked in hospice for years and I know he should never be in this much pain. He was fine yesterday! What’s going on?” I take another deep breath. At this point it’s only 8:30, I’ve been on shift for a hour and already I feel the yearn to run home, to leave this place. But I stay. I explain that without the DNR order, if I pushed IV morphine and Jerry’s respiration’s stopped, that I would have to resuscitate him. She relaxes a bit, shakes her head but agrees that Jerry would not have wanted that. I tell her I am so sorry, that I will do everything I can now to make him comfortable, that I am so incredibly sorry for the delay in pain meds. \n\nI step out of the room after settling Jerry and stare at the wall. My heart aches for Sara. This is not the first spouse she has lost and I did not make it any easier for her. Why can’t doctors just put in their fucking orders?\n\nI take some time to round on two of my patients before the call light goes off in room nine. I knock quietly and enter, and immediately I know. Jerry is gone. Sara glances at him then back at me, her eyes desperate for hope, for a little more time. I step out and grab another nurse to assess with me. We both listen for one minute, but there is nothing. No vital signs, no heartbeat. He is gone. I force my eyes to meet Sara’s. Shake my head and say, “I’m sorry. He’s dead.” \n\nThe lump rises back into my throat as his wife gently kisses his head. “You are my best friend,” she whispers. She cradles his head softly and begins to sob, begging him to come back. I stay for a minute with my hand on her shoulder, but its clear she just wants to be alone with her husband. I politely show myself out and tell her that I will call the chaplain and that if she needs anything to just ask. I walk into the bathroom and lose it.\n\nThat patient died a prolonged and painful death. He suffered when he shouldn’t have. His care was delayed because a doctor was too lazy to do his fucking job and put in a simple yet critical order. His last moments with his wife were in agony and that could have been prevented. I work in med-surg, I don’t see comfort care  often, but I know enough to say that Jerry died an unjust death. \n\nThe lump in my throat still won’t go away.\n\nEdit: wow, thank you all so so much for the support and encouragement. i’m trying to keep up with replying but there’s so many of you! i was not expecting all the love. thank you reddit.\n\nEdit 2: the title was supposed to be “my patient died”, guess i was still frazzled when writing it",
    "title": "I patient died and I need to talk about it.",
    "subreddit": "nursing",
    "timestamp": 1556064282,
    "score": 1135,
    "keyword": "woman nurse"
  },
  {
    "text": "Trans Patient Tips from a trans nurse: I've seen some uncertainty in the nurses around me on the floor when it comes to day-to-day management of trans patients. Figured I'd throw my two cents into the ring, since I'm trans and all:\n\n\\-Use the preferred pronouns, or gender-neutral language. Misgendering(using the wrong pronouns) does not lend itself to a therapeutic relationship. If you are unsure, ask what their pronouns are.\n\n\\-Hormone use and surgeries belong in the medical history. If you have questions about individual patient anatomy, refer to this. If you don't see anything there, you are allowed to ask the patient if they've had any surgeries related to their trans status/if they are taking hormone replacement therapy. This is not offensive. What can be offensive is asking what they \"have.\" Avoid being vague; be matter of fact about what you need to know.\n\n\\-(Also, ask the patient directly about their medical history. Don't wait until a visitor is alone and then ask them, that happened to me and it sucked.)\n\n\\-Your coworkers probably don't need to know if they're trans. Use your best judgement on this, but trans status should only be disclosed to members of the healthcare team if at all possible. It should be mentioned in report, and your charge nurse should know.\n\n\\-If you need to talk about reproductive organs, use their anatomical names and be matter of fact about it.\n\n\\-A trans woman is going male to female, or MtF. A trans man is going female to male, or FtM. A nonbinary person can be coming from either place, and generally considers themselves \"neither,\" though your mileage may vary. Cis means \"not trans.\"\n\n\\-Nonbinary people can have a specific identity. If you haven't heard of it, you can ask what it means to them. Many nonbinary people are okay with singular they, but some nonbinary people use unusual pronouns, it is not offensive to ask how to use them.\n\n\\-You don't have to understand trans people to be supportive and respectful. If you say something ignorant or get a pronoun wrong, apologize quickly and sincerely, and move on. Don't make a long drawn out apology-you don't have time for that and trans people aren't super interested in hearing it.\n\n\\-Trans people are regular people. Talk to them about non-trans things, too, same as you would with anyone else.We are more than our meat suit.\n\n\\-Last one: try to remember that you may have trans coworkers. A little respect for trans people goes a long way to us. We appreciate it.\n\nComment if you have questions!\n\nEdit: Thanks for the gold, kind strangers!",
    "title": "Trans Patient Tips from a trans nurse:",
    "subreddit": "nursing",
    "timestamp": 1550280237,
    "score": 1098,
    "keyword": "woman nurse"
  },
  {
    "text": "Patient’s daughter filmed and berated me and my colleague while we changed her mother’s bed. Sorry for the long post but I had to get this off my chest and it looks like I may have found the community that can empathize with me.\n\nI am actually the overnight PA in a busy downtown level 1 trauma center. An elderly and demented woman has been in the hospital for 4 days after a fall at a nursing home where she sustained some non-operative pelvic and wrist fractures. Patient has been doing well and was being prepared for discharge to a SNF tomorrow when all hell broke loose. The geriatric physician wasn’t able to come and talk to the family, her sitter (fall risk) was dc’ed per protocol before discharge, for some reason she was on scheduled oxy which had been changed to prn so we aren’t just feeding this lady drugs. The new residents started 2 days ago so I’m sure they had no idea what to say to this family so when I came in for my shift it all fell on me. The nurse pages me to come talk with family, I  show up 5 minutes later and am met by the daughter and the daughters friend outside the room. I cover approx 60-70 patients overnight so I asked them what the problem was while I chart checked her. The daughter says “my mother has been screaming in pain, crying, nobody cares about her, you are trying to kill her, we want her transferred (it’s 21:30 at this point). I explain why a transfer at this hour was unlikely and how sorry I am for the poor communication, etc. Daughter fired back with “you need to treat my mother as if she was your mother, you don’t give a f*** about her, you’re trying to shove her out the door”. Thats where I lost my cool. I said “mam, this is the first time you are meeting me, I apologize for what has happened but please do not question my care and compassion for my patients when this is the first time we are meeting”\n\nFast forward:\nChief Resident comes to talk with them, same convo/result.\nAttending surgeon, resident, myself, social worker and 2 nursing supervisors come to talk, same convo/result except she gives us the “we should be consulted and be the final say in all things that happen with her, you just are supposed to make suggestions” like this surgeon is nationally recognized and this lady wants us to do what she tells us to do.\n\n1 hour passes of futile arguments back and forth, daughter storms out and yells back in all snarky “and she’s been sitting in a wet bed for 15 minutes and nobody even noticed”\n\nNurse is visibly upset, she gets stuff to change the bed, can’t find an aid or another nurse to help so I volunteer as the nurse is practically in tears. We start to change her and the daughter comes back in with her cell phone out videotaping us. The patient is delirious but in some pain, but that shouldn’t stop us from changing her urine and shit covered sheets. The daughter is still filming and yelling “scream louder mom, Facebook is gonna love this, I’m sending this to the joint commission, this is the bullshit care they provide”. Like I’m wiping your moms ass and you are filming and telling her to cry more instead of trying to console her like we are???\nMe and the nurse stay calm, continue to carefully change the sheets underneath her as she can’t get out of bed. I wanted to knock that phone out of her hand and shove it right up her ass. I did not.\nSecurity gets called but the family jolts before they can take the phone to delete the video. The nurse is crying, I’m almost crying. It was miserable.\n\nSo what I’m trying to say is, always keep your calm, always ask for help, always treat the patient with the utmost care and respect and if you see a furious looking dude wiping an old lady’s behind on a Facebook video, HMU.\n\nEdit: supervisor was called and present, she is useless. This problem doesn’t happen often at my hospital, we legit printed out the policy afterwards and it said some bs like “security can convince the person to deleted photo” (I will be talking to legal about changing said policy). Security was called after the incident was de-escalated and again, they are useless....good thing I change jobs in 2 weeks lol. Thanks for all the love and I hope this helps other medical professionals get a leg up to read up on their hospital policy before this shit happens to them. Again, I wiped 1 ass, those that wipe them daily are the true heroes.",
    "title": "Patient’s daughter filmed and berated me and my colleague while we changed her mother’s bed.",
    "subreddit": "nursing",
    "timestamp": 1562150125,
    "score": 954,
    "keyword": "woman nurse"
  },
  {
    "text": "To The Nurse Who Lost One Today... I was sitting at Starbucks today. I saw a nurse come in with her scrubs on. I don't know if it was my 6 months of time as a chaplain (hear the sarcasm in that, please) but she just had that look. That look of entering a room where everyone in the place has no idea of the trauma you've just witnessed and participated in.\n\nHere everyone is--smiling, laughing, drinking coffee, enjoying the time. Unaware of the fact that you, perhaps 2 hours ago, felt the bones of someones sternum/ribs break under your hands as you performed CPR--all as you heard a mom behind you weeping, hoping, praying. And now, here you are, supposed to just go back to normal life. I can't help but think, perhaps some of you are that nurse.\n\n&#x200B;\n\nI remember one time I was called around 8pm to the ER. A young woman was going downhill fast. She was then moved up into one of our ICU's. She was 26. A drug addict. Her sister was sitting there with her. I talked with her. Then one by one her family came. Her sons, who she had not seen in years because of her addiction. Her brother. Her parents. One of the little boys had down syndrome. He went around the ICU unit giving hugs to all the nurses.\n\nShe died pretty soon after that... and I walked them all down to their cars and watched them leave. I had missed dinner, so I went to our chick-fi-la and got a sandwich and went to my office. Just sitting there. Unsure how the fuck I was supposed to go back to normal life and eat a chicken sandwich after what I had just been through and witnessed and experienced with this family who I will never see again.\n\n&#x200B;\n\nHow do I just go back to normal life? How do we, who see this stuff, just move on to our chicken sandwiches and coffee?\n\n&#x200B;\n\nI'm not entirely sure we should. I think we need to honor the sadness of some calls. That's the only real way to get it off your chest so that you can move on. I played a song by a band called Sleeping at Last called 'Hourglass' that night before I ate. I cried. I valued and honored what had just happened. I texted a friend. I cried some more. I journaled.\n\nThen I ate my chicken sandwich. Drank my sweet tea. And got another page to the NICU for a premie who had just died. But I went with a larger heart. Because I didn't just throw away my weighty feelings, but honored them.\n\n&#x200B;\n\nI don't know what some of you saw today or have experienced this week. I imagine some of it has been difficult. I just want to remind you; honor the sadness of what you see. Know you are doing such good work. Know you did what was yours to do. There is such a difference in that mindset instead of doing what you could. One really free's you. One really burdens you. Thank you for being you. You do so much for people. The big things, and the small things. Like a smile, or a joke, or grabbing another pillow. You meet people in the darkest moments of their lives. And that’s not an easy job. So give yourself some grace.\n\nYou’re going to make mistakes. The success of a shift isn’t always “was I perfect”, but “Did I learn?” And can I be better next shift?\n\nDon’t let the weight of one mistake out weight the 300 good things you did.\n\nYou are a gift to the people who see you. Get some rest, cry if you need, talk to someone. If I could give you a hug, I would.\n\n&#x200B;\n\nA humbled, gracious, ex-chaplain,\n\nPace.",
    "title": "To The Nurse Who Lost One Today...",
    "subreddit": "nursing",
    "timestamp": 1565142137,
    "score": 802,
    "keyword": "woman nurse"
  },
  {
    "text": "Old principal changing careers My old principal that was “retired” early for misappropriated school funds and possible sexual harassment is starting a new career. The women who was the worst micromanager and forced many a teacher out by being awful to them. The principal that had no idea how to relate to any of her staff or the parents at her school. Who only spent a total of three years in the classroom before going the admin route and made many students cry when questioning them over behavior. This principal is in nursing school. I never saw an ounce of bedside manner with this woman and she’s going to start a career where she works with sick or injured people. God help me if I’m ever her patient. But then again you’ll burn through all your retirement if you don’t find a job after retiring in your 50’s.",
    "title": "Old principal changing careers",
    "subreddit": "Teachers",
    "timestamp": 1566053017,
    "score": 4,
    "keyword": "woman nurse"
  },
  {
    "text": "Looking for advice on how to approach a teacher's wrongdoing Hi teachers! I'm coming in a little hot here (from Upstate SC) because, to be honest, I'm absolutely FUMING. We've had a difficult time with our son's (3rd grade) teacher this year, all culminating in an incident yesterday and a MASSIVE breach of trust today. All year we've been getting reports of behavioral problems with our son. Knowing that he's not perfect, as no child is, we always took the teacher's side because we've placed full faith in his school and his teachers since day 1. But things were always a little...fishy. From day 1 (literally the first day) I picked up on a rather condescending attitude from her. She was downright rude, telling me that I was unprepared for my child to be in school because I hadn't come to Meet the Teacher night to fill out paperwork, and didn't back down even when I told her I had to work late that night and was unable to make it. While I sat there filling out the forms I witnessed how she was treating the students. Again with a hint of condescension, and adding in a total lack of kindness and always speaking with a raised voice. Not yelling, but always unnecessarily loud, and it made me uneasy. I kind of chalked it up to first day stress at the time, but when I got home and told my husband about it, I declared that I didn't like her but we'd give it some time. Every incident this year has either involved him allegedly doing something (usually talking) that he would deny or we would hear VASTLY different stories from son and teacher. Thinking that kids lie and teachers don't, we took her at her word.\n\n&#x200B;\n\nFlash forward to the first PTC, and I'm working again, so my husband goes. He said she was professional and kind and he didn't see anything wrong with her. By this time there had been a couple of incidents, which made me even more suspect of her, but we always had a united front with our son that the issue was his. \n\n&#x200B;\n\nNow flash forward to yesterday. My husband got an email from her saying that my son had been in an 'altercation' on his way to book club, that book club is a privilege, and as such she expects students to control themselves when walking independently in the hallway. That's it. We had no idea what actually happened, so when our son came inside from playing we calmly asked him if something had happened at school. His story was incredibly believable and he had no issues telling it calmly and clearly. He gave details including where everyone was standing and where they were in the hallway. As it goes, he and 2 other boys were walking 3-wide down the hall, and the boy to his left shoulder-shoved him playfully, which pushed my gangly and uncoordinated son into the boy to his right, and that smaller and still uncoordinated boy went flying into the wall and damaged some decor put up by another teacher. The boy who hit the wall complained to the book club teacher, and she relayed it back to my son's teacher. When we relayed his side of the story to my son's teacher, she claimed she had spoken to all 3 kids involved and they all claimed that it was my son who did it independently. When we asked our son if she had spoken to him, he vehemently denied it, and said that in fact, when he tried to explain himself, she put her finger in his face and said \"Not another word from you.\" The boy who hit the wall didn't see the initial contact, and the boy who initiated the contact denied involvement (duh). My son never got to say a word.\n\n&#x200B;\n\n\\*\\*A quick note about my son. When we accuse him of a lie, he breaks down and confesses. Tears, snot, the works. He also breaks down when he's accused of something and we keep pushing for a confession but he is insistent that he didn't do it (This has happened many times this year with this teacher, we're experienced with this.) I know when he's lying. He was not lying with this story.\\*\\*\n\n&#x200B;\n\nHe told us all of this, and deciding that his story is not only plausible but very likely (why in the world would the other kid confess and get himself in trouble??), we emailed her and told her that we were accepting his side of the story and he was not to be punished for this 'altercation' (punishment was fixing the display that was smashed into). We also asked if we could meet with her to discuss the things that have been going on with him. Her response? Nothing.\n\n&#x200B;\n\nThat brings us to today. We took him to school this morning at 8, perky and upbeat because his parents had finally taken his side for once, but around 9 he began feeling really unwell. He told his teacher this and asked to see the nurse. She said no. He began to cry and didn't stop crying all through lunch, walking down the hallways, for everyone to see. For THREE hours he cried and begged to see the nurse. When we got there his face was SO puffy and red, kinda like he had been crying for hours. I guess she finally got tired of it because she finally let him go. His temp was 103. He has the flu. He was also the 9th student to be sent home with similar issues today. This woman let him sit there sobbing for 3 hours in agony, begging for help, and she denied it over and over again. I AM SO MAD. I can't believe she did this to my child, and I can't believe we took her side for so long. We also learned this week from a school insider that his teacher was moved from 2nd to 3rd grade because she couldn't stop yelling at her students. Yelling at 7 year olds. Wrong profession much? I guess they thought older kids would be easier for her, but evidently not.\n\n&#x200B;\n\nI'm looking for advice on what to do here. I don't trust this woman with my child anymore. I don't think she has his best interests or wellbeing in mind. I don't want to fly off the cuff, so I'm looking to you guys for guidance. What would you want or expect to happen if you were in this situation? What's the best course of action for us? She doesn't seem to have any interest in talking to us when we challenge her, so should I go directly to the Vice Principal? Or Principal? I'm very upset and very lost. I never imagined this would happen here. It's been such a great school until now. Please give any advice you have. \n\n&#x200B;\n\nP.S. She still made him fix the display, and he complied.",
    "title": "Looking for advice on how to approach a teacher's wrongdoing",
    "subreddit": "Teachers",
    "timestamp": 1549481499,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "I am a 30 year old full time artist. What career can. I change to that will sustain me in the coming decades? I am a 30 year old woman with a BFA in fine arts. I am a full time artist in a very niche market. I love what I do. However I fear that as our climate changes and our ways of life adapt, people may want to spend less on luxury goods. I fear my market will disappear.\n\nI want to begin studying something that will be useful 10 or 20 years down the line. I thought of welding or a similar trade as I am good with my hands, but I don't know if I am too old to start that career. My husband is in IT and suggested I join him there, but I don't know where to start. I've also thought about nursing so I feel like I am helping people, but again, am I too old?\n\nI don't plan on having children. I just want to be useful until my time comes. I have been going through a bit of a crisis, so please be patient with me.",
    "title": "I am a 30 year old full time artist. What career can. I change to that will sustain me in the coming decades?",
    "subreddit": "careerguidance",
    "timestamp": 1577559195,
    "score": 3,
    "keyword": "woman nurse"
  },
  {
    "text": "Recent female graduate should I leave tech and go to a more woman dominated field like nursing or teaching? Hi everyone this is my first post but I graduated last December with my BS in Information Systems. I was originally a science major then switched to psych before settling on InSy (which I was originally just going to minor in) anyways I’m a 22 female who wants a family one day and wants to get a job that will let me have 2-4weeks vacation a year to travel overseas and explore the world (I know this isn’t really feasible from the beginning but I thought I could work my way up to it after a few years.\n\nMy mom and some of the people around me tell me to just become a teacher and although I like their vacation time I don’t like the low pay and most kids are bad and difficult to deal with on a daily basis (I currently work as a technology manager for an elementary school that pays really low) and teachers are always complaining. \n\nI was originally planning on getting certs and getting a help desk job and working my way up to either IT cyber security role or database administrator or maybe something with cloud. However, people around me who know I want to get married and have a family tell me tech might be hard to get vacation time and focus on my future kids. \n\nBasically, I’m staring to worry about entering tech as it’s male dominated Im afraid I won’t be treated with respect and if I get maternity leave in the future I will find it hard to get my job back or get back into the work force if I don’t enter a woman dominated field like nursing or teaching. \nThoughts would be appreciated. I feel like with tech there is potential to make a lot of money but it might not be consistent like nursing or teaching. I don’t love tech I don’t hate it either it’s okay to do I also don’t think I love nursing or teaching I just might be more comfortable working with women but it’s just soo many factors that go into a career I can’t decide what I value more. I don’t know I’m feeling very lost and don’t know what to do. I don’t really want to go back to school for nursing I mean I barely gave my current degree a shot but I’m scared. Idk maybe because my whole like I like plans and I just feel like I’m floating in no real specific direction right now.",
    "title": "Recent female graduate should I leave tech and go to a more woman dominated field like nursing or teaching?",
    "subreddit": "careerguidance",
    "timestamp": 1563514873,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "Ask for my job back? Or bad idea? So, this probably could get a little lengthy.\n\nSo a few years back, I started a position at a Speciality doctor’s office while in nursing school. I was working there part time, doing administrative type of work (front desk) Checking in patients, collecting co pays, for only about 25-30 hours a week. Nothin’ crazy. \n\nFast forward about three months- one of the Medical Assistants there went out on maternity leave. The office I was at had a lot of the employees “float” to all the different offices throughout the region. And one day, a physician asked if I wanted to assist in his clinic for the day (answer phone calls, schedule outpatient procedures, check out patients after consults) I was all over it! That one day turning into a month, than a year, than I had officially ranked up enough hours for my internship through him to receive my Medical Assistant Certification. I loved it! J loved it so much, I decided to put nursing school on the back burner and work full time as his MA. I was learning SO much and was getting hands on experience that I just couldn’t pass up, and I genuinely loved my job. \n\nSo... then, me being in that position for about a year, ( also the doctor I was working for the President of the company, he is the busiest, with the most patients, and by no means was my job slack to put it that way ) Anyway, I then find out that they had hired a new Clinical Operations Manager, aka: I had a new boss. Everything seemed great at the beginning, she always care to me if she was unsure of something, was always asking for my advice, she was just going the extra mile so it seemed. Then, I went on vacation for a week with my family (this was requested off literally a year prior so it wasn’t like a spur of the moment thing) I come back ready to work, and I see a note on my desk, stating to come and talk to “my new boss” I didn’t think anything of it, I walked up to her office, sat down, and she said that I was getting written up for having “unsent mail” in my desk while I was gone. \nUhhhhhhh...\nWhat??????????? \n\nFor one: Why in the world was this woman going through my desk? I mean there’s just absolutely no reason for that. I can’t think of one at least. That’s for sure. \nAnd for two, which I argued this point, that there was no patient name on the envelope, (I could understand a HIPAA violation or something, but no, didn’t do that. I explained to her that these patients actually came into the office and I gave them their instructions in person rather than mailing because they were nervous for their upcoming procedure and wanted to make sure they understand things clearly. \n\nNope. She still made me sign that piece of paper. I got written up. I was honestly devastated. I had no other issues what so ever at this job, and I was just so confused. \n\nThe following week, I get called up to the office again, she states that I sent something in the computer wrong, (I cant really get into details details) but, the moral of the story was; the rule was the entire time that I had been employed there that it was our responsibility to do this task, but apparently this was suddenly changed and NO ONE was aware of it, because as soon as I left her office, I asked a colleague if she was aware in normal conversation. And she said no. Well, she wrote me up for this too!!!! I was like what is happening. \n\nTwo weeks later, I am rushing out the door for work to take my new puppy to day care while I’m at work, he runs off, and he gets hit by a car... thankfully he did not pass away but he did have to have surgery. I called my job right away and told them what happened. They said “ok. So are you going to come in today?” I was like.... uh.... I mean I didn’t plan on it, I am at the vet, my dog literally just got ran over my a car. “ and she was like “ ok well just I guess let me know how everything goes” and I said ok. Well we were at the vet all day and night that night, and I didn’t even think of calling her again throughout the day. I managed to pull myself together and go to work the next day, and everything seemed... fine. \n\nThe next day, I go into work, I walk in, and have my boss, and my former boss I guess you could say. (The new one pretty much took the others jobs, but said they were “splitting the duties” idk, they never got along it seemed like to me) I was like Hello! How are you guys? And they both kind of looked at each other, and said we need to speak with you, I was like... okay.... \n\nI walk into my doctors exam room, and they both sit down, and say, “ I’m sorry but we are going to have to let you go” \n\n\nI sat there in literally pure freaking shock. I truly did not believe that this was happening. I looked at them both and was just like what? How? Why? My old boss just kind of tucked her head down and looked at my new boss. My new boss stated: “ you have had 3 write ups and it is company policy to terminate you. “ I said wait what 3?? When was the 3rd? She then proceeds to say that, I never let her know if I was coming into work the day the my dog got into his accident. \n\nWhen she said that, I was furious. I could not believe that they were writing me up for something so out of my control, it all seemed so unfair. I literally ran out of the office in complete tears and was majorly depressed over this for months and months. \n\nFast forward a year later- I went back to school in the mean time, and have been just serving/bartending on the side. I came to find out yesterday that, my “new boss” no longer works for the company I had worked for anymore, and had went back to her old job. I was SHOCKED. This lady seemed to live breathe and die this company so I truly couldn’t believe it. Than, I got to thinking- \n\nMaybe I should ask for my job back? \nI mean the worst they could say is no? \nMy ONLY problems in the work place unfortunately revolved around that woman. If she is no longer there than, maybe I can get a second chance? Do you think I should send an email to my “old boss” that is still working for the company, and explain that with her being gone (she saw what she did to me first hand) I think that I could really thrive and make the company a better place. My job was extremely fulfilling for me and I just haven’t been the same without it... \n\nAny advice would be MUCH appreciated",
    "title": "Ask for my job back? Or bad idea?",
    "subreddit": "careerguidance",
    "timestamp": 1564495428,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "Being called passively aggressive \nI am a 29 yr old ICU RN. My grandmother is a patient at a very prestigious hospital.  Usually, I'm surrounded by  older men/ women peers who always think they are right and can be rude.I have learned to be stern and clear if i feel something is wrong or right to get my point across and be taked seriously . I'm usually the only black woman working as a RN. Well, i was trying to discuss with my Grandmas nurse her plan of care and i questioned him on something and he told me i was being passive aggressive. He also said I was one of the worst family members. I was not yelling, over talking , or rolling my eyes.  I had a honest question.  This nurse is a white male. I don't want it to be that person to be about race. But I'm insulted. Im going through the conversation and it really takes a toll on my self esteem to be called passive aggressive. I really try to be nice to everyone  because im a sensitive person.\n\nThis is already a hard time for me. I just want whats best for my Grandma. .The nurse won't even come in the room anymore.  I would hate to think he's not taking full care of my Grandma because of how i sounded.  \n\nHas anyone been called passive aggressive and was it valid?",
    "title": "Being called passively aggressive",
    "subreddit": "blackladies",
    "timestamp": 1549519475,
    "score": 14,
    "keyword": "woman nurse"
  },
  {
    "text": "I’m so upset about my pharmacy internship. I’m going into my third year in pharmacy school and every year until I graduate, I have to do internships every summer. This summer, I am doing a hospital internship. Today was my third day at said internship. Much to my disdain, I ended up with a lot of doubts, frustrations, and gripes. I want to say I didn’t see this coming, but maybe I was too naive.\n\n\nProblem #1) I found that I am not using much of what I learned in school. 99% of it is totally useless in the real world. So far, I have mostly focused on ridiculous things such as workplace politics, not things that actually directly impact a patients care. I am so tired of putting on a smile and grinning and bearing it. The workload is so monotonous but ofc, I can’t say out load that I dislike it. \n\nProblem #2) I am worried about my mental health and my learning style. People that see me don’t see me as someone with a disability. Since I don’t have an obvious disability, people treat me like someone who isn’t disabled. That can be a good and bad thing. The good thing is people speak to me like an actual person. The bad thing is people don’t realize my limits, such as my cognitive and dare I say, physical deficits. I cannot for the life of me stand for 5 hours nonstop. I also can’t for the life of me be expected to pay attention of top of that while the soles of my feet are hurting and I want to literally cry out in pain but hold it in for fear of looking unprofessional. My coworkers and the pharmacists keep saying that it will take me time to pick things up but within a week, I will pick things up. The problem is they are ignoring the fact, since they are ignorant of it, that I have a brain that functions differently from other people. I do not pick up things as fast as other people. I also have trouble paying attention ATC without any moment of distraction for 8 hours barring lunchtime. I constantly forget things I learned even 5 minutes to a day ago, it’s hard to remember what people say, and I easily get confused about what to do so people will have to repeat things multiple times to me. The other student from my school that is on rotation seems to also have trouble but she picks things up faster than I do, and she doesn’t seem to have as much trouble with the cognitive and physical duties of the job. Today was so bad for me that I literally became dizzy and I had to take a break for 5 minutes. Then my black coworker was asking me what was going on and I decided to be honest with her, even though I feel like I shot myself in the foot.\n\nI told her about how I didn’t feel so well after standing for multiple hours and about how I had an even worse experience working in retail pharmacy last year. She then tells me that I “probably shouldn’t work in retail and work in hospital instead”. No shit. I know she was trying to help but she seemed tone deaf to me. She also asked me if I was on any medication. I am currently on a few by I had to restrain myself as I certainly wasn’t going to tell her about the psych drugs I was taking and deal with her judgment. I denied taking any medication and what irked me is how she made it seem like how I was feeling was abnormal. As if I should be able to stand for that amount of time and not take a break at all or say a peep about it. That’s why I regret saying anything because I know people talk and what I said could’ve gone back to the pharmacists and they might think I am being unprofessional. Then when she was teaching me how to use the medication organization system, I kept forgetting some things I was supposed to do. She noticed this and asked “Why did you forget this?” and I felt like I had to explain to her about my cognitive difficulties, but since I didn’t want to reveal too much I said, “I always forget things”. She then replies, “Do you have memory problems?” That response stung because she made it seem as if I told her I have dementia. She’s been working there for 30 years so she seems to take the ease of doing things for granted, but I don’t see why someone should tell you they have trouble doing an ungodly amount of work because they can’t remember all the steps and the only thing you can say is “Do you have memory problems?” On top of that, she told me I need to take breaks at certain times, and I wasn’t the happiest about that, because I know my body isn’t going to want to take a break only when it’s convenient for my other coworkers. \n\nI talked to my aunt yesterday and she said I have to be okay with looking dumb with making mistakes. Going on this internship has really taught me to put my personal feelings aside and just let my coworkers show me the ropes, even if it feels embarrassing, and that I shouldn’t worry about what other people think of me but is hard. I’m sad that I don’t have the best support system there. I honestly try to grin and bear, but I’m obviously not going to tell them about my psychological diagnoses. I already feel bad enough that I’m not neurotypical, but they won’t understand what being neuroatypical means. I feel alone.  If I told them my diagnoses, I fear they would treat me differently and even start discriminating against me, whether knowingly or unknowingly. I actually broke down multiple times today and I was so upset. I don’t think most or even anyone could understand how I feel. I actually cried in the hallway as I was going to lunch, but away from the view of my coworkers. \n\n\nProblem #3) this problem is related to #2. I don’t fit in with the workplace culture and I am tired of people’s obvious preconceptions and judgments about me. They’re not even subtle about it. I tried to cope yesterday with the heavy workload by talking to myself so I wouldn’t forget the steps. One coworker ended up calling me out for it and I was embarrassed yet again. I just laughed it off because I can’t afford to be a belligerent intern. People also look at me differently because of my learning and working style. If someone sees me doing something slower than they usually do it, even if I’m not personally having trouble with it and going at my own pace, they think it’s a problem and ask me what’s wrong or they tell me to try it a different way instead. I’m not upset that they’re trying to help. I’m upset that I can’t work at my own pace and if I do, they automatically think I have a problem. I’m either too fast or too slow. There’s never an in between.\n\nAnother way they treat me differently is through explicit ageism. Yesterday they asked me how old I was. I already know what’s coming when people ask me that kind of question since I look very young for my age. The black coworker asked me, “How old are you? 16? 17?”. I braced myself and said “No I just turned 22 in December.” Immediately everyone’s eyes light up in the same predictable fashion and they go “oh my god! You look 15!” So they literally thought I had skipped a bunch of grades and somehow ended up in college, and that was somehow more believable than me just being a young looking college student. Okay. I found that pretty ridiculous. Another coworker of mine said “I’m sorry but you just look too cute.” and honestly I hate when people call me cute. She and the black coworker said t make matters worse that I could be their “daughter”. It made me want to roll my eyes but I just stood there smiling. I even joked about the matter and said “My sister is 19 and she looks like she’s 10”, but in the inside I hated them and I hated myself for looking so young. It’s honestly a curse and most people don’t get it. Even if I don’t have a visible or physical disability, for me, looking young has seemed like a social disability all of its own. It’s gained me nothing and has actually affected how people treat me. Everyone talks about racism around these parts but no one ever focuses on ageism, which is also a terrible Vice. Today, my coworker said that she’s like my mother and I wanted to roll my eyes again. She also said that I look like I’m 15 again and that I’m “cute”. The day before, I forgot the directions on how to do a certain task and she said “don’t forget or else I’ll treat you like you’re 12, not 15”. Explicit ageism right there and I just sat there and took it because I didn’t have a choice. It really makes me uneasy that they keep saying these things. I also feel as if the other workers there are analyzing and judging me in my interactions with them. One pharmacist was talking about how cute my eyes were, and I felt like I knew where she was going with this. All I look like is a 12 year old to them and not someone on *their* level. I really wish people would stop focusing on my looks so much but I know that will never stop happening, especially in the real world.\n\n\nAnother way they treat me differently is they have already classed me as this innocent and quiet child. Today I was focusing on my work and they say “wow, haichewjichoo is so quiet today. She doesn’t say anything.” and I also hate when people say I’m quiet. I personally think talking too much can be worse if not as bad as talking too little and I’m not the kind of person to be blabbing all the time. Besides, I felt I had already made a good effort in making a good impression by talking to and greeting my coworkers beforehand. They even compared me to the other student from my school and said “The other student talks a lot” even though she literally said nothing for the past 10 minutes that had nothing to do with questions about her assigned task. I didn’t say anything because there wasn’t anything to talk about and I didn’t have any questions about my task. Of course they didn’t consider all the talking I had done beforehand or that I was probably just focusing on my work. I even tried to politely tell them to fuck off by saying “I didn’t think I was quiet. I’m focusing on my work”. and they said the things that I previously stated in response. It really irritated me. \n\n\nI always feel like I have to be on all the time too. If I do much as breathe the wrong way, they treat me like a zoo animal. They keep saying that I’m always “nervous”, even though I’m actually being guarded and cautious. They don’t know the effort it takes for me to stay and focus on my tasks day in and day out and the work is so strenuous. I hate that they classed me as just a nervous little kid, even though I am trying my extreme best to make a good impression, so even if I was “nervous”, I shouldn’t be blamed for that. I’m always trying to be alert every single second because I know how my learning style and cognitive processing is different from the other people there so i try to overcompensate for that so I won’t be behind and won’t get stuck or miss important details. It’s not fullproof but I feel more comfortable than if I come there as if I’m at my own house. They always brag about how they take their time in this environment and how it’s so much better than retail pharmacy but honestly I’m not seeing that. These are people viewing the world through their neurotypical lense.\n\n\nThis afternoon I mentally checked out. I just couldn’t go in anymore but I still pretended to care. I don’t know if they fell for my act but again, I had no choice in the matter. This internship is very boring and I feel out of place and I don’t think it’s a good learning environment for me. My coworker who has been working there for 12 years even pulled me and the other student aside and said that people are watching us and we can’t make the mistakes that other people do and that we have to be on our best behavior because it’s possible we could get per diem or part time gigs. Therefore, there’s a lot of pressure on me right now and I don’t think I can go up to bat. I really don’t like this internship now. Every day and minute is another minute that I’m putting on an image for the public and it’s so tiring. I feel guilty for showing any sign of weakness. They pointed out how I was slouching on the desk, even though I had no chair and I felt foolish, even though my feet were killing me. I tried to diffuse the situation, but they immediately said “we’re just trying to help you.” and I felt bad but still annoyed. Sitting down for 5 minutes isn’t going to solve the problem. I would rather not have to stand at all. Before I left for the day, my black coworker mentioned that my feet were ashy, and I was so embarrassed. Ofc she had to play the “black woman to black woman” angle and say “there’s not a lot of people of color here”. She even said my feet would look bad to others and even if she was telling the truth, I again realized that people aren’t just going to judge me on my abilities but on my looks and physical appearance too. It added to my sadness and stress today. \n\n\nProblem #4)frankly my internships have disillusioned me to the field of pharmacy. Not only was I mad aware of my strengths and weaknesses compared to my peers, but i realized have too many weaknesses and not enough strengths. I would be a liability instead of a help to any healthcare professional team. Today I became extremely sure of it when I made a mistake and my coworker said they would’ve gotten flagged for it and it would’ve been under her name. I am 100% sure this won’t be my last major mistake in the future, and that I won’t always have people to cover my ass. In the medical field, you can’t afford to be lackadaisical, but as I said, I’m either too fast or too slow for people, so it looks as if I am lackadaisical or I am not paying attention or I am being careless. People don’t understand how I process things and people certainly don’t care about the effort you put into things. They only care about the product, so I would just be a shitty pharmacist. There’s so many things to keep track of. I’m bound to make mistakes here and there and the worst part is it involves people’s lives. At this point, I don’t really care or have passion for what I’m doing. My first day I was ready to work and learn, but now I know I have no business being a pharmacist with my cognitive and physical limits. I can’t stand all day, and I can’t be trusted to keep track of multiple things at the same time. I’m not good at that, and I may never be good at it, no matter how many times i try and despite people saying, “oh you’ll get the hang of it soon enough”.  I think I want to get out now before I cause any more damage. There are few jobs out there that will suit my learning style and pace and I doubt I will find them in the pharmacy world, as saturated and small as it is. The world just doesn’t consider people like me. It’s all about efficiency and precision at this job and it irritates me to no end. Therefore I don’t think pharmacy is the field for me. My mom is forcing me to stay in pharmacy school and obviously I have to listen or else I can say goodbye to the support my family is giving me. I’m stuck at a crossroads now. I find myself stupid and ignorant for thinking med school was ever an option. Or nursing school. I can’t even handle *this*.\n\n\nIn addition, I don’t want to be worrying about how people perceive me all the time. People that look like they’re 12 and a healthcare professional job don’t go very well together and if I’m not facing racism I know I’m going to face a shit ton of ageism in this field so I know I won’t get the respect I deserve. Why should i stay in a field like that? It’s ruined my self esteem because people think I’m a little kid. \n\nI feel like a total idiot. My aunt thinks I’m being too negative and my other aunt just glossed over the whole thing. My grades aren’t even that great in school but I’m not so great with the workplace politics in pharmacy either. It’s depressing and I want to cry. Of course people might respond that I’m not an idiot but I truly am. My mom doesn’t think I can do anything, and I’ve been accused of struggling with things that “even 16 year olds” know how to do. The latter reference is referring to when I struggling with driving and my sister said this. I’ve been yelled at and hurt by so many people because of missteps that I have made and my heart can’t take it. I do not think I’m smart or even average. I am an idiot and I am trying to come to acceptance with that.",
    "title": "I’m so upset about my pharmacy internship.",
    "subreddit": "blackladies",
    "timestamp": 1557953023,
    "score": 4,
    "keyword": "woman nurse"
  },
  {
    "text": "Follow up; After (self confessed slutty) feminist sexually forced herself on me, today I went to hospital for standard anti Aids drugs-Nurse assumed had to have been MAN who forced me, all caring-stopped being concerned when realised was woman, said no medication then. goodbye...",
    "title": "Follow up; After (self confessed slutty) feminist sexually forced herself on me, today I went to hospital for standard anti Aids drugs-Nurse assumed had to have been MAN who forced me, all caring-stopped being concerned when realised was woman, said no medication then. goodbye...",
    "subreddit": "MensRights",
    "timestamp": 1576705938,
    "score": 551,
    "keyword": "woman nurse"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 191,
    "keyword": "woman nurse"
  },
  {
    "text": "The day the feminist establishment takes the financial provider gap seriously, I'll take the wage gap seriously. Equality of responsibility? Why is it that in the west, in e.g. large cities, there's a glut of single, educated, professional women.. Living singleton lives. Homelessness/rough sleeping is 90 % male, and on the rise. All those homeless guys, we just accept (along with a related type of suicide that comes with loss of income/status when nearly homeless). And all those bachelorette women. And we make no connection. Why is it not the other way round? What would society make of it, if it was the other way round? Why has it never been the other way round? What happens when we prioritise male education, as we used to, rather than female, as we currently do?\n\nOf course, back when men's access to higher education and some well paid professions was prioritised there were some abuses of women, in a system that constrained some women's choices, and limited some women's abilities with a \"glass ceiling\" in these professions. But even when men were given priority for education, and for certain higher status careers, we forget about the abuses of some men in a system that (still does) constrain men's choices, and limits their abilities with a \"padlock\" on the homemaking path, (and sometimes fatherhood path), or the continued lack of social acceptance for men working in female dominate professions e.g. nursing, or attending/having any influence on certain university courses e.g. \"gender (men are bad) studies\".  And men, now more than ever, have nothing like women's well funded glass floor that keeps people above a certain level, that stops almost all women becoming destitute, but without fail looks the other way when men drop out of society. Men have Swiss cheese rather than a glass floor, and always have.\n\nWhy was it that when men had almost all the responsibility to be the guarantors of financial provision - *and* an education system that recognised this responsibility by prioritising male education, to enable them to meet the expectation women would put on them when seeking a relationship to earn for her and any family she might want - this get's rewritten to the solely grievance-based feminist viewpoint of being simply \"male privilege\" - when there was in fact an equally large responsibility, failures and all, and a massive number of men living up to that responsibility, and giving large amounts of wealth to women, families, and society.. Except.. we still have most of that, and men still only have the career option, while their education is being taken for granted by an overwhelming majority of female, and feminist, teachers, who have made it their mission to only ever increase female achievement, and take offence at the fact that men are the ones left behind, and deliberately sabotage any efforts people try to make to give boys an adequate education.\n\nWhy is it that there are, still, massively more women that are provided for financially by their male partners (by men who still *only* have the socially acceptable path of financial provider) - by men who didn't mind how much their partner was capable of earning.\n\nWe should make more of the fact the men - don't mind how much women earn, they have no problem at all being generous, and are accepting of any level of income from a partner, in general. \"Why can't women be as accepting of being a financial provider as men are??!!\"\n\nIf they're going to be gender Marxists on broad sweeping views of career outcomes, and education outcomes (and moving from Marxist into gender supremacists on the education point.. i.e. gender fascists?) then how can they also pay almost no attention at all to the *financial support gap*. AKA gender sustenance gap. Men giving money to women for their livelihoods. Men giving money to raise the family a woman has always wanted. Men giving money to feminist establishments in their taxes. Many men and political parties voting for feminist causes to be funded by their taxes, but many women usually siding with feminists when they almost universally stamp out even recognition of men's issues, let alone beginning to fund them, or allow them to begin to be studied in universities. Men funding universities that simultaneously call them toxic, and use the few men that do succeed at the only thing society vales them for - despite slogging through our gynocentric education system - and becoming high earners for their families and society... and then using this *against* men.\n\nTo be clear - I'm not a gender Marxist. I don't think we should blindly seek equality of outcome. It is OK for men and women to have different roles and outcomes which form because of:\n\n* The-set-of-all-men-and-all-women's relationship choices - like women being less likely to date someone who's at risk of homelessness (to avoid herself/future family becoming homeless), or men being less likely to date someone who's promiscuous (to avoid being deceived about the paternity of any future children). - these choices mean men and women will always have different relationship options, despite society viewing men and women with \"equal value\"/being agnostic to their relationship potential.\n* Men and women's ability eccentricities (like chance of being a good nurturer & risk averse, or a good pioneering inventor & risk taking). Like having more nurses that are female, or having more plumbers that are male. Or having more prisoners that are male, and more pole dancers that are female.\n\nWe cannot mandate outcome while people have free choice, and the set of all men's and women's choices and abilities *average* to be *different,* giving men and women different relationship options and outcomes, *and* different career options and outcomes. Yet, we appear to have the \"courage\" to be gender Marxists for education, earning and career options, with 40 years of activism to mandate equal outcome - maybe we should start to point out the other side of the coin, the relationship responsibility side and financial provider side, which was always there, with men holding up their side of the bargain all along, despite us giving women all possible right to choice, mitigating any responsibilities, all of the beneficial outcomes, but none of the negative outcomes. This was about removing women's tendency treated as sex objects - which was entirely legitimate to want to do - yet men are still treated as success objects.\n\nSo, if I did take a page out of the gender-Marxist book, from a page that actually addressed both sides of their gender \"equality\" manifesto, it would say that men should push for equal relationship outcomes for gaining financial support, which would mandate as many home-dads as housewives, and no more shaming of men that live by a woman's income as \"scroungers/deadbeat dads\" - to stop men being homeless/committing suicide/turning to crime to give them some other path if they are not successful at a profession. And billions in government funding, to \"meninist\" establishments, education establishments all changed from the ground up to accommodate almost exclusively male higher education, etc.. But I'm not saying that.\n\nClearly though, given society's expectations on men and only men, that they *must* be successful at a profession, we could at least point out that education is, still, *more* vital for men, just as it always has been and always will be - men's education and professional competency is vital for men, women, families and society, in a way it will never be for women, as long as so many women want no part of this vital responsibility to people other than themselves. And the current misbalance, in the opposite direction, should be tackled even harder than it was when it was other way around. Tackle the misbalance that destroyed a masculine-centric education system to replace it with a gynocentric education system, which - especially for underprivileged/working class men - ruins their life chances, and is probably a very significant factor that's turning so many men to suicide/homelessness/addiction/prison, in addition to a failure to provide for families & society.\n\nAnd in addition, as long as women have both paths - earner, and homemaker - and men have earner or bust, and always have had only earner or bust - lets stop being so surprised if men as a group do better at being earners. Lets just recognise that men's education must not be taken for granted as it currently is, for everyone's sake. Males are the only sex for whom education is vital, the only sex you can (still) be much more sure will *have* to use that education to support a partner that might not be able to earn, or might just chose to have the man take up the economic slack at any given time out of convenience. The sex that is still more likely to use it to support a family financially while the mother happily tones down her career to become a good homemaker, to give her family the best future. Sure, men that are born into privilege, into a good education, money, work ethic, connections, have privilege, and an \"easy time\" of it, but this is kind of privilege that by definition comes just as often to women - and they still have double the initial choices any privileged man has - they still can chose earner or homemaker, and with just as much initial privilege - except actually more so.\n\n&#x200B;\n\nWhat I'm not saying.. in \"meninist\" language  -\n\n\"Why do women see men just as banks? Men are accepting of a woman no matter how much she earns - often the less the better! But you ask a woman what man she'd accept - oh, he has to be successful/wealthy! Women are just gold digging whores, that want to bleed men dry of their wealth!! Such a double standard! End condemning men to being homeless/committing suicide!!\"\n\nThough, for actual equal of treatment of men's and women's issues currently (if we both got to be gender-Marxists), maybe men should be saying that.. Sounds far-fetched? ...\n\n\"Why are men allowed to sleep around.. often the more the merrier!! But you ask a man what woman he'd accept - oh she has to be a saint! Men just toxic bastards that want to conquer all the women they can, and put another notch on the bedpost!!! Such an unfair double standard! End slut shaming!!\"\n\n&#x200B;\n\nIndividual people are allowed preferences, which will cause apparent \"hypocrisies and injustices\" when looking at group outcomes of men and women as feminism and \"meninism\" does. But we can at least make reasonable effort to mitigate some of the pitfalls caused by the differences in opportunities, as civil rights did for women - mitigating women being treated as sex objects - which we should now do for men by mitigating them treated as success objects, by seeking equality of opportunity to e.g. reliability of income (including from a partner, or more robust access to education), housing, quality of life, or domestic abuse shelters, etc.\n\nSeeking equality of outcome is unjust, we are different. Seeking equality of responsibility? I'm not sure.. It might seem unjust, as we have different abilities and preferences, but we used to have it, broadly. I guess it depends what we think civilisation is for. Equality of responsibility does not seem too much to ask though, given that feminism is all about \"equality\", women not being weak etc. And, well, if they're earning their newfound \"privilege\", maybe it's time they got back to roughly equal responsibility, either by reducing men's responsibility, or increasing women's.\n\nIt's also unfortunate, but not surprising how how society cares about trans suicide rates with respect to trans issues, but no hint of caring about men's suicide rate and so caring about men's issues. I can't help but think suicide actually is a pretty good meter of how a group is doing. In China the rate is 1:1 M/F. For all China's issues, men and women seem to actually have about equal responsibility.",
    "title": "The day the feminist establishment takes the financial provider gap seriously, I'll take the wage gap seriously. Equality of responsibility?",
    "subreddit": "MensRights",
    "timestamp": 1575436275,
    "score": 116,
    "keyword": "woman nurse"
  },
  {
    "text": "Woman broke into my home assaulted me and I was arrested..help (escuse my grammer im disabled)\n\n I was sleeping and my female neighbor who lives behind me who i was friends with. Came into my home while i was sleeping and woke me up by punching me in the head and neck and shoulder. I woke up and said hey lets go outside and talk, hoping she would follow me outside to get her to leave. She kept hitting me stopping and repeat over and over and over but i made my way out of my bedroom and into my hall and then woke up on the ground. At that point all i remember was my temple hurting and she knew im disabled and i said please stop im on blood thinners. Because i don't know how hard you have to be hit in the head to have a brain bleed. I stood up and woke up back on the floor. At that point i stood up and said get the fuck out now went from verbally asking politely to demanding..kept hitting me. So i grabbed a unloaded .22 handgun that i keep on my counter in the kitchen that was within reach after getting off the floor. \n\n(As a safety mechanism it cannot be loaded shot or anything not even pull the trigger without the magazine wich was in the other room in a safe and was in a soft padded waistband holster)\n\nI pointed it down to the ground with my bad arm and kept pointing at my door get out get out get out. Nothing still hitting me. Continued to make my way to the front door with her in front of me hitting me repeatedly as i never touched her or shoved her or pointed it at her or anything aside from the ground in the holster and finally made my way to the door. She tried kicking it open and i finally shut her out.\n\nI placed thr gun back down in the kitchen and called 911 and explained what happened. As im on the phone sherriff kicks down my door and jumps in with a Glock pointed at my head. I comply. I was arrested after he refused but another officer let me go to the hospital to get a MRI done. Was in infirmary at the jail for 2ish weeks with no phone call and none of my medicine only my blood thinners that took me 5 days to argue that they were blood thinners and not beta blockers with the nurse..and was forced to starve due to withholding my stomach medication for my post gallbladder removal that helps me eat and keep it down. Lost over 20lbs in 2 weeks from not being able to eat and withdrew fr my nerve medications i take for my disability because im immune to opiates. And they weren't even narcotics at that. After 2.5 weeks was kicked out of my solitary hell into general population and forced to sleep on the top bunk and further injury myself because in disabled from my upper extremities. I couldn't even sleep on the floor because they were already being sued for over crowding..i was arrested for misdemeanor battery, felony battery with a deadly weapon and felony intimidation. AND a violent or sexual felon with a firearm.. yeah.. apparently they thought i had a felony from a neighboring state for burglary but i didn't..and apparently here if you commit a burglary your automatically a violent or sexual felon..but i didn't..so bond set st 25k no 10%. Once i was able to make a phone call i called my mother to go to my home and get my money to hire an attorney after wasting my life saving on 5k for a retainer was able to have my lawyer prove i didn't have a felony and dismissed the most serious charge. And he was able to reduce the bond to 10k 10% and i was free the next day after spending 30 days in jail and almost dying and further injuring myself for something I didn't do slash had the right to do according to Indiana's castle doctrine. She claimed she was just standing at the foot of my bed i got up grabbed a gun jammed it into her ribs and forced her out...yeah definitely not. But im a man she's a short but apparently violently strong woman. And im disabled..yes i have a long criminal history but mainly as a kid made stupid decisions but nothing this serious o havent even had a speeding ticket in years but as a kid i stole and was an idiot sure but she has 2 felonies one for bad checks and one for stabbing one of her ex husband's with a fork in the shoulder.. and i was arrested. Also i think what happened initially is dispatch ran my name and said i was a violent felon with a handgun is my guess and it tainted everything but ironically a few days prior they did a \"recovery\" where they return and verify that a gun is yours and give it back to you one of my guns was stolen and returned days prior by the same sheriff department. But now im poorer than poor and feel like something isn't right she came into my home without my permission while i was asleep regardless of assaulting me and almost killing me..and i think its even more serious since im disabled but im not for sure. But idk what to do my attorney just wanted to drag it out and i don't comprehend why she was arrested or why i was arrested for what i thought was my right to do. I mean what the hell..if i as a man did that to a her a woman ide be arrested...im so confused and im afraid that since im so poor i cant afford to properly prove my innocence..its unjust. I cant even afford to buy a car to go to my 5 plus Drs appointments every month let alone get justice. I wish i could afford a real attorney from Indianapolis because i feel like something isn't right between my lawyer and the court here..this should have been dropped and she should have been arrested.. yet here i am living in hell..  \n\nOnce again im really sorry for the Grammer and everything) also this is hypothetical for legal reasons not saying i did that or didn't.. idk what to do..im afraid my lifes still in jeopardy because it seems like something isn't right with all of this she should be in jail and i shouldn't be worried everyday.. idk i doubt i get anyone to read this but if you do thank you i don't have slot of friends or family to talk to about this and if i ask my attorney anything he always bitches at me and tells me to let him do his job.. something isn't right about this.. and im too poor to do anything about it idk what to do anymore",
    "title": "Woman broke into my home assaulted me and I was arrested..help",
    "subreddit": "MensRights",
    "timestamp": 1569595642,
    "score": 89,
    "keyword": "woman nurse"
  },
  {
    "text": "I've had tears in my eyes for 12 hours straight I've nowhere else to turn sorry Edit: is there a way to speed up my heart disease?\nI look in the mirror every day and I am sickened\n\nI have a muscle wasting disease after a specific heart break last year I decided enough was enough and I'm trying to be alone..  Long story short guys... I can't go on like this I'm now wheelchair bound I've become a burden on my family I don't recognise myself anymore since I lost my job all my friends have either married or left\nI'm tormented... nobody cares about disabled men I've met disabled woman who are never alone I've been lucky  enough to also have heart disease so I'll die in a few years I met men who have survived and it scared me to see my future may involve electric wheelchairs and being spoon fed my dinner every female has a boyfriend or is married while the men have to find nurses\nI want to kill myself.. Is there a way to speed up my heart disease? \nHaving md is awful I wish everyone who made it this far the best",
    "title": "I've had tears in my eyes for 12 hours straight I've nowhere else to turn sorry",
    "subreddit": "MensRights",
    "timestamp": 1574042592,
    "score": 87,
    "keyword": "woman nurse"
  },
  {
    "text": "International Women are Good Men Are Bad Day Hi ladies and  gents, if you live in the northern hemisphere you're probably still 'enjoying' the celebrations for International Women's Day. Now if this day was a celebration of women, motherhood, women's achievements, et cetera, I'd be enjoying it too, and have a glass of sparkling grape juice and a piece of cake.\n\n&#x200B;\n\nBut as a bigger, older school bully might say to you when you explain to her you need your lunch money, 'that's not how it works!'.\n\n&#x200B;\n\nIt's easy for men to celebrate women's achievements, and vice-versa, and at a superficial level that's not a zero sum game. However, when the tire hits the road, and we get into the real stuff like who gets the kids, who gets the university place, who gets the good job, and who gets a long prison sentence because their ex wants to say, 'yes, we did it like bunny rabbits for 5 years, but the last time was just horrible, I didn't want to and he should have known!', IT IS A ZERO SUM GAME To me, and my 'unconsciously biased' and 'white privileged' and 'arsehole and the cause of all human problems' eyes, feminism is not about equality, it is about increasingly advantaging group A (women) at the detriment of group B (men). And not a bit, crazy much. Don't get me wrong, most of this - except the kids bit - won't affect elite men and women, the top 5% can build their own businesses and make themselves the boss, feminism can't and won't attempt to influence this sort of thing. Their exes, who are likely also elites, will have too much to lose by making false claims and grueling through the justice process out for years, so they're unlikely to make them.\n\n&#x200B;\n\nSo selfish men in the top 5% of the income bracket, please stop reading now, enjoy your life, and forget about the enormous lifelong harms and disruptions injustly happening to other men.\n\n&#x200B;\n\nNow back to the point, IT IS A ZERO SUM GAME. It doesn't have to be - anyone who's had a good relationship with the opposite sex knows that. But as time goes on, I'm beginning to think the feminists who came after the Bolshevik revolution (so not the Suffragettes), were probably girls with pretty bad form sheets (several men, none who lasted) who always intended to create a zero sum game where women 'win' and men lose. Now of course, feminism clearly accepts the inevitable side effect of creating a zero sum game involving sex and/or marriage with the rules totally tilted against one player - the marriages don't last so well anymore. This is also not an accident, destabilizing marriage where monogamous, lifelong male female marriage becomes an exception rather than a norm was a primary goal of post Bolshevik feminism very early. You can see it in the Philippines - which is such an odd country as divorce is still illegal there - who is out there arguing for legalization of divorce? You got it, the women's rights movement. Philippines' divorce law is odd, as no other real country prohibits divorce, and I'm not actually defending the law - it seems outrageous to apply a Catholic standard of divorce for example to atheists, Muslims, or Episcopalians) - my point is, who's agitating for divorce? Feminists. Philippines is a valuable example because what we see is the progressive nature of feminism.\n\n&#x200B;\n\nFirst it's divorce, fine, that's gender neutral. Then it's no-fault divorce, well, fine, still gender neutral, although it causes massive spike in the divorce rate. But now the zero-sum part comes in - courts award custody of children to mothers, hey not so gender neutral, more zero-sum. Then, we've suddenly got a significant percentage of the population being divorced women with kids - hey the state needs to look after them. So there's welfare for single parents, again zero-sum with women 'winning' as they are the single parents. Now divorce is a cost-free option, because the state will carry the tab. Then UNMARRIED single mothers say, 'hey, what about me!', so now anyone who has a baby gets looked after by the state.\n\n&#x200B;\n\nI was once on a motorbike in Thailand. And a sad-looking, young-looking, not-pretty-looking Dutch woman came after me like a Cheetah wanting to mate with a Dachshund. All over me, wanting to come to my room. I must have friended her on Facebook or something, but did not go with her suggestion she come and stay in my room. A few years later I look on Facebook, sure enough a little white baby boy is born in Holland, sans-father. I don't blame this woman for having a baby, she was lonely and wanted one, and the Dutch state took care of the tab.\n\n&#x200B;\n\nSo that's one zero-sum game. But let's get now to couples, people who marry or are de-factos. If you live in any western country here's how it goes: You'd better forgive her for her occasional adulterous 'indiscretions' or 'you'll get what's coming to you'. If you've got kids, she'll get them - if you fight hard enough you'll get to see them, sometimes. She'll decide where they go to school, what they eat, wear, what out of school activities they do, what religion or no religion they follow, and how many boyfriends she brings back to meet them. If you have daughters, they will have the fortune of seeing and having modelled that women can have a 'healthy sexuality' as the wife leaves her husband and brings back a series of male lovers over a period of years.\n\n&#x200B;\n\nOh and of course, the money. Elites are a little bit different. But for the majority of the population, she'll get most of the assets - even if it was paid for by the husband's earnings. She'll also get a regular cut of your income - after all husbands should pay for the care of children they're denied to see, that's perfectly fair, isn't it?\n\n&#x200B;\n\nThen there's jobs. Got a profession like nursing or teaching predominantly female - that's fine. I went to a bank the other today and out of the 10 staff in the bank, 1 was male, the rest including manager and all seniors female. The lady Asian teller, who I'm normally very friendly with, got quite angry when I suggested it didn't look like the best bank branch for male job applicants. All deans of all faculties female (like RMIT University in Melbourne was), fine, most paediatric doctors female, fine. Too many senior board executives male - OH NO WE MUST FIX IT. Jobs predominantly male must have female quotas, jobs predominantly female should be left alone - ZERO SUM GAME people. Boy Scouts must allow girls, Girl Guides need not allow boys. I saw in the newspaper in Melbourne today that Geelong Grammar can discriminate and give scholarships only to girls. Does anyone reading this believe that any mixed private school in Melbourne would be given dispension to give scholarships only to boys?\n\n&#x200B;\n\nSo it's zero-sum game across the board: children, relationships, marriage, school, jobs...but let's get to the really good one, 'crimes against women and children'. So all this stuff I've mentioned above would still not keep down an entrepreneurial man who runs his own business. If he is his own boss, well, it's easy for him to hide income so his ex gets less - which would tend to press her to the negotiating table re: the kids - and he won't pass himself over for promotion because he is a man in his own business, so his own talent is his only limit. Now such a man might get uppity, and think he was equal with women, and go around doing a lot offensive male things like being assertive, picky about a women's sexual background and divorce history, and just being self-confident and living without fear.\n\n&#x200B;\n\nCan this really be tolerated? The feminists came up with the solution to that one too, let's change the law whenever a guy is charged with a crime against a woman - ie. the ex girlfriend who cries rape. Let's reveal his identity in the newspaper, but make hers protected upon penalty of contempt of court. Let's make him testify in open court, but let's let her testify remotely via video. Oh and if there's a hung jury, because some sexist jury member goes, 'oh wait, she was banging him the Tuesday before, and sexting, but how come she's saying rape on the Thursday?', guess what - she doesn't have to testify again, the court can just reply her recorded testimony. Oh yeah, and we can't ask her about her sexual history, or say that the fact, you know, she had sex with her boyfriend for years might mean it wasn't rape. I'm not making this stuff up - it differs from jurisdiction to jurisdiction, but there are a complete raft of these laws trying to engineer convictions. It often works, but not always. I spoke to a female former teacher of mine from University years ago, and she told me about a rape trial she was a jury member on. Finally the jury didn't convict because the 'victim' about an hour after her rape went and had sex with her boyfriend - the sexist jury didn't believe that a woman who was raped by her friend (not a cheating girlfriend, how dare you!) would go and then have sex with her boyfriend an hour later.\n\n&#x200B;\n\nThank God I've never had to deal with false charges brought against me - and let's face it, the system would grind to a halt if it started getting out of hand - but just the fear of false claim again is used to oppress and strike fear into the hearts of men. I'm not that worried by it, but mostly because I don't want to have flings with tarty looking girls with bad histories, and I think every man in his right mind would be aware of this and have some sort of risk management plan for it - this, itself, is fear.\n\n&#x200B;\n\nLook, I've gone on and on, and I could go on and on even further. But I won't. I would celebrate Women's Day if it wasn't for the fact that it's really, 'help women, harm men' day. It doesn't have to be like this, but it likely will continue to be so for the rest of our lives. In summation I have one point:\n\n&#x200B;\n\nFeminists realise their objective is a ZERO SUM GAME where there is a definite winner (women) and loser (men). Men and women who are not feminists need to realise the same thing, and the sooner the better.",
    "title": "International Women are Good Men Are Bad Day",
    "subreddit": "MensRights",
    "timestamp": 1552081689,
    "score": 70,
    "keyword": "woman nurse"
  },
  {
    "text": "Cyntoia Brown has been released after 15 years for first degree murder. \nCyntoia Brown has just been released from prison. 15 years ago she was sentenced to life in prison for [first degree murder](https://www.usatoday.com/story/news/nation/2019/08/07/cyntoia-brown-released-nashville-prison-after-serving-15-years/1941329001/)\n\nHer release has been campaigned for by social justice activists for any years. She claims to have killed in self defense, however, the facts don't match up to this. Take a look at [the case](https://en.wikipedia.org/wiki/Cyntoia_Brown)\n\n> Based on the position in which Allen's body was discovered, investigators believed that Allen may have been asleep when he was shot. Forensics noted that, postmortem, Allen was laying with his hands underneath his head\n\n>According to court documents, Brown threatened a jail nurse prior to her trial, stating \"I shot that man in the back of the head one time, bitch, I’m gonna shoot you in the back of the head three times. I’d love to hear your blood splatter on the wall.” A recording of a phone call she made to her adopted mother while in jail was also presented as further evidence against Brown, in the conversation she stated of the victim \"I executed him\". Further still, a fellow inmate testified that Brown had confessed to killing Allen \"just to see how it felt to kill somebody.\"\n\nThe activists fighting for her release know this (at least the main organizers, the celebrity endorsers probably don), and ywet they campaigned anyway. \n\nThis is female privilege. A man who murdered a woman would never be released early, and there would never be campaigns for him. To me this is very scary- this is an early step in what amounts to a quasi-legalization of one gender murdering another. Even though the evidence is very clearly in one direction, campaigners right and win for her to be released. A man would never be released after murdering a woman.",
    "title": "Cyntoia Brown has been released after 15 years for first degree murder.",
    "subreddit": "MensRights",
    "timestamp": 1565247131,
    "score": 31,
    "keyword": "woman nurse"
  },
  {
    "text": "Men of Reddit who have gone through custody battles with an extremely unreasonable, controlling partner: did the courts actually make things better or did things get worse? I have two daughters with an extremely controlling woman who refuses to allow my children to interact with my family at all, and I need to do something, but I’ve heard so many horror stories about fathers not getting a fair shake. Their mother insists on home-schooling, refuses to vaccinate, nurses the children until they decide to stop (usually between 4 and 5 years of age), and seems to do everything possible to increase the childrens’ dependence on her as though she is working to ensure that any shared custody arrangement would be pretty much impossible.\n\nHas anyone been in a similar situation and successfully petitioned the court for joint custody? What did you learn from the experience that would’ve made things easier or may have increased your success? How hard has it been on the children?\n\nI know I’m opening a real can of worms, but I think a lot of people would benefit from your stories.",
    "title": "Men of Reddit who have gone through custody battles with an extremely unreasonable, controlling partner: did the courts actually make things better or did things get worse?",
    "subreddit": "MensRights",
    "timestamp": 1555380419,
    "score": 19,
    "keyword": "woman nurse"
  },
  {
    "text": "I had a rare sexual dysfunction that took years to be diagnosed and treated and suffered a lot of abuse from boyfriends and suffered a lot of mental trauma that time because of it... Now I travel around the US with the doctor who cured me and speak to physicians, nurses, psychologists, physical therapists etc about my experience and about patient advocacy.\nYears ago my doctor told me hardly anybody attended these conferences. Now medial professionals who don’t even specialize in sexual diseases attend these just to learn, and learn how to identify and refer patients properly.\nIt is seriously the most liberating thing in the world to stand up and fearlessly talk about my body shamelessly to roomfuls of people who are excited to learn about how to help women. It’s seriously the most feminist thing I’ve ever done, I used to be so ashamed of myself and felt useless as a woman, now I’m doing this as well as helping patients through the process and it’s amazing!!",
    "title": "I had a rare sexual dysfunction that took years to be diagnosed and treated and suffered a lot of abuse from boyfriends and suffered a lot of mental trauma that time because of it...",
    "subreddit": "Feminism",
    "timestamp": 1563707978,
    "score": 4,
    "keyword": "woman nurse"
  }
]