[
  {
    "text": "Just quit my job after my manager's year long campaign to ruin my life. Feel so free! Using a throwaway for this. About a year ago I got transferred to the head office of a well known company. It was a major promotion and I was really excited. In the interview I noticed that my boss (let's call her Kim) seemed to dislike me but I brushed it off as paranoia. Turns out I was right; a favourite of Kim's had been promised the position but I wound up getting selected.\n\nFor a year Kim made my job hell, she deliberately waits until the day reports are due to assign them to me, does not include me in meetings or departmental training. She stands in the door of her office and makes fun of me with other coworkers and female managers- my clothes, my appearance, my voice.These are the minor incidents.\n\nSomeone in the department was stealing money and cell phones - this has been going on for years. Imagine my shock when Kim comes up to my cubicle with security in tow demanding that they search my things. They go through my desk, drawers, bag everything. One of the guards is asked to search me physically but refuses. Of course they didn't find anything. I was the only person searched.\n\nI decide to keep my mouth shut and keep my head down. Doesn't work, in my interim evaluation Kim tells me, I'm an egotistical bitch and she's going to destroy me. She's grinning the whole time and then hands me a write up slip. It says 'Blubirdz has exhibited an attitude problem on multiple occasions and when warned was visibly upset and made her manager uncomfortable'. I don't sign off on it but it goes on my file.\n\nAfter this I'm written up weekly by Kim and other senior members of staff for various infractions.e.g. being one minute late, lying about having the flu and forging a sick note, displaying an attitude (this one was a gem - I wasn't even in office on the date used), not being a team player and not reminding someone to write me up officially.\n\nThen comes the kicker, I'm called into a meeting with her where she tells me although my work is exemplary, I'm being placed on a Performance Improvement Plan for my attitude problem; I'm distant, cold, quiet. Part of the Plan is that she's referred me to the company therapist to seek help for my mental problems. I'm stunned. She just keeps grinning. \n\nI wrote my resignation letter and turned it into HR. My previous manager called to see what's going on and I told her everything. I don't know what she did but I had an HR meeting and was given a formal apology and will be granted extra severance pay.\n\nThe joke about all of this - the same woman who wanted my job got it - no interview, nothing. And Kim had the nerve to ask me to plan and complete my tasks for the rest of the year. I refused; I'm going to train this woman and finish up what I need to before my month's notice is up.\n\nThanks for listening everyone! If you ever get a bad feeling about a workplace follow your gut.\n\nEdit: Thanks for the support you guys; really means a lot! I did try to report my boss when this first started but was told to toughen up and support her in her role. A lot of this stuff happened in the open. It really hurts when people see you being targeted and either join in or turn away. For the record, I don't have mental health issues.\nI don't have a job lined up yet but I'm going to use this notice period to look for one. Not being kind by staying - I need the money, I take care of my gran and I'll probably have to get rid of her home nurse :(",
    "title": "Just quit my job after my manager's year long campaign to ruin my life. Feel so free!",
    "subreddit": "jobs",
    "timestamp": 1496241008,
    "score": 221,
    "keyword": "woman nurse"
  },
  {
    "text": "Doctors and nurses, what tv show is best for a young woman looking to turn her life to lifesaving to watch?",
    "title": "Doctors and nurses, what tv show is best for a young woman looking to turn her life to lifesaving to watch?",
    "subreddit": "AskReddit",
    "timestamp": 1484621187,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "I feel incredibly proud of the fact that I proposed to my fiancé and that he proud and unashamed to tell everyone in our lives. After years of friendship and almost a year of being together and actually dating, I was pretty much 100% sure I wanted to marry my boyfriend. So much so that I started to search for dresses and day dream about where the venue would be.\n\nThen as I was walking to my car to go home from work, I told myself to stop thinking about any of that stuff until he proposed...then I thought, why the fuck can't I propose. I know he loves me. I know I love him. I want to marry him. Why am I going to wait until he does it? A tradition neither of us cares about? \n\nSo I started the surprisingly annoying and difficult hunt for a male engagement ring. I set up a date for us, and I proposed to him. \n\nAnd then I made myself subconsciously aware that even though he accepted my proposal, he'd probably be a little embarrassed that a woman proposed to him and that he wouldn't necessarily want everyone to know. We could just let them assume he asked me...but then, as always, he reminds me (partly) why I wanted to marry him in the first place.\n\nAllover Facebook and instagram he was posting his ring and how happy he was and surprised he was that I proposed. \n\nHe's so funny, too. I had to work Sunday night and he told me he had to leave to run an errand a bit before I left for work. I show up to work and he's sitting at the nurses station showing off the ring and drinking coffee with my coworkers. \n\nLadies, if you love him and you want to marry him, there's literally no reason why you shouldn't feel empowered to take the initiative and ask *him* to marry *you*.",
    "title": "I feel incredibly proud of the fact that I proposed to my fiancé and that he proud and unashamed to tell everyone in our lives.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1503589069,
    "score": 7670,
    "keyword": "woman nurse"
  },
  {
    "text": "If I see another girl on my news feed bash Planned Parenthood... ISTG This post is dedicated to my many IGNORANT Facebook \"friends\" that think Planned Parenthood is just a \"baby killing\" clinic.\n\nA year ago, I was in a situation where I was hospitalized. I had an ovarian cyst rupture and was in extreme pain. Like, the worst pain I've ever been in.\n\nI had to have a magnitude of tests done, to determine the cause of my pain at first. Transvaginal ultrasound, a pelvic exam...etc\n\nI remember one of my nurses asking me when the last time I saw a GYN was. I kind of chuckled. I giggled and then told her that I couldn't afford health insurance and that I couldn't remember the last time I had a GYN appointment. She didn't giggle back.\nShe told me about the importance of getting regular GYN checkups, and how women my age are particularly at risk for cervical cancer. She then told me that at 28 years old, she was diagnosed with stage 4 cervical cancer. I hadn't had a pap smear done in years, keep in mind.\n\nI was no longer giggling. \nWhen I left the hospital, armed with referral papers of local gynecologists, I was determined to find one and get an appointment made ASAP. \nYou see, my doctor told me that even though they were able to do multiple tests, to determine the cause of why I was in the ER, they were legally prohibited from doing a pap smear. I was told that my cervix was extremely irritated and it was imperative that I get a pap smear done.\nSo I went home and started calling around.\n\nAt first, I started calling local GYN clincs close to me, for convenience purposes. Then, I started googling any GYN clinics I could find. You know what all of them had in common? They were fully booked and couldn't see me for the next 6 months.\n6 months. That was more than enough time for the cervical cancer I was worried I might have, to spread and end my life.\nI was in a panic at this point. The hospital said they weren't \"allowed\" to do a pap smear on me, but urged me to take action, but every single GYN clinic in a 30 mile radius was booked.\n\nAfter calling about roughly 45 clinics, I was extremely frustrated and felt helpless. Out of curiosity, I had asked couple of clinics what the pricing would be to be seen and have a pap smear/breast exam done. I was looking at around $200 out of pocket.\nI googled Planned Parenthood and saw they performed a plethora of female services, including breast exams, pelvic exams, pap smears, std screenings.....etc.\n\nI called the nearest Planned Parenthood and asked when the soonest I could get a pap smear was. They asked if I was available that weekend. I immediately accepted and hung up the phone.\nI had called nearly 45 private practices, with zero luck, and here Planned Parenthood was, able to see me in less than 5 days. \nThe woman oh the phone was extremely patient and helpful, she listened to my explanation of why I needed to be seen, she informed me that if I didn't have health insurance, that they would see me regardless and charge me a small percentage of whatever I could afford, based off of my income.\n\nI went to my appointment that weekend. The staff was extremely professional and informative. The clinic was clean and well taken care of. My doctor took her time with me, answered any questions I had, and made me feel very comfortable. I never felt like I was being treated less important because of my low income status. \nA week or so later, I got a phone call with the test results - I was completely fine. No cervical cancer - yay!\n\nBut what if? What if the results were positive? What if Planned Parenthood didn't exist and I waited 6 months to be seen? I can tell you right now, the chance of me being able to sit here and write this post today, could have been very slim.\n\nTHIS EXPERIENCE IS WHY PLANNED PARENTHOOD IS ABSOLUTELY VITAL TO OUR NATION.\n\nPlanned Parenthood provides services for MANY women that can't afford health insurance.\nPlanned Parenthood also spends almost half of it's funding, to prevent the spread of STD's.\n\nSo let me ask you this. You want a bunch of women in our nation to be unable to get checked for chlamydia or HIV? How would you feel if your mother or sister were unable to get their yearly checkup for cervical/ovarian cancer screenings?\n\nDo your research BEFORE you post some ignorant, uneducated comment on social media about Planned Parenthood.\n\nThank you.",
    "title": "If I see another girl on my news feed bash Planned Parenthood... ISTG",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1493956601,
    "score": 1191,
    "keyword": "woman nurse"
  },
  {
    "text": "A cranky hospitalist's top 100 pet peeves in inpatient medicine Feeling a little crispy after 6 straight weeks on inpatient wards, I decided to share my top 100 pet peeves, almost all of which came up during this month and a half. Feel free to agree or disagree, or to add your own.\n\n(For the record, I certainly don’t claim to deliver perfect patient care, and have been guilty of committing more than a few of these myself!  Categorization into fields isn’t meant to imply that specialists in each field are the primary culprits.)\n\n\n\n**Cardiology**\n\n* Admitting a patient for “r/o MI”, and not mentioning their ECG in the admission H&P (bonus annoyance points for instead documenting “ECG: NSR”).\n\n* Reflexively checking BID electrolytes in every patient on diuretics (sometimes appropriate, but often not necessary)\n\n* Reflexively repleting every patient’s K>4 and Mg>2. (How did this practice become ubiquitous?)\n\n* Reflexively checking a troponin in response to a brief episode of asymptomatic NSVT (bonus annoyance points if the ordering doc doesn’t bother with a follow-up troponin)\n\n* CT surgeons, anesthesiologists, or emergency med docs who cannot reliably interpret an ECG.\n\n* Fluid restricting patients with heart failure exacerbations. (it’s sodium restriction that’s helpful)\n\n* Placing a patient on two hemodynamic drugs simultaneously which have directly antagonizing effects. (e.g. midodrine and hydralazine, dopamine and metoprolol, etc…)\n\n* Describing a patient as “preload-dependent” because of [aortic stenosis/pulmonary hypertension/ diastolic dysfunction/etc…] (all patients are preload-dependent!)\n\n* Micromanaging the blood pressure in a patient with no other cardiovascular disease (e.g. orders for prn hydralazine for SBP>160).\n\n* Continuing statins in hospice patients.\n\n* Placing a patient on a low fat “cardiac diet” because of a history of CAD. (hospital food is already bad tasting enough!)\n\n* Assuming a patient with an irregular pulse has a-fib without checking an ECG.\n\n* Stating that a patient can’t have tamponade because he/she isn’t hypotensive.\n\n\n\n**Pulmonology**\n\n* Admitting a patient for pneumonia, and not mentioning the CXR in the admission H&P.\n\n* Admitting a patient for any pulmonary complaint, and relying on the formal interpretation of the CXR without even looking at it oneself.\n\n* Assuming that a patient with a chronic cough and strong smoking history must have COPD.\n\n* Diagnosing pneumonia based solely on CXR findings, irrespective of the presence or absence of consistent symptoms/signs/lab tests.\n\n* Stating that a patient can’t have a PE because he/she isn’t hypoxemic.\n\n\n\n**Critical Care**\n\n* “Renal dose dopamine” (yes, our hospital still has docs who insist on this!)\n\n* Using the heart rate as a primary indicator of volume status.\n\n* Reflexively giving Lasix to every patient with pulmonary edema.\n\n* When there is no room for your sick medicine patient to move to the ICU because the CT surgeons refuse to transfer out their post-op CABG patients who have been stable for days.\n\n* When your patient codes, and no one gets around to informing you until hours later.\n\n\n\n**Renal/Fluids**\n\n* When a patient with mild hyperkalemia and no ECG changes is given the full smorgasbord of hyperkalemia treatment - calcium, insulin + glucose, bicarb, albuterol, and tons and tons of kayexalate. (bonus annoyance points if no one even checked for ECG changes before ordering all of that)\n\n* Conflation of “prerenal AKI” with dehydration. (AKI from heart failure is “prerenal” too!)\n\n* Not checking a UA in patients with AKI.\n\n* Giving sodium bicarb for a moderate metabolic acidosis.\n\n* Reporting the results of a UA as “dirty”.\n\n* Placing a patient on overnight IVF when they are NPO from midnight for a procedure scheduled for 8am.\n\n\n\n**GI**\n\n* Ordering a stool guauic for a patient whose stool is visibly bloody or melenic. (bonus annoyance points if the intern is only checking it because the GI fellow insisted).\n\n* Ordering a PPI for a soft reason, which will likely be continued for years before another doctor reexamines whether it’s appropriate.\n\n\n\n**Endocrine**\n\n* Placing an insulin-dependent diabetic on only a sliding scale.\n\n* Continuing qid finger sticks for weeks in chronic patients whose diabetes is controlled well enough to never require insulin.\n\n* Deciding against the use of metformin in a patient solely because his/her creatinine is 1.6 - and above a traditional, arbitrary, and evidence-free cutoff of 1.5. (bonus annoyance points if the doc actually wants to prescribe it, but the pharmacist declines to approve the order.)\n\n* Checking TSHs in critically ill patients (exception: the very rare patients whose critical illness could be predominantly due to thyroid disease)\n\n* Seeing a diabetic food tray full of non-diabetic-friendly food. (bonus annoyance points if it includes an Oreo brownie)\n\n\n\n**Rheum**\n\n* Confirming or refuting a diagnosis of gout in a patient with a hot, swollen joint using a serum uric acid level instead of arthrocentesis.\n\n* Ordering 25 different autoantibodies in a patient presenting with a vague, multisystem disease “just to be sure it’s not autoimmune”. (bonus annoyance points if a 1:40 ANA then prompts a formal rheum consult)\n\n\n\n**Hematology/Oncology**\n\n* When an oncologist declines to consult on a patient with suspected malignancy until the malignancy is confirmed via pathology.\n\n* When a proceduralist/surgeon requires a patient’s INR to be below some low and arbitrary threshold prior to a procedure (bonus annoyance points when they express no interest in the patient’s bleeding history – a much better predictor of bleeding risk).\n\n* Reflexively transfusing at an arbitrary hemoglobin, irrespective of symptoms or other medical problems.\n\n* Using a higher-than-normal hemoglobin threshold for transfusion simply because a patient has a history of CAD. (it’s *active* ischemia that should be a reason to transfuse to higher Hb goals)\n\n* Diuresing an anemic patient for the primary purpose of hemoconcentration.\n\n\n\n**ID**\n\n* Daily ESRs or CRPs\n\n* Feeling obligated to switch to PO antibiotics for 1 day prior to discharge, to make sure the patient’s infection doesn’t worsen due to narrowed coverage or poor absorption. (It will take longer than a day for the infection to worsen to a point that you’ll be able to observe.)\n\n* Insistence on always using the same temperature cutoff as constituting a “fever”, and reacting to every “fever” in the same way. (i.e. sending blood cultures on every patient whose temp is >=101.0, and on no patients whose temp is <101.0)\n\n* Being excessively dogmatic with antibiotic courses in situations of diagnostic uncertainty (e.g. a patient with known Staph bacteremia who is estimated to have a ~10% chance of endocarditis must be treated with 6 weeks of IV antibiotics because endocarditis wasn’t “ruled out”).\n\n* When infection control won’t let us take a patient off respiratory isolation for TB until they have been formally ruled out, despite the order having been placed accidentally. (yes, this really happened!)\n\n\n\n**Pain management**\n\n* Dosing narcotics less frequently than their duration of action. (i.e. oxycodone bid)\n\n* Ordering acetaminophen as the only prn pain med in a patient whose chief complaint is pain.\n\n* Refusing to give narcotics to an inpatient with a history of substance abuse, irrespective of how severe their acute pain is.\n\n\n\n**Neuro**\n\n* Documenting a patient’s neuro exam as “non-focal”. (bonus annoyance points if the reason for admission was a neurologic symptom)\n\n* Not assessing the gait of a patient on admission. (bonus annoyance points if the reason for admission was “weakness” or “falls”)\n\n* The use of a stethoscope head as a reflex hammer.\n\n* Reflexively ordering a vitamin B12, TSH, and RPR in every patient presenting with altered mental status.\n\n* When the reason for a patient’s admission and/or their documented chief complaint is “altered mental status” without any further description (e.g. excessive drowsiness, agitation, hallucinations, disorientation, etc…)\n\n* Reporting the results of a head CT as “negative”.\n\n\n\n**Psych**\n\n* Calling a psych consult on a medicine inpatient with stable depression. (bonus annoyance points if the patient will be discharged within a day and already has a close relationship with an outpatient psychiatrist)\n\n* Overreliance on antipsychotics for delirium before first attempting non-pharmacologic strategies.\n\n\n\n**Orthopedics**\n\n* When a ortho resident attempts to turf an admission to medicine because the patient is “too medically complex”, despite the fact that the ortho service is comanaged by a dedicated hospitalist 24/7.\n\n\n\n**Urology**\n\n* When a medicine resident calls a urology resident for help placing a urinary catheter that the nurses couldn’t place, and the urologist requests that the medicine residents try to place it first. (bonus annoyance points when the urologist then becomes irate when informed that the med resident subsequently caused urethral trauma)\n\n\n\n**Emergency Medicine**\n\n* When the ED calls to admit a patient for “r/o chest pain” without first getting an ECG.\n\n* When the ED gives antibiotics without first acquiring relevant cultures.\n\n* When the ED tells the only family member who can provide critical collateral information that they can go home before the admitting doc has had a chance to speak with them. \n\n* When a medicine R2 debates with a ED attending of 25 years’ experience about the need for a patient to be admitted without consideration of their unequal years of experience.\n\n\n\n**Radiology**\n\n* When a radiologist determines whether a patient with impaired renal function can receive contrast for either CT or MRI based only on the serum creatinine, without considering age, muscle mass, comorbid conditions, indication for scan, or the availability of reasonable alternatives to the scan.\n\n* When the interpreting radiologist for a scan doesn’t address the stated indication for the scan within the interpretation.\n\n* When the primary team orders a radiology study and doesn’t include an accurate indication in the request.\n\n* When a radiologist won’t approve a seasoned hospitalist’s request for an MRI brain until a neurology R2 concurs (bonus annoyance points if it’s July).\n\n\n\n**Communication/Charting**\n\n* Charting “Code Status: DNR/DNI” in an admission H&P without any indication as to how that decision was made.\n\n* When a consultant stops seeing a patient without communicating that they are signing off.\n\n* When a consultant conveys to an intern on the primary team that they feel really strongly about a particular course of action, but then don’t speak with the hospitalist directly, and don’t convey the strength of that recommendation in the chart.\n\n* When a consultant conveys to a patient that they will/will not be discharged that day, without first discussing it with the primary team.\n\n* Referring to a family member as “the wife” or “the son”. (it’s his/her wife, his/her son)\n\n* Referring to the patient as “Mr.” or “Mrs.” so-and-so when speaking to a family member. (much better to say “*your* father/mother/brother/sister/etc…”)\n\n* Ignoring the nurse during walk rounds, despite he/she standing right there at the bedside.\n\n* When housestaff signout to the on-call team and spend 30 seconds on each of 10 patients, rather than handing over a list of 9 patients, and spending 5 minutes discussing the one patient who is particularly sick/complicated.\n\n* Documenting a chief complaint that consists of a laundry list of 15 unrelated medical problems (“Ms. Smith is a 60 year old woman with a past history significant for hypertension, smoking, homelessness, osteoarthritis, CKD, COPD, basal cell carcinoma, breast cancer s/p mastectomy and chemo, DVT in 2010, onychomycosis, and chronic low grade transaminitis, now presenting with LLE cellulitis”)\n\n* Documenting an assessment in an H&P that’s word-for-word identical to its chief complaint.\n\n* Failing to look at the reason for presentation as documented by the ED triage nurse (it’s amazing how often the ED triage nurse, ED doc, and admitting medicine resident’s chief complaints are inconsistent)\n\n* When the med list in the discharge instructions, med list in the discharge summary, and the official outpatient medication list in the EMR all disagree.\n\n* When the respiratory rate of every patient on the ward is documented as either 18 or 20.\n\n* When I/Os are fastidiously recorded on patients for whom it’s irrelevant, and patients with renal failure are recorded as having “bathroom privileges”.\n\n* Stating “the patient *failed* such-and-such chemo regimen”. (Patients don’t fail chemo regimens; it’s the chemo regimens that fail patients)\n\n* Stating “the patient *refused* their 3am lab draw”. (Better to say “the patient *declined* their 3am lab draw”.)\n\n* Getting worked up over the difference between “historian” and “informant”. (This is one word choice on the wards that does actually seems trivial.)\n\n* When a doc talks disparagingly about NAs, RNs, NPs, and/or PAs as an entire profession.\n\n* When a non-doc talks disparagingly about docs as an entire profession (bonus annoyance points if it’s an NP wearing a “heart of a nurse, brain of a doctor” shirt)\n\n\n\n**General**\n\n* Referring to professional society guidelines as if they were laws that must be followed.\n\n* Lean\n\n* Referring to patients as “customers”. (bonus annoyance points if it’s during a daily huddle to discuss lean management techniques)\n\n* When someone cancels a lab order and doesn’t inform the ordering doc. (bonus annoyance points if it’s a phlebotomist who felt that a delirious, semi-comatose patient “refused” the blood draw)\n\n* When an outside hospital transfers a patient and fails to include a discharge summary. (bonus annoyance points if they include 100+ pages of nursing notes)\n\n* Attempting to discharge a patient without first assessing how the patient is going to get home.\n\n* Citing a study in a progress note that doesn’t actually support whatever point the writer was implying it supported.\n\n* Failing to question an unexpected, bizarre lab value as possibly being “bad data”. (“Sure, I suppose this person recovering from a hip fracture, whose sodium yesterday was normal, could have a sodium of 90 today, but maybe we should recheck it first before starting the 3% saline…”)\n\n* When a PMD insists that the patient they are trying to directly admit to a particular medicine ward is appropriate for that level of care, despite the doc never having stepped foot on the ward in question.\n\n* Making a medical decision primarily based on metrics or patient satisfaction ratings.\n\n* Failing to adequately incorporate a patient’s personal preferences and social situation in crafting a treatment plan.\n\n* When one runs to the coffee shop to make it just before closing, only to find that they decided to close 5 minutes early.",
    "title": "A cranky hospitalist's top 100 pet peeves in inpatient medicine",
    "subreddit": "medicine",
    "timestamp": 1506921993,
    "score": 601,
    "keyword": "woman nurse"
  },
  {
    "text": "The Other Side: An EM Intern’s First Shift. *Preface: I shared this with /r/medicalschool and I wanted to share it here with /r/medicine as well. I have changed certain presentations and details to maintain relative anonymity. I wanted to share this narrative to let people see my perspective as a new EM intern. It is long, so please- feel free to ignore it.*\n\nAll the best,\n\n-wtffng\n\nI arrive 30 minutes early to find my ID badge won’t unlock the double wide magnetically guarded doors to the ED. It’s the morning shift, so someone should be close behind me- therefore, I pull out my phone, furrow my eyebrows, and completely pretend to be doing something important.\n\nA nurse walks by briskly and successfully swipes through the door with me stealthily following behind her. I walk to the resident workroom to find my key doesn’t work there either. A PGY-3 spies me fumbling and with a laugh pulls the door wide open.\n\nHe’s smiling. He’s excited for us to be starting. It’s genuine. He runs me through some basic charting requirements that haven’t been covered in 2+ weeks of HR classes and orientation, which at this point have all blurred together, interwoven between each night’s social adventures.\n\nMy shift begins at 07:00, and at 6:45 there’s a loud page “TRAUMA ACTIVATION, ROOM 4.” A grinning attending appears from nowhere, introduces herself- and instructs me to go to the trauma bay.\n\nA life threatening gun shot wound is arriving via ambulance and we’re tying our gowns down. The room is calm, but swelling with people and heat- everyone mutually understanding that this will most likely be futile.\n\nAn older nurse peers around the room, trying to ascertain who to eliminate.\n\n“WHOEVER’S NOT DIRECTLY INVOLVED, LEAVE NOW,” she instructs, likely insinuating me. Several people scurry out the doors and I turn to leave, finding myself facing another attending who firmly says: “Stay here.”\n\nThe nurse starts circulating, instructing people she doesn’t recognize to leave. I’m fully gowned with a mask, but I know this won't protect me. As she nears, I turn to the trauma cart and pretend that I’m seeking some device which will be useful in the near future. She passes and I turn back, an escapee.\n\nThe patient is rolled in and movement starts. Intubation, CPR - but within minutes it is determined that yes, this is most certainly futile, and the patient's time of death is called.\n\nI walk back to my ED section to receive sign-outs. The attending looks up warmly:\n\n“Welcome to the Emergency Department, Dr. Wtffng.”\n\nThere are three Interns, one PA, and one Attending. The attending looks around and wonders aloud “Do we have no senior here? No? Looks like a busy day.”\n\nWe’ve been informed that as interns our expectation for these first shifts are simply this: Do an HPI. Learn the system. Be honest.\n\nI haven’t done an EM shift in 2 years now, and my excitement is tempered by the growing realization that after 8+ years of education, I might know nothing.\n\nI push back against this thinking and set to work as the clock strikes 07:00. I look up at the patient board and see red rapidly disappearing as the team logins to the EHR. I scan the list and pick up the first one I see- a seizure.\n\nThe patient’s from out of town, no history available. No worries, I’ve done seizure work-ups plenty of times in the past, right?\n\nAs I walk towards the room the nurse pulls back the curtain and exits.\n\n“Hi! I’m WTF, the intern working with you today for the first time here.” We exchange formalities and he is kind. He’s patient. I ask him to let me know if he needs anything and what he thinks about the patient.\n\nSo here it goes. The first patient seen with an MD straggling along behind my name.\n\n“Hello, I’m WTF FNG, call me WTF. I’m the resident doctor taking care of you this morning.”\n\nThe patient is younger. Engaged. Smart. Here for work and he certainly knows more about seizures than I do. He informs me he’s got important things to do, and he hasn’t slept well the last couple nights and had a couple drinks the previous- likely the cause.\n\nI do an HPI and order labs. I’m trying to contact an outpatient neurologist in some far away state who I soon realize doesn’t want to respond to pages sent from East Coast Time.\n\nI pick up another patient, dizziness. I whisk into the room to find a pleasant older woman who is here only because her son was concerned. She’s got important things to do, and wants to escape this place to her cabin for the weekend.\n\nI tidy up things for my first patient and discharge him. He looks at me says “Hey- Thank you, that was really quick and thorough.”\n\nI laugh and respond “Hey I appreciate that. Don’t tell anyone on your way out- but it’s my first day as a doctor.”\n\nI smile, shake his hand and leave before I can see if his face drops into disappointment. I exit the room to find the nurse standing there, obviously overhearing this statement, with an expression somewhere between amusement and scorn.\n\nI am admitting the woman with dizziness and break the news that she likely won’t be making it to her cabin this weekend. There’s soft pushback. I explain that if she were my mother I’d want her to stay in the hospital for further evaluation, and I would.\n\nThere’s a small pause and I blurt out “if you want, you can call me Dr. WTF FNG, RUINER OF WEEKENDS. I propose a weekend of awful hospital food and cable TV rather than a relaxing weekend at the cabin.”\nShe stares at me for a moment, and begins to laugh. She agrees to stay. I exit the room again to find the nurse holding onto an expression somewhere between concern and breaking laughter.\n\nThese damn curtains. I speak loudly and everyone can hear my weak passes at wit.\n\nI step backwards onto a small neurologist who has somehow snuck behind me. He does not feel that another patient of mine warrants a neurological consult but he’s already here in the ED and he’s trapped. Success. A tap on my shoulder saves me from the debate and I set to fix one of the many problems I’ve created from bumbling through the EHR.\n\nI don’t know how to document properly for billing, admit correctly for admissions, and discharge sufficiently to get the patient out. The PA is a saint. Seriously. Every question is answered patiently, from phone numbers to drug dosing. My attending, also up for canonization- is juggling every patient in the section while teaching three interns. The nurses are supportive, and graceful as they inform me of each small misstep and how to fix it. I can tell I'm slowing them down, but they're as understanding as over-worked nurses can afford to be, and I'm damn appreciative of this.\n\nI sit and try to catch up on non-existent notes and again my shoulder is tapped as I’m halfway through a sent-\n\n“That’s you.” The nurse informs me.\n\n“What?” I respond confusedly.\n\n“Trauma to Bay 4.”\n\n“What?”\n\n“You. That’s you. Go to Trauma Bay 4.”\n\nIt clicks. Those overhead pages now address me at this time.\n\nThe rest of my shift blows by, fueled by pretzels and coffee. I see the sick and ill alongside the worried well. I witness the aftermath of tragedy that will surface darkly in the newspaper days later.\n\nEach time I sit to chart, my phone rings or my shoulder is tapped. I incorrectly place and fix orders. I am slow. I feel I know nothing. Things that went so fast as a medical student take longer now, and are so much more complex. There was no magic click or growth following the MD that was placed behind my name a month ago. I am still just me, with the same knowledge base. As I work I realize the auditioning medical students likely, or perhaps certainly- know more than me.\n\nI can feel hard in my gut that I don’t have a flow, nor method to manage the tasks constantly flooding me. My shift ends and I melt into a chair in the resident workroom to catch up on my mangled notes.\n\nTwo senior residents slide into the room and flop down on the couch. They are on an off-service rotation and enjoying the periodic downtime and freedom.\n\n“So how’d it go?”\n\nI explain my concerns about flow and knowledge, pace and expectations.\nThey laugh.\n\n“It comes with time. You guys are doing great, seriously. It’s a whole new approach and we all do it a little differently. In a couple months you’ll be managing all of this and more with ease.”\n\nThey pause and one asks “So what did you think?”\n\nI sit for a second and scan my hazy memory of the past 9 hours. For a moment my gut relaxes.\n\n“It was awesome. I made the right choice.”\n\nThey laugh.\n\n“wtf, Welcome to Emergency Medicine.”",
    "title": "The Other Side: An EM Intern’s First Shift.",
    "subreddit": "medicine",
    "timestamp": 1498599672,
    "score": 482,
    "keyword": "woman nurse"
  },
  {
    "text": "Women who are doctors: What are your experiences with sexism in the workplace and medical school? Does it ever get better? I'm a woman and I'm applying to medical school right now. Every person I meet who asks me what I studied in undergrad or what I do currently cannot seem to grasp that I am going to be a doctor. Every single time I tell someone I was pre-med and I'm applying to med school, the response is always some variation of \"oh, to be a nurse right?\" \"oh, so you mean you're going to nursing school.\" It makes me so mad!! If I was going to nursing school I would've said nursing school, not medical school. I feel like they're correcting me. This happens in bars, in ubers, at the hair salon, at work (pretty much every small talk interaction). And to top it off, when I explain that I am not going to be a nurse, but a doctor, I typically get some sort of laughter and mocking/teasing reaction along the lines of \"oh you must be real smart then right\". My male colleague has been asked by strangers if he is a doctor when he is walking through public wearing scrubs. Meanwhile, I literally tell people I'm going to be a doctor and they still can't understand how I'm not a nursing student. \n\nIs this the norm for other women in medicine? Does this ever change in medical school or the workplace? I want to hear other stories and know what to expect. Also any advice on how to firmly respond to certain comments would be nice too.",
    "title": "Women who are doctors: What are your experiences with sexism in the workplace and medical school? Does it ever get better?",
    "subreddit": "medicine",
    "timestamp": 1496727438,
    "score": 238,
    "keyword": "woman nurse"
  },
  {
    "text": "Fellow outpatient FP and IM providers, what tasks do you delegate to your staff? I recently came close to a nervous breakdown at work, because I was just so tired of working so hard, but seeing the mountain of work in front of me only grow, and facing a daily onslaught of patients and fellow employees annoyed at me for things undone. Our office manager (an experienced nurse and very people-smart woman) had a serious chat with me, and it came to her attention that I'm personally handling a lot of nuts-and-bolts tasks on my job that all the other providers at my practice delegate to nursing or clerical staff:\n\n* routine med renewals by e-script\n* prior authorizations\n* paperwork for durable medical equipment\n* legal forms\n* calling patients about normal labs and imaging\n* researching what the submitter of an unusual or unprecedented form for me to fill out wants exactly from me\n* checking if routine screening or monitoring labs are up to date\n\nI'm a highly self-reliant person, who's been faulted many times for \"trying to do it all\", long before I got into medicine. I don't easily trust people to do things for me and I have a hard time accepting favors. I try very hard not to be a borrower or a buck passer -- when a task is put in front of me, my knee jerk reaction is to just take it on myself and ask nobody for help. Less charitable people have described me as \"a control freak\" or \"not a team player\". I never scored well on Systems-Based Practice, and I'll readily admit that managing human resources is not a talent of mine.\n\nResidency did a piss poor job teaching me what nuts and bolts tasks of outpatient medical practice ought to be farmed out to supporting staff, versus done by the doctor. I was expected to do everything, both as a way to learn how the healthcare system works, and part of the (despicable, IMHO) boot camp culture of \"I can always do more\". Whenever I would ask my attendings, no matter how un-whining-ly, how much more I had to do or whether or not something was my responsibility or someone else's, I'd invariably get rebuked for even daring to ask, for breaking the polite fiction that residents are always happy to do more. So you could say I was conditioned not to delegate, but to put nose to grindstone and just do it.\n\nIt all makes sense now. For my first year as an attending, I've been taking on far too much. All of the items in my bullet list above are tasks my practice *would prefer* I farm out to support staff. Doesn't help that nobody ever told me this, nor that my nurse (medical assistant, actually) is brand spanking new too.\n\nHelp me out here, fellow Medditors. Imbue me with a sense of \"what's appropriate to delegate\" that I've never had.",
    "title": "Fellow outpatient FP and IM providers, what tasks do you delegate to your staff?",
    "subreddit": "medicine",
    "timestamp": 1491506323,
    "score": 41,
    "keyword": "woman nurse"
  },
  {
    "text": "I wanted to share a reminder of our humanity in medicine (OC) The man - A fugue\n\n&nbsp;\n\nA single wail\n\nMy guts twisted\n\nI saw the girl grasping her mother\n\nIn shock\n\nTheir eyes spoke the truth\n\nHer mother, brothers, the nurses too\n\nThe only one missing from all this was he - The man.\n\nHis body brittle, riddled with tumors\n\nJust barely past his 5th decade\n\nThe haughty halfway mark for those who have years in spades\n\nBut yet his body lay still on the blood-stained bed\n\nIn silent parade.\n\n&nbsp;\n\nA slow grave was all he could hope for\n\nSurrounded by family and friends in peace and quiet\n\nFor the rest of his days;\n\nBut even that he was denied\n\nInstead the cheap substitute death. Chaotic death. Inescapable death.\n\nExsanguinating with every last breath \n\nOn the flimsy trolley.\n\nAnd even as all this transpired next door\n\nI met the antithesis of this morbid story\n\nA woman, not too much younger than he\n\nFound unresponsive in a stranger's driveway\n\nGCS 8, responding to pain, vitals stable\n\nA history of alcoholism and borderline personality\n\nSo her files say\n\nAnd in that moment I couldn't control it -\n\nThe feeling, the rage. Unbridled fury.\n\nThis was not me!\n\nI started jumping straight to the point\n\nShe MUST be drunk! my own rage retorted\n\nA waste of space, a cruel injustice of life's great race\n\nWhy couldn't it be..\n\n..her?\n\n&nbsp;\n\nI stopped. Reflected.\n\nPaused briefly and meditated.\n\nTwo people died, on that one grim night;\n\nOne was he, the man in bed five,\n\nThe other person was the man inside me.",
    "title": "I wanted to share a reminder of our humanity in medicine (OC)",
    "subreddit": "medicine",
    "timestamp": 1486916434,
    "score": 31,
    "keyword": "woman nurse"
  },
  {
    "text": "Would a career in nursing, accounting or computer science suit me better? Hi r/careerguidance,\n\nI'm 26 and graduated with a BA in Geography and Environmental Studies in 2014. I've been struggling with a lack of direction and general indecisiveness ever since. \n\nI currently am a consultant at an oil and gas company doing \n a mixture of HSE / document control / admin type work. The lack of stability is making me extremely unhappy. I find myself wishing I had an established career like my friends who are teachers, social workers, nurses, etc. (I know I shouldn't compare myself but this is easier said than done). I'm constantly worried about being 55 and working entry-level retail for minimum wage due to my lack of concrete skills and poor choice of a degree. \n\nI think I've narrowed my choices down to three careers, but am having a difficult time deciding on which one would be the best fit. I've narrowed down my core values in a career to:\n\n1. Stability\n2. In demand (how nice it would be to not have to send 100's of resumes out and hear nothing back)\n3. ~$60,000 or >\n4. Not *extremely* stressful  \n\nI've put together a simplified list of pros and cons (based on my personality, requirements and geographical location) for each position below:\n\n**NURSING**\n\n*Pros:*\n\n* Helping people\n\n* Interest in biology, diseases, etc.\n* Entry level pay: ~$34/hr ($68,000)\n* In demand\n* Can move anywhere and can find job\n* Stability (unionized)\n* Flexibility (can work part time, casual, etc.)\n* Many different subfields within nursing\n\n*Cons*\n\n* Constantly being around people (introvert)\n* Poop\n* Stressful (some positions)\n* Potentially 4 years of schooling; accelerated programs very competitive\n\n\n**ACCOUNTING**\n\n*Pros*\n\n* Working independently (to an extent)\n* Entry level pay: ~50,000/yr\n* Once CPA, in demand\n* Stability\n\n*Cons*\n\n* monotonous\n* sitting all day\n* Entry level positions over saturated\n* Stress\n* 3ish years to get BBA + CPA courses\n\n\n**PROGRAMMER / COMPUTER SCIENCE FIELD**\n\n*Pros*\n\n* Working independently (to an extent)\n* Entry level pay: varies (~50,000?)\n* In demand\n* Enjoy coding and making websites\n\n*Cons*\n\n* Sitting all day\n* Being a woman in a male dominated industry\n* Advanced math.. I'd say I'm 100% average at math and I worry I won't be able to grasp the advanced concepts\n* Ageism - when I'm 50, will I be able to keep a job in this field or will I be replaced with someone younger and more knowledgeable of new technology?\n* 3ish years to get BCS\n\n\nAny feedback would be greatly appreciated! Thank you!",
    "title": "Would a career in nursing, accounting or computer science suit me better?",
    "subreddit": "careerguidance",
    "timestamp": 1505604416,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "We need to have a serious and frank conversation about sexism in this sub. I am appalled by the level of sexism that is prevalent in this subreddit. Most notably, two top threads today [here](https://www.reddit.com/r/cscareerquestions/comments/5rorr1/my_friend_and_i_had_too_different_interviews_how/) and [here](https://www.reddit.com/r/cscareerquestions/comments/5rlijr/software_development_how_would_you_behave_with_a/), kept reinforcing the notion that oftentimes, when a woman gets a job at a tech company, it's often got it due to their gender. Seriously, you all should be ashamed of yourselves. All of these unsubstantiated allegations from anonymous people are being upvoted and giving women in tech a bad name. \n\nWomen in tech have it insanely hard. Imagine being the only dude in a nursing program and you can see what these women are going through. Additionally, imagine if all of your accomplishments were ridiculed by everyone because \"you only got this job/promotion/project/etc. cause you're a girl.\" That would really suck and would totally destroy your confidence. \n\nTBH, for me, the women I know in tech are some of the best engineers I've ever met. I know that this is anecdotal, but the women on my team are entrusted with the largest and most important projects. They regularly deliver outstanding results and they are critical to the success of our (very large and very important) product at a Big 4. There are only three of them on our team of 20, but without them, our team and our product would fall apart.\n\nCollectively, as men in tech, we need to do a better job of calling out sexism and supporting women in tech at all levels. The gender ratio is appalling and embarrassing and reflects very poorly on our industry. It is partially a societal issue because society does not expect women to become software engineers. But if you think that men in tech are free of all blame, then you are a part of the problem. We need to encourage and mentor women in tech. I'm not saying that all men are part of the problem, but collectively, we are the problem.  **We need to stop pretending that the problem doesn't exist and start asking ourselves what can we do to fix the gender gap.** Listing anecdotes of \"reverse sexism\" that you think you've experienced does not count.\n\nI'm not saying that some tech companies don't offer positions to less qualified applicants because they're women. It happens, and when it does, it sucks. It's not fair to men or women when it does. However, that's a minuscule problem compared to the sexism that women experience every day in the office and classroom. The levels of women in CS at top companies and at top CS programs is relatively comparable, so when people assume that women are less qualified, it's saying that men are smarter than women, which is wrong and incredibly demoralizing to the women who are trying their hardest to succeed.\n\nYou may not be sexist at the office, and I applaud you if you aren't. But being sexist on the internet isn't much better. You may not say anything sexist at the office or on the internet, and you may actually be a feminist, but your failure  to call out and challenge sexist men is deafening. We should all be proactive in calling out and fighting sexism, wherever it is.\n\nAnd before anyone dismisses me as a pissed off woman, I'm actually a pissed off straight white male. \n\nI'm very open to a discussion about this, but I think we can all work together to making the tech industry and CS programs nationwide more accepting for women. Think about how much better our industry, our jobs, and our classrooms would be if we eliminated the gender gap. Let's all be leaders in making it happen.\n\nEDIT: Grammar and formatting",
    "title": "We need to have a serious and frank conversation about sexism in this sub.",
    "subreddit": "cscareerquestions",
    "timestamp": 1486097580,
    "score": 22,
    "keyword": "woman nurse"
  },
  {
    "text": "Feminist Nurse Who Tweeted: Every woman raises a detriment to society when they raise a son. Historically every son you had should be sacrificed to the wolves. Woman Being Investigated By Indiana University Health HR Department",
    "title": "Feminist Nurse Who Tweeted: Every woman raises a detriment to society when they raise a son. Historically every son you had should be sacrificed to the wolves. Woman Being Investigated By Indiana University Health HR Department",
    "subreddit": "MensRights",
    "timestamp": 1511723044,
    "score": 121,
    "keyword": "woman nurse"
  },
  {
    "text": "Nurse: \"Every white woman raises a detriment to society when they raise a son. Someone with the HIGHEST propensity to be a terrorist, rapist, racist, killer, and domestic violence all star. Historically every son you had should be sacrificed to the wolves\"",
    "title": "Nurse: \"Every white woman raises a detriment to society when they raise a son. Someone with the HIGHEST propensity to be a terrorist, rapist, racist, killer, and domestic violence all star. Historically every son you had should be sacrificed to the wolves\"",
    "subreddit": "MensRights",
    "timestamp": 1511666132,
    "score": 91,
    "keyword": "woman nurse"
  },
  {
    "text": "Indiana University Health nurse being investigated after tweeting “Every white woman raises a detriment to society when they raise a son.”",
    "title": "Indiana University Health nurse being investigated after tweeting “Every white woman raises a detriment to society when they raise a son.”",
    "subreddit": "MensRights",
    "timestamp": 1511658760,
    "score": 73,
    "keyword": "woman nurse"
  },
  {
    "text": "Why can women trick men in false fatherhood without repercussion? Why can a woman sue a hospital if the doctors or nurses mix up the children and give her the wrong baby but a man can't sue a woman for tricking him in paternity if he isn't the biological father?\n\nIt's is obvious that in the first case it was a simple mistake with no ill intent but in the second case the woman at least knew of the possibility and deceived the man so he wouldn't leave her.\n\nHonestly I think both should be possible but how is it possible that the act that happened without purpose is punishable but the one that was obviously with ill intent not?",
    "title": "Why can women trick men in false fatherhood without repercussion?",
    "subreddit": "MensRights",
    "timestamp": 1499529365,
    "score": 58,
    "keyword": "woman nurse"
  },
  {
    "text": "Mini victory?? I didn't post this because I already made a post about some women I have to sit with at my daughters gymnastics class. But last week a woman was sitting two people down from me with her child and made a comment that she would breast feed her child but couldn't because I was there. She didn't make the comment to me but I overheard it. I pretended not to hear it, got up a minute later (to not make it obvious) and left the areas and watched my daughter on the track above the gym to watch. \n\nLong story short, I just finished up dropping my daughter off and the woman came over and thanked me for stepping to another area but then apologized for her comment and felt she was being rude. She said she didn't think I was a pervert or anything, somehow knew I was a nurse, and just explained that exposing herself in front of a guy made her feel uncomfortable, but that it's not my concern, it's hers. She then showed me that she brought some kind of hoop covering so she could watch her kid but still feed her infant. I thought it was nice of her. Thoughts? \n\nJust and FYI, no I wouldn't have confronted her, no I didn't think it was my responsibility or obligation to leave but I felt it was the nice thing for me to do. I am a huge proponent of breast feeding with moderate discretion, anywhere a woman wants to. I was a bit annoyed but not hurt by her comment, I'm not a snowflake.",
    "title": "Mini victory??",
    "subreddit": "MensRights",
    "timestamp": 1507647678,
    "score": 25,
    "keyword": "woman nurse"
  },
  {
    "text": "This likely a stupid question to ask here, but ... Has anyone else seen the TV show \"Mad Men\" here? What did you think? (Apologies in advance for the slightly OT nature of this Q.) **Edit**\n\nThanks to everyone who commented. Here's a general response:\n\n> Couldn't take any more of it.\n\nThat's interesting as I'm in the middle of Seasons 3 - the 1963 season - right now.\n\nI'd never seen it before and have only started watching it now as it's come up on Netflix. I'd avoided watching it because I used to work in a place that was 70%+ women and the snippets of conversation about that I caught didn't exactly make me enthusiastic.\n\nLike most people, I'd also heard how strongly feminist the show was and that made me even less interested.\n\nHowever, I have to say that I think the show's been massively oversold on the feminist angle and massively undersold on what it has to say about men and the lives of men.\n\nPerhaps the overselling on the feminist angle came later as the show took off and took off hugely with women viewers, especially (apparently) among professional women graduates in the 25-34 age group.\n\n* To take one recent example, as lead character [**Don Draper**](https://cdn.psychologytoday.com/sites/default/files/blogs/103195/2014/04/148114-150804.jpg) rushes his wife [**Betty**](http://www.theweeklings.com/wp-content/uploads/betty.png) to the maternity ward to have their third child, a battle axe of a nurse blocks him from going any further and rudely scolds him for trying to follow his wife into the labour room.\n\nThe scene then cuts to Draper with another man ([**Dennis**](https://pbs.twimg.com/media/BoMvaFJIEAA4lZX.jpg)) - a prison guard who is anxiously awaiting the birth of his first child - this man's repeated requests to find out how both his wife and child are doing are repeatedly denied by another hostile and officious nurse.\n\n* We are also repeatedly shown different views of parenting - good parenting, bad parenting, crazy parenting. And in these scenes, what comes through is that many of the women portrayed are absolutely hopeless as parents. Likewise, the importance of male figures in the lives of the children is highlighted - [**Sally**](http://1.bp.blogspot.com/-S8-ChyTVqog/VTs3EcJANVI/AAAAAAAAgTk/YU0PqhzAYb4/s1600/sally-then-400.jpg)'s very close relationship with her grandfather, [**Gene**](http://www.trbimg.com/img-5512f729/turbine/la-et-st-mad-men-sally-draper-20150325-003) and with [Draper](https://evesreellife.files.wordpress.com/2012/04/don-and-sally.jpg).\n\n* And while [**Peggy Olson**](http://images.hellogiggles.com/uploads/2015/05/03/Peggy-Olson-Character-Cap.jpg) is clearly being presented as the woman of the future - bright, capable, independent and ambitious - she has both literally and symbolically sacrificed family life for her goals: [she has given up her illegitimate son for adoption by her elder sister](http://3.bp.blogspot.com/_0KRN69leV-Q/SKLc7rksRPI/AAAAAAAACh0/Eetq8Qx1CPY/w1200-h630-p-k-no-nu/madmen4-peggy.jpg) and she is increasingly being shown as becoming alienated from her very tight-knit Brooklyn Catholic family and community.\n\n* Added to this, there is a wonderful scene with [**Jane**](http://3.bp.blogspot.com/_A9fNctDQu8Q/TLS1pvvOM8I/AAAAAAAAA14/dq1JQrMtFs0/s1600/2e36glk.jpg), a 20 year-old secretary, and several of the older Ad men. Cooper, the agency's senior partner, has acquired a Rothko painting and the men are discussing how they would love to see it. Hearing this, Jane tells them that Cooper is gone for the rest of the day and starts heading off toward Cooper's office. \n\nThe men are both excited and terrified - for good reason - about going into Cooper's private office. Jane smirks patronisingly at them and gaily waltzes into Cooper's office, laughing at the men for being silly. The men then have no option but to follow her inside - i.e. because not to do so means being shamed and losing face to a young and attractive woman.\n\nWhat's interesting though is that when word of their going into the office gets around, Jane is confronted by Office Manager [**Joan**](http://vignette1.wikia.nocookie.net/madmen/images/8/8f/Joan_and_jane_stare_the_gold_violin.jpg/revision/latest?cb=20130320141128) and reprimanded for what she has done, Jane immediately bursts into tears and blames the men without a second thought.\n\nJoan, as another woman, sees through the act instantly and fires Jane for insubordination. Jane, not to be outdone, runs straight to much older man, [**Sterling**](https://thenypost.files.wordpress.com/2015/04/jane_madmen-e1428352828241.jpg?quality=90&strip=all), a senior partner in the firm, and he immediately rescinds the firing and gives Jane her job back. Not only that, but Jane goes on to marry the much older (and richer) Sterling. \n\n* And speaking of money ... When the Ad Agency is bought out by a British firm, Don Draper receives a windfall of $500,000 dollars. Until this point, he has been banished from the family home by his wife Betty for an affair he has had (that she knows about) with another woman. \n\nDespite repeated efforts of Don to allow him back home and even despite the pleas of both her children to allow Don home, Betty has steadfastly refused.\n\nBut then Don tells her of the $500,000 dollar windfall and then ... she lets him back in.\n\nThere is clearly a feminist message to *Mad Men*, but I am more and more convinced that there are other messages in there too and it might be worth a second look.",
    "title": "This likely a stupid question to ask here, but ... Has anyone else seen the TV show \"Mad Men\" here? What did you think? (Apologies in advance for the slightly OT nature of this Q.)",
    "subreddit": "MensRights",
    "timestamp": 1493408752,
    "score": 8,
    "keyword": "woman nurse"
  },
  {
    "text": "US political ideas for mens rights that everyone should be able to get behind? Hi guys, so I've been thinking, beyond just ranting about society, what some of the ways we could make political change that would address the problems men face in the world. Especially thinking about the sorts of proposals that people on both sides of the red pill might be able to get behind, since those are the sorts of ideas that are easier to push legislators on. These are just some of the things I've thought of, please give feedback!\n\n1. The legal system and police need to take rape and domestic abuse more seriously, regardless of gender. There needs to be more support for men who have been raped and are victims of domestic violence. Society needs to tell men it isn't okay for us to be hit or that we're supposed to \"suck it up.\" Also, more support for men and women who are perpetrators of rape and DV, anger management, mental health, etc. There are programs to help women escape domestic violence, how about programs to help guys (or girls) who know they have a problem with anger and an inclination for violence, where they can go to learn better ways of being a partner.\n\n2. Higher wages - wages that you can support a family on. How are men supposed to even provide for our families on wages these days? Wages are so much lower than they used to be. How's a man supposed to even attract a real woman in the first place if she looks at his job and knows he doesn't have the money to support kids? Sure, a woman should have the right to take a job if she wants or needs to. But the big businesses have cleverly made sure that most women NEED to take jobs, because it keeps wages low, they can pay two working people the same amount as they used to pay one, and the guys on top who marry wife after wife and support three families and a yacht and don't work a real day in their life pocket the difference.\n\n3. Better trades schools. Industrial jobs that used to be good wage jobs have been taken over by robots these days. Family wage jobs are often trades now, and we even have a shortage of some of em. Community colleges prepare you to be a nurse or a programmer, which are also great family wage jobs, but we don't have good high school and post high school programs to prepare young people to work in trades. Other countries do this, we should be able to too.\n\n4. Better PTSD and mental health support for veterans and maybe something like a modern day GI bill, for job retraining and matching. If we did it back then, we can do it today. There are programs, but they are scattershot and generally locally supported, rather than coming from the military. We have a generation of young men who have fought for us over the past ten years, have physical and mental scars, and are struggling to get by in a sucky economy with no well paying jobs.\n\n5. More male teachers in schools. Teachers should reflect the populations their school comes from, and half of students are male. I don't have great ideas for how to do this. Maybe this means paying teachers wages you can support a family on because some parts of the country do, and some sure don't, and respecting teaching and treating it like a real, proper job, like they do in Asia, and not just babysitting.\n\n6. Prison reform - support and redirect young men who have made mistakes, rather than criminalize them. End the war on drugs. Guys who are so depressed because there are no jobs who start taking opiates because at least hey they can feel good for once in their life, we need to give them good jobs, not stick them in prison for the next decade. Our societal default is to just lock them up, because hey, it makes the companies who run our prisons lots of money, and guess which companies donate lots of money to our legislators... Stop making money off of young men like they're there for your slave labor. Treat them like guys who have had a tough break who really need some respect, a good job, and maybe some life skills and anger management. Obviously I'm not talking about the actual serial killers etc here. But low-level criminals, a guy who was selling a few joints? We lock up way more young men that literally any other country in the world, and it isn't because our men are uniquely bad people, it's because we treat them like crap and the scumbags at the top try and make money off of em.",
    "title": "US political ideas for mens rights that everyone should be able to get behind?",
    "subreddit": "MensRights",
    "timestamp": 1495154218,
    "score": 10,
    "keyword": "woman nurse"
  },
  {
    "text": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things) Hey everybody. I haven't posted here before but I thought this recollection is relevant, both in an alarming way and as an example of the kinds of anti-feminist rhetoric making waves not only on r/Men'sRights, r/the_donald and the alt-reich pits of 4chan, but also on nationwide daily conservative talk radio.\n\nAs a fiction writer intrigued by the depths of conspiratorial thinking, conservative talk radio is like a nightmare paradise. I started tuning in pre-election to try and comprehend some of the right's perspective, principally the stuff the right is being told by their media. Aside from a constant stream of slant and innuendo, and general fear-mongering, this segment from a few weeks back really stuck out.\n\nSavage's topic: \"an epidemic of false rape allegations perpetrated by radical feminists.\" Fitting neatly with the \"Look at what's happening to our poor boys!\" trope, he asked for callers to relay experiences of faked accusations for the purpose of slander and character assassination. His first caller was a woman in tears. She was barely able to speak about experiencing a rape in her youth that she was never able to get herself to publicly admit before. It was very hard to hear, particularly when Savage was less than accepting at first, asking her why she never came forward, asking what she hoped to get out of admitting it now. Eventually he relented and wound the conservation toward some notion of an older, better America where \"your brothers would take care of it.\" \n\nThe next caller was a guy who was utterly on board with Savage's thesis. He said that his sister-in-law cooked up a story about him molesting her kids, even coaching them to lie to lawyers, in order to discredit him and get him fired from his job (which was successful.) When asked why she would do this, he said \"she just didn't like me\" (the most suspect sentence I've ever heard, BTW). Regardless, this fakery, while manipulative and wrong, had nothing to do with feminism and/or sexual assault of feminists. So Savage was 0 for 2 on his big evil topic. \n\nThe third was a guy who was raped while attending a christian monastery. It was another sobering discussion of sexual assault and the effects it has on the body and mind, denial, acceptance, the unstable road to recovery, etc. \n\nCaller after caller...zero examples of false rape allegations. The segment concluded with a nurse who specialized in processing rape victims, she laid out all the gory details of examination, while Savage tried to derail her data and facts with ideas like \"Well if there's no clear DNA evidence, the claim must not be believed, right?\" He didn't get far on this tract. Strangely, they ended up on mutual terms when ascribing a rise in rape incidents and rape culture to violent video games, violence in films and, both inherently racist and lazy, on rap music like Kanye West. The segment trailed off into Savage basically thanking his audience for a frank discussion of a very hard topic, and then the station was barraged by ads. \n\nConsidering where things ended up, it was easy to forget how it began-- Savage wanted to hear about devious man-hating and man-destruction by means of what he sees as a pivotal radical feminist tool, the pointed finger of accusation and the presumed guilt of the men being accused. But when exposed to real people in the audience, with real experiences, there was a near unanimous 180 degree turn. As brutal and frightening as his initial topic was, and how horrific it is that such concepts are preached to the masses as being some epidemic feminazi plot, he totally failed. It was heartening in a grim way. \n\nAnyway, thought I would share this attempt to demonize feminism, particularly because the response was not only lackluster but such a reversal. Other such BS, particularly online, gets hateful and vile very quickly.",
    "title": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things)",
    "subreddit": "Feminism",
    "timestamp": 1483351001,
    "score": 1,
    "keyword": "woman nurse"
  }
]