[
  {
    "text": "Is it time to leave? Or ride it out? Gonna be a long one, I'll put a tl;dr at the bottom.\n\nI started working for this startup in San Francisco as a software engineer a little over a year ago (right before my 23rd birthday, just turned 25) after leaving another startup that was on the way towards going under. I initially was happy, liked basically all of my 20 coworkers, and was getting paid far more than my old job (80k->120k), and the company was smaller but making more money than my old company. The boss I'd be working under was a large part of why I joined as well, he seemed very intelligent and had both leadership and technical skills. I was learning a lot from my boss and making friends at work. Life was good for the first few months. \n\nFirst steps on the downward spiral were that a few of the salespeople were let go because the company was pivoting and they weren't able to hit numbers. Understandable, but at the time one of them was the person I hung out with most outside the company. That was a bummer but didn't affect me too much otherwise.\n\nLater, the CEO brought in a senior salesperson who basically was doing the job of the existing VP of sales. This new sales woman is very immature and difficult to be around but for some reason my CEO likes her and she has lots of useful connections. VP of sales cannot work with her and says it's her or me. CEO lets VP of sales go and new sales woman becomes VP. So CEO just effectively threw out the sales dept and got a new one.\n\nAt some point after that my team (engineering) is looking for new blood. My boss brings in this guy(E) who was very eccentric and not just a little pushy and annoying. However, E's worked at some high profile companies and my boss determines that his technical skill is above and beyond. I have reservations but we hire him.\n\nAt some point he puts one of my coworkers, and eventually my boss, in a choke hold as a joke (he's very into martial arts and likes showing off). My boss comes extremely close to firing E for that but gives him a warning and he calms down a little (just a little). Things are relatively smooth for a while.\n\nThen my boss has an aside with me where he tells me his paychecks have been late and having a mortgage, a stay at home wife, two new kids, and not a lot of savings, finds this to be a problem. My paychecks have been late by a day about twice (his were more frequent and later), but I don't really care that much since I save much more than I spend and don't have anyone else relying on me for subsistence. \n\nThen my boss quits out of the blue and calls me on a Sunday to tell me so. He found another more stable company and jumped ship. I'm upset because the reason I joined the company was largely because I wanted to work with him, but I'm not too surprised. Still, I've been getting paid well and so I eventually decide to stay, though he mentions that he could be interested in migrating the rest of the team to his new company if we're interested. \n\nThis leaves a sort of power vacuum. The project manager (basically a go between for design, engineering, sales) assumes organizational leadership while E is left as the most technically experienced on the team which makes him the de facto lead engineer. This kind of works for a while and we're still able to get things done but it's very different than working with someone who's the clear leader. \n\nEventually the CEO pulls the same thing with the PM as he did with the VP of sales. He brings in someone more experienced(T), they work along side each other for a while in overlapping roles, and then suddenly the CEO fires PM (a week before his wedding no less) with no warning. I spoke with PM (who was one of the people I liked the most of the remaining original coworkers) and he was understandably livid and has it out for the CEO now. I don't blame him.\n\nI finally decide I've had enough (maybe I'm next?) and immediately after that I start looking for jobs (this is about 5 weeks ago). I set up a few interviews but shortly after, my new (3rd in a year) boss T gives me a 10k raise and a promise of a 5k bonus in November. I decide to relax my job search since this is an indicator to me that I'm not going to be fired soon.\n\nA couple weeks later, one of the members of my team gets let go. To be fair, he was probably the least productive of the 5 of us, but again there was no warning and we were told in passing at our weekly meeting that happened to be that day (I was wondering why he hadn't been in the office). I'm sure this was pushed for by E and T signed off on it. The worst part about this is that apparently T claimed that he was given warning, but when I spoke to my former team member after he claimed this wasn't the case and that he was told \"It was a decision by the team.\" Really rubbed me the wrong way. \n\nThat was last Monday. On Friday of last week one of my remaining teammates pulled me aside to get my thoughts. He told me he was thinking about leaving and I told him I've been having similar thoughts. He told me that our only other remaining original member also was, now it's just the 3 of us with E and T. So all of the original team is either gone or wants to leave. \n\nThroughout all this, other people have been fired/quit and new replacements have come in. The company is roughly the same size as a year ago but only about 1/4 is the original team. People seem to be very disposable here. \n\nI haven't quit yet because:\n\n- I'm getting paid 130k a year with benefits, unlimited PTO at age 25. Don't want to let this go lightly.\n\n- I just got a raise and have been told I'm valued so I don't thinking being fired is very likely for me.\n\n- I'm in the office at most 40 hours a week, usually a bit less. From what I understand this is better than average \nfor my industry.\n\n- I've hit my stride with our code base. I'm fairly familiar with pretty much every part of it and I can crank out features quickly now, I'm probably the more productive of the original 3 engineers left. I'm producing a fair amount even taking the time to make long reddit posts like this.\n\n- Apparently our financial issues are about to alleviate, we have several investors at $1 million each but need a lead. Once that comes we're safe for a long time.\n\n- Some of the new hires are people that I like. Not most but a few of them. Don't know them very well yet.\n\n- There are still a couple people left outside of engineering I respect and occasionally spend time outside of work with. \n\n- I don't have a better job lined up yet, because...\n\n- Interviewing takes a SIGNIFICANT chunk of time. I've stealthily left the office or come in late quite a bit and I don't want to push my luck.\n\n- With all the firings, I can see why my CEO or T did it. They were good business decisions but they just demonstrate their belief that employees are very replaceable. And this is a tech startup in San Francisco, it's true.\n\nI've slowed my job search but I have a day long interview on Friday with a fairly promising company. Don't have much else on the horizon yet but like I said I haven't been looking as much recently. I haven't asked for time off yet especially since I have a week long vacation on the calendar a week later and I've been taking chunks of days off a lot recently for other interviews. However, I've still been getting lots of work done and moving my hours around so I still work close to 40.\n\nBasically, interviewing (especially for an engineering position which is like several hour long phone calls and multiple in person meetings, one up to an entire day long) is exhausting and takes up too much of my time that I *should* be working. \n\nI know I'm not going to be at this company long term but should I really try to leave right now? I'm very comfortable where I am, money still flows in, it's just that I know it's not a long term solution and I pretty much keep to myself now, whereas I used to be fairly social at work. I just don't like most of the people here now, but then again as an engineer I don't need to interact with them much. I have friends outside of work so it's not like I'm starved for social interaction. I'm OK with this. (dog wearing hat in burning house picture)\n\nAnother option is I just go on interviews whenever I want and wait for them to fire me while collecting paychecks, but that just feels sleazy, even though this company probably doesn't deserve better.\n\n__tl;dr__ used to like my company, people left or got fired, feels like a totally different place, but I'm still getting paid well and the job isn't stressful, so should I just ride it out until it does get bad and quit or actively try to find a new job while juggling interviews and my current one?",
    "title": "Is it time to leave? Or ride it out?",
    "subreddit": "jobs",
    "timestamp": 1502220867,
    "score": 8,
    "keyword": "woman engineer"
  },
  {
    "text": "Looking to start a career in robotics - did not get my degree in science - Help Okay, I'm having a hard time editing my whole spiel on this - because I feel like all of it is important info to reach out for help. I'm probably wrong... but bear with me if you can. \n\n&nbsp;\n\n\nMy whole life I have wanted to work in the field of science, but I have never had the self confidence to believe I could do it.\n\n\n&nbsp; \n\n\n**I just want to know the initial steps to driving my career this way.** I have not received my degree in engineering, and I've been in the workforce for about 3 years - none of my jobs relating to what I want to do. (*Except for MAYBE when I was a \"product designer\" for Leapfrog*)\n\n&nbsp;\n\n \nIdeally I would love to leave my job for some sort of entry level position at a job related to **robotics**. Right now I am working long and inconsistent hours, its making it hard to properly schedule my free time to move in the right direction. I would just do volunteer lab work - but given my lack of spare time I haven't been able to find something that works, while I still can pay for things like rent and food. I would love to just leave my job for a full time entry level position in a lab environment, something like a research assistant... but perhaps wouldn't require a degree? Does that even exist?\n\n\n&nbsp;\n\nMy interests lie in two realms of this field - one pertaining to creating “artificial bodies” and one to creating “artificial minds”.\n\n&nbsp;\n\n \nStarting with the first; I feel the best fit would be seeking out a career in mechanical engineering. I’ve worked with “making things” my entire life to know that it's something I enjoy thoroughly and could do for a lifetime. I attended Cooper Union - which is an especially technical school; the quality of something we crafted / built was heavily stressed. I've learned to create a \"product\" from various materials, and I’m confident that I possess the grounding skills in design, physics, and construction; that would give me a solid base to grow from when acquiring the technical knowledge of machine making. I'm trying to find affordable mechanical engineering classes... but again - with my current job situation - it's hard to find something that will work.\n\n&nbsp;\n\n \nMy other career interest pertains to skills that are more foreign to me, (which, ironically, makes me want to pursue it more) developing AI. The appeal of this field for me stems from my ongoing interest in cognitive science. During my education, these were the classes that I was very successful in, and enjoyed the most. My teachers really appreciated the projects I would present, and I was fully absorbed and involved. Though I wouldn't say I’m an expert in this area - I wouldn't say I’m a layman either. What I am lacking in is a background in computer science. Though I dedicate most of my spare time to educating myself; tinkering with basic configurations, and reading up on various subjects pertaining to it - I’m looking into taking my technical knowledge to the next level by taking classes geared towards this field. I want to turn the energy from my interest in cognitive science into fabrication, I want to learn how to materialize the thing I’ve only been able to learn about on paper and see in nature, like the mind and consciousness. So these would be the fields that would be more geared towards becoming an algorithm specialist / computer scientist of sorts. Right now I am taking some online courses... but obviously would need to do more to actually dive into this field.\n\n&nbsp;\n\n \n**Ideally** - I would want to find something where I could be involved in the production of both these facets… but I don't know if a career like that exists.\n\n&nbsp;\n\n \n**Creation of a product is the essential goal**.\n\n&nbsp;\n\n \n*I do have a driving force behind this passion that I know is unrealistic but could maybe help contextualize what / why I want to do with my life ( in a diluted way)*\n\n\n&nbsp;\n\nFor the past couple of years, I've experienced this recurring dream :\n \n&nbsp;\n\n>In my old age, I have created the first “true” AI, that manifests itself as a small childlike robot - thus initiating the onset of the technological singularity. I am being interviewed by a woman while holding the robot in my lap. She asks if I have any regrets, and mentions that I have given up finding love, starting a family, and other things of that nature. I well up and tell her that though at the time it might not have seemed beneficial to go through those pains and hardships, finally creating this machine was my purpose and I live with no regret. I feel an overwhelming amount of happiness -- and then I wake up.\n\n&nbsp;\n\n \nThough this is obviously fantastical; this \"dream\" encapsulates what drives my passion for this field. It might make me seem melodramatic (or even make me look like a loon) but I am willing to take any steps - to start making moves towards this career...as long as they are moving me toward the right direction. I just feel like I'm golfing in the pitch black right now... I just want to be able to at the very least see the direction I should be swinging - no matter how far away the hole is. lol god sorry for these corny things i just don't know how to describe myself\n\n&nbsp;\n\n \nI would be immensely grateful for anyone that would be willing to guide me!!",
    "title": "Looking to start a career in robotics - did not get my degree in science - Help",
    "subreddit": "jobs",
    "timestamp": 1514577154,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "About to leave my job: Worth it to tell my boss why? Just to explain: I have a PhD, I have about 6 years direct industry experience in addition to my degree, I started this job in February. I'm also the **only** woman in my department (engineering). There are about 130 people in the department.\n\nMy boss is a Cali hipster. Nice enough in person but he continually minimized my experience and expertise (he recommended an engineer 10 years my junior to be my \"technical mentor\"...sure, I can learn *something* from that engineer, but hardly in a mentorship role). I was passed over several times as a lead on various projects (because I lacked experience according to them, even though I had direct experience in that particular field...and knew the customer) and was instead assigned as a supporting role on different, smaller projects. At one time, he actually sent me off to make copies of an agenda instead of attending a meeting with a customer.  In short, it was insulting.\n\nAnyway, I reached out to my network, got a couple of interviews, settled on one company, and am about to accept their offer. \n\nMy question is: do I tell my boss the real reason why I am leaving or do I give vague platitudes? The real reason is that I feel like my gender hindered my advancement. I'm not going to get into the details of this, but I'm about 99.5% certain (I know my male predecessor, he had less experience than I did and got more responsibility right off the bat). \n\nMy platitudes would be along the lines of geography (\"I just want to be near my family\"...ugh).\n\nMy main concern is the trade off between my reputation vs. the women that come after me... I don't want them to think of me as the disgruntled woman engineer yet if women follow me in those footsteps, I want management at least to know that there's some serious bias in middle management against women.",
    "title": "About to leave my job: Worth it to tell my boss why?",
    "subreddit": "jobs",
    "timestamp": 1506048776,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Is this a job scam? Well, someone supposedly from my college sent out an email about a job opportunity being a Personal Assistant to an engineer who is launching a start-up company. This was about a week and a half ago. This person, lets call her Rachel, put an email address to contact the man, we'll call him Rob, who is starting this engineering company. So I emailed Rob on his personal email, and sent him my Resume. He offers the job, I accept and here is the how the further conversation took place. I've changed all the names, let's call me Bill. The first thing I did was give him information that he requested for a background check.\n\n>Me: Name: Bill\nEmail: bill@gmail.com\nMailing Address: 100 Main st\nCity: New York\nState: New York\nZipcode: 0000\nPhone number: 555-555-5555\n\n\n\n\nI gave him a false address, for a rental home we used to have, because I know my mail would just be forwarded to me.\n\n\n\n\n>Rob (person I think is trying to scam me somehow):\nGood evening Bill, your application has been accepted after thorough consideration. Good to have you on board. For now communication will be via text and email, however I'll keep you informed as soon as I make a list of things you'll do for me and email them to you.\n\n\n>Me: That's fantastic!\n\n\n>Rob: Good evening. This is just to give you more information on the nature of the job. Your basic job is to remind me of events and help me sort out things when necessary. You could also need to help me book a flight when I need to travel, I will always send funds in form of a check that will cover the bills for whatever I need you to do for me, as well as payment for your work for me. Understood?\n\n\n>Me: Yes I understand.\n\n\n>Rob: Your first assignment will be communicated across to you tomorrow (Tuesday) morning so make sure you check your mail and text for updates. Have a great evening. \n\n\n>Me: Alrighty\n\n\n\n\nI was already suspicious of this man before he even asked for background information. I have Google searched the man. Nothing comes up for his name within 50ish miles, but there is an engineering company start-up with his name in the big city that is about 180 miles from me. I also searched the woman who sent the original job offering email (Rachel) and found her actual Facebook page. She did graduate from my college, but she only has 54 friends and her profile pictures are of insects (but that is her claimed job so). I'm just at a loss at if this is real or not because neither me nor my father know if it is true. I thought it would be nice if a fresh pair of eyes had a look at this issue.",
    "title": "Is this a job scam?",
    "subreddit": "jobs",
    "timestamp": 1487656060,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "As a child of rape, I would understand if my mother aborted. This is for anyone who is debating having an abortion or not. I want you to know, no choice is the wrong choice. \n\nGrowing up I didn't know my donor (aka my father, but I refuse to call him by such a worthy name). The only thing I knew about him was that if my mother saw him while we were out, she would grab us and run as fast as she could in her car and race off. I had no idea what was going on. She seemed frightened. I never understood why...\n\nWhen I was 14 I met extended family from my donor's side, I finally had a chance to meet the man I had been dreaming about. The man that would make me whole and explain who I truly am. \n\nI met him and it was great. We got a long really well. I went to seem him and my family as much as possible. One day he asked to speak with my mom. I asked her and she said no. I asked why? She contained to tell me no. \n\nOne day she dropped me off at his house and he came outside and hello to her, she looked stiff and afraid and was very cold. I didn't understand. I asked her what was wrong but she ignored me and said go ahead. \n\nAfter a year of being around this man, our new found relationship started to sour. He would ask for money and use it to purchase drugs. One day I had enough. I was raised by my grandfather and he never EVER resorted to such despicable levels. Luckily I had enough common sense to know this was not right and called him to tell him I never wanted to speak to him again. He agreed and that was the end.\n\nI went to my mother and explained what happened. She said \"let's talk.\" We sat down on my bed and proceeded. \"You were born out of rape.\" I never wanted to have a child by this man.\" The day it happened he was high and beat her with my sister in the other room. She was on birth control but it failed and she found out she was pregnant a few months later. \n\nShe continued to explain that even though she called the cops, he would always come back and beat down her door and she was almost to the point of being evicted so she would let him in. She told me she didn't believe in abortion and it wasn't my fault so she decided to keep me and she does not regret it. \n\nMy heart sank. I flashed back to all the times she ran away in terror and all of the times I asked her to talk to the man who brutally beat and raped her. \n\nI asked her to continue the story and tell me everything. She continued to explain that after I was born, she tried to involve him in my life, but he continued the beating. \n\nSide story: My sister once told me how he was babysitting us while my mom worked and he was smoking crack, she smelled the smoke and pulled me into the closet to protect me. She was only 5 years old. It didn't make complete sense until now. I cry every time of think of this, my sister protecting me. That was the last time. \n\nThe final straw, after the cops had failed to keep this man from beating down her door, was the final time he visited the house high. This time he threatened my life. He picked me up in front of my mother and held a knife to my throat and threatened to kill me. I wasn't even a year old. My mother screamed and finally let him beat her bloody. \n\nShe grabbed us and drove as quickly as she could to our grandparents house. She proceeded to buy a gun and wrote his name on the bullet. \n\nLuckily she never used it. The gun went missing, we found it years later in my grandfathers room.\n\nAfter this she met my little brothers dad, he in a way helped save her. He helped save her because when this man would come around ignoring the restraining order, my brothers dad would be there and made sure my donor didn't come anywhere near us. I am eternally grateful for that. \n\nAfter I found out all of this, I broke down in tears. My mother, who over everything else was always 100% honest and so strong. Didn't tell me this sooner because she wanted me to find out who he truly was and make that decision on my own. She spoke to him in fear and waited. It still kills me to this day.\n\nI want to tell you. If I was her, I would abort. I told her I wouldn't have blamed her if she did. She had to look at me every day of my life as a constant reminder of what she went through. \n\nShe said that it wasn't my fault. \n\nI work hard everyday and have become very success and I feel she deserves everything for keeping me. I will give her what this man took. I will be buying her a house as soon so she can live comfortably out the rest of her days.\n\nI am the product of my mother. I am her strength, and her will. I have become successful because of her influence. I help others and she does. She never makes me feel anything but love. I wish I could be half the woman she is!\n\nThis man has no claim to the person I am and the person I have become. I have seen him in passing in my hometown but he does not exist in my world. No anger or hatred, just existence. \n\nSo as the child of a situation like this or any situation where you feel you need to abort the child. If they were alive, they would understand. I'm alive and I understand. \n\nIf you decide to keep them and struggle through it all. Know they will love you with everything. \n\nI would love my mother either way. So make the decision that is right for you.  \n\nI want everyone to know that she has met the love of her life now and he treats her like the queen she deserves to be and has restored her faith. \n\nIn Summary: I was the child of rape, my mother chose to keep me instead. I told her I would have understood if she did abort because if I was in that situation I would have aborted my child. I told her I would love her even if she did. No woman should have to go through what she went through.  \n\nEdit: Wow. I just woke up and saw this. Your stories brought me to tears. Thank you very much for your kind words! My mother is my pillar of strength. I'm glad she trusted me to make the right choice. After I was born he left her life, she went to school and became an engineer. She didn't finish high school so it became a turning point to be independent of men as she says. She has raised my sister and I to be very strong. We know how to fix our own cars from oil changes to tire changes, use power tools, and take care on our own. Happy Mother's day to all of the mother's out there who kept us through the pain and healing!",
    "title": "As a child of rape, I would understand if my mother aborted.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1494702528,
    "score": 6968,
    "keyword": "woman engineer"
  },
  {
    "text": "The only female sales engineer in the class - a reflection on comments made by the instructor. I am a sales engineer in a male dominated field. More times than not, I'm the only female in a class or workshop. Today was no different. \n\n\nThings that have made me angry in today's training class:\n\n\"I'd like to point out our first woman to take the class, OP!\" \n\nOveruse of gratuitous adding of \"or herrrrrrrrrr\" with stares at me. \n\n\"Before we leave even OP will know how to program this!\" \n\n\"I want to see you trying this Op!\"\n\n\"Oh now, you didn't break it, did you OP?\" (At which point my table mate angrily said \"no, she didn't.\") \n\nHe came over to show me something. I was holding the programmer. He reached one arm on either side of me, like he was teaching me to play pool on a date, to demo the programmer.\n\n\"OP you have my respect. Every other woman salesperson I've dealt with has left after lunch.\" \"Well, that doesn't have anything to do with my gender. It has to do with me being good at my job and respecting my company.\" \"Nah it's because your boss is here, right?\"\n\n\n\n\nI'm fired up. I'm so mad. I'm also 7 weeks pregnant and hormonal. And I have to hold myself back because my boss is here. 99% chance of a rage cry on my way home. \n\n\n\nUpdate: I told my boss and he said \"eh that's not that bad.\" Then the sales manager from the instructors company asked why I didn't fill out an evaluation form. I told him that the constant references to my gender and the comments made were inappropriate and uncalled for, and if they ever wanted more women sales people to stick around this is not the way to do it. He agreed it was unacceptable, and said he'd set it straight. Don't know if I believe him but I feel good now that I got it out.",
    "title": "The only female sales engineer in the class - a reflection on comments made by the instructor.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1490298230,
    "score": 558,
    "keyword": "woman engineer"
  },
  {
    "text": "I'm an engineer. Let's talk about bras. This is a serious post and this seems like a respectable subreddit.\n\nI am a guy, an engineer, married and have a teenage daughter. I have the utmost respect for ladies. When I have gone shopping with them, I see their struggle to find that \"perfect fitting\" bra. At any given time, they only have 2-3 that fit really well. That, and washing bras can be so precarious... elastic bands losing their elasticity, wires coming out, etc, etc.\n\nI know there are custom bra-fitting stores, but they are also outrageously expensive. That, and as a girl continues to grow into a woman, she'll soon outgrow such bras.\n\nI'd love to see an affordable modular bra on the market. Since one breast can vary in position/size/angle to the other, I imagine steps to the perfect bra would be:\n\n1. Measure each breast's cup size and angle\n2. Measure the distance between your breasts\n3. Measure the distance from each breast to the top of the shoulder\n4. Measure the circumference around the torso.\n\nWith those measurements, you would then only purchase the modular components that hook together. Benefits of such a design:\n\n* No need to throw-out the whole bra if one wire is exposed / one strap loses elasticity, etc. Just replace that individual component\n* The components can be easily swapped out to grow with one as their body changes\n* Allows for easy styling. Example: Need black cups with transparent straps to match that dress? Need a strapless bra for that other ensemble? Want straps that pull together in the back? Need a larger cup for that special time of the month? None of these things would be a problem with a modular design.\n* Mix and match components. Once you know your size, you can purchase all kinds of variations: Thick and thin straps, various colors, various styles (lacy vs solid, etc.), various features (cups that open for breastfeeding so you don't have to pull the entire bra up, etc)\n* Components could be easily unhooked and washed separately. This would result in components lasting longer.\n* Components could be easily swapped-out during the day without having to swap out the entire bra. (I'm thinking of breastfeeding moms who want to swap out the cups mid-day for a fresh feel)\n* You could have components to match your activity. Example: Going jogging? Grab that sports cup that has a small side pocket or mechanism for holding your cell phone / money (in a way that doesn't get them sweaty, heh). Wearing that dress that is a little too large in the bust? Grab your extra-padded cups to fill it out. Getting ready for that sexy time? Grab your sheer / lacy cups.\n\nWith all the options we have for accessories in other areas in life (tech, mobile, auto, etc.), I am surprised this doesn't yet exist. Or maybe it does and someone well point me in the right direction.\n\nNow, I am not a woman and don't presume to understand a woman's perspective on some of the things I've said. Please take it with a grain of salt if I missed the mark.",
    "title": "I'm an engineer. Let's talk about bras.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1497445179,
    "score": 245,
    "keyword": "woman engineer"
  },
  {
    "text": "Benign chats with co-worker have resulted in me being threatened by his girlfriend. I'm a female, married, engineer for a wood mill. It's a 25:1 male to female ratio. We use chats to communicate between departments. \n\nI've been chatting with a male co-worker, of whom I have a LOT in common with. He's the kind of guy I'd probably be excellent platonic friends with. But we keep it absolutely pro at all times. I knew he had a girlfriend and respected her enough to not flirt or imply anything that could be misconstrued as inappropriate work talk. \n\nI mentioned that my hubby and i built a kickass DIY hot tub over the weekend, big enough to fit four adults. He responded that he wishes he had a hot tub. I said maybe in the future, I could invite him over for a BBQ & soak with us. He joked that his girlfriend probably wouldn't be ok with that (Cause she's inherently jealous and insecure around other women)\n\nCut to 2am last night... I'm woken up from a dead sleep with chats from 'him' blowing up my phone. This wakes my husband and I up. Buzz... Buzz... Buzz...\n\n\"I read what you said to my man. Hes right, I dont and wud never approve of you. Be a rel woman and find a man who's not taken. You're a fucking horrible woman. I'll keep an eye out for you.\"\n\nThese kind of poor grammar and awfully assuming messages continue for an hour. I turned my phone on silent.\n\nThis morning I found out she stole his phone & car in the middle of the night while he was sleeping. Cruised around with her friend while basically messaging the two women he chatted with that she thought was a sexual threat (namely me and one other woman at the mill)... My co-worker was just written up for it (Cause the messages were awfully harassing of us women and all from HIS work profile)\n\nNow, I'm looking over my shoulder to make sure she's not stalking the mill. She now knows my full name, what vehicle I drive, my cell number, and work email. He told me she doesn't work at all, and is apparently affiliated with a local gang, and one of get last messages to me says if she felt threatened again she'd 'hire someone'...\n\nAll this is petty and incredibly immature drama, I'm positive nothing is going to develop from this after today, but I needed to vent... I've NEVER experienced someone so scared or angry at other women. Not in school. Not in slutty friend/fr-enemy circles... Never.\n\n- I've told my co-worker I cannot chat with him about anything other than work from now on. And told him that if she does this kind of shit in the middle of the night again (or anytime for that matter) that I'll call the cops on HER for ongoing harassment and intent for criminal mischief. He told me \"don't do that\" he didn't want the cops called cause \"she'd be arrested again\"\n\nFACE PALM.",
    "title": "Benign chats with co-worker have resulted in me being threatened by his girlfriend.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1491333928,
    "score": 198,
    "keyword": "woman engineer"
  },
  {
    "text": "I was tricked, hacked, and blackmailed with inappropriate photos and threats. Like a Black Mirror episode, but IRL. This happened on the 8th of Feb, 2017.\n\nIt is the fucked up story of how I got hacked and blackmailed and then fucked over when I refused to cave in because I was stupid enough to give private information to 'a friend'. I didn't think Black Mirror episodes were realistic, and then it happened to me. I am sharing this because I made an idiotic mistake and it took a while for me to stop blaming myself for it - I hope that other women can read this and protect themselves (this guy was only targeting women.. as you will read on)\n\n\n**2:20pm** *I'm at work*\n\nA friend of mind messages me on Facebook. She is actually the (current/ex?) girlfriend of my ex-boyfriend's friend (sorry). I have met and hung out with her a several times but I don't talk to her much at all, though we had gone back and forth on snapchat a few days before this incident and I didn't think the way she was typing was weird. \n\nShe asks me if I could vote for her in some project for a random program. Seemed like a modeling competition she's participating in. \n\nI said cool, send me a link. \n\nShe asked me if I could be added to her group to do this, and asked if I was Apple/Android? \n\nApple. \n\nShe asked for my apple ID, then my google-circles ID (Google+?). \n\nI gave them.\n\nThen she starts flipping out and saying that adding my email ID has fucked up the system and gotten all her requests stuck. She can't add anybody else without removing me, and needs to sign into my account to remove me. It's ruined everything, and could I please please give her my password for one quick second please *just* so she can take me off the system and at least go back to the way it was? *Her career was at stake for goodness sake*, she begged.\nI was sitting in a meeting and told her that. She kept messaging me over and over and I kept telling her to stop. Then she began calling me on Facebook messenger repeatedly. At this point, after 2 or 3 calls, I was convinced she was deparate and being honest. After going back and forth for a bit.. *I fucked up.* ***I trusted her***. I thought there was no harm and I would just change the password right after. It was the password to a Gmail ID I never use anyway, except for signing up on random websites when I don't want to get their spam mail but need to create an account, you know, we all have one of those.\n\n\n**2:45pm** *Just walked out of a meeting*\n\nI sat back down at my desk and opened my hotmail browser inbox just to check it^(yes, Hotmail was my primary email.. I got my full name with no dots or underscores or numbers @hotmail.com and there are several hundred people with the same first and last name as me in my home country >_>). \n\nI noticed some emails popping up about a sign-in from somewhere in Pakistan. Within minutes, I started getting signed out of things automatically.\n\n\n**3:05pm** \n\nMy tabs began to refresh on my laptop. I had been signed out of everything: Gmail, Apple IDs, Facebook, Hotmail. I picked up my phone and watched in horror and it started to simply get wiped clean before my eyes, hanging and disappearing. The bastard had put my phone in lost mode and remotely erased all my data. He also turned on **activation lock** so that I couldn't get back into my phone even if I wanted to.\n\n\n**3:20pm** *In a small conference room with a coworker*\n\nI am distraught and my coworker is helping me, getting info on identity theft and submitting a complaint online. I'm on the phone with Apple, explaining my situation. \n\nThe hacker had gotten into my Gmail first. It was the recovery email for my Hotmail, which is my primary account, that I have held for over 13 years. Every account I have on the internet if it is important is linked to Hotmail. Bank accounts, Facebook, LinkedIn, Squarespace, Amazon, you name it. He changed the Hotmail password, recovery email and phone. My Hotmail was also my Apple ID.\n\nHe had gotten into my iCloud. Changed recovery phone, email, birthday, security questions for my Apple ID. I wasn't able to verify my identity because my answers were incorrect, the lady on the phone couldn't let me in. She escalated my call to a senior advisor. Senior was an awfully rude woman, telling me point blank she couldn't help even though I was saying I had all my confidential information on my iCloud.. photographs of my identification, bank account numbers, things he could blackmail me with. And I wasn't able to use my phone because of the activation lock. She said I would have to go into a store and give the bill for the phone (which was given to me for free by a friend, technically third-hand) with the IMEI number.. \n\nI called the bank and blocked my account.\n\n**4:00-6:00pm** *I went home, in shambles*\n\n\n**6:00-8:00pm** *At home, frantically interneting*\n\nThe hacker had been online on my Facebook all day. I had my coworker help me get in touch with my boyfriend so he could message my Facebook, pretending he was just asking why I wasn't reachable. [**This is the conversation that ensued.**](http://imgur.com/gallery/vSecL)  The hacker is typing from my account, in blue. \n\nHe wanted to talk to me. I created a new Facebook account and added my original account. He started a chat with me. **He called me on Facebook messenger (audio)**. \n\n\n**8:30pm**\n\n> He already sounds like a creep. I decide to record the entire conversation (he called on my laptop, I took a voicenote on my phone). He begins by telling me he doesn't want any drama or tears. Of course I was distraught at first but then I calmed myself and asked him what he wanted. He told me he knows the kind of person I am. He has seen all my photographs, read all my iMessages and WhatsApp chats. Seen x-rated photographs. He has access to a lot of my information that I would not want to be shared. He lectures me about how I'm a bad girl, that I have smoked weed and had sex. That if my parents knew what he did, they would be happy. That he's hacked over 90k accounts in the past 4 months and he only felt bad with a handful of girls because their profiles and phones were completely clean, and they were 'pure' and virtuous, but he was very happy when he hacked me. That I deserve it. He said I was a slut because of the number of relationships I have been in/ people I have dated since I have had that phone. I asked him if he wanted money, anything of the sort. He said he could buy me with money, so I should drop that. So I asked him what he wanted from me.\n\n***He asked me to take my clothes off and touch myself in front of him on FaceTime. Satisfy him. Only then would he give my accounts back***\n\n**I refused.**\n\n> *He said that if I didn't do it, he would post compromising photographs of me publicly on Facebook as my profile picture.* He continued to lecture me about how I deserve this. He said he didn't care if I reported him, went to the police or the FBI. He doesn't care what happens to him because he doesn't love his life like I do and he has nothing to lose. He wanted me to do this, regardless of how it would get back to him. And if I didn't, that picture would be up within 2 minutes.\n\n> **\"Do it for me only or for the world only. There's no rush at all, you can decide.\"**\n\nAll this while I am texting my parents (who are across the world in a different time zone) and my boyfriend about what he is threatening to do. My dad got on the case immediately, contacting someone he knew at Facebook to get it shut down. [My boyfriend had amassed an army of friends (through a community he runs)](http://imgur.com/a/QjuQy) and had several people ready and waiting to report my profile the minute something wrong happened. I had also asked him to call 911 and was trying to stall and keep this guy on the phone until they showed up. But I began to get upset during this call, and telling him he had no right to morally police me and that I could be in as many relationships as I want and sleep with whomever I want and it is none of his business. This made him angry. He said \"check your dp in two minutes\". \n\nHe hung up.\n\n\n**9:01pm**\n\n[***He uploaded the photograph.***](http://imgur.com/gallery/bZPPa) I was calling my parents and my boyfriend. I was in tears. Within a couple of minutes, a random friend whom I hardly speak to called my phone and asked me if I knew what was on my Facebook. She heard me crying and I said I couldn't talk. My friends were reporting, reporting, reporting. I saw my profile change. It was fucked up.\n\n\n**9:10pm**\n\nMy profile was deactivated. It wasn't up for longer than 7-10 minutes. I think at least 15 people must have seen it. At least 5-7 reached out to me immediately, through some method or the other. Boyfriend lives 3.5 hours away, immediately left home to come to me. Cops showed up and basically said they could do nothing, the hacker was across the world in Pakistan and I 'wasn't important enough for a cyber crime investigation'.\n\n\n\n**Aftermath**\n\nThe next few days were a mess.\n\n\nSpent the rest of the month trying to recover things. I recovered my Gmail within a couple of days. I looked through the account activity and saw that the guy had changed my recovery email and phone number, and now [**I had a record of it with an IP address.**](http://imgur.com/gallery/AFJuA). He had activated two step verification but we were able to retrieve it. I got Facebook back too eventually. Microsoft, on the other hand, was a fucking pain to deal with. Terrible customer service. Took me weeks to reach an actual person instead of a computer, despite my dad knowing several senior people in the company and reaching out to all for help. Apple was on hold because they wanted me to get access to Hotmail first, so I could reset the Apple ID myself.\n\nEventually I ended up losing the Hotmail account for good. After days of emailing every day, following up with senior contacts my dad had, incessantly submitting report after report. After nearly 3 weeks, someone from Hotmail called me back and said he had activated 2-step verification and there was nothing more I could do. \n\nApple, on the other hand, recently had it escalated to the highest level of engineers, who asked me questions only I could know the answer to and verified my identity that way and let me back into my account. Thank goodness for them, they were so good and supportive. Fuck Microsoft and Hotmail. People used to make fun of me for still using Hotmail and I would defend them until the end. Now I hope they lose all their customers, the shmucks. \n\nIncidentally, when I got back on my Facebook, **I saw he had messaged another 20-25 girls from my profile pretending to be me.** He tricked another friend and she lost everything too. [**This is screenshots of his conversation with her, where she HAD 2 Factor authentication and he was STILL able to convince her to give all her info away because he was pretending to be me.**](http://imgur.com/gallery/EWFv5) He nearly tricked another but she was a bit smarter. Thank fucking goodness. \n\n\n***Things are better now, but remember kids: DO NOT EVER give your personal info away, even to a close friend or loved one. BE SURE YOU TRUST THEM. Anything can happen. I don't even trust the cloud anymore. Fuck this guy for ruining my faith in humanity.***\n\n\n**TL;DR - Fucked up by giving a hacker pretending to be my friend some email info. Guy hacked every single account I have, recovered compromising info from my iCloud, blackmailed me and threatened to expose me unless I did inappropriate things for him. I refused. He uploaded. I spent the rest of the month scrambling to fix it. This shit does happen IRL. Stay safe.**\n\n\nI hope they catch the bastard.\n\n\nEdit: hyperlinks with proof",
    "title": "I was tricked, hacked, and blackmailed with inappropriate photos and threats. Like a Black Mirror episode, but IRL.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488939229,
    "score": 170,
    "keyword": "woman engineer"
  },
  {
    "text": "HVAC design: Good resources to Start? So I'm looking to start building my own house next year. I've asked a few HVAC tradesmen about educational resources, and the universal reply is \"leave it to the professionals.\"\n\nI'd honestly prefer to. Then when I ask them about system design, the most common response has been \"How many square feet?\" and then confidently spitting back a system and (universal!) duct size.\n\nThis is the exact reason my current house has up to a 20°F difference in various rooms. Ever been woken up by a woman's cold feet at 3 AM as she gets back in bed? Nope, nope, nope.\n\n**Plan B:** Design the system myself using science instead of guesswork, get someone to help pick an exact model and help install it, and consider carefully any advice they might have.\n\nI can handle enough thermo and fluids to figure out what duct configuration will stay within a given pressure band, or how many BTUs of heating/cooling the house will need.\n\nWhat I don't know is what I don't know, and I'd rather not find out later that there was a better way to do it.\n\nDoes anyone have any textbooks, trade-published reference books, or even online resources they could recommend for studying up on residential-scale HVAC engineering?",
    "title": "HVAC design: Good resources to Start?",
    "subreddit": "engineering",
    "timestamp": 1486342670,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "I feel so burnt out. Is teaching not for me? I´m feeling extremely burnt out. I dread each day and when I´m in class I feel this sense of dread and agony. \n\nA bit about my situation:\n\nI´m a 24 year old American working as a language assistant in Spain. It´s a program through the Spanish government where you work for 12 classroom hours a week and get paid a monthly grant for basic living needs. I also have a 2nd job teaching Facebook engineers English over Skype through an American company which is great for a bit of spending money but also helping me burn out faster, but I´ll stick to talking about this actual classroom job for now. \n\nThe classroom job is only two days a week, 7 hours per day, which doesn´t seem like a lot at all, but after 3 years of doing this, I feel like I cannot possibly continue. I only work 2 days a week because my school was nice and adapted my schedule to the long commute. I commute 4 hours a day (2 there, 2 back). \n\nThe biggest problem with this job is that none of the schools or teachers actually follow  the contract. I´m supposed to just be a language assistant, but they treat me as if I were their slave, or a very cheap extra teacher to boss around. According to my contract, I´m legally not allowed to ever be alone with the kids, I´m not allowed to grade exams, I´m not supposed to have to plan all of the lessons... basically I´m meant to be utilized in the classroom as an assistant or a tool to provide English conversation with the kids. In other words, there should ALWAYS be the main teacher teaching in the classroom while I assist her. I do not have any teacher training. I majored in Spanish at university.\n\nIn my 3 years of doing this job I´ve had to grade exams, create exams, teach in classrooms of 25 kids completely on my own, plan daily lessons, come up with activities on the spot, etc. \nI changed to a new school this year and I only work with one teacher and it´s just... pushed me over the edge. I spend 7 hours a day taking orders from this woman while she basically spends those days taking a break. \n\nFor example here´s how my day has gone so far:\nFirst class was the kindergarteners. Main teacher drew ballpoint pen halloween pumpkins in their notebook and told them to  color it while I was meant to walk around and teach them the colors in English, teach them how to say different words, etc. So the main English teacher who is paid almost 4 times as much as me improvised a poorly drawn pumpkin in January and expected me to improvise a lesson out of that (to 5 year olds who don´t speak a word of English, no less). \n\n2nd class was with 1st graders. There´s a flu going around so only 5 kids showed up. Main teacher asked me to think of a fun game to play with them. Main teacher sat in the back of the class to grade papers while I was left in charge of the whole class with no lesson plans.\n\n3rd class was with 3rd graders. The main teacher did activities from the workbook with the class while she sent me to the back to work with 2 students at a time (I had printed out some worksheets in preperation because she does this often). She told me I could only spend 15  minutes with each group because she wanted me to work with more students. I had to improvise a way to drastically shorten the activity.\n\netc, etc.\n\nIt´s like this every day. She is lazy and unprepared and expects me to come in and have amazing lessons with a ton of energy. I´m sick of it. The kids don´t speak a word of English and it´s just painful and exhausting. \n\nThis is all AFTER I stuck up for myself and demanded they not take advantage of me so much. Before it was much worse. Before they wanted me to have a ¨story time¨ in the library every day during the break with the ¨punished students¨ where they basically  dump 20 5-10 year olds on me and leave me alone. The main teacher wanted me to work with the entire class on my own while she colored with a few in the back. So I´ve already stuck up for myself quite a bit. The problem is that it´s such a crappy program with nobody enforcing the rules, nobody in charge that cares, and the knowledge that if I quit, there are hundreds of Americans ready to take my spot.\n\nI feel so burnt out. I have 4 months left of this school year to get through. Is this what teaching with your own classroom is like? Am I so burnt out because this is a crappy situation or because I´m not meant to be a teacher?\n\nI think something that adds to it is the absolute disorder and chaos and low quality of the classroom. It´s obvious that the main teacher never ever plans any kind of lesson. There´s no order to anything. She randomly decides to draw a face in each student´s notebook for them to color. That´s the day´s lesson. Or she yells vocabulary words at them with no rhyme or reason. It´s chaotic and nobody learns anything ever. There´s constant shouting, no actual teaching ever (other than telling them to work in their workbooks), and it feels really.... empty.\n\nI could go on and on about this for ages but I feel like this is enough info.",
    "title": "I feel so burnt out. Is teaching not for me?",
    "subreddit": "Teachers",
    "timestamp": 1484140728,
    "score": 35,
    "keyword": "woman engineer"
  },
  {
    "text": "\"Girls Aren't Cool\" preschool student I just found out one of my students (4 years old) plays with boys because she doesn't think girls are cool.  She loves superheroes and building/engineering type projects.  Most of the other girls in my class are into princesses and my little pony, so it makes sense that she is playing with the children who are interested in the same things she is interested in.\n\nI don't see anything wrong with her wanting to play with boys as opposed to girls, I just don't want her to feel bad about herself or feel as though she can't do or be something because she's a girl.\n\nThere was even an instance when we were discussing what they want to be when they get big.  I gave the example that I want to be an astronaut and right away she said \"Girls can't be astronauts\". (Coincidentally the first woman in space shares this girl's name)\n\nI need suggestions for books, activities, pictures, or anything else that can show her girls are \"cool\" and can do anything boys can do.",
    "title": "\"Girls Aren't Cool\" preschool student",
    "subreddit": "Teachers",
    "timestamp": 1495907261,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Possible to start from the beginning in IT at 34 years old? Hi, just looking for some advice on the viability of starting in a totally new career at 34 years old. I'm interested in IT and where I should start (ie, should I teach myself, be going to classes?), etc. However, I also want to know if someone my age is even hireable in those positions with no prior experience. \n\nFor background, I've pretty much been lost my whole adult life as far as career goes. Got my degree in English with a technical writing focus. This was after dropping out of college the first time and getting my cosmetology license. Then pretty much just worked odd retail jobs, was a supervisor at a call center for several years and am currently a receptionist at a salon. I'm a woman, if that makes any difference. I've always been into computers and technology, I grew up around it since my dad is an engineer. But I never really considered it a career option for myself. Not really sure why. I guess because I did better in English classes then I did in math and science so something like engineering didn't seem right for me. But I really like working and learning with things hands on. \n\nAnyway, that's pretty much the gist of it. Advice, opinions? Even if it's just to tell me there's no way, that's okay.",
    "title": "Possible to start from the beginning in IT at 34 years old?",
    "subreddit": "careerguidance",
    "timestamp": 1508609580,
    "score": 17,
    "keyword": "woman engineer"
  },
  {
    "text": "Dislike career in civil engineering so far, should I switch to mechanical or software? \n I have a bachelor's and Master's in civil engineering and I am very unhappy in my field and I don't expect to enjoy it in the future. I enjoy design work, calculations, and modeling aspects of engineering and I feel like civil engineering (for me) has been less design (and the design I do is just trying to make the regs and limits work for the topography) and in the future I see myself headed toward a managerial “paper pushing” and report writing role. \n\n\nI work in transportation right now (storm water, rail, roadway design but also master plans and reports) for a consulting firm. Admittedly my particular office has been doing more master plan projects and reports than actual design work, and other offices do more design, but senior level engineers always seem to phase out of design and do managerial stuff. So managerial roles are in my future even if I asked to switch to an office with more design work.\n\n\nIs it possible to have the experience I want for my career within the field of civil engineering, but perhaps under a different subset or type of company? \n\n\nI enjoyed the programming courses I've taken, and I really enjoyed structures, strength of materials, and statics (Dynamics was so so for me). I even considered switching to mechanical engineering during undergrad, but after speaking to a couple professors i left feeling like maybe I'm too stupid for it (I'm a woman and generally an insecure person, and I didn't want to be a negative stereotype or a liability somehow so I just stayed in civil since I already knew what it was like). Anyway, with that in mind should I consider getting a second Master's in computer science or mechanical engineering (structures or materials emphasis)? Could I \"handle it\"?\n\n\nIt would be pretty unpleasant to drop everything (401k, health insurance, income) and go back to school, but I am really down about the type of work I do now (kind of depressed and feel like I'm at an intellectual dead end) so I think it'd be worth it from a long-term quality of life standpoint. However, maybe I'm blinded by the “grass is greener” fallacy? Is software or mechanical engineering unpleasant in ways I don't see? I understand they do work long hours (I have friends in aero and software) but usually when I work long hours in design projects I don't mind it so much. Are there any books, YouTube videos, blogs, podcasts, etc that I could read/watch/listen to get a better sense of what it's really like in either field? \n\nIs there any other advice, comments, ideas you might have? I appreciate anything you might have to say at this point",
    "title": "Dislike career in civil engineering so far, should I switch to mechanical or software?",
    "subreddit": "careerguidance",
    "timestamp": 1510163483,
    "score": 4,
    "keyword": "woman engineer"
  },
  {
    "text": "How do I advance my career in project management when my current industry doesn't typically use them? I've got a Bachelor of Commerce from 8 years ago, did two years of teaching abroad to see the world after graduation, then came back to Canada and started working in the Trucking industry. I've got 6 years of experience on my resume as logistics planner/dispatcher/project coordinator. Making about 60K.\n\nI've been unhappy with my job for a while now due to internal issues with management. I've been doing the project coordination for about two years now and I enjoy it - I get to use my multitasking, attention to detail and problem solving skills. Unfortunately the trucking industry doesn't really use project coordinators, so the likelihood of staying in Trucking is slim. Since I am the only project coordinator on staff, the likelihood of getting any supervisory experience is non existant, and since I am a woman I find it very unlikely that I would be able to transfer to a supervisory position in another department, as I work in operations and the only women in supervisory or Management positions are in administrative roles.\n\nI've been watching the job ads for a couple months now, but any job postings that I see for project coordinators, project assistants, project schedulers etc all seem to require engineering/IT/science degrees and supervisory experience. I'm married with a mortgage and I'm the main breadwinner, so I can't just quit and go back to school full time.\n\nDoes anyone have any suggestions on career paths for someone with a BComm and experience in logistics/project management?",
    "title": "How do I advance my career in project management when my current industry doesn't typically use them?",
    "subreddit": "careerguidance",
    "timestamp": 1512346570,
    "score": 6,
    "keyword": "woman engineer"
  },
  {
    "text": "Dream career or dream lifestyle? Hallo I am 24 years old and I am considering a future between academia and industry. I have a degree in mechanical engineering, with a very successful thesis in machine learning. I really loved the subject and with zero background in the subject, within a couple of months I managed to improve the work of the PHD student and I got one of the best thesis in the year.\n\nI graduated at 23 (I lost a year because of severe a health issue during university) and then I worked for a year in two companies, both being in engineering. One was about a computational fluid dynamics role and the other as a machine learning engineer.\n\nNow I got accepted for a masters in machine learning at a top university, however I feel extremely nervous about my next step. I really love research and I would have followed that path if not for external influence.\n\nOn the one hand, I have my brother telling me to not pursue a PHD, because in the end it will not provide you with enough benefits for the amount of work you will be putting in (please note that he has finished his PHD at a top university with a prestigious scholarship and also managed to do quite well in his PHD). In addition several PHD students in mechanical engineering have told that there are no career prospects if I follow that route (they are really negative, borderline depression). Finally in a recent experience with a girl opened my eyes about how other people see me. To elaborate, I knew her for 3 years as a friend and she told that she liked me, we managed to bond quiet well until she asked how much money I make. At that point I asked myself why a woman would be interested in someone else other than herself if not to provide her with some benefit and specifically in financial form (in short why would she care about me, only her own benefits). It is natural for me to ask myself how much money I would need if I want to have a family. If I follow the academic path it would be highly unlikely I would succeed in that regard considering the financial returns in academia.\n\nOn the other hand, my thesis supervisor thinks I am talented and I have high potential as a researcher, I have also been told from other academics that the academic path would good for me. Furthermore, PHDs student in computer science told me not to worry too much about getting a job after a PHD in machine learning, since it will not be too difficult to get one from there (in general I have observed that computer science PHDs are way happier than mechanical engineering PHDs, maybe because of publication rate and/or activity in their sector). \n\nCoupling my current worries about the future along with future worries that will manifest due to future experiences it is logical to assume I will regret either choice, hence I am writing this to ask for advice on how unfounded my worries are or are not.\n\nMy anxiety has reached extreme levels to the point I cannot sit down and study for a couple of hours without thinking about my next step, I have become desperate to solve the problem but I keep reaching an impasse. I am a bit more inclined towards industry because let’s face it, no matter how talented you are it is still way more likely to fail in academia (it is arrogant to assume I will succeed in academia), however I still feel really bad giving up on my dream career (I am guessing your advice is welcome to the real world).\n\nThank you for your time and your patience.",
    "title": "Dream career or dream lifestyle?",
    "subreddit": "careerguidance",
    "timestamp": 1503942928,
    "score": 4,
    "keyword": "woman engineer"
  },
  {
    "text": "2 years lost. It's getting to me. Felt super optimistic today. Questions? So I had some sort of breakthrough, after a week of feeling like a piece of shit.\n\nShort back story: 6 years army, 2 years at Fortune 500 defense contractor as field engineer (no degree, army experience in missiles), lost it do to my fault, went through 1.5 years of hell/depression/hell, finally stopped blaming the world and accepted things as my fault, moved to The Philippines from US. Go to Culinary school. Not interested in the sham of culinary school. Sitting here using savings to live (have enough for like 15 years of doing decently). Met wife here, had child 1 month ago. Shit is serious now.\n\nOk, sorry if that sounded like a sob story, wasn't meant to be. \n\nBack on track, after having what feels like some crisis today, I decided to do something about it and reached out to an army buddy who does well now and has a technical field job (telecom or something). Got me working on my resume, which was good, but needed updating like crazy.\n\nSo my background is as a field engineer on a missile system. I worked alone traveling middle east countries checking on these systems and reporting statuses to the army higher ups and also to my company. Lots and lots of travel, Spare parts, logistics, and training of the soldiers. I did a great job, always fixed my technical problems, made successful relationships with army warrants who had never met me, and had positive reviews every mid year review. I got my raises. I say \"Army Warrants who had never med me\" because a small few of the ones I supported as a contractor I had also served with as a young soldier.  Regardless, my company had a contract to support the mission, which I loved. After 2 years, I was forced to quit do to family issues (Brother needed in home care as he is schizophrenic and he was having it bad, no one else could help.) The second reason I left was because I had gotten wrapped up with a psychopath woman who used the shit out of me, so it was time for me to go home and figure life out.\n\nHere I am 2 years later, in the Philippines, wondering where is my life going. I show a different friend my resume and he says:\n\n>You would be best suited of logistics coordinator or logistics manager bro. Thats what your resume screams to me.\n\nI have my resume scrubbed up and ready to go for a few specific jobs. Something is holding me back and I am having 'what if' anxiety. I started to ask my actual best friend 1 question then it turned into a bunch of career focused psychology ones. I didn't know these were the things I'm thinking about.\n\n\n>if i get a job as a logistics manager, what i'm worried about, is i don't know standard logistics industry stuff. i don't know how companies are different from each other; Like, the U.S. Army does things differently and so does *former employer*\n\nHowever, to finish that thought, I know I can do a logistics job that fits my qualifications, I am worried about what expectations a company might have of me should I be interviewed or hired?\n\nThe logical part of me tells me 'they won't hire you unless you are qualified and they will show you the ins and out of the company as every company is different', but since that's just me thinking that, I am honestly not sure how true that is.\n\n\nDoes anyone relate? Answers? Advice?\n\n\n*if my format is wrong or anything wrong with post, sorry, just had a long day, let me know*",
    "title": "2 years lost. It's getting to me. Felt super optimistic today. Questions?",
    "subreddit": "careerguidance",
    "timestamp": 1505211158,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Teenage Crisis: What should I do with my life? Hey, guys! I'll try to get to the point, as I hate when others drag on in their writing.\nSo, I'm a 16 yo kid, I'm poor (single parent, low wages) and a minority (although I pass as an American). I used to be one of the really smart kids when I was little (winning awards and stuff) but that's changed over the years. I'm a little less active in school, I feel less smart, find it hard to get motivated and am mostly depressed all the time.\nThat said, I am excited for college. I have a scholarship set up already (basically I get to go to uni for free). I'm excited for uni for several reasons: mostly because I look forward to being free of the hindrances of living with my mom (an elderly, sick woman who I love, but who makes me feel old, too, sometimes) but also because I want to FINALLY be myself and pursue my interests. My aunt (a doctor) tells me I should become a doctor too. She thinks if I work hard enough and get off my ass and pursue the dream, I can achieve it. Other people have straight-up told me I'm dumb and lazy and irresponsible and would make an awful doctor. I've been thinking about healthcare, business, law/politics and construction/agriculture mainly as fields I'm interested in.\nFacts about me\nSmarts: 3.8 gpa, mostly A student (and that's when I'm lazy) but I still feel like I'm dumb, probably because I hate myself. I'm a procrastinator, and that makes me hate myself most of the time and I don't know how to stop.\nPros: I'm artistic, creative, good with my hands, imaginative and good at analyzing literature & interpreting stuff, helping others, reading (i love reading) writing, expressing my thoughts, and -sometimes- teaching.\nCons: I'm lazy (trying to be better, though), depressed, slightly erratic, spontaneous, self-belittling, introverted.\nThings I like: Art, Literature Science (even tho I love it, I suck at it sometimes), History, Politics, Social Sciences, Psychology, Health Science\nThings I suck at/would probably suck at: Math, Physics, Engineering, Finances\nI'm torn between wanting to stay here and pursue a cheaper education which probably guarantees more money and moving out in the future OR leaving as soon as I have my bachelor's degree and studying while working & living on my own. I really, really want to live on my own as I HATE my current living situation. But I'm also open to staying, especially if it means a better situation with work in the future.\nWhat do you think? What should I do? What should I study?",
    "title": "Teenage Crisis: What should I do with my life?",
    "subreddit": "careerguidance",
    "timestamp": 1505965898,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "What kind of engineering course is best suitable for a woman? A few months from now, we will have to choose the course we want for college and I am having a hard time deciding on what to pick. I just don't want to waste my whole life regretting my decision and my parents made it pretty clear to me that I am not allowed to change course once I have been enrolled. \n\nMy initial plan was to pick electrical engineering but then I found out that women are less prioritized in that kind of work force since it involves lots of physical activities like construction work. So types of engineering that involves construction for men are out of my top picks already. \n\nAnother thing, as much as possible I don't want to pick anything related with computers because the work force in that area is kinda overflowing in our country already. Salary is one of the most important key factor in my picks since we come from a not so well off family and I want to help them as early as I could after graduating.\n\nSo, any advice on what type of engineering should I pick as a woman? Also some tips on becoming an engineer if possible. Your opinion would truly help me in deciding my future. Thank you.",
    "title": "What kind of engineering course is best suitable for a woman?",
    "subreddit": "careerguidance",
    "timestamp": 1500754876,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "What states are black coders more common? I'm not trying to bait any arguments here. Sorry if this question is offensive.  \n\nI'm just looking for direct answers, where I live its been mostly 100% white for software engineers.  \n\nWhen I worked remotely I found a variety of races, even minority women working on projects with me.  \n\nOver 80% of the people in my state are white, at programming events & contests 100% have been white (excluding me.)  (There is 1 senior developer that's a woman though)  \n\nWhat's it like in other states?",
    "title": "What states are black coders more common?",
    "subreddit": "cscareerquestions",
    "timestamp": 1489610226,
    "score": 58,
    "keyword": "woman engineer"
  },
  {
    "text": "Are women in tech supposed to wear makeup to work/interviews? Ladies who are engineers, do you wear makeup to work? And do you wear makeup to interviews? Even if you don't normally wear any? Is it expected for women in engineering to wear makeup?\n\n\nEveryone else, do you notice or have an opinion about female engineers wearing makeup?\n\n\nAlso, does it matter if a female engineer wears makeup? Will others think that a woman without makeup is less professional or less competent as an engineer?\n\n\nI'm asking this because, despite tech being known to have an overall more relaxed dress code than other industries, I noticed that most of the women in technical roles (and other roles) working in my office have some amount of makeup on. Additionally, some female CS friends from school would put on a full face of makeup for interviews, even if they usually didn't wear any or usually only wore minimal makeup.\n\n\nI also noticed that a lot of women wear slightly more \"professional\" looking clothes than the guys. And when the guys go in the office with some free t shirt they got in college, no explanation is necessary. But if one of the girls comes in with less makeup than usual or with a relaxed outfit, she apologizes for not looking put together, and explains how she was in a hurry in the morning, etc. It's all self-commentary, and I haven't seen or heard any instances of other people ever commenting on anyone else's appearance. But even so, it's kind of...concerning? Confusing? I'm not really sure.\n\nBut it's just that there seems to be some kind of unspoken difference in how women are expected to look compared to all the other engineers. I know that gender-based appearance expectations are a pretty well-known issue at large, but I thought that with how casual tech supposedly is in regard to appearances, it wouldn't matter as much. But it seems like it does.",
    "title": "Are women in tech supposed to wear makeup to work/interviews?",
    "subreddit": "cscareerquestions",
    "timestamp": 1508055538,
    "score": 30,
    "keyword": "woman engineer"
  },
  {
    "text": "We need to have a serious and frank conversation about sexism in this sub. I am appalled by the level of sexism that is prevalent in this subreddit. Most notably, two top threads today [here](https://www.reddit.com/r/cscareerquestions/comments/5rorr1/my_friend_and_i_had_too_different_interviews_how/) and [here](https://www.reddit.com/r/cscareerquestions/comments/5rlijr/software_development_how_would_you_behave_with_a/), kept reinforcing the notion that oftentimes, when a woman gets a job at a tech company, it's often got it due to their gender. Seriously, you all should be ashamed of yourselves. All of these unsubstantiated allegations from anonymous people are being upvoted and giving women in tech a bad name. \n\nWomen in tech have it insanely hard. Imagine being the only dude in a nursing program and you can see what these women are going through. Additionally, imagine if all of your accomplishments were ridiculed by everyone because \"you only got this job/promotion/project/etc. cause you're a girl.\" That would really suck and would totally destroy your confidence. \n\nTBH, for me, the women I know in tech are some of the best engineers I've ever met. I know that this is anecdotal, but the women on my team are entrusted with the largest and most important projects. They regularly deliver outstanding results and they are critical to the success of our (very large and very important) product at a Big 4. There are only three of them on our team of 20, but without them, our team and our product would fall apart.\n\nCollectively, as men in tech, we need to do a better job of calling out sexism and supporting women in tech at all levels. The gender ratio is appalling and embarrassing and reflects very poorly on our industry. It is partially a societal issue because society does not expect women to become software engineers. But if you think that men in tech are free of all blame, then you are a part of the problem. We need to encourage and mentor women in tech. I'm not saying that all men are part of the problem, but collectively, we are the problem.  **We need to stop pretending that the problem doesn't exist and start asking ourselves what can we do to fix the gender gap.** Listing anecdotes of \"reverse sexism\" that you think you've experienced does not count.\n\nI'm not saying that some tech companies don't offer positions to less qualified applicants because they're women. It happens, and when it does, it sucks. It's not fair to men or women when it does. However, that's a minuscule problem compared to the sexism that women experience every day in the office and classroom. The levels of women in CS at top companies and at top CS programs is relatively comparable, so when people assume that women are less qualified, it's saying that men are smarter than women, which is wrong and incredibly demoralizing to the women who are trying their hardest to succeed.\n\nYou may not be sexist at the office, and I applaud you if you aren't. But being sexist on the internet isn't much better. You may not say anything sexist at the office or on the internet, and you may actually be a feminist, but your failure  to call out and challenge sexist men is deafening. We should all be proactive in calling out and fighting sexism, wherever it is.\n\nAnd before anyone dismisses me as a pissed off woman, I'm actually a pissed off straight white male. \n\nI'm very open to a discussion about this, but I think we can all work together to making the tech industry and CS programs nationwide more accepting for women. Think about how much better our industry, our jobs, and our classrooms would be if we eliminated the gender gap. Let's all be leaders in making it happen.\n\nEDIT: Grammar and formatting",
    "title": "We need to have a serious and frank conversation about sexism in this sub.",
    "subreddit": "cscareerquestions",
    "timestamp": 1486097580,
    "score": 25,
    "keyword": "woman engineer"
  },
  {
    "text": "Feeling invisible at school and with a future career as a developer. I’m a junior in the last legs of my CS degree, studying at an predominantly white college. Looking around at silicon valley and the dev communities in the cities near me (NY, Boston, DC), I honestly don’t feel like I belong in this field. I’m a woman and Pacific Islander, I didn’t grow up with a Mozart-like childhood, and only started programming when I took my first CS class freshman year. I didn’t have a lot of encouragement or role models before I entered college, (my older sibling went to college for a year, got kicked out, and went back to study a liberal arts field). Despite a bumpy upbringing, I graduated in the top 5% of my high school, and now attend a school in the top 20 for CS. I do fine in my classes, so academically, I’m fine. \n \nI haven’t met a single Pacific Islander at my school other than my own sister, and women in the CS department are scarce too (something to the tune of <15%). Because I’m Asian as well, I’m frequently lumped with the prodigy-Asian crowd, students who’ve been programming since they were 16 and are crazy connected. I can’t even apply to programs intended for racially underrepresented minorities since those are targeted towards Hispanic and Black students, and Pacific Islander folks are brushed over. Just talking with some of the other women in CS is pretty alienating for me, we don’t watch the same TV shows, read the same books, or have common experiences from our backgrounds. I don’t have anyone to look up to as a role model, save for maybe Melinda Gates and Sheryl Sandberg, but both those ladies are white. \n\nJust taking a scan across my classroom is disheartening, and I feel like me and my struggles are completely invisible. I feel capable as an engineer, but like I will never fully belong the way a white or Asian person will. I don’t think I can be happy just ignoring my background and cranking out code at a job when I graduate, yet acknowledging my race and ethnicity is incredibly difficult when there’s not a single person out there for me to look to. I’ve applied to a ton (70+) of internships, and gotten rejected from all, so that probably doesn’t help either. I’ve begun to think that CS just isn’t for me, and that I can still make a career out of non-tech roles. That’s really not what I want to do though, my dream is to work as a developer when I graduate. I just feel so swept aside and that there really isn’t a place I belong. What can I do to look forward instead of down? Is there a community out there that I can reach out to? Any other companies with jobs/internships that cater to minority students?",
    "title": "Feeling invisible at school and with a future career as a developer.",
    "subreddit": "cscareerquestions",
    "timestamp": 1511895189,
    "score": 22,
    "keyword": "woman engineer"
  },
  {
    "text": "Is it bad to use family ties to help me get a job Throwaway because reasons.\n\n\nTwo weeks ago I was invited to mentor the participants of a Financial Inclusion Hackathon at a very big event where I had the chance to meet the CTO of the bank that was sponsoring this specific hackathon (there were some other themes like Smart Cities, IoT, health, etc). I'm a CS engineer, we talked for a few minutes and then he left because he was giving a speech a few hours later, which he invited me to. I've been trying to leave the company I'm currently working for and this seemed like the best chance I could get so when he finished his presentation I waited until all the people that gathered around him were gone and made my approach. I straight up asked him what I could do to join his team.\n\n\nHe put me in contact with the right people and last week I had 2 phone interviews, one with the head of HR (thursday) and an other with the woman in charge of IT recruitment (friday). Both went great and this week I'm supposed to be having one with the person that would be my manager.\n\n\nI invited my dad for lunch on sunday since I hadn't seen him in like a month and this came up. After I was done telling him all the details he looked at me and said: 'You know you, your aunt is really close with the owner of that bank'. He said that she could help me land that job or if I happen to get it on my own maybe she could help me get a better salary.\n\n\nI have over 7 years of experience and I'm pretty confident in my skills, so I'm wondering if I should even play that card. Should I use this as my last resource? Should I just let it go if this weeks interview doesn't go well? If I do get hired because of this and people in the office find out, would they think less of me as a professional?\n\n---\n\nTL;DR Applying for a job and dad said his sister could talk to the owner or some other higher ups into hiring me / giving me a better salary",
    "title": "Is it bad to use family ties to help me get a job",
    "subreddit": "cscareerquestions",
    "timestamp": 1500416345,
    "score": 0,
    "keyword": "woman engineer"
  },
  {
    "text": "Woman's body found near Bay Area trail identified as Chuchu Ma, a 23-year old Google engineer Cause of death still being determined by the coroner. But what makes this suspicious is that her body was found naked facedown in the water next to a trail.\n\nhttps://www.nbcbayarea.com/news/local/Coroner-Identifies-23-Year-Old-Woman-Found-Dead-in-Bay-in-Sunnyvale-463076963.html",
    "title": "Woman's body found near Bay Area trail identified as Chuchu Ma, a 23-year old Google engineer",
    "subreddit": "asianamerican",
    "timestamp": 1512886252,
    "score": 88,
    "keyword": "woman engineer"
  },
  {
    "text": "MeToo is a game changer -- but not in the way feminists think Feminists have never been very good at predicting the future.  \n\nThey assumed feminism would increase female happiness.   Female happiness has been declining since the 70's.   \n\nThey assumed that trying to eliminate the female gender role would create rough parity in previously male dominated occupations.   In fact, in countries where women have the highest degree of choice, women are *least* likely to become engineers; conversely, countries like Iran and China lead all nations in female engineering.  \n\nThey assumed that destroying the \"patriarchal\" family would eliminate child abuse and allow children to grow up healthy and happy.   In fact, children from single mother households fare worse on all quality of life indicators.   \n\nThey assumed that domestic violence was a patriarchal conspiracy.   In fact, hundreds of studies reveal that women are more likely to engage in unilateral violence against their partners, and lesbians have the highest rates of DV.   \n\nThey assumed that women in power would be more peaceful.  In fact, studies have now revealed that Queens were more likely to initiate wars than kings.  Female leaders ranging from Margaret Thatcher to Hillary Clinton were positively eager to engage in military violence.  \n\nI could go on indefinitely.   The point is that feminists have gotten *almost everything wrong.*   It is nothing short of remarkable that they continue to dominate academic discourse on gender given their near-100 percent failure rate.   Any theory worth its salt should be somewhat predictive; feminist theory is *counter-predictive*.  In no other discipline (save perhaps economics) do we see such a disconnect from reality.   \n\nI can only conclude that the wild success of feminism owes almost entirely to what they call \"benevolent sexism.\"   Men and women in academia have been exceedingly reluctant to debunk their arguments because patriarchy theory is, in fact, horseshit: men want to support women, not oppress them.   And they will support women even when they are clearly wrong.   \n\nThat brings us to MeToo.   Collectively it is Time magazine's \"person of the year.\"   The once charming and beautiful -- now wretched -- Ashley Judd even posed for the cover photo.   \n\nFeminists have been content to see their ideology run wild.   They have wielded female power (which they bizarrely deny even exists) to brutalize men and boys.   They were fine with denying children access to their fathers, turning fathers into indentured servants,  ignoring the role that women play in domestic/sexual violence, shutting down talks on male suicide, disadvantaging boys in \"education\", discriminating against men in hiring practices, allowing false accusations to run rampant, and so on and so forth. \n\nHowever, in the last week or so, I've noticed a change in tune.   Feminists are extremely worried that \"MeToo\" may end up creating a \"blowback\" effect on women.   We're talking about bourgeois women mind you -- because that's what feminists are.  Spoiled, rich, women.    I've noticed contradictory statements in \"MeToo\" articles within single paragraphs -- NO, men shouldn't flirt with women in the workplace, but YES, men should flirt with women in the workplace (the right *kind* of man, you see).   The unspoken subtext is that women should still be permitted to use their sexual power where they see fit.   Cake and eat it too.  \n\nThere is a growing recognition that a pandora's box has been opened.   What if men start to view women as threats?   If an \"alpha\" male can be taken down over a mere accusation with no proof, what about your average man?   What about my son!?  \n\nIn fact, wouldn't it be the *responsible* thing for a man with a wife and kids to make sure there is always a chaperone present so he doesn't put his family at risk?  \n\nAll of a sudden those stodgy old Victorian rules are starting to look mighty sensible.   Maybe the sexes *should* be segregated.   Otherwise, how is a man to protect himself?  Nevermind the woman's honor, what about the man's honor?  Hell, maybe that's why such rules were created in the first place!  \n\nFeminists are incapable of thinking too far ahead -- let's just say they're not exactly grand master chess players -- but the alarm bells are already going off in their heads.   \n\nWhat if men decide not to privilege me in the workplace?  What if I can't use my sexual power over men to get ahead?  What if I have to work for a living?   \n\nI'm sympathetic toward working class women.   They didn't ask for this neo-Victorian sexual panic.   They suffer actual hardships in life -- rather than a pat on the ass.  \n\nBe that as it may, MeTOO is a game changer.   Despite what some feminists think, men do not desire to be punching bags; they will try to protect themselves.   And that means no more special goodies and privileges for women in the workplace.  Women will have to pull their weight.   That also means no more drinks, lunches, and sincere efforts by older men to give young women a leg up.  \n\nIn fact -- and I hate to sound too MGTOW about all this -- but I think MeTOO will eventually bring us back to [sex segregation](https://www.youtube.com/watch?v=ZGjidOQgGDE) -- precisely the thing the original feminists fought against.    You abused your power ladies, and now it's time to reap the whirlwind.  \n\nFeminists are now saying, \"It's time to take a step back.\"  Too late.  You made your bed.  Now sleep in it.",
    "title": "MeToo is a game changer -- but not in the way feminists think",
    "subreddit": "MensRights",
    "timestamp": 1513665672,
    "score": 163,
    "keyword": "woman engineer"
  },
  {
    "text": "If you’re a man with a camera, you’re automatically branded a creep I used to work semi-professionally as a photographer.  What do I mean by that?  Essentially I was part time.  I had a great job as a software engineer that I liked and didn’t want to give up, but in my off hours I liked switching gears by earning extra dollars via photography.  I specialized in taking photos of the performing arts such as musical artists, plays, circuses, etc.  It was fun.  It was a very different challenge from writing code.  \n\nSo this 16 year-old girl found my web site and liked what I saw.  She needed some quality photos for her school’s yearbook and approached me to take them.  She asked me to take photos appropriate to the yearbook.  Not once did she ever request any nudity or anything else inappropriate.  She had an after school job and enough money to pay my rates.  Everything seemed completely legit.  Of course, I was well aware of the stereotypes that would brand me some kind of sick perv if I photographed a teenage girl.  I therefore turned to other photographers for advice on putting together a contract that would protect me legally.  She wanted a photos of her together with her horse.  There would be photos of her riding it, grooming it, and just standing beside it.  Nothing wrong with that, of course.  I still wanted a contract to protect me legally so that I would not end up falsely accused of any wrongdoing.  A protective instinct kicked in because I knew how hyper-negative people get toward men, especially a man with a camera.  \n\nI asked other photographers on a photography forum online if there were some kind of standard protective contract I could use.  Some photographers responded with good advice on where I could get such a thing.  Some also said I should require at least one parent present at the shoot.  Good advice.  However, others went berserk, accusing me of being some kind of perv out to rape that girl.  One asshole claimed that if it were his daughter he would immediately contact the police and the courts and get a restraining order against me.  He acted like I had proposed to make kiddie porn.  We’re talking about a photo shoot of a fully clothed girl in normal pictures with her horse – feeding it, riding it, normal stuff.  These were photos that were appropriate to a high school yearbook.  \n\nThese male-bashing bigots totally ignored my explanation of the content of the shoot and just assumed I would ask her to take her clothes off and do pervy things and that it would end with me raping her.  No amount of setting the record straight did any good.  It was unreal the hateful assumptions people made.  Some photographers came to my defense, appalled as I was at the overreaction.  Some correctly said that photographers photograph all ages.  Duh.  It totally depends on the content of the photos as to whether it’s appropriate.  It’s unreal how some people heard “fully clothed girl riding a horse” and translated that to “perv raping a teenager.”  \n\nI ended up doing the shoot, no thanks to the male-bashing bigots.  It went great.  I had a liability contract and I had her father present at the shoot.  Great guy, and great girl.  They were awesome people.  Neither of them made any of the absurd assumptions some idiots had made.  This was a case of a young woman who had earned her own money at a job and had chosen to spend it on some high quality photos.  Nothing more.  It’s unreal how some people will twist something like that into something sick.  \n\nOther photographers have told me about similar situations where they’re assumed to be some kind of perv because they have a camera with a telephoto lens.  If you’re a man and you take a high-end camera to a beach, you risk getting pestered and even arrested by police.  That’s a reason why I won’t even do beach photography.  Nowadays, I won’t even photograph someone who’s underage unless I know the people really well.  I was lucky at this shoot that they turned out to be terrific people, but if I had gotten the witch hunt idiots, it could have been dangerous for me.  I’m 100 percent certain if I were a woman, the whole overreaction and branding me as some kind of creep or perv would never have gone down.  “Girl with her horse” – he must be a sicko.  It’s unreal.",
    "title": "If you’re a man with a camera, you’re automatically branded a creep",
    "subreddit": "MensRights",
    "timestamp": 1487540346,
    "score": 70,
    "keyword": "woman engineer"
  },
  {
    "text": "My response to a friends re-post of a feminist editorial regarding female students and their 'plight'; or, How Feminism is Hurting Education for Everyone The original link: [Shareably](http://shareably.net/male-engineering-student-explains-why-female-classmates-arent-his-equals-v1/?utm_source=earth&utm_medium=facebook&utm_campaign=inspiring)\n_________________________________________\nMy friend re-posted this link with \"Beautiful.\"   I'd like to share my response because I spent a fairly significant amount of time constructing it, and would hate for it to go wasted in the unseen corners of facebook.  My hope is that you all can glean bits and pieces to use for your own arguments in the future, and better prepare yourselves to disabuse people of the pervasive feminist ideology that surrounds education.\n_________________________________________\nThis is beautiful, like a pile of shit sculpted into an image of the Virgin Mary is beautiful. Yea, the sentiment is nice, but the content is still a smelly pile of shit.\n\nWhat he said may have been true for your generation, but his generation is facing a wave of feminist ideology and policy that puts women as frontrunners in any and all STEM categories. Beginning in grade school, where common core math was developed around the mind of girls, so that it may be more accessible and easier to learn for them. Basically taking traditional math and re-interpreting it through a verbal mindset. \n\nBefore I get into the education aspect, let me briefly refute his \"women suffer for being women\" bulk. \n\n\"I was not bombarded by images and slogans telling me that my true worth was in how I look\"\n\nReally? \n\n[Men are idiots](http://www.sheknows.com/entertainment/articles/1075515/commercials-sexist-towards-men)\n\n[Unrealistic male body standards](http://www.huffingtonpost.com/jessica-lovejoy/body-image-issues-are-not-just-for-women_b_5034285.html)\n\nThe same issues exist for men and boys. We just don't talk about it. In the second article, where a boy posted a picture saying \"It's just as hard to be Ken as Barbie,\" the response was \"suck it up, white boy.\"\n\nWhen it comes to women, there is boundless empathy for women to be who they are and define themselves. When it comes to men and boys, it's \"sit down and shut up, because your feelings don't matter.\" \n\nNot only that, but women perpetuate the unrealistic expectations of male appearance. Men are willing to date down, and to date a variety of body types. Curvy? Sure! Slim, that's hot! Big booty? Sign me up! \n\nWomen? Not so much. Studies show women typically will not \"date down.\" So if a woman makes more than a man, chances are she will not date him. Even if he is more attractive. He has to be both attractive and successful. And attraction is more narrowly defined. Under 5'10\"? Move along, shorty. Chubby? Please. If you don't have chiseled abs and broad shoulders, you need not apply. Male pattern baldness? HAHAHAHA\nAnd I don't want no scrub.\n\n\"I was not overlooked by teachers who assumed that I did not understand a tough math or science concept was, after all, because of my gender\"\n\nIt's obvious from this statement that he's white knighting for attention, not speaking from experience. Because women make up 70% of teachers, and girls actually get better grades for the exact [same work as boys](http://www.returnofkings.com/75159/study-shows-girls-get-better-grades-for-the-same-work-as-boys). There is inherent gender bias in schools, but it's not against girls. \n\n\"Jared is autistic and he suffers from Lupus and avascular necrosis in both his hips.\" He wrote this editorial because he's a social outcast, and this is likely the only attention from women he's ever gotten. I know that's harsh. But he's whiteknighting for attention, looking for a pat on the cheek because he can't get a kiss, and his perpetuation of false bias against girls in education is harmful.\n\n[Common core for girls](https://www.americanprogress.org/issues/education/reports/2014/10/28/99435/for-women-and-girls-the-common-core-is-a-step-toward-greater-equity/)\n\nThe feminist agenda is based on lies and misrepresentation, with the the core ideology that women are perpetual victims. This is why women who truly believe in equality and the capability of women reject it. Frankly, it's insulting. It's an ideology that, at it's core, removes the agency of women, by both making them into permanent victims and diminishing the value of their choices. \n\nLet's look at that article. \n\n\"In particular, girls of color and girls from low-income backgrounds underperform academically compared with their white, higher-income peers.\"\n\nFirst, it perverts a race and socio-economic issue into a gender-based one. It co-opts the struggles of minorities and poor people into a gender-based narrative, and by doing so, removes the focus from those disenfranchised groups. Instead of focusing on black and poor people in education, we focus on women. And so instead of developing a plan around providing those subgroups with equal opportunities to quality education, we developed common core. \n\nMisleading society to believe that women are suffering from \"the patriarchy\" by changing the narrative is not only morally reprehensible, it has a real negative effect on those groups who are truly suffering. By framing the education gap in racial and economic backgrounds as a gender issue, feminism has prevented those groups from receiving the redress they need and deserve. \n\nBy it's own damn source, linked as a PDF in the article, you can see that white girls (39% SCI/44% MAT) perform better than both all boys (35% / 36%) and girls (28% / 35%), in both science and math (using the National 8th Grade Assessment proficiency levels). Were it not for the extremely low outliers of black (9%) and hispanic (13%) girls, girls as a whole would likely perform just as well as boys in science. And they already perform just as well as boys in math (35% vs. 36%). \n\nAnalyzing the data correctly, the question isn't, \"why are girls performing worse in science and math?\" but \"why is there such a large disparity between minority girls and their boy counterparts, in science proficiency?\"\n\nBut instead of focusing on the real issue, that minority girls aren't connecting with their science education, and that minorities, as a whole, are receiving a poorer education than their white counterparts, this article talks about how girls the nation over \"also often lack access to high-quality, rigorous courses, particularly in science, technology, engineering, and math, or STEM.\" Which is total and utter bullshit. That access is based on socio-economic background, not gender. It should be overtly obvious that there is no barrier to entry girls face in the same school as boys, but feminism wants to paint a picture of female repression. So it goes on to selectively discuss lower rates of AP test takers in specific STEM fields. If girls are taking AP STEM classes at lower rates than boys, it MUST be because they simply don't have access to those classes, there must be something preventing them from enrolling, whether that be patriarchal gender norms, or a systemic failure to prepare them, right?\n\n\"Girls and students of color take the Advanced Placement, or AP, exam for computer science at lower rates and pass less frequently than boys and white students. About 30,000 students took the most recent AP exam for computer science...Less than 25 percent of test-takers were girls...Girls are underrepresented among AP test-takers in nearly all STEM fields. In 2013, for each female student that took the Physics C exam, more than 2.5 male students took the same test. Boys took the the Physics B exam at a rate of nearly 2-to-1 compared to girls and took the Calculus BC exam at a rate of nearly 1.5-to-1 in the same year.\"\n\nBeing an informed individual, I could smell the bullshit on this immediately, so I decided to go straight to the source, and found the [AP program summary report.](https://secure-media.collegeboard.org/digitalServices/pdf/research/2016/Program-Summary-Report-2016.pdf)\n\nThey use 2013 numbers, but this is a 2016 report, so I expect some variance, but if the problem is systemic gender bias, the patterns should hold. Let's see.\n\nOut of 37 tests, women test takers outnumber men in 25 categories. Of the remaining 12, many were so close as to be negligible (4 categories separated by less than a 1% margin). So of 37 tests, female students were approximately equal to or above the number of male test takers in 29 of 37 tests. \n\nOh, but we're discussing STEM. It's a safe assumption that every test not used as an example in the article was dominated by female students, or at least had equal representation, because their selective citation bullshit is key to painting their narrative of female repression. Again, let's see.\n\nIn biology, female students accounted for over 50% more test takers than males. In calc AB, the variance was in favor of males by less than 2%. In chemistry, less than a single percentage point. In psychology, about a 90% gap above men. In statistics, almost 4% in favor of girls. \n\nSo literally the only variances that favored men were listed in the article. Notice how it tried to present those examples as a representation of the gender gap problem, not as the comprehensive list of every credible disparity in favor of males?\n\nIt's so bias it's almost laughable, except for the fact that people buy into this shit and boys are suffering for it the nation over. So because males represent 75% of computer science students, there's obviously a barrier to entry for women. Clearly girls don't have access to equal STEM education. The fact that girls represent almost 70% of all psychology test takers, or 65% of biology test takers, just means that feminism is working, and girls are taking their rightful place above men, though, right? \n\nThe fact of the matter is, girls don't like computer science. It's really simple. And is that such a big problem? Is it not enough that girls already match or dominate in 78% of AP classes? Are boys not allowed to have ONE educational field that they dominate without reproach, for simply being drawn to it? \n\n\"Girls are underrepresented among AP test-takers in nearly all STEM fields\" I've shown that that was a blatant, boldfaced, flat-out lie. Not only that, they are indeed overrepresented in advanced high school education. Girls were 56% of AP students in 2016.\n\nSo when do we decide we've reached equality? When girls are the majority and outperform boys in every category? Because the current statistics show that girls have every opportunity as boys do, if not more. Of course, the article ends with the all-time favorite feminist myth \"wage gap.\" Which, no matter how many times has been proven to be unequivocally false, a misrepresentation of statistics that doesn't take into account career field, tenure, etc., it still gets repeated ad nauseam. Similarly, we still propagate this \"girls are struggling\" bullshit, and focus our attention and resources on fixing that nonexistent issue.\n\nThe result is a lower quality education for both girls and boys. In grade school, he may not have been told that Legos were not for his gender, but god forbid the author of your editorial wanted to pick up a baby doll. The treatment amongst girls and boys for crossing the gender barrier is exponentially less forgiving to boys than girls. In fact, most little boys will accept the tom-boy girl once she proves herself to them. Boys will at first reject, and protect the group, but once you're in the group, you're in. A girl that proves she can hang with the boys is accepted. On the other hand, little boys who want to play with dolls or dress effeminately will face backlash from all sides of their peers. Adult society has come to accept them, and even welcomes them, as it falls in line with the pervasive feminist agenda. \n\nBut little girls want nothing to do with effeminate little boys, because they're still boys - they can't ever be part of the club. And other little boys will mercilessly torment them for going against the status quo. They will never find popular acceptance, and their isolation and abuse will only grow in time. There's a reason \"that's gay\" became synonymous with \"that's stupid\" in the 90's; without their knowledge, children were perpetuating homophobic attitudes that they absorbed from their parents and society, and it expressed itself through cognitive linguistics. Now, despite widespread support of the LGBT community, my generation struggles to overcome internalized homophobia that it wasn't even aware of, because it's been incorporated into their thought processes since before they even knew that \"gay\" meant anything other than \"stupid.\" \n\nThat doesn't take into account the hostile environment school is for boys, in general, now. It's no wonder boys are dropping out and performing worse at alarmingly high rates when \"no tolerance\" policies are the norm - when typical boy behavior, like roughhousing/mock fighting and fascination with guns and violence is outlawed. When you get detention for playing tag, when you can't wrestle with your friends like you do at home in your backyard, when you get suspended for drawing a picture of a gun, when GI joes are the devil's playthings, why would you like school? They've criminalized all the ways a young boy is naturally inclined to enjoy himself during his free time, and then have literally redesigned the entire education system and process to focus on girls - on the way they think and what they're interested in. Then boys grow up, begin looking at colleges, and are told that they've had all the opportunities and help, that no one wants them because they aren't a \"special group,\" and that they have to be twice as qualified as the next kid to make it anywhere. You're a white boy applying for a scholarship? Can't you just pay in privilege? Please, scholarships are for the disadvantaged women. You know, the one's who outnumbered you in your AP biology and psychology classes. And 20 others. Because they're underrepresented. Can't you just join the military and die for us instead?\n\nBut really, at the university level, there is absolutely no shortage of scholarships available to women to enter STEM fields. In fact, some universities went so far as to demand equal enrollment of women as men, creating an artificial equality that actively denied men the right to an education, all for the appearance of equality. The results were universally disastrous, with many programs being forced to shut down because they couldn't meet minimum enrollment requirements, with women as the limiting factors. There are universities that went a year without a chemistry department because enrollment fell when women decided they truly didn't want to be a part of the STEM program they were pushed into, and transferred to majors that were more suited to their actual desires. The fact is, most women don't see an appeal in classic STEM fields, but we've decided that equality doesn't mean equal opportunity, but equal outcomes. So it isn't enough for women to have more and easier access to STEM programs, they must also choose to enter those programs, even when it makes them unhappy. We're fighting for equality that no one actually wants; we're telling women to choose STEM, even when they don't want to, and in doing so are actually regressing equality by limiting women's choices, in admonishing any decisions they make that don't align with the narrative. We're telling women that their choice to enter social work isn't as valid as entering hard sciences. This is despite the fact that women provably prefer fields of study that involve social interaction and the study of people - fields where their feelings are considered important and pivotal, rather than dismissed in totality, like the hard sciences. This is why when women choose a hard science, they often choose psychology, or else in the medical field, pediatrics or general medicine. But despite the fact that psychology is an overwhelmingly female dominated field of study and profession, there is no call for a 50% outcome. Feminist ideology has conflated the belief that equal access, which is important, should result in equal outcomes, which is not important: outcomes are the result of personal choices, people making decisions that make them happiest. And by demanding equal outcomes, feminists are diminishing those choices of women to pursue the paths they feel a natural inclination for. \n\nEquality is recognizing that men and women both face unique struggles that may limit them from pursuing their hearts' desire, and trying to alleviate those disadvantages; feminism is the belief that there is no core difference between men and women, and therefore any difference in gender representation is a result of patriarchal repression, albeit systematically directly or systemically indirectly (eg. discrimination in admittance/hiring versus constructed gender roles and societal pressure/judgement). The result is that women feel diminished for following their dreams and face undue scrutiny for being gifted opportunities they didn't earn, but didn't ask for. The author addresses this scrutiny in his last paragraph, but fails to question where that scrutiny stems from. Feminism is creating the problems it seeks to address. And men are suffering as well. Besides the arbitrary rejection from the pursuit of their desired education and careers, the barriers to entry and exclusion from the education process has resulted in worse performance by men and boys at literally every level of education, from grade school through college. Not just worse than previously, but worse than women as well. It's not that men have it better but are seeing a decrease in their disparate well-being, but men are already worse off and are seeing steady decline.",
    "title": "My response to a friends re-post of a feminist editorial regarding female students and their 'plight'; or, How Feminism is Hurting Education for Everyone",
    "subreddit": "MensRights",
    "timestamp": 1493398368,
    "score": 50,
    "keyword": "woman engineer"
  },
  {
    "text": "Educated woman having sex multiple times on promise of marriage isn't rape: Kerala HC, India Educated woman having sex multiple times on promise of marriage isn't rape: Kerala HC\n\nhttp://timesofindia.indiatimes.com/city/kochi/educated-woman-having-sex-multiple-times-on-promise-of-marriage-isnt-rape-kerala-hc/articleshow/57023474.cms?from=mdr\n\n\"The trial court had sentenced the accused to undergo simple imprisonment for seven years and to pay a fine of Rs10,000.\n\n\nAcquitting the appellant, the court said in the judgment, \"An analysis of the evidence given by the lady will show that the lady had intercourse with the accused on many occasions at her residence. Even a common lady or an uneducated lady cannot be deceived more than once or twice on a promise of marriage. PW1 (complainant) is a well educated lady having a degree in engineering. It is quite unbelievable that she could be easily deceived on a marriage promise on many occasions. Admittedly, three or four such instances were at her residence, when her parents were away. Much probe is not required in this case to find that the sexual intercourse which the prosecutrix had with the accused on many occasions at her house was with her consent.\"\"",
    "title": "Educated woman having sex multiple times on promise of marriage isn't rape: Kerala HC, India",
    "subreddit": "MensRights",
    "timestamp": 1486543618,
    "score": 18,
    "keyword": "woman engineer"
  },
  {
    "text": "Reading this practically broke my brain - not just what was written, but *where* - Rebecca Solnit (author of 'Men Explain Things To Me') - in the London Review of Books No joke - this is the *first* sentence of a 3,500+ word jeremiad ('essay' is clearly not applicable in this case):\n\n> Women told me they had flashbacks to hideous episodes in their past after the second presidential debate on 9 October, or couldn’t sleep, or had nightmares.\n\nLet me be clear - I think Trump is a buffoon. I stated this publicly long, long before his election. Just before his election, after the day of his election, and nothing he has done since has persuaded me from this opinion (it has in fact entrenched it).\n\nBut despite that, the way Solnit chooses to describe him in this essay - even to me, someone who is **not** a fan of Trump - is just beyond fucking absurd:\n\n> Trump roamed, loomed, glowered, snarled and appeared to copulate with his podium, grasping it with both hands and swaying his hips, seeming briefly lost in reverie. The menace was so dramatic, so Hitchcockian, that the Hollywood composer Danny Elfman wrote a soundtrack for a video edit playing up all the most ominous moments. \n\nReally? WTF???\n\nAnd yet still people find it hard to believe Clinton's campaign lost her the **actual** election (let's leave aside the popular vote issue for the moment - and perhaps longer than a moment, but that's a discussion for another day).\n\nMy italics in all quotes that follow:\n\n> ‘Watching Trump lurching behind Hillary during the debate felt a bit like a zombie movie,’ Elfman said. ‘Like at any moment he was going to attack her, rip off her head, and eat her brains.’ *Friends told me they thought he might assault her; I thought it possible myself as I watched him roam and rage.*\n\nIt's often said these days that 'hysteria' is a gendered slur on the grounds that the etymology of the word is, according to the OED,: \"via Latin from Greek *husterikos* ‘of the womb’, from *hustera* ‘womb’ (hysteria being thought to be specific to women and associated with the womb).\"\n\nBut ... almost no one who uses the word actually *knows* that this is its origin and on that basis it is a point of near total irrelevance to raise it at all - for its primary modern meaning (from the same dictionary) is \"a wildly emotional and exaggerated reaction\".\n\nTrying to claim that people *actually* and *genuinely* believed that they thought Trump \"might assault\" Clinton - on live television to tens of millions of Americans and that Solnit \"thought it possible\" herself is - *surely* - the very definition of hysterical, no?\n\nBelieve it or not, Solnit has made these points in just 253 words out of over 3,500! \n\nShe continues:\n\n> Like many men throughout the election, [Trump] appeared to be outraged that she was in it. The election, that is. And her space.\n\nAnd continues:\n\n> Earlier in the campaign he’d urged his supporters to shoot her. \n\nThis is so obviously false that it literally breaks my brain that the editors of the *London Review of Books* (LRB) allowed it to be published. Now don't let's be mistaken - the LRB is a Left, even far Left, organ and unashamedly so - and fair enough, right? Everyone is entitled to his or  her point of view, right? (Excuse the TYT Cenk-like 'right?', 'right'? verbal tic there). \n\nYet the calibre of its usual contributors includes the likes of Professor of the History of the Church at the University of Oxford, [Diarmaid MacCulloch](https://en.wikipedia.org/wiki/Diarmaid_MacCulloch),  Professor of Classics at the University of Cambridge, [Mary Beard](https://en.wikipedia.org/wiki/Mary_Beard_(classicist)), Professor of History at Columbia University, [Adam Tooze](https://en.wikipedia.org/wiki/Adam_Tooze), and Professor of Early Modern History at Queen Mary University of London. [Miri Rubin](https://en.wikipedia.org/wiki/Miri_Rubin).\n\nMy point being that even if you disagree with the beliefs and politics of such people as those I just mentioned, at least you can concede that they are not complete imbeciles that produce utterly baseless trash such as Trump had \"urged his supporters to shoot\" Clinton.\n\nIf that were **actually** the case, then Trump would be incarcerated right now. But not only is he **not** in prison, but he is in fact the President (elect).\n\nBut, perversely, that is yet just more grist to Solnit's mill - on the particular version of Bizarro world that she must surely inhabit, the very fact that Trump has not been incarcerated on the grounds of that frankly ludicrous allegation is - the reader is left to infer - the very proof that the United States is a society that - in the memorable words of of Chloe Angyal - [\"hates women. Just ... hates us.\"](https://www.youtube.com/watch?v=wbfKzXa6pjg) (Angyal was, notoriously, saying this to [Sabrina Rubin Erdeley](https://www.theguardian.com/media/2016/oct/20/rolling-stone-reporter-admits-mistakes-in-jackie-article) following the publication of *that* *Rolling Stone* story ... you know ... the one that was [total and utter bullshit](http://www.nydailynews.com/news/national/rolling-stone-writer-uva-rape-story-nightmare-article-1.2698465)).\n\nSpeaking of which, Solnit is at this point just getting into her stride ...\n\n> Trump is patriarchy ...\n\nShe's dropped the 'P'-bomb already ... still barely past the beginning of this text by the way.\n\n> Trump is patriarchy unbuttoned, paunchy, in a baggy suit, with his hair oozing and his lips flapping and his face squinching into clownish expressions of mockery and rage and self-congratulation. \n\nWell, he is a 70-year-old man after all. \n\nI mean, Heaven fucking Forefend that [media commentators should see any reason whatsoever for shying away from making personal comments on the physical appearance of old people in the public eye ...](https://www.nytimes.com/2016/04/17/fashion/mary-beard-against-internet-trolling.html?_r=0)\n\n> He picked as a running mate buttoned-up patriarchy, the lean, crop-haired, perpetually tense Mike Pence, who actually has experience in government, signing eight anti-abortion bills in his four years as governor of Indiana, and going after Planned Parenthood the way Trump went after hapless beauty queens. \n\nIn other words, she suggests that Pence is 'grabbing women by the pussy' in his own way - by taking a stance against abortion. Just for the record, I personally do not oppose abortion - but that's not really the point.\n\nWhat *is* the point is how on Earth is Solnit going to square this narrative with the election results that show that, actually, a surprising number of women voted Trump, not Clinton (why this is just automatically assumed to be 'surprising' is a fascinating question in itself).\n\nAnd it is on this question that Solnit jumps the shark ... or she would jump the shark if that shark was atop the Empire State Building ... smoking a cigar and wearing a monocle ... while playing the base guitar on its fins ... (my italics)\n\n> The Republican platform was, as usual, *keen to gut* reproductive rights and *pretty much any rights that appertained to people who weren’t straight, or male, or white.*\n\nUh-oh, here we go ...\n\n> Misogyny was everywhere. \n\n> Trump’s surrogates and key supporters constituted a sort of misogyny army ... The army included Steve Bannon, who as head of the alt-right site Breitbart News *hired Milo Yiannopoulos and helped merge the misogynistic fury of the men’s-rights movement with white supremacy and anti-Semitism to form a new cabal of far-right fury*.\n\nActually, I agree that Bannon is an asshole, but that hardly justifies the wild and paranoid accusation that \"Milo Yiannopoulos ... helped merge the misogynistic fury of the men’s-rights movement with white supremacy and anti-Semitism to form a new cabal of far-right fury\"\n\n> It seems telling that the rise of the far right and the fall of truthful news were to a meaningful extent engineered by a television network that was also a miserable one-man brothel. *But that old right-wing men are misogynists is about as surprising as that alligators bite.*\n\nWell, that isn't racist or bigoted at all. / s\n\n> ‘No advanced step taken by women has been so bitterly contested as that of speaking in public,’ Susan B. Anthony said ... \n\nSusan B. Anthony you say? Is that the same Susan B. Anthony who said:\n\n> “You have put the ballot in the hands of your black men, thus making them political superiors of white women. Never before in the history of the world have men made former slaves the political masters of their former mistresses!”\n\nI'm not sure, but [I believe so](http://intersectionalism.tumblr.com/post/130662354761/elizabeth-cady-stanton-1815-1902-social), yes.\n\n> No advanced step taken by women has been so bitterly contested as that of speaking in public,’ Susan B. Anthony said in 1900. ‘For nothing which they have attempted, not even to secure the suffrage, have they been so abused, condemned and antagonised.’ Or as Mary Beard put it last year, ‘We have never escaped a certain male cultural desire for women’s silence.’\n\nSolnit has yet more:\n\n> One got the impression that any power a woman had was too much, and that a lot of men found women very scary [...] Trump’s slogan ‘make America great again’ seemed to invoke a return to a never-never land of white male supremacy where coal was an awesome fuel, blue-collar manufacturing jobs were what they had been in 1956, women belonged in the home, and the needs of white men were paramount.\n\n> One might argue she lost because of ... years of negative media coverage; or because of foreign intervention designed to sabotage her chances; or because of misogyny. \n\nMedia coverage like the time they showed that when she said she remembered flying into the former Yugoslavia under sniper fire ... she hadn't?\n\n> *I’ve always had the impression –from TV, movies, newspapers, sport, books, my education, my personal life, and my knowledge of who owns most things and holds government office at every level in my country – that white men get a lot of attention already.*\n\nI see.\n\n> To be a feminist you have to believe in your equality and rights, which can make your life unpleasant and dangerous if you live in a marriage, a family, a community, a church, a state that does not agree with you about this. For many women it’s safer not to have those thoughts in this country where a woman is beaten every eleven seconds or so and women’s partners are the leading cause of injury to them. And those thoughts are not so available in a country where feminism is forever being demonised and distorted. \n\nSpeaking of \"demonised and distorted\" I'm having trouble digesting quite what Solnit means by the following point:\n\n> It seems it’s also worse to vote for a racist if you’re a woman, because while white women were excoriated, white men were let off the hook (across every racial category, more men than women voted for Trump; overall 54 per cent of women supported Clinton; 53 per cent of men voted for Trump).\n\nWhat?\n\n> ... one could argue that Trump had said, incessantly, aggressively, I’m a white man, vote for me, and even that Sanders implicitly conveyed that message. \n\nCould one?!?\n\n> Many supporters fell silent or took to supporting [Clinton] in secret ...\n\nEh? What?\n\n> ‘I’ve come to believe,’ Sady Doyle wrote, ‘that, in some ways, saying nice things about Hillary Clinton is a subversive act.’\n\nWhat? Eh?\n\n> Mentioning that [Cinton had] won the popular vote *upset many of the men I am in contact with* ...\n\nNone of the women then?\n\n> ‘With their deep belief in their own special monopoly on objectivity, slightly too many men assure me that there is no misogyny in their subjective assessments or even no subjectivity and no emotion driving them, and there are no grounds for other opinions since theirs is not an opinion.’\n\nSolnit *really* fucking hates white men.\n\n> A lot of people, *particularly white men*, could not bear her, and that is as good a reason as any for Trump’s victory. ... They did not blame themselves or the electorate or the system for failing to stop Trump.\n\n**TL;DR** What's above is actually the TL;DR believe it or not - you can read the thing in its entirety [here](http://www.lrb.co.uk/v39/n02/rebecca-solnit/from-lying-to-leering)",
    "title": "Reading this practically broke my brain - not just what was written, but *where* - Rebecca Solnit (author of 'Men Explain Things To Me') - in the London Review of Books",
    "subreddit": "MensRights",
    "timestamp": 1484426104,
    "score": 8,
    "keyword": "woman engineer"
  },
  {
    "text": "A Socialist Defense of Gender Roles Edit: wow.  I've never seen such quick downvotes.   Remember that this is supposed to be a discussion forum not an ideological purity contest.   Only downvote if you think this post has contributed nothing to the debate.   \n\nEdit 2: I give up.   Enjoy the decline.   \n\nUnusual and long post here.    The non-socialist majority may enjoy it for the stats and the un-pc quotes by figures like George Orwell, Nicola Tesla and Christopher Hitchens.  \n\nMRA's are right to suggest that men got a raw deal under traditionalism.    I'm not suggesting we go back to a situation where e.g. a man be forced to pay his wives' debts.   Or that people be forced into certain roles.   I'm suggesting that the majority of men and women would be happier in a traditionalist arrangement: the woman takes care of the kids and home and the man is respected and honored for his contributions in turn.   Nor would this prevent women from achieving status in the male sphere.   It would just be more unusual since women would be doing the more important work of raising children.\n\nA return to a traditional conservative lifestyle is impossible absent collapse.   Female liberation has [never](https://archive.org/details/b20442580) been internally reversed.   Unfortunately it is also incompatible with large inequalities due to female hypergamy.    The majority of men are left out in the cold, so have no impetus to work.  Therefore a combination of men's rights and socialism are required if civilization is to continue.   This will naturally lead to men and women embracing traditional gender roles.    The only other alternative is a return to patriarchy, however that is exceedingly unlikely for reasons JD Unwin explains in the above link.   \n\nI was recently watching a documentary about a financial depression in the late 19th century.   A (female) professor noted that \"many women were forced\" into the workplace.   It struck me as an odd turn of phrase, since feminists claim that women weren't \"allowed\" to work back then.   Turns out this is false.   Karen Straughan notes that there are records e.g. of female blacksmiths going back to the middle ages.   Women could work, they just didn't want to.   Why would they?   For 90 percent of the population working sucked.   It still does.  Also, it's hard to work when you're pregnant.   \n\nThe only way feminists can get away with characterizing the traditional female sphere as a prison is by lying about it.   In truth, women could own [property](https://www.cambridge.org/core/journals/continuity-and-change/article/favoured-or-oppressed-married-women-property-and-coverture-in-england-16601800/617F23DD2D64A036C58E0BF7D56F89BE), wife-beating was severely [punished](https://www.debunker.com/texts/ruleofthumb.html), and women were respected for their role in society.    Alexis de Tocqueville commented on the essential equality of the male and female spheres in Democracy in America (1840) :\n\n“Americans,” he said, did not think that men and women should perform the same tasks, “but they show an equal regard for both their perspective parts; and though their lot is different, they consider both of them as being of equal value.”\n\nWomen have ALWAYS been greatly respected by men for being mothers and nurturers.   What is a more important job than raising a child?   It was only a small number of envious man-haters that decided otherwise.   \n\nThe feminist movement appears to have arisen not do to \"oppression\" but boredom.   Rich women lived lives of luxury most men could only dream of, but they were envious of the social status of their doctor and lawyer male relatives.   They wanted the privileges of both the female and male spheres.  They wanted to \"have it all\".\n\nA number of intellectuals expressed concern, though not as many as you'd expect considering the enormity of what feminists were proposing.   The socialist Earnest Belford Bax claimed that women were already the [privileged sex](https://archive.org/details/fraudoffeminism00baxerich).    The socialist Mother Jones, who spent most of her time organizing male coal miners and fighting child labor, considered it absurd that women could be \"liberated\" by work.   And Nicola Tesla, one of the most brilliant men who ever lived, predicted that \"equality\" between men and women would quickly lead to female superiority and massive social dysfunction: \n\n\"This struggle of the human female toward sex equality will end in a new sex order, with the female as superior. The modern woman, who anticipates in merely superficial phenomena the advancement of her sex, is but a surface symptom of something deeper and more potent fermenting in the bosom of the race.\"\n\nThe Catholic GK Chesterton, who embraced socialist ideas about land reform, suggested that mixing the traditional male and female spheres would be a disaster for society.   \n\nThis [article](http://gkcdaily.blogspot.com/2015/03/chesterton-notorious-anti-feminist.html) provides a decent summary.   \n\n>Woman is wrong, he considers, to try to adapt herself to society by making a man of herself. The contrary should come about—Society should adapt itself to womanhood by becoming gentler. To Feminists, he acknowledges that women undergo a revolting tyranny in factories; but he wanted to destroy the factories, while they, he felt, were content with destroying womanhood.\n\n\"The virtues of the Family and Home, due to free choice and limitation, form the basic cell of the social organism. Banish the spirit of Home, and you suppress the very possibility of a sanely constituted society.\"\n\nChesterton advocated wealth redistribution to the poor so that women wouldn't have to work.   George Orwell, who despite popular belief was a socialist, recommended the same: \n\n\"Far more drastically than anyone has proposed hitherto, taxation will have to be graded so as to encourage child-bearing and to save women with young children from being obliged to work outside the home (CW 16, 223).\"\n\n\"This, of course, is a subject of great interest in India, and roughly what we want discussed is how far women benefit by escaping from home and whether in the long run it is desirable for them to undertake the same work as men” (CW 13, 474).\n\nFeminists set about to destroy the \"patriarchal\" family, but they had nothing to replace it with.   We are not living in hunter-gatherer societies; the idea that the \"whole tribe\" would raise children has amounted instead to children being stuck all day in daycares and classrooms.   Women aren't able to spend as much time with their children as they'd like: they're too busy working.   They have replaced loving husbands with asshole bosses.   In a tragic irony, the \"new American dream\" for women is to become a [housewife](https://www.forbes.com/sites/meghancasserly/2012/09/12/is-opting-out-the-new-american-dream-for-working-women/#3c1b00ad623a).     \n\nThe single mother experiment has been a disaster.    Feminists assumed that men were only needed for their wallets, whereas it turns out that that males are [crucial](http://www.reviewjournal.com/life/family/experts-say-father-s-involvement-pivotal-proper-child-rearing) at every stage of child rearing.   The statistics for children raised by single mothers are nothing short of horrific.  \n\nWhat about men?   Men no longer feel like they have a role to fulfill, so are increasingly dropping out of society.   Suicides are at all time high.   Drug and alcohol addiction is rampant.    \n\nBy privileging girls in school and women in work, young women are now out-earning young men.   This leads to women being unable to find what they consider suitable partners due to hypergamy.  \n\nWomen have become ever more hateful and spiteful toward men.   Part of this is due to feminist lies, part of this is due to being forced to compete with the opposite sex.   The sexes aren't supposed to compete with one another; that's not how we were designed.   We're supposed to be complementary.  Since male leaders don't want to compete with women, they gave them ever more privileges at the expense of men.    So much for patriarchy theory.  \n\nAnd now we find the reason why being a housewife is the new American dream: Research has found that stay-at-home mothers are [happier](http://www.dailymail.co.uk/news/article-3634473/The-job-makes-happiest-Housewife-Survey-finds-stay-home-mothers-satisfied-profession.html) than those who work (female unhappiness is actually at an all time high).   So the whole feminist experiment was a gigantic waste of time.   More than that, it was a potentially fatal social experiment.    \n\nWomen who don't have children are more likely to get [cancer](http://www.everydayhealth.com/womens-health-specialist/childless-women-and-cancer.aspx).   The same applies to women who wait until their thirties to have children (the current trend).    Fewer and fewer women are giving birth.   Since population levels are unsustainable, more and more immigration is required.   This, in turn, leads to increased mistrust in communities.    The ruling class is able to play off workers against one another with ease, preventing solidarity.  \n\nMale creative genius is ignored and suppressed instead of being nurtured.    And for what?   So women can become unhappier?  \n\nIn The Red Pill, Warren Farrell emphasizes flexibility of roles.   But women don't seem to want flexibility for men.   They become resentful of stay at home dads.   They recoil at men expressing emotions.   They refuse to \"date down.\"   They demand all of their traditional privileges.  \n\nThe association between communism and feminism arose mostly from Marx's benefactor Friedrich Engels.   However it is interesting that many of the early socialists rejected his views on the subject and had no problem with traditional gender roles.    They didn't think women should be *forced* to be housewives, but as mentioned, only rich women were privileged enough to conceive of work as liberation.   \n\nFeminists have re-engineered society but it has not helped either men or women.   In the Israeli Kibbutz, which embraces an anarchic form of social organization, people were not given any gender roles but naturally became the most traditionalist society in the world.   This leads me to believe that the vast majority of both men and women prefer behaving like men and women.   We have created a society that ignores the happiness of the 99% and caters to outliers among both sexes -- in particular lesbians.    These outliers should not be oppressed, but they shouldn't dictate how the rest of us behave either.  \n\nIf it is respect and independence women are after, men's rights combined with traditional gender roles would allow them to have both.   They would be respected as mothers, would still be allowed to enter the male sphere if they wished (though only on equal terms -- no feminist bullshit), and wouldn't have to suffer being wage slaves.   They would not be able to simply divorce the man and take the kids and his money, so marriages would remain intact.   Men would likewise be able to act as men again, without being demonized; they would be respected and honored for the work they do to maintain civilization, and would have all the rights that women currently have.   \n\nEgalitarian economics would ensure that the majority of men not be excluded from romance due to hypergamy.   \n\nBonus: Christopher Hitchens: Women shouldn't have to work.  \n\nhttps://www.youtube.com/watch?v=TQas34criFo",
    "title": "A Socialist Defense of Gender Roles",
    "subreddit": "MensRights",
    "timestamp": 1489258273,
    "score": 7,
    "keyword": "woman engineer"
  },
  {
    "text": "Women must serve in army If there are more boys in your family, than girls, but in other families, for example, there are girls only,  then why your children should serve and be cannon fodder, what is their guilty? The fact that they were born the wrong gender? Have you invested in them less effort, money and love, than parents of girls? Think about your children's children, as if they, too, will be boys? If, in some countries, for women quotas are introduced in parliament, then they should have quotas in squads involved in a military combat. Why do men agree to be lower than women, has it been been seen in the history, that the man should have fewer rights and more responsibilities? It used to be quite the opposite, for example,the penalty for killing a woman was twice less than for killing a men. If some men think that women are  more important than them, then they should serve in the army in the first place.\n\n&nbsp;\n\nIt is believed, that in the past, women were the property of men. Property can not fight, so in those days women didn't serve in the army. Today, men and women have equal rights - and rightly so, and therefore the man should no longer protect women as their property, and the woman should protect herself as a complete person equal to man. Actively fought women of such nations as the Celts and Sarmatians, the Scythians, the Nordic Valkyries also did not arise out of nowhere. And Cimmerian, from whom came the Slavs, their woman could not marry until they bring the enemy's head. But the women who fought,  had the same rights, so in the history there always has been a direct link between the military duty of citizens and civil rights.\n\n&nbsp;\n\nOf course, not every country has the military conflict, but there are countries where such conflicts may arise. Even in calm countries where forced recruitment is not planned, there are still discriminatory laws, giving privileges to women in recruitment matters. The question arises - why do they exist? Yes, then, that in emergency situations to make man meat. And if you, gentlemans, don't want to become meat, you need to protect your rights today, and not when it is too late, and there will be no time to change something. In the wild nature, for example, in most species, males and females live equally and have equal rights, responsibilities and survival, and the distribution of people like cattle, when most males go for slaughter - is manifestly fascist.\n\n&nbsp;\n\nImagine if in an army served only women, do you think they would have suffered, or demanded equal rights and responsibilities with men? The worst thing is not that men are discriminated and are forced to become meat on the basis of sex, but that they do not even require the equal treatment of both sexes. They do not realize that childbirth is just a job, which is much easier and safer than, for example, the work of a miner, and for the work no one should receive an exemption from the military service or any special privileges other than monetary rewards. Yes, childbirth, sometimes is painful, but no one is exempted from military service, from those who have passed, for example, through a painful reception at the dentist. After all, the main burden of child raising are, again, in the men. While women work for childcare is usually not as hard. But most men are working hard, earning money for the children. Do not forget, that women who do not have children, or are infertile, or even those who claim that they did not ever think about childbirth - childfree - also dont have to serve in the army. Is that normal?\n\n&nbsp;\n\nEven if we imagine, that discrimination on basis of sex may be economically beneficial to the country, as, for example, once, slavery was profitable, it does not mean that such discrimination is permitted. Neither slavery nor conscription of men to the army, in the absence of conscription for women can not be justified by any economic or demographic benefits, because above all this, there are human rights. In addition, conscription of women equally with men, most likely, will improve the country's economic and demographic indicators. Therefore, any rights of men must be greatly expanded, and we are not talking about the benefits of plots or free transport tickets, or women should be deprived of many rights and are endowed with additional responsibilities, for example, with army tax, or women should be drafted into the army.\n\n&nbsp;\n\nThe scale of the threat to Israel, North Korea or Norway is not as great as for our country, but even there, women are encouraged to join the army. In Georgia, too, there was introduced a bill on compulsory military service for women. In some places such practice has already been applied, that men and women live in the same barracks, and are washed in the same bath, so there is no need for additional infrastructure for a women conscription. Naturally, the appeal of women should not be sham, as it happens in some armies of the world, when they only shift the papers, and then receive military pensions and apartments, and a woman should be fully participating in the military combat.\n\n&nbsp;\n\nWomen are conscripted into the Kurdish militia, where they account for 30% of participants, and after a month's course of study their effectiveness is not inferior to men in battle. According to the latest research and the experience of fitness trainers, muscles of women often grow even faster than that of men, and, as a result of physical activity during pregnancy, childbirth, then, passes even better. The reproductive cycle of women, although it may be suffering from stress, but even women who passed the concentration camps or the Second World War combats, in the majority, then successfully gave birth. It is believed also that psychologically women are more stable and more executive than men.\n\n&nbsp;\n\nWhen women are deprived of their duty to marry and have children, then men are not deprived of their duty to serve in the army. Women did very tricky - they have equal rights, but forgot about equal responsibilities. We must understand that equal rights mean equal responsibilities. It is because responsibilities restrict rights, and thus make them unequal. Society should not be considered as two separate gender or sex. Society is one unit, and if some people can give birth, it does not mean that they should have more rights and fewer responsibilities than those who can not. If women take equal part in the elections, so they influence to the policy of the state, then they must carry equal responsibility on the battlefield, if this policy, for example, led to war. Just because of the equal rights and opportunities for women leaving abroad, demographics is suffering, but equal rights is correct, only with equal responsibilities and therefore men and women have on an equal basis to serve in the army.\n\n&nbsp;\n\nIt is unclear why the men are compulsory drafted, but not women. After all, there are enough man volunteers and contract military serving in the army. It means that the male half of the population does so much more to the Army than women. Therefore, primarily woman should be compulsory drafted. Some say that the women compulsory conscription will not make life of men better, and therefore it is not necessary, but it's just not the case. If, for example, all women wold be extempted from taxation, then perhaps it would be positive discrimination? It is quite obvious that it would be a negative discrimination in relation to men, and therefore, regardless of whether this will be better for life of a men, or not, but women should be recruited into the army.\n\n&nbsp;\n\nLack of conscription or military draft for women is not positive discrimination, because those men who serve in the place of women are discriminated. If, for example, some citizens are physically stronger or better able to fight, it does not mean that they should forcibly, for free, to work in mines for those citizens, who are physically weaker, or die for them on the battlefield. Stronger citizens are not worse than the weaker, and all citizens are equal under the constitution. Some people say that the conscription of women into an army is hate of woman. So, if some citizens say that only man should be conscripted into an army - isn't it hate of men? Why women do not serve even the alternative community service?\n\n&nbsp;\n\nTo not affect a demography, it is possible to conscript women after 30 years old for active participation in military combat, and the father of their children can stay at home for childcare, and the children can be fed with a special child food. It is sufficient to note that many women do not breastfeed, so their breast doesn't not lose shape. Demographics can be encouraged by the fact, that women who have not given birth to two children under 25 years, can be conscripted to participate in military combat, not at 30 years old, but at 25. By the way, father's right to education of the child should be the same as mother's, because the genetic code of a child is by half father's. And younger woman can be consсrited to protect the safer parts of the front, as well as for logistics and engineering. In case of pregnancy, if women is conscripted for the year, then she would be able to serve the major part of military service before childbirth.\n\n&nbsp;\n\nTo prevent pregnancy, women can set special intrauterine device , use of oral contraceptives. and in case of failure - the woman herself is responsible, and her pregnancy is regarded as a negligent attitude to military service, and shall be punished by imprisonment accordingly. However, if a pregnant woman can continue to perform combat missions, the punishment for her can be canceled. There are examples of women who engaged in kickboxing at nines month of pregnancy, and it didn't not harm the baby. The combat vest can be replaced by larger, because the soldiers who have additional weight and have belly can serve too, and special combat jackets for pregnant women could be bought. In the case of the death of a pregnant soldier, the number of population of the country may suffer a bit, but in the peacetime women use contraception and make millions of abortions, and they do not see any problems with it.",
    "title": "Women must serve in army",
    "subreddit": "MensRights",
    "timestamp": 1488237129,
    "score": 6,
    "keyword": "woman engineer"
  }
]