[
  {
    "text": "Job searching with mental health issues, name changes, and generally offputting work history? Hi guys. I need help regarding questions about my work history, because it's been very unstable due to some life changes and mental health issues, and I'm not sure how to go about anything anymore. I've been out of work for a few months now and it's time I start looking about getting back into the working life. My work history is a bit questionable, so I'll just start from the beginning of my professional career and go from there. \n\nI have a 2 year associates degree in electrical engineering (with a specialty in biomedical technology) and was hired at a hospital as a biomedical technician, basically someone that repairs and maintains medical equipment. I started as an entry level technician directly out of schooling, and was promoted to an intermediate level technician a couple years later. I worked for this employer for 3 years.\n\nI was fired from that job because I was caught sleeping on the job on more than one occasion. I was going through a major chronic depressive episode (I'm diagnosed major depressive disorder and bipolar 2) and was no longer able to preform the functions of the work. I was unemployed for one year following that, and found work at a small company that did field service work for the same thing (maintaining medical equipment for small doctor's offices and surgery centers around the state [Pennsylvania]). It was a small company owned by a man and his wife, and the only employees were me, one other gentleman, and the owners two daughters.\n\nI was fired from that job a year later, allegedly because I drove the company car to a Dr's appointment on my way home from work (and it was agreed that the car would never be used for personal reasons, so it is entirely my fault and I accept that).\n\nI was out of work for another year and figured I would give up on the professional side of my life for then and just find normal work. After all, being fired twice from the same position at two different companies puts a bad taste in a lot of engineer's mouths, so...\n\nI was hired a year after that job at a Sheetz here in Pennsylvania (a gas station / convenience store / restaurant, some are more familiar with Wawa which is kind of the same thing). I was with Sheetz for three years. I started as a janitor, then worked as a front house cashier/kitchen position, then promoted to Shift Manager and ran the night shift. I loved that job... almost more than my engineering positions. \n\nAnyway... During my time at Sheetz, I decided to medically transition (I'm MtF transgender, have been all my life, just never had a chance to finally transition). I went full time, changed my name and gender markers on all of my documentation, have been on hormones for nearly three years now and have been living full time as a passable woman for three years. Sheetz was incredible during my transition and I had zero issues with them as a company, nor from my coworkers and bosses.\n\nHere's where most of my problems come in. My wife and I split up and are divorcing after an 11 year marriage, and I have four children. This past June, my children moved out to live with their mother full time in Nebraska (again I'm in Pennsylvania), and this caused me to become incredibly, majorly depressed and suicidal. I began cutting and have massive scars on my left arm, and spent most of this past summer in various mental inpatient units due to being severely suicidal. \n\nI took FMLA leave and was on short term disability for a few months while all this was happening. When I got released from the hospital and finally returned to work at Sheetz, I only lasted a few days before I realized if I kept working, I was going to either wind up back in the hospital, or be dead. My mental health has been very.... shaky, and it was incredibly difficult for me to return to work, run a team, deal with customers, and just generally be around the knives that I used to try to kill myself months before. So I wound up quitting that job, after three years.\n\nI'm at the point now where I think I'm ok, I'm a bit more stable than I was, but I still have many mental health issues that are making re-entering society a difficult matter. But sitting around stewing about it all isn't going to make things better, and I need to just get back out there and force myself to get better, because sitting around doing nothing all day isn't helping.\n\nI want to get back into a semi-professional field, and there are plenty of electro-mechanical  jobs around here, like maintaining and repairing things like food manufacturing equipment and what not. My problems are these:\n\nHow do I explain to potential employers about why I was fired from my only two professional jobs? And the year long depressive gap between them both?\n\nHow do I explain that I worked those jobs as a man? I really don't want to just flat out tell the employers that I'm trans and give them my old information, but I feel it's almost impossible not to. I'll just have to accept this one and bite the pain back I think.\n\nHow do I explain that I left my last job due to mental health reasons? That I could not emotionally and mentally handle the work or the environment? How is that in ANY way not going to send up a million red flags for the employer?\n\nI also have no professional references, only a couple managerial ones from my time at Sheetz. When a prospective job contacts my previous employers, am I just going to have to grit my teeth and hope they're not told horrible information? I'm not a bad employee, I just had some troubling times. \n\nI feel like anywhere I apply is just going to look at me like a total basket case and not even want to bother giving me a chance. \n\nSorry this post is so long, I really don't know what to do, or where to go.\n\nThanks in advance for any advice you give me. \n-L",
    "title": "Job searching with mental health issues, name changes, and generally offputting work history?",
    "subreddit": "jobs",
    "timestamp": 1576529260,
    "score": 120,
    "keyword": "woman doctor"
  },
  {
    "text": "Worst. Boss. Ever. Need Advice on how to leave respectfully. Looking for advice. For reference, I’m 26f.\n\nI work for a company I used to really love, I’m great at what I do and got promoted quickly. The shop is mostly retail, just to better explain the environment. We also have an extremely high turn over rate because of the owners who are often cruel and lack responsibility in their own store. \nBesides the owners, I am one of the main people in charge and have become very close with my co-managers. They are like best friends at this point.\n\nSo, getting to the point, I was in a bad car accident a few months ago and have had to work somewhat less. I also have lupus, and during this time I  began to flare like crazy. I still work mostly a full schedule, going from 40+ hours to maybe 35-37.  I still put my all in, but recently the owner of this business has made her point in that my health is failing and she’s not happy about that.\n\nShe’s gone as far to say i’m “worthless when I’m sick” and has strictly forbade me from ever speaking about my illness at work. She constantly jabs at me and has gone out of her way to guilt trip and manipulate me into working  more hours even though my doctors all agree I should really take some time off. They’ve suggested a 3 month medical leave to heal, and while that sounds ideal, I don’t have the financial support to live on 1/3 of my wages.\n\nBecause of the closeness to my coworkers, I have had a really hard time leaving. Things came to a head last week when my boss screamed at me for refusing to come in on an off day, even though I had dedicated extra hours that week already. She was fully verbally abusive and at that moment I knew I was done. She tells me her health at 60+ is better than mine because I clearly don’t take care of myself (all lies, I am in treatment under care of doctors, see a therapist weekly, the whole 9 yards). \n\nSince then I’ve applied to other jobs and have been accepted to start Sept. 1 with a company I can work at home from! I’m overjoyed but deeply worried about giving notice. I know I have to do this soon as I will need to train someone in my current position.\n\nI’ve never in my life had a boss be so outwardly cruel to me, and at the same time feel remorse putting more on the plates of the people I care about.\n\nReddit, how can I leave on amicable terms so my mental and psychical health no longer suffer from the stress this woman puts on me? \n\nPlease help!\n\nedit: spelling",
    "title": "Worst. Boss. Ever. Need Advice on how to leave respectfully.",
    "subreddit": "jobs",
    "timestamp": 1564867710,
    "score": 6,
    "keyword": "woman doctor"
  },
  {
    "text": "Feeling guilty the longer I stay? I took a new job as an office admin/ marketing coordinator with a small business 2 months ago. I was really excited about the role and  it as a good learning opportunity for someone still entry level. Now I’m frustrated with the disorganization of the company, my boss, and I worried about my job stability.\n\nI was hired to replace a woman who has been in the role for 11 years. She is currently 70 years old. She was already retired when she took this job. The reason she is retiring again is health issues. She has been out sick a lot and has a lot of doctors appointments. Because of this the company’s books are in a mess and we are behind in payment on several accounts. She is supposed to be stepping down to part time but so far hasn’t done it . She has taught me some stuff but there is a still a lot I don’t know. When I ask her about something I expect her to show me how to do it or give me written instructions, instead she just does it herself. The workers at the company still send her invoices and reports and etc which she eventually passes along to me. Even when a phone call comes in she will pass it along to me even if I don’t know the answer, so I end up having to take a message, and ask the her about it.\n\nMy boss, the company’s owner, a 60 year old man. He is overly involved and micromanages every aspect of the company. He is a poor manager and will assign multiple people to one job with no clear direction or instruction. Or he will schedule for things to be done but forget to tell the office and then gets angry when we don’t have things ready for him. He doesn’t hold people accountable. He we several people my boss openly talks down about saying they have not future at his company, he has no confidence in them, etc, but yet he doesn’t nothing about them. He does not discipline and he does not fire people even when he rightly should. As a result we do have a lot of people that just come to work perform subpar and just take whatever paycheck they can get. Then my boss has a weekly meeting where he complains about how no one is doing anything right and how labor is his biggest cost.\n\nI feel like he expects me to solve all their i issues overnight. Becuase of the old lady’s health issues and that fact she’s let some invoices slip through or not pay them, we often get calls from company’s trying to collect payment. My boss will demand an answer from me and ask what invoices are past due and it is all stuff from before I even started. \n\nMy boss is always stressed about finances and is trying to cut as many costs as possible. He closed out office last Thursday and Friday for thanksgiving but didn’t pay us for Friday to save money. He’s laid off our front secretary to save money. \n\nI took this job to first get closer to home and two for a learning experiences becuase I do like some of my work. Becuase of this I was willing to take a slight pay cut. My boss promised to review my performance after a month and consider a raise, from his words he made it sound like I would get my old salary back. When I did get a review he gave me $.50 cents. I was unhappy with this raise and made to feel guilty for expecting more becuase the woman I’m replacing was being paid less. Also I do not have any benefits at this job and get no paid time off until I’ve been here a year. \n\nI’ve started applying to jobs again because  I don’t feel secure here. I just feel guilty for leaving so soon becuase they’ve already introduced me all over as so and sos replacement. The woman I’m replacing also seems to be looking forward to part time work and if I leave it will throw a wrench in that but I know I have to do what’s best for me. I’d rather get out sooner than later.",
    "title": "Feeling guilty the longer I stay?",
    "subreddit": "jobs",
    "timestamp": 1575565382,
    "score": 2,
    "keyword": "woman doctor"
  },
  {
    "text": "Question about contacting a recruiter Hi, I've had a job as a supervisor in a large medical group, for over 4 yrs now. I drive about 1.5 hours BOTH ways, in heavy traffic every day. So, when I found a job 4 minutes from my house, at another medical group, basically organizing their new clinic, I applied. A recruiter that works for the medical group, called me and was very excited that I am \"just what they are looking for\". I interviewed with the head of the office, who loved me. Great interview. The next week, I interviewed with both doctors that run the clinic. The male doctor did most of the interviewing and seemed to really like me and my experience. The woman doctor basically just sat there, no input or feedback and was very hard to read. The next day, this was last Friday, I texted the recruiter. She had told me to keep her number and text her with updates on how it went. She sent me back a text saying she was in a meeting but would touch base with the clinic to see what was going on. Didn't hear back on Monday. So on on Tuesday, I texted her again asking if she could tell me how long it might be before I heard anything. I got no response on Tuesday, or today, which is now Wednesday. I don't want to be \"that person\" who is constantly bugging the recruiter, but sitting on pins and needles is really stressing me out. I want out of my job, mostly due to the drive. Any advise on what I should do?",
    "title": "Question about contacting a recruiter",
    "subreddit": "jobs",
    "timestamp": 1552526472,
    "score": 1,
    "keyword": "woman doctor"
  },
  {
    "text": "SO’s boss is abusive but has the dept head thinking she(boss) is the victim, how can I possibly help sort this besides helping SO look for a new job? For some context:\nSO is one of three people on his team: him, his boss, and the been-there-forever coworker. He’s been with the company for almost a year now, and he’s great at it despite the high volume of help requests and stressful nature of the job(damage control). He’s gotten stellar reviews from partners outside the company, inside the company, and from his boss as well(on paper even!).\n\nThat being said, his boss is an extremely insecure control freak, and has been making work toxic despite his excellent results.\n\nShe looks for any technicality that she can fault him for: Doctors note for one sick day missed (even though that’s not company policy), late punching in at lunch by two minutes, not making a slideshow for the weekly meeting (even though all three members talk about how they’re too busy with the workload as is and the meeting is distracting), accusing him of insubordination when he disagrees with her about plan efficiency, and so on.\n\nLast week she got less than a foot away from his face and blocked his exit from a room while ordering him to “check his attitude”. He had reminded her that he wasn’t going to be able to get everything they needed done if he took the time out to make the slideshow that she was asking for. (For just them btw, no other teams in the company are in these meetings. So three people.)\n\nSO decided to go to Dept Head to discuss her inappropriate behavior, and she had already complained to DH that “SO was taking advantage of her” (not physically/sexually, but as if she had a lax attitude and he was bending rules for himself). DH didn’t listen to and actually tried shaming SO, which is really disappointing because 1) he wasn’t being a mentor or leader when he really could have been and 2) that means this guy has paid no attention to the situation whatsoever and is just taking one persons word for it, no observation or fact checking. \n\nY’all, I’m biased towards my babe, obviously, but I’ve met this woman. I had to get up and walk away and calm down. I wish I was joking when I say that within the span of 10 seconds (I counted) she interrupted him SEVEN freaking times by not only shouting over him until he stopped talking, but she also repeated his sentence to him and pretended it was her idea. (He’s there with her for ten hours a day, how?!)\n\nI’ve been keeping detailed/dated notes of what exactly she’s said and done for documentation, how much/how long is enough? What should I do with it once we’ve recorded enough? More importantly, is it worth it?\n\nThis has been incredibly frustrating, so any help is much appreciated :)",
    "title": "SO’s boss is abusive but has the dept head thinking she(boss) is the victim, how can I possibly help sort this besides helping SO look for a new job?",
    "subreddit": "jobs",
    "timestamp": 1575361996,
    "score": 1,
    "keyword": "woman doctor"
  },
  {
    "text": "Was I wrong to quit my job on the spot? Heyo reddit. Trying to get some clarification on something that happened I'd say about a year ago now, because I am constantly tossing and turning and trying to decide if I'm in the wrong for the ultimate decision I made after the events leading up the straw that broke the camel's back. (Also I tried to post this on r/AmItheAsshole, just to clarify, but this story exceeds the character limit, so I'm taking it here since I figure you all have a lot of job experience on hand).\n\n&#x200B;\n\n&#x200B;\n\nSo for some background to the background, I am a Female, was 18 at the time (19 now), and had just gotten my first job. I was living with my folks and trying to earn some dough before moving for Uni. My parents sheltered me hardcore before this, so when all my pals were getting jobs at 15, my parents wanted me to be the best in highschool (grew up with a lot of pressure to \"be the best\" at everything) and focus on only that. But the second I turned 18 my mother said \"Why don't you have a job?????\" after not letting me get one for myself, and told me to apply at a bakery that was opening in our area shortly after I shot a very confused look her way. I applied for the job, which went poorly since I had no clue how to apply for a job, but managed to nab a spot on the line since they told me they really needed employees.\n\n&#x200B;\n\n&#x200B;\n\nSo my first week there, I'm given my uniform and told that the first week will be dedicated to training me on the line. See, this bakery had two sections to it; an actual bakery for sweets, bread, and everything doughy, and a lunch/dinner line beside it where customers could order things such as salads and soups hotplate items like quiche. While I initially applied for bakery, I was given line, but hey, a job's a job. So I get all suited up, roll up my sleeves, and learn how to put together a salad. Easy-peasy. I was intended to work that day for about 8 hours, after arriving there at about 11 A.M. or so, but at around 4-5 P.M., one of the SEVERAL MANAGERS (seriously, this place had like 5 on-site managers) approached me questioning who I was since they weren't informed about any new employees and were borderline hostile about it, and told me that I had to clock out and leave for the day since they had too many people scheduled for that day. I was concerned about not getting in the hours I needed, but listened to the boss and went on to take off my apron and clock out, going home at 5 P.M. The next day I went in to work for what was going to be another 8 hour shit, comprised mostly of my training, but after only 2 hours, I was sent home once again due to there being an over-staffing issue. This continued for the rest of my training week.\n\n&#x200B;\n\n&#x200B;\n\nI figured it was normal since I didn't know better, so I didn't contest against it when the following week they told me I was done with my training and only knew about half the line. I worked, made many errors that I wasn't ever really corrected on since the employees that were meant to be my trainers either quit or weren't working my shifts, so I was working alongside employees that didn't have time to train me since their jobs took a lot of time. I was often sent home, still, or told to leave early due to there being \"too many workers on the line\" (that being the manager's words exactly). I tried to talk about how I wasn't getting my requested hours with one of the managers, and expressed that the whole reason why I got the job was to make money and I wasn't working enough to make what I needed, and after they told me they would take care of it, nothing happened for another two weeks or so.  \n\n\n&#x200B;\n\nUntil out of the blue, they moved me to the bakery. Each station in the workplace is contractually stated to offer a minimum of one week's time for employee training, but in this case, I was given about 2 hours via a very fast and sloppy little tutorial given by the head woman put on bakery. I went from preparing salads, soups, and meals, to bagging bread and making fancy coffee drinks from time to time. I was actually fairly pleased with my bakery job, despite the fact that I still made many errors which I was scolded for rather than corrected on, and no one there was really able to help me when I came up to them with a question on how to make a certain drink. Everything was fine and dandy until I was given a rush order called in.\n\n&#x200B;\n\n&#x200B;\n\nSo I was given an order that included a large cup of potato soup to go. Line workers are usually the ones who grab the food for to go orders for the bakery folks to bag or pack up, but there was literally no one on line when my fellow bakery employee barked the order at me. \"Hey OP, order number 30 needs a large cup of potato soup NOW, we're late on the order!\" they shouted. I frantically tried to slip gloves on, since that was protocol for line workers when grabbing the food, but I was rushed to simply go get the soup ASAP, so I shook the half-applied glove off my hand and rushed over to the soup canister. Grabbing a cup in my left and the ladle in my right, I took the filled device and began to tip it into the cup while my fellow bakery asshole continued to urge me to \"hurry!\". As I was tipping the ladle, the cup slipped out of my grasp, and the entirety of the potato soup in the ladle spilled out onto my left hand at 205 degrees Fahrenheit. I let out a small scream, dropped the ladle, and quickly tried to pick up the mess I created while not-so-concerned customers watched me from the other end of the line. A line employee who saw the incident as they came out from the back kitchen told me to \"wipe it on my apron and go back to my station\", so I tried to do just that. Little did I know that the potato soup had begun to melt my skin and adhere to it, and after about 3 minutes I felt the blistering and swelling quickly overcome me. I cried and ran back to the manager's office, where he tried to treat it with an antiseptic spray, which was all they had in the first aid kit. When another manager came into the office, he scolded the manager treating me for doing so incorrectly, and after glancing at my hand, which was shaking, unable to move properly, and covered in now melting and blistering flesh, told me I needed to go to the hospital.   \n\n\n  \nThe manager telling me I needed to see a doctor insisted on me going to a hospital that was a 40 minute drive from the work establishment. He told me that if I went there, worker's comp would cover my injury because they had to do a drug test first. The bakery was a five minute drive from a hospital with an emergency room. I called my father (I do not drive or own a car, myself), and he rushed over to take me to the ER that had the shortest travel time, since my skin was actively burning as I sat there waiting and crying. I was taken to the ER, treated for severe second degree burns, and was given 3 days off from work to let my hand heal. I ended up getting into a predicament with the work's higher ups, however, because initially they refused to pay worker's comp since I \"refused\" to get a drug test at their preferred hospital before being treated. It wasn't until I expressed that my skin was actively burning and that the hospital they wanted me to go to was 40 minutes away that they realized what they were asking for was impossible. As disgusting and blunt of a description as this is, the soup was literally melting into my skin. Waiting any longer would've caused more damage. After I returned, My shifts were changed, and now I was set to open for the bakery at 6 A.M every morning. I was fine, I didn't care- I just wanted money. And besides, I always had someone to help open the bakery with me, so it was manageable. \n\n&#x200B;\n\n&#x200B;\n\nSo about a week after this incident, I arrive at the bakery to find that I'm the only person in for bakery that day. That my scummy fellow employee didn't bother to show up or tell me that they weren't going to. On top of all of that, the kitchen ends up being late with pushing out baked goods for me to put on display and bag, so by the time my display case is just getting started on being stocked, we're open and impatient and wealthy white moms start coming in and bitching at me because \"I'm not ready\". I'm having trouble with a particularly impatient woman because she is requesting both a baked good AND a line item that we don't have stocked yet because the kitchen is slow. I try to tell her we don't have any of what she's wanting just yet and that she needs to wait a bit if she wants it, otherwise she can order what she sees available. She tells me to get a manager, manager completely ignores my issue on how I'm still missing several crucial food items for my display case, and goes back to the kitchen to get the woman what she wants ASAP, also ignoring my request to tell them to hurry up with the other goods I'm still waiting on. After the woman leaves, I take a quick break to the restroom, where I immediately lock myself into a stall and cry my eyes out. I've had to deal with shitty customers, shitty co-workers, shitty managers, and shitty management in general that almost refused to pay for my 1k+ visit and treatment for my burn that resulted in an issue on THEIR behalf. I was done with it all, it wasn't worth the little money I was getting.  \n\n\n  \nSo I ripped off my apron and quit right then and there. I called my folks for a ride and walked out in tears.   \n\n\n&#x200B;\n\nA woman from the back of the kitchen had to come out and take my spot while I waited for my father. She told me that what I did was \"a huge inconvenience and a setback to the entire kitchen\" and my manager told me that what I did was \"highly unprofessional and irrational\". I spent the following weeks crying and vowing to never work food ever again. My parents were initially understanding about the incident, but as time went on they started to tell me that I \"should've stuck it out\" and such. I still feel awful for all of this, over a year later. Despite the job being literally the worst, I knew that it maybe would've been more appropriate to simply put in my two weeks, but with me being put in a situation where I couldn't really properly perform my job. So am I wrong in any of this?",
    "title": "Was I wrong to quit my job on the spot?",
    "subreddit": "jobs",
    "timestamp": 1556437389,
    "score": 0,
    "keyword": "woman doctor"
  },
  {
    "text": "Doctors and women of Reddit, what happens when a woman takes Viagra?",
    "title": "Doctors and women of Reddit, what happens when a woman takes Viagra?",
    "subreddit": "AskReddit",
    "timestamp": 1569604233,
    "score": 5,
    "keyword": "woman doctor"
  },
  {
    "text": "The worst, most backward day of my life I’m 20 years old and a sophomore in college. I didn’t get my period yet this month so over the weekend I decided to take a pregnancy test and it turns out I’m pregnant. I knew I was going to terminate the pregnancy immediately since I’m in no position to care for a child at this point in my life. I called my boyfriend, my parents, and my best friend, and they were all supportive of my decision. After crying and getting over the shittiness of the situation, I made an appointment for a non surgical (medical) abortion. The appointment was for today, so this morning I called an Uber (I don’t have a car on campus) and headed to the clinic which was an hour away. \n\nMy Uber driver seemed immediately uncomfortable and asked if we were going to a planned parenthood. I said no (which was the truth), we were just going to a doctors appointment. Still, he seemed uncomfortable. “Is it an abortion clinic?” The color drained from my face; how could he know? I just put the address of the doctor in, and there was nothing in the name that would imply it was an abortion clinic.  He stared at me, waiting for an answer, but I was too shocked to reply. I couldn’t believe this was happening, and now I was trapped in the car with this guy for the next hour. “You know,” he said, “you’re going to regret this decision for the rest of your life.” He started telling me about the procedure, what it was like, telling me how horrible it was. “There’s so much they don’t tell you. You’re making a mistake”. He brought up his wife, who was 5 months pregnant, but trailed off. I just sat there in silence. We were driving through rural land, miles from any kind of house or storefront. I prayed he wouldn’t hurt me.\n\nWe got about halfway there when he suddenly pulled over on the side of the road. “I’m sorry, I can’t take you any farther than this. You won’t find another Uber out here. I can take you back if you want.” I politely declined and got out of the car. I immediately started calling local taxi companies and asked if they could pick me up. My phone gave me a rough location which I gave them as my pickup address. My Uber driver waited around for about 15 minutes, assuming I’d change my mind. I insisted I was fine and that he should go back and he eventually left. After waiting about 25 minutes, the cab showed up and I got to my appointment (an hour late).\n\nEven thinking about this experience brings tears to my eyes. I can’t believe someone would be this cruel. An abortion is already traumatic enough, and not at all a decision I take lightly. That an older man would corner me and confront me about decisions that are none of his business are astounding. I contacted Uber and I can only pray they take appropriate action. \n\nUPDATE: Thank you everyone for your kind words! The thousands of internet hugs have made a huge difference. I reported him to Uber, and Uber got back to me and refunded the ride and said they were “reviewing his account”. I hope to God he’s fired. \n\nFor all the people who say I deserved this kind of treatment, I have nothing to say to you. I come from a politically conservative family, so I understand being pro life and disagreeing with my decision to terminate my pregnancy. However, the driver was aware of my decision to get an abortion within 10-15 minutes of picking me up from all his probing questions. If he wasn’t comfortable driving me to the clinic, why continue to drive me there until we were stranded? Was it an impulsive decision to leave me by the side of the road, or was it premeditated after he understood our destination? He easily could have left me in my small city and I would have been able to get a different Uber driver and avoided the whole fiasco that ensued. Or, as others have pointed out, he could have simply declined the ride if the destination (and my decision to exercise my rights) were that offensive to him. \n\nI have no issue with him (or anyone else) having a different opinion or with him disagreeing with my choices. But your beliefs do not give you the right to make me feel uncomfortable when I’m completely vulnerable and am relying on you to perform a service I desperately need. \n\nI’m debating posting something in r/legaladvice because I fear the possibility that this could happen again with another young woman (or man) who happened to be doing something or was about to engage in a behavior he personally deemed objectionable. Who else has he stranded, and who else will be stranded yet? \n\nIf there are further developments I will update all of you! Again, thank you so much for your kind words and encouragement. I had no idea my post would blow up like this and it makes me feel good knowing people of the internet have my back. You guys are awesome and this subreddit is amazing. ❤️❤️❤️❤️ \n\nAlso: thank you kind Redditors for the gold, silver and platinum!! I will make sure this never happens to someone else again.\n\nUpdate 2: As I commented below, the reason my parents or boyfriend couldn’t drive me is because they both live in North Carolina while I go to school in New York. My boyfriend couldn’t afford to buy a last minute flight to see me, and because I live in a dorm room with a roommate, there would have been no place for him to stay. My parents did manage to get a last minute flight, but they didn’t get one in time to take me to my appointment.",
    "title": "The worst, most backward day of my life",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1553168630,
    "score": 28161,
    "keyword": "woman doctor"
  },
  {
    "text": "When a doctor refuses to perform a tubal ligation on a young, single woman because her and a \"future husband\" might want kids... what that doctor is really telling her is that a man she has never even met yet is controlling her body. It happens all the time. Young, single women are told by their doctors that they cannot receive a tubal ligation because, in the future, she and her \"future husband\" might decide they want kids. \n\nWhich sends the message that her body belongs to a man she has never even met yet, and that this mystery man and the doctor know what's best for her, as opposed to allowing her to make her own damn choices. \n\nThis shit irritates me to no end.",
    "title": "When a doctor refuses to perform a tubal ligation on a young, single woman because her and a \"future husband\" might want kids... what that doctor is really telling her is that a man she has never even met yet is controlling her body.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1577546450,
    "score": 25500,
    "keyword": "woman doctor"
  },
  {
    "text": "A doctor performed an abortion on the wrong woman. At the clinic, a mix-up in medical charts and failure to check her identity led to the mistaken abortion. Loud and clear: You can be appalled by this egregious error while at the same time believing that every woman has the right to choose.",
    "title": "A doctor performed an abortion on the wrong woman. At the clinic, a mix-up in medical charts and failure to check her identity led to the mistaken abortion. Loud and clear: You can be appalled by this egregious error while at the same time believing that every woman has the right to choose.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1569336399,
    "score": 24913,
    "keyword": "woman doctor"
  },
  {
    "text": "The story about labiaplasty you haven’t heard She was just 17 when he agreed to perform a labiaplasty on her. Like many naive young women, she thought her labia minora were not supposed to stick out.\n\nShe had read online, on surgeons’ websites and in peer-reviewed medical literature, that protruding labia minora were considered “unfeminine” and “embarrassing.” She read they were caused by excess male hormones (untrue) and excess masturbation (preposterous).\n\nHe had been recommended by the head of the OB/GYN department as the best OB/GYN surgeon at Baylor Hospital in Dallas. She was confident she was in good hands. They waited until after she turned 18 to do the procedure.\n\nHe completely removed her labia minora, performed a clitoral hood reduction without her consent, and cut the dorsal nerves of her clitoris. The glans of her clitoris would never be sexually sensitive again. Cunnilingus would never again be pleasurable.\n\nHe had only done a labiaplasty twice before. Like most OB/GYNs who do these procedures, he had not been trained to do them. He never disclosed that anything had gone wrong, but he stopped doing these surgeries after that.\n\nShe knew she had lost sensation but didn’t understand what that meant. She assumed everything would work out when she started having sex. She thought it was her fault. She didn’t know enough about her anatomy to understand he had done a separate surgery without her consent. She started seeing a new doctor because she was so uncomfortable. The new doctor was his partner. Upon seeing an 18 year old with completely amputated labia minora, she said nothing.\n\nLater, the young woman worked up the courage to ask her doctor if her surgery had caused her difficulty with orgasm. She could not feel anything without a vibrator, she said. Despite the visible scars reaching well into her clitoral hood, her female doctor told her her surgery could not have affected her sexual function.\n\nThe original male doctor meanwhile became president of the Texas Medical Association.\n\nThe young woman finally found her clitoris. The glans was not sensitive like it was supposed to be. She went to a new female doctor. The new doctor also told her her surgery could not have affected her sexual function. She suggested she fall in love. Though the new doctor was “horrified” that all her labia minora had been amputated, she did not tell her she could report it.\n\nThe young woman started doing research. Eventually she figured out a clitoral hood reduction had been performed without her consent. Given the course of the dorsal nerves along the clitoral body, she figured out they must have been injured.\n\nThe young woman did a lot of research. She realized the course of the dorsal nerves was never mentioned in literature on clitoral hood reductions. It was never shown in OB/GYN journals. It was never shown in OB/GYN textbooks. She also learned that the sexual function of the labia minora was rarely described. She thought her doctor must not have realized they were important. How else could he have completely amputated them? She thought he must not have realized the dorsal nerves were at risk. She decided this error must have occurred because her doctor didn’t know the anatomy.\n\nShe wrote him a letter telling him what he had done and asking him to help her change training standards to protect other patients.\n\nHe responded reminding her that the surgery was her choice. He reminded her that she had requested her labia minora not stick out. He had only tried to give her what she asked for.\n\nHe told her he stayed far away from her clitoral hood and frenulum. But there were scars to prove otherwise.\n\nThe young woman became emotionally unstable after reading this letter. She wanted to report him but was told the board would likely blame her and take his side. She had never had what happened to her confirmed by a doctor, so she went to see one. It was confirmed. This was what she had needed to give legitimacy to her complaint, she thought.\n\nBut it became unbearable. No one around her seemed to understand the magnitude of what had happened. People asked her what the big deal was. People asked her why she needed justice. When she tried to talk to therapists, they asked about her feelings about her mother. It had taken 7 years to finally get it confirmed. She had hoped it was fixable somehow. It wasn’t fixable.\n\nShe felt ashamed. How could she have been so stupid to not file a lawsuit when there was still time? She read research on resilience. Based on all the parameters surrounding her trauma, she did not think she could ever be okay. It was like getting horribly raped in a world where rape isn’t considered a crime. She read she needed acknowledgment, support, etc. Most of all, she needed to change the problem of pervasive systemic negligence. But no one was even seeing it. She didn’t like the wreck of a person she was becoming.\n\nOne night she set Joy Division “Atmosphere” on repeat, took 60 Vicodin, some Xanax, some Benadryl hoping that would help stop her heart, and as much whiskey as she could drink. Her dad checked on her in the middle of the night. He took her to the hospital.\n\nShe was afraid to report after that. She was afraid of getting told it was her fault. She was afraid of people defending her doctor. One OB/GYN she had gone to had said:\n\n“You should have known all surgery carried risk. You can never completely control a result.”\n\nIt had been wrong site surgery. That should never happen. But she was afraid of this. She was afraid even doctors wouldn’t understand the difference between the labia minora and the clitoral hood.\n\nShe told herself she would report him when she got more stable. Back then there was no statute of limitations. She thought she had time.\n\nWhen she finally got the courage to report, they had passed a new statute of limitations. She missed it by a week.\n\nSo she started coming up with new ideas for how to stand up for herself. She wrote a letter to the head of patient safety at the hospital. He agreed to meet with her. But she was too afraid. She thought if she wrote down everything she needed to say, complete with references, this would help. She started writing.\n\nBut she hated writing. She’d never been any good at it.\n\nShe wrote what she called, “A Clinical History, Causal Analysis, and Proposed Solutions.” She wrote a background of the anatomy and prevalence of labiaplasty. She wrote a clinical history of herself. Then she broke down all the causal factors accordingly:\n1. Motivation\n2. Cause of surgical error\n3. Failure to disclose or report\n\nThen she wrote a proposal. Solving problems at every error point was important. She got a bit overwhelmed. There were so many problems.\n\nShe got very stuck. She kept getting dizzy. She’d get angry at herself for getting dizzy. She was being weak, she thought.\n\nPeople asked when she was ever going to do anything worthwhile. They told her she was lazy. She didn’t deserve to live in such a nice apartment, they said. She didn’t deserve to wear such nice clothes, they said. She didn’t deserve vacations. She should be ashamed of herself for not having a career like everyone else. They told her she wasn’t dealing with this well. When was she ever going to learn to deal with anything? She mostly kept to herself. When she tried to date, issues would come up. Men told her they couldn’t date her because she was emotionally unstable. One said he’d rather date a barista with a plan.\n\nThe worst part isn’t what happened. The worst part is how much I came to hate myself for not handling it better. I’m working on that. \n\nMy doctor isn’t some random “bad apple.” He is an extremely reputable OB/GYN. He has been president of the Texas Medical Association and president of the Dallas County Medical Society. \nOther doctors still talk about his “integrity” and “selflessness,” as they give him awards. He was also featured in Time Magazine for delivering the first uterus transplant baby. \n\nBut honestly, the worst part isn’t what happened to me. The worst part has been everything that has happened since in my struggle to get acknowledgment and to address the systemic negligence that continues to put others at risk.\n\nIf I could get my doctor to acknowledge what he did, he has the political power to help change training standards to keep other patients safe. Instead, he refuses to acknowledge it. Though his colleague has explained to him that I have visible scars proving what he did, he insists he didn’t do it. He says I must have had a second surgery or that I operated on myself.\n\nPerhaps the worst part is how medical leadership has stood by him and refused to even talk to me about changing curriculums and board exams because of who my doctor was. This happened due to systemic negligence that will not change as long as people refuse to admit there is any problem. Doctors continue to do vulvar cosmetic surgeries (and treatment of hypertrophy) without training.\n\nEven with my dad as the head of the plastic surgery department at the same hospital where my doctor works, we cannot get through to him. The OB/GYN department refuses to speak to either me or my dad. After I asked them to teach clitoral neurovascular anatomy, they called legal to make sure they can’t get sued for not teaching it.\n\nUpdate: We are publishing a cadaver dissection study of the neural anatomy of 10 clitorises, of which we took excellent photos. There is a new head of the OB/GYN department who wants the residents to learn it. I also got a form letter from ABOG, in which they claim to be working on new board exam questions.\n\nSecond update: I have gotten authors of two major OB/GYN textbooks (Te Linde, Williams) to publish detailed clitoral anatomy. I also convinced an OB/GYN to oversee a study published in AJOG. And finally, my study was published in The Aesthetic Surgery Journal. \n\nHowever, I have not been successful at changing privileging. To this day, someone as equally as unqualified my doctor can still get privileges to do labiaplasties at the surgery center where mine occurred and at many others. USPI, the biggest ambulatory care provider in the US, declined to require training in these procedures. Another problem is many of these are performed in private offices, where there is generally no oversight. \n\nLabiaplasty is still the fastest growing cosmetic procedure, as it has been for almost 2 decades.\n\nIf you or a friend has a similar story, please contact me. One expert I talk to believes there are thousands like me. Based on the other stories I have gotten, it is typical for women to get gaslighted in these situations and told their issues are psychological. This happens due to pervasive ignorance of vulvar anatomy and female sexual function in medicine. \n\nI need more women who are willing to be interviewed by a journalist. 🙏🏻\n\nEdit: thanks everyone so much for all the upvotes and supportive comments! I don’t know if I’m allowed to share this, but my Instagram is @jessica_ann_pin. I talk about this and related issues there. This is my latest post showing how cross sections of the penis are always shown in anatomy textbooks but cross sections of the clitoris are shown in 0 anatomy textbooks: \n\nhttps://www.instagram.com/p/B6bnuKSp4Rt/?igshid=kp2hm8adb2oy\n\nThird update: I have gotten 18 medical textbooks to agree to updates. 4 have now been published. I’ve also gotten Medscape, UpToDate, and WebMD to agree to updates.\n\nABOG now requires urogynecologists to learn clitoral innervation as part of their maintenance of certification. They have made it incentivized learning for gynecologists. They still refuse to make it required learning for gynecologists. \n\nACOG still refuses to dictate the innervation of the clitoris be taught in all OB/GYN residency programs. Here is my petition to change this. It has 27,000 signatures so far. \n\nhttp://chng.it/jts9PZLz",
    "title": "The story about labiaplasty you haven’t heard",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1577175917,
    "score": 23618,
    "keyword": "woman doctor"
  },
  {
    "text": "A Friendly Reminder: You don't break your hymen when you lose your virginity In light of the recent gross nonsense around rapper TI insisting that a doctor check his daughter's hymen annually, I thought it was a good time to remind people of these two important videos regarding what hymens actually are and how they work:\n\n**The virginity fraud TED Talk by Nina Dølvik Brochmann and Ellen Støkken Dahl**\nhttps://www.youtube.com/watch?v=1oNlTrLIjU4\n\n**A history of hymens with Dr. Jen Gunter**\nhttps://www.youtube.com/watch?v=wa3MnKV1CKI\n\n\n\nIf you can't watch these right now here's your TLDW:\n\n* Hymens are only there to keep irritants out of the infant vagina. After age three they naturally start to open up and/or break apart because their job is done.\n\n* Adult and teen hymens aren't solid barriers; you can't \"break\" them.\n\n* Hymens can easily stretch around objects (such as penises) without sustaining any damage.\n\n* Many women still have an \"intact\" hymen after they have had sex, even if it's been multiple times. In a study of pregnant teens, only 2 out of 36 girls showed clear signs of penetration. \n\n* Hymens can be damaged as a result of other non-sex activities, including exercise.\n\n* Hymens don't bleed much when damaged, as they have few blood vessels in them.\n\n* The majority of women do not experience pain or bleeding the first time they have sex, and if they do it may not be related to the hymen at all. Bleeding is a common result of sex that is too rough or not lubricated enough, which is extremely common in couples who are inexperienced. Variations in an individual woman's anatomy can also lead to bleeding even with otherwise well-lubricated and gentle sex.\n\nThat's my public service announcement. I hope you and your hymen have a happy day.\n\nEDIT: Some users pointed out that my final point (originally from Dr. Gunter's talk) can come off as judgemental, so I re-phrased it.",
    "title": "A Friendly Reminder: You don't break your hymen when you lose your virginity",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1573175015,
    "score": 20410,
    "keyword": "woman doctor"
  },
  {
    "text": "My 75 year old eye doctor told me I have an expiration date as a woman I went to the eye doctor this weekend at a new office. The optometrist was in his mid 70s and was super nice through the first half of the exam. He asked me some vague personal questions one of which was if I was married and I informed him that I had a partner of 3 years but no, we weren't married. It didn't seem weird, it was just small talk I thought. Then after I went through the 1 no 2 no 1 portion he pushed the optical thing away from my face and leaned in close to me and placed his hand on my knee. I was already getting uncomfortable but then he started lecturing me, saying that I better make my boyfriend marry me or else he would lose interest and leave me and that I was getting old to not be married yet. I cut him off saying, \"I don't want to discuss this\" but I was trapped with him sitting in front of me blocking me form standing up plus he had my glasses so I couldn't see. He was arguing with me saying he was telling me this for my own good and that he was being \"fatherly\" but I didn't back down just kept repeating \"I don't want to discuss this.\" I had to say it 4 times before he stopped, and he had the nerve to respond with, \"well I don't want to discuss it anymore either.\" And I grabbed my glasses and my prescription and left in tears. I hate that a misogynistic old man could make me feel so powerless and judged.",
    "title": "My 75 year old eye doctor told me I have an expiration date as a woman",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549895400,
    "score": 18756,
    "keyword": "woman doctor"
  },
  {
    "text": "I'm pretty sure I got stealthed and I feel disgusted I had met this guy from Tinder and we hooked up already once (with a condom) before this happened and he seemed trustworthy enough after that. After the first time we had sex he kept pestering me about how much \"better\" it feels to have sex without a condom, trying to convince me that the pull out method is reliable and that he's \"good at it.\" I told him no, that I refuse to have sex without a condom because of the risk of STI's and pregnancy especially because I am not on birth control can't be for various medical reasons. He kept trying to convince me otherwise and it was almost like he was trying to make me feel stupid and inexperienced for \"thinking\" that the pull out method isn't reliable (even though it is an objective fact that it's very unsafe). Eventually, he agreed to keep using condoms and we moved on.\n\n&#x200B;\n\nHonestly, after that conversation, I should have never spoken to this guy again. \n\n&#x200B;\n\nThe next time he came over we started making out doing all the usual foreplay stuff and I was feeling decently comfortable with the whole situation. When it came time to have sex, he put a condom on and it was all fine and good. I started feeling a bit off when I was on top of him in reverse cowgirl (or whatever it's called) and he started trying to finger my butt without asking. I told him to stop and he stopped, which was fine I guess, but I honestly wasn't that amused. We kept going after that, but when he was about to come I was in a position where I couldn't really see what was going on down there and then before I knew it he was coming on my chest with no condom on and was acting like he didn't know where it went. It sounded like he was reading a script. \"Oh my god, where the condom go. I don't know what happened... blah blah blah\" as he haphazardly looked around for the condom. I did NOT consent to have sex without a condom. In fact, I EXPLICITLY stated on multiple occasions that I REFUSE to have sex without a condom, and he STILL did that.\n\n&#x200B;\n\nI was so stunned in that moment and my immediate thought was \"oh my god, he does this to girls all the time doesn't he.\" I didn't believe for a SECOND that it was an accident. Condoms don't just slip off like that, and it was ESPECIALLY suspicious that he came on my chest. He had to have known that the condom wasn't on in order to do that, and who even knows how long he was going without it on. I felt so gross as I was cleaning myself up, just dreading the inevitable doctor's appointments and thinking about taking Plan B. I barely said anything to him, and I was scared to say anything because I didn't feel like having him to try to gaslight me into questioning the reality of the situation, or tell me that \"it's not a big deal\" because CLEARLY he has never stopped for even a split second to think about it from the woman's perspective. He hung out for another hour afterward much to my displeasure and I was angry, scared, and on the verge of tears the whole time. \n\n&#x200B;\n\nI just can't believe that there are people out there that have such little regard for others and I feel so disgusted. Nobody deserves to have their bodily autonomy and consent violated like that.\n\nI just wanted to vent because it has felt pretty shitty having people ask me how my weekend was and saying that it was \"fine\" even though I was dealing with this bullshit because I just don't feel like explaining what happened and I don't want to be judged for my poor decision making even though I never do stuff like this. Ugh.\n\n&#x200B;\n\nGuys and gals out there, just remember: not everybody is trustworthy, stealthing is very much a real thing that real people do, and that NOTHING IS SEXIER THAN CONSENT AND RESPECTING PEOPLES BOUNDARIES.",
    "title": "I'm pretty sure I got stealthed and I feel disgusted",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549427110,
    "score": 17753,
    "keyword": "woman doctor"
  },
  {
    "text": "“Just do you know the surgeon can refuse” So I went to see my doctor because I’ve been having some problems with my coil. My husband and I have decided to have it removed and for me to seek permanent sterilisation. \n\nWhen I asked about a tubal ligation the dr asked if I have kids: I don’t but I also know that with my complex physical and mental health problems I’d not make a good candidate for primary caregiver. I also know that I don’t really want kids for a whole slew of reasons. \n\nShe goes: “well it seems like you’ve thought it through and you know what you want. I’ll put through a referral to a surgeon, but just so you know, they can refuse to do the operation because you don’t already have kids”. \n\nI’m so over the idea that every woman wants children.",
    "title": "“Just do you know the surgeon can refuse”",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549287939,
    "score": 17616,
    "keyword": "woman doctor"
  },
  {
    "text": "I'm tired of being shamed for my choice to not have children. I decided at a very young age (probably 13 or so) that I never wanted to have kids. I'm 25 now and that still hasn't changed. I've heard it all from people - you'll change your mind when you get older, your husband will want kids, you're not doing your \"womanly duty\" if you don't have kids, you're selfish. \n\nHowever this past weekend was my worst experience with this. I ended up in the ER, and the doctor came in and asked if I had children (it was related to why I was there). When I said no, he went off about how when he was my age he thought the same thing but as he got older, he got wiser and realized that his life would never truly be fulfilled until he had children. He told me that if I wanted to enrich my life I should go ahead and just start having children now and make my life better earlier instead of waiting until I'm older. Y'all, I was livid. I was in the ER, in excruciating pain, and all I wanted was to feel better. What I got was this jackass shaming me for my life choices instead of spending his time helping me with what I was there for. \n\nI'm usually a lurker here, but I just needed a place to share this and vent. Thank you all for having such welcoming community.\n\n\n\nEdit-I just wanted to edit this to say I didn't expect this to get so many comments. I am reading through all of them and will try to reply. Thank you all for your support.",
    "title": "I'm tired of being shamed for my choice to not have children.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1566919662,
    "score": 17309,
    "keyword": "woman doctor"
  },
  {
    "text": "I am NOT the help My boyfriend lives in a swanky neighborhood complete with guarded access. Every time a new guard is on duty and I roll up in my non-luxury car, I’m asked if I’m from a cleaning service. \nAs a black woman I cannot tell you how infuriating it is to be mistaken for the help. When I’m with his grandmother at her doctor’s appointments or with her as she’s visiting with friends then I’m a nurse or a hired companion. When I’m with his sisters then I’m a nanny. I could perhaps live with these racist slips but it also happens at work. I’m studying for the bar and I cannot tell you how many people assume I’m a defendant if I’m in court or a mere paralegal if I’m in an office. \nI wonder if I’ll ever been seen as the kick ass black woman that I am and not some nanny, maid, or defendant.",
    "title": "I am NOT the help",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1555772726,
    "score": 15679,
    "keyword": "woman doctor"
  },
  {
    "text": "Got breast implants, was nervous about people asking \"are those real?\" afterwards but my best (guy) friend gave me the best comeback ever to use \"Well, they're certainly not imaginary!\"\n\nLOL this has boosted my confidence for nearly 9 years now since the surgery. Every time I am feeling self-conscious, this thought makes me grin. Hope it helps at least one other person. Have a great day everyone!\n\n**edit - Holy cow, thanks everyone! I posted this and figured it would die quickly, but in the time it took me to take a bath, work out, and do some house work it really blew up! Glad so many people got a kick out if it too! LOL!**\n\n*edit 2 - ok I get it, I posted a thing that indicates I'm female AND have big boobs. I should have realized I'd get so many messages asking for pics. They've ranged largely from creepy-gross to creepy-scary (but not REALLY scary), with one that was just genuinely kind of sweet. And I get that in reality it's very normal to want before and after pics in a thread about such a major body modification. But here's the thing. I'm old compared to what i perceive most reddit posters to be. I'm 46. You really want to see this? (just kidding, I don't feel old and I don't feel like I look old. I just think I'm funny sometimes, sorry.) I'll post a pic but... just saying....later though, imgur is giving me issues.*\n\n**alright, i'm not taking fresh pics so here's a before one and an after one, both showing the same tattoo, and a new one taken just now for you guys of the same tattoo to show that it's me. Just edited in another after pic on Saturday, March 2nd, since people couldn't really see the effect of the surgery on the first one - \n\nBefore - https://i.imgur.com/RtaIRy9.jpg\n\nAfter - https://i.imgur.com/pcUYZl7.jpg\n\nAfter two - (since people said they couldn't really see much - warning, this is a push up bathing suit top, they aren't really that round all the time) - https://i.imgur.com/JPHCPqq.png\n\nToday/ Proof it's me - https://i.imgur.com/DpvdAer.jpg**\n\n--------\n\nFINAL EDIT (I hope) - \n\nlots of people ask why I got implants. It wasn't for any potential SOs or anything, it wasn't for my husband, it was for me. Here is the reply I just quickly typed out in my messages to someone who asked - this way everyone who wonders doesn't need an individual reply, because i do want to answer questions but also need some time to get stuff done today lol :) \n\n\"I wrote a couple of lengthy replies in the comments to other people, and didn't expect the thread to blow up like this so haven't gotten much done today so don't want to re-write it all, but basically i had kids then breastfed for 7 years and after it was all done and i'd had my tubes tied, i realized my new post-childbearing-years body was still great except i still wanted the boobs I never got at 13, and now the ones I did have were saggy and had stretch marks and looked deflated. I thought \"OOOH I COULD GET SHINY NEW UPGRADES!!!\" and got super excited about the idea of making my very own \"me\" just like I want it. I already work out to have the body I want, and felt like I deserved to spoil myself and have the body I always wanted to have now that I was done giving it over entirely to my children. It was a very positive transition into the next stage of life that comes after infants and kindergarteners and any chance of pregnancy ever again. It's like a woman is a little girl who isn't allowed to do fun things, then she's a young woman who can do tons of fun stuff but has responsibilities too, then she's a mother and gives up her entire being to other people for a decade or so, and then she suddenly has hours a day of the house empty to herself and things are organized now and straightened and she's ready to take back on her own likes/dislikes, interests, hobbies, she gets a chance to really look in the mirror, maybe shop for herself instead of her kids, it feels almost like high school all over again in that you get a moment to care about hair and makeup and stuff again, and then you assess yourself and think \"ok. this is it. this is the adult me. and I'm not a powerless kid anymore. I can do what I want with this.\" so I do, with hair and makeup and whatever I want to do, or none of it when I don't want to. and it's GREAT. but I always WANTed boobs. wanted to play dress up in different styles than currently were flattering on me at that time. stuff like that. i wanted to be Barbie. not really but just, I knew what would make me feel good and so I did it. Super simple, really. :) just.. they weren't the boobs I started with anyway so why not make them ones I at least enjoyed? selfish I know, but I mean.. it's my body and I wanted boobs so I bought boobs. LOL\"\n\n-----\n\nedit - it turns out that most of the comments were moderated out, so if you asked me about my doctor and didn't see a reply from me, drop me a message and I'll pass along the info that way.",
    "title": "Got breast implants, was nervous about people asking \"are those real?\" afterwards but my best (guy) friend gave me the best comeback ever to use",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1551445464,
    "score": 15529,
    "keyword": "woman doctor"
  },
  {
    "text": "My med school has free tampon and pad dispensers in all bathrooms. It makes a way bigger impact on my education that I anticipated. No one should ever have to miss class because of a period. So far 3 times I've had a surprise period or ran out of pads while in important classes I couldn't miss but didn't have to go home because my school has them for free!!! I feel like a human rather than a woman with this painful distracting burden. I hope one day everyone can feel that way.\n\nEdit: since a lot of people have been asking. Hormones are very complex and vary from person to person. It’s true that some people have menstrual cycles that are like clockwork. Many others don’t. I am not one of those people. I (probably according to my doctor) have [endometriosis. ](https://youtu.be/3rwO0OhRnn8) But even if you have a healthy cycle it can be difficult to always predict when and how many menstrual products to bring with you. \n\nEdit2: I’ll try and find out how my school started it to tell you all. And no, I am not in a blue state. But most medical schools are liberal.\n\nEdit3: it was a student group that started it. If you want this at your school I highly recommend you ask your student government (or join it). From the comments it seems like most schools/workplaces just need someone to bring the issue up and then they offer little resistance. Can’t hurt to ask!",
    "title": "My med school has free tampon and pad dispensers in all bathrooms. It makes a way bigger impact on my education that I anticipated. No one should ever have to miss class because of a period.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1567979786,
    "score": 14041,
    "keyword": "woman doctor"
  },
  {
    "text": "Today I Found Out I Don't Have Breast Cancer, While Another Woman Found Out She Did I was called into the doctor's office as a follow-up to the conclusion that I have cancer in both breasts to talk about what the plan of action was going to be for me.\n\nMy doctor gets pulled aside by one nurse, and she frantically whispers to him while holding a folder in her hands. He sighs in a way that seemed to be out of sadness instead of annoyance, as he took the folder out of her hands and handed her the one on the counter top that had my X-rays in it.\n\nThe nurse dashes off as my doctor sits back down and looks at me dead in my eyes as he says,\n\n\"There's been a mistake.\"\n\nI was shown my real X-rays and they were clear from any tumors or anything. Clear in Betty (the bigger one) and Tina (the smaller one).\n\nThe X-rays of myself and another woman were switched, somehow.\n\nIt was such a bittersweet thing to feel. Relieved that I wasn't diagnosed with cancer at 18, but still regretful at feeling that way because someone else received the worst news of their life. Who am I to be relieved? \n\nEven worse since I knew exactly who it was, a woman I had sat next to while waiting. Same last name, with the same first initial, which is what I learned the office organized by (why not the full first name I don't know). She is a wonderful mother of 3 and still has a successful career despite the odds of the expectations of her time  that wives are to be housewives. We talked to deal with our nervousness about the situation, and we walked out friends after 3 hours of combined waiting over 4 visits.\n\nI didn't see her before I went home today, but I hope she kicks cancer in the ass like she did all other things that stood in her way in life.\n\nI'm not religious, but God bless you Adelaide.\n\nEdit: Some people have been actually sending me a lot of messages *and* leaving some comments on the integrity of my post. It is a somewhat unbelievable, one-in-a-billion experience, so that is all fair. So I'm just going to answer all the question marks here and now. If anyone has any further questions, you are welcome to ask respectfully. \n\nA lot of people questioned how Adelaide and I have each other's numbers is as simply put is that when you are sitting waiting for a long while with not much to do, any conversation is welcome. We weren't talking about little small talk things like the weather, we had genuinely deep and meaningful conversations where we really learned a lot about each other even if the time was so short. She offered me her number and I gave her mine. I feel that people are sometimes overly cautious about other people. Like what is an she going to do with my number, in a malicious sense? I don't have any reason to do anything bad with hers either.\n\nAnd then let's get to how I don't know what the doctors were doing to me as far as mammo/ultrasound on the breast and biopsies. I didn't do research on the process of how to achieve a diagnosis, I did research on the possibility of the lump I had found being cancer for a woman my age. I was focused more on the what than on the how do we resolve the what if that makes any sense. I am the kind of patient that won't question what you're doing as long as it seems pretty legit to me, I just want you to get the information that you need so you can help me get better. I asked my mom, she described two different things as a mammo, and the person who did my \"mammo\" called it a mammo so I was under the impression that it was a mammo. \n\nThen onto how Adelaide and I happened to have the same appointments, for me the one day a week I have off is the day that she goes into work later than usual so she can squeeze in the appointment then. It wasn't perfectly the same time every time, there was one occasion where I was going to leave and she was coming in, and we stopped and had a quick chat before going on about our days.\n\nI'd really appreciate it if you all could hope for Adelaide's return to good health, this is what's the important matter here.\n\nBelieve me or don't, that's your decision and all decisions are fair.\n\nHave a good one, and please keep tabs on yourself and your health. If it wasn't for me randomly brushing a lump I would have never thought of anything like this could be.",
    "title": "Today I Found Out I Don't Have Breast Cancer, While Another Woman Found Out She Did",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1564655741,
    "score": 7792,
    "keyword": "woman doctor"
  },
  {
    "text": "Finally found the right doctor My daughter (17) has had ongoing health issues for the last 6 years. They started shortly after she started menstruating, but I didn't make that connection until recently. Her period has never been regular, but she sometimes skips 3-6 months in a row. She is always tired, lacks energy, has weird mood swings. She has also had a pretty bad pain in her sides that comes and goes, but is excruciating for her. I have taken her to multiple doctors over the years who all told me that 1) her period being irregular was \"normal\" for a girl in her teens and 2) since she never seemed to be in pain at the time she was seen, they couldn't do anything about it.\n\nOur insurance changed, so we got new doctors. I took her in for her physical, and she casually mentioned the pains she was having to the doctor. He was instantly concerned, and was upset that it had gone so long without any of her past doctors looking into it. We told him about the other issues, and he was concerned about that as well, but said we should take care of her pain first and then look into the other. He ordered ultrasounds to check all of her internal organs and blood tests to check her hormone levels.\n\nAfter 6 years of being brushed off, she found out the pain she gets is caused by greasy food. We changed her diet (as well as ours, and we all needed to eat better, and this was just the catalyst for the change) and the pain is gone. We bought an air fryer, and she can now still occasionally have the fried food she loves without it causing her pain.\n\nIn addition, the blood tests found that she has low estrogen levels.  This wonderful man, the first doctor to actually care about my child, put her on birth control pills to level out her hormones. She is like a new person, and I can't remember the last time she was this consistently happy with life.\n\nI just wanted to share, because I hear stories all the time about doctors underestimating a woman's pain. It happens to me, and I generally just shrug it off because I have a high pain tolerance and I suck at confrontation. It just pisses me off a thousand times more when they do this to a child. She has spent her teen years suffering, and the solution was so simple. It just took one doctor to give a shit.",
    "title": "Finally found the right doctor",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1555974904,
    "score": 7646,
    "keyword": "woman doctor"
  },
  {
    "text": "He makes me cry. I tend to bleed after sex.  I have had myself checked out multiple times (with multiple doctors) and the results are always the same.  There's nothing wrong.  No cancer. No polyps. \nJust use more lube and make sure you are aroused.  \nWell, most of the time,  I still bleed. Sometimes it's a little bit and sometimes it's a lot. \n\nBut that's just backstory. \nThe real reason I made this post is to say that my boyfriend of three years is fucking amazing! He has NEVER commented negatively on that little issue I have.  He has never made me feel like less of a woman. \nSometimes I cry when the bleeding happens. I hate that it happens and that I can't control it. I always think to myself, \"this is it.  This is the time he is going to get sick of it and leave.\" But he doesn't. He just holds me and tells me he loves me no matter what and that he still wants to make love to me.  \n\nI was crying tonight after sex because of the bleeding. I have anxiety and sometimes it triggers it.  He just held me, loved me, and gave me kisses. Then I was crying for a different reason.  I was crying because he loves me no matter what and I feel like the luckiest girl in the whole world.  \n\nI have had my share of shitty relationships.  I have been mentally and physically abused.  I never thought I would meet a good guy that treated me well and respected me.  I finally stopped settling for any asshole that would give me attention and waited for somebody amazing.  And he found me.  Im never letting him go. He's patient, kind, loving, and respectful. \n\nDon't give up. Don't settle. Every woman and man deserves someone that will make them cry happy tears.  \n\n\nUpdate! \nI just wanted to thank everybody who read this post and offered their insights as to why this may be happening to me.  Thank you for all of the support.  \nIt definitely gave me some ideas and im going to be bringing this up with my gyno next visit.  \n\nThis seems like a fairly common problem with woman but it's not talked about often.  \nDon't be afraid to talk to your gyno about ANY problems and if they don't listen get another doctor! :) \n\n\nUpdate! \nWow! Thank you for the gold, kind stranger.  Im glad this post has caught attention.  Maybe it will help others with the same issue.  \n\nAlso thank you for the silver and platinum! \n\nIm so happy that this post had such a wonderful response from both women and men.  Some of you have posted that you have had the same issues and have offered guidance and some of you were encouraged to go to the doctor once you read the post and other's comments.  You realized you were not alone. \nIm glad we all made a difference today. \n\nAnd I showed my boyfriend the post and he was overwhelmed with all the love and support as well.",
    "title": "He makes me cry.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554527019,
    "score": 7203,
    "keyword": "woman doctor"
  },
  {
    "text": "Homeopathy is a total fraud, and a cruel way to exploit people who are desperately looking for help. #Why it doesn't work\n\nEssentially, homeopathy is based on the belief that **like cures like**. In practice, this would mean that different symptoms would be treated using small amounts of substances that in bigger doses would cause them.\n\nI do acknowledge that this \"like cures like\" principle has been scientifically researched, with the name **hormesis**. Because of these studies, it's widely accepted that a small amount of a substance can in some cases have a different effect on a cell than a higher dose. However, we don't know how rare this phenomenon is, and the alternate effect it causes isn't necessarily positive or desired at all. \n\nPracticioners of homeopathy generalize this very unclear and controversial theory by thinking anything that causes a symptom can cure it in low doses. For example, in 2018, naturopath and homeopathic practicioner Anke Zimmermann gave a 4-year-old boy a remedy containing the saliva of a rabid dog, to treat the boy's supposed anger management issues (which, by the way, are perfectly natural for children that age), aggression and poor sleep, claiming that the solution \"cured\" him. If the remedy actually contained the virus, this woman was literally endangering a child's life for some crazy pseudoscientific experiment, while probably charging the parents a significant sum of money for it.\n\nAdditionally, there is another, arguably even bigger problem with homeopathy. Homeopathic medicine is produced using a method called \"potentization.\" This means mixing 1 part of the desired ingredient with 9 parts of water, then shaking the solution, then mixing 1 part of the mixture with 9 parts of water again, and repeating this process over and over again. Homeopaths claim that the less of the ingredient the final solution contains, the more effective it is. This leads to the ingredients being diluted into nonexistence: in almost all homeopathic remedies, not a single molecule remains of the original ingredient. And even remedies that do have something else than water or alcohol in them only contain a couple of molecules of it: not enough to cause any effect. Again, none of this has been scientifically proven to work, but to be honest, homeopathic \"doctors\" don't seem to care about science anyway.\n\n\n#Research on homeopathy\n\nMost medical institutions around the world have rejected homeopathy as pseudoscientific nonsense, and rightfully so. In 2015, Australia's National Health and Medical Research Council, one of the world's biggest and most respected health institutions, conducted a massive study on homeopathy, with over 1800 different studies systematically analyzing papers and documents related to the topic. They concluded that there was \"no good quality evidence to support the claim that homeopathy is effective in treating health conditions.\"\nThe NHMRC had already come to the same conclusion earlier, in 2014, when they found homeopathy to have no effect in treating any of the 68 different health conditions included in the study.\nIn 2010, BMJ (earlier known as the British Medical Journal) wrote an article proving that complementary medicines, such as homeopathy, are absolutely useless as substitutes for conventional medicine.\nEven back in 2002, the British Pharmacological Society debunked homeopathy as completely ineffective.\n\nLinks:\n\nNHMRC study 2015: https://www.smithsonianmag.com/smart-news/1800-studies-later-scientists-conclude-homeopathy-doesnt-work-180954534/\n\nNHMRC study 2014: https://www.theguardian.com/world/2014/apr/08/homeopathy-is-bunk-study-says\n\nBMJ article 2010:\nhttps://www.eurekalert.org/pub_releases/2010-12/bmj-cmc122210.php\n\nBPS article 2002:\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1874503/\n\nThese were only a few examples of the overwhelming majority of evidence clearly showing that homeopathy has no real curative powers. It's a fact at this point.\n\nMost of, if not all of the \"evidence\" supporting homeopathy, however, is based on people's personal experiences. The problem with this is that these experiences originate from the subjective viewpoints of people who might be biased towards homeopathy, thinking it cured them for sure, when in reality there are tons of other possible reasons to someone recovering from a health condition. It could have been another treatment that was used alongside homeopathy that did the trick. It could have been a change of lifestyle. It could have simply been time: the human body fights for its health by itself. We all have powerful immune systems designed for keeping us alive and well.\nBesides, what about all the people who didn't experience any help from homeopathy? We never see the homeopaths talk about them.\n\nThere is only one way homeopathic treatment could possibly help a human win over a disease or health condition: placebo. But it's an effect that applies to literally everything. You could eat a piece of candy, and believing in it enough, it could make you feel less ill. Funnily enough, that's basically what homeopathy is all about.\n\n\n#Why it's unethical\n\nHomeopathic doctors act like kind-hearted and helpful people, who embrace the idea of \"natural\" medicine as a way of healing for everyone. Some of them, I'm sure, truly believe their own lies. But this empathy is also a way to attract customers. Homeopathy is a big business, and a very greedy one.\n\nThese mixtures of water and alcohol are being sold to unsuspecting people as a risk-free, non-invasive cure to a plethora of different diseases/symptoms, usually as a liquid or in the form of small sugar pills. The problem with this is that even though they have no effect whatsoever, they are highly expensive, disguise themselves as real medicine and deceive people who often have chronic, painful, difficult, crippling diseases or conditions that they are desperately looking for relief for. The homeopathic industry not only lies to people and takes their money, it can even worsen public health by discouraging people from seeking help from proven, conventional medicine, guiding them towards homeopathy and other nonsensical alternative treatments instead. This is a true problem.\n\n\nLastly, I want to link you to a video about homeopathy made by a brilliant knowledge-spreading Youtube channel that some of you may have heard of: Kurzgesagt (In a nutshell). This video is what made me aware of the many flaws of homeopathy in the first place, and for that I'm endlessly thankful to the creators of it!\n\nhttps://youtu.be/8HslUzw35mc\n\n\n\nEdit: just wanted to thank the strangers who gave me silver! Never expected anything like that from a post like this.\n\nEdit: wow, huge thanks to the redditor who gave me gold, I couldn't be happier!",
    "title": "Homeopathy is a total fraud, and a cruel way to exploit people who are desperately looking for help.",
    "subreddit": "medicine",
    "timestamp": 1558111113,
    "score": 1176,
    "keyword": "woman doctor"
  },
  {
    "text": "Nurse sends pregnant woman home without doctor review, patient dies of meningococcal sepsis",
    "title": "Nurse sends pregnant woman home without doctor review, patient dies of meningococcal sepsis",
    "subreddit": "medicine",
    "timestamp": 1564437850,
    "score": 591,
    "keyword": "woman doctor"
  },
  {
    "text": "Bronx woman awarded 110 million because her doctors did not transfer her to an ECMO center for status asthmaticus",
    "title": "Bronx woman awarded 110 million because her doctors did not transfer her to an ECMO center for status asthmaticus",
    "subreddit": "medicine",
    "timestamp": 1555366684,
    "score": 560,
    "keyword": "woman doctor"
  },
  {
    "text": "Brno University Hospital [Czech Republic] doctors and nurses overwrote the history of medicine. For 117 days they were maintaining vital functions in a pregnant, brain dead woman. Then a healthy baby girl was born.",
    "title": "Brno University Hospital [Czech Republic] doctors and nurses overwrote the history of medicine. For 117 days they were maintaining vital functions in a pregnant, brain dead woman. Then a healthy baby girl was born.",
    "subreddit": "medicine",
    "timestamp": 1567628967,
    "score": 74,
    "keyword": "woman doctor"
  },
  {
    "text": "Starting a solo practice (husband’s POV) I’m the husband of a fiercely intelligent woman who also happens to be an ob/gyn. Last year she quit working for the doctor she’s been with since finishing residency to start her own solo practice. I also work full time but try to help her with various aspects of her business in my free time. It has a whirlwind of a year but we are both surprised by how positive things have turned out so far. \n\nRunning a solo practice was an idea she would have scoffed at when she was in her residency and looking for a job. We live in an expensive coastal city. Most of her friends went to work for one of the large hospital systems and a few went into academics. Doctors are quite the risk adverse type of people given on my own impressions.\n\nIt helps that her patients love her and many followed her when she moved. She kept her hospital privilege and the new office was just around the corner, so patients probably didn’t mind much. Volumes were low in the beginning but we also kept the expenses low. I built her a website using WIX so we avoided paying expensive web designers. We spend about $500 a month for Google AdWords, which has really helped grown her pt volumes organically. The biggest expense each month is rent. But everything else is pretty manageable. It also boggled my mind how little MAs get paid: we received dozens of resumes overnight after posting the opening for a job that pays on average $16 an hour. How do they afford to live in an expensive city like this one?\n\nChanges to her lifestyle have been both good and bad. She dictates her own hours now, which are nearly the same as before. But she doesn’t have anyone to share calls with, so we can’t take vacations or so much visit friends that live more than 2 hours drive away. \n\nWe are now in the process of buying a medical office space instead of keep renting, so her patients can find her in a more permanent location. There are so many older doctors looking to retire but so few young ones want to buy their own commercial space that the dynamics are working greatly in our favor. We keep getting offers from seller that would never happen for the residential real estate market here. However we are struggling a bit to find a bank that will lend to us at a reasonable rate because the practice doesn’t have that long of a history.\n\nThings are going well so far and I’m proud of my gal. She works hard but is also notably happier being on her own. Helping her, sometimes we fight over difference in opinions, especially at times when I feel like my efforts are under-appreciated. But overall I enjoy the work I do for her and this past year has brought us closer and made our marriage stronger.",
    "title": "Starting a solo practice (husband’s POV)",
    "subreddit": "medicine",
    "timestamp": 1547913728,
    "score": 64,
    "keyword": "woman doctor"
  },
  {
    "text": "Supporting patients who believe their care is inadequate due to race, and being sure that care is not inadequate I am white. I try to be culturally competent and check myself on intrinsic bias and read the many articles about certain racial minorities (particularly African American) having missed MIs, less pain med, longer visits...etc. However...I’m still white, and particularly in the ED pts have no idea whether or not I may be treating them differently because I don’t share their skin tone.\n\nComments are usually subtle, and I don’t always address them because I might be misinterpreting it. But last night a young man with abdominal pain who was not an appropriate candidate for the morphine he was requesting ended up crying that we “weren’t doing anything because l’m a young black man.” I tried to explain that I had a white woman with a similar situation who I treated in the same way the night before. I tried validating his concern, saying that he’s correct about racial discrimination in medicine, but that I was doing everything I could think of. I tried talking to his grandmother to see if there had been bad experiences before and assure her that I was trying. I told him that I was sorry if any doctor had treated him differently because of the color of his skin. The other times I’ve gotten similar comments tend to surround cyclic vomiting patients with marijuana as a likely cause but an unwillingness to quit. I feel like I’m failing these patients.\n\nWe didn’t have any docs of his race working in the ED, but if we had...would it be appropriate to swap docs? We do it for religious reasons.  Are there better things I could have said to diffuse the situation?",
    "title": "Supporting patients who believe their care is inadequate due to race, and being sure that care is not inadequate",
    "subreddit": "medicine",
    "timestamp": 1564164148,
    "score": 54,
    "keyword": "woman doctor"
  },
  {
    "text": "Learning opportunity: what is the solution to abuse in residency? So I posted a different topic yesterday and let’s just say it went a little sideways. Did some reading, called some attendings, feel like this is a worthwhile discussion.\n\nWhere my bias comes from is a product of my generation and training so let my lay my framework and see if we can reach some mutual understanding. Grew up in the eighties, it was a different time. Words back then didn’t carry the same social stigma now that they did then not to say the people hearing it weren’t hurt by it. Also, as a guy, ribbing each other was constant and could get cruel and mean but most everybody got along. Bullies were usually physically intimidating or small guys with larger than themself personalities. Trained in a community hospital and now work in a University hospital and community hospital. \n\nIn training we had three abusive attendings and one I didn’t get along with. One, let’s call him Dr R would get off the handle and berate some of my seniors. I never saw the wraith but after commiserating with a colleague we could see how bad it could be for some people. My response when I had interns was to prepare them for his pimping and step in and take the fall if they didn’t have the answer. He once yelled at an intern who was 6+ ft and when the intern stood up he walked away. The other was a Dr J, he was just a cantankerous little doc and he once berated an attending from behind thinking it was an intern and was mortified when they turned around. Still remember what she said, you shouldn’t apologize to me because I’m an attending, you just shouldn’t talk to anybody that way. There was a Dr C who wasn’t ever verbally abusive but you wouldn’t get the same teaching if he didn’t think you werent interested. Amazing teacher though if you got his teachings. The only one I didn’t get along with, not to say people got along with me, was a Dr M who started yelling at me when I shielded my interns. Well, we got into it, told her that the only people with a right to yell at me are my parents, that ended with a meeting with the associate program director and a truce. We never really got along after that but remained professional. Program director never put up with it and let’s just say they won they lost the battle but won the war. \n\nNow at work, there are some people who are, who carry a reputation for being real tough/mean. Most trainees who finish that rotation actually love them and remain in correspondence in their professional careers. Most others are generally nice and well-liked. Definitely there are surgeons around and senior fellows who carry unbecoming dispositions but by and large it seems things are ok. Here’s where my gap in understanding this comes. We have been having memos going around about abuse and microaggressions and so it must be an either large group of residents or a very vocal minority who don’t feel how I do. I’m about ten years out of training. \n\nAs for me, my teaching style is best described, from my reviews, as not hands-on enough to gives great autonomy. I do morning rounds but don’t bedside round on all cases. I give short related talks to the case at hand. I give afternoon teaching sessions on Bayes theorem and the mathematical nature of diagnosis, biomed stats talks, ethics talks, billing, and whatever clinical stuff they are in to. I never make them feel small at the bedside, I don’t round in front of other teams, and I lay out very concrete expectations. I don’t generally give feedback at the end of the week but pepper it along as we go. I don’t sandwich. I take a more coach athlete approach. I’m a very happy person but have been told by friends I may be mean sometimes. I like Dr Cox from scrubs but no better than to be him. \n\nSo surveys from 1990 and more recently show basically the same thing. Residents feel abused, about 20%, consistently, and 80% of graduating residents feel they have been abused at least once. Work hours remain long but are down from the past. Doctors continue to commit suicide at much higher rates then the public. I won’t even begin to speak about sexism since I’m not a woman but I’ve seen it and heard about it and it remains a problem. \n\nSo thanks for getting this far, that being said:\n\nTo what extent is the abuse a systemic problem? To what extent is it a problem of individuals?\n\nAt what point does the feelings of the abused an internal problem and not an external problem? This is not a generalization and I understand it’s a very nuanced problems.\n\nWhat factors such as sleep deprivation, large quantity of material to learn, emotional stress of practicing medicine/surgery play into augmenting the feelings of being abused?\n\nWhat is the true role of medical education?\n\nWhat does my generation not understand? Not speaking for all of us. \n\nIs physician burn out a system problem or a personal problem? Since it isn’t a binary problem, where on the spectrum are we?\n\nWhat do we do about it?",
    "title": "Learning opportunity: what is the solution to abuse in residency?",
    "subreddit": "medicine",
    "timestamp": 1568591896,
    "score": 31,
    "keyword": "woman doctor"
  },
  {
    "text": "I patient died and I need to talk about it. Today my patient died. \n\nI came onto the floor and night shift was frantic. Phones ringing, call lights alarming, papers all over the place. Not a good sign. I get report for three patients from one nurse, then find another nurse for the other 2 reports. Let’s call her Jen.\n\nJen gave me report on one patient- he’s fine, stable, peacefully asleep. But the second patient... this poor man. Jen gives me report on Jerry (fake names of course), informing me that he has come in on hospice and is suffering from a severe cancer diagnosis. My eyes flicker over to Jerry in the bed, he is tachypneic and pale, his eyes rolling in the back of his head as he moaned in pain. Jen tells me that he’s only been here for about an hour and a half. No family is here yet. No admit can be done as he is unable to communicate. He is alone and suffering. \n\nJen proceeds to inform me that although the doctor has seen him and it is clear that Jerry is on comfort care, no orders are in the computer. No pain meds, no palliative consult, and no code status. With an undetermined code status, the patient will be treated as a full code and will be resuscitated if he arrests. Jen shrugs, tells me good luck, and leaves for the day. \n\nThe first thing I do is call the doctor. He answers after a few rings and manages to groan out, “This is doctor Smith.” Clearly I have interrupted his sleep. “Hi Dr. Smith,” I say politely. “It’s aaaaasowenyaaa from med-surg. I have your patient in room nine that was admitted from the ER this morning, and we don’t have a code status on him. Can you please put in that order along with the comfort care procedures as well?”  The doctor sighs loudly and says, “Why can’t you just put it in yourself? He is a DNR.” I take a deep breath. This is a doctor that won’t do anything for himself if he doesn’t have to. I close my eyes and say, “Look, only doctors are qualified to put in a code status so I really need you to do that. I can do the comfort care if you really need -“ but Dr. Smith interrupts me and says, “I’m busy right now I’ll do it later.” Now I’m upset. This is not the first time I’ve had to confront him like this. “Dr. Smith, if this patient dies and you wait to put in that order then I am required to do CPR. I have to do CPR on a frail old man who is about the take his last breath, whose body is riddled by cancer. Please. Put in the order.” He finally agrees. \n\nSo I sit and click refresh on my computer a hundred times waiting for that DNR to pop up, but it doesn’t. At this point my patient is getting worse, he is breathing less and just looks like he’s in agony. I tell my supervisor and she immediately calls Dr. Smith. Another 10 minutes passes. Finally! The order pops up.\n\nI draw up 4mg of morphine (that’s all I can give so far) and practically run into the room. Now I feel it’s safe to give this narcotic without fear of my patient dying. But he is still. Alive, but still. A woman sits at his bedside now, her eyes red and puffy. “What the hell is happening to my husband?” she manages to choke out. I get a lump in my throat but swallow it down. “You must be Sara. I am so sorry to meet you under these circumstances.” She scoffs as a flood of tears roll down her face. “Let me explain what’s going on,” I begin, but she interrupts me. “He shouldn’t be in this much pain! How could you let this happen? I want to speak to the director of the hospital. I’ve worked in hospice for years and I know he should never be in this much pain. He was fine yesterday! What’s going on?” I take another deep breath. At this point it’s only 8:30, I’ve been on shift for a hour and already I feel the yearn to run home, to leave this place. But I stay. I explain that without the DNR order, if I pushed IV morphine and Jerry’s respiration’s stopped, that I would have to resuscitate him. She relaxes a bit, shakes her head but agrees that Jerry would not have wanted that. I tell her I am so sorry, that I will do everything I can now to make him comfortable, that I am so incredibly sorry for the delay in pain meds. \n\nI step out of the room after settling Jerry and stare at the wall. My heart aches for Sara. This is not the first spouse she has lost and I did not make it any easier for her. Why can’t doctors just put in their fucking orders?\n\nI take some time to round on two of my patients before the call light goes off in room nine. I knock quietly and enter, and immediately I know. Jerry is gone. Sara glances at him then back at me, her eyes desperate for hope, for a little more time. I step out and grab another nurse to assess with me. We both listen for one minute, but there is nothing. No vital signs, no heartbeat. He is gone. I force my eyes to meet Sara’s. Shake my head and say, “I’m sorry. He’s dead.” \n\nThe lump rises back into my throat as his wife gently kisses his head. “You are my best friend,” she whispers. She cradles his head softly and begins to sob, begging him to come back. I stay for a minute with my hand on her shoulder, but its clear she just wants to be alone with her husband. I politely show myself out and tell her that I will call the chaplain and that if she needs anything to just ask. I walk into the bathroom and lose it.\n\nThat patient died a prolonged and painful death. He suffered when he shouldn’t have. His care was delayed because a doctor was too lazy to do his fucking job and put in a simple yet critical order. His last moments with his wife were in agony and that could have been prevented. I work in med-surg, I don’t see comfort care  often, but I know enough to say that Jerry died an unjust death. \n\nThe lump in my throat still won’t go away.\n\nEdit: wow, thank you all so so much for the support and encouragement. i’m trying to keep up with replying but there’s so many of you! i was not expecting all the love. thank you reddit.\n\nEdit 2: the title was supposed to be “my patient died”, guess i was still frazzled when writing it",
    "title": "I patient died and I need to talk about it.",
    "subreddit": "nursing",
    "timestamp": 1556064282,
    "score": 1127,
    "keyword": "woman doctor"
  },
  {
    "text": "An absolute honor: taking care of a former nurse who earned her cap in the 1940’s One of my patients from the other day was a tiny, soft-spoken, elderly woman with a long list of medical issues.  She was so miserable.  She couldn’t breathe, had no appetite, and everything hurt due to many years of advancing RA.  She had to be in contact isolation for a positive MRSA swab, which means staff was not continuously breezing in and out like they might in other rooms.  I stopped in on my usual rounds and was talking to her while I assisted her with a bedpan.  She expressed feeling humiliated at having to use one, and looking back now she felt so bad for her patients that had to use them too.  \n\nTurns out she was a nurse.  Not only that, but she worked for this very hospital until she retired in the mid-80’s, acting as House Supervisor after working as a floor nurse.  My hospital used to have a nurse diploma program, and through it she earned her cap in the early 1940’s.  She spent her entire career here.  She even remembered the hospitalist who saw her that afternoon back when he first started after residency, “before this place turned him that gray.”  She just kept talking, and I pulled up a chair to listen.  She had been alone in her room, with momentary exceptions, for two days, and thinking of other things distracted her from the realities of her failing body.\n\nWe talked about how nursing has progressed as a profession, how it used to be seen versus how it is seen now (better, it turns out), how nurses were expected to behave not just on the job, but at all times.  She mentioned how she was forced to temporarily quit when her first pregnancy started to show, as her employer felt it would be immoral for a visibly pregnant nurse to be around patients.  She would be hired back after she delivered.  She said she wore her cap from day one until she retired, freshly dry cleaned and starched every week.  She still had it, on her bookshelf at home.  She eventually had to have a coworker pin it on her hair towards the end of her career when her RA made it too painful.  She missed nursing, everyday.  She was very proud to be a nurse.  Her daughter became a nurse, and two granddaughters and a grandson are registered nurses.  She was even more proud of that.\n\nI asked what she thought of how things are today.  She shook her head.  “In some ways, it’s much better.  They’d never fire a nurse for being pregnant these days.  Nurses get more education now, and can do so much more.  But hospitals and clinics are run by people who never worked in one, and that is where it’s bad.  Doctors and nurses are seen as slightly more useful than equipment.  The patients seem to matter even less.  No one is given enough time to care about the patients, much less care for them.  I feel terribly for nurses these days.”\n\nIf I could have, I’d have stayed and talked to her all day, but I had seventeen other patients that day.  Her words were rather fitting.\n\nLater on her daughter came by and showed me a professional photo of her Mom as a young woman.  She was beautiful, and beamed like a pageant queen in her white uniform and banded nurse cap.  The patient was as pleased as a well-fed cat at this.\n\nShe felt like the nursing grandma we all need.  The one to tell us about our “family” history, and all the things she’s seen.  How her experiences crafted her career.  So many other things.  I could have sat there and listened for hours.  It was just interesting as a nursing aide, figuratively sitting at the foot of a professional elder, hearing all of these things.  I feel it will stick with me.  I hope so anyway.  ❤️",
    "title": "An absolute honor: taking care of a former nurse who earned her cap in the 1940’s",
    "subreddit": "nursing",
    "timestamp": 1559598656,
    "score": 362,
    "keyword": "woman doctor"
  },
  {
    "text": "Everyone has nightmare frequent fliers, but who's your favorite repeat customer? I encountered mine for the first time in months last night, as he's a seasonal special. Homeless, chronic alcoholic, nicest person you could ever hope to meet.\n\nOne of our docs was planning to discharge both him and the (formerly) acutely intoxicated young woman in the room across the hall from his stretcher. The young woman's nurse said she wanted to check how she planned to get back to her hotel. The doctor was passing by, and he said, jokingly, \"Oh, we can just have [Homeless Bro] walk her!\" Cue laugh track.\n\nI'd just gotten a new patient so I went into their room for a bit. Came back out, my buddy's still sitting there on the stretcher. He never drags out being discharged once he knows it's coming, and he usually doesn't wait around for DC papers because he's gotten roughly 10,000 copies of the same ones. I was like \"Hey, [Homeless Bro], you know you're good to go, right?\"\n\nAnd he told me that yeah, he'd heard, but didn't the doctor want him to walk somebody home? \n\nI'd give the last pudding cup in the fridge to him over a VIP any day.",
    "title": "Everyone has nightmare frequent fliers, but who's your favorite repeat customer?",
    "subreddit": "nursing",
    "timestamp": 1552960828,
    "score": 130,
    "keyword": "woman doctor"
  },
  {
    "text": "\"We have all the same training nurses do.\" One of the Critical Care Medical Assistants said that to me--\"We have all the same training nurses do\"-- during a meeting several months ago. Half of them are older than me, half of them have a lot more years on their jobs than I do. One of them is even a Medical Assistant trainer. \n\n&#x200B;\n\nToday, at our multi-specialty clinic, was pulmonology day with a sprinkling of cardiology patients. We some some \\*really\\* sick people. One lady today had her portable concentrator and some dumbass at the DME company put her on a pulse flow and the poor woman was saturating at 70%. Put her on a tank, she's fine, I'll call the DME company and chew them out to fix the settings, whatever.\n\n&#x200B;\n\nThis afternoon, as I was contemplating leaving, one of the receptionists came back to get me because one of the patients seemed so sleepy he could barely finish a patient. He thought he was there for a stress test, but he wasn't on the schedule. Maybe he was mixed up because the settings on his CPAP were wrong; after all, he does have sleep apnea, and it's pulmonology day in the clinic. \n\n&#x200B;\n\nI was on a call, and asked the receptionist to grab the most experienced MA, the one who teaches MA classes, to assess the patient. That MA came to get me a few minutes later saying maybe he was narcoleptic or his CPAP needed to be adjusted or something, but he should see a doctor. My call ended and I headed out. At least MA had him on a tank at 2LPM. She said that when he \"fell asleep\" his saturation dropped into the 80s.\n\n&#x200B;\n\nWith enough firm rubs of the back Patient woke back up and I asked him what time he went to bed. *Oh, about 5 am, you know.* What were you doing up until 5 am? *This and that.* What kind of drugs and alcohol did you have last night? *Just some heroin. Just a little.* Just until 5 am? *Uh huh.* \n\n&#x200B;\n\nSo we called rapid response (We have the luxury of being a clinic inside of a hospital) and made it their problem. I emailed my boss asking to make Narcan magically appear in our clinic because I had to sit there and give the dude sternal rubs every 15 seconds for like 10 minutes because he kept trying to die.\n\n&#x200B;\n\n\"All the training nurses have\" my fucking ass.",
    "title": "\"We have all the same training nurses do.\"",
    "subreddit": "nursing",
    "timestamp": 1555539275,
    "score": 94,
    "keyword": "woman doctor"
  },
  {
    "text": "Got punched by a patient yesterday. Hey all, long post.\n\nSo I was struck by a patient yesterday.  She was delirious and violent all day.  I sat near her and tried to keep her from falling all day.  She threw soda on me and refused all medicine.  Doctors tried new medicine and she seemed to calm a bit as the day went on.  She asked to go to the restroom (was incontinent earlier).  I was walking her to the restroom and she turned and punched me hard in the face.\n\nI’m physically okay.  Bruised but fine.  Emotionally a bit frazzled.  I finished the day yesterday.  I’m off today and going back to work tomorrow, not going to work with that patient.  Manager texted me and nicely said she’s sorry.  Risk Management called me to get all touchy-feely but they’re just protecting the hospital, so I was polite but didn’t open up.  \n\nI’ve been hit before, but by people who weren’t interested in hurting me.  Usually confused, elderly, demented, scared people.  This woman is 60.  She wanted to hurt me.\n\nI’ve been realizing all the red flags in my job recently.  Huge layoffs at the hospital, takeover by evil corporation, me getting so frustrated and stressed, and now this.  I’ve decided to heed the red flags and to seriously start job seeking, not in bedside nursing.\n\nI’ve been so convinced that all this was a weakness in me.  That I’m too sensitive, somehow defective, not a good nurse.  I’ve won Nursing awards.  I’ve been promoted twice.  I’m not a bad nurse.  And I don’t think I’m a bad person.  And I think that, while I’m sensitive, I’ve also stuck with this challenging fucking job for 8 years.  And that’s pretty tough.  My anger is my mind setting limits and saying, This isn’t okay for me anymore.\n\nThanks for reading.  I’m going to be fine, just a bit upset right now.",
    "title": "Got punched by a patient yesterday.",
    "subreddit": "nursing",
    "timestamp": 1554925968,
    "score": 56,
    "keyword": "woman doctor"
  },
  {
    "text": "Dead Babies & Feeling Isolated In Our Profession **Loneliness In The Medical Field**\n\n&#x200B;\n\nI’m not sure how common this is for others in the medical field, but I found it extremely lonely at times. I remember walking past this ‘wall window’ on one of our top floors many nights around 2 Am. Looking out over our city, watching the cars drive by on the freeway, and it was all just so isolating. I desperately wanted others to understand what I did and what I went through, yet I was unable (or unwilling?) to let them see.\n\nIt always hit me on Fridays. I’d work a normal schedule (thank-God) and be out of the hospital by 5. Sometimes I’d have a really hard case right before I’d leave, like a call to the children’s ED or something that really pulls your heart, something that doesn’t let you distance yourself from it. Then after about 30 minutes of being in the middle of that, I’d be at some swanky restaurant with my friends for Friday dinner. And I’d be holding all these thoughts, images, feelings… but I felt so isolated because it felt impossible to talk to them about it. Like here we are, laughing and cutting up. And 30 minutes ago I was holding a dead baby and consoling a mother. It was so isolating. \n\nI wasn’t a chaplain very long, but I started to see that same dynamic in the nurses and doctors that I began to recognize --this type of isolation, even though they had friends and family around, they would often seem to feel very alone in life. It’s quite difficult to navigate.  Because in a lot of ways, your friends won’t understand or be able to grasp what you see or deal with on a daily basis. And that’s ok, they’ve not grown the capacity that you or I have to handle traumatic experiences. \n\n&#x200B;\n\nBut the question is, how do we open up? How do we de-isolate ourselves so that we aren’t living alone on an island while we watch relationships sail by? Or is it impossible?\n\nMany will say, “talk to your friends at work” – which isn’t bad advice. But it doesn’t necessarily solve the problem of isolation. And that doesn’t necessarily work if you don’t have good relationships on your floors/teams. So what is the solution? I’m not sure, haha. But there is a metaphor I heard that I’ve been trying to work with, and I think it’s helped in some ways.\n\nSomeone told me that experiencing trauma is like a grenade explosion. You have the initial blast zone and then expanding zones of impact, but they lesson with distance. Let’s say a young woman loses her arm in a bad car accident and comes to the ER. She feels the brunt of that explosion. But now, other people have entered into that “cone” of shrapnel. EMS. Nurses. Doctors. Chaplains. They step into that radius, and it affects them a bit. But not as bad as the one closest to the explosion. Then you have the family, who didn’t see the immediate aftermath of the accident, but now has to walk with their daughter through this, they are a bit more removed, further away from the blast radius, but still affected. And it’s this growing circle, like a shock wave, that has been emitted from this traumatic experience. But as the shock-wave moves beyond the initial starting point, it lessens in power. \n\nIf traumas effects really work like that, then could we trust that those who we talk to about some of what we experience, could actually handle the weight of it? Because it’s not going to be as heavy or impactful on them, as it was us? Or maybe there’s ways for us to express what is heavy and on us in ways that better shield them?\n\n&#x200B;\n\nThis then, in theory, gives us the chance to risk a bit. It makes isolation not something we are unable to fix, but something that we are unwilling to fix, if we don’t. And for me, that was really freeing to understand. I love being a helper. I love counseling, helping, giving. But I hate, hate, asking for those things for myself. This understanding of trauma, and how it moves, and my own heart was really helpful in allowing me to see that I am unwilling to allow others to help me, and until I can work through that, I’m always going to feel a bit isolated. Because I never let anyone else in.\n\nSo, here’s my question for you all. How do you navigate this? I understand in theory how it works, but I still have such an aversion to letting others in, even though I really want to at some level.\n\n&#x200B;\n\nMaybe that made no sense and I’m just rambling…\n\n~Pace",
    "title": "Dead Babies & Feeling Isolated In Our Profession",
    "subreddit": "nursing",
    "timestamp": 1569421298,
    "score": 40,
    "keyword": "woman doctor"
  },
  {
    "text": "Goal this year: meet, like, ANY of my students’ dads. No, I’m not single and on the prowl.\n\nI am just sick of men assuming that it is a woman’s job to do the parent thing. We have so many events at school (I teach middle) where parents are invited: during the day, in the afternoon, at night. And almost ALWAYS it’s a room full of moms with maybe one dad. And these are working moms - doctors, lawyers, etc. I work in a really affluent area so it’s not like they can’t afford a sitter or something. Last year our back to school night was on the same night as our team’s NFL kickoff game - zero dads.\n\nI never get emails from dads questioning their kid’s grade or effort. Only moms. PTO is only moms - and yes, most of them also have full time jobs.\n\nTwo years ago we had called a parent meeting and the dad WENT TO THE WRONG SCHOOL. He apparently did not realize his kid graduated from elementary school.\n\nWhen I’m a parent (hopefully soon), that shit is not gonna fly in my house. My husband will go to the events. He will know the names of my kids’ teachers and will never use the word “babysit” to refer to supervising his own children. \n\nTo the men who are actively parenting their children, thank you. Thank you for being fantastic role models for your kids and for sharing the load with your spouse. Its 2019, and we want you in the conversation. You have so much value to add to our efforts to help your child and we really do appreciate your input. You don’t need to sit back and say, “This is really more her thing” about your wife.",
    "title": "Goal this year: meet, like, ANY of my students’ dads.",
    "subreddit": "Teachers",
    "timestamp": 1564755050,
    "score": 725,
    "keyword": "woman doctor"
  },
  {
    "text": "I feel so lost (marrying a teacher) I'm marrying the love of my life in less than a month! I am a 28 yo man who works in engineering, she's a 25 yo woman who teaches 6th grade English. She's been teaching for a few years now in a few different positions at various schools.\n\nI understand how tough it is to start a career. I myself had times when I was working 70 hours a week. And I understand there are elements of teaching that I will never be able to relate too. But her career is putting a huge strain on her mental, and now physical, health. It's starting to even affect me and our relationship negatively.\n\nShe's always questioning if she really enjoys teaching. She insists she doesn't care about the students most of the time, even says she hates them sometimes. She works twice as many hours as I do and gets paid less than half of what I make. The stress has gotten so bad that she has developed severe muscle tension. A doctor prescribed her muscle relaxers and pain killers. So now when she's not grading papers at home, she's passed out from the meds. Her health is not where it should be, and her family tree is filled with cancer, heart disease, diabetes, etc. so it is ESPECIALLY important that she maintains a healthy lifestyle and mental clarity.\n\nI do all the cooking, all the cleaning in our house, I drive us wherever we need to go. And I work 40+ hours a week and have a 2 hour commute every day. I'm starting to feel like our relationship is one-sided.\n\nI was hoping she would get wise advice about work/life balance from more experienced teachers she works with. But when she talks about that with them, all they say is \"My husband doesn't like how much I work either. Men are so clingy\" thus further cementing the idea that work/life balance simply isn't possible as a teacher. My fiance has even said \"This is the life of a teacher. If you don't like it, don't marry me.\n\nI think her defensiveness comes from knowing she can't contribute to our relationship as much as I can right now. I know she loves me, and I know I love her. I have no doubts about marrying her. But the lifestyle we have right now is simply not sustainable, *especially* in a marriage and *especially* when we have kids someday. And if we're struggling with work/life balance *before* we're married I can't imagine it improving after.\n\nAt the moment, she is currently a long-term sub. So my suggestion to her is to simply be a daily sub (which she would be able to do as often as she'd like since we have very big districts around us) after her contract is up. She likes that idea too, but she wouldn't want to do that for too long. My fear is that she has become so distant from her true self that she might not be able to come back to her real self. She is so different than who I know she really is right now. It's like she's a totally different person.\n\nSorry for the long post. I just feel so lost and I don't know where to turn to. I feel so rejected by her, although I know she does not intent to make me feel that way. And I'm so scared for her health. She is ALWAYS having some sort of physical ailment that can be related to stress.\n\nTL;DR\nMy fiance's teaching career is taking over her life and damaging our relationship. I've been as supportive as anyone possibly can imo, but now it's damaging her mental and physical health (and her family tree already has tons of horrible mental and physical health problems). I feel like her entire life exists to support her students, and now I'm starting to feel like my entire life exists to support her students too.",
    "title": "I feel so lost (marrying a teacher)",
    "subreddit": "Teachers",
    "timestamp": 1568995848,
    "score": 14,
    "keyword": "woman doctor"
  },
  {
    "text": "Eating Disorder PSAs \n**  HUGE tw/cw for all things associated with EDs (eating disorders) like calories, body image, body weight, etc **\n\nAs someone with eating disorders (2 of them might I add), please allow me to give some insight into students who might have eating disorder problems:\n\n1. \"Oh you put on weight, you must not have an ED anymore!\" NO! That is NOT how EDs work. You can be obese and have anorexia ( or any other ED). You can gain weight and still have an ED.\n\n2. \"Anorexia is only about wanting to be thin\" HELL NO! For many people, it becomes an addiction. \" Just 5 more pounds\" turns into 10 pounds and so on. Because of brain chemistry they become \"addicted\" to the rush and satisfaction of losing weight. They will NEVER truly reach a \"target weight\". For some, it starts as a spiritual cleansing that turns into a dark spiral. For others, it turns into a fear of eating. There are MANY sides to anorexia.\n\n3. \"To the Bone\" is a fictional story on Netflix. It is ONE person's story of anorexia (it's based off of a real person's journey with anorexia). The story is about a young woman who goes to a group home, where the young people (both girls and boys) go to the group home to help cope with their different eating disorders\n\n4. Be wary of \"self help\" ED books that claim to be for \"all EDs\". They really mean they're only for anorexia, bulimia, or purging. There's MANY EDs beyond this (including but not limited to): PICA, nocturnal eating disorder, avoidant restrictive food intake disorder/selective eating disorder (arfid/sed), among others.\n\n5. Nutrition dairy assignments are VERY TRIGGERING for most people who go through EDs. If you have an assignment like this, PLEASE offer an alternative (even if it's just \"write down what foods you eat\" or \"think about the foods you normally eat, how do you think you can incorporate a more healthy diet? \"). \n\n6. Some common hashtags that involve EDs across social media: bonespro, thinspro, pro mia, pro Ana, actuallyanorexic, actuallybulimic, etc.\n\n7. Art therapy, music therapy, and other forms of \"alternative\" therapies are starting to become popular choices to learn to cope with symptoms of EDs.\n\n8. There is NO cure for EDs. You can manage symptoms but that little devil on your shoulder is ALWAYS there.\n\n9. Some EDs symptoms that people don't tend to think about: having panic attacks at the dinner table, having panic attacks at the thought of trying new foods, having a gag reflex when certain tastes or textures hit your mouth or nose, sneaking food by waiting until everyone goes to bed to eat the food they want to eat. \n\n10. Boys can have EDs too. \n\n11. EDs often have other conditions attached to them (anxiety, depression, mood disorders, trauma, hypersexuality or hyposexuality as described clinically,  dissociation, etc).\n\nThere's other misconceptions and fun facts out there, but I see this topic being mishandled SO MUCH across numerous different professional fields (teachers at ALL levels, doctors, therapists, among others). As someone whose been dealing with 2 eating disorders for 10+ years, I am begging you to PLEASE do your own research. Many \"resources\" targeted towards students and/or professionals do so from completely the WRONG angle or perspective. It has good intentions but goes about it HORRIBLY WRONG.",
    "title": "Eating Disorder PSAs",
    "subreddit": "Teachers",
    "timestamp": 1561163351,
    "score": 5,
    "keyword": "woman doctor"
  },
  {
    "text": "HR issued then rescinded a disciplinary notice to me bc they failed to read the dr note I submitted months ago; how protected am I? should I be looking for another job? I really thought this company was going to be a long term company for me. I'm working an entry level position but just started classes to move up in the company (a promotion requires more education). I even applied for tuition reimbursement for the classes I'm taking.\n\n\nI have multiple health issues and checked 'yes' on the \"Do you have a disability?\" question when I was applying for this job. I've been working there for over a year. I was sick for two weeks last year due to smoke inhalation because our area had severe wildfires. I was then placed on a PIP for attendance and told that if my absences were due to medical reasons, I could submit a doctor's note for intermittent medical leave and my attendance would no longer be considered a performance issue. However, I didn't have health insurance until January, so I did not get a doctor's note until a few months ago. I submitted the doctor's note at the same time that I took 4 days of continuous medical leave and the doctor signed one note for both leaves.\n\n\nImportant to note that my manager who was handling the PIP transferred to a different location after I submitted the doctor's note. My supervisor was then promoted to take my manager's place. I had an annual performance review with my supervisor after she got promoted to manager. It was a positive review and I was given a raise. I mentioned the doctor's note at this time and my new manager said she had not yet been made aware of it. I thought that was odd but assumed they were going to fill her in since she had only just been promoted. \n\nThen in July, a friend of mine died very unexpectedly. Stress exacerbates my health conditions and I missed 1.5 days, then another day for her wake. The lead manager at my office was aware of my friend's passing as well as a few other people I had to tell when I called out. \n\nThe next week, I had a meeting with my manager, my brand new supervisor, and a woman from HR who was running the meeting. They placed a disciplinary notice in front of me which I barely had time to read but it had 3 dates listed on it, dating back to my first attendance warning. \n\nI said I had a doctor's note on file for intermittent absences and that I was under the impression that was all that was necessary to satisfy the PIP I had been on. HR said I only had the note for the continuous leave I took, and I told her it was on the same note. When she found it, she confirmed that it was on there and swiftly yanked the disciplinary notice away from me. She then chastised me for \"not keeping my managers in the loop\" and also stated that she didn't know if they could accommodate me based on the leave my doctor recommended. She said she would follow up on the issue.\n\nSince this has happened, my motivation to work has substantially dropped. I was putting in extra hours, volunteering to work shifts that needed coverage, and working on my school work to move up in this company. Now I feel that my head is on the chopping block and they are looking for any excuse to fire me, even the death of a friend. I'm stressed all the time, it's affecting my sleep and my health, it's affecting my job performance, and I'm terrified of calling out. I have one more month before I finish my class and am eligible for the tuition reimbursement that I applied for from the company. I'm trying to stick it out until then at least, but I'm wondering if my intuition is correct and I need to give up on this company and look for a job someplace else. And what happens if they say they can't accommodate my medical needs?\n\nThanks for listening!",
    "title": "HR issued then rescinded a disciplinary notice to me bc they failed to read the dr note I submitted months ago; how protected am I? should I be looking for another job?",
    "subreddit": "careerguidance",
    "timestamp": 1566431793,
    "score": 159,
    "keyword": "woman doctor"
  },
  {
    "text": "Does my pregnant wife have a right to sue if workplace doesn't accommodate for doctored noted medical issues? Morning all:\n\n&#x200B;\n\nI often try to post thoughts on here because I come from a professional career guidance background.  However, one thing I'm not great at is legal stuff and was seeking guidance.\n\n&#x200B;\n\nMy wife's place of work has been pretty smooth for almost 8 years but they've recently had one lawsuit dealing with a pregnant woman claiming she had to work from home, and also another legal issue not relating pregnancy and a worker.  It seems my wife is now being treated massively unfairly due to these issues.\n\n&#x200B;\n\nShe is about 7 months pregnant and has developed a pretty significant issue with her foot to the point we're getting it X-rayed today.  For a month, the pain has continued to get worse, it is becoming more swollen etc.  and I'm sure it's pregnancy related.  However, she has to walk nearly a 1/4 mile from her garage to the office when there's much better parking for frankly, more important people in another garage that's literally in the building.\n\n&#x200B;\n\nWe had a note from her doctor stating she needs a better spot since she can barely walk.  However, after 3 weeks of hee-hawing by her employer, they flat out told her they will not provide a spot and their only solution was forcing her to have to carpool with a supervisor who my wife would have to pick up from my daughters daycare.   \n\n&#x200B;\n\nAs her husband.  I'm livid.  I work close to her office but my schedule is uneven.  One day I can take her, but another day I'm not in the region, or I'm off hours and work until 10:00 PM etc.  Yet they're also stating I should just drive her every day which would impact MY job.\n\n&#x200B;\n\nTL/DR.   My wife's employer refuses to acknowledge doctors orders that my wife needs a better parking spot due to her barely being able to walk.  Is this legal?",
    "title": "Does my pregnant wife have a right to sue if workplace doesn't accommodate for doctored noted medical issues?",
    "subreddit": "careerguidance",
    "timestamp": 1559309778,
    "score": 10,
    "keyword": "woman doctor"
  },
  {
    "text": "Ask for my job back? Or bad idea? So, this probably could get a little lengthy.\n\nSo a few years back, I started a position at a Speciality doctor’s office while in nursing school. I was working there part time, doing administrative type of work (front desk) Checking in patients, collecting co pays, for only about 25-30 hours a week. Nothin’ crazy. \n\nFast forward about three months- one of the Medical Assistants there went out on maternity leave. The office I was at had a lot of the employees “float” to all the different offices throughout the region. And one day, a physician asked if I wanted to assist in his clinic for the day (answer phone calls, schedule outpatient procedures, check out patients after consults) I was all over it! That one day turning into a month, than a year, than I had officially ranked up enough hours for my internship through him to receive my Medical Assistant Certification. I loved it! J loved it so much, I decided to put nursing school on the back burner and work full time as his MA. I was learning SO much and was getting hands on experience that I just couldn’t pass up, and I genuinely loved my job. \n\nSo... then, me being in that position for about a year, ( also the doctor I was working for the President of the company, he is the busiest, with the most patients, and by no means was my job slack to put it that way ) Anyway, I then find out that they had hired a new Clinical Operations Manager, aka: I had a new boss. Everything seemed great at the beginning, she always care to me if she was unsure of something, was always asking for my advice, she was just going the extra mile so it seemed. Then, I went on vacation for a week with my family (this was requested off literally a year prior so it wasn’t like a spur of the moment thing) I come back ready to work, and I see a note on my desk, stating to come and talk to “my new boss” I didn’t think anything of it, I walked up to her office, sat down, and she said that I was getting written up for having “unsent mail” in my desk while I was gone. \nUhhhhhhh...\nWhat??????????? \n\nFor one: Why in the world was this woman going through my desk? I mean there’s just absolutely no reason for that. I can’t think of one at least. That’s for sure. \nAnd for two, which I argued this point, that there was no patient name on the envelope, (I could understand a HIPAA violation or something, but no, didn’t do that. I explained to her that these patients actually came into the office and I gave them their instructions in person rather than mailing because they were nervous for their upcoming procedure and wanted to make sure they understand things clearly. \n\nNope. She still made me sign that piece of paper. I got written up. I was honestly devastated. I had no other issues what so ever at this job, and I was just so confused. \n\nThe following week, I get called up to the office again, she states that I sent something in the computer wrong, (I cant really get into details details) but, the moral of the story was; the rule was the entire time that I had been employed there that it was our responsibility to do this task, but apparently this was suddenly changed and NO ONE was aware of it, because as soon as I left her office, I asked a colleague if she was aware in normal conversation. And she said no. Well, she wrote me up for this too!!!! I was like what is happening. \n\nTwo weeks later, I am rushing out the door for work to take my new puppy to day care while I’m at work, he runs off, and he gets hit by a car... thankfully he did not pass away but he did have to have surgery. I called my job right away and told them what happened. They said “ok. So are you going to come in today?” I was like.... uh.... I mean I didn’t plan on it, I am at the vet, my dog literally just got ran over my a car. “ and she was like “ ok well just I guess let me know how everything goes” and I said ok. Well we were at the vet all day and night that night, and I didn’t even think of calling her again throughout the day. I managed to pull myself together and go to work the next day, and everything seemed... fine. \n\nThe next day, I go into work, I walk in, and have my boss, and my former boss I guess you could say. (The new one pretty much took the others jobs, but said they were “splitting the duties” idk, they never got along it seemed like to me) I was like Hello! How are you guys? And they both kind of looked at each other, and said we need to speak with you, I was like... okay.... \n\nI walk into my doctors exam room, and they both sit down, and say, “ I’m sorry but we are going to have to let you go” \n\n\nI sat there in literally pure freaking shock. I truly did not believe that this was happening. I looked at them both and was just like what? How? Why? My old boss just kind of tucked her head down and looked at my new boss. My new boss stated: “ you have had 3 write ups and it is company policy to terminate you. “ I said wait what 3?? When was the 3rd? She then proceeds to say that, I never let her know if I was coming into work the day the my dog got into his accident. \n\nWhen she said that, I was furious. I could not believe that they were writing me up for something so out of my control, it all seemed so unfair. I literally ran out of the office in complete tears and was majorly depressed over this for months and months. \n\nFast forward a year later- I went back to school in the mean time, and have been just serving/bartending on the side. I came to find out yesterday that, my “new boss” no longer works for the company I had worked for anymore, and had went back to her old job. I was SHOCKED. This lady seemed to live breathe and die this company so I truly couldn’t believe it. Than, I got to thinking- \n\nMaybe I should ask for my job back? \nI mean the worst they could say is no? \nMy ONLY problems in the work place unfortunately revolved around that woman. If she is no longer there than, maybe I can get a second chance? Do you think I should send an email to my “old boss” that is still working for the company, and explain that with her being gone (she saw what she did to me first hand) I think that I could really thrive and make the company a better place. My job was extremely fulfilling for me and I just haven’t been the same without it... \n\nAny advice would be MUCH appreciated",
    "title": "Ask for my job back? Or bad idea?",
    "subreddit": "careerguidance",
    "timestamp": 1564495428,
    "score": 1,
    "keyword": "woman doctor"
  },
  {
    "text": "Why are Black women expected to be strong through it all? I recently read that Black women’s pain and suffering is desensitized due to the stigma of the “strong black woman” and I agree. There was a study saying doctors are less likely to believe black women when we say we are in pain resulting in misdiagnosis sometimes. Recently, I had a bad cold and took two days off work to get better. Plus, I just didn’t feel well. I had people tell me, “I’m strong, I could have made it at work.” Even my husband said “you could have went in.” I was like why? That’s why I have sick leave. Of course, I would have made it without dropping dead but if I’m sick, I should not be expected to be strong and tough it out. Black women experience pain and that must be recognized. Ladies, take the time you need to heal and if a doctor is waving off your pain, be forceful or choose another one. \n\nSorry for this morning rant.",
    "title": "Why are Black women expected to be strong through it all?",
    "subreddit": "blackladies",
    "timestamp": 1551360564,
    "score": 329,
    "keyword": "woman doctor"
  },
  {
    "text": "Just needed a place to rant This might not have anything to do with my experience as a black woman but I just needed a place to rant. I call my insurance up and asked why they denied my claim. Answer: The doctor wrote that your diagnosis was overweight. How can that be a diagnosis when all I come in for was severe pollen allergies . Is overweight even a diagnosis? No it’s not you need to contact the hospital billing on this. Ok but even if I am overweight is that why the claim was denied. Answer: obesity is not an illness. I felt like slapping the  customers service rep through the phone. It was like once she saw the overweight comment she just stopped being polite. Almost like I was no longer deserving of respect. Why would my doctor even make that kind of mistake. I know it’s not in my place but I will call the office tomorrow and express my displeasure. I don’t care if I weighed 600 pounds. They should not have put that there. Honestly when I went to the doctors I could sense the undertone of judgement from her despite the fact the my BP was normal. Almost like she was looking for symptoms to be like aha . That’s why you should loose weight.  Like  and this is really vulnerable but if I could I would . I have tried all diets and all and I have settled on that I cannot be healthy unless I am happy. And I am not in a position to be happy at this moment in my life. So can I just get through this miutherfucking period without anyone making me feel worse. Like people are the worst.  Also, I thought really bad things about her and I did not feel even a little sorry.",
    "title": "Just needed a place to rant",
    "subreddit": "blackladies",
    "timestamp": 1569289011,
    "score": 57,
    "keyword": "woman doctor"
  },
  {
    "text": "Black Female Teachers/Professors Who Made Your Life Better I'm going to visit some college friends in a few weeks, and I'm hoping to reconnect with a professor I had in my last two years of school.  She really put in the work to look out for her students and she made sure to connect with her black female students outside of the academic setting.   I have a laundry list of things she's done for me and other students, including but not limited to setting up special events to get to know the black female students on campus, taking students to go see movies that pertained to her class material, opening up specific office hours to allow students to discuss special projects with her, and offering to drive me to a doctor when I couldn't get my team trainer to help \\*\\*\\*.  I'm trying to make plans to get coffee with this woman, so it got me thinking about all the other wonderful black female educators who must be out there.  Does anyone have stories to share?",
    "title": "Black Female Teachers/Professors Who Made Your Life Better",
    "subreddit": "blackladies",
    "timestamp": 1557640639,
    "score": 21,
    "keyword": "woman doctor"
  },
  {
    "text": "Trigger: When white people say you're limited in your career and relationship because you're black... Trigger: When white people say you're limited in your career and relationship because you're black...\n\n&#x200B;\n\nIt is soo triggering and offensive to me when people ESPECIALLY white people tell me, I am only going to get so far because I am black (or mixed with black.. I'm half black and half white).\n\nI remember working at this day care job where some racist white women were jealous this white man liked me. I remember I told one of the girls I was interested in bartending at this one bar and she told me, I shouldn't go there because they are racist. She was jealous that I could probably make a lot of money bartending so she used my race to basically put me in my place and to dissuade me from working there. \n\n&#x200B;\n\nI remember a tennis coach in high school told me  that sadly Obama was not going to make it as president because he was black but he was still going to vote for him though. Why the heck would you think it is okay to tell another black person that?? Not compassionate. How about saying, Obama will have to work harder because of the racism in this country, but with hard work he can reach his goals?!\n\n&#x200B;\n\nThen in college, a random stranger told me to forget about acting because it is hard industry and he said they may not want you at at times for different reasons like they may not want a black girl. Then he started hitting on me. What the heck?! Again, I know it is harder in the industry for minorities, but how inappropriate that he felt he could say this to me.\n\n&#x200B;\n\nWhen I was in elementary school, my white father told me to be careful of white guys because a lot of them wouldn't take me seriously and might only want to have sex with me. Very traumatizing, he definitely should not have told me that as a child. While there was some truth to what he said, I don't think it was in his place, as the white person, to tell me that. I know he was just trying to protect me but it was very traumatizing and unnecessary to tell me at such a young age. When people say these comments to me it feels like they are rubbing it in my face as well. Then, I want to become a nautropathic doctor and I told my dad, it will be harder for me because I am a black woman in field to get clients, and he nodded his head and tried to get me to change my career. \n\n&#x200B;\n\nThen if you look on the youtube comments on the Bachelor, you will see some comments about how they only are keeping the black girl on there so they do no appear racist. \n\n&#x200B;\n\n Of course it is hurtful and hard to hear about some hardships I will have to go through because of racism. Now I am not saying all these white people's comments aren't valid to a certain extent. But it is angering when white people feel they have to teach me and tell me about the hardships I will have to go through as a mixed black woman when they haven't even had the black experience!! Also, it is wrong to tell a person to not try something because it will be harder for them to make it because they are not white. There would be no Obama, Halle Berry, or Oprah if they listened to these people who told them to stop trying because they won't make it because they are black. All these comments have definitely affected my self-esteem. I am definitely suspicious of white men who hit on me and be very anxious during job interviews and other aspects related to my career because I have in the mind being black will hinder me. I need to change my mindset to  an empowered one where I can view hardships of racism as a way I can become my better self and work harder and prove to myself and others I can do anything I can put my mind to!\n\n&#x200B;\n\n&#x200B;\n\nUGH, OMG! Anyone else experience this?",
    "title": "Trigger: When white people say you're limited in your career and relationship because you're black...",
    "subreddit": "blackladies",
    "timestamp": 1552499411,
    "score": 19,
    "keyword": "woman doctor"
  },
  {
    "text": "Do you have the pass code? Y'all. \n\nThis is a rant about a bad experience I had at a doctor's (naturopath) office today.\n\nI needed some records from an ND I had seen a couple years prior. I drive to her office and was told the she moved to a new location on the \"north end.\" Already I feel a little uneasy because the north end around here is predominately white and \"up scale\" if you will. I Google map the address and go the new location. It looks like a normal house and not an office building, but I see the sign with the doctor's name on it. The door is locked, but I see a little old Asian woman inside, so I gently knock on the door.\n\nThe woman let's me inside and I ask her which room is Dr. Naturopath. She then proceeds to ask me if I have the pass code. I ask what pass code. She responds that you are supposed to have pass code to get in, and wants to know who gave me the pass code. I tell her I don't have one as I've never been here before. Next she says she's unsure if she's supposed to let me in, which is VERY strange because I'm already inside. She let me in. Does it make sense to let someone in if you're not even sure if its ok?\n\nI tell her I was just there to pick up some of my medical records, but she starts slinking away from me and looking unsure. I politely repeat what I'm there for and tell her that I've never been here, so I didn't know there was a pass code needed. I ask her what her name is, thinking maybe this isn't even the office manager/receptionist and she hesitates. She didn't want to give me her name. Why was she afraid to give me her name? If you were this afraid about someone, why let them in the office/house in the first place? Feeling awkward and that I somehow need to prove to this lady that I'm not some hoodlum serial killer, I introduce myself and hold out my hand, she slinks back further. Now I'm getting pissed off. I tell her I'm not a bad a person, that I'm a previous patient of the doctor and just here to get some records. She replies with an old lady \"sorry,\" and I walked back to a random room and thankfully it was Dr. Naturopath's office. I told the doctor what happened and she just laughed nervously and said sorry. \n\nSome people might just think that the little old lady didn't have good people skills. I don't think it was that at all. Damn.",
    "title": "Do you have the pass code?",
    "subreddit": "blackladies",
    "timestamp": 1571797677,
    "score": 16,
    "keyword": "woman doctor"
  },
  {
    "text": "Ya'll, my customer service Persona has been tested to the upmost Bare with me ya'll, I just need to vent for a moment at the extra levels of foolishness I've been dealing with at work. \n\nOn one side we have Passive Aggressive Mom™. We have digital records of each child's day, and I'm not entirely sure how she manages to get any work done for as hard as she stalks her child's report. Any time we are late with *any* update, she is messaging us. And if we don't message back immediately, she is calling the center. We have explained to her several times before, there are almost a dozen babies under the age of one and two teachers: we don't always have time to update the site immediately but your child is being taken care of. For the level of care she desires and the apparent amount of downtime she has at her own job, she really should just quit and keep her child at home, but that's none of my business. My coworker is very much done with Passive Aggressive Mom's particular brand of bullshit, so I have taken up the mantle, putting on my best customer service voice to answer numerous questions, suggestions and comments.\n\nThen there's Taylor Swift .2. From the moment I met her, she just rubbed me the wrong way. Now I checked myself: I had no reason to not like this girl. So I tried being nice and polite, never got much of a response, so I left it alone. I'm here to pay my bills at the end of the day. However, she would make these small comments that irked me. \"Suggestions\" that she never seemed to give anyone that I never asked her for. I'll ask my co teacher because I recognize that although I'm the Lead for the room, she has worked here longer and knows these parents better than I do. So I differ to her. Taylor Swift? Ma'am, I didn't ask you and you're still in training for the position you want, so regardless of whether you've been here longer than me please have several seats.\n\nNow Taylor Swift has an obvious favoritism for you guessed it: Passive Aggressive Mom's child, CP. Now I dont fault her for this: I have my favorites too. However, what I do fault her for is going behind my back to our boss because she had a problem with how I fed CP.\n\nNow, CP started on baby food months ago, however, he still doesn't know how to eat. As soon as the food hit his mouth, he pushes it back out with his tongue. I would honestly have talked to his mom about maybe getting it checked out, but given the level of passive aggression I'm already dealing with, coupled with the fact that every third sentence out of her mouth begins with \"Their doctor..\" , I've decided that's not my battle. However, feeding him is an exercise of futility that often takes about half an hour for the smallest container you can imagine. Added to the fact that Passive Aggressive Mom sends him in with smoothie like mixtures of combos like bell pepper and applesauce, we've simply decided the easiest way to feed him is to put it in a bottle.\n\nSo we've been doing this for a hot minute, however, CP was being particularly fussy. But I knew that if he didn't eat, his mom was gonna send me a message about it. So I was pushing forward when Taylor Swifts makes one of her suggestions about the situation. Ma'am, do you think I would be sitting here getting my ear drums busted out if I thought alternative conversation with his mother would be less painful? But I let it go, got him to eat most of it and moved on.\n\nUntil my boss came in a little while later telling me that I couldn't feed him food with a bottle anymore, regardless of what his mom would complain if he didn't eat.....Ma'am, you've never seen me feed him with a bottle, so my question is.... Who told you that? \n\nNow, could it have been one of the other two girls who complained? Sure. But Taylor Swift left the room *mighty* quickly with CP after our boss came to talk to me about this. And she did happen to be on break right before our boss came in to talk to me, which would've been a perfect time to discuss some \"concerns\" she had.\n\nBut I guess we're not gonna talk about how just the other day, the whole room sat through Taylor Swift feeding yogurt to a baby while she screamed bloody murder the whole time cause she's also a fussy baby?\n\nOn the plus side, I have all weekend to decide the exact level of professional petty I'm gonna be on next week and I finally have a justified reason not to fuck with her. So thanks Taylor Swift.\n\nTldr: White woman foolishness at the workplace has struck again.",
    "title": "Ya'll, my customer service Persona has been tested to the upmost",
    "subreddit": "blackladies",
    "timestamp": 1553890730,
    "score": 13,
    "keyword": "woman doctor"
  },
  {
    "text": "Chemical peels for black women (skincare) Hello everyone!\n\nI’m very depressed about my skin. I have dark acne marks and I’m growing unnecessary hair on my face. I did a test and it has been confirmed that my hormones are imbalanced.  \n\nI know I have to go to a doctor to rectify it but I need to at least deal with the marks on my skin. I began electrolysis treatment and I’m having PIH (post inflammatory hyperpigmentation) from it.  So my skin is really at an all time low.\n\nI was told a chemical peel would solve my problems but I’m so scared of making it worse because I read it can also give you more pigmentation especially as a black woman. I live in Eastern Europe so they really don’t know much or anything about black skin.\n\nHas anyone gotten a peel here? Please share your experiences both positive and negative. Any suggestions as to what peels I should ask for or even alternatives to a peel would be appreciated.\n\nThanks y’all!",
    "title": "Chemical peels for black women (skincare)",
    "subreddit": "blackladies",
    "timestamp": 1570438980,
    "score": 14,
    "keyword": "woman doctor"
  },
  {
    "text": "Plastic Surgery Hi ladies, does anyone have experience with breast reduction as a black woman? I want to find a doctor that works with black woman and specializes in scarring. Or does it even matter?  Currently a “k” Cup looking to go down to a “d” or smaller if I can.",
    "title": "Plastic Surgery",
    "subreddit": "blackladies",
    "timestamp": 1570400499,
    "score": 9,
    "keyword": "woman doctor"
  },
  {
    "text": "Who was the first black woman to earn a doctorate in any engineering field? Hey, guys, I’m trying to choose a topic for a paper in a class I’m taking that has an emphasis on civil rights. I was wondering if any of you know who the first black woman to earn a doctorate in any engineering discipline was.",
    "title": "Who was the first black woman to earn a doctorate in any engineering field?",
    "subreddit": "blackladies",
    "timestamp": 1567131133,
    "score": 8,
    "keyword": "woman doctor"
  },
  {
    "text": "I call Bullshit on the False rape accusation sticky from Mens Lib sub. Actual lies are being told.  \n\n>Fact Checking False Rape Accusations and Why We Shouldn't Fear a False Rape Epidemic.  \n>  \n>📷  \n>  \n>One of the main resistance to changes in how police and society handle Rape, Sexual Assault and even Harassment is the counter argument that men then would be plagued by False Rape accusations. The fear is always that we crossed some line that no longer allows reasonable doubt and that one man life can be sent to jail by one accusation. We of course have seen stories of such things in the news and everytime we question wither these are isolated stories or a sign of a larger epidemic we don't get to see. When does the drive of combating rape go to far? Is it an issue to fear?  \n>  \n>So how common is this issue? Is it really a threat to men? How many false rape accusations are there?  \n>  \n>How Many False Rape Accusations are there?  \n>  \n>[Most experts agree that false rape accusations make the total of 2-10% of the total accusations of rape.](https://www.nsvrc.org/sites/default/files/Publications_NSVRC_Overview_False-Reporting.pdf) As quoted from the handbook  \n>  \n>A multi-site study of eight U.S. communities including 2,059 cases of sexual assault found a 7.1% of false reports (Lonsway, Archambault, & Lisak, 2009).  \n>  \n>Link to it here --> [http://www.scirp.org/(S(i43dyn45teexjx455qlt3d2q))/reference/ReferencesPapers.aspx?ReferenceID=1238871](http://www.scirp.org/(S(i43dyn45teexjx455qlt3d2q))/reference/ReferencesPapers.aspx?ReferenceID=1238871)  \n>  \n>[A study of 136 sexual assault cases in Boston from 1998-2007 found a 5.9% of false reports (Lisak et al., 2010).](https://www.ncbi.nlm.nih.gov/pubmed/21164210)  \n>  \n>[Using qualitative and quantitative analysis, researchers studied 812 reports of sexual assault from 2000-2003 and found a 2.1% of false reports (Heenan & Murray 2006).](https://www.ncjrs.gov/app/abstractdb/AbstractDBDetails.aspx?id=243182)  \n>  \n>And why not add some more papers to the mix.  \n>  \n>[2017 Study into the FBI Database found that between 2006 to 2010 the Average number of false rape accusations or baseless accusations was 5.55%, and robbery had a higher false and baseless accusation rate of 5.76%](https://www.researchgate.net/publication/315728247_The_Prevalence_of_False_Allegations_of_Rape_in_the_United_States_from_2006-2010)  \n>  \n>[Another metastudy by Claire E. Ferguson, and John M. Malouff published in December 17th, 2015 put the number of False Rape Accusations at 5%](https://link.springer.com/article/10.1007/s10508-015-0666-2)\n\n&#x200B;\n\nSo keep in mind that ALL of these numbers are minimums. These all represent the number of false rape accusations made to the police that provably false using rigorous standards. \n\n&#x200B;\n\n And while it may be small, the 2-10% is actually 2-11%. They round that 2.3% number down to 2% so it's only fair to round the 10.9% up to 11%. You can either say 2.3%-10.9% or you can say 2-11%. It's a small thing but it irks me. \n\n&#x200B;\n\nBut all of these numbers are minimums. Just like when 3-5% of cases end up with convictions. That means a minimum of 3-5% of rape cases taken to the police are true. A MINIMUM.  \n\nThis three minute youtube sums it up very well. \n\n[https://www.youtube.com/watch?v=I8zSDvaYrRw&list=LLIiza3uxnPBzZKoXthGOenQ&index=9&t=0s](https://www.youtube.com/watch?v=I8zSDvaYrRw&list=LLIiza3uxnPBzZKoXthGOenQ&index=9&t=0s) \n\n&#x200B;\n\n&#x200B;\n\n>Now I know that 2-10% is alot and enough to give anyone pause considering how epidemic sexual assault is. But consider a few things.  \n>  \n>[1 in 6 of women report they have been sexually assaulted.](https://www.rainn.org/statistics/victims-sexual-violence)\n\n&#x200B;\n\nIf you check the link it takes you to Rainn. The 1 in 6 women will be rape in their lifetime comes from where? I checked the footnote. Oh it's from...\n\n National Institute of Justice & Centers for Disease Control & Prevention, Prevalence, Incidence and Consequences of Violence Against Women Survey  \n\nThis is the precursor to the CDC NISVS survey. Guess what the CDC NISVS survey also found? It found that for years of 2010-2012 female-perpetrated \"made to penetrate\" sexual assault on men, (rape, for lack of a better word,) was at parity with male perpetrated rape for these years. Let that sink in for a minute.\n\nWhen you are done letting that sink in, ask yourself why a sub called r/menslib is not mentioning that in 2012 there were over 1.5 million instances of female-on-male rapes according to the CDC NISVS survey in 2012? (Although they don't call it that, but prefer the more awkward, \"made to penetrate\" sexual assault) '\n\nThis links to the CDC NISVS survey data so you can check for yourself. The lifetime stats are much lower than the year over year and despite my inquiries to the CDC I have not gotten an answer as for why that is. However, for each year of 2010, 2011, and 2012 we find parity between the sexes for sexual assault/rape perpetration. Look at the 12 month data.\n\n&#x200B;\n\nThis blog does a very good job of breaking this down:\n\n [https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) \n\n&#x200B;\n\n>Only a 1/3rd of sexual assaults are reported to police. So at its 2-10% of 33%  \n>  \n>This statistic covers if or not an accusation is false, wither or not a specific suspect is named which I will show below is a more interesting stat. The majority of false rape accusations are made against non existent strangers the victims claim they don't know.\n\n&#x200B;\n\nThis is a nice rabbit pulled out of the hat. Why are we assuming that all of the sexual assaults not reported to the police are true? I for one have been the collateral damage victim of a false/baseless rape accusation made on social media. Ostensibly, rape accusations that are not taken to the police and are merely posted on Twitter, Facebook, or added a circulating anonymous rapist list, or made at a bar, or something... are MORE likely to be false. Not less. Yet this author would have you believe that they are all 100% true. Magic! \n\nOf course there are many rapes that happen that are never taken to the police. For example, the 1,5 million incidents of female on male \"made to penetrate\" rape that I mentioned above. Almost none of these are reported. Less than 1 percent. These male victims of female perpetrators are hidden by systemic cultural bias.\n\n&#x200B;\n\n>Soo how many false rape allegations lead to false arrests and convictions then?  \n>  \n>How many people Falsely Accused of Rape actually go to Jail?  \n>  \n>Thankfully we found that the answer is very low.  \n>  \n>[National Registry of Exoneration who keeps track of how many innocent people have been... well... exonerated found that since 1989 in the US ~~52~~ people have been exonerated for sexual assault that they didn't do. People exonerated on false accusations of Murder was 790 people.](http://www.law.umich.edu/special/exoneration/Pages/browse.aspx)  \n>  \n>  \n>  \n>  \n>  \n>Note: Innocent Project has listed 276 exonerated with Sex Crimes, this is the highest number I can find. Thanks [/u/MealReadytoEat\\_](https://www.reddit.com/u/MealReadytoEat_/)  \n>  \n>[British Home Office did a detailed study and report on the issues of false rape accusations in 2005 and found that out of the 216 cases of rape that was false in the UK, 126 of them have a formal complain filed by the accuser, **39 of them had a named suspect** and only 6 of them were arrested. Out of the 6 arrested only 2 have charges and **0 of them had a conviction.**](http://webarchive.nationalarchives.gov.uk/20100408125722/http://www.homeoffice.gov.uk/rds/pdfs05/hors293.pdf)  \n>  \n>[Another Study by the University of Pittsburgh found that only 18% of False Rape Accusastions name a suspect](https://search.proquest.com/docview/1900298026?pq-origsite=gscholar)\n\n&#x200B;\n\nNevermind the fact in 1996 the FBI backtested over 25,000 rapekits and found that 1 in 4 excluded the primary suspect, in almost all cases, as fingered by the primary witness/alleged victim.\n\n  [https://www.ncjrs.gov/txtfiles/dnaevid.txt](https://www.ncjrs.gov/txtfiles/dnaevid.txt) \n\n*Conducted in June 1995, the nationwide telephone survey of 40 public and private laboratories that performed DNA tests sought answers to such questions as: From the time the laboratories began DNA testing, how many cases have they handled? Of that number, what percentage yielded results that excluded defendants as sources of the DNA evidence or were inconclusive?*\n\n  *The 40 surveyed laboratories yielded 19 whose available data were sufficient for the purposes of this study. The 19 included 13 at the State/local level, 4 in the private sector, an armed forces laboratory, and the FBI's laboratory.*  \n\n*Most of the laboratories had initiated DNA testing only within the previous few years. Twelve began testing between 1990 and 1992. Three of the four private laboratories began in 1986 or 1987, while the FBI started DNA testing in 1988.*  \n\n*Seven of the laboratories reported using RFLP testing; four, PCR testing; and eight, both types of tests.  The 19 laboratories reported that, since they began testing, they had received evidence in 21,621 cases for DNA analysis, with the FBI accounting for 10,060 cases. Three of the 4 private laboratories averaged 2,400 each; the State and local laboratories averaged 331 each.* \n\n ***In about 23 percent of the 21,621 cases, DNA test results excluded suspects, according to respondents****. An additional 16 percent of the cases, approximately, yielded inconclusive results, often because the test samples had deteriorated or were too small. Inconclusive results aside, test results in the balance of the cases did not exclude the suspect.*  \n\n***The FBI reported that, in the 10,060 cases it received, DNA testing results were about 20 percent inconclusive and 20 percent exclusion; the other 18 laboratories (11,561 cases) reported about 13 percent and 26 percent, respectively.\\**** \n\n *Unfortunately, the laboratories were unable to provide more details. They did not maintain data bases that would permit categorization of DNA test results by type of offense and other criteria. What happened to the suspects who were excluded through DNA testing also cannot be determined. Were they released, or were they charged on the basis of other evidence, for example?  Thus, only the most general information is known about the results of DNA testing by laboratories. To  obtain more detailed information would require a comprehensive research project.*   \n \n\nThat's hard forensic data that puts the ballpark figure of false rape accusation at about 1 in 4. Now to be fair, some of these may have been genuine mistaken identity. But if you are the man under arrest by the police accused of rape, you would call that a false rape accusation.\n\n&#x200B;\n\n&#x200B;\n\n>Fact is that the majority of false rape accusations don't even name a suspect. And throwing this into the picture of the total of the numbers of rape really proves how rare false rape **Convictions** are. Vast majority of false rape accusers always accuse a non existent stranger who raped them and usually not someone specifically. Which means that beyond wasting time and resources majority of false rape accusations are harmless to the general public because no one person is accused.  \n>  \n>When you take these studies and add them to what we already know about rape a more complete picture forms:  \n>  \n>1/6 women claim to have experience sexual assault, follow by a 1/3 reporting the assault to police, then **worst case scenario** 1/10 are false. Out of those false rape accusations 9/50 name a suspect, out of false rape accusations that accuse someone 15/100 get an arrest and, out of those who are arrested for a rape they didn't do only 1/3 have charges placed against them.\n\n&#x200B;\n\n**This is so wrong as to be a lie. Remember, according to Dr. Lisak's metastudy, a minimum of 2-11 percent of all rape accusations taken to the police are PROVEN to be false.** \n\n&#x200B;\n\n>So 1/6 x 1/3 x 1/10 x 9/50 x 15/100 x 1/3 = 0.00005  \n>  \n>Which mean out of all the women you meet you have a **0.005% chance of being falsely charged of Rape.**\n\n**A blood vessel in my frontal lobe just exploded. I can't even begin to understand what the heck he is doing with the numbers here. Can anyone help me out with this. Like I have a headache just from trying.** \n\n&#x200B;\n\n>Compare this to the fact that [6.4% of men openly admitted of committing the strictest possible definition of rape](https://davidlisak.com/wp-content/uploads/pdf/RepeatRapeinUndetectedRapists.pdf) and 23% of that 6.4% admitted of multiple rapes.\n\n&#x200B;\n\nThis link is dead. But let's look at a couple other studies that look at the number of people openly admitting to committing rape. \n\n Hogben, Byrne & Hamburger (1996) Lifetime prevalence of 24% for women having made a man engage in sexual activity against his will \n\n[https://www.tandfonline.com/doi/abs/10.1300/J056v08n01\\_05](https://www.tandfonline.com/doi/abs/10.1300/J056v08n01_05)\n\nSexually Aggressive Women  **Anderson, Struckman-Johnson 1999** – 43% of college women admitted to using verbal or physical pressure to obtain sex  (No ebook available. I've ordered a print copy in the mail but it won't arrive for another week.)\n\n [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6245084/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6245084/) \n\nI'm just saying, there is one half of the equation being left out here. It is likely the smaller half. But why are we still pretending in 2019 like it doesn't happen? It happens all the time. Go check out r/teacherswhorape for a daily update of female pedophiles.\n\n&#x200B;\n\n&#x200B;\n\n>Why False Rape Accusations happen?  \n>  \n>Many people who fear False Rape Accusations claim that women in the work force will make a False Accusation against a man in a higher position, or a student who is going to fail an exam will accuse a professor, or rape or that a vengeful ex, or a woman who regretted sex later.  \n>  \n>But the realities of this is very surprising.  \n>  \n>[According to a review done by the LAPD found the reasons for a False Rape accusations is unwanted pregnancies or more commonly \"Missed Curfews\" by young teenagers. It turns out that 55% of False Rape Accusations according to this review are for hope of getting medical care or psychiatric medication by the very poor and destitute](https://www.ncjrs.gov/pdffiles1/nij/grants/237582.pdf)  \n>  \n>[Also it is noted that half of the False Rape Accusations are made by Parents of children.](http://www.d.umn.edu/cla/faculty/jhamlin/3925/4925HomeComputer/Rape%20myths/Police.pdf) Either by pressuring the child to go to the police or accusing someone of rape without the child knowing. It is also important to note that the rare Serial False Rape Accusers tend to have a history of being a legitimate victim Sexual Abuse as a child.  \n>  \n>As this shows that the False Accuser the majority of the time aren't the serial accusers we hear on the media nor are in tech jobs, nor college students who regret sex. Instead it is usually either the very poor looking for free medication, teenagers trying to get out of trouble and parents of children who make the vast majority of False Rape Accusations.  \n>  \n>Also there are no corolations with the age of the accusation or the number of sexual partners of the accuser and wither their accusations are true or not. Add this to the fact that [most legitimate victims lie to themselves and others saying that they weren't sexually assaulted when they really were. This denial often is due to the fact that the majority of victims know their abusers personally before the assault and often change their stories or denied that they were as a way to cope the trauma.](http://journals.sagepub.com/doi/pdf/10.1177/0886260517726412?casa_token=TR0lDTFQ-9cAAAAA%3AXFQbcARRx9QC1UnefnGp3FIc0pMTR4K5X-49EvzFMnXxeQxUba98DKlj4DcWjJOvFeihHXQTGwd5Vw&) I can personally attest to that.  \n>  \n>Special thanks to [/u/ILikeNeurons](https://www.reddit.com/u/ILikeNeurons/)\n\n&#x200B;\n\nWhy does he leave out De Zutter(2017)? [https://www.researchgate.net/publication/313830325\\_Motives\\_for\\_Filing\\_a\\_False\\_Allegation\\_of\\_Rape](https://www.researchgate.net/publication/313830325_Motives_for_Filing_a_False_Allegation_of_Rape) \n\nReasons for a false rape accusation:\n\n* Material gain: to receive money, [professional promotion](https://en.wikipedia.org/wiki/Promotion_(rank)) or other material benefits.\n* Producing an [alibi](https://en.wikipedia.org/wiki/Alibi): a false allegation is used to cover up other behaviour, such as being late or absent to an appointment.\n* Revenge: to retaliate against a disliked person by damaging the reputation, freedom or finances.\n* Attention: an attempt to receive any kind of attention, positive or negative, by anyone.\n* Sympathy: a special kind of attention-seeking whereby the complainant tries to improve a personal relationship with a specific individual.\n* 'A disturbed mental state'; this may include false memories (\"sexual hallucinations\") or pathologic lying.\n* Relabeling: consensual sex is relabeled 'rape' to the police, because of its 'disappointing or shameful character'. De Zutter et al. argue that a distinction should be made between some acts during a consensual sexual encounter that a participant did not want or had no desire to engage in but nonetheless gave consent to (e.g. to please their partner) on the one hand, and rape (nonconsensual sex) on the other, but that many lay people and even some scholars do not make this distinction and confuse the two. It is often when accounts of such 'unwanted consensual sex' are told to friends and family that the latter interpret it as rape, and put the complainant under pressure to file an allegation.\n* Regret: after having had consensual sex, a complainant experiences negative feelings such as disgust, shame, and sorrow; when others notice this and ask about the source of these negative feelings, they are prone to view the encounter as rape and put the complainant under pressure to file an allegation.\n\n### 'Don't know'\n\nAccording to De Zutter et al. (2017), 20% of complainants said that they did not know why they had filed a false allegation.[\\[8\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-Zutter2017-8)\n\n&#x200B;\n\n While we are at it, wikipedia also lists false memories as a reason for a false rape accusation. \n\n### False memories[[edit](https://en.wikipedia.org/w/index.php?title=False_accusation_of_rape&action=edit&section=2)]\n\nThere are several ways in which an alleged victim can accidentally come to believe that they have been raped by the person(s) they accuse. These include, but are not limited to:[\\[7\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-French-7)\n\n* [Recovered memory therapy](https://en.wikipedia.org/wiki/Recovered_memory_therapy): memories of sexual abuse 'recovered' during therapy in the absence of any supporting evidence, based on the [Freudian](https://en.wikipedia.org/wiki/Sigmund_Freud) notion of \"[repression](https://en.wikipedia.org/wiki/Repression_(psychology))\"[\\[7\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-French-7)\n* The victim's confusion of the memory of the real rapist with the memory of someone else\n* [Memory conformity](https://en.wikipedia.org/wiki/Memory_conformity): memory can become contaminated when co-witnesses discuss their recall of events\n\n&#x200B;\n\nLet's not forget that in the UK, \"alleged\" rape victims are paid in cash regardless of whether the accused is found guilty or not.  \n\nJemma Beale collected 11,000 pounds before being caught. That's a hell of a side gig.  falsely accused nine men of raping her on separate occasions, while a further six had supposedly sexually assaulted her.  \n\n[https://thewarrzone.blogspot.com/2019/03/the-hard-lessons-of-jemma-beale.html](https://thewarrzone.blogspot.com/2019/03/the-hard-lessons-of-jemma-beale.html) \n\nShe is unique in that she is one of the rare false rape accusers to be prosecuted. \n\n&#x200B;\n\n&#x200B;\n\n>Why didn't you include those other \"Studies\"?  \n>  \n>Since I am from the future I know this will be bring up sooo I will nip it in the butt before it shows up in the comments. And if they still show up without talking about this section of my effort post you have my permission to shame them.\n\nSmall thing, but the saying is \"nip in the bud.\" Like a plant. Shame is how feminism works, right? They shame people into submission. Like #metoo. If you stand up to a false rape accusation they shame you as a RAPE APOLOGIST. \n\n&#x200B;\n\n>People who fear the False Accusation \"Epidemic\" that is supposedly happening like to point to the \"other studies\" on these issues. What are these other \"studies\" and why don't I use them in my analysts? Well because they are bad. Flat out bad or rely on a misconception of the nature of sexual assault. And there are alot of them. Lets take sample out of the list Wikipedia provided.\n\n&#x200B;\n\n>[Also these studies expose a much larger issue when it comes to research into sexual assault.... What is Sexual Assault and what is False Sexual Assault. When you look at studies the older ones tend to have uhhhhhh questionable views of what is and isn't sexual assault.](https://www.cambridge.org/core/services/aop-cambridge-core/content/view/CA29549D811B7C639DFF2754197BBF9C/S0008197306007069a.pdf/false_allegations_of_rape.pdf)\n\nI would say the same argument could be flipped on the new definitions of rape coming our of Academic feminism. \n\n&#x200B;\n\n>Then if you look at other higher studies like Kanin and Jordan you figure out that they are working on the police definitions of False or Not. Unfortunately that means that they consider a story false if the victim:  \n>  \n>Failed a Polygraph [Click here if you wanna know why the Polygraph is \\^\\^\\^bullshit](https://www.vox.com/2015/10/18/9560391/polygraphs-wrong-police)  \n>  \n>If the victim delayed reporting their rape  \n>  \n>If the victim was [\"Intellectually Impaired\"](https://www.npr.org/2018/01/08/570224090/the-sexual-assault-epidemic-no-one-talks-about)  \n>  \n>If the victim has signs of mental illness  \n>  \n>If the victim was intoxicated  \n>  \n>If the victim withdraw the complaint  \n>  \n>And if the victim was determined by police to be a \"Slut\"\n\n&#x200B;\n\n&#x200B;\n\nThere are criticism to make of Kanin. Small sample size, sure. Undisclosed location, also iffy. But according to Kanin, the police only classified an accusation as false if the alleged victim confessed to it being false AND they were able to corroborate the new story with the defendant and other witnesses. It did involve a serious, but not mandatory, offer of a polygraph test. But the offer of the polygraph test was merely a catalyst. An accusation was on classified as false if the alleged victim herself recanted. In 41% of the cases, the alleged victim did so. \n\nThere are legitimate concerns about this study I listed above. But the author has told another lie. No accusation was regarded as false at any time because of a failed polygraph or for any of the above listed reasons. I'll have to read the Jordan study because the author definitely lied about Kanin so I can assume he probably lied about Jordan as well. In fact, I completely distrust this guy.\n\n [https://link.springer.com/article/10.1007/BF01541619](https://link.springer.com/article/10.1007/BF01541619) \n\n&#x200B;\n\n>While false complaints do occur, approximately **three-quarters of the incidents concluded by the police to be false appeared to have been judged to some extent at least on the basis of stereotypes regarding the complainant’s behavior, attitude, demeanor or possible motive.** Suspicious file comments were made by the detectives regarding a woman who laughed while being interviewed, others who were seen as ‘attention seeking,’ and some who were said to be ‘crying rape’ for revenge or guilt motives.\n\n**Attention seeking, Revenge, and guilt** are all common and legitimate motivation for a false rape accusation according to self confessed accounts accumulated by De Zutter 2017. See above. \n\n&#x200B;\n\n>That's right. 75% of False Rape Accusations labeled as such by police were not because they were proven false but on the gut feelings of the police. Which means we get plenty of **false false rape accusations**. This is probably a bigger issue then men being falsely accused of Rape. [There have been plenty of documented cases of police pressuring victims to sign false confessions claiming they made up their sexual assaults.](https://www.propublica.org/article/false-rape-accusations-an-unbelievable-story) Its why one of the major reasons why [out of 1000 rapes only 6 rapists will go to jail while for robberies 20 will go to jail and 33 of assault and battery](https://www.rainn.org/statistics/criminal-justice-system).  \n>  \n>Using Fear as a WeaponWhy do we talk about False Rape Allegations all the time, and how its used as a political weapon.\n\nThe police deal with the shittiest people of society all day every day. You are allowed to be skeptical of the police. You are not allowed to completely write them off. I call bullshit. It might not be as high as 75% but it's high. In the UK false rape accusations are so common that police now demand that \"alleged\" victims hand over their phones when making an accusation that can check to see if they texted the accused the following morning something like, \"Thank you for the great sex last night.\" \n\n&#x200B;\n\n>Though most rational people don't see this as such a major issues within far conservatism and the Manosphere you tend to see false accusations be pushed as the major issue against men. In fact I decided to do my own study where I went to [r/MenRights](https://www.reddit.com/r/MenRights/) typed it \"Rape\" and look at the 102 top posts by [r/menrights](https://www.reddit.com/r/menrights/) on the subject. I only accepted posts of two categories, male victims of sexual assault and stories on false rape accusations. As expected [r/MenRights](https://www.reddit.com/r/MenRights/) had more posts about false rape then male victims of rape.\n\nStop kidding yourself. False rape accusations are a HUGE concern for men. Innocence is no defense against a rape accusation. Your life, your reputation, your friends, you family, your career, your honor, your legacy are all permanently and irrevocably damaged by a false rape accusation. It's shameful. \n\n&#x200B;\n\n>As you can see despite the fact that men are [1 in 33 in odds of being raped, that 1 in 10 rape victims are male](https://www.rainn.org/statistics/victims-sexual-violence), and as stated before only 0.005% of rape accusations lead to a man being arrested as stated above. MRAs post more about and care more about false rape accusations then male victims of sexual assault. Why is that? Why do we even talk about false rape so much if its more rare than males being raped? I get a suspicion that plenty who champion this cause are arguing disingenuously.\n\nInteresting that he mentions a man being arrested but how come so few women are arrest for rape even though there are multiple studies going back to the 1980s indicating it's massively underreported. \n\n&#x200B;\n\nFalse Rape accusations are not RARE. They are AT LEAST 2-11 percent of all rape accusations taken to the police. I'd bet that number is much higher since the #metoo movement when every single sociopathic liar KNOWS that they will be #believed. Oftentimes in spite of evidence. \n\n&#x200B;\n\nFalse Accusations are rampant enough that only segregation can solve it\n\n>Yeaaaa... This covers harassment as well. Plenty of people have been using the fear of false rape accusations against men as proof that women should be \"isolated\". [They also openly brag to each other that they \"won't hire more qualified women because I am too scared of a lawsuit\"](https://youtu.be/dHiAls8loz4?t=87). As stated before the case of someone falsely accusing someone else in the workplace environment is ultra rare as most false rapes come from children or the homeless, and the vast majority don't name suspects. If anything men should be worried about sexual harassment from coworkers as it is way [more statistically likely that men will be a victim of sexual harassment](https://www.washingtonpost.com/local/social-issues/men-account-for-nearly-1-in-5-complaints-of-workplace-sexual-harassment-with-the-eeoc/2018/04/08/4f7a2572-3372-11e8-94fa-32d48460b955_story.html?noredirect=on&utm_term=.06fb338bce7a) then falsely accuse of harassment themselves.\n\nChoose one.\n\nAdopt a #Believewomen policy and eliminated due process for men in the workplace. \n\nOr demand that women be hired at equal rates as men. \n\n&#x200B;\n\n>False Rape Accusers should get same length sentence as Rapists  \n>  \n>This is a common cry for those within the MRA movement is that these false accusers are getting off to easy. That they ruin countless men lives and only get slap of the wrists. But that shows a great error in their thinking is the trust that the criminal justice system gives just punishments to rapists in the first place. If we are going to punish false accusers the same way that we do punish rapists then false accusers should get:  \n>  \n>[10 Years of probation](https://www.cbsnews.com/news/former-houston-doctor-convicted-of-sexually-assaulting-patient-gets-probation-2018-08-19/)  \n>  \n>[3 Months of Jail](https://en.wikipedia.org/wiki/People_v._Turner#Sentencing)  \n>  \n>[5 Years of probation](http://www.kdrv.com/content/news/Medford-Man-Sentenced-to-Probation-for-Rape-of-Middle-School-Girls-492038491.html)\n\n&#x200B;\n\nInstead of listing three anecdotes, how about some actual data?\n\n \"**Prison sentences** for **rape** are not uniform. A study made by the U.S. Department of Justice of **prison** releases in 1992, involving about 80 percent of the **prison** population, found that the **average sentence** for **convicted** rapists was 9.8 years, while the actual time served was 5.4 years. \"\n\nBut just for fun, let's look at three false rape accusations that resulted in jail time:\n\n Colo. man imprisoned for 28 years after woman dreamed he raped her expected to be freed after convicted rapist admits to crime, \n\n [https://www.nydailynews.com/news/crime/new-trial-man-jailed-28-years-dream-rape-claim-article-1.2469667](https://www.nydailynews.com/news/crime/new-trial-man-jailed-28-years-dream-rape-claim-article-1.2469667) \n\n Accused Of Florida Rape 70 Years Ago, 4 Black Men Get Posthumous Pardons\n\n [https://www.npr.org/2019/01/11/684540515/accused-of-florida-rape-70-years-ago-4-black-men-get-posthumous-pardons](https://www.npr.org/2019/01/11/684540515/accused-of-florida-rape-70-years-ago-4-black-men-get-posthumous-pardons) \n\nLest we forget Emmett Till\n\n [https://en.wikipedia.org/wiki/Emmett\\_Till](https://en.wikipedia.org/wiki/Emmett_Till) \n\n&#x200B;\n\n&#x200B;\n\n>That of course doesn't count the countless who have sexually assaulted and get away with it. If MRAs called for this guideline I can't help to feel they would be even more disappointed in the sentencing expecting 20 years but IRL only getting a few months. If we treated false rape accusers the same as rapists then we as a society wouldn't take them that seriously.\n\nFor both men and for women. Countless women who have sexually assaulted and gotten away with it. \n\n&#x200B;\n\n>Also I want to quickly address the other MRAs call for those who have been falsely accused to be placed on the Sex Offender Registry Lists. Uuuuuuuhhh What?!? This is improper use of such a list number 1, and 2 that publicly available list would then create a public list of people you can rape without repercussions. Think about it. If you publicly branded people as \"False Rape Accuser\" then which people would rapists target?\n\n&#x200B;\n\nI'm actually opposed to the Sex Offender Registry Lists as they currently stand in our country. Female Pedophiles are very often offered a plea deal to stay off the registry.\n\n&#x200B;\n\n&#x200B;\n\n>Putting extra laws and punishments on this mush smaller issue of False Rape Accusations put more pressure on legitimate victims of sexual assault. Under the existing law there are cases of legit victims being classified by police as false victims. If you add additional punishment then we will punish legitimate victims of rape 20 years in prison for just reporting their rape and police not believing in them. And that will have a chilling effect on the rest of victims of sexual assault out there. Its hard enough as is, but if you are unable to prove it and you \"act like a slut\" then you could face jail time\n\nThis is just as true for rape victims. The UK is seeing an influx of innocent men convicted of rape because of horrible #believewomen policies. It is an actual nightmare. \n\nI think false rape accusations need to be rigorously prosecuted when there is substantial evidence of malicious intent. Just because the defendant is not convicted doesn't mean it was a false rape accusation. But in many cases, there is evidence of clear malicious intent, yet the false accuser is not punished, \"lest we discourage others from coming forward.\" (Other false accusers?)\n\n [https://metro.co.uk/2017/09/27/man-cleared-of-rape-after-victim-said-ill-ring-police-tomorrow-its-going-to-be-fun-6958964/amp/?ito=article.amp.share.top.twitter&\\_\\_twitter\\_impression=true](https://metro.co.uk/2017/09/27/man-cleared-of-rape-after-victim-said-ill-ring-police-tomorrow-its-going-to-be-fun-6958964/amp/?ito=article.amp.share.top.twitter&__twitter_impression=true) \n\n&#x200B;\n\nAlso check out r/falserapeaccusations\n\n&#x200B;\n\n&#x200B;\n\n>Conclusion\n\n&#x200B;\n\n>That's why [r/MenRights](https://www.reddit.com/r/MenRights/) and Reddit as a whole under reports on male victims of rape. Because admitting that rape of men is a common thing only helps prove that rape in general is a very common affair and that the 1 in 6 statistic was right the whole time. That Rape is a real problem in western society and forces them to stop ignoring it.\n\n&#x200B;\n\nMultiple written lies have been told by the author of this post. When it was first posted, a great many redditors pointed out how poorly his math was put together. Instead of changing or editing his post, he merely deleted the comments. That is called suppression of the truth and it makes you a bad person.  \n\n&#x200B;\n\nNo one is denying that rape is a serious issue. The good news is that according to the BOJ, rape, along with other violent crimes has been dropping steadily since the 1960s. In 2012 the number pivoted because for the first time in USA history, the FBI legally acknowledged that men can be raped. Unfortunately it has been worded such that female on male \"made to penetrate\" sexual assault is still not rape. Women can only rape men if they anally penetrate them. We still have a long way to go for true gender equality. \n\n&#x200B;\n\nSo remember this TL;DR when you think about False Rape Accusations.\n\n>TL;DR  \n>  \n>For both genders you are way more likely to be raped then falsely accused of rape.\n\nNobody actually knows how likely you are to be falsely accused of rape. At a minimum, 2-11 percent of rape accusations made to the police are false. Probably the number is closer to 1 in 4 due to hard forensic evidence of backtested rapekits that excluded the primary suspect, (as fingered by the alleged victim,) 23% of the time. But we don't really know. It's probably safe to say that you are more at risk of being false accused of rape in 2019 than at any other time in human history because of the public demonstrations of #believewomen. Many still believe Ford's accusations against Kavanugh despite being thoroughly discredited by Leland Keyser. [https://www.washingtonexaminer.com/news/just-didnt-make-any-sense-leland-keyser-now-challenges-story-of-kavanaugh-accuser-christine-blasey-ford](https://www.washingtonexaminer.com/news/just-didnt-make-any-sense-leland-keyser-now-challenges-story-of-kavanaugh-accuser-christine-blasey-ford) \n\n\" **I don’t have any confidence in the story,” Keyser told** ***New York Times*** **reporters Robin Pogrebin and Kate Kelly**  \n\n **\"Those facts together I don't recollect, and it just didn't make any sense,\" Keyser told the authors.** \n\n **\"It would be impossible for me to be the only girl at a get-together with three guys, have her leave, and then not figure out how she's getting home,\" Keyser told Pogrebin and Kelly. \"I just really didn't have confidence in the story.\"** \n\n **A few days** [**before the hearing**](https://www.cnn.com/2018/09/22/politics/kavanaugh-ford-accuser-nomination/index.html)**, Keyser’s attorney said, “Simply put, Ms. Keyser does not know Mr. Kavanaugh and she has no recollection of ever being at a party or gathering where he was present, with, or without, Dr. Ford.”**\n\n**\"Keyser later said she felt pressure by both \\[Ford classmate Lucy\\] Gonella and Ford's friend Monica McLean to change her story,\" Pogrebin and Kelly wrote.**\n\n**\"I was told behind the scenes that certain things could spread about me if I didn't comply,\" Keyser told the authors.**\n\n&#x200B;\n\n\\#metoo has already been politically weaponized. This is ridiculous. WE are being gaslighted. This is bullshit.\n\n&#x200B;\n\n>The estimated number of false rape accusations are around 2-10% at the highest.\n\nThis is a lie on several levels. It's 2-11%. And that is a minimum. And that's if you only consider surveys conducted by feminists or women's advocates.\n\n&#x200B;\n\n>For 216 False Rape Accusations only 39 named suspects, and only 2 got charged. That means that only 18% of False Rape Accusations actually accuse someone and that only 0.9% of false rape accusations ended up on court.\n\nI'm pretty sure this stat is referring to how many false rape accusers got charged. So now you are just making up numbers. You are either lying or grossly mistaken. \n\n&#x200B;\n\n>Vast majority of false rape accusations are made by Teenagers, Parents of Children, and the Homeless.\n\nThere's no way to know this. And there is also no citation. \n\n&#x200B;\n\n>55% of False Rape Accusations are in hopes of getting free medical treatment. Next major category is from teenagers justifying their absences to parents.\n\nDid I miss the source for this. Why are you ignoring De Zutter (2017)?\n\n&#x200B;\n\ntl;dr #metoo is a puritanical, sexist witchhunt that strips men of due process while refusing to hold women to the same standards, as per Asia Argento, Katy Perry, and Amber Heard. It's is a moral panic. Much like McCarthyism we will look back on #metoo with a deep sense of shame for vigilante mob justice conducted in the name of false rape accsusations.",
    "title": "I call Bullshit on the False rape accusation sticky from Mens Lib sub. Actual lies are being told.",
    "subreddit": "MensRights",
    "timestamp": 1575621828,
    "score": 676,
    "keyword": "woman doctor"
  },
  {
    "text": "38 weeks pregnant with my first child, and I finally got asked the question... Doctor: Is it a boy or girl? \n\nMe: Boy. \n\nDoctor: Are you circumcising? \n\nMe: No, I am not going to mutilate my son, thanks. \n\nMy aunt asked me the same thing and I gave her the same response. She's a hardcore feminist and she tried to argue with me about it... I found out my little cousin is. I legit felt disgusted TBH. Like I had so much respect for this woman (I still do), but I lost a lot of it that day. She tried to tell me all the \"benefits\" and warn me that it's going to be soooooo hard to wash him. Well, my fiance is intact and he's just fine. I had to cut her off and tell her I refused to talk about it with her anymore because she's never going to change my mind and I'll never change hers. As a woman who is growing a helpless little boy in my belly, I feel so strongly about this. He is counting on me and his dad to give him a voice right now. If he chooses to have it done later, that's up to him, but for now, no needless surgeries on my infant.\n\nEdit: I really didn't want to edit this post but I just can't help it. I just remembered that literally in the same conversation, my aunt said she can't stand seeing baby girls with pierced ears. Can you say hypocrite?!",
    "title": "38 weeks pregnant with my first child, and I finally got asked the question...",
    "subreddit": "MensRights",
    "timestamp": 1552086670,
    "score": 499,
    "keyword": "woman doctor"
  },
  {
    "text": "People constantly overstate the extent to which women were \"oppressed\" in the past. People constantly quote that \"women didn't have the right to own property\", \"women were chattel\", \"women were allowed to be abused, beaten and raped by men\", \"women didn't have the right to vote\", \"women were kept out of male-dominated industries\", \"women were oppressed by men\", etc.\n\nAll this is bullshit.\n\nUnder coverture, single women otherwise known as \"femme sole\" did have the right to own property, had the right to enter into contracts, and overall had the same rights as single men. It was only when they married that they sacrificed some of their rights to own property and enter into contracts on their own.\n\nWhen a woman got married she was considered a \"femme covert\" and her existence was consolidated into that of the man's. People constantly take this to mean that she was chattel, owned by men but this was not the case. Once they were married, women were entitled to be supported and to have the portion that she brought into the marriage managed by their husbands, to the best of their ability. Women had the right to buy necessaries on their husband's credit as their husband's agent. Women could not be prosecuted for most crimes and their husbands would be prosecuted in their stead. Women were immune from liability for debt. They were not in any way chattel, they definitely had less agency, but at the same time they were entitled to protections and privileges and it was considered the man's duty to provide said protections and privileges for them. Women have very frequently sought redress in common law and equity courts when husbands failed in their duties.\n\nMarried women were also not allowed to be abused unlike what people think. The laws allowed for mild correction such as spanking the way you would a child at the time but husbands were not allowed to beat their wives black and blue. A woman could obtain a surety of the peace bond to ensure her safety from a violent husband.\n\n[https://lonang.com/library/reference/blackstone-commentaries-law-england/bla-115/](https://lonang.com/library/reference/blackstone-commentaries-law-england/bla-115/)\n\n[https://www.legalgenealogist.com/2019/02/12/the-defense-of-coverture/](https://www.legalgenealogist.com/2019/02/12/the-defense-of-coverture/)\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nYes, women didn't have the right to vote for most of history, but neither did men. Property owners had the vote, the vast majority of men did not. Male suffrage was something that was fought for, and when men did end up getting the vote before women it wasn't necessarily because of discrimination against women. It was because the vote at the time was seen as a direct extension of men's obligation to be conscripted and fight in war, something which women were not obligated to do.\n\nSomething that makes this even more muddy than it already is is that: the reason why votes for women took so long to be implemented was that the majority of women did not want the vote. There were many anti-suffragette societies, and a fair amount of them were led by women.\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\n[https://www.npr.org/sections/npr-history-dept/2015/10/22/450221328/american-women-who-were-anti-suffragettes](https://www.npr.org/sections/npr-history-dept/2015/10/22/450221328/american-women-who-were-anti-suffragettes)\n\n[http://nationalhumanitiescenter.org/pds/gilded/power/text12/antisuffrageassoc.pdf](http://nationalhumanitiescenter.org/pds/gilded/power/text12/antisuffrageassoc.pdf)\n\nWomen were allowed to work in a lot of male-dominated industries. Guild-type work was always open to single women and windows. In fact there is a lack of evidence of anything preventing women from working. An article (which I've linked below) says:\n\n\"For most girls, becoming a blacksmith was probably not a dream. Husband, family, home: those were the pursuits of a young woman of the eighteenth century. Finding a woman or women working at all outside the home, much less in a male-dominated trade, most likely meant the dream wasn't shaping up the way they'd hoped. Some women worked because they had no choice.\"\n\n\"Though there was no system of standards governing the trades in the colonies, the method of learning a trade generally followed the apprenticeship guidelines established by the guilds in medieval England and Europe. Women were not excluded from membership in any of the earlier guilds. The Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\"\n\nThe paragraph below is a quote from a redditor \"w1g2\" who made a really good point regarding work, and women's involvement in it.\n\nWas it a social norm that most women did not seek out careers as they do now? Sure, I don't doubt it. But women did not have access to reliable birth control (because it hadn't been invented) so unless they wanted to spend the entirety of their life chaste, would have to plan for many of their years being filled with pregnancy, childbirth, breastfeeding, etc. Not to mention, quite a lot of the jobs available weren't in nice air- conditioned offices but involved hard labor or danger like becoming a doctor (working with the near dead, sometimes even people with a plague) or a lawyer (working with criminals, especially when prisons did not have as nice standards for living). Maybe it's the case that in different environments, people, including women, will have to react accordingly to different things and maybe it's understandable that in an environment that used to have far more risk and danger and death and with little knowledge or control over fertility, women wanted different things than they do now.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nSo. Women were not nearly as \"oppressed\" as people seem to think they were. There was never a patriarchy holding women down. Were there burdens, obligations and disadvantages? At times, yes. But these usually did not run one way - men too had their own set of burdens. And whenever I mention this to people it's met with handwaving or sometimes outright denial of the evidence.\n\nIt seems to be very hard for a lot of people I've seen to believe that women had a lot more privilege and social power than previously believed, and that men had obligations imposed on them.",
    "title": "People constantly overstate the extent to which women were \"oppressed\" in the past.",
    "subreddit": "MensRights",
    "timestamp": 1553409291,
    "score": 416,
    "keyword": "woman doctor"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 189,
    "keyword": "woman doctor"
  },
  {
    "text": "List of Men's Rights Issues Just what I see as important, with a few sources.\n\n###Labor, work / life balance\n* Men work longer hours than women\n* Men work more difficult jobs than women\n* Men suffer from greater rates of occupational health problems (black lung disease, mesotheleoma, etc)\n* Men are more likely to die on the job\n* Men receive fewer benefits like paid time off, paid medical leave, and health insurance\n* Men have less free time to see a doctor, and often do not have medical coverage to pay for a doctor\n* As a result of many of the above, men live shorter, disease ridden lives, but retirement age is the same as (and sometimes higher than) women\n\n###Household responsibilities\n* Men do most of the dangerous, dirty, and difficult work around the home\n* Men get nagged, harassed, and bossed around inside their home ([source 1](https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf), [source 2](https://www.pewsocialtrends.org/2008/09/25/women-call-the-shots-at-home-public-mixed-on-gender-roles-in-jobs/), [source 3](https://www.scotsman.com/lifestyle-2-15039/women-decide-to-rule-the-roost-1-1503380))\n* The total amount of time men spend at work and at home doing chores and child care is more than the amount of time women spend on these activities ([source 1 (Pew)](https://www.pewresearch.org/fact-tank/2019/06/12/fathers-day-facts/ft_18-05-01_fathersday_time/), [source 2 (US BLS)](https://cdn0.vox-cdn.com/assets/4635193/Screen_Shot_2014-06-18_at_12.56.18_PM.png), [source 3](https://ifstudies.org/blog/the-myth-of-the-lazy-father))\n* Men have less time to themselves for leisure, self care, napping, and sleeping, compared to women (source: same as above)\n* The way society views all of the above is completely backwards: women complain about men and about the amount of work that men do, often portraying men as lazy or incompetent (see [source 3](https://ifstudies.org/blog/the-myth-of-the-lazy-father) from above), despite the fact that, if anyone has room to complain, it's men, not women\n\n###Masculinity and Misandry\n* Men are attacked for behaving like men.  Husbands are attacked for behaving like husbands.  Fathers are attacked for behaving like fathers.  And boys are attacked (and often medicated, shamed, and disciplined) for behaving like boys.\n* The vast majority of media representations of men in TV, movies, and commercials, are negative ([source (from rbomi)](https://archive.is/NHC61))\n* Even when men are portrayed positively in the media, it's usually because they have abandoned masculine traits and embraced feminine traits instead (so a man is seen as a bad guy when he was acting like a man, and later a good guy when he \"connects with his feminine side\") (source: same as above)\n* Misandry is widespread throughout all of society and is widely accepted.  Many people do not know when they are being misandrist, or that it's even possible to be misandrist.\n* Men are shamed and attacked with words like *creep*, *pervert*, *incel*, *deadbeat*,and *rapist*\n* These types of slurs should be considered equally sexist / bigoted as words like \"thug\" for black people or \"wetback\" for hispanics\n* Men's behavior is highly regulated by women and female shaming behavior\n* The clothing that men are allowed to wear is highly regulated by women and female shaming behavior\n* It is not uncommon to hear comments about the size of a man's penis, or for women to threaten to cut off a man's penis\n* Genital mutilation is commonly used to \"fix\" behavioral \"problems\" in young boys\n\n###Education\n* Our school systems are increasingly hostile towards boys\n* Boys are treated like defective girls and their behaviors are \"corrected\" through discipline, and through medication, so that they will behave more like girls\n* Boys make worse grades than girls, and graduate at lower rates than girls (despite, in the past, doing better than girls)\n* Our education system went through several reforms to help out girls, and these reforms are responsponsible for making things worse for boys ([source](https://www.theatlantic.com/magazine/archive/2000/05/the-war-against-boys/304659/))\n* Society is hesitant to address or fix any of these issues, despite the fact that we were willing to fix these issues when they first effected girls\n\n###Wealth gap\n* Single women make more money than single men\n* Millennial women make more money than millennial men\n* Women as a whole own more wealth than men do -- most \"money\" in society belongs to women ([source 1](https://www.marketwatch.com/press-release/bmo-report-despite-controlling-14-trillion-in-wealth-american-women-still-have-challenges-to-overcome-2015-04-02-13173119), [source 2](https://www.forbes.com/sites/work-in-progress/2010/07/28/women-making-economic-strides-and-not-slowing-down/)).\n* The expectation is for men to spend money on women, not the reverse\n* Women spend their boyfriend's and husband's money, often even when they make more than their boyfriend / husband\n* Women very often receive large portions of a man's assets and future income in a divorce, which contributes significantly to the wealth gap\n\n###Divorce and child custody\n* Courts have an obvious anti-male bias when it comes to divorce settlmenets, child custody cases, and awarding child support\n* Laws concerning marriage, divorce, child custody, and child support, are sexist, and often times name \"husband / wife\" and \"father / mother\" directly in the legal language\n* Even when this is not the case, the effect of these laws are still sexist, in much the same way that drug laws and drug enforcement have been acused of being racist ([source](https://en.m.wikipedia.org/wiki/The_New_Jim_Crow))\n* Women should not be allowed to walk away with a substantial amount of the man's money and assets from a divorce\n* Women should be forced to work a job instead of receiving child support, alimony, and welfare\n* Men should receive default 50 / 50 custody without having to pay child support.  Men should not have to go to court, pay court fees, hire lawyers, and argue their case in court.\n* It is not fair for a man to work full time, take 50% of the child rearing responsibilities, and still pay child support.  If a man can work and still put in his fair share, then so can a woman.\n\n###Police brutality and legal discrimination\n* Men are discriminated against in almost every aspect of the legal system.  In many cases this discrimination is *worse* than it is for minorities.\n\n###Domestic abuse, rape, and violence against men\n* The Deluth model of domestic abuse is overtly sexist against men\n* Women physically assault men at equal and sometimes greater rates than the reverse\n* Domestic abuse that includes yelling, gaslighting, and emotional abuse, are probably much higher than what's reported, and men likely make up a majority of the victims\n* Nagging, harassing, henpecking, and bossy behavior from wives and SOs should be counted as domestic abuse\n* Taking advantage of a man for his money should be considered a form of \"financial abuse\"\n* Men are raped at equal rates as women but there is very little awareness for this.  Most men are raped by women, not by other men ([source 1](https://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known/), [source 2](http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf)).\n* Men are viewed as being more dangerous or violent than women, despite there being clear gender parity when it comes to domestic abuse and sexual assault\n* As a result, men receive less support and there is less awareness for these problems in comparison to women\n* Men who are raped suffer from greater rates of emotional trauma than women do\n* Women who rape men tend to be more violent and are more likely to use force than men.\n* There is a widespread and rampant \"rape culture\" against men: many women do not believe that it is possible to rape a man, and as a result women are more likely to step over boundaries in ways that men don't.\n* Many people do not view abusive behaviors from women in the same light as those same behaviors from men ([source](https://www.researchgate.net/publication/8006596_Psychologists'_Judgments_of_Psychologically_Aggressive_Actions_When_Perpetrated_by_a_Husband_Versus_a_Wife))\n* Men are often viewed as the more responsible party than women\n\n###Men and Minorities\n* Many areas of men's rights and minority rights intersect, with minority men facing problems from both racism and sexism\n* Examples include police profiling, police brutality, and racist / sexist comments and behaviors\n* Men are often treated like criminals, and this treatment is even worse for minority men\n* White men perform worse than white women in almost every single aspect of life, with the exception of job earnings (which is largely the result of men working more hours, more difficult jobs, and having a worse work/life balance compared to women)\n* Minority men perform worse than minority women in every single metric you can look at, including job earnings\n* Minority women perform better than white men in some areas, like when it comes to police brutality, police profiling, and discrimination in the court system\n* Who has it worse: Men, or minorities?  Obviously it is minority men.  It is not true that minority women have things worse.\n* Joking about minority women somehow having things worse has created a culture of denial over men's issues and the problems that minority men face.",
    "title": "List of Men's Rights Issues",
    "subreddit": "MensRights",
    "timestamp": 1571168087,
    "score": 139,
    "keyword": "woman doctor"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 121,
    "keyword": "woman doctor"
  },
  {
    "text": "My story of facing abortion laws in Alabama I posted this in The Handmaid's Tale reddit last night, and I would like to share it here as well. \nPerhaps something positive can come from a horrible experience, I would love to prevent another woman from being denied a choice about her body. \n\nYesterday, Women's Rights in my state, as well as the surrounding states, took a huge leap backwards. I guestimate that if I or someone I love required an abortion we may have to drive hundreds of miles.....(I have been to upset to research Florida and Texas laws to confirm this).\n\nPlease allow me to share my story. A few years ago I was a resident (temporarily ) of Alabama while my husband was stationed there for work. I was 21 weeks pregnant, and although feeling a bit ill, went to our ultrasound appointment with feelings of joy and curiosity to learn the baby's gender. Instead, like so many other women before me, we heard the deafening silence of no fetal heartbeat. We were crushed. Suddenly my supposed UTI infection and resulting fever had more gruesome implications. My son was dead. My son was dead inside of me, for an unknown amount of time. \n\nMy shock was begining to transition to grief when all of those emotions were forced on hold. My husband and I began to fear how sick I was becoming and listening for next steps. There were none. Although I had a fever and clear signs of an infection starting, the doctors informed me that there was nothing that they could do. My body had not initiated the process of labor, but they were sending me home. Why? And this.....this is a quote, \"We do not perform abortions,\". I was told this by 3 separate Dr's over the next week and a half, each day more sick and weaker than the last. Abortion is not allowed. One physician, to his credit, said that he wished that he could help me, but due to regulations and the funding for the hospital the procedure was not only prohibited, there was not even the equipment present he would need. The only clarity I was given was that before 20 weeks it would be considered a miscarriage, after 20 weeks it is considered stillbirth. Yet, neither term explains why my health and life was jeopardized. \n\nEspecially bizzare, if what Alabama was against was a D&C procedure, (referring to it as \"abortion\"), bc I ultimately did not have a D&C. Did Alabama laws consider inducing labor an abortion as well? I will never understand. \n\nWe drove hours to my home state, where I was immediately admitted and given pitocin (I assume, it was a labor inducing medication) and my son was stillborn a few hours later. \n\nI have never gotten over the shock of that experience, of being told repeatedly that my body was not important. That my body was not under my decisions or choices..... that regulations would allow my body to be compromised, weakened, and sickened... Not to mention the emotional trauma it caused.  I apologize that this is not as articulate as I would hope, even now this is difficult to write. \nSince then I have lost 2 loved ones to sepsis, and I realize how fortunate I was to have found help before the infection reached my bloodstream. \n\nAlabama has doubled down on their abortion laws, and now my state has followed suit. The \"heartbeat\" law went into effect July 1. Most women do not even know they are pregnant before 6 weeks.... and often a heartbeat can be detected then. Effectively making abortion all but illegal in my state and my neighboring state of Louisiana as well (if their law passed as mine did). \n\nI am pro-choice. Being pro-choice, for me personally, means that I respect others beliefs but also do not believe a law should decide. That means that I can respect some who is pro-life's beliefs as well, I just do not think it should be LAW. Isn't that the point of our democracy? Isn't there supposed to be a seperation of church and state?\n\nBeing from MS, I cannot say these things in general conversation without outcry by most. Not even to most of my (non immediate) family members. This state is the definition of the bible belt. Abortion, to MS, equals killing innocent babies. That does not happen to be my belief, and to most of the people saying this it would also never occur to them to check their white privilege / middle class privilege. I try to. I imagine myself, if my daughter needed me, driving to Canada if that is what it took for her to exercise her right to chose. Yet I know that so, so many women would not have the means to do that. That these laws will force many, many to become mothers when they know they are not in the position, mental, physical, or financial state, etc to bring a child into the world. \n\nUnfortunately there are cries of, \"keep your legs closed, slut!!\", and very little research into the truths of abortion. A lot of cries for \"saving the precious babies\", and very little research into more effective birth control regulations, sexual education, reproductive healthcare, and adoption policies that would serve their purposes more accurately. \n\nIt is tragic that they cannot see how damaging these laws are. I pray they never find themselves forced to view their deceased unborn son as a threat to their health rather than simply a tragedy to mourn.\n\nAs a young woman with an incurable and progressive genetic disorder called Ehlers-Danlos, my prior pregnancy put a huge strain on my body and progressed my joint instability. I was diagnosed later in life, and I do not regret for a moment being pregnant. I use my cane gladly, I adore being a mother. However, even at 36, with a tubal, I know that if that were to fail I could become pregnant again. It would be devastating for my body to carry another child. I would be in a wheelchair, possibly the rest of my life. Like I said, I am 36. No, it would not be fatal, necessarily, but it would destroy the life that I have. Shouldn't that be MY choice? If my healthy sexlife resulted in an unplanned pregnancy, for me to make the right/best choice for myself and my family?\n\nI could try to rally a protest. It would fail. I write letters, I contribute......but it feels futile here in the south. \n\nI apologize, I just realized how lengthy this has become, so thank you if you read this far. I only write this for encouragement, fight. Please fight for yourself in your states. Please. If anyone is in the south and is fighting, let me know and I will gladly join. I even have a handmaid's costume from last Halloween ready to go. \n\nIn Georgia a woman can now be prosecuted if she leaves the state for an abortion. Imagine that. If a woman left a bad relationship, terminated a pregnancy and the man found out he could have her prosecuted simply for spite!\n\nOn the news tonight is the story of a 5 month pregnant woman who was shot during an argument and SHE has been charged with the death of the baby bc she started the argument. The actual shooter was not charged. \n\nAs I said, it is frightening to witness this happening and seeing no response from women here. \n\nLove and light to you all. Sorry for typos, would be difficult for me to go back and proofread.",
    "title": "My story of facing abortion laws in Alabama",
    "subreddit": "Feminism",
    "timestamp": 1562224257,
    "score": 39,
    "keyword": "woman doctor"
  },
  {
    "text": "EMİNE BULUT Today in Kırıkkale, Turkey, a woman named Emine Bulut was murdered in front of her 10 year old daughter by her ex-husband Fedai Baran.\n\nPer request of her ex-husband to see his daughter, Emine Bulut and her daughter went to meet him in a restaurant. An argument was raised between the parents, which led to him stabbing her multiple times with a bread knife.\n\nWhile she was bleeding out, her daughter cried \"Mom, please don't die!\" while Emine Bulut kept repeating \"I don't want to die.\" over and over again, crying, afraid of what was going to happen to her.\n\nShe was immediately transferred to a hospital via ambulance, but the doctors couldn't save her no matter how hard they tried.\n\nMurderer Fedai Baran was caught by the police half an hour after the attack. The family of Emine Bulut want him to face a death penalty, however that is not possible as the law doesn't allow the punishment.\n\n-\n\nAs a Turkish woman, it's no real surprise to see or hear news about a woman being murdered, raped, or both. Whether it be a 5 year old child being raped, killed, then left on her doorstep, or a \"father\" planning and excusing her daughter's rape and murder (Özgecan Arslan), it's something that no one really is shocked about anymore. With every single news flash a little bit of our hearts break and souls wither, but nothing is changing. In fact, it's only getting worse by the years.\n\nNeedless to say, I am absolutely disgusted and heartbroken to hear the news. I'm livid at the murderer, I'm worried about the child, but most importantly I'm afraid that he will be set loose after a few years of imprisonment. It wouldn't be something that was never done before, in fact many criminals like this are put on trial and deemed not guilty by the judges. In rape cases, they ask if the woman was wearing a certain thing, or if they were in a relationship. In short, they do everything they can to make the victim guilty and I'm fucking tired of it. The fucking system is broken and these criminals are walking among us looking for their next victim everyday.\n\nThe thing that really shook the whole country by its core this time is the video. A person filmed that incredibly heart wrenching moment of mother and daughter, crying out and afraid of what was going to happen. I will leave a link, but MAJOR TRIGGER WARNING! This is not a video you should watch if you're sensitive to blood. They speak in Turkish, but you don't need to know the language to hear the horrifying screams of these women.\n\nThe video: https://youtu.be/G4vMejM-BsE",
    "title": "EMİNE BULUT",
    "subreddit": "Feminism",
    "timestamp": 1566572147,
    "score": 36,
    "keyword": "woman doctor"
  },
  {
    "text": "Single woman sues Chinese hospital for refusal to freeze eggs. Teresa Xu says doctor told her to hurry up and get married before having children",
    "title": "Single woman sues Chinese hospital for refusal to freeze eggs. Teresa Xu says doctor told her to hurry up and get married before having children",
    "subreddit": "Feminism",
    "timestamp": 1577664305,
    "score": 20,
    "keyword": "woman doctor"
  }
]