[
  {
    "text": "How can I get out of retail hell? I'm a 26 year old woman. I turn 27 in May. I graduated in 2013, with a BA in Political Science. When I first started college, I thought I wanted to go to law school. But after taking a few law-specific classes, I realized that I wasn't really interested in law. Then, I realized that I really liked international politics, international relations etc. I took the GRE, but my GPA is just dismal (2.75). No grad school is going to accept that, and I wan't too sure about going to grad school anyway.\n\nAbout 8 months later, I got a job as a substitute teacher. I worked a few assignments, but wasn't getting as many. But I thought I'd give actual teaching a try, so I enrolled in an alternative certification program, and in October, I started working at Ross Dress for Less in October of 2014. I was still enrolled in the program, until August of 2015. I got a full time teaching job. In an alternative certification program, you have to teach for a full school year, as a teacher, before you become fully certified. So I thought I'd teach for a year here, get certified, then I would do what I *really* wanted to do; which is teaching English abroad.\n\nBut when I started teaching, it was a terrible experience. It was so bad that I started having panic attacks, was diagnosed with anxiety, missed two weeks of school because I was so sick, and resigned in October. My therapist had advised me to not start looking for a job until December of 2015. So I started applying in 2016 and I got a job at Sears and I've been working there ever since.\n\nI've been applying for other jobs that aren't retail. I've been , relentlessly, applying to teach abroad, but nothing is working. I still live with my parents and I desperately want to get a better job and move out. It just seems like I'm going nowhere, no matter how hard I try. It just feels hopeless, and what's worse is that I just don't know what I want to do.\n\nOn top of that, I've been having some medical issues (that are finally resolved), but I just feel like whatever I do, anxiety is going to creep in and I won't be able to handle it. But I hate this job so much! And even worse, I feel like I'm running out of time since I'm almost 27, living with my parents, with a degree, and working a retail job.",
    "title": "How can I get out of retail hell?",
    "subreddit": "jobs",
    "timestamp": 1492051877,
    "score": 12,
    "keyword": "woman teacher"
  },
  {
    "text": "My friend and I applied for Walmart So last week me and a friend both applied for our local Wal-Mart, and luckily both of us received a call, and we both now have a job offer. But here's where things get a bit messed up. During high school, he was a person who kind of half-cared. He made it through, but with some major setbacks because of his unwillingness to do the work. I on the other hand took college courses exclusively during our senior year. I finished them with good grades, and now already have college started. During his interview, he was asked about schooling and told them his plans. They then changed his schedule to meet his needs. When I went in for my interview a couple days later, I was never even given an opportunity to tell the woman interviewing me my plans for college. My friend was given a position where he maintains the meat section, keeping the most out of date meat in the front, and unpackaging boxes of meat and placing them in the store floor. He said that he was told there is a minor health risk so he gets paid a bit extra, which I can understand. He got a schedule from 8 am to 5 pm, which is pretty much what I was hoping I too would get. But that's not the case. I was offered a position in which I unload the delivery truck, sort the merchandise, bring out merchandise onto the store floor, and stock the shelves. My position is actually harder than his, and on top of that, I was given a 2pm to 11pm schedule, which is almost exactly what I DIDN'T want. But after all of this I didn't really care. I said oh well, I'm getting paid, so that's all that matters. But then I found out that not only am I doing more than my friend with a schedule I don't like, but I'm getting paid $1.95/hour LESS than him!\n\nWhat do I do? Should I look for a better job? We only work 4 days a week, but he makes over $70 MORE per week for doing less work. Had I not known he makes more than me, I would honestly have been happy with my pay-rate, but I KNOW that he's making more than me. It frustrates me so much that someone who half-a**ed their work up to this point got the better job, and then there's me. I have never gotten a grade below a C in my life, and the only C I have ever gotten was from a drama class because I wasn't a very good actor and the teacher picked favorites (I was not one of them). I honestly don't know what to do. I'm supposed to fill out the Wal-Mart background check today so that I can begin orientation at the end of the week, but now I'm not sure.\n\nWhat would you recommend?\n\n\nEDIT: Because I get asked this a lot, I do NOT live in LA, it's just a name I made up a long time ago when I was into LA Noire",
    "title": "My friend and I applied for Walmart",
    "subreddit": "jobs",
    "timestamp": 1498492739,
    "score": 3,
    "keyword": "woman teacher"
  },
  {
    "text": "Master of Library and Information Science from 2009. What types of jobs should I be applying for? I received my MLIS in 2009, during the recession, where everywhere near me had a hiring freeze. I did manage to get a position at a high school for two years as a Library Assistant, but had to quit to take care of a sick child. I then worked from home for two years as a teaching assistant at for an online college. For the past three years I have made a small amount of money from advertising on some websites that I created.\n\nChild has now recovered and gone off to college, but I find myself a middle aged woman (43, look younger) with little job experience and a dated masters degree. I can do light programming, but don't have any job experience other than working for myself and other home projects. I worked as a health unit coordinator for several years before getting my degree, but that was over 15 years ago.\n\nI have no idea where to take my career. Any ideas? I have always gotten good grades an good/excellent employment reviews.\n\nI have applied for hundreds of jobs such as librarian, library assistant, editor, receptionist, data entry, tech support, apartment leasing agent, teacher's aide and social media marketing. I get absolutely no responses. \n\nI'm not doing a very good job of selling myself and am looking for ideas on how to paint a good picture and some ideas of types of jobs that might want someone like me. I am willing to take further classes, but not not much more than two years or so worth. \n\nAny ideas?",
    "title": "Master of Library and Information Science from 2009. What types of jobs should I be applying for?",
    "subreddit": "jobs",
    "timestamp": 1508285841,
    "score": 2,
    "keyword": "woman teacher"
  },
  {
    "text": "Looking to start a career in robotics - did not get my degree in science - Help Okay, I'm having a hard time editing my whole spiel on this - because I feel like all of it is important info to reach out for help. I'm probably wrong... but bear with me if you can. \n\n&nbsp;\n\n\nMy whole life I have wanted to work in the field of science, but I have never had the self confidence to believe I could do it.\n\n\n&nbsp; \n\n\n**I just want to know the initial steps to driving my career this way.** I have not received my degree in engineering, and I've been in the workforce for about 3 years - none of my jobs relating to what I want to do. (*Except for MAYBE when I was a \"product designer\" for Leapfrog*)\n\n&nbsp;\n\n \nIdeally I would love to leave my job for some sort of entry level position at a job related to **robotics**. Right now I am working long and inconsistent hours, its making it hard to properly schedule my free time to move in the right direction. I would just do volunteer lab work - but given my lack of spare time I haven't been able to find something that works, while I still can pay for things like rent and food. I would love to just leave my job for a full time entry level position in a lab environment, something like a research assistant... but perhaps wouldn't require a degree? Does that even exist?\n\n\n&nbsp;\n\nMy interests lie in two realms of this field - one pertaining to creating “artificial bodies” and one to creating “artificial minds”.\n\n&nbsp;\n\n \nStarting with the first; I feel the best fit would be seeking out a career in mechanical engineering. I’ve worked with “making things” my entire life to know that it's something I enjoy thoroughly and could do for a lifetime. I attended Cooper Union - which is an especially technical school; the quality of something we crafted / built was heavily stressed. I've learned to create a \"product\" from various materials, and I’m confident that I possess the grounding skills in design, physics, and construction; that would give me a solid base to grow from when acquiring the technical knowledge of machine making. I'm trying to find affordable mechanical engineering classes... but again - with my current job situation - it's hard to find something that will work.\n\n&nbsp;\n\n \nMy other career interest pertains to skills that are more foreign to me, (which, ironically, makes me want to pursue it more) developing AI. The appeal of this field for me stems from my ongoing interest in cognitive science. During my education, these were the classes that I was very successful in, and enjoyed the most. My teachers really appreciated the projects I would present, and I was fully absorbed and involved. Though I wouldn't say I’m an expert in this area - I wouldn't say I’m a layman either. What I am lacking in is a background in computer science. Though I dedicate most of my spare time to educating myself; tinkering with basic configurations, and reading up on various subjects pertaining to it - I’m looking into taking my technical knowledge to the next level by taking classes geared towards this field. I want to turn the energy from my interest in cognitive science into fabrication, I want to learn how to materialize the thing I’ve only been able to learn about on paper and see in nature, like the mind and consciousness. So these would be the fields that would be more geared towards becoming an algorithm specialist / computer scientist of sorts. Right now I am taking some online courses... but obviously would need to do more to actually dive into this field.\n\n&nbsp;\n\n \n**Ideally** - I would want to find something where I could be involved in the production of both these facets… but I don't know if a career like that exists.\n\n&nbsp;\n\n \n**Creation of a product is the essential goal**.\n\n&nbsp;\n\n \n*I do have a driving force behind this passion that I know is unrealistic but could maybe help contextualize what / why I want to do with my life ( in a diluted way)*\n\n\n&nbsp;\n\nFor the past couple of years, I've experienced this recurring dream :\n \n&nbsp;\n\n>In my old age, I have created the first “true” AI, that manifests itself as a small childlike robot - thus initiating the onset of the technological singularity. I am being interviewed by a woman while holding the robot in my lap. She asks if I have any regrets, and mentions that I have given up finding love, starting a family, and other things of that nature. I well up and tell her that though at the time it might not have seemed beneficial to go through those pains and hardships, finally creating this machine was my purpose and I live with no regret. I feel an overwhelming amount of happiness -- and then I wake up.\n\n&nbsp;\n\n \nThough this is obviously fantastical; this \"dream\" encapsulates what drives my passion for this field. It might make me seem melodramatic (or even make me look like a loon) but I am willing to take any steps - to start making moves towards this career...as long as they are moving me toward the right direction. I just feel like I'm golfing in the pitch black right now... I just want to be able to at the very least see the direction I should be swinging - no matter how far away the hole is. lol god sorry for these corny things i just don't know how to describe myself\n\n&nbsp;\n\n \nI would be immensely grateful for anyone that would be willing to guide me!!",
    "title": "Looking to start a career in robotics - did not get my degree in science - Help",
    "subreddit": "jobs",
    "timestamp": 1514577154,
    "score": 2,
    "keyword": "woman teacher"
  },
  {
    "text": "Advice? Job doesn't satisfy me anymore, should I quit? Long story incoming, I'll try to do a TL;DR at the end, but I can't assure anything.\n\nSeven months ago I was called to work at a toy store (my boss buys containers to Toys R' Us and basically my job is to test the toys and others and give the ok to sell those products). At the next day, June 15th, I started to work in this job. At that time I was on the classical honeymoon. Nice work, nice work hours and nice companions. \n\nThen, the guy that was my companion was sent to the principal office. So I started to work with my boss' brother. He is such a guy. I was made this branch office's boss so  I took the important decisions while consulting with my boss. I was getting more responsabilities and I could do that so I stayed happy with that. \n\nTwo months after that my boss opens the fourth branch office in another city, so his brother takes that office as his own. I recommended a friend and we performed well but my boss didn't think that way. My boss hands his wife the \"personal\" issues like contracts and salaries and others. \n\nThen he puts cameras that are watching me the 11 hours I spent in my job. As I'm kind of introvert dude I give the customer his space and then I go and speak with them. Boss' wife don't like that way. She calls me and tells me: \"OP, you are not caring for the customer. You only say hello and don't do additional things. If we don't sell, how can you expect we pay your salary?\" I try to give my point of view but she says \"No, you are not allowed to say anything. I've been watching you through the cameras many days in a row\". At that moment I didn't knew that that shit is illegal.\n\nThen my boss fires my friend and hires his sister-in-law. She portrays the first days the self-image of a caring woman but nope.avi, she is a manipulative woman who bullies me to the point I've reconsidered suicide (which I had haven't thought in a while).\n\n16/12 she gets and talks me almost yelling me, and forces me to yell her. I don't follow her game but when she talks to me again she tells me that I'm a bad guy and I mistreat her and bullshit aside. I said: \"This is a thing I want to say just once, you are like the guys who bullied me in highschool\". Then she starts to shout at me that she was recording the things that I was saying and she will send it to his brother-in-law (my boss). She doesn't chill out and keeps yelling at me. I collapse, started to cry and run away. I told my boss that I want to quit because of her and he tells me that I should not react like that. That I'm an adult and he should not care about this situation because he is the boss.\n\nHe then tells me that I'm not a cooperative worker and his SIL starts to victimize herself, that I almost treated her like the worst person in life. I received a warning because of my \"run away\" even though what I did was \"run away\" in my lunch hours. After that my boss' wife sends me another warning because of \"I wasn't working like my contract said\" even when my boss told me that I could do that, but he said he didn't told me shit.\n\nSo I've been thinking in quit, but I get paid like 500 USD for my job (in Chilean pesos). What do you think, Reddit? Should I quit?\n\nTL;DR: Job was amazing, but the conditions changed a lot in the next months since I was contracted and the girl who I work now is a manipulative one and I'm not that happy with my actual laboral conditions, but my salary is high compaired with anothers and I'ven't found a job in my profession (teacher).\n\nThanks in advance!",
    "title": "Advice? Job doesn't satisfy me anymore, should I quit?",
    "subreddit": "jobs",
    "timestamp": 1484593237,
    "score": 2,
    "keyword": "woman teacher"
  },
  {
    "text": "I was a victim of abuse and the only one who didn't know it. EDIT: Thank you everyone for your kind words and for sharing your stories. I encourage those above all else! I love reading your personal opinions and your experiences and I'm sure many others do as well. I try to reply to as many comments as possible and I will continue to do so. I cannot express how thankful I am for the support I found in this sub and I hope others will as well!\nAlso: Thank you to micktorious for the gild <3\n--------------------------------------------\n\nI grew up in almost every area you could find a Marine Corps or Navy base, Honolulu, Philadelphia, San Diego you name it; I've been there for at least a month. When my father was finally deployed to Afghanistan my mother and I moved back to her home town of Hueytown, AL to live with my grandparents. My mom, being a college drop out, worked most nights as a server while my grandmother entertained me. Life was different but for me it was all I knew. My dad eventually returned and retired so I thought my life would be normal but nearly 11 years later I find myself living in a world of constant fear and embarrassment far from the normalcy that most children cherished.\n\nWe'll call my mom Joan for anonymity.\n\nJoan had a nasty habit of alcoholism, she drank till she was buzzed nearly every night. When my paternal grandfather would watch me my mother would stay out till 3 or 4 in the morning while he awaited her arrival so he could go home. Joan would arrive smelling like her nights festivities and after changing she would simply tell my grandfather,\"You can leave now.\"\n\nThis behavior never changed, especially after the divorce. Joan would often leave me at home with no food or way to get any when I was only 10, not answering her phone or messaging me for days on end. She would even throw extravagant parties which she told me I was not allowed to attend. I would be forced upstairs and not allowed to come down for any reason except to clean her mess or let the dog outside.\nAs I got older, my mothers antics became more severe. She would tell me I was worthless, that I would never accomplish anything, no one would ever want to marry me and that I would end up on the street. I often ignored the comments, parents sometimes say things they couldn't possibly mean, right? \nThe problem with verbal volatility towards anyone is that they develop a fight or flight reaction if you do it enough, similar to being bullied. You either fight for yourself or run, and I chose wrong.\nI began fighting back, telling her she never even finished college so who was she to tell me I was a failure? She failed classes in middle school and I was an all A student. The comments turned to screaming, the screaming became frantic and frantic emotions lead to frantic actions. I showed up to school covered in bruises, being a sporty child everyone just assumed it was just a rough soccer game or I fell in dance. My dad ignored them, he told me she was my mother and the comments were just \"who she was.\"\nI remember when she pushed me down the stairs, she stood above me, *laughing*. Warm tears rolled down my face, it was just who she was.\n\nWhen I was 12 my dad took me to see a psychologist, we'll call her Anne. Anne was a specialist in child psychology, dealing with children of divorced parents. I saw Anne every 2 weeks for several years, but it wasn't until our 5th session that Anne asked me a question that changed my life forever.\nTears welled in my eyes in horror, even now I can't type the words without feeling them run down my face. Anne asked me if I had ever heard of child abuse or knew what it was.\nAt that moment I realized, everyone knew *except me*.\n\nI was a victim of abuse and the only one who didn't know it.\n\nEver since I left her when I was 13 I've had dance teachers,  old friends, ex-friends of my mother and even my own dad tell me they saw how she treated me. But why didn't I? I was so concerned with keeping my life as normal as possible that I ignored every comment, every hit and every lonely night. More importantly, why did everyone ignore it too?\nWhy did my maternal grandparents gloss over my concerns for her behavior, why did my dad ignore them as well? Why did my own school counselor call Child Services because she thought I was suicidal but never decided to investigate my horrible relationships with female teachers? Or my fear of being touched?\n\nI still don't know... and it haunts me.\n\nNow, nearly 20 years old, my friends call me a survivor of childhood abuse, but I'm not sure if you can call this surviving. Any time a female authority figure yells at me, I have to get up and leave immediately. I burst into tears, which is extremely uncharacteristic of me, I shake and struggle to breathe. I hear the echoes of Joan, telling me to shut up, to stop crying for attention. Sometimes I hear them in my dreams and wake up to my roommate or my boyfriend giving me my medicine to calm me down.\nSometimes I smell her perfume, hear her favorite song or see someone with her poorly permed hair. My heart stops, for a second I'm back in my room, my mother pounding on my door and screaming to let her in, I'm just as scared and useless until a friend asks me what's wrong.\n\nI shake my head, smile and tell a joke.\nBecause that's all I can do.\n\nSometimes I hop on Facebook and unblock Joan, see what she's doing. Usually the same thing, going to football games, partying, vacationing with money she doesn't have.\nThings my father and I can't afford to do.\nI wonder if she regrets anything that happened, I wonder if she even knows what she did.\nI'll never know, more importantly I don't want to. But what I do know is this entire ordeal set off a passion in me that no other sport, subject or speech ever has.\n\nChoosing a major in college was easy, I knew I wanted to help people like myself, if at least to help them with the after math. Psychology was my top scoring job on any personality test I took in school but I had already decided it was my calling. I decided I would bring awareness, before I left my High School, I worked to help women and children of domestic abuse, I set up several peer counseling groups as well as a club for people who wanted to help. I educated teachers in my school on the signs of child abuse and how to help children without breaking any laws or stepping on any toes. I left knowing I made that school a bit safer for people like me then when I came.\nI hope that I can continue this into a long and healthy career as a Psychologist specializing in PTSD, depression and anxiety disorders while raising my own children in the best possible environment, giving them everything I never had; a real mother who only cares for them, a woman who exerts authority in her tone, not her insults and a parent who uplifts her children rather than dragging them down.\n\nI hope to show people the one of the many faces behind childhood abuse, to make feel them a bit less alone.\nMost importantly I hope to be a role model to other girls, and even other women, of the strength behind the suffering and the bright future past the dark present.\n\n*Semper fortis, semper fidelis.* Always strong, always faithful.",
    "title": "I was a victim of abuse and the only one who didn't know it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1492496891,
    "score": 3036,
    "keyword": "woman teacher"
  },
  {
    "text": "Thank you for raising beautiful daughters - Father's perspective. I want to thank the amazing woman who raised two beautiful daughters.  \n\nThis happened yesterday while my wife, my 2 year old daughter and I were at LegoLand Discovery just north of Toronto.  The mall was packed as it was Family Day so all the families were there shopping just as we were.  My toddler is tall for her age so she was allowed entry to play in the indoor jungle gym.  She was having an amazing time and my wife and I were so happy for her as we try to let her experiment and try new things, until she reached a point where she was stuck. She was stuck on a platform that she couldn't get down from as her feet didn't quite touch the ground and she was scared of falling - understandably so nor could she go back up because it was too high.  The nice attendant asked if we wanted to go get her because she was doing that cry that isn't really a cry but more of a cry for help and my wife and I decided to say \"no.\" We wanted to encourage her to make the \"leap\" (maybe 6 inches) onto the platform.  This is where your daughters came in.  They were about 5-6 years old and started to cheer on my daughter. When other children were just going around my daughter they were saying \"you can do it, look at mommy and daddy. They think you can do it\" and with a little bit of help, she was able to put her feet on the platform.  We were both so happy for my daughter, as was she.  Your daughters didn't stop there.  They held her hand through other parts of the gym that my daughter couldn't get to on her own. My daughter followed your kids through tubes, rope ladders and slides which she never would have done on her own.  The expression on her face makes me smile just typing it.  When it was time to leave, my daughter looked up to your 2 girls with a smile bright enough to light up a room and said \"tank you\" and our hearts just melt.  We wanted to thank you ourselves but when I did, it was kind of awkward and creepy. Like here is this grown man thanking me for my daughters helping his daughter, kind of thing.  I wish there was a way to express my gratitude to you now so here's my best attempt:\n\nThank you for giving my wife and I hope that there are children who were raised to help others and do the right thing.  That your daughters will be there to comfort and console the girl being bullied in high school.  That you instilled a sense of \"treat others the way you want to be treated\" in them. That they saw my little girl and felt that being her friend was better than her being alone. I sincerely hope your daughters grow up to do amazing things because this world needs people like them to lead us places that we are too scared to go on our own; to go down the scary \"tube\" or climb the tall \"rope ladder\"; to lend a hand and a voice of encouragement when someone's afraid of falling; to make someone smile instead of crying because they said \"you can do it\" instead of \"do it on your own.\"\n\nI like think my wife and I are good parents, but I will strive to be the kind of parent you are.  You are a great parent and teacher to your daughters.  From our melted hearts to you...Thank You.",
    "title": "Thank you for raising beautiful daughters - Father's perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1487735006,
    "score": 2158,
    "keyword": "woman teacher"
  },
  {
    "text": "What can my mom do? Alright Reddit.. I've had several throwaways and small accounts, but I've never actually posted before. I'm really banking on some helpful advice here. \n\nMy mom graduated from college with a Bachelor's Degree in Biology, but she stayed home with my siblings and I while we were really young. When we were kids, she went back to school to obtain a Master's Degree in Science Education, and she started teaching high school Chemistry. She taught at her first school for a few years, but her contract wasn't renewed because she had run afoul of the head principal (not giving school board member's children grades they didn't deserve, not passing star athletes who didn't put in the work, and disciplining a girl for acting belligerent and skipping class, who in turn went to said principal and accused my mother of being racist and only disliking her because she was African American). \n\nShe found a new job for the next school year at a smaller school district teaching Advanced Biology and Environmental Science, and even though it was a smaller school (the previous high school had been a huge intercity school) her salary went up by about 10k per year. She taught there for 1 full year, and is in her second year at this high school. \n\nHowever, yesterday she was told that because the school can't pass a levy (it's a very small blue collar area who doesn't value education too much) her and a few other newer teachers are being let go and absorbed for the following year. She is still getting payed through the summer, and she's going to finish up the year, but she won't have a job after that. \n\nWe're not going to be without an income as my dad is a police officer and I'm moving out of my parents house when college is finished, but my question is what are her options? \n\nShe put so much into teaching and loves making a difference in her kids' lives, and she's a very good teacher. She's just tired of looking for a new job every couple of years, and anyone who is a teacher knows how hard jobs are to come by. She is a very smart woman, but she doesn't know what else she can do besides teaching. \n\nIs there any type of profession that those degrees can matter in besides teaching? I'm not sure what else to ask but if you guys could take a second and give whatever advice you have, no matter how small. I just want my mom to be happy and I feel bad that she keeps getting screwed by the education system. \n\nI appreciate everything you guys have to offer.",
    "title": "What can my mom do?",
    "subreddit": "careerguidance",
    "timestamp": 1490301586,
    "score": 18,
    "keyword": "woman teacher"
  },
  {
    "text": "UK based student..How do I become a History teacher in Florida? Hey everyone!\n\nI feel I have reached a stalemate in my life and would much appreciate some advice for the situation that I find myself in....\n\nI am 24 year old woman from Cambridge,UK, who has a BA(Hons) degree in History and am just about to complete my Masters in Museum Studies. After giving things some serious thought and consideration, I have decided that I would very much like to be a History teacher however, a History teacher in Florida.\n\nI am fully aware that this goal as a whole is somewhat ambitious seeing as I have no connection to the US whatsoever - e.g a US passport/citizenship - and I understand completely that it is not something that will be easily achieved. I know it will take time, patience and a lot of hard work but, I am determined! Firstly, I have some volunteer experience of working within a secondary school so I am aware of what exactly working within this particular environment entails in terms of teaching expectations, learning/engagement techniques and so on and feel this really is the career path for me.\n\nI have done some basic research on the various routes in which I can become a teacher in the UK and I understand that I would have to be fully accredited here before I could even consider the US. However after that, I reach a point where my mind becomes overwhelmed with what I would need to do to become a teacher in Florida. I have spoken to my career advisers/researched online and there doesn't seem to be a clear-cut guide anywhere on how to achieve this goal.\n\nI obviously know that I would have to take the various/necessary steps to apply for a Green Card and that I would have to take the FTCE to become accredited to teach in Florida however, I feel that there is just so much information out there that I have no clue where to start. I honestly sit for hours trying to make sense of things e.g what test I would need to take/what form to fill in and just feel bogged down in so much information that it sometimes makes me think why am I stressing myself out so much and then at my lowest point, something tells me to give up. I then get myself back on track by thinking of the bigger picture and on I go again.\n\nOn a side note, I was also thinking of trying to bag myself some work experience at a middle/high school on an American Airbase here in the UK in order to assist with my understanding of the school system in America. Would this help in anyway?\n\nThank you for reading guys and as I said, any advice would be much appreciated.",
    "title": "UK based student..How do I become a History teacher in Florida?",
    "subreddit": "careerguidance",
    "timestamp": 1502487983,
    "score": 3,
    "keyword": "woman teacher"
  },
  {
    "text": "Please tell me if hotell conference/reception is at least decent? (sweden) Hello. I'm 22 years old and this is my first course that im likely to actually finish and get a degree.\n\nIve spent a lot of time figuring out what id like to do.\nThe hardest part about it was having to figure it out myself. Isnt it ducking stupid that we have to choose it so quickly, sometimes resulting in us wasting a couple years?\n\nI've moved to Sweden about six years ago. I went to the language introduction school and finished it with a degree in swedish. At that time i was 19 and although my swedish was good enough to be able to hold a fluent conversation with let's say a cashier, I'd still have huge problems reading documents/newspapers and i think that stopped me from pursuing the usual college->university path.\n\nI've settled on a 1 year carpentry course thinking I'd be fine but boy was I wrong. There was no sitting in class. If the teacher had to explain something about the specifics of a certain type of wood or a machine, id be absolutely shocked at the amount of words i simply didn't understand. I didn't know the simpliest things like 'cut', 'board', 'saw' so when it came to more complicated things it was a huge turnoff. I also have a snapback and I realized how hard it would be to work as a carpenter when my head and chest just uncontrollably leans forward. And that was the end of my career as a carpenter.\n\nI'm now in a hotel conference/reception course hoping to find a job behind a desk. Ive also gotten to know a really nice woman who has contacts in the most amazing place I could ever work at as a receptionist, the Turning Torso, the biggest apartment building in Europe, located in the western port, where the architecture just makes it a dream place (mirrors edge style for reference). \n\nThis is really not my dream job, I'd really like to become something more, an astrophysicist for example, but I've decided to settle on that goal later once im at least a little established. Now I need to have a decent job that id enjoy or that I at least wouldnt hate. I live with my dad, he pays 10k SEK (which is way over the average rent) for a ducking basement and I ducking hate it with my whole self. I hold my tears everytime i see those huge spiders on the walls in my room. I try not to think about it but I'm already 22 and I cant really bring anyone home nor have a girlfriend because id never get through saying that I cant invite them home. \n\nCan you please tell me if being a hotel receptionist brings some decent money and if I can hope to become someone after working in this industry for years? My teacher keeps telling me that I shouldve looked to become someone esle than what im studying for right now (yeah i know, good thing for a teacher to say) but i think that with my 4 languages, good maths and computers It's just the right choice.",
    "title": "Please tell me if hotell conference/reception is at least decent? (sweden)",
    "subreddit": "careerguidance",
    "timestamp": 1485435632,
    "score": 3,
    "keyword": "woman teacher"
  },
  {
    "text": "Would a career in nursing, accounting or computer science suit me better? Hi r/careerguidance,\n\nI'm 26 and graduated with a BA in Geography and Environmental Studies in 2014. I've been struggling with a lack of direction and general indecisiveness ever since. \n\nI currently am a consultant at an oil and gas company doing \n a mixture of HSE / document control / admin type work. The lack of stability is making me extremely unhappy. I find myself wishing I had an established career like my friends who are teachers, social workers, nurses, etc. (I know I shouldn't compare myself but this is easier said than done). I'm constantly worried about being 55 and working entry-level retail for minimum wage due to my lack of concrete skills and poor choice of a degree. \n\nI think I've narrowed my choices down to three careers, but am having a difficult time deciding on which one would be the best fit. I've narrowed down my core values in a career to:\n\n1. Stability\n2. In demand (how nice it would be to not have to send 100's of resumes out and hear nothing back)\n3. ~$60,000 or >\n4. Not *extremely* stressful  \n\nI've put together a simplified list of pros and cons (based on my personality, requirements and geographical location) for each position below:\n\n**NURSING**\n\n*Pros:*\n\n* Helping people\n\n* Interest in biology, diseases, etc.\n* Entry level pay: ~$34/hr ($68,000)\n* In demand\n* Can move anywhere and can find job\n* Stability (unionized)\n* Flexibility (can work part time, casual, etc.)\n* Many different subfields within nursing\n\n*Cons*\n\n* Constantly being around people (introvert)\n* Poop\n* Stressful (some positions)\n* Potentially 4 years of schooling; accelerated programs very competitive\n\n\n**ACCOUNTING**\n\n*Pros*\n\n* Working independently (to an extent)\n* Entry level pay: ~50,000/yr\n* Once CPA, in demand\n* Stability\n\n*Cons*\n\n* monotonous\n* sitting all day\n* Entry level positions over saturated\n* Stress\n* 3ish years to get BBA + CPA courses\n\n\n**PROGRAMMER / COMPUTER SCIENCE FIELD**\n\n*Pros*\n\n* Working independently (to an extent)\n* Entry level pay: varies (~50,000?)\n* In demand\n* Enjoy coding and making websites\n\n*Cons*\n\n* Sitting all day\n* Being a woman in a male dominated industry\n* Advanced math.. I'd say I'm 100% average at math and I worry I won't be able to grasp the advanced concepts\n* Ageism - when I'm 50, will I be able to keep a job in this field or will I be replaced with someone younger and more knowledgeable of new technology?\n* 3ish years to get BCS\n\n\nAny feedback would be greatly appreciated! Thank you!",
    "title": "Would a career in nursing, accounting or computer science suit me better?",
    "subreddit": "careerguidance",
    "timestamp": 1505604416,
    "score": 1,
    "keyword": "woman teacher"
  },
  {
    "text": "Karen Straughan's response to \"those aren't real feminists\" *The following is a very informed and highly reusable  comment by Karen Straughan in response to a feminist who thinks the many blatant sexists among feminists aren't real feminists:* \n\n\n\nSo what you're saying is that you, a commenter using a username on an internet forum are the true feminist, and the feminists actually responsible for changing the laws, writing the academic theory, teaching the courses, influencing the public policies, and the massive, well-funded feminist organizations with thousands and thousands of members all of whom call themselves feminists... they are not \"real feminists\".\n\nThat's not just \"no true Scotsman\". That's delusional self deception.\n\nListen, if you want to call yourself a feminist, I don't care. I've been investigating feminism for more than 9 years now, and people like you used to piss me off, because to my mind all you were doing was providing cover and ballast for the powerful political and academic feminists you claim are just jerks. And believe me, they ARE jerks. If you knew half of what I know about the things they've done under the banner of feminism, maybe you'd stop calling yourself one.\n\nBut I want you to know. You don't matter. You're not the director of the Feminist Majority Foundation and editor of Ms. Magazine, Katherine Spillar, who said of domestic violence: \"Well, that's just a clean-up word for wife-beating,\" and went on to add that regarding male victims of dating violence, \"we know it's not girls beating up boys, it's boys beating up girls.\"\n\nYou're not Jan Reimer, former mayor of Edmonton and long-time head of Alberta's Network of Women's Shelters, who just a few years ago refused to appear on a TV program discussing male victims of domestic violence, because for her to even show up and discuss it would lend legitimacy to the idea that they exist.\n\nYou're not Mary P Koss, who describes male victims of female rapists in her academic papers as being not rape victims because they were \"ambivalent about their sexual desires\" (if you don't know what that means, it's that they actually wanted it), and then went on to define them out of the definition of rape in the CDC's research because it's inappropriate to consider what happened to them rape.\n\nYou're not the National Organization for Women, and its associated legal foundations, who lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male.\n\nYou're not the Florida chapter of the NOW, who successfully lobbied to have Governor Rick Scott veto not one, but two alimony reform bills in the last ten years, bills that had passed both houses with overwhelming bipartisan support, and were supported by more than 70% of the electorate.\n\nYou're not the feminist group in Maryland who convinced every female member of the House on both sides of the aisle to walk off the floor when a shared parenting bill came up for a vote, meaning the quorum could not be met and the bill died then and there.\n\nYou're not the feminists in Canada agitating to remove sexual assault from the normal criminal courts, into quasi-criminal courts of equity where the burden of proof would be lowered, the defendant could be compelled to testify, discovery would go both ways, and defendants would not be entitled to a public defender.\n\nYou're not Professor Elizabeth Sheehy, who wrote a book advocating that women not only have the right to murder their husbands without fear of prosecution if they make a claim of abuse, but that they have the moral responsibility to murder their husbands.\n\nYou're not the feminist legal scholars and advocates who successfully changed rape laws such that a woman's history of making multiple false allegations of rape can be excluded from evidence at trial because it's \"part of her sexual history.\"\n\nYou're not the feminists who splattered the media with the false claim that putting your penis in a passed-out woman's mouth is \"not a crime\" in Oklahoma, because the prosecutor was incompetent and charged the defendant under an inappropriate statute (forcible sodomy) and the higher court refused to expand the definition of that statute beyond its intended scope when there was already a perfectly good one (sexual battery) already there. You're not the idiot feminists lying to the public and potentially putting women in Oklahoma at risk by telling potential offenders there's a \"legal\" way to rape them.\n\nAnd you're none of the hundreds or thousands of feminist scholars, writers, thinkers, researchers, teachers and philosophers who constructed and propagate the body of bunkum theories upon which all of these atrocities are based.\n\nYou're the true feminist. Some random person on the internet.",
    "title": "Karen Straughan's response to \"those aren't real feminists\"",
    "subreddit": "MensRights",
    "timestamp": 1493874194,
    "score": 611,
    "keyword": "woman teacher"
  },
  {
    "text": "Male teacher unjustly targeted as pedophile by crazy woman.",
    "title": "Male teacher unjustly targeted as pedophile by crazy woman.",
    "subreddit": "MensRights",
    "timestamp": 1491754322,
    "score": 219,
    "keyword": "woman teacher"
  },
  {
    "text": "A point of irritation about this sub What's the deal with the most frivolous posts making it to R/all?   \n\nEveryday I read this sub and find horrifying examples of institutional discrimination against men and boys.   I find brilliantly written deconstructions of feminist theory.   I find brilliant lectures by figures like Karen Straughan.   I find rare but inspiring stories of men overcoming the odds in a gynocentric society.   \n\nYet it seems like every post that makes it to R/all involves some low effort shit post about feminism or some relatively trivial matter like women hogging seats with their bags on the subway or men having to pay on dates.   I'm not saying such posts should be banned, obviously, I just find it odd that they consistently end up at the top of the heap.   It gives the impression that the MRM is itself a trivial affair made up of whiners with no real concerns.   \n\nAnother type of post that commonly makes it to R/all is \"hot teacher bangs 17-year-old boy.\"   It that behavior wrong?   Yes (since she has institutional power over him).   But it hardly compares to posts I've seen here about women molesting, torturing and killing little boys only to be given a slap on the wrist.   I remember one post about a huge fat woman who molested three pre-pubescent boys in a trailer park over a period of several years and was given probation.   I remember another where a group of women in some quasi-cult locked their boys in cages, skinned them alive and forced them to eat their own flesh; the women were given a few years in prison.  That's an extreme example but you get my point.  \n\nAnd then there's the academic stuff.   There are fascinating studies posted here on a regular basis that effectively refute feminism.   Examples would include [studies on in-group bias](https://news.uns.purdue.edu/html4ever/2004/041213.Goodwin.gender.html), scholarly papers on [female forms of power](http://www.jstor.org/stable/643334?seq=1#page_scan_tab_contents), and non-feminist histories of female rights such as [\"Favored or Oppressed?   Married Women, Property and 'Coverture' in England: 1600-1800\"](http://www.academia.edu/746242/Favoured_or_oppressed_Married_women_property_and_coverturein_England_1660_1800).  \n\nIn the case of the academic stuff I recognize the problem: people generally prefer fast food to eating their vegetables.   But I still see a puzzling emphasis on the *really low effort* and relatively trivial posts verses posts highlighting the hair-raising discrimination that men and boys face.\n\nSo is this just an example of the average person being attracted to the lowest common denominator?   -- As in I'd rather watch wrestling than some high brow documentary?   Is the problem with R/all itself rather than R/MensRights?   (I've noticed that the number of actually sexist or misogynistic posts on this sub vastly increase when we reach R/all).   Is there a conspiracy afoot?  ;)  And finally, what is to be done?",
    "title": "A point of irritation about this sub",
    "subreddit": "MensRights",
    "timestamp": 1499374175,
    "score": 188,
    "keyword": "woman teacher"
  },
  {
    "text": "Woman spared jail for glassing teacher in the face because she's a 'decent member of society'",
    "title": "Woman spared jail for glassing teacher in the face because she's a 'decent member of society'",
    "subreddit": "MensRights",
    "timestamp": 1485362268,
    "score": 169,
    "keyword": "woman teacher"
  },
  {
    "text": "Pedophile Woman: Teacher Raped 14 year old on school property",
    "title": "Pedophile Woman: Teacher Raped 14 year old on school property",
    "subreddit": "MensRights",
    "timestamp": 1513512181,
    "score": 168,
    "keyword": "woman teacher"
  },
  {
    "text": "I couldn't say no. A feminist piece. When I was five I started Kindergarten in Philadelphia. I was one of only a handful of girls in the class. At recess the boys would trip me and push me and call me names. I was small and not a fighter but to keep myself safe I would bite them. Everyday my parents would come pick me up and find me in the time out chair. The teacher would approach me and say, “Harley, aren't you sorry for what you did?” \n\nI said yes because I couldn't say no. \n\nWhen I was in fifth grade I was the only girl to join mathletes. I competed and won. I was the best person on the team. My teammates would tell me that if I were captain boys would feel intimidated by my success. They assured me that they would still let me have a voice but asked if I would be willing to not join the executive board and instead let four male peers run the team. \n\nI said yes because I couldn't say no. \n\nIn middle school I wanted to join the golf team. There wasn’t a girls team and a girl had never competed with boys before. They told me I had to drive a ball 100 meters which I could successfully do. They told me that as a girl, I could only join practice but not actually compete. They said I should be thankful they were even letting me do that. \n\nI said thank you and nodded my head because I couldn't say no. \n\nIn high school I started dating a boy. He was popular and well known in a city I was new to. He was funny and charming and smart. A few months into our relationship he confessed to a locker room of boys that we had had sex despite it not being true. It was important to him that people thought we had and my persistent protest didn't matter. He reminded me how much he cared about me and that I could depend on him for support at my new school. His friends would excitedly ask me if it had happened. I swallowed my pride and the truth. \n\nI said yes because I couldn't say no. \n\nMy first year of college I met a boy that lived close to my dorm. We hung out many nights and became close friends. He was interesting and made me happy but never seemed too interested in me. My roommates assured me that if I gave up my modest fashion sense I could attract him. They dressed me in a skin tight red dress. They smeared dark makeup on my eyelids. They pulled and straightened my hair and put me in heels I could hardly walk in. When they were done they took me to a mirror and proudly said, “You look beautiful. He's going to love it. Don't you?” \n\nThrough tears and disbelief in how different I looked I said yes because I couldn't say no. \n\nIn my second year of college I was out late studying. I didn't want to walk home in the dark so I called a taxi. I made clear to the driver that I had a credit card and no cash. He said that was fine and started the meter. 4 dollars later I tried to hand him my card. He complained that the card company would take a percentage and that this was too low a fee. I again explained that I had no cash. He locked the doors and became aggressive and angry. I paid him fifteen dollars. An eleven dollar tip to make sure I could get out of the car unharmed. As I left he said, “See that was easy wasn't it?”\n\nI said yes because I couldn't say no. \n\nIn my third year of college I was walking down a back road in broad daylight. There were other students on the street and I felt very safe. I was wearing a summer dress and flats. An intoxicated homeless man grabbed me in places I did not consent to. I ran, crying, home and contacted the police. After several months of meeting with detectives and correctly identifying my assailant he spent one night in jail. My case worker called and proudly told me, “I told you, that if you are honest and diligent, the justice system does not fail. Aren't you proud of what we've done?”\n\nI said yes because I couldn't say no. \n\nNow it is my last year of college. I have become loud and to many people annoying. I call out the blatant sexism most of our society is willing to ignore. I worked hard to put a competent woman in the white house and had to watch her say yes too many times. I marched with thousands of women to protest an encourager of rape culture from sitting in the oval office. \n\nFor 22 years of my life I have been conditioned to say yes. Today I start to say no.",
    "title": "I couldn't say no. A feminist piece.",
    "subreddit": "Feminism",
    "timestamp": 1492797835,
    "score": 25,
    "keyword": "woman teacher"
  },
  {
    "text": "My Harvey Weinstein was my high school teacher. This is my story. It happened in a small, wealthy, Catholic high school--run by Catholic brothers, fairly conservative, extremely sexist, extremely homophobic, extremely white, highest position held by a woman was guidance counselor. As a senior, I chose psychology as my second semester elective. The instructor was an alumni, been teaching a few years after 20+ years in law, and well regarded in the school/entire community because he was also the football coach. His son was a student in my year. To the football team, he was not only Coach, he was also their best friend's/teammate's dad. People hung out at this guy's house. This teacher was also my home room teacher all year. He knew exactly what rules to break to make him popular as a teacher--never marked you late no matter what time you strolled in, let you do homework, and didn't care if your shirt was tucked in. Every female was \"sweetheart\". He gave every male a personal nickname. He was very dad-like. \n\nSecond semester, day one of his class, he shut the door and it started. Basically, we were told that what happened in that class, stayed in that class. We were going to talk about things that the \"boss\" wouldn't like--sex, drugs, rock and roll type things. He set up an \"us\" against \"them\" mentality really early. He told us we were going to get really close. He made it clear that if you weren't going to be cool about it, you needed to drop the class. Then, he specifically stated: \"if i ever make you uncomfortable, come to me and we'll work it out, don't get an administrator involved and ruin it for everyone else\". He started slow: making stupid sex jokes, telling us about his glory days as a lawyer in the 80s, making comments here and there about women's bodies in general. Then the \"jokes\" got a little more graphic--throwing in lewd hand gestures. When we got to a lesson that included sexual harassment, he told us that sexual harassment doesn't happen anymore. Women routinely lie or exaggerate and it ruins men's careers. And when men do cross a line, it's because they don't know any better and women need to lighten up. In his unit on abnormal psychology, he thought it was important for us to know that \"some doctors\" say that homosexuality fits the criteria of a mental illness. About this time in the semester, his style of dress started to became more relaxed. He started wearing basketball shorts with no underwear rather than his usual khakis. This was a very small classroom so he was less than a foot away from you if you sat in front, which I did. He told us that he had \"friends\" that commented on how hot the girls were at our school. \n\nOne day at lunch, sitting with 3 girls from my class, I worked up the courage to say, \"so Coach is like...a creep, right?\" The response was essentially \"yeah, you didn't know?\" He only taught 2 classes each semester. All seniors. He was a guaranteed A. That's how he got away with this shit. Nobody is going to rock the boat a few months before graduation and he knew it. Right before final exams we played his version of \"Girls ask Guys\". We were encouraged to ask ANYTHING, without embarrassment, because questions were going to go in a hat. What happens in class, stays in class, remember? We were graded on our discussion participation but we could say \"pass\". A lot of sex questions came up because we were all 17/18yr olds trying to play this demented man's game. We went around the room and were pressured to talk about sexual fantasies, masturbation habits, penis size etc. There was several days of this. Looking back, I think he humiliated us for his entertainment. This was in 2010. Last I checked, he is still teaching. Every word of this is true and I would testify in court if his day ever comes.",
    "title": "My Harvey Weinstein was my high school teacher. This is my story.",
    "subreddit": "Feminism",
    "timestamp": 1508369435,
    "score": 7,
    "keyword": "woman teacher"
  },
  {
    "text": "People making you feel bad for your right to choose I have ben dealing with a creepy dude leering/borderline stalking me in school for 2 years, and when I finally mustered up the courage to tell my English teacher (I have anxiety, makes everything harder lol) she had sympathy for HIM, but not the person who has been constantly feeling victimized, uncomfortable, and upset for 2 years. \nWell this morning, I was bored and browsing the Social Anxiety Support Forum, and I was kind of appalled. Every time a woman talked about feeling uncomfortable around a man, calling them creepy or anything of the likes, everybody attacked her. It was all these \"niceguys\" who were saying she should be lucky to have the attention. Lucky to have the attention from somebody that robbed her of her feelings of safety. Just go on Google. Search \"creepy man\" for Social Anxiety Support Forum. And watch before your eyes, as people tear down uncomfortable women for being creeped out by somebody making them feel unsafe, even though they have a right to safety. For choosing who and who they don't want to date. Making them feel bad for turning down somebody who clearly was sending the wrong vibes. Smh. Hate to break it to them, but we won't bang every sleaze that comes up to us and says \"heeeyy pretty girl.\"  It makes me so upset that they expect us to want to do that in the first place. They're creepy because they reek of entitlement. Nobody's entitled to my vagina. I choose who I let in very carefully. We have a right to choose.",
    "title": "People making you feel bad for your right to choose",
    "subreddit": "Feminism",
    "timestamp": 1490475525,
    "score": 9,
    "keyword": "woman teacher"
  },
  {
    "text": "the effectiveness of the female perspective in podcasting I am a comedian, and I host a podcast with my girlfriend about the complexities of dating, and understanding the opposite sex. I want to tell a quick story about how I changed perspectives on the issues that women face on the day to day grind.\n\n'The Sex Actually Podcast ' is equal parts stories of sexual experiences, both successes and failures, and also cautionary tales of where past relationships have gone wrong. We talk about what drives us, improving communication in our dating lives, and how our family upbringing molded us into who we are today. One thing I've learned spending countless hours chatting with Tasha, my live-in partner and cohost, is that women don't always have the luxury of sharing stories of the freedom of a drunken night gallivanting around town. Too often the story ends with a man fucking up a woman's trust and freedom to be present.\n\nI guess this post is a 'feminist teacher appreciation post', which I look forward to doing more often. Instead of shaming me for not walking a mile in her shoes, or shunning me for not being able to relate, Tasha takes the time to explain to me her day to day experiences. I've learned to listen. Just last week, an innocent trip to the grocery store ended with her being followed around several aisles because a man decided it was the appropriate market to be hitting on women. He didn't accept her social cues and commented on her boobs by telling her 'looks like your girls are out to play'. Ya dude, Frozen Food aisle is the new tinder. And the thing about men is, he would have never made her feel uncomfortable if I was shopping with her. We respect women in the presence of other men, but then when alone, cowards like frozen food guy emerge with their witty pickup lines.\n\nTasha will never know the freedom that I have to get drunk with friends, stumble home on the subway, interview for a job solely based on merit, and so many other countless basic rights. I am a comedian, it is a privilege to speak my opinions. Tasha works as a model. She's a brilliant thinker, very well read and a major advocate for the feminist movement. Yet, she is encouraged to not show emotions, never mind take a stance on social issues. Some men want to look at models, not hear them think. It makes the models human, and that ruins their experience. Can't keep that boner hard if these models keep yapping about ways to improve humanity. Yuck.\n\nThis past election season Tasha posted an instagram pic in support of Bernie Sanders. She was nervous to share her opinion, as most of her photos are lifestyle images, showing off a carefree and opinion less side of her. Most of Tasha's following was supportive, but it only takes one asshole to highlight the issues women face. “You're not pretty enough to offer thoughts on politics. UNFOLLOW”. Quick research showed us that this comment was written by a dude who is a college football coach and father to a teenage girl. THIS opened my eyes to the shame and control of thoughts that men put on women. Now clearly this man has issues, but he said what a lot of men think. 'Not now honey, the men are talking...'. A quick attempt at doing something meaningful that doesn't exactly fit into the confines of her job description was swatted down effortlessly by a stranger online. I was there to comfort her, but the helpless feeling of not being able to confront this dude face to face helped me realize that women feel that feeling everyday. Not being able to fight a fare fight. Unfortunately it took the ignorance of another man to show me which side I want to be on. Tasha and I bonded that day.\n\nWhat I love about our show and our relationship in general, is that we challenge each other's point of view. We are fortunate enough to be having a dialogue together that I've never had with women before. We don't always agree on every issue, but I hope other couples are having similar discussions. Understanding each other will help us resolve the issues that come from a lack of empathy. Respect isn't something owned only to our mothers, sisters and wives, but also to the stranger at the grocery store, or woman walking alone on the street. Men, we aren't losing our seat at the table, we're just finally letting women enjoy the meal with us. Lets listen.\n\nThanks for reading my 'appreciation post'. If you want to listen to our podcast, here's the link. Thanks so much for the love! -Dave Neal\n\nhttps://itunes.apple.com/us/podcast/sex-actually-with-dave-neal-and-tasha-courtney/id744156889?mt=2",
    "title": "the effectiveness of the female perspective in podcasting",
    "subreddit": "Feminism",
    "timestamp": 1512500477,
    "score": 5,
    "keyword": "woman teacher"
  }
]