[
  {
    "text": "Graduated college but having trouble finding a good job. Should I join the military? I'm a 26 year old woman in Florida, I graduated with my Bachelor's of Science in Psychology exactly 1 year ago now. Before I went to University I worked for several years in cell phone sales and did alright but always wanted more for myself than to become a retail manager. I genuinely wanted to become a psychologist or a therapist but I underestimated how much school actually would cost me both financially and energetically--by the time I graduated last year, I was fully burnt out on the student life and 30k in federal student loan debt. I was eager to find a good job and start working and making money, and although I attended some job fairs at my University, I really did not see much that I really wanted to do or was qualified to do.\n\n Part of the reason I chose Psychology (instead of something more marketable like Health/Nursing or Technology) is because I have very, very weak math skills, but my reading/language skills are through the roof. I literally practically failed the math portions on the SAT/ACT but was in the top national percentile of the reading/writing/language portions of the tests, which is how I managed to even make it into college at all.\n\nSince I've been graduated I have avoided going back to typical retail jobs or jobs at the mall and tried to focus on more professional roles. I tried a call center job briefly during college (awful). I served as a substitute teacher for several months before I realized I don't actually want to be a teacher (the public education system is fucked right now, seriously) and it would ultimately cost me a couple thousand to get certified as a real teacher and recieve the pay and benefits (I have no money and no credit options, and no interest in taking out more loans). \n\nI decided to get certified to work in insurance so I studied for about a month, got a 4-40 license, and worked for a few State Farm agents. I can't even explain how ridiculous my experience with SF agents has been, the most weird employment where the businesses are failing or only a few years old yet the agents are only in the office a couple hours out of the day or don't come to work at all, yet are upset wondering why they are at the bottom in sales in the area. Weird office politics where there's one older person basically running the office for the agent and one spanish person to handle the spanish customers but otherwise extremely high turnover in the office. One office I worked for, the agent told me she had 30 employees come and go in the last two years, but had no idea why (because she was literally only in the office one day a week). A different agent convinced me to decline a job offer with a different company so I could be the only sales person in his office (more money for me and less competition) and then fired me two weeks later (over text message) after paying me half of what we agreed on and having no reason or explanation for what I did wrong besides \"you're just not a good fit\". I even asked for constructive criticism and he refused to give any. Very confusing, infuriating and weird! \n\nAt this point I'm just very frustrated, broke and losing hope in my job search. I always played with the idea in my mind of joining the military  to get some experience, structure, travel, benefits, etc. But if I'm being honest, I'm a hippie and I don't bleed red, white and blue like I know you probably should if you're going to serve. Still, the idea of going on an adventure and getting in better shape, meeting loads of new people, gaining new skills and hopefully making it through the four years with a GI Bill and some benefits at the end, seems like a much better deal than sitting on my computer everyday shooting off emails and applications for $10 - 12 an hour jobs, having no health insurance, and just feeling like a loser. I live with my boyfriend and my lack of stable income is killing our relationship with stress, seems like we'll probably break up soon. My mother died last year and no one else in my family really seems to care at all about me. If I die, I'm pretty sure only my grandfather would be hurt, but he is very old now and will probably pass away soon. I don't feel I have as much to lose as I have to gain.\n\n Should I do it or is it a bad idea?\n\nTl;dr: Graduated college a year ago, a good job with a good company has been difficult. My family is pretty estranged from me and my relationship is on the verge of breaking up anyway. Should I go join the military?",
    "title": "Graduated college but having trouble finding a good job. Should I join the military?",
    "subreddit": "jobs",
    "timestamp": 1560025629,
    "score": 38,
    "keyword": "woman teacher"
  },
  {
    "text": "I did it. I reported my sexual assault. This is exhausting. I just need to share my story.\n\nI was sexually assaulted by a coworker two weeks ago. It came from totally out of the blue. I sent him a message explaining how I felt, and his response made it clear that he did not take it seriously. I then decided to take action.\n\nI used the options available to me though my workplace. I decided not to involve the police, for a variety of reasons. As of today, his contract is being shortened to June (instead of two years beyond that). He is also on final alert; one toe out of line and he will immediately be fired. \n\nThis has all been so fucking draining. \n\nI really thought about just letting it go and avoiding him. But I am in the most supportive environment I've ever been in for this sort of issue. It was not a horrible assault, on the scale of severity; he was not violent, and I was legitimately not worried about him escalating to oral or vaginal forced sex at any point. I felt like I could handle re-living it, when many victims can't. I felt like I had a good opportunity to take action, and from that, an sense of duty to do so. For myself, for every woman who has been sexually assaulted, and especially for the women who can't bear to think about their assaults in order to get justice. \n\nMy boss (who I reported to) has been phenomenal throughout the whole process. He has been amazingly supportive.  We both are happy that the course of action was determined so efficiently, and I am pleased that there is a tangible result for what happened. \n\nI've been a shit teacher since it happened. I've missed a really important meeting. I've had a dream about being sexually assaulted by a man I trust. My eating is out of control. My sleep habits are shit. I've got piles of dishes in the sink. \n\nHe's not a dick. He sexually assaulted me, but I can see the other parts of his life. He is apparently a great teacher. He doesn't drink, do any other drugs, eat meat, or any other of a number of bad habits. He tries his best to be an honest, hard-working man. He's tall, dark, and handsome. He's well-traveled and well-educated. And based on his responses in the recorded interview, he 100% legitimately just doesn't understand how what he did is sexual assault. And I believe him. At no point have I ever thought he wanted to hurt me, or that he even thought what he was doing could be hurtful. It doesn't excuse what he did, but he is blindsided. \n\nI was really hoping that he would just be fired and then I wouldn't feel guilty. If he just went away, I could deal with it. I was mentally prepared for him to be arrested. But instead, I'm going to pass him in the hallways of the school until June. I might see his wife and young children from time to time. I haven't met them yet, and I dread seeing her for the first time. I already want to scream every time I hear someone casually mention his name, because 50% of the time, it's followed by some variation of \"the nicest guy ever!\" And he is nice, incredibly friendly and selfless, in every other interaction I have ever had with him or heard of him having with someone. He just doesn't respond appropriately to \"No.\" and physical resistance in dark places. \n\nWe both agreed to confidentiality. So, he can't slander me or the school for firing him without evidence. I can't spread word about him. I wanted it to stay quiet, and I welcome it, but it means that I can't talk to anyone other than the one fellow teacher/friend I told before reporting. We work at a boarding school a decent ways away from...anything, really. I have one person that I can talk to face to face about this, and this week, he isn't here. \n\nI've spent at least an hour, usually closer to two hours, every damn day since the assault actively doing something related to it. Meeting with my boss about options. Being interviewed for clarification questions. Gathering screenshots. Writing the most detailed account I possibly could about two hours of being assaulted. (Boy, that was a fun one.) Talking through everything with my teacher-friend who is in-the-know with some wine in hand. Listening to my attacker's version of events and his reasoning. Squeezing my pillow as hard as I could while repeatedly saying \"I said 'No!'\" as loud as I dared into it at 1am when I couldn't fall asleep. \n\nIt was so stereotypical it hurts. He told me he \"couldn't resist.\" He called me a \"tease.\" He said \"Please\" over and over as though that made everything okay. When interviewed, he claimed I never said \"No.\" He said I must have \"changed my mind\" afterwards. \n\nIn short? It's true. Reporting is so much fucking harder and worse than the event itself. And if this is how much it sucks for me, a relatively unemotional person whose assault wasn't severe by my own standards, I can only be horrified thinking about how much worse it could be.  My friends and boss have called me strong for doing this. I don't think I need to be all that strong. I will gladly deal with this if it is one step closer to more women not having to do this, and for women whose assaults were worse to not have to gather 10 times the amount of strength needed for what I'm dealing with.\n\nI don't think this is in the best order, by my thoughts aren't in a usual logical sequence. They keep jumping around.  I can think rationally about the chronological events and options for moving forward, but it's like my brain can't process the emotional response. I think that's what this post is for.\n\nTL;DR: Being sexually assaulted sucks. Reporting is way worse. My attacker genuinely isn't scum of the Earth. This feels like a #MeToo victory, but a painful, bittersweet one.\n\nEdit: Y'all, I eat meat, and I can still call it a bad habit. I listed it because HE, for religious reasons, considers it bad and therefore avoids it. \n\nEdit 2: For those confused and wanting details, I think this should cover the basics - It was a semi-public, dark space where he was between myself and the exit. \"No\" means no the first time, and the second and third and 15+ time. Men, when a lady says no to touching your dick, don't physically grab her hand and try to pull it to your crotch. Bonus points: Don't do it more than once. Don't take your dick out of your pants and try again in case that suddenly changes her mind. And in reverse, don't try shoving your hands at her crotch after physical blocks and \"No.\" Overall: \"No\" =/= playing hard to get (the part that he didn't seem to understand.)",
    "title": "I did it. I reported my sexual assault. This is exhausting.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548081972,
    "score": 11493,
    "keyword": "woman teacher"
  },
  {
    "text": "I got pregnant in Saudi Arabia. I found out I was pregnant in a mall bathroom in Bahrain. I couldn't even buy the test in Saudi Arabia without fear of someone asking me for a marriage certificate. I'd been living there for 9 months and working at a University Preparatory Program with other ESL teachers. We all lived in a secluded compound and though we didn't have to abide by the rules of the Saudi women, my mind automatically turned to the prison we passed daily. An unmarried, unaccompanied woman. If I had been from any one of the countries with a less powerful strategic alliance I would have likely been jailed or worse if anyone found out. As an American, it was more likely that I would be deported. I told my boyfriend, of course, not that he was much help. He heavily pressured me to get an abortion before I even had time to process the position I was in I wasn't young; I could have done it. I even would have wanted to, if he had supported me.  As it was, he didn't and I didn't feel it was my right to force fatherhood on anyone. Not that anyone blamed him. \n\nI was stuck in a position where I was 5 weeks pregnant in a country where walking outside with a man who wasn't my husband was a crime. The stress was unimaginable. I contacted Women on  Waves and they promised to send a pill to a hotel in Bahrain. I requested an 'exit visa' for the weekend and gained permission from my employer for a weekend away. They didn't know why nor did they care. The bosses escaped every weekend to drink and sleep with prostitutes. They understood the need to get away.\n\nThe pill never came. We spent the weekend checking around at other hotels, seeing if a package had been sent to similar sounding guesthouses by mistake. My boyfriend got angry with me when I started crying, telling me it was just a clump of cells. I struggled with the decision I had to make, the frustration of being unable to have safe and easy access to an abortion, and the immense stress of worrying about what would happen if anyone found out.\n\nIn the end, I flew back home. I just needed to be with my family. My wonderful, amazing father picked me up from the airport and asked me what I wanted, which was the first time anyone had. I told him I didn't really know and asked him what he thought was best for me. He told me that he thought it would be better for me to wait until I was with someone who wanted to have children with me \"if I could live with it.\" It was so simple, but it was the first time I'd had anyone act like they understood that it was a hard choice, and that even if it was better for me, I still had to be able to accept it. That was the support I needed to go make the appointment. The only picketer was a sad looking older women who had a sign that said \"I regret my abortion.\" \n\nI don't. I'm glad I made the choice that I did, when I did, and now have a beautiful one year old daughter with a man that is a great father and husband. \n\nI'm thankful I don't live in the U.S. any longer. I've lived with the fear and uncertainty of being in a place where I had to hide my pregnancy and go away to try and have a chance at freedom of choice. I've lived with the stress of having so personal be governed. I may have had a hard time making up my mind as to what I wanted but at the end of the day I was able to make a choice. It hurts my heart what is happening in our country and that so many women will be left feeling scared and alone. I was in my mid 20s with a supportive family and financial resources and it was still one of the hardest experiences of my life. I can't imagine being a teenager, or lacking the financial resources to go to another state, or being in an abusive relationship and having to decide what to do. \n\nI am the one in four and I stand in solidarity with others.",
    "title": "I got pregnant in Saudi Arabia.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558288159,
    "score": 6105,
    "keyword": "woman teacher"
  },
  {
    "text": "I'm only 19 (F) and I feel like my life is over. I'm tired. First off, I know this is going to sound like I'm a spoiled brat and I'm being ridiculous and I'm an idiot, I know. But I feel like if I don't scream into the void it'll keep eating me up like a parasite. And it's not one of those \"I'm a bad kid who does drugs\" tales, because I've never touched drugs and I don't plan to, and no, I don't have an STD or a baby.\n\nI was homeschooled as a kid, and my parents were kinda hippies, living in a small country town. It was a bit sad for a lot of reasons I just won't go into. When I was 8 my parents got divorced. It was really messy but they tried their best to keep my little brother and I out of it, but of course we inevitably saw and heard things that weren't so great. My dad moved to the city and had some awful, awful girlfriends while he continued his job as a music teacher. One was evil and abusive, one was crazy, one was too young, etc. He was suicidal (which I wouldn't know til later) and very, very depressed. My mum was lost, and didn't know what to do. She got a job as an assistant dentist and met a great guy who became her boyfriend. I watched my mum become a totally different person from her former hippie-self, same with my dad.\n\nAt this point, I've been worrying about my parents for years. I'm 10 and I'm starting at a public school in a tiny town. Yea, my little brother and I were bullied pretty badly. I eventually made a friend and then by Year 6 I had a little group of me and 3 others; we weren't popular but we had fun. Year 6 wasn't too bad, and is probably the only good year I can remember without some kind of tragedy. I'm gonna speed up the next bits because they're harder to talk about.\n\nI'm 12, a good student and a hard worker, so my grades were great. My mum got cancer. She's 39, and she's got breast cancer. My dad remarries and the lady he marries is awesome. She cares for my brother and I. My dad cheats on her for a woman (who is also quite nice) who has 2 kids. My mum's cancer is gone, then suddenly back again, and everywhere. She takes my brother and I, and her long-term awesome boyfriend, to see Katy Perry in Melbourne as a fun 'last adventure'. 6 months later she's gone. I watched her go, the one person who loved life so fucking much, the optimist, the Buddhist, the woman I watched hippie dancing in the rain as a child, fade to nothing. It broke my heart. She was 41.\n\nI'm 15 and I don't know how to talk to my dad and his new girlfriend (and later wife). I stay with his ex-wife, and I move schools. I go to a private school in the city now. My friends from my old school all but drop me. I make new, great friends. I still feel alone.\n\nI work out how to see my dad and I split time between his ex and his place. I've been a split house child since I was 8, but it hurts. They have a lot of issues and still don't see each other or really ever speak. My awesome, funny grandfather dies of lung cancer in the same hospital, and I relive my mom dying all over again. I miss him so much. My gorgeous grandma is devastated, and even now she is just as depressed as when he was sick. I wish I could help her. I have an affair with a boy from my school, older than me by a year. His gf is insane and says she'll kill herself if he leaves her, and he's got his own sad stuff going on. The whole thing was tearing my heart up. I don't, and never will, believe in true love, not after all the divorces, cheating, etc. It goes on for a year, me being the 'other woman', crying myself to sleep at night because he 'won't pick me'. Then he does, except I feel as though I can never trust him. Honestly, we're both really happy to have made it out the other side together, and he’s become an incredible human who works hard and loves me a lot. But I can’t shake my issues, and we have to talk about them a fair bit (less nowdays). \n\nI work my ass off during the HSC, and I get a great score. The score I wanted, the score I needed to get into Law at a GREAT uni in the BIG city (Sydney). Even better, they give me an offer straight away! Except I can't afford to move.\n\nI decide to take a gap year to earn the money, and defer my Uni offer for a year, but my workplace is toxic. I try so hard to be lovely and happy and perky and it all just gets thrown back at me. I'm miserable and being bullied, so I quit. Now I have no money. I have to pay rent, etc. I feel like shit. I need a new job and there are barely any available. I won't be able to move unless something happens. I worked so hard, studied so hard, begged for people so hard, and it's all exhausted me. I don't really see my mum's boyfriend and his family anymore, people who I loved for years. I have 3 blood family members left. Both my parents were only children. My dad, my brother, my Belgian grandmother. My mum's mum hasn't been seen or spoken to since my mum died. (I’m going to add that she has been difficult my entire life, a bipolar drug addict. Hence the reason I will never touch a drug, ever. That and I don’t like the idea, at all.) My boyfriend is amazing, but I still have so many issues because of how it all happened. I want to go to uni in the BIG city so badly, the thing I worked so hard for, but it seems so out of reach and it's not fair. I'm depressed.\n\n\nI feel like I've been depressed so many times. I spent my childhood and adolescence worrying so much about everyone else. I have really awful anxiety. And the root of my confession is that I feel so fucking guilty for it because people have it so much worse off than me. My family has never been truly dirt poor, and they love me, and I've never been abused. But for some reason, tragedy won't leave me alone. Things simply go tits-up no matter how hard I try and how much effort I pour into things. I just turned 19 and it feels like I've lived a lifetime. I feel like my life is over, I grew up too quickly, and if one more thing happens it'll push me over the edge to where I can never, ever come back. I can never shake the feeling I'm being selfish, ungrateful, etc. Like I don't deserve to be depressed.\n\n\nTL;DR: Shit things have happened, and I feel like I've spent so much of my life depressed and working so hard that it's over. Everything that's happened has still given me a loving home, no poverty, no drug use, etc, so I can never shake the guilt I have over feeling this way.\n\n\nEdit: Thank you so, so much for all your replies. No matter how big or small, I'm getting through them all. Those of you sharing your own personal stories, you are all incredibly brave; THANK YOU. I've clarified a couple of things in the post, just in case anyone was getting confused, and I apologise for the messy writing style (I was at a low point). Just because I can't reiterate this enough...thank you.\n\nExtra Little Edit: I am taking all (or at least, most) of your suggestions on-board with an open mind. :)",
    "title": "I'm only 19 (F) and I feel like my life is over. I'm tired.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1561791710,
    "score": 1550,
    "keyword": "woman teacher"
  },
  {
    "text": "In trying to show me why I'm being degraded in my \"side job\" as a pro dancer, woman degrades me So I am a 23 y/o professional dancer for a football team. I will often use the term \"cheerleader\" instead so people understand what I mean, but *technically* we are dancers and we are called the dance team. We don't yell cheers and we don't stunt (throw people in the air) or tumble. I was a Division 1 cheerleader in college so I DEFINITELY know the difference between cheer and dance… and we dance. \n\nWe had a game this past Saturday and always have a tailgate party outside the arena a few hours before kickoff. My teammates and I make appearances at said parties. \n\nWe made a quick stop to the party on Saturday since it was 95 degrees but felt like 100+ and we didn't want to be out there long. As we were making a round, a woman came up to us. She's W. \n\nW: The cheerleaders! Ohhh, since you're cheerleaders, can't you cheer? \n\nUs: Haha oh we don't actually cheer, we are dancers! (We get this a lot)\n\nW: Well since you're ChEeRLeaDeRs, can't you do a little rah rah anyway? Rah rah rah! Go team go! Fight team fight! Rah rah! \n\nMe (starting to get mildly pissy due to heat & the fact that I had woken up at 4:30 that morning to film a news segment about the game): We're dancers, you will see us dancing on the field but we don't actually cheer! \n\nW: Oh, so what? You're not the cheerleaders, so you're just the pretty girls that dress in two piece uniforms with crop tops and tiny shorts and come take pictures with the men? \n\nMe: We are the dancers. \n\nW: No. You are CHEERLEADERS. It is WAY classier and more respectable than \"professional dancers\". \n\nMe: We are called the dance team, you will see us dancing in there but we definitely won't be doing cheers. \n\nW: CHEERLEADERS. Don't degrade yourself like that. It's not classy. Do you even do anything other than take photos? Are you just the pretty girls? \n\nAt this point, I'll add that my group was walking away and she kept following us. As this was happening, we were getting set up to take pictures with our sponsors and fans. She was asked to move out of the shot because she stood in front of our group talking at us. She finally moved off to the side, and KEPT. GOING. as we were taking photos. I would've kept walking or I would've gotten security, but we were temporarily stuck. \n\nW (from the side of the photo op and pointing at me sneering): You're worth so much more than this. Do you even have a college degree? I bet you don't. \n\nMe (smiling from the photo op): I have a Bachelor of Arts in Creative Arts. \n\nW: Oh yeah? And what's your day job? Are you even doing anything important? Is this all you do all day? Just look pretty?\n\nMe: I'm a Teacher's Aide for a kindergarten class. \n\nW (points at my friend next to me): And YOU. You can't be possibly doing anything. You are worth so much more than this. \n\nFriend: I'm in nursing school and see patients at a pediatric office. \n\nAt this point, the photo op ended. The woman started to say something else but my group blew past her. \n\nI just cannot handle her perspective. In trying to show us the error of our ways and prove that we are used as nothing but eye candy, she degraded the hard work that we put in. Not only are we professional athletes with years of experience who train for hours each week during our 11-month-long seasons (we get two weeks off for auditions for the next season), we are community ambassadors and spend countless hours giving back. I personally have made 30 public appearances so far this season. I have attended Pop Warner cheer practices for little girls, health fairs at schools, Disability Center events to work with the residents, and so much more. \n\nI am UBER feminist and uber liberal/progressive and that really, really bothered me. This woman acted like we are stupid and naive and don't understand the damage we are doing to ourselves and to the place of women, when she couldn't have been any more wrong. For what it's worth, my franchise HIGHLY emphasizes our role and consistently portrays us to the community as intelligent, well-rounded women who work hard and also happen to dance during games… hence the news segment I had filmed that morning. \n\nAnd you know what? I feel incredibly empowered and powerful in my two-piece uniform. My self-confidence has skyrocketed since I've joined the team. I like to look good, and when I look good I feel good—so sue me. That is my right as a woman and I'd never deny another woman that power.\n\nEdit: I just posted another experience I had just last night, if anyone is interested!",
    "title": "In trying to show me why I'm being degraded in my \"side job\" as a pro dancer, woman degrades me",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1563899009,
    "score": 689,
    "keyword": "woman teacher"
  },
  {
    "text": "Learning opportunity: what is the solution to abuse in residency? So I posted a different topic yesterday and let’s just say it went a little sideways. Did some reading, called some attendings, feel like this is a worthwhile discussion.\n\nWhere my bias comes from is a product of my generation and training so let my lay my framework and see if we can reach some mutual understanding. Grew up in the eighties, it was a different time. Words back then didn’t carry the same social stigma now that they did then not to say the people hearing it weren’t hurt by it. Also, as a guy, ribbing each other was constant and could get cruel and mean but most everybody got along. Bullies were usually physically intimidating or small guys with larger than themself personalities. Trained in a community hospital and now work in a University hospital and community hospital. \n\nIn training we had three abusive attendings and one I didn’t get along with. One, let’s call him Dr R would get off the handle and berate some of my seniors. I never saw the wraith but after commiserating with a colleague we could see how bad it could be for some people. My response when I had interns was to prepare them for his pimping and step in and take the fall if they didn’t have the answer. He once yelled at an intern who was 6+ ft and when the intern stood up he walked away. The other was a Dr J, he was just a cantankerous little doc and he once berated an attending from behind thinking it was an intern and was mortified when they turned around. Still remember what she said, you shouldn’t apologize to me because I’m an attending, you just shouldn’t talk to anybody that way. There was a Dr C who wasn’t ever verbally abusive but you wouldn’t get the same teaching if he didn’t think you werent interested. Amazing teacher though if you got his teachings. The only one I didn’t get along with, not to say people got along with me, was a Dr M who started yelling at me when I shielded my interns. Well, we got into it, told her that the only people with a right to yell at me are my parents, that ended with a meeting with the associate program director and a truce. We never really got along after that but remained professional. Program director never put up with it and let’s just say they won they lost the battle but won the war. \n\nNow at work, there are some people who are, who carry a reputation for being real tough/mean. Most trainees who finish that rotation actually love them and remain in correspondence in their professional careers. Most others are generally nice and well-liked. Definitely there are surgeons around and senior fellows who carry unbecoming dispositions but by and large it seems things are ok. Here’s where my gap in understanding this comes. We have been having memos going around about abuse and microaggressions and so it must be an either large group of residents or a very vocal minority who don’t feel how I do. I’m about ten years out of training. \n\nAs for me, my teaching style is best described, from my reviews, as not hands-on enough to gives great autonomy. I do morning rounds but don’t bedside round on all cases. I give short related talks to the case at hand. I give afternoon teaching sessions on Bayes theorem and the mathematical nature of diagnosis, biomed stats talks, ethics talks, billing, and whatever clinical stuff they are in to. I never make them feel small at the bedside, I don’t round in front of other teams, and I lay out very concrete expectations. I don’t generally give feedback at the end of the week but pepper it along as we go. I don’t sandwich. I take a more coach athlete approach. I’m a very happy person but have been told by friends I may be mean sometimes. I like Dr Cox from scrubs but no better than to be him. \n\nSo surveys from 1990 and more recently show basically the same thing. Residents feel abused, about 20%, consistently, and 80% of graduating residents feel they have been abused at least once. Work hours remain long but are down from the past. Doctors continue to commit suicide at much higher rates then the public. I won’t even begin to speak about sexism since I’m not a woman but I’ve seen it and heard about it and it remains a problem. \n\nSo thanks for getting this far, that being said:\n\nTo what extent is the abuse a systemic problem? To what extent is it a problem of individuals?\n\nAt what point does the feelings of the abused an internal problem and not an external problem? This is not a generalization and I understand it’s a very nuanced problems.\n\nWhat factors such as sleep deprivation, large quantity of material to learn, emotional stress of practicing medicine/surgery play into augmenting the feelings of being abused?\n\nWhat is the true role of medical education?\n\nWhat does my generation not understand? Not speaking for all of us. \n\nIs physician burn out a system problem or a personal problem? Since it isn’t a binary problem, where on the spectrum are we?\n\nWhat do we do about it?",
    "title": "Learning opportunity: what is the solution to abuse in residency?",
    "subreddit": "medicine",
    "timestamp": 1568591896,
    "score": 31,
    "keyword": "woman teacher"
  },
  {
    "text": "Want to hear all those haunting stories... I want to hear everyone’s scary, haunting stories. I have two! One is mine and the other is my teachers.\n\nTonight, I’m in a residents room and I watched a CNA while I was across the hall helping another resident walk into one of my assigned rooms that had their call light on. It looked like a middle aged male with glasses, but maybe I saw it wrong. Anyways- I thought “Awesome! Thank you so much coworker for helping me out!!”\nActually, no. Not at all. Not my coworker and gave me the freights for the rest of the night!\nI am waiting for the light to flip indicating that someone was in the room, it isn’t turning on so I walk in to ask if I should take over- but no one is there. Okay? Maybe I saw something. Resident tells me his brother needs to go to the bathroom. I take it as a dream, but tell him I’ll help his brother to calm his nerves, and leave. \nHe pressed his call light again and the nurse and I walk in there this time. He’s telling us his brother won’t stop bothering him that he needs to pee, but says his brother dead. We talk about people visiting in the afterlife to deliver messages. But I’m assuming at this point that I saw his brother. \nThen, his light keeps going off every 2-5 minutes- but resident says he isn’t the one clicking it. Then, after turning off his call light one time, I start to hear a banging from behind the open door - so the door is against the wall. No one can fit behind it. Creepy.\n\nOther story is, from my teacher. It’s a more of a history lesson than a scary story, actually. But, the biggest metropolitan city near me had 32 man mounds (mounds with usually Native Americans burried in them with relics in the shape of animals or humans). Two gravel companies in the 1800’s dug them all up to make all the roads (kind of messed up to think the city is literally made on the bones of the native Americans; but it was only the 1990’s that we put the law in place to not disturb Indian burial grounds). One of these old man mound areas, I believe, became a Catholic cemetery - at least some of them made it there- somehow. They made a nicer, “prettier” cemetery on the other side of town about 30 years after this one. So, most of the family was still around to dig up their loved ones to move them to this new cemetery - because their mom’s deserved a prettier burial place. Well, not everyone made it over to the new cemetery [specifically three made it into a coffin together - a European, an American, and an ancient Native American (don’t quote me on the European, may have been another American), but who knows who didn’t make it]. There were kids playing baseball in it and using the headstones as bases, etc. Nothing was happening with this land with all these holes (since no one filled them in), and the growing town needed a hospital. So the Catholic church donated the land, and somehow this coffin with the mixed up bones of 3 people got put under a sidewalk next to the hospital. My anthropology teacher was on site when they went to expand the hospital and found the coffin.\nHis wife works for the other major hospital in town and that first hospital will send over their employees to the one she works at if they are short staffed. The nurses from the hospital built on the Catholic cemetery talk about how they see these ancient, 1800’s dressed woman float down the halls and apparitions all the time. \nThank you for attending my history lesson.",
    "title": "Want to hear all those haunting stories...",
    "subreddit": "nursing",
    "timestamp": 1550987473,
    "score": 14,
    "keyword": "woman teacher"
  },
  {
    "text": "Can this be appealed? My friend was just hired less than two months ago in a nursing residency program. She has been flourishing and everyone from her managers and preceptors to patients to patients' families love her. She has received the rising superstar reward and been nominated for the Daisy reward (a reward for nurses who people believe went out of their way to help). She just had a meeting (a few days ago) with her head manager who told her she loves her and that she does not want to lose her as the floor has a high turnover rate. She does her work and always stays after the end of her shift to talk to her patients and make sure they are ok. Now, my friend has epilepsy, however, the last time she had a seizure was when she was 6 and she's now 23. She has had doctors monitoring her for years and she does not take anything for it. When applying for this position straight out of school, she had her yearly F/U with her doc for the seizure which as always, everything is normal. Now, when applying, she was told by both of her doctors, her nursing school teachers as well as family in the medical field it does not need to be disclosed bc she hasn't had one in 17 years. Today, she was called by Occupational health and HR and her manager was there (the one who told her she can't leave bc she won't let my friend leave). She was made to read some papers and it said \"... WE **MAY** WITHDRAW YOU IF YOU DONT DISCLOSE INFORMATION..\" The HR woman told her they wouldn't usually fire one for not disclosing but she  \nis terminated bc she was still in a probation period. My friend told her doctors, nurses and other medical professionals told her it is okay to not disclose it because she is NOT taking meds for it and the manager asked HR if they can work something out bc it's not fair she didn't do anything wrong. However, according to the [**U.S. Equal Employment**](https://www.eeoc.gov/index.cfm)  \n[**Opportunity Commission**](https://www.eeoc.gov/index.cfm)**,**  having a diagnosis of epilepsy is NOT REQUIRED TO BE DISCLOSED. So, that would mean she didn't do anything wrong. \n\nBottom line- Can anything be done for my friend who was is currently devastated after receiving only praise, rewards and compliments from everyone, to be terminated bc she has epilepsy which she does not take any medication for and hasn't had one in 17 years. The manager just told her a few days ago she loves her and won't let her ever leave and she is flourishing. She is such an amazing girl with a very bright future and I don't see how something so little and also done rightfully bc the law states its okay to not disclose- She is completely crushed, in tears and all I want to do is help her. Can this be appealed?",
    "title": "Can this be appealed?",
    "subreddit": "nursing",
    "timestamp": 1571855093,
    "score": 6,
    "keyword": "woman teacher"
  },
  {
    "text": "Starting My Thirties with a career change... But have no experience. Hey all ! I hope you're having a good day today. I wanted to post on this topic because it pertains to my most recent endevour. (There is a long as* personal experience story too FYI).\n\nI have my BS in hotel and restaurant management. Originally (when applying as a teen) I was thinking about nursing, but I heard it was really hard and I wasn't an exemplary student by any means. I had then decided to apply to study health and phys ed. Because of my love for health education,anatomy and physiology, etc. and weight lifting . I was also a thrower for track and swimmer in highschool so that helped form that choice. I wanted to help over weight kids like me as a teen and get them motivated to move despite their weight .  I later realized I didn't want to be the fat PE teacher that couldn't run a mile with the kids if asked to.    \n\nI lost motivation for that part of my life and attended a school pretty reputable for partying...I fell in love with organizing, planning, having fun, traveling had also been a passion of mine since I was young... I put two and two together and I decided to change my major so I could travel or the very least work somewhere revolving around fun and caring for people's wishes. I also had been working in jobs related to hospitality since I got my workers permit! (15 yo).\n\nAfter working in the hospitality industry for many years and climbing up the customer service ladder, I had to make a decision to leave my job (hr issues). I had gotten married, and had a child since then. I have been a SAHM ,which led to a lot of depression. My husband and I decided I could use this time to pursue a degree in nursing . Ever since I agreed and started attending school, life has been great. Learning so many things, meeting new people and I honestly love studying the sciences (finding I want to take biochemistry even though it's not required). \n\nI talk to many of my classmates who are older learners too, some cna's some lpns, some even just had a admin job in the hospital and they have a tuition program to get them into nursing. \n\nI feel that I may be making mistake by just \"showing up\" in the nursing program without at least working in assisted living or anything of the sort. I know my people skills are great, and I handle high stress very well (comes with the territory of working in hospitality). I decided in nursing because I had a horrifying yet amazing experience when I had my son. \n\nYou can skip this is you wish:\n\n The horrifying, I was induced due to my son's head and shoulder size at 38 weeks (measuring at 41 weeks).. if we waited for natural labor he would likely definitely have to be a C section. Started meds at 7am I was on pitocin and eventually caved for an epidural, ready to go at 5pm, pushed for 2:30 hours straight (I really wanted to keep trying for VB). I fell weak and gave in and my doctor tried to console me. C section it was. \n\nLuckily I already had a epidural so transition to pain med for surgery was easy, I was told to drink an anti nausea substance, only to have my stomach shoved and me puking up bile and enhaling it... No one was able to help releive me (felt like I was choking but I had no muscles to help cough it up properly). They got him out and after I powered through that I was crying from the painful \"pressure\" of them moving things back and around and meeting my baby boy for the first time. When everything was said and done I healed fast and he was juandice over the next 4 days. (Up and walking by day 2, with rails).\n\nHad difficulties with breast feeding and my feeble attempts at pumping in between  his attempts at BF I got a whopping total 2 fl oz of colostrum.. I had immense guilt that I couldn't feed my child properly and gave up at day 2ish to supplement. (Nothing against it now, but I wanted to be a source of great nourishment for him and not only could I not do that but I couldn't even birth him naturally). I was a mess due to hormones to boot.\n\nThe amazing experience: \n\nMy main nurse. This woman is the reason why I want to work in maternal care. She was there for my induction and had a day off after my little guy came out. I was sad to miss a day with her but she had been working crazy hours apparently that week and deserved it ofcourse. Even the replacement nurses were really kind and emotionally invested in me through my dissapointment.\n\nShe was a shoulder for me to cry on when I handed her a half oz after gathering colostrum for 4 hours. She was the one to tell me that she sees her self in me with her experience with her first child. She sat there for a very long time, just talking with me and saying I did not fail as a mother. She constantly checked in on me and how I was feeling and if I wanted anything. She provided comedic relief when necessary. She was professional and explained everything that was going on and what she thought would happen (but to not take it as written in stone). She walked with me when I was healing and she  would offer to get the nursery to watch my son so I could get some rest. \n\nI loved her. I can't thank her enough and wouldn't have wanted any other nurse.\n\n\nSo ... Since I had my son, my spark for nursing returned and I mentioned it to my husband... Conversation eventually led to the fact it is a more full filling and lucrative career and would be \"worth\" it. I just wish I had followed my earlier thoughts on nursing when I was out of highschool. I know now though I would not have been nearly as capable at maintaining the grades necessary and my maturity would have been lacking if I did pursue it earlier on. As a mother , wife, experienced working adult my maturity has grown exponentially and my success no longer needs validation from parents or peers. I do what I want and my success shows if work hard for what I want. Currently my grades are all straight A's compared to my old adage of \"C's and D's get degrees\".  I am on coming up on my last semester or prerequisites. \n\nIs there anything you would recommend that I do to make sure I am competitive with other nurses that have experience prior to nursing school. I find that I want to get a part time job, buy it is not recommended to work through the nursing program (and planning around my little guy with the hubs studying for his master's, can be a bit troubling). \n\nI'd love to hear any if your thoughts, suggestions or just input/questions.",
    "title": "Starting My Thirties with a career change... But have no experience.",
    "subreddit": "nursing",
    "timestamp": 1552340880,
    "score": 3,
    "keyword": "woman teacher"
  },
  {
    "text": "For nursing teachers I spoke to a kind, smart woman comparing university/college-level teaching methods (in the field of nursing) in Japan to those in USA. She lives in Japan and has over 1,200 responses to a short research questionnaire from teachers in Japan. So far, she has only a little over 100 responses from college/university-level teachers in the U.S. Anyone teaching at this level can fill out her questionnaire. If you, or anyone you know teaches at this level and has a few minutes to help a student researcher, her questionnaire can be found at: https://www.research.net/r/tsas-usa \n     Also, if anyone has any other ideas how a kind and polite researcher in Japan can connect with very busy people teaching at this level, I will pass them on to her. I am a teacher at the elementary level on summer break. She was so kind and sincere, I thought I would do what could to help. She says she has been trying and people in the U.S. are “very busy” and what she initially thought would be challenging but entirely possible, has become a “dark tunnel.” Thanks for your time and any help/info you can give.",
    "title": "For nursing teachers",
    "subreddit": "nursing",
    "timestamp": 1563246128,
    "score": 1,
    "keyword": "woman teacher"
  },
  {
    "text": "[Warning: Politics] DeVos believes that by reducing teaching staff and increasing class sizes, schools can achieve more. I think she's trying to apply the basic business principle that increased production capacity lowers cost margins per product. Problem: Students are humans, not products. [Here's the link of her saying that, which was previously posted on this sub today](https://www.c-span.org/video/?c4788257/betsy-devos-explains-benefits-larger-class-sizes&fbclid=IwAR1M_WmkGUYuahLlAiwxW-96O_HoIhFFcwlFDSHfwN1sXWIXhUJqi3UhG18) \n\n\n[Here's an article from a small business website on the basics of how production affects gross margin.](https://smallbusiness.chron.com/production-affect-gross-margin-76828.html) \n\n\nThe relationship between production capacity, efficiency, cost margins, and profit is a basic tenant of math and business, and I'm not disputing that. But I am disputing that you can run schools like factories. I really dispute that quite a lot. I did not have my accountant parents raise me, take extra econ electives in high school and college, and run my own business for years for this woman to try to pull one over on teachers. Nah. Hell nah. \n\n\n[Here's another website Mrs. Devos might find useful.](https://owl.purdue.edu/owl/research_and_citation/resources.html) If she would like to reach out to me for other resources or worksheets to practice citing sources, she can email me or message me on Google Classroom.",
    "title": "[Warning: Politics] DeVos believes that by reducing teaching staff and increasing class sizes, schools can achieve more. I think she's trying to apply the basic business principle that increased production capacity lowers cost margins per product. Problem: Students are humans, not products.",
    "subreddit": "Teachers",
    "timestamp": 1553900908,
    "score": 1997,
    "keyword": "woman teacher"
  },
  {
    "text": "Goal this year: meet, like, ANY of my students’ dads. No, I’m not single and on the prowl.\n\nI am just sick of men assuming that it is a woman’s job to do the parent thing. We have so many events at school (I teach middle) where parents are invited: during the day, in the afternoon, at night. And almost ALWAYS it’s a room full of moms with maybe one dad. And these are working moms - doctors, lawyers, etc. I work in a really affluent area so it’s not like they can’t afford a sitter or something. Last year our back to school night was on the same night as our team’s NFL kickoff game - zero dads.\n\nI never get emails from dads questioning their kid’s grade or effort. Only moms. PTO is only moms - and yes, most of them also have full time jobs.\n\nTwo years ago we had called a parent meeting and the dad WENT TO THE WRONG SCHOOL. He apparently did not realize his kid graduated from elementary school.\n\nWhen I’m a parent (hopefully soon), that shit is not gonna fly in my house. My husband will go to the events. He will know the names of my kids’ teachers and will never use the word “babysit” to refer to supervising his own children. \n\nTo the men who are actively parenting their children, thank you. Thank you for being fantastic role models for your kids and for sharing the load with your spouse. Its 2019, and we want you in the conversation. You have so much value to add to our efforts to help your child and we really do appreciate your input. You don’t need to sit back and say, “This is really more her thing” about your wife.",
    "title": "Goal this year: meet, like, ANY of my students’ dads.",
    "subreddit": "Teachers",
    "timestamp": 1564755050,
    "score": 735,
    "keyword": "woman teacher"
  },
  {
    "text": "Teacher Conflict So... I don't work at the middle school but the special needs teacher there is into comic books and has a super hero themed room.\n\nFor some unknown reason, (and I wonder if it's for some other reason entirely; something personal) this pisses off the teacher next door, who always complains to anyone who will listen that it's inappropriate, and made her bulletin board outside her classroom say simply, \"real heroes don't wear capes\" with a bunch of military, police, and fire fighter representation. In contrast to the rest of the entire school, her bulletin is dark and brooding, never displaying student work like most of them. Just standing there in stark reminder that she doesn't approve of the superhero themed classroom next door.\n\nShe actually put up the protest bulletin after complaining about the theme to the principal, who as it turns out, doesn't see a problem with it. What a nasty woman. I was well pleased when I saw she wasn't returning this year.\n\nAny other petty/entitled teacher squabbles to share?",
    "title": "Teacher Conflict",
    "subreddit": "Teachers",
    "timestamp": 1563374605,
    "score": 381,
    "keyword": "woman teacher"
  },
  {
    "text": "Help me understand the whole “let’s all contribute towards a gift for x” mindset. Right off the bat, I will tell you that some people are going to comment that I am a jerk. I’m not, but whatever.\n\nSeveral times a year, the other teachers in my school put together a collection for gifts for people who work in more service oriented roles in the building: the paras, the custodians, the office secretaries. Quite frankly, I don’t get it. I’m not the CEO of some corporation they work for, and some of them are making close to if not more than I am as a classroom teacher. \n\nThere’s Christmas, whatever “appreciation day,” the end of the year, etc. But, like, they get paid a salary. It’s not like they are volunteers and I want to show them my appreciation for their sacrifice. They get paid to do these jobs. \n\nIt almost feels elitist to do this. It makes me feel icky to contribute money towards a gift for someone I think of as my equal because they are...what...working FOR us? I just don’t see it that way. At this end of the year, some teachers sent out VERRRRRYYYY rude emails about people who hadn’t contributed to the gifts, but these women got legit 200$ gift cards once everyone had put money in. I want a freakin 200 dollar gift card. Money is tight for me, and I certainly don’t feel like some high roller who should toss some spare change at the blue collar workers in the building, you know? Seems like my principal should be the one thanking them with gifts.\n\nAnd sometimes the gifts are almost patronizing. Like do I want to give this woman I’ve had one conversation with a bouquet of flowers as if she were my mom or a retiree? I don’t know. Downvote me all you want, but it’s just not something I understand.",
    "title": "Help me understand the whole “let’s all contribute towards a gift for x” mindset.",
    "subreddit": "Teachers",
    "timestamp": 1560777923,
    "score": 350,
    "keyword": "woman teacher"
  },
  {
    "text": "Recent female graduate should I leave tech and go to a more woman dominated field like nursing or teaching? Hi everyone this is my first post but I graduated last December with my BS in Information Systems. I was originally a science major then switched to psych before settling on InSy (which I was originally just going to minor in) anyways I’m a 22 female who wants a family one day and wants to get a job that will let me have 2-4weeks vacation a year to travel overseas and explore the world (I know this isn’t really feasible from the beginning but I thought I could work my way up to it after a few years.\n\nMy mom and some of the people around me tell me to just become a teacher and although I like their vacation time I don’t like the low pay and most kids are bad and difficult to deal with on a daily basis (I currently work as a technology manager for an elementary school that pays really low) and teachers are always complaining. \n\nI was originally planning on getting certs and getting a help desk job and working my way up to either IT cyber security role or database administrator or maybe something with cloud. However, people around me who know I want to get married and have a family tell me tech might be hard to get vacation time and focus on my future kids. \n\nBasically, I’m staring to worry about entering tech as it’s male dominated Im afraid I won’t be treated with respect and if I get maternity leave in the future I will find it hard to get my job back or get back into the work force if I don’t enter a woman dominated field like nursing or teaching. \nThoughts would be appreciated. I feel like with tech there is potential to make a lot of money but it might not be consistent like nursing or teaching. I don’t love tech I don’t hate it either it’s okay to do I also don’t think I love nursing or teaching I just might be more comfortable working with women but it’s just soo many factors that go into a career I can’t decide what I value more. I don’t know I’m feeling very lost and don’t know what to do. I don’t really want to go back to school for nursing I mean I barely gave my current degree a shot but I’m scared. Idk maybe because my whole like I like plans and I just feel like I’m floating in no real specific direction right now.",
    "title": "Recent female graduate should I leave tech and go to a more woman dominated field like nursing or teaching?",
    "subreddit": "careerguidance",
    "timestamp": 1563514873,
    "score": 1,
    "keyword": "woman teacher"
  },
  {
    "text": "21m Broken soul, currently in trade school, but my passions lie elsewhere, care to read? Hi there ! I'm a twenty-one year old guy raised in a horrible toxic home, who has cut off nearly all ties with my family, my father hung himself a month before I graduated high school, and my mother has tortured me emotionally my entire life, and the awful mess of a divorce was the reason my dad ultimately ended his life. I can't even face my siblings because it would put me too close to her. My father was raped from ages 5-13 by his older brother, and because of that never had any peace in his life, drank and used Xanax constantly. A loving, attentive man, but his demons ultimately cost him everything, and the fact he married such a terrible woman and had kids with her destroyed him. \n\nI have worked two jobs since age sixteen and still managed to get good grades in all subjects, took advanced placement courses in all subjects, I was a first chair bassoon player and played tenor saxophone in the jazz band, I've taken piano lessons since age 6 and I taught myself the guitar in one summer, and was generally assumed to go on to university and do very well. I was even homecoming king my senior year. I wanted to be a philologist as I have been teaching myself Hebrew (had some liturgical Hebrew under my belt as my mother is Jewish) , ancient Greek and Latin since age 10, and my general interests are in the cultures and languages of the world. I spend hours a day researching languages and cultures, and my coworkers, teachers and professors were all amazed at the encyclopedic knowledge of the history of the middle East, and the cultures that exist there. \n\nThe only issue is that I am an addict just like my father, and spent two years following his suicide numbing myself with benzos, both prescribed and bought from the street, and I just continued working in two restaurants after i bombed a semester for attendance. I tried to kill myself three different times with drugs to no avail, and gave myself an acute kidney injury at one point. I still feel the same creeping pressure in my soul that I think that my dad felt. (Little family history: every male in my family, both grandfathers and their fathers, all killed themselves.) I don't want to end up like that.\n\nI'm sober now, and after paying the debt for one semester of school, I'm back learning welding with an emphasis in aerospace alloys and alluminum. It's great work and I really enjoy it, it's almost like learning a new instrument. \n\nThe thing is, I cant justify 30k-60k on a degree for things I have taught myself, and every millennial I have worked with is swimming in student debt with a degree they don't use. \n\nI want to work, I want to make money, but I feel like I'm cheating myself by not following my passions. I have always felt good that I am a self motivated learner, and devote large amounts of time to simply immersing myself in history and languages. It's a joy in my life that is second to none, and the fact that it can't be taken away from me, nor did I pay for it at all makes it even sweeter.\n\nBut I have no family support, have essentially been disowned, and the idea of taking out loans again is the most terrifying prospect I can imagine.\n\nSo how does someone like me, a motivated, shit eating, interested young man find a job in cultural studies? I would give anything to spend my life researching, but I simply cannot take on the debt for the SLIGHT CHANCE that my degree would help me land a job that probably doesn't exist. Then, for another thing I know for certain that I know significantly more than most of the peers I would have in college. I can anticipate there will probably be a lot of comments calling me a narcissist, but that's not the case. It's just a fact. I have studied for 10 years obsessively, and it's rare that I meet someone I can have a conversation about my interests, or even cares. I don't hold that against anyone, I dont expect anyone to care about the things I enjoy.\n\nI don't expect handouts, and I plan to make plenty of money when I leave school, but I will forever feel like I've cheated myself of what could be a truly intellectually fulfilling career. Does anyone in the field have any advice as to how they got started? I don't particularly want to be a teacher, as students generally aren't passionate about learning, nor do I feel would I enjoy coming in to see dead-eyed Gen-Z (I realize I am a total zed) idiots going through the motions like worms, plus the bureaucracy of it all makes me want to vomit. \n\nIf you read this, thank you.",
    "title": "21m Broken soul, currently in trade school, but my passions lie elsewhere, care to read?",
    "subreddit": "careerguidance",
    "timestamp": 1558666262,
    "score": 1,
    "keyword": "woman teacher"
  },
  {
    "text": "What to do next? Woman software developer  Hello guys, I would love to hear your opinion...\n\nI am a woman, and I got a Python developer job 9 months ago. My friend (now the boss and one of the owners of the company), asked me if I would like to join. I had half a year of professional programming experience in Python and bachelor degree in Informatics. I looked into the online application for the job. I asked for the lower salary range listed (since I was 'inexperienced.') I was asked to go even lower for now. I agreed and hoped it would change soon. Well, it didn't even though I worked 9-12 hours per day to learn as much as possible.\n\nMy boss is sitting next to me all the time (a few other programmers are sitting 'against' us), he is also going with me to lunch every day (and also correcting me all the time even because of bullshit I started to talk about just to fill up the silence sometimes). I was so unmotivated that after 4 months I told him I am not able to be productive & programming 8 hours straight per day so at least I can go home after 7 hours now. But they considered it as a salary raise. Just noting that I also finished my engineer diploma in the meantime.\n\nFor a few next months, I felt motivated again, but now it's back to the usual. I'm annoyed by sitting next to my boss who is staring into my screen very often, getting a low salary, going to the office every day (home office is possible, but I would have to ask each time...).\n\nI get paid 13k USD per year after taxes (living in eastern Europe). Although this is slightly more than a school teacher in my country, all my friends (male-developers) are getting much more. I would be comfortable with the double and work my way into the triple of it. I wouldn't mind working 12 per day if it's appropriately paid and I would have some privacy.\n\nI decided to leave this job in several months (when my 1-year contract is expiring). I would love to be more independent, I was thinking to get a remote job in a coworking space and sometimes work at home. I started to look for that kind of job, but honestly, I don’t know 14 different technologies usually listed there and I don’t have 5 years experience as a senior developer as they are asking… Nobody cares that I can learn anything but I have to actually use it regularly to be confident with it… Dear guys, was someone in a similar position? What would you recommend next?",
    "title": "What to do next? Woman software developer",
    "subreddit": "cscareerquestions",
    "timestamp": 1567447442,
    "score": 18,
    "keyword": "woman teacher"
  },
  {
    "text": "Seeking advice for college and beyond - Accounting, International Business, etc? Hello all!\n\nI was hoping you could review my situation and plans, and provide any advice, tips, suggestions, and/or constructive criticisms. Much appreciation and a thank you in advance. \n\nI’m in my late 20s, in the midst of getting my A.A. at community college. I have no prior degrees or certifications. I will not only be a first-generation college student, but I was also a first-generation high school student. My parents work in backbreaking trade jobs for little pay and I’ve always wanted to avoid that as much as possible. It’s important for me to go into a somewhat “stable industry” (if such a thing even exists anymore) with not-so-terrible pay prospects and preferably work in an office. \n\nI’ve always loved subjects like geography and languages, but didn’t see much of a future in studying such things outside of becoming a teacher. As a child, I dreamed I would be a successful business woman who traveled all over the world. As I got older, for some reason I let that dream go. Spent much of my adult life working in retail and unable to pinpoint a path for myself. \n\nNow that I’m finally back in school, I’m getting to the point where I need to concretely decide my major and where I want to transfer to. I’ve been thinking a lot and I’m leaning towards going into Accounting. There is a college near me that is not well-known but it actually has one of the best CPA exam pass-rates for its graduates in my state. A catch is that because it has a transfer agreement with my current CC, many of my elective classes overlap, so I would fulfill my accounting program being quite a few credits shy of graduation requirements. I’d be required to take extra classes anyways, so I could get another major or a minor if I wanted to. \n\nI’ve been thinking that if I’m accepted to that college, I could double major in Accounting and International Business. I feel like this might give me a better chance if I ever want to try to step into International Accounting. If not, or if I simply no longer have that desire in the future, the IB major includes extra classes in business, finance, and ethics (in addition to the ones in the required business core); so the major could be useful for eventually sitting the CPA exams anyways. Additionally, despite being older, having a fiance, and generally having a life outside school, I still always wanted to do a semester abroad. I’ve never traveled internationally and it’s something I always wanted to do. I may not get another chance after college depending on where life takes me; I wouldn’t be able to study abroad in only accounting, but IB could give me that chance. Finally, since I am in a state requiring 150 credit-hours, I figured I could use the extra classes after graduation to go back to CC and take language classes, either German, Spanish, or French. \n\nAll in all, I don’t think any of these things would be regrettable even if life doesn’t go the way I want it to in the future. But I could be wrong and that’s why I’m here. \n\nFor those in the field, what do you think? Is this a good plan? Do you seen any potential pitfalls? Is this realistic? Etc etc….\n\n\\[Apologies for so much text!\\]",
    "title": "Seeking advice for college and beyond - Accounting, International Business, etc?",
    "subreddit": "Accounting",
    "timestamp": 1572941018,
    "score": 3,
    "keyword": "woman teacher"
  },
  {
    "text": "Should I drop out? Hello, I am a current 2L at a T1/T2 (its on the cusp) in NYC. Grades are not the issue for me as I am in the top 20% but rather I am reconsidering being a lawyer. \n\nWhen I entered law school I had a more idealized version of what a lawyer does and that was my goal. Having done mock trial, I figured that this is what a lawyers does and what I want to do. However, I was mistaken. I stuck with it as I felt that I could maybe find a new passion perhaps helping other LGBTQIA folk or helping musicians as I am both of these. However, I feel as though that alone is not enough to warrant staying in school. \n\nI hate going to class, hate learning the material and overall hate the overall setup of law school. I only stuck with it because I knew I could potential help others with the JD. Yet, I feel as though there maybe better options. Additionally, I feel as though, with all the time I am putting into law school I am delaying my transition as a transgender woman. I often have to be working on school rather than learning stuff or engaging in things that would help my gender dysphoria. \n\nHere is a quick pro con list I made. I feel as though I maybe ignoring some pros.\n\n**Pros** \n\nHelping people with the power of the law, particularly those in a similar position to me\n\nBeing able to meet and advise clients (in my position (musician/LGBT)) would leave me feeling fulfilled.\n\n**Cons**\n\nHate law school and causes me a lot of stress\n\n1 ½ more years, plus bar, plus $60,000 more debt\n\nNot really sure I want to be an attorney\n   \n Would always be on call\n   \n Lots of reading and writing\n   \n Long hours/bad work life balance\n\nThe public service I would want to work at (Lambda Legal, ACLU) is out of reach\n\nI want to work with a very specific group of people which is harder to obtain\n\nLow paying job at graduation/not even guaranteed\n\nDelaying my transition stuff more than a 9 to 5 would\n\nWith all this in mind I am not sure what to do. In undergrad I received a poli sci degree and a music degree. I am considering being a music teacher instead which I know would be fulfilling for me. My school offers to take a leave of absence which I am considering as I would be able to return if I had a change of heart. I would be able to get a job in the meantime and pay off some debt, yet I don't know how future legal employers would look at this if I went back. I am still not sure what to do. \n\nSo, would it be best to stick it out? Would it best to take the leave? Would it be best to drop out entirely? Please Help",
    "title": "Should I drop out?",
    "subreddit": "LawSchool",
    "timestamp": 1575471554,
    "score": 2,
    "keyword": "woman teacher"
  },
  {
    "text": "Confession: I'm a Haitian girl and despite the fact that I love learning languages, I never liked the idea of conversing in Haitian-Creole with a white person or helping them learn the Haitian language. This may seem a bit prejudice, but let me explain. I'm an American girl of Haitian descent who is proud of my family heritage. Yesterday, when I was at work, during my lunch break I sat with two white co-workers (one was a Jewish man, the other a white woman) who were arguing about something. I greeted them but they ignored that and just continued to argue. I carried on with unwrapping my lunch, but once I asked what's up the guy explained to me that she was having trouble at her job when talking to customers because she didn't know how to speak Haitian-Creole.\n\nThe guy just turns to me and ask if I'm Haitian. I say \"Yes\" and then he's just like \"Teach her some Haitian-Creole\". That annoyed me because he was basically giving an order after not even greeting me, that fucker!\n\nThe woman explained to me her further problem to me while I was already uninterested in sharing any knowledge of the language with her despite us being friends (You could guess why). I speak at a good level but am not fluent, but plan to improve because I use it for my job almost every day as well and sometimes speak to family in it.\n\n\n After thinking about it for a second, since she needed help with her job I offered to help and teach her to say a couple of necessary phrases she needed to know and encourage her to learn. We're on good terms and friends at this point so I don't mind helping her. The guy, on the other hand, who claimed that he had learned 30 words so far of Haitian-Creole, I would definitely not help. He's kind of conceited and everyone else sees it but never says anything. So teaching him is off-limits.\n\nNow, the main reason, I usually don't like the idea of teaching white people our parent's maiden language is because most of us know how many white people operate, especially when it comes to non-white cultures especially black people. Lots of them have been learning our languages and opening up shops in Haiti, and taking advantage of some of the people. When I was a kid going to a private school, the nuns at our school who were all white always told us not to speak Haitian-Creole among ourselves, meanwhile they would gladly speak Canadian French among themselves. Growing up, I witnessed some actually racist white kids in our class try to learn the language and speak it back to us and some of the Haitian kids trying to teach them a couple of words. It always bothered me deep down, even though I never vocalized it.\nWhen I got to college, I was taking a medical course at Massasoit and witnessed this white man complaining and arguing with a Haitian immigrant studying with us in our class because he didn't like how we cook our meats at barbecues. Later when a person dropped in while we were practicing with medical equipment, he and the Haitian lady started speaking French and a white professor and that white guy were like \"Oh, they're talking about us, Guy\". Even if she said it as a joke it rubbed me the wrong way because I remember a teacher in 8th grade talking about how she thought it would be better if the kids spoke English and not Haitian because they worry about them plotting things against them in that language.\n\nFor me, as long as many of them continue to act so arrogant and exploit communities while benefiting from it or being remotely racist towards Haitian people, I will not be up for being some white person's Haitian-speaking teacher/learning buddy. Weirdly, I feel more comfortable helping a person of any other racial background but them. For me, it's like teaching them how to do bantu knots or cornrows and them watching them flaunt the look like it's always been theirs.",
    "title": "Confession: I'm a Haitian girl and despite the fact that I love learning languages, I never liked the idea of conversing in Haitian-Creole with a white person or helping them learn the Haitian language.",
    "subreddit": "blackladies",
    "timestamp": 1557617704,
    "score": 164,
    "keyword": "woman teacher"
  },
  {
    "text": "My mom supports R.Kelly........ Tw: sexual abuse/statutory rape mentions \n\n\n\nThe title says it all. \n\nI love my dear mother, but I’ve overheard her on the phone with my stepdad last night talking about the R.Kelly documentary... \n\nMy mom has always been a big R.Kelly fan throughout my 22 years of life. Growing up, she would buy his albums, sing along to his songs in the car, and would always hype him up. I am her only child and her only daughter, and as a kid of the 2000’s, I didn’t really care about her love for R.Kelly. I mean I thought his songs were ‘catchy’, but you know I was child then and I was super unaware of the trials and stuff. I remember her mentioning it once, but I was really too young to understand what was going on with him.  \n\nFast forward to today, I couldn’t believe what my mom had said last night about the victims. My stepdad is a problematic xenophobic misogynistic pos anyway, so I already know how he feels about the documentary. So I ain’t gonna touch on it about him. But my mom though? I live with her currently and it’s just the two of us in this medium sized house. My stepdad doesn’t live with us. Anyways, I’ve only overheard some of their conversation about the documentary and my mom was saying things like “If they were being abused like that in such manner, why they just couldn’t leave? It’s not like he had a gun to their head? He is old and fat now, what they want with him anyway? Also, they just all in it for the money” \n\nWhen I’ve heard that coming from my own mother. The lady who gave birth to my black woman ass literally almost 23 years ago, I literally became triggered and started having PTSD flashbacks of my very first sexual encounter with a male. He was my 20 year old neighbor up the street and I was 13-14 years old at the time. I tend not to think or talk about that experience, but hearing about all the grooming and abuse that R.Kelly did to all these girls and women is making me have flashbacks of forgotten memories of sexual trauma. I’ve been through some very traumatic shit these last nine years and the earliest memory I have was when I was 13 years old in my 7th grade math class and my male classmate (who I was also crushing on at the time) was sitting behind me and touched my boob out of nowhere and without of my consent. It happened so fast, I didn’t know how to react nor how to feel and then he apologized and was like “Sorry, I just wanted to see if you had a bra on that’s all”. My teacher was too busy teaching and all my other classmates who were around us just thought it was funny (I was the most hated girl at my middle school and they all made fun of me at any chance they got). But yeah, I can go on and on all day about all the shit I’ve endured from men throughout various points of my life, but I rather just focus on my mother on this post, ya know. \n\n\nPoint is, this lady has a black daughter. I could’ve simply been one of those girls. Who gives a fuck if he’s “talented” or makes ‘catchy songs’? THE MAN IS A SICK DISTURBED SON OF A BITCH AND HE DESERVES TO BE PUT IN SOLITARY CONFINEMENT!!!! DEADASS, B!!!!!!!! Fuck R.Kelly, yo and fuck those who are supporting his nasty pedophile triflin ass! \n\nMy mom doesn’t have much knowledge nor any idea of the sexual trauma that I have been through from ages 13-21. Except for one experience that happened to me in middle school and she gaslighted me for it by not telling the teacher soon enough. That’s a whole another story for another day. After the documentary went off, she did try knocking on my door for my attention, but I told her to go away. She didn’t like it and took it as typical ‘back talk’. Y’all know how black parents are with that shit. My mom and I aren’t talking much right now and I can sense she’s tight with me. I got on the phone with my boyfriend afterwards and I was just screaming at him. Last night was indeed a mess and I’m not sure if I can bring this up to my mom? Not about my sexual trauma, but how she is wrong for supporting a man who literally has evidence against him of being a sick monster to little children!!!! I’m gonna definitely center myself in that conversation and be like “It could’ve been me. It simply could’ve been me.” \n\nI’m just trying to move tf out again for the third time! I’ve been back home for two months and memories from my far and recent past are coming back to haunt me. I don’t like being here. Especially around my parents when they spew problematic shit around me and they thinks it’s okay. NO TF IS NOT OKAY!!!!!\n\n\nY’all I’m so sorry with this long ass post, took me a lot to write this shit out. I’m so disturbed right now by being around her. How dare you say that about people who the took courage to go against this monster publicly?!?!!! My mom is just as sick if she’s going hard for this bastard. Smh.",
    "title": "My mom supports R.Kelly........",
    "subreddit": "blackladies",
    "timestamp": 1546797179,
    "score": 52,
    "keyword": "woman teacher"
  },
  {
    "text": "Am I wrong in this ? This is a very weird situation and I somewhat don’t know how to feel. One of my brothers is having a baby with a white woman and suddenly decides to get his life together and buy a house, etc.  her family has posted suspect comments about black figures on social media as well****\n\nIt could be totally unrelated but a few years ago he dated a black Woman who I loved but he stole her credit card, her money, cheated on her etc and she called my crying the middle of the night. \n\nSince her family is racist my mom is paying for almost all the wedding on a teacher salary , my dad is painting half their house for free. And he’s spending all his money on a white woman and hasn’t even bought my mom a gift and barely visits hair. I don’t think it’s fair.\n\nWhat’s really irritating me is he’s spending all this money on her but hasn’t been bought my mom a gift .\n\nAnd all my relatives are soooo excited and looking forward to this child just because she’s mixed ( not trying to sound mean)\n\nI haven’t even asked for a birthday gift because she spent soo much money.",
    "title": "Am I wrong in this ?",
    "subreddit": "blackladies",
    "timestamp": 1569000132,
    "score": 45,
    "keyword": "woman teacher"
  },
  {
    "text": "The Whole Education System is BROKEN!! Honestly😒 Okay since this whole admissions debacle has been exposed and the story about the black woman who was sent to jail. Just for trying to send her kids to a better school district has been bought up in comparison to this story. Has really hit home for me my parents did the same thing for me and my siblings the school I attended was in a predominately white neighborhood and the faculty at the school was mostly white people. I just connect with this story because us being black kids in that school gave me a different experience and some of the teachers knew we didn’t live in the zip code to attend that school. But only one teacher tried to get us kicked out because of that.  And she would ask me in front of other students where I lived. Or just try to bring it up when I was getting in trouble or something mind you this was elementary school. Im a kid I didn’t know any better I would either just be quite or ask my sisters about it after school. But Im saying all that to say its just eye-opening for me to witness this B.S and to know my family had to do the same thing just to get us a quality education. And this scam is now being broadcasted when it has been going on for YEARS. I just felt the need to share this and want anyone who has thoughts or similar experiences to share. \n\n\nLink to the story:\n\n\n[Reference ](https://abcnews.go.com/US/ohio-mom-jailed-sending-kids-school-district/story?id=12763654)",
    "title": "The Whole Education System is BROKEN!! Honestly😒",
    "subreddit": "blackladies",
    "timestamp": 1552676463,
    "score": 21,
    "keyword": "woman teacher"
  },
  {
    "text": "Ya'll, my customer service Persona has been tested to the upmost Bare with me ya'll, I just need to vent for a moment at the extra levels of foolishness I've been dealing with at work. \n\nOn one side we have Passive Aggressive Mom™. We have digital records of each child's day, and I'm not entirely sure how she manages to get any work done for as hard as she stalks her child's report. Any time we are late with *any* update, she is messaging us. And if we don't message back immediately, she is calling the center. We have explained to her several times before, there are almost a dozen babies under the age of one and two teachers: we don't always have time to update the site immediately but your child is being taken care of. For the level of care she desires and the apparent amount of downtime she has at her own job, she really should just quit and keep her child at home, but that's none of my business. My coworker is very much done with Passive Aggressive Mom's particular brand of bullshit, so I have taken up the mantle, putting on my best customer service voice to answer numerous questions, suggestions and comments.\n\nThen there's Taylor Swift .2. From the moment I met her, she just rubbed me the wrong way. Now I checked myself: I had no reason to not like this girl. So I tried being nice and polite, never got much of a response, so I left it alone. I'm here to pay my bills at the end of the day. However, she would make these small comments that irked me. \"Suggestions\" that she never seemed to give anyone that I never asked her for. I'll ask my co teacher because I recognize that although I'm the Lead for the room, she has worked here longer and knows these parents better than I do. So I differ to her. Taylor Swift? Ma'am, I didn't ask you and you're still in training for the position you want, so regardless of whether you've been here longer than me please have several seats.\n\nNow Taylor Swift has an obvious favoritism for you guessed it: Passive Aggressive Mom's child, CP. Now I dont fault her for this: I have my favorites too. However, what I do fault her for is going behind my back to our boss because she had a problem with how I fed CP.\n\nNow, CP started on baby food months ago, however, he still doesn't know how to eat. As soon as the food hit his mouth, he pushes it back out with his tongue. I would honestly have talked to his mom about maybe getting it checked out, but given the level of passive aggression I'm already dealing with, coupled with the fact that every third sentence out of her mouth begins with \"Their doctor..\" , I've decided that's not my battle. However, feeding him is an exercise of futility that often takes about half an hour for the smallest container you can imagine. Added to the fact that Passive Aggressive Mom sends him in with smoothie like mixtures of combos like bell pepper and applesauce, we've simply decided the easiest way to feed him is to put it in a bottle.\n\nSo we've been doing this for a hot minute, however, CP was being particularly fussy. But I knew that if he didn't eat, his mom was gonna send me a message about it. So I was pushing forward when Taylor Swifts makes one of her suggestions about the situation. Ma'am, do you think I would be sitting here getting my ear drums busted out if I thought alternative conversation with his mother would be less painful? But I let it go, got him to eat most of it and moved on.\n\nUntil my boss came in a little while later telling me that I couldn't feed him food with a bottle anymore, regardless of what his mom would complain if he didn't eat.....Ma'am, you've never seen me feed him with a bottle, so my question is.... Who told you that? \n\nNow, could it have been one of the other two girls who complained? Sure. But Taylor Swift left the room *mighty* quickly with CP after our boss came to talk to me about this. And she did happen to be on break right before our boss came in to talk to me, which would've been a perfect time to discuss some \"concerns\" she had.\n\nBut I guess we're not gonna talk about how just the other day, the whole room sat through Taylor Swift feeding yogurt to a baby while she screamed bloody murder the whole time cause she's also a fussy baby?\n\nOn the plus side, I have all weekend to decide the exact level of professional petty I'm gonna be on next week and I finally have a justified reason not to fuck with her. So thanks Taylor Swift.\n\nTldr: White woman foolishness at the workplace has struck again.",
    "title": "Ya'll, my customer service Persona has been tested to the upmost",
    "subreddit": "blackladies",
    "timestamp": 1553890730,
    "score": 13,
    "keyword": "woman teacher"
  },
  {
    "text": "List Ethnic Tv Shows You Are Surprised to Identify With This is a fluff thread.\n\nI had a rough week and decided to binge watch some stuff.  \n\nDr Ken is earily similar ro my family dynamic.  My grandma, swamp voodoo woman, earily similar to the grandpa. She decided to tag along to a parent teacher conference and basically said the same stuff to my teacher as the granddad said to Dave’s.  She went farther and said that there recess was a waste and I shouldn’t be playing.   Grandma used to pay me for weekly assignments. $0.10 for every paper with a B and th $0.25 for every A. Then, one day she explained she didn’t like B’s. B’s were expensive and she would only pay for A’s.  There were other subtleties but I expected zero!\n\nThe Halloween episode with the Grandpa telling scary stories.\n\nThe grandpa and ... well my grandma and the grandpa are very similar at least.\n\nTotally shocked there were any similarities. Plus the house looks just like ours!",
    "title": "List Ethnic Tv Shows You Are Surprised to Identify With",
    "subreddit": "blackladies",
    "timestamp": 1559361736,
    "score": 7,
    "keyword": "woman teacher"
  },
  {
    "text": "My school (is starting to) get it. So I'm posting a little late but thought some of you would enjoy this.\n\nSo a club in my school gets to support causes each year and this year decided to support womans rights. My English teacher who's a feminist was in charge. What they did was make wearable signs that reads \"This is what a feminist looks like\" and on the back reads a fact.\n\nThey decided to focus on women in third world countries that face real discrimination instead of what modern feminism focuses on. However, half of the signs also give facts about men, such as \"The majority of suicide victims are men\" or \"men get more years in prison for the same crime\" and even \"men make up the majority of homocide victims\".\n\nMy teacher decide to add the male facts, and that made me really happy and I'd imagine it would make you happy too.\n\n\nSide note, I know \"this is what a feminist looks like\" isn't a great phrase to use for someone who cares about everyone's rights due to toxic feminism however I can look by that.\n\nThanks for reading, enjoy the rest of your day!",
    "title": "My school (is starting to) get it.",
    "subreddit": "MensRights",
    "timestamp": 1561648585,
    "score": 1782,
    "keyword": "woman teacher"
  },
  {
    "text": "I am a feminist. At least I thought so. I'm sorry. I didn't really know about all of the issues men go through. I only had my own experiences as a woman to go on, which meant that, as pretty much all humans are wired to assume from their own experiences, I was probably worse off by being the gender I am. I want to thank this sub for existing, as most posts I've read have encouraged me to do more research and see how men have it worse, at least in many situations. Before I had been thinking about how, if I became a math teacher, I'd be leaving myself open to parents who thought their children shouldn't be taught something like math by a woman. Now I can think about how some parents react to their children being taught anything by a man. How that's just not right. I just wanted to apologize for my assumptions. I had even assumed that Men's Rights groups in general were toxic places, because I read one rant from a guy about how he wanted to kill all women for treating him like garbage throughout his life (though the only way he cited how was ignoring him). I'm sorry for ignoring a whole group for so long because of one extremist. I'm also sorry if this entire post is off topic and gets me banned, I don't entirely know how reddit works yet. I think I'm still a feminist, but only by my own definition, where I'm looking for equality, the same as you. And that obviously now means fighting more for men's rights. Thank you for showing me that.",
    "title": "I am a feminist. At least I thought so.",
    "subreddit": "MensRights",
    "timestamp": 1569816242,
    "score": 1145,
    "keyword": "woman teacher"
  },
  {
    "text": "Toxic Feminity is... Toxic Femininity is when a woman tricks a man into raising a child that isn't his.\n\nToxic Femininity is when a woman lies about physical or emotional abuse in court to gain custody of the children.\n\nToxic Femininity is when a woman marries a man only for his money.\n\nToxic Femininity is when a mother says bad things to her child about the father behind his back.\n\nToxic Femininity is when a woman makes a false claim of sexual assault.\n\nToxic Femininity is when women use social media to cyberbully boys into believing their gender is inherently evil.\n\nToxic Femininity is when women expect a man to pay for everything.\n\nToxic Femininity is when a woman hits a man and expects to get away with it because she's a woman.\n\nToxic Femininity is when female teachers give better grades to female students, just because they are girls.\n\nToxic Femininity is when women shut down the conversation about male homelessness and suicide because it doesn't fit their narrative.\n\nToxic Femininity is when women say, \"the future is female\" right in the face of their sons.\n\nThis is what Toxic Femininity looks like.\n\n--\n\nDid that make you feel uncomfortable?  Did you feel like that was a little bit of an over-generalization?\n\nGood.  Now you know how most men felt when they saw that Gillette ad.",
    "title": "Toxic Feminity is...",
    "subreddit": "MensRights",
    "timestamp": 1547575378,
    "score": 977,
    "keyword": "woman teacher"
  },
  {
    "text": "Feminists say that there is no sexism against men, because men don't suffer institutional discrimination. In fact is males, rather than females, who suffer the vast majority of institutional discrimination. This post was originally submitted by u/Vwar. For new subscribers, here it is again. Indeed, the fact of institutional discrimination against men must be repeated again and again until it is realised by all.\n\n---\n\nI don't believe that males have ever been \\[privileged\\]([https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122](https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122)) in the way feminists claim.   But we are now at the point where the deck is stacked against males at every stage of their lives and in almost every major institution.   \n\nWhen a male is born he can have his genitals mutilated. Hundreds of baby boys die from this procedure every year.\n\nThen comes primary school, where boys are often punished and even drugged for displaying natural boyish behavior. Recent studies have also revealed that female teachers mark down boys by an average of 20 percent for the same work.\n\nHuge numbers of boys are now being raised without fathers (including about 99 percent of school shooters, funny how we never talk about that), and since pedo hysteria has chased male teachers out of primary school, boys often don't have any male role models until much later in life.\n\nBoys only clubs (eg the Boy Scouts) are being eliminated while girl only clubs remain.\n\nTeenage boys are being introduced to blatantly misandrist concepts like \"toxic masculinity,\" with narry a word about toxic femininity and nothing about the positive aspects of masculinity.\n\nNext it's off to University, where there are a range of female-specific scholarships and programs even though women make up the majority of college students and young women are now out-earning young men. They are also portrayed as rapists in waiting, and there are entire departments (gender studies) devoted to demonizing their sex. If a young man pisses off a young woman (eg dumps her after a one night stand) he faces the possibility of being subjected to a false accusation and a feminist Kangaroo court. Then it's bye bye academic career and social reputation.\n\nIf he wants to vote he will have to sign over his body to the state (selective service).\n\nIf he gets a woman pregnant he will not have the option of legal parental surrender. While a woman can just drop off the baby at a safe haven, the man is on the hook for 18 years of child support and will be locked up if he loses his job and can't pay.\n\nIn the workplace things are just as bad. Men perform almost all of the dirty and dangerous jobs and make up 95 percent of workplace injuries and deaths. If a white man wants to pursue a more respected career he faces racial and sexual discrimination in hiring due to corporate \"diversity\" measures and quotas. A recent study in...I think it was Australia found that \"blind hiring\" practices (where the employer doesn't know the race or sex of the applicant) result in more straight white males being hired; this means that it is straight white men who are now suffering discrimination in the workplace.\n\nWith MeToo, a man can be fired from his job simply for making a woman uncomfortable. There have even been cases of men being fired for telling a naughty joke.\n\nIf he gets married and the wife divorces him through no fault of his own he will likely be treated like shit by the family courts unless he can afford a high priced lawyer. There are countless stories of men effectively being turned into indentured servants by their ex-wives; they live in poverty and seldom see their kids while the wife gets a new \"baby daddy\" and lives high on the hog. NOW, the largest feminist organization in the world, continues to oppose shared parenting even though every single study shows it to be in the best interests of the children, the father and even the mother.\n\nHe will receive less social support, less health care spending, and be relentlessly demonized in the media. \n\nIf a male is sexually assaulted by a woman he will probably not receive justice; the perp will likely get a slap on the wrist even if the victim is a boy.  \n\nIf he commits a crime or is falsely accused of a crime he will be treated much, much more harshly by the criminal justice system.\n\nI could go on.\n\nIt is a myth that feminists think the sexes are equal. Their MO goes like this: if men are ahead in some area, that means women are being oppressed because the sexes are identical except for genitalia; however, if women are ahead in some area that's because women are superior. You can find this sentiment going back to the first wave. Elizabeth Cady Stanton claimed that women are \"infinitely superior\" to men.\n\nThe prison thing is perhaps the most glaring example of feminists not practicing what they preach. If they were serious about equality they would be demanding either that men be treated with more compassion/leniency or that women be treated more harshly (or some combination of the two). Instead, they want women to be treated even \\*more\\* leniently, and some are even advocating for the complete abolition of female prisons.\n\nMen are increasingly second class citizens not only in a social but legal sense. A study in the UK determined that if women were treated like men by the criminal justice system, fully half of all prisoners would be female. Women do NOT commit less crimes than men (though they do commit less homicides), they just don't get punished to anywhere near the same extent.\n\nIf feminism were an \"equality\" movement they would not be trying to privilege females in every single institution.    They would be looking with a keen eye at areas in which males are disadvantaged and/or subject to institutional discrimination.   They certainly wouldn't blame everything on some nebulous all-encompassing \"patriarchy\" that hasn't even been proven to exist.  \n\nAdvocates of gender equality must reject feminism, and support men's rights.",
    "title": "Feminists say that there is no sexism against men, because men don't suffer institutional discrimination. In fact is males, rather than females, who suffer the vast majority of institutional discrimination.",
    "subreddit": "MensRights",
    "timestamp": 1551253860,
    "score": 519,
    "keyword": "woman teacher"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 506,
    "keyword": "woman teacher"
  },
  {
    "text": "It is now males, rather than females, who suffer the vast majority of institutional discrimination This post was originally submitted by u/Vwar. For new subscribers, here it is again.\n\n---\n\nI don't believe that males have ever been [privileged](https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122) in the way feminists claim.   But we are now at the point where the deck is stacked against males at every stage of their lives and in almost every major institution.   \n\nWhen a male is born he can have his genitals mutilated. Hundreds of baby boys die from this procedure every year.\n\nThen comes primary school, where boys are often punished and even drugged for displaying natural boyish behavior. Recent studies have also revealed that female teachers mark down boys by an average of 20 percent for the same work.\n\nHuge numbers of boys are now being raised without fathers (including about 99 percent of school shooters, funny how we never talk about that), and since pedo hysteria has chased male teachers out of primary school, boys often don't have any male role models until much later in life.\n\nBoys only clubs (eg the Boy Scouts) are being eliminated while girl only clubs remain.\n\nTeenage boys are being introduced to blatantly misandrist concepts like \"toxic masculinity,\" with narry a word about toxic femininity and nothing about the positive aspects of masculinity.\n\nNext it's off to University, where there are a range of female-specific scholarships and programs even though women make up the majority of college students and young women are now out-earning young men. They are also portrayed as rapists in waiting, and there are entire departments (gender studies) devoted to demonizing their sex. If a young man pisses off a young woman (eg dumps her after a one night stand) he faces the possibility of being subjected to a false accusation and a feminist Kangaroo court. Then it's bye bye academic career and social reputation.\n\nIf he wants to vote he will have to sign over his body to the state (selective service).\n\nIf he gets a woman pregnant he will not have the option of legal parental surrender. While a woman can just drop off the baby at a safe haven, the man is on the hook for 18 years of child support and will be locked up if he loses his job and can't pay.\n\nIn the workplace things are just as bad. Men perform almost all of the dirty and dangerous jobs and make up 95 percent of workplace injuries and deaths. If a white man wants to pursue a more respected career he faces racial and sexual discrimination in hiring due to corporate \"diversity\" measures and quotas. A recent study in...I think it was Australia found that \"blind hiring\" practices (where the employer doesn't know the race or sex of the applicant) result in more straight white males being hired; this means that it is straight white men who are now suffering discrimination in the workplace.\n\nWith MeToo, a man can be fired from his job simply for making a woman uncomfortable. There have even been cases of men being fired for telling a naughty joke.\n\nIf he gets married and the wife divorces him through no fault of his own he will likely be treated like shit by the family courts unless he can afford a high priced lawyer. There are countless stories of men effectively being turned into indentured servants by their ex-wives; they live in poverty and seldom see their kids while the wife gets a new \"baby daddy\" and lives high on the hog. NOW, the largest feminist organization in the world, continues to oppose shared parenting even though every single study shows it to be in the best interests of the children, the father and even the mother.\n\nHe will receive less social support, less health care spending, and be relentlessly demonized in the media. \n\nIf a male is sexually assaulted by a woman he will probably not receive justice; the perp will likely get a slap on the wrist even if the victim is a boy.  \n\nIf he commits a crime or is falsely accused of a crime he will be treated much, much more harshly by the criminal justice system.\n\nI could go on.\n\nIt is a myth that feminists think the sexes are equal. Their MO goes like this: if men are ahead in some area, that means women are being oppressed because the sexes are identical except for genitalia; however, if women are ahead in some area that's because women are superior. You can find this sentiment going back to the first wave. Elizabeth Cady Stanton claimed that women are \"infinitely superior\" to men.\n\nThe prison thing is perhaps the most glaring example of feminists not practicing what they preach. If they were serious about equality they would be demanding either that men be treated with more compassion/leniency or that women be treated more harshly (or some combination of the two). Instead, they want women to be treated even *more* leniently, and some are even advocating for the complete abolition of female prisons.\n\nMen are increasingly second class citizens not only in a social but legal sense. A study in the UK determined that if women were treated like men by the criminal justice system, fully half of all prisoners would be female. Women do NOT commit less crimes than men (though they do commit less homicides), they just don't get punished to anywhere near the same extent.\n\nIf feminism were an \"equality\" movement they would not be trying to privilege females in every single institution.    They would be looking with a keen eye at areas in which males are disadvantaged and/or subject to institutional discrimination.   They certainly wouldn't blame everything on some nebulous all-encompassing \"patriarchy\" that hasn't even been proven to exist.  \n\nAdvocates of gender equality must reject feminism, and support men's rights.",
    "title": "It is now males, rather than females, who suffer the vast majority of institutional discrimination",
    "subreddit": "MensRights",
    "timestamp": 1548320409,
    "score": 293,
    "keyword": "woman teacher"
  }
]