[
  {
    "text": "Things they should’ve mentioned at the interview....... So I recently accepted a full-time position at a law firm as a “runner”/office assistant.   The position was described to me as going to the post office and courthouse on errands for the firm, as well as some computer work.  I started the job yesterday and the first “errand” the lawyer had me run, was to drive his giant pickup truck across town to put gas in it for him.  I am a petite woman and drive a very small car, and absolutely did not feel comfortable driving his vehicle.  They also told me I’d be driving the lawyers out of town regularly for appointments, when needed.  None of this was mentioned at the interview.   Just wondering what y’all think of that?  🤔",
    "title": "Things they should’ve mentioned at the interview.......",
    "subreddit": "jobs",
    "timestamp": 1617158731,
    "score": 8,
    "keyword": "woman lawyer"
  },
  {
    "text": "Got laid-off in Jan and a DUI Charge This is not a poor me post. I have a problem went to rehab for drinking and came back 50 days sober and then got laid off (along with 300 others). Ok dealt with it, severance package would keep me floating for a bit, thought Yeah new role with a better company. Days pass stress and boredom start building and BANG (self-destruction was at 77 days sober) relapse and get a DUI outside of my car walking back to my place. Had a very messy divorce after 18-year marriage. Dealt with her 1.5 year-long affairs. Dealt with the loss of the family breaking apart. Dealt with all of it and I didn't start drinking heavily until May 2010 Primetime COVID. No human contact and working from home with my fellow people in little black boxes on the laptop.\n\nNow have dream job interviews and all are out of state. Possibly be hired (Still interviewing). With a DUI I'll absolutely have to do jail time in my state. Lawyer says the state will not care your F'd. So EVEN IF THERE is a small chance in hell I get my dream job with my dream company I probably can't take it and I will lose my place and freedom due to my addiction. Again, I Did this to myself I know that.  I'm a self-destructive binge drinker. I've lost my daughter to my drinking and moved out (grown young woman). She is the life of my world and I've F'd it all up. \n\nIf I get an offer and happen to pass the background check I can do one of 2 things. 1. leave the state and NEVER come back but will have a misdemeanor warrant for a traffic offense. 2. Stay here lose what I have left and do my time. Oh, there is a third; no job, still lose everything, and go to jail in a COVID era. \n\nThanks for letting me vent. I know I'm in the wrong I'm just so lost and feel so hopeless",
    "title": "Got laid-off in Jan and a DUI Charge",
    "subreddit": "jobs",
    "timestamp": 1613715677,
    "score": 4,
    "keyword": "woman lawyer"
  },
  {
    "text": "Interview Attire for Teens Posting for my younger sister she doesn’t have Reddit. She has an interview at a grocery store next week and she’s not sure what to wear, we looked up what to wear for interview for teens and all the women’s outfits that were suggested are more appropriate for a 40 year old woman working in a lawyers office, not for a teen girl. Please suggest anything age appropriate that won’t make her look 35. Right now she has a cardigan and a nice skirt picked out with some flats but I promised I’d take her shopping for more.",
    "title": "Interview Attire for Teens",
    "subreddit": "jobs",
    "timestamp": 1635966546,
    "score": 2,
    "keyword": "woman lawyer"
  },
  {
    "text": "The \"Husband Stitch\" So a few years ago my husband told me that the doctor who delivered his brother asked his dad if he wanted a \"couple of extra stitches thrown in there\" while her episiotomy was being closed. Of course I found this offensive and angering, and a joke in extremely bad taste. \n\nThis morning the topic came around again, and I mused that, back in the '70's, doctors might have actually *done* that shit. My husband scoffed at me and said \"No way,\" and I agreed. I was probably just being bitter bc his dad is a sexist asshole. (Ex: took pictures of other women in bikinis on a family vacation with the family camera, got them developed, and they're still in their photo box.) Out of curiosity, I decided to google \"husband stitch\" to reassure myself that it was an urban legend. \n\n**I was so. Fucking. Naive.**\n\nThe \"husband stitch\" was [totally](https://www.healthline.com/health-news/husband-stitch-is-not-just-myth#The-history-of-episiotomies,-from-popular-to-discouraged) [real.](https://granta.com/the-husband-stitch/) My husband and I just stared at each other open-mouthed for a second because it seemed like such an evil, misogynistic violation that it couldn't be real. But it is. \n\nFor those that don't know, the practice involves putting extra stitches in the vagina to make it \"tighter\" for the man's pleasure because men are still terrified that childbirth makes pussies loose. That's not true, and it also shouldn't be a fucking priority after you just had an infant. The practice can cause a host of complications for women, most frequently **pain during intercourse.** But that's a petty concern when compared to a man's right to fuck. This can affect husbands, too, because it really messes up their sex life. (Hope it was fucking worth it, asshole.)\n\nI took the practice to be separate from an episiotomy, which I thought was a medical procedure, but my husband made a great point: episiotomies used to be routine because they didn't want the vagina torn too much, and he asked me if I thought that was out of concern for the woman. \"No,\" he said, \"the interest in preventing tearing was **also** to keep the husband's vagina nice and tight and pretty looking.\" I had to admit that he was right. (And I was also secretly proud of him. I hit the man jackpot!) \n\nThe \"husband stitch\" is still performed today, and I truly wonder how many women even get asked or told about it.\n\nEven after being on the planet for 43 years, this practice still shocks the **fuck** out of me. One woman described \"laying there like a lump\" while the husband and doctor discussed the extra stitches, ignoring her completely. I always worry about being one of those stereotypical \"angry, man-hating\" feminists, but I'm so fucking tired of men thinking they have any amount of privilege or control over our bodies!!! This stitch shit is fucking crazy! \n\nIt's nothing but a subtle admission that a lot of men see women as non-sentient fuck-holes that only exist to pleasure them. Look at they way they flipped their shit about #MeToo, when it was made loud and clear that they don't just get free access to our bodies whenever it strikes their fancy. And i **know** women have it relatively good in America, but I can't believe that we still have this far to go. And to be brutally honest, I am finding it hard **not** to despise men just a little bit for thinking they're owed a tighter pussy because they were generous enough to let us have their baby. **Fuck that.**\n\nMy husband was appalled, too, but I really needed to rant at some fellow women. Thanks for putting up with me :) Stay safe and healthy out there!\n\nEdit: 20 seconds and the post gets downvoted. I'm gonna throw caution to the wind and assume it's a guy throwing a tantrum because he doesn't like being told that our bodies don't belong to him. How about that person simply respect us out of common fucking courtesy, since it's always the **obviously correct** choice, and just go on from there.\n\nEdit2: **STEPS TO TAKE TO PROTECT OURSELVES**: Fuck genital mutilation, ya'll! From what I have read, there are a couple of simple things we can do to avoid this bullshit:\n\n1. Find an OBGYN that you trust (good advice for all of us!)\n\n2.  Talk to them about how you would like your birth to go and try to establish some kind of plan. Keep it short and simple, say 3 of your most important thoughts. It's always helpful to bring an advocate with you (this is usually the husband if it's an obstetrics appt, but it can be anyone you trust and who knows what you want to achieve.)\n\n3. Ask the OBGYN **what their policy is regarding episiotomies.** Ask them how often they do them and how they decide that it's necessary. *Tell them you would prefer you don't have one if at all possible,* although sometimes they are needed in emergent situations. Use your voice, say that shit - doctors work for *you.*\n\n4. Tell them that you don't want the husband stitch, and if they try to laugh it off, tell them what you know about it and that it's a real thing. Don't let them intimidate you, you have the right to tell them what is and isn't acceptable. If you have an advocate or support, bring them too if it will help.\n\n5. This is unofficial, but I'm a nurse, so: **do your own research before your appointment. ADVOCATE FOR YOURSELF**, because a lot of doctors (sorry if I offend, and I'm only speaking from *my* experience) are supercilious man-splainers that are used to having their ass kissed constantly. (And you should see the difference in the way most male doctors talk to female nurses vs. male nurses. But that's another post.) **Don't take that bullshit.** Ask them however many questions you want, make them explain anything you aren't sure you're solid on, ask about meds, ask about anesthesia, bring something to write on. If they order tests, ask them what they're for - doctors will order Bullshit tests to get a few extra bucks from your insurance. (I have seen this happen at nearly every floor I've worked on. It's especially bad if you have Medicare - they charge the fuck out of Medicare.) When it's all over, **ask for an itemized bill.** If something seems bogus, call the office and make them give you an explanation.\n\n6. Again: Use your voice. Advocate for yourself (and the rest of us ladies will benefit, too!) I can't say that enough. Don't let anyone blow you off or condescend to you, and don't leave until you have the information you want. **I love you guys! Stay safe and healthy and vaginally perfect out there!! I know it's painful And upsetting to read about this shit, but THIS IS HOW WE MAKE LIFE BETTER for ALL of us. You're amazing, and i believe in you!**\n\nEdit3: Guys, my inbox is freaking blowing up and i can't answer everybody. **Thank you so much for the awards and the kind words!** I was mortified by this and really needed to talk to some women (I've got some anxiety issues - but who doesn't after 2020), and you guys have helped me so much! Spread the word about this misogynistic fuckery to all the ladies you love of child-bearing years, and keep on being wonderful human beings! <3 <3\n\n**Edit 4: What can we do to raise awareness and hold doctors accountable?** I slept on this, and I have some ideas, but I also need your help. Here are my thoughts: I'm a member of the Satanic Temple, and they do a lot of activism regarding bodily autonomy. This issue seems to be right in their wheelhouse. They have funds and they have lawyers. I think it's worth it for me to email them about this - even if they don't pick it up right away, at least it will put the bug in their ear. I have a friend back in Boston who knows one of the ST founders, and i am going to get him to work this into a convo with Doug sometime. That's one way to raise awareness about this. But what else? How do we find women who have been victims of this? Do we set up a website where they can self report? Does anyone know how to do that, because I'm shit with that kind of thing. Are there any lawyers reading who could give advice? What do you guys think? Can we create a space where we can talk about/collaborate on this - maybe a Slack workspace or something? **What are your thoughts?**",
    "title": "The \"Husband Stitch\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618413909,
    "score": 10409,
    "keyword": "woman lawyer"
  },
  {
    "text": "It's been said by many women, millions of times, but I'll say it once more: Men. Don't. Get it. At this very moment, in many different parts of the world, the world is arguing whether or not my body actually belongs to me. My body. ***My*** body.\n\nAt this very moment, there are lawyers and congressmen speaking in hushed tones, scouring through documents, legal-ease, and loopholes, trying to find a way to writ into law that I don't belong to myself, I belong to society. And that **my body,** and anything within it, belongs to society.\n\nAt this very moment, my rights as a human being are up for grabs, and are being decided **for me**, without my input or consent, by people I have never known. Many of them victims themselves, broken by a system which taught them that is all that they're worth.\n\nAt this very moment, I am no longer considered to be a human being. 50% of the population are no longer human beings. We are \"lesser than\", because the right to ourselves is **not** a given. They are a **question**.\n\nAnd that feeling, the feeling of your humanity being an unanswered question, always hanging in the balance, having to fight, claw, scratch and scream just to be heard as a whisper on the wind while the rest of the world is content to stand aside and watch you struggle from afar, is something many men do not know. And will never know... But ***every*** woman, does.\n\nMen don't get it. And I'm so, so tired of fighting. All I want is to be human too.",
    "title": "It's been said by many women, millions of times, but I'll say it once more: Men. Don't. Get it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1638510334,
    "score": 2612,
    "keyword": "woman lawyer"
  },
  {
    "text": "Bill and Melinda Gates only just announced they are parting ways, but cue all the misogynistic comments like clockwork. Comments I've seen so far: \n- He(Bill) has provided for so long, what does she even need him for? \n- Melinda is making so many divorce lawyers so happy right now\n- Both of these women (Melinda/Mckenzie) have clearly pulled themselves up by their bootstraps right /s\n- Men are clearly better providers and contributors to society (about the fact that Mckenzie and possibly Melinda will be some of the wealthiest women from divorce)\n\n \nIt's really disgusting and disheartening to see these comments. Melinda was a career woman who after getting her bachelor's in computer science worked at Microsoft. In her life she focused on her career, starting a family, philanthropy projects, writing, ect. She and Bill were married for 27 years, she is NOT a gold digger for f* sake. In fact, Bill and Melinda seem to be genuinely decent people and It's really quite sad they're parting ways after so much time together. The terms of their impending divorce are not anyone's business besides theirs.\n\nEdit: This kind of blew up. Looks like my observation was based on the cesspool that was the initial comments on this news, it seems to have mellowed out with time. There are some crazy comments here too though, looks like an incel wants me to know that I am a cry baby b*tch and should stfu. Lol, have a nice day everyone.",
    "title": "Bill and Melinda Gates only just announced they are parting ways, but cue all the misogynistic comments like clockwork.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1620085410,
    "score": 447,
    "keyword": "woman lawyer"
  },
  {
    "text": "I am so grateful for Elle Woods as a feminist icon. She succeeds not in spite of her traditional feminity, but because of it. I am spending a lazy Saturday morning cuddling with my dog and watching Legally Blonde (one of my great comfort movies of all time), and it struck me how grateful I am to have had Elle Woods as a role model as a little girl. \n\nWe've all heard the rallying cry of internalized misogyny: \"I'm not like other girls!\" The underlying meaning here is that being feminine, as a default, makes you less-than: frivolous and empty-headed and unworthy of respect. To be taken seriously, the idea goes, you need to be unlike a girl.\n\nElle Woods is in many ways the epitome of the \"other girls\" that this hackneyed phrase rejects. She is interested in fashion and beauty. She is herself extremely beautiful. She loves the color pink, and often surrounds herself with soft, fluffy things in pastels and candy colors. Our cultural conditioning tells us that these things are all signals that Elle is unworthy; at the beginning of the movie, she is rejected by her boyfriend as unworthy BECAUSE of these things. Other characters, especially the men, constantly try to diminish her because of these traits.\n\nBut the thing that I love most about Legally Blonde is that, even as Elle herself sometimes doubts, the movie itself never criticizes her for her traditional feminity. Rather than being shallow and vain, she is kind and compassionate. She is frequently the cleverest person in a room, and her interest in and knowledge about fashion and cosmetology are shown to make her better as a lawyer. When she decides to get serious at Harvard, she does not lose the hallmarks of her \"feminine\" tastes: her laptop is brightly colored, and her resume is pink and scented. \n\nUltimately, what I love about Legally Blonde is that Elle's feminity is not an obstacle for her to overcome on her road to success, but ultimately an asset - part of what makes her strong and talented. She wins the big case because of her knowledge about hair care while wearing a bright pink, sparkly dress. As a young, gifted girl desperate to be taken seriously, Elle was a beacon for me. Watching Legally Blonde repeatedly as a kid (six times in the theater with my mom) did not completely change my self-concept overnight - I definitely still went through my own \"not like other girls\" phase in high school - but I do think that it helped plant the seeds for who I have become as an adult woman with two Masters degrees who fucking loves pink. So thank you to Elle,  and to Reese, for playing her to perfection!",
    "title": "I am so grateful for Elle Woods as a feminist icon. She succeeds not in spite of her traditional feminity, but because of it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615050095,
    "score": 276,
    "keyword": "woman lawyer"
  },
  {
    "text": "Why is it always an argument with older male doctors? I'm tired of having to viciously advocate for myself every time I get stuck with one because my primary isnt available. I'm tired of having to have an argument about my right to recieve adequate care every time I get saddled with one. I should be going to the doctor to be *helped*, not have a jousting match with a jerk who wont listen to me.\n\nI'm a woman in my mid-20s and have been suffering with an autoimmune disorder since just after I turned 20. *Every* older male doctor I've had has gone out of their way to deny me any form of help or treatment. It always boils down to: *\"Well, I think you're okay, and you're too young to have these kinds of issues! It sounds like you're depressed and have anxiety. Is your period coming?\"*\n\nI was unfortunately stuck with a doctor like this when the immune issues began, too. I put on 50lbs in 2 months despite barely being able to keep anything down. I began having shakes and my heart rate while resting was 130bpm. I was admitted to the ER several times and, instead of taking me seriously, he repeatedly insisted it was just my period, secret binge-eating, and that I must do some kind of street drugs that are damaging my heart. Anything not to test me or take me seriously, right? He was actively watching me die without treatment and was seemingly content with it.\n\nThe only way I was able to get him to test me for this condition (which is hereditary and runs *very strongly* in my family) was to threaten a lawsuit in a full-blown screaming match with him. It shouldn't have had to be that way. For me or for anyone. This man was supposed to be a doctor. I had to drag a *lawyer* to the appointments with me until I was able to switch doctors and move to a new town.\n\nAnd after many years and many doctors, this is still a problem.\n\nWhen my primary, a woman who actually listens to me and helps me, isnt available I get tossed around to random physicians. Yesterday I was stuck with an older male who, of course, listened to every word I said and then contradicted me at every single point. Even going to far as to say that I dont *actually* have an autoimmune disorder. All the tests I have every month for literally years to monitor it are wrong, I'm perfectly healthy. I'm apparently just severely mentally ill and require buckets full of psych meds. *Also, hows my period?*\n\nI'm so mad I could spit.\nInstead of getting my autoimmune medication adjusted, I get accused of being hormonal and psychotic. Again. I get denied help, again.\n\nBut I advocated for myself this time. And I yelled. I reiterated everything I had said previously. I forced him to write in my chart if he was continuing to refuse me treatment for my very well documented disease. I had to argue with him and continually correct his perception of me for well over 20 minutes in order for him to give me the medication I very literally need to live.\n\nAnd it shouldn't be this way. This is exhausting and inhumane. If you're going to treat your female patients this way ***you should not be a doctor.***",
    "title": "Why is it always an argument with older male doctors?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1619215972,
    "score": 237,
    "keyword": "woman lawyer"
  },
  {
    "text": "I’m so tired of fighting I live in Mexico, which is just generally a pretty shit place for women. I went to a pro choice  protest on Monday and was generally enjoying myself, hanging out with friends, and talking to generally respectful press. Abortion is pretty much illegal in my state, but there was a presentation about how to get/use abortion pills and what resources there are. During this a women in her late 50s walks up, grabs the mic from the presenter and started shouting about how it’s a sin and adoption is a thing. She was quickly escorted away but, it really was the last straw for me. \n\nYes, I know we’re protesting in a public place about a controversial issue, but I could not care less about your religion. What are you doing to fix the system? Are you helping women access birth control? Are you fixing the adoption system in Mexico (which is a whole other thing I can’t even get into rn)? Ya, I didn’t think so.\n\nI’m so tired of always having to be an advocate for myself, and often times for others. I am very publicly a feminist so I guess that means I’m just a resources on anything that has to do with women? \n\nMy 60 year old mother came to ME a 17yr old, because one of her friends daughters was sexually assaulted and they didn’t know what to do (the girl was only 14). I ended up accompanying the mother and the girl to the women’s ministry and helping them get access to a lawyer and psychologist. Like, I don’t mind, but this shouldn’t be my job. \n\nI’ve helped quite a few friend get birth control. I had a girl live with me while she was hiding from her abusive boyfriend. I’m always the sober friend at parties that makes sure everyone gets home. My friends and I are always sharing our live location with each other so that if one of us goes missing, there is at least somewhere to start.\n\nI’ve driven 6 hours (in shifts) to take women to abortion clinics. I know all the legal resources and advocacy groups in my state (I’ve attended sooo many seminars and presentations at this point it feels like school). I’m preparing to testify in a civil case against my old school for gender discrimination. I’m so over it. Like, why should anyone have to do this.\n\nWe (feminists) are literally asking for the BARE MINIMUM, and treated like we’re insane terrorists. A woman is murdered in Mexico every two and a half hours and people are angry at ME for saying patriarchy exists.  \n\nI’m so angry/stressed/worried all the time. There’s always someone going missing, someone who needs access to medical care, someone who just needs to be told it wasn’t their fault. I know it’s not my job to fix all of it, but at the same time when im seeing it everyday, of course I want to do something. \n\nSorry if this was a bit of a rambling mess but I just needed to put this somewhere.",
    "title": "I’m so tired of fighting",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1619809053,
    "score": 143,
    "keyword": "woman lawyer"
  },
  {
    "text": "I got accepted into the master's program of my dreams! I'm so happy and I want to share this achievement with all of you because you all had given me the strength to continue and never give up. Reading your stories had made me feel understood, there are no words I can say to thank you enough. I have learned through your words how to respect myself and how to not revictimize myself. I want to share my story in case someone can relate, if I could get out of the darkness, you can too!\n\nTW: sexual assault, abortion, suicidal ideation\n\n\n2019 was one of the most difficult years of my life. I was in a very toxic relationship with a serial cheater and abuser. I lost myself completely, I lost my voice, my willing and back then, I thought I had lost my worth too. He was agressive in every way, he used his strength as a krav maga instructor against me and fear was a constant feeling. He ended up raping me and hitting me. I got pregnant and had to get an abortion. All of that was extremely traumatizing to say the least. I don't know how I survived all that, but I did and left that \"relationship\". \n\nIt was hard. Not because I loved him, no. But because I didn't love ME. I thought I didn't deserve anything better. I felt guilty and stupid. I have depression and anxiety and they reached a peak at that time. I caught myself in a destructuve cycle of pity, anger, fear and hollowness. I was suicidal.\n\nAnd then 2020, the pandemic hit. I isolated myself. I've never had lots of friends but this was a new level of loneliness. I had just finish my bachelor's, I was broke and unemployed and feeling my life was paralyzed. I've always felt I'm behind in life because I couldn't follow \"the plan\". I finished my degree at 29 and I'm still living with my parents. I didn't choose it to be that way, I'm not lazy, but my life had other plans for me. Anyways, one of my life dreams is to have an academic career, I want to have a Master's and a PHD, I want to be a reseacher and a teacher. But I felt stuck and didn't pursued those dreams, didn't apply for any program. \n\nI was trying to heal and got briefly into therapy. It helped me for a while, but my therapist pressured me into report my abuser and press charges. I didn't want to. I didn't have the mental and emotional strength to go through that process, I didn't even have the money to get a lawyer, and even more when I'm in a third world country in which rape culture is normalized, 85% of rape acussations don't get a closure and 11 women are killed everyday without anyone blinking an eye. And I felt (and still feel) guilty for not \"doing my part\", I don't want any other woman to live what I did, I don't want him to hurt anyone else. But I really couldn't, I just wanted to heal and take my life back, I was so down everyday I thought about kms. \n\nEven tho I had blocked him, he made sure to let me know he got accepted into a (different) Master's program of our Uni and that he was excited to see me again. I was paranoid and scared, I don't want to see him ever again. \n\nMeanwhile I got close to a friend I hadn't seen for years. He listened to me and was there for me through my healing process. I didn't know how much I needed someone to be compassionate with me because back then I didn't know how to do that for myself. He was patient, never judged me, never pressured me. We started a relationship and I think he taught me how to love myself, how to respect myself. I truly love him with all my heart, this is the best relationship I've ever had and for the first time I'm not codependent. He showed me another life is possible, a beautiful one in which fear is not the dominant feeling, but tranquility. I feel content. \n\nHe motivated me to apply to a program in another Uni, a program I've always dreamed of but seemed impossible for me to get in. And after 6 months of tests and waiting, yesterday they told me I'm in. Guys....I'M IN!! I did it!! Me, the same woman that didn't see a future for herself.\n\nWell, I guess I'm not the same woman. I've grown and healed and will continue to do so. Some things still hurt, but I'm so much better right now. I didn't imagine I could have this life. Back then everything seemed so dark and asphyxiating, back then I thought that was the end. But my life is only starting, now I understand it's never late.\n\nI will find another therapist to treat my anxiety and my insecurities. I will be fine, as I am now. \n\nIf you are going through a hard time, please know that you are not alone. I don't want to be that person that says it always gets better, I know that in a depressive state that can sound condescending. But I will say that the future can hold plenty of bad things, but definitely has all the good ones. Uncertainty has all the opportunities and progress and we are stronger than we think.\n\nThank you for reading me, I hope this resonates with someone out there.",
    "title": "I got accepted into the master's program of my dreams!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625068959,
    "score": 125,
    "keyword": "woman lawyer"
  },
  {
    "text": "A person I supervise was inappropriately touched and harassed at a company event This happened at a company party and she was harassed by the perpetrator via text and calls (which she did not respond to) the entire weekend. She came to me Monday to tell me what happened and I helped her report it to her boss; we both met with him and she asked me to tell her story. He said he would look into it and check the cameras since she thought it was in view of one of the security cameras.\n\nDuring the meeting with her supervisor, I was less than happy with his response that he will \"look into it\" and he said for now she will not be asked to work in the same area of the building as the person who assaulted her. He then spoke to the company president about the issue (we don't have HR; it's kind of ridiculous) and she met with him as well. \n\nA little background information:\nI have no hiring/firing authority at this company, but I am a senior employee and what I say is typically taken heavily into consideration. I am also one of the only women at the company. I have also had my own run-ins at this company with men being inappropriate but it's usually well taken care of; not always. However, this is the first time it has happened to someone under my supervision. As a senior employee and a woman, I feel like it's my responsibility to make this a safer environment for women. It's also a very small company (< 50 employees) and we currently have the most women employed in my entire tenure here (8 women).\n\nI think the employee that touched her should be fired. Period. There's no room for that kind of behavior and I expressed that. However, when our company president reviewed the tapes, text messages, and voicemails with a lawyer, the lawyer advised that termination is not an appropriate punishment. \n\nInstead, she was told she won't be asked to work in the same vicinity as him whenever possible and he's going to get a warning. I immediately expressed how unacceptable this outcome is to everyone in charge. I met with her boss and the company president and explained to them the message they are sending to every woman at the company with this resolution; they said they understood but that this was the best course of action. I don't know what else to do or how else to support her. I feel like I failed her.",
    "title": "A person I supervise was inappropriately touched and harassed at a company event",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1639628661,
    "score": 114,
    "keyword": "woman lawyer"
  },
  {
    "text": "I hate when men mimic me in a high pitched tone I don’t get it. What do they think will happen? I’ll laugh and be like “Haha! You got me!”? No, I won’t. It’s rude and disrespectful and the only time it really happens is when I’m trying to be polite when I’m giving them instructions. I don’t know if they get offended that “Oh a woman is telling me what to do”, but I’m trying to be nice about it, and that makes them want to be a dick to me? \nIt just makes me feel like they don’t respect me and my authority, and I don’t understand why the go-to would be to attack my voice and the way I speak. Has anyone else had this? Is this just a common thing I’m going to have to deal with for the rest of my life if I want to be in any authoritative position at all? I used to think about going into office, maybe a Senator or Lawyer, but if I’m just going to get men making fun of me for telling them something important, I might pass on that. It’s just so frustrating for me.",
    "title": "I hate when men mimic me in a high pitched tone",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1610163027,
    "score": 99,
    "keyword": "woman lawyer"
  },
  {
    "text": "The pure insanity of the Texas SB8 fetal heartbeat bill Edit: any lawyers care to chime in here? Please correct me if I've got anything wrong in my assessment. I'll remove any misinformation \n\nEdit 2: this post seems to be a roller coaster of up and down votes. Some more comments and discussion would be nice. My tin foil hat suspects vote manipulation to keep this post hidden.\n\nEdit 3: changed three appellate court judges to six out of seventeen.\n\nThere's obviously been lots of buzz about the minimum $10000 civil liability written into this bill, but I suggest that everybody read the full text of the bill. \n\nCopied from one of my comments:\n\nHave you read the full text of the bill? I'm not a lawyer but it seems to be worded such that it can be used as a get out of jail free card card for rape. \n\n#1: if the plaintiff prevails, the defendant is liable for attorney fees and costs. However, if the defendant prevails, the plaintiff is **NOT** liable for the defendants attorney fees. \n\nHeads I win tails you lose.\n\n#2: burden of proof is on the defendant and is based on a **preponderance** of evidence\n\nSo subjective outcomes decided by a judiciary stacked with partisan far right extremists.\n\n#3: \n\n > (a)  Notwithstanding Section 171.005 or any other law, the requirements of this subchapter shall be enforced exclusively through the private civil actions described in Section 171.208.  No enforcement of this subchapter, and no enforcement of **Chapters 19 and 22, Penal Code, in response to violations of this subchapter**, may be taken or threatened by this state, a political subdivision, a district or county attorney, or an executive or administrative officer or employee of this state or a political subdivision against any person, except as provided in Section 171.208.\n\nThose are the sections of the Texas penal code regarding criminal homicide and assault including sexual assault.\n\n#4: it is worded such that an affirmative defense includes if an impregnation occurs as a result of rape or sexual assault.....but statistics show only 20% of sexual assaults are reported and that less than 1% of those result in a successful conviction. So 1/500 or .2%\n\n#5: the court ruling isn't finalized until after review by an appellate court, which was stacked with SIX OUT OF SEVENTEEN federal appellate judges by trump in the fifth circuit that covers Texas.\n\nThis bill is an all-out war against women. It's retaliation for the me too movement. I'd bring up more horrific sections but honestly the entirety of the bill is insane. \n\n#6: a plaintiff has standing if they **reasonably** believe the defendant **intends** to perform or induce an abortion. \n\nA man in Texas can now preemptively shield himself from being prosecuted for sexual assault or even criminal homicide if he files a lawsuit asserting that a woman intends to abort....does that mean women can be effectively murdered with impunity with abortion as the shield?\n\nAgain I'm not a lawyer, but that's my takeaway for this downright evil bill.",
    "title": "The pure insanity of the Texas SB8 fetal heartbeat bill",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626364303,
    "score": 61,
    "keyword": "woman lawyer"
  },
  {
    "text": "My rapist and his professional bluegrass musician girlfriend are using her social capital to silence me after I went to the police. I feel like I've failed SA victims. CW: Rape, physical assault, cyberbullying/letters/phonecalls, suicide attempt, false arrest, probably other triggers so please take care - \n\nI'm putting the TL;DR at the top because I basically wrote a novel.  If you read any of this, I'm really grateful.  I wanted to get this out in a safe environment, as I haven't been able to discuss it with many people. \n\nTL;DR - after I was raped by my 'friend' and former teacher,  I warned his new professional bluegrass musician girlfriend (a recent divorcee with three young children) about his treatment of women and his substance abuse. I suggested she encourage him to get therapy and substance abuse treatment. She said he was the most compassionate guy she'd ever met. \n\nWhen she later found out I was speaking to the police about her boyfriend raping me from a third party,  she created a couple of facebook posts that utilized her cachet as a public figure to doxx me, discredit my claims, have her fans harass my family and their business via every means possible, and have me removed and ostracized from the community.  After seven months of no contact, she baited me into talking about the rape by messaging me and appealing to common experience.  She then used that message along with fabricated and altered evidence to have me arrested on a charge of computer harassment.  \n\nOnce the case was dropped by the state,  I sent an email regarding what happened using pseudonyms for all involved to bluegrass community leadership in an attempt to convince them to hire a third party safe venue/ victim advocate who could establish standardized protocols to deal with harassment and sexual assault.  The girlfriend addressed her followers on facebook again,  this time directly stating I was lying about the rape and abuse, and that my actions diminished the efforts of 'real' victims.\n\nI feel like a worthless failure. I wasn't able to really help anyone.  I constantly wonder if she,  the rapist, and her fans are right and I should just finish it off and be silent forever.  It hurts every day that the rapist and his friends continue to run around, emboldened and vindicated in their behavior.  I worry for my niece,  my cousins,  and my friends' little ones.  I'm terrified about having a child and having to raise them in this area, as my rapist is still nearby.  I don't want to bring them into a world of rapists like 'Ted',  vindictive, faux feminist rape apologists like 'Rita', hypocritical BE KIND types,  and all the other malevolent beings like cops who kill Black folks over tail lights and the never ending stream of sex pests in positions of authority.\n\nDid I do everything I could? Did I help or hinder the progress of sexual assault advocacy? I'm afraid other victims will be scared to speak up seeing what happened when I did. I want so badly to help other victims, and to prevent this from happening to anyone else. \n\nI hate myself.  I'm worthless.  That's why I've been raped twice and thousands of people have said I deserve to be beaten and to disappear. I wish I had done more to mentally protect myself from a predator like Ted, and I blame myself for what happened.  \n\n\\------------------------------------------------------------------------------------------------\n\nAfter moving to a new area far from my hometown,  I started banjo lessons in July 2018 as an avenue to make friends.  I asked my teacher, Ted, to help me find jams and such to join,  which is typical in bluegrass/ old time music as they are based on community participation.  At this time, I also admitted I had issues making friends because I'm scared of men after being raped when I was 20. I brought this up because most jams are almost exclusively attended by men. As he was a teacher,  I figured he was trustworthy. He invited me and some other students out to events after that.\n\nI changed teachers after six months because Ted wasn't an engaged instructor. I stopped speaking with him at this point. About two months later, he messaged and asked if I wanted to be friends. He also offered to help me integrate into the community.  At the time,  my partner and I were separated,  so I was happy to accept any help. I did ask my parents what they thought about Ted's invitation.  My dad was emphatically against the idea,  stating he didn't think Ted was being honest about his intentions. I thought it would be okay,  since he was vetted to teach lessons to children at the community center and seemed well known by the local bluegrass group.\n\nIn our initial meeting as peers, Ted opened by saying 'I was born to be given away.' Even though I loathe him,  I won't elaborate on that point other than to say I think it forms the basis of his issues. He told me he didn't have a lot of friends who were women,  so he was happy to talk to one so he could 'explore his feminine side.' He also spent a lot of time talking about his wife, Loretta. He wanted advice regarding her 'nagging' when it came to his drug and alcohol use around her son,  his jealousy over her male friends, and her suspicions he cheated on her. He also thought she lied about being sexually assaulted and wanted to know why someone would do that. He talked about his time in New Orleans,  and how he discovered he had the ability to turn his emotions off at will. There was also a discussion where I talked about how I had difficulty fitting in with most groups.  He said that other folks are 'shadow people'. I replied that I personally consider it important to never elevate myself,  or to 'other' people,  because that's how violence, bigotry,  and fear are sown. He hastily agreed.\n\nWhen I messaged him later to give him the requested advice on how to improve the relationship with his wife,  he said i misunderstood him. He claimed they were divorced and he was never going back.\n\nThe next time I saw Ted,  he kissed me.  He immediately pulled back and stated he didn't want a relationship,  but that we could be friends and he could help me.  I didn't consider myself emotionally  available,  but I did want his assistance in the community. We discussed it a bit more. The terms included that he'd continue sleeping with other people,  but that he'd practice safe sex and be respectful of me. I also begged him to not mistreat me in light of my prior rape experience. We then had sex.\n\nThe next time we had sex,  he did something that frightened me.  While I was on top,  he grabbed me by the throat and propelled me into the air.  He's at least 6' and stocky. I'm a little over 5' and small.  I immediately asked him to stop,  and told him it reminded me of my rape.  He then covered my face with his large hand,  but I managed to move off of him.  Afterwards,  he asked me to tell him about the rape.  I did so,  while crying in his arms.  I particularly emphasized how the rapist held me down by the throat. He became aroused.  Then,  he left. \n\nWe continued a routine of going to shows or jams on the weekend,  then having sex. He wouldn't speak to me during the week.  He made a point of never saying goodnight when I said it as we'd leave. He discussed his desire to move within the next year to be around the young college musicians in Tennessee. He hated being in the area around the 'inferior' musicians,  although he felt some obligation towards his parents to stay close by. He lamented that the band he'd been in in high school almost 'made it' . He said he was glad I wasn't like his crazy ex partners.\n\nI responded that he could teach students and raise them to his level.  I noted the other local musicians were well loved,  because they're affable and relatable and art is more than technical proficiency.  Just ask Johnny Cash.  I pointed out young people tend to prefer playing with each other, but that I thought a move might benefit him.  I wish I'd said more about the 'crazy' partners.  It was an ill portent.\n\nA couple of weeks later,  he left for a few weeks to go on tour.  I messaged him, and asked if he'd let me know how it was going and try to respond on occasion.  He sent back a diatribe telling me it wasn't my place to ask anything of him since we weren't dating,  and threatened to cut off our arrangement if I didn't behave.\n\nWhen I saw him again,  he was different.  Although he'd never been a particularly well groomed or emotionally responsive person,  he had clearly atrophied more in this regard. He was almost an hour late to the venue.  He explained that he started drinking at work,  then picked up more beer at the 7-11, then continued to drink at home until he passed out.  He relayed this while sitting there with disheveled, unwashed hair. Alcohol,  body odor,  cigarette smoke, and weed dankness wafted off him in an almost tangible entity.\n\nHe told me about his trip.  He spent the entire time microdosing shrooms along with his usual drinking and heavy marijuana use. He spoke of using cocaine to stay awake while driving.  He talked about how amazing it was to be out there with a band with whom he had a compatible vibe.  He mentioned sleeping with other women,  patronizing sex workers at the clubs and why he enjoyed it,  and how he wanted to cast or carve a statue of his penis.  He loathed being back, and whined again about the area and having to play with local musicians again.\n\nLater,  while having sex,  Ted said some creepy things,  like that I looked like a teenager.  I asked him if that was supposed to be a positive,  given we are both in our 30s. He enthused that it certainly was. I mentioned how I do not feel like an attractive person.  He pointed out the guys who talked to me at the venue. I could tell he was upset about them. He talked about how he fantasized about me when I was his student. Then, during sex,  he did the choke propel move again.  I grabbed his hand and reminded him why I didn't like it. \n\nThe next day and morning, June 28/29th 2019, are the ones seared into my memory.  I arrived at the venue around 9 PM. He came to say hello a while later before wandering off to drink and talk.  After the show,  I mostly talked to his band leader, Mop. This was typical of our outings as I was trying to make friends and we were avoiding looking like a couple.  We left the venue after midnight and went to a parking lot for a trailhead.\n\n\\*\\*\\*DESCRIPTION OF THE RAPE AHEAD\\*\\*\\* \n\nThe liaison started normally.  We were in the front of the vehicle,  then we moved to the back.  As he lived with his parents and I was living with my former partner until I saved enough money,  we typically used my vehicle.  Usually we would put  the back bench to make room.  This time,  he seemed to be in a hurry. He didn't put the bench down. He didn't remove his filthy boots.  Instead,  he pulled his pants off over them. We were making out on the right side of the bench when he said 'I just want to be inside you.' I moved to sit on the left side of the bench while he positioned himself in front of me in the foot well. Suddenly,  he grabbed my throat again.  I said,  \"please, no,  stop!\" Then, as I tried to say more, I blacked out.\n\nWhen I rejoined the world,  he was removing himself from inside of me.  He was acting strangely,  so I asked,  \"are you okay?\" He moved to the other side of the bench.  My legs were painfully arranged.  One was propped up on the driver's seat in front of me. The other was twisted out to the side.  My left hip was ground into the door molding.  I had difficulty moving.  Everything hurt. \n\n\\*\\*\\*\\*\\*\\*\\*\n\nI knew something wasn't right. But I cuddled him,  and convinced myself it was all okay. I hate myself for that, but it was one of the few times he let me touch him.  He said he had to leave because he was taking band photos in a few hours.\n\nI was disoriented and attempted to find my clothes. After rearranging myself,  he offered to have me follow him back to town.\n\nHe'd never offered anything like that to me before.\n\nAfter we parted paths,  I pulled over and cried. \n\nWhen I got back to the house,  it was later than usual.  My former partner,  Arthur,  came out and asked if everything was okay since I was coming in so late.  Arthur knew that I had been attending events with Ted. He noticed I was crying and that my neck was red.  He asked if I was okay, and if I needed help, or to go to the hospital.\n\nI declined,  and ran to shower.\n\nThe next day,  I found bruises all over myself.  They were concentrated on my left hip and all over my thighs,  but especially up near my crotch.  I also found bruises all over my right arm.  Scratches had formed on my right thigh.  I remembered that I had asked Ted about his usually long nails that were only on his left hand,  the one he used to fret the fiddle.  For the non musicians,  nails inhibit playing string instruments,  especially violins and fiddles. I took pictures of every injury I could find.\n\nAfter that night,  Ted mostly stopped talking to me.  I sent a message asking for his phone number,  which he ignored.  I saw him at a couple of events. When I tried to talk to him about what happened,  he'd ignore me and say he was going through a difficult time after the trip.  Online,  I asked him what had happened that night.  I pointed out he was being even more angry than usual,  and drinking heavily.  I was trying to get answers for something my mind was keeping from me. I didn't want to believe that after the times I talked about the issues from the first rape; after I'd pleaded for him to treat me like person, and most of all,  given that I had told him NO three times when he grabbed my neck, that something atrocious had occurred.\n\nIn the middle of July,  he sent me a message saying a sea shanty night was happening nearby.  It was the first time since that night that he'd told me about any events. When I arrived,  he was there with other local musicians.  Some time later,  Rita appeared.  Rita is a professional banjoist.  I had followed her band page for some time.  She posted extensively about her life - she had shared custody of three kids,  she was recently divorced,  she loved to travel,  and she desperately wanted a boyfriend, judging by her mention of looking for a cute guy at every show and her time spent on okcupid in every single blog update.\n\nAs an aside,  I have no idea how Rita ended up there that night.  I suspect Ted invited her,  as it was a very small event with little advertising almost an hour from where Rita lives.\n\nI was excited to meet another woman banjoist.  Rita had been sitting in the corner alone,  so I went over and started talking to her. We discussed being woman banjoists.  I mentioned how I had been having a difficult time with sexism in the community.  She said there were creepy guys who messaged her,  but overall, she just rolled with it.  Ted started talking to her.  They discussed accounting, and which musicians they disliked.  One of the other musicians invited us back to his place.\n\nRita mostly stood around,  as did Ted.  I tried to keep conversation going.  At one point,  I did hear them talking about the banjo she loaned to Ted.  I was confused,  since they'd acted like they didn't know each other.  I sometimes wonder if they were secretly dating during the time that he allegedly raped me.  A girlfriend,  a friend with benefits,  women he slept with while out of town,  and a wife all at once.  At any rate,  the other guys started talking about no name girls - women that guys like Ted would chase out of the community after a few weeks, so it wasn't worth learning their name.  This caused me to launch into an invective about every woman being a person and how ridiculous it was to speak that way.  Rita and Ted said nothing.  I wasn't surprised about Ted,  but Rita often posted about being a feminist and an advocate for women in the bluegrass community. \n\nI gave Ted some herbs to help with his alcoholism when we were leaving.  I tried again to find out what happened.  He said he was tired and didn't want to talk about it.\n\nMy last attempt came a week later, on July 19, 2019.  After a show, I approached him in the parking lot while he was loading.  Everything I said,  he repeated back to me in a mocking tone.  I was speechless and crying. I asked, why? again and again.  A friend of ours, Benedict,  came up to say goodbye, then quickly left when he heard Ted's tone.  Then Ted said he had to go,  shoved me,  and hopped in his vehicle.\n\nI went home and messaged him again, asking what I had done to deserve his cruelty.  Then I blocked him.\n\nI unblocked him later and said that while I didn't understand his malevolence,  I was reliant on him and his help to make friends and move on with my life in the community.\n\nThat's when he told me he was dating Rita, and that he hoped he'd see me around on occasion.\n\nI may not have fully processed what he had done to me,  but I certainly wasn't going to let it happen to a vulnerable mother of three kids.  I know my life is worthless,  but I'll never stand by and let others be abused.\n\nI messaged Rita and told her what had happened - what I remembered.  I sent her screenshots of all the unpleasant,  abusive things he said. I pointed out disturbing things I'd noticed,  like how he enjoyed me looking like a teenager,  and his habit of offering 'lessons' to teenage girls,  but not teenage guys.  I told her about his substance abuse problems. I told her how he complained about his wife asking him to stop doing drugs and drinking around her child. Then I stated it clearly - before dating someone with small kids, he needed therapy for his issues with women and substance abuse.\n\nRita told me he was the kindest guy she'd ever met; a beacon in a sea of dickheads,  and that she'd never let him go.\n\nTed messaged me.  He finally answered my questions.  He said it was all consensual,  that nothing he did was premeditated, and that everything else was my fault.  He told me that everything I told Rita was untrue and disrespectful. He told me that I should expect sexual harassment because of the way I dress,  and the preponderance of men in bluegrass.  I told him I'd always prioritize women and children over men like him.  He told me I was awful and blocked me.\n\nRita messaged me with more questions.  I answered as best I could.\n\nTed unblocked me and told me if I didn't stop talking to Rita,  he would tell the entire community I was crazy and about everything I'd done.\n\nI emailed Rita and apologized for bothering her. I told her he was threatening me,  and that I didn't appreciate that.  I wished her luck.\n\nEarly in September,  I attempted to kill myself. I'd rather not elaborate on that.\n\nLater in September,  I went to a campaign event for one of the musicians that was running for the board of supervisors.  I had been volunteering for him since April.  The entire time,  I was terrified Ted would appear.  I started shaking and crying at one point.  Benedict was there and I told him some of what had transpired. I met him the next day to talk a bit more.  He revealed that Ted was still married,  but complained often about his wife's nagging.  Benedict also mentioned that a couple of months after Ted married,  he started cheating on her.  One affair started at the large annual festival that much of the community attended.  He estimated since then that 5 or 6 women had been around him,  then disappeared.  He tried to encourage me to continue participating in local bluegrass events. I told him I wasn't interested, as Ted scared me.\n\nI emailed Rita again, telling her everything I'd learned and emphasizing he needed help.  She wrote back and said he was 'safe'.\n\nThroughout the fall,  Arthur and I decided to try again.  We began going on dates.  He was there for me as I talked about what had happened,  and how I was feeling.  We agreed to go to couples' counseling.\n\nThe last time I contacted Rita and Ted was early in December 2019. I was doing poorly by this point.  I don't know what I expected.  I just wanted to be acknowledged as a human.\n\nIn January 2020, I was cleaning out my phone when I found the pictures I took after the assault.  That was when my brain unlocked and I remembered what happened.\n\nBy this point,  I hadn't slept well in months.  I was depressed and lethargic.  I realized I needed help,  but wasn't certain how to get it.  I also felt panicked that Ted was out there,  with no one warning the other women.\n\nI tried contacting some music organizations that I thought might be able to help with restorative or transformative justice,  but sexual assault was not their purview. \n\nI reached out to someone I thought might understand - his 'crazy' ex girlfriend, Patsy.  She told me what he had done to her,  which was chilling.  She mentioned he'd moved and was living by himself.  That information scared me because he'd talked about holding lessons at his place once he had one. She encouraged me to go to the police. \n\nI also messaged his wife, Loretta. She was upset because they were married when he was sleeping with me (and all the other women). I apologized,  because I really can't imagine how that felt.  I wish I had known he was married.  I hate that I hurt her.  She suggested going to the police and contacting the sexual assault center.\n\nI contacted them a few days before the one year anniversary of that night.\n\nEveryone should know about these sexual assault/ social justice centers.   RAINN keeps a searchable database of these centers. They offer free counseling to survivors of sexual abuse and it is \\*lifesaving\\*.\n\nAfter a couple of weeks of counseling with the director of sexual assault,   I decided it was time to speak to the Special Victims Unit.\n\nThe sergeant encouraged me to find corroborating witnesses. I emailed Patsy and asked if she'd be willing to speak to the police as well.\n\nShe said she would,  but that she'd like to speak to Ted first - she wanted to see how he'd react when 'confronted' with my allegation.  I asked her to be cautious, and to let the police handle it.  She said she'd already contacted a mutual friend - Finn, one of the other guys from their teenage band.\n\nThe next morning,  I found weird 'likes' on my public pictures.  I suspected something had been posted.  Sure enough, Rita had unblocked me and put up a Facebook post addressed to her friends and followers that doxxed me.  She named me,  gave all my online aliases and associated sites,  gave a physical description of me,  stated the general area where I live,  and mentioned I play banjo. In the comments, she also outed me as a queer woman. She added that I was a crazy stalker who was obsessed with her,  her children,  and her boyfriend Ted.  She asked everyone to watch out for me, and to ignore anything I said because I'm insane and dangerous.\n\nThe comments were filled with people offering to beat me,  drill holes in my head,  run me out of town physically and digitally,  and make me disappear.  She had about 6000 friends and followers.  In the regular world,  that isn't significant, but in an insular niche like bluegrass,  it's quite the reach.  Many people mentioned that they were looking for me and the places they'd seen me posting,  and asking questions about things on my profile.\n\nThe next morning,  Rita messaged me. She opened with, \" Hey OP, long time no talk!\" She said she vaguely knew what I had told Patsy and Loretta,  but that she needed to know about what he'd done for herself. She also said her 'good guy' radar was broken,  and she wondered when Ted would betray her. I told her I didn't feel comfortable speaking to her at that moment.  She said she got it,  then told me she'd had a rape experience of her own. She told me to get over it,  then blocked me.\n\nBenedict also texted me,  asking if I still lived in the area and whether or not I needed someone to talk to.  The last time I had spoken to him was November 2019. It was now the end of July 2020. I didn't answer his questions,  and talked blithely of banjo instead.\n\nIn August,  Rita released a song that I'll call 'Stray Cat.'. The lyrics described a cat who made women disappear and was overall an undesirable animal.  The singer fell in love with the cat anyway,  as it was meant to. My therapist said it was a new experience to hear about a love song about her patient's rapist on the radio.\n\nAfter recovering from the doxx post, I contacted the SVU detective and filed a report.  The detective looked over my photos and the messages and said,  'let's call this what it is - rape.' It was the first moment I truly internalized what had happened that night.  She said it was unlikely the DA would pursue my case without the rape kit and confession.  After Rita's post,  I knew it was pointless to attempt to try and get a confession. It was likely Ted had hired a lawyer,  and no one in the community would want to help - they wouldn't want to face the same ire. The detective said the file would be there if anything else happened,  and that there was no statute of limitations. She asked if I was living alone,  and made certain I had been speaking to the counselors at the rape crisis center.\n\nA couple of weeks later,  I started to feel guilty that I hadn't answered Rita. I decided to email her and let her know what had happened. My partner,  the director of sexual assault at the crisis center,   and my mom advised against this.  They said she was dangerous.  I felt like it was hypocritical to claim to be an advocate for the safety of women while denying an earnest request like Rita's, particularly with her mention of a rape experience.\n\nI told her what happened,  and what the police said.  I told her I wasn't a sage,  but that his past behavior indicated an undesirable outcome for anyone involved with him.  I said there wasn't anything else I could do,  and that I wanted to heal and move on.\n\nI also copied a bluegrass advocacy organization on the email, at the request of my partner. \n\nRita responded by saying 'YOU AGAIN!' I sent a screenshot of her message asking about the rape and replied something like, 'I'm not trying to incite distress. I just wanted to answer your question'. She then said,  'thanks,  this will be useful in the defamation suit (winking kiss emoji)'.\n\nTwenty minutes later,  she called my parents. She called again later that evening.  The next day, she called their house four times from 9 AM until 11 PM. She also called my dad's shop several times.  My brother answered once and told her to stop calling.\n\nThen came the Facebook posts.  She picked people who had liked a picture on my mom's profile. Anyone with a public post received a rambling comment. They were all different.  Some of them said I was an unhinged, obsessive stalker.  Some of them said I was mentally ill and needed help.  They all said she was trying to contact my parents. \n\nNext she tried my dad's business FB page.  This was the first time she brought up a bizarre story about kayaking near my house after the July Facebook post and how her tire was slashed. She posted a picture of her son changing a tire and added they were 'just normal folks. '\n\nShe then started emailing my dad.  She sent all the messages I'd sent her from Ted.  She sent the slashed tire photo (which my dad,  who is an auto mechanic,  said looked very suspicious given how clean it was). She went on and on about how I'd been harassing her for over a year and I needed to stop.\n\nMy dad didn't know about the rape.  My mom knew,  but we decided not to tell him because we knew he'd be upset.  After all,  he was the one who mentioned that Ted seemed untrustworthy.  He called me about all the messages and I told him what had happened.\n\nNot long after this,  Ted himself emailed my dad.  He claimed we'd been in a romantic relationship,  and that I was lying about being raped.  He sent a screenshot of a lawyer contract and the same messages I'd sent to Rita. He told my dad he wasn't a scammer, and that he could be trusted because his girlfriend is a prominent professional banjoist,   and that my dad should Google her.\n\nThe following day was the start of the letters.  Rita sent four letters, two to my parents and two to my partner.  They all had a different tone.  One that was sent to my mom ended with 'you need to stage an intervention.  Send your daughter to an asylum! She cray! (Hand drawn spinny eyes emoji).' My partner's letters all referred to how Ted and I were 'fuck buddies' and I was exacting revenge with a false rape allegation.  Two of the letters were printed packets of the messages I'd sent her.  They had annotations in her hand writing indicating how I couldn't have been raped. \n\nOn September 22, she put up a Facebook post that tagged my father's business.  It had links to his Facebook reviews and Google reviews.  The post detailed how I harassed her and Ted for a year,  and how terrified she was.  She said the police could see I was insane, but since I never threatened anyone physically,  they couldn't do anything.  She also noted that as poor musicians in a pandemic,  they couldn't hire a lawyer.  She said the police suggested reaching out to my family.  She asked her followers to address them at the business site.\n\nMy dad's pages started to receive negative reviews.  His inbox filled up with messages about his crazy,  pig fucking daughter.  I made certain to screenshot everything as usual,  and kept deleting and blocking as necessary.\n\nOn Rita's post,  the usual battery of threats were expressed.  Rita encouraged anyone who offered to leave a negative review or send a message.  Rita updated the post to add a Yelp link. By 5 pm or so,  the post disappeared.\n\nI thought someone must have talked some reason into her about harassing a random business 300 miles away.\n\nI was wrong.\n\nAt 10 PM, a pounding came at my door.  We were terrified,  as we thought it was Rita or one of her violent fans coming to take us out. Arthur looked out the window and said,  'it's the sheriff. '\n\nThey'd come to arrest me,  on a warrant for one count of computer harassment, sworn out from Rita's town.\n\nI've already mentioned being raped twice.  To lose control of your body like that is a shock from which you'll never truly recover.  We all walk around with this illusion of autonomy. That it can be violated so easily permanently alters your sense of self.\n\nBeing arrested is a similar feeling.  Two men,  each far larger than me (I'm a little over 5' and 115 lbs) removed me from my safe spot, handcuffed me,  bent me over a car, and slid their hands between my legs. \n\nThankfully,  the sexual assault therapist had given me some tools.  I cast my mind far away while those strange men touched me. \n\nI was released a few hours later as I have no record and behaved properly. \n\nThe next day,  I was served a Cease and Desist from Ted.  It said I had an unhealthy obsession with him after being turned down,  and was also taking my ire out on Rita.  It stated that my rape allegation was defamation per se, and that I needed to stop because Ted's wish had been to help me integrate into the community.\n\nTwo days later,  we met up with my lawyer,  Boone.  After seeing all my evidence,  he was baffled as to why I was arrested.  We went to get the statement from the courthouse.  Rita had written that I had been harassing her constantly from July 2019 to September 2020, even though the last time I had messaged her unprompted was December 2019. She claimed to have told me to stop contacting her three times. She mentioned the mysterious slashed tire. She said I had just come up with a false rape allegation against her boyfriend.  She wrote that I was a threat to her and her children.\n\nA couple of weeks later,  we received her deposition packet.  The messages I sent her in July 2019, the September 2019 email,  and the September 2020 email were there,  but the dates were not included.  An email that I had never seen,  supposedly from Ted to myself, was there.  It was dated December 2019, but had a caption that it was generated in July 2020. The email was a request for me to stop speaking to both of them.  There were no email addresses,  and several different fonts were used.  After an expert looked it over, it was decided that it was quite probably fraudulent.  There were screenshots from a conversation between Loretta and Ted,  where she talked about what I'd said.  She claimed she deleted the actual messages. Ted also wrote a letter to an unspecified person asking for a protective order against me due to my 'unhealthy obsession' with him.\n\nIt was my turn. I brought my lawyer a hard drive with over 500 files.  I included the full,  unexpurgated Facebook messenger logs with Ted and Rita. I made certain that dates and times were present.  I had screenshots of all her Facebook posts,  and every single threatening response in the comments.  I brought my own copies of the emails.  I had phone logs.  I included all the people I had told about Ted's violence,  starting in September 2019. I brought the letters and packets. Most importantly,  I connected everything to a timeline.\n\nBoone was confident my case would be dismissed.  In December 2020, he walked with me to the judge and said, 'no deal!' A trial was set for February 3, 2021.\n\nWe met with Boone the Monday before the trial.  The offer he had turned down - without even relaying it to me - was a $1000 fine and a mental health evaluation by the court.  We prepared the timeline and all the documents Rita didn't submit,  particularly the message where she asked for me to speak to her about Ted.\n\nThe next day,  the DA offered a new deal. If I pled guilty,  there'd be no trial.  I refused.  The third offer they sent said if I never spoke to,  or about,  Rita AND Ted ever again,  the case would be dismissed in a year.  I let my lawyer know I'd NEVER be silent about what Ted did. I was LIVID at the suggestion and cried with the frustration of rapists being protected. My lawyer called back and said the DA had finally agreed to drop the case via nolle prosequi. Boone emphasized that it was rare for the state to drop a case.\n\nAt court the next day,  the DA called me up and began speaking before I even made it to the podium.  He said 'nol prosse' then began to rant about how 'it was so close ' and that I needed to 'leave Ms. Rita alone'. The judge looked at the complaint and said,  \"there must be more to this case than what's on this paper,  Ms. OP. You're free to go.\"\n\nI knew that moment was the closest I'd get to pitting my word against theirs.  I am thankful I was acknowledged by both the SVU and the court. \n\nArthur and I wanted to do one last thing.  In therapy,  I discussed how much I wanted to change the culture of the bluegrass community,  and how I could help.  We decided to send an email to people in bluegrass leadership and advocacy positions to ask them to hire a victim and safety advocate for their professional branch,  the International Bluegrass Music Association (IBMA). I suggested that this person could come up with standardized protocols and safety training for events and venue sponsored by the IBMA. I included links to other genres' efforts.  I talked about what had happened to me,  and included screenshots of the threats and harassment I'd received from IBMA members at Rita's behest. I mentioned Daisy Coleman,  and how the kind of community bullying she and I were subjected to drives people to suicide and suicide attempts.  I made certain to use pseudonyms for Rita, Ted, and myself as I didn't want to doxx them or revert too much focus from my request.\n\nA week later,  my brother showed me a post that was tagged with the shop. It was Rita.  She wrote about how I lied about being raped by Ted; that he was kind and gentle with her and her children.  That she'd read the messages he sent me (the ones he said were deleted in her deposition) and they were also kind and gentle. She said I was spiteful and jealous,  and that my actions were mitigating the validity of other sexual assault victims. She then said they'd find the strength to forgive me somehow.  The post ended with a horrid song she'd written. My brother summarized her post as 'an asshole trying to gaslight you.' He also said, 'let's see her write songs saying 'get over it' when he comes home drunk and gives her a black eye or AIDS!'\n\nI talked to a lawyer at this point. I wasn't particularly interested in a lawsuit. I wanted legal conflict resolution.  He said he could take my case,  but that due to Rita's animus,  he doubted she'd want to negotiate civilly.  He said the rape would mean a jury would rule in my favor if it went that far,  but that she'd probably keep appealing.\n\nI didn't feel like spending the time, money,  or emotional energy on those two.\n\nAs a last recourse, Arthur sent Rita a message. He told her he believed me, and that he was proud of all I had done and how far I'd come. He said that 'consent given once is not constant consent. ' He let her know he had read all of the messages himself.  He mentioned seeing me that night,  and how he wanted to take me to the hospital after seeing my neck and how he regretted not forcing me into it.  In light of that,  he asked her to take the post down, and to never contact or harass us,  our families,  our friends,  or any associated businesses ever again. He also specified she should stop using her social capital to catalyze her fans' harassment of us.\n\nShe blocked him and kept the post up.  Ted took it down.\n\nSince that time,  which was the beginning of March,  I've continued to focus on recovery. I've been feeling better but...\n\nIt shatters my heart that my attempts to improve a culture that supports sexual violence have now been weaponized.  I'm afraid other survivors will see Rita's posts and be afraid to speak up.  Arthur thinks their intention was to harass and humiliate me until I killed myself. I think he's right.  Who would want to subject their family and themselves to all that?\n\nI'm such a failure.  I wish I had done more,  and sooner.\n\nI'm disillusioned by the fact that the person who tried to destroy me was another woman.  A woman I tried to help. It devastates me that a community based on love and peace; one that slaps BE KIND stickers everywhere and has social media profiles covered in image macros about empathy viciously attempted to destroy me,  my family, and their business.  All for an alcoholic,  wife abusing,  girlfriend stalking,  date rapist. I feel like I'm living in a black mirror episode,  where everyone calls victims 'psychotic monsters' and elevates violent perpetrators.\n\nI don't regret going to the police.  I just..I don't even know how to think or feel outside of that at the moment.  I'm simultaneously a cipher and overloaded with every emotion out there.\n\nI'm thankful for so much in my life. My partner is fantastic. I have had a lot of support during the healing process. I live in a beautiful, tranquil area. I'm trying to improve and get to the point where I can truly make a change and help others. I really want to start a therapy farm and a therapy music jam. \n\n Still, I struggle every day and I worry I can't escape.",
    "title": "My rapist and his professional bluegrass musician girlfriend are using her social capital to silence me after I went to the police. I feel like I've failed SA victims.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618696412,
    "score": 55,
    "keyword": "woman lawyer"
  },
  {
    "text": "Bully Team Leader (Part III) So...my team leader is a tormenting control freak, and has gone completely off the rails. From day one, would lie during staff/parent conferences about kids we had concerns about 'not giving her any trouble' (they were just as bad in her class, as I saw myself).... add on top of that her constantly emailing admin complaining about me leaving a  plate on my desk or listening to music during lesson planning time....constant moronic complaints that amounted to nothing but me lawyering up when admin started calling me in about them.\n\n&#x200B;\n\nNow, we have a student who bullies special needs kids (stabbed one w/ a pencil, kicked him in the back, and made him afraid to come to school today)....and my AP comes to my room today to tell me this child (bully) is being sent to DAEP, and that I need to attend the meeting since I'm her homeroom teacher, and provide statements from my team members regarding her grades, behavior, and possible future accommodations to meet her needs \\[504\\]. Well, 2 of my team members give me her grades and behavior reports. Team lead? Nope. Replies with a novel length email berating the teachers, and saying that the discipline issues 'aren't student created' (WHAT? Bullying and sexual harassment are through the ROOF this year)...and questioning what WE did to make it this way. This same woman made my girlfriend not want to sub at my campus ever again because she snapped at her as if she was talking to a dog. Barnyard manners....sums up this fraud/wannabe principal. So, at the end of the email, after she relentlessly defended the bully and focused more on the bully's feelings than the victims' mental health....she starts verbally attacking admin, saying that 'a teacher was the one who relayed this information' (when I was told to by AP)...and just went on and on saying it was 'pointless to even reply' because 'they made the decision anyway' (yeah lady, they're your superiors, not the other way around). Narcissist through and through. But, as you'd expect of any educational narcissist, has online degrees and only 4 years experience in a tiny town which she got run out of prior. Go figure. \n\n&#x200B;\n\nThoughts? Do YOU have the misfortune of working w/ a troglodyte like this during the toughest school year ever?",
    "title": "Bully Team Leader (Part III)",
    "subreddit": "Teachers",
    "timestamp": 1634252679,
    "score": 7,
    "keyword": "woman lawyer"
  },
  {
    "text": "Male students harassing female teachers Hi everyone.   \n\n\nThis is going to be the very first post I have ever made. It's long, not sure how to shorten it without leaving out a lot of context. Obligatory \"not a teacher\" and \"English not first language\". But I have found very little on this topic, and would like to ask for some advice, or just insight on if whether or not anyone has ever gone through something similar. So...here it goes.   \n\n\nMy longtime partner in life is a highschool teacher, teaching french in Costa Rica (French is an obligatory 2nd language in most schools over here) at a private school. Over the past 5 years she has received varying degrees of abuse from students, mostly verbal. She's a sweet, but tough person. She doesn't tolerate disrespect in her classroom and sticks to the rules, but is never rude or condescending to her students and really cares about all of them. She will socialize with them and interact with them but makes sure to keep clear boundaries (such as no hugs, no touching her, no sharing of personal details like Facebook, Instagram or any other kind of social media and no pet names), this to avoid any possible misunderstandings that could cost her job and career. You can imagine which ones I am referring to. Anything that could ever point to inappropriate conduct between a young, attractive teacher and students.   \n\n\nAnyways, taking the above into account, she's been having issues with 4 students ever since they started highschool. At first, both the school and her considered they were just kids being kids. They would throw a few insults at her or try to cross the above boundaries during the 1st and 2nd year. In the course of that time, they had various discipline issues, such as bullying other students, causing fights or failing their tests and not doing their tasks and homework.   \n\n\n3rd year starts. 2 of those 4 students molest and harass other female students. Parents threaten the schoolboard that if nothing is done about this, they will take their daughters out of the school. The usual case of \"nude pics\" being passed around and other cases cause 13 students to be transferred. School psychologists decide to implement \"mending procedures\" and \"positive action\" to talk to the students. They deny everything, or say that they feel like the school is harassing THEM instead. The parents of those 2 students back it up, so the school give them the benefit of the doubt and buries the whole thing as a case of over sensitive parents, and teachers (including my partner) not understanding the sensitive minds of young kids.   \n\n\nA few kids continue to leave the school, my partner starts to get catcalled by the 4 culprits, and any kind of disciplinary action against these students turns into a call to the principals office in which my partner is being told that she can't keep noting down her students for being kids. They're just confused and need to be explained nicely, not disciplined. Ok...so she tries that instead. This just evolves into them making fun of her, catcalling her a bit more and insulting her, to the dismay of other students and a few teachers who witness the entire thing. During this whole thing...she still keeps her composure...  \n\n\nPandemic hits, 1 year of rest from those students...and then this year starts...  \n\n\nDuring all of 2021, the same 4 students have so far barked at her on the school yard, followed her into different classrooms (that they are not a part of), interrupted her classes, brazenly insulted her, catcalled her and most recently stepped it up to threatening her, backing her up against walls, showing up behind her and whispering things into her ear and stating that they would find out where we lived if she dared speak up about any of it. They are now 17 years old...  \n\n\nShe has developed severe anxiety, ended up in the hospital due to a mental breakdown and has become increasingly afraid to return to school...  \n\n\nThe school offered psychiatric assistance and offered to open up a case against them. Which she accepted...only for the school to try to convince her to drop it immediately after since they were gonna graduate soon anyways.   \n\n\nThe school is no help, so she tried contacting other outlets, but every \"specialist\" on the matter either say she should feel flattered to have students catcalling her, or that the threats aren't real...they're just kids and she's the adult who should simply ignore them.   \n\n\nIdk what to do to help her. I've told her to quit and I will shoulder the expenses until we are able to find her something else, but she refuses to resign until she has found something else (hard during the pandemic). She feels humiliated, misunderstood and her mental health is in decline. Not a day goes by where she doesn't cry. But doctors and psychologists refuse to assist her...they say she's ok, and basically to get over it. Or just take an ungodly amount of pills to numb her. As a man in today's seemingly \"progressive\" world...I don't understand how no one will give a damn about a female teacher going through this with 17 year old, male students...in one year, they will be legal adults, taking part in the world. Mind you...these are highly privileged students, sons of doctors and lawyers too...  \n\n\nI hope anyone got this far...but if not...\n\n**tl;dr:** Have you, as a woman, ever been harrassed by male students and everyone around you simply played it down? What did you do? And what would you do if it was affecting your health and no one is willing to help?",
    "title": "Male students harassing female teachers",
    "subreddit": "Teachers",
    "timestamp": 1629390508,
    "score": 5,
    "keyword": "woman lawyer"
  },
  {
    "text": "F25) I'm stuck in a miserable dead end job. Please help me decide. Accounting or information systems? Hi everyone, hope you are safe during this crazy covid time... I'm currently working as a paralegal. I was stupid so I studied communication in bachelors degree. My current job is dead end job unless I become a lawyer and I don't think I like law profession at all. I really want to get out of my current job so I'm thinking about doing masters in either accounting and information systems and I can not choose.. both kind of seems like they can lead to what I want to do. Ultimately, I want to be a consultant or project manager.\n\n&#x200B;\n\nAccounting\n\n* pros: stable, clear career path, demand is high\n* cons: tedious like law, i don't like numbers, chances of automation (for low level positions)\n\n&#x200B;\n\nInformation Systems\n\n* pros: future-proof, flexible degree, demand is high\n* cons: flexible so I need to know what exactly I want do focus on, male dominated field (I'm woman so I concern about sexism), not stable as accounting\n\n&#x200B;\n\nThese are pros and cons I can think of. Which one has better future and which one would fit me? I'm interested in obtaining CPA because this seems like valuable license but at the same time, I don't want to do taxes or audit. I want to get into advisory or it audit. If there are any suggestions, please let me know. I Would appreciate advices from someone who knows about these professions/degrees. I have no one to help me. Thank you everyone for reading this long post!! Be safe",
    "title": "F25) I'm stuck in a miserable dead end job. Please help me decide. Accounting or information systems?",
    "subreddit": "careerguidance",
    "timestamp": 1616968859,
    "score": 3,
    "keyword": "woman lawyer"
  },
  {
    "text": "How can I rework my interviews? And how do you avoid bad mental health from constant rejections? Hi, I’m a first generation lawyer and don’t have a lot of people to ask about these things, so I appreciate this online community of support. I graduated from a top 3 law school. I have a resume involving years of humanitarian work and social justice work, civil rights law, and business law. I recently finished a prestigious fellowship to help defend the rights of people in need. Because of the traumatic nature of my work, the life or death nature of my cases, and an abusive boss who left me in shambles, I experienced extreme burnout and had a mental breakdown. I took a couple months to recover and now my recovery looks like having a job to pay the bills with less emotionality. My school told me the {school name} would get me a job anywhere I wanted. But that’s not the case. In fact, people look at me funny when I’m not doing the 2 things people from my school do: go to a big top law firm where you do 2200 billable hours and never sleep or do heavy public interest work where it’s an uphill battle for people in desperate need and you also never sleep. I just want a job that is 9-5 or even 8-6 and is just a job. Not 8am-11pm. Just a job and not my whole identity. It doesn’t have to be law. I’m open to anything. In my interviews, I don’t mention the burnout. But people don’t know how to interpret my resume and their position. They don’t know why I want to be there even though I am genuinely interested in their firm or company and the work. It really sucks. Any ideas on how to transition into a new field without having another mental breakdown from all the rejection? I feel like there’s something wrong with me. and the imposter syndrom being a woman of color in this white man’s legal world is rough. And I don’t know how to prove to employers that I want to be there.",
    "title": "How can I rework my interviews? And how do you avoid bad mental health from constant rejections?",
    "subreddit": "careerguidance",
    "timestamp": 1629979116,
    "score": 3,
    "keyword": "woman lawyer"
  },
  {
    "text": "Is a toxic work environment a good enough reason to leave when everything else is fine? I'm a junior lawyer (not US based) and I've been in my firm's corporate department for 2 years. Basically, I spent one year there as a trainee and another as a lawyer.\n\nSince then, I've been working with a smaller team and, while I'm very fond of the partner (she's not without complaints though, namely how she sees no issues with having me work weekends and on my holidays), the other two lawyers are something.\n\nLet's start with the one I worh the most. He assignes me work and pretty much doesn't tell me how he wants it done or how I should do it. In his point of view, the assignement is mine, it's my problem now. However, when I don't correctly guess what he wants, I'm his punching bag. Back in my trainee days I had to put up with an angry call with the guy screaming how he can't work with someone like me (then don't, I guess?), how the market is going through a rough time and I may find myself without a job, how my colleagues will do better than me (I had to laugh at that, when my colleagues don't have a clue how to do his assignements, it's me they call). As for me, I'm a shy person who does not, under any circumstances, rock the boat. I do my job, keep my head down and as low of a profile as I can, so when he finally called me because I did a poor job because I followed his poor instructions and tore me a new one, I lost my senses. He actually had the audacity of screeching that all he wanted was a good job for once and I couldn't even do that and how much he is under pressure. I lost it and screamed back at him that if he had just taken a minute to tell me what he wanted, none of that would have happened. That maggot went as so far to say that we (trainees and juniors) rat him out to other lawyers, to which I told him that I wasn't the one who did that and didn't appreciate that he called me into it (or better yet, he could treat people decently, if he is so worried about his reputation). To me surprise, our relationship got better after that, he even told me that he loved when I burst into his office to scream at him. In his delusioned mind, it showed that my wallflower self could stand up for herself.\n\nAnd the other one. She's this so-called \"hard ass, take no nonsense\" woman. To be fair, I do have some respect for her but she's a ticking timebomb and it's a coin flip how she's feeling in one particular day. On one occasion she and the other guy gave us a training session and a colleague of mine was giving a presentation. One misused term and she ripped him to shreds in front of every one, telling him how no one likes to work with him, how his work is utter shit and how in trouble he is. Mind you, she could have called him into her office to tell him what she had to say but she had to make a spectacle out of it. Also, we had a colleague who she used to call a \"fucking dumbass\", \"dumb as a rock\" all the time.\n\nWell, I can't stand it. I've had people praise my work and I overwork myself to hell, even though I don't particularly want to. Other people have said I'm an asset and I can't find it in me to care anymore. Don't get me wrong, I really like corporate law, I think it's a fascinating and very fulfilling field and one that is worth my efforts. I just hate my colleagues. To make matters worse, a new trainee came in, this dainty woman who tells everyone and their mothers about her eating disorder and her antidepressants, and they treat her like gold, while forgetting all the work I put in.\n\nSo you could say I don't know what to do. I really like the work itself, I've seen a progression, they've given me more and more responsabilities and, at the moment, everything is fine. But it feels like an abusive relationship, where everything can go down the drain at any second. I kind of want to see what else is out there but I'm afraid of the unknown, of having to prove myself and be the new person in a new place starting from scratch. Is a toxic workplace enough of a reason to tap out and try somewhere else?",
    "title": "Is a toxic work environment a good enough reason to leave when everything else is fine?",
    "subreddit": "careerguidance",
    "timestamp": 1639280820,
    "score": 3,
    "keyword": "woman lawyer"
  },
  {
    "text": "I am so lost but have narrowed my options down to elementary school teacher, speech pathologist, school psychologist, or ultrasound tech. Can anyone give me some insight into any of these fields? I am a 24 year old woman and have a bachelors degree in anthropology (specializing in archaeology), with a minor in economics. I have been working as a legal secretary for the past two years for one of the best lawyers in the country. I have always been pushed towards law school, but I'm now seeing how little I'm actually interested in it. I have taken the LSAT twice and worked in law firms for the past 5 years (all through college). My dad was a lawyer, and I feel like I've been given so many wonderful opportunities to jump into the career, but I'm always told how stressful the work is. \n\nA significant factor in deciding my career path is that I would like to be able to stay home with my kids once I start a family. I currently have no debt from undergrad, and I am very afraid of taking on a lot of debt for a career I may not care for. I'm trying to be rational because I genuinely don't know what I enjoy or what my skills are. \n\nI have been volunteering in elementary schools for the past few years and thought I would love to be a teacher, especially with the schedule, but all of my teacher friends have advised against it. In the next couple of days, I have to decide whether I will take out thousands of dollars in loans to begin a masters in elementary education next month. Big commitment for me. I believe it would only take about a year, with student teaching involved. I have applied for grants and scholarships, so I could potentially get reimbursed later, and the program is not that expensive to begin with. The salary isn't much, especially in my state (SC), but it's a little bit better with a masters degree. It also provides much more time off than a corporate job.\n\nI have looked into speech pathology. A friend of mine just started the program. It would allow me to work in a school setting, but the program is 3 years, and I would take on a lot of debt. I have heard that SLPs can sometimes be on teacher's pay scales. It's in the top 10 list of Forbes best jobs. I also saw someone on here once recommend being a school psychologist. There is a program for that in my city. I have heard that it's a lot of paperwork, but would also allow me the school schedule and I would be making more money (possibly taking on more debt in the process).\n\nMy mom was an ultrasound/x-ray tech and loved it. Of all places, I saw it recommended on TikTok recently. They make a good amount of money, and the schedule seems flexible. The program that my mom attended for this is in a place that I was looking at moving to.\n\nI have also looked into coding/data analysis programs. Working remotely would be a dream for me, as I am pretty introverted. \n\nI know this is all over the place, but any advice/insight would help so much. Most of what I read on here about these particular jobs are negative things, which makes sense because people are more likely to talk about those aspects of their job.",
    "title": "I am so lost but have narrowed my options down to elementary school teacher, speech pathologist, school psychologist, or ultrasound tech. Can anyone give me some insight into any of these fields?",
    "subreddit": "careerguidance",
    "timestamp": 1629400633,
    "score": 2,
    "keyword": "woman lawyer"
  },
  {
    "text": "What if a whole week's worth of employee paychecks you sent out should all bounce? Asking for a friend.\n\n::EDITED TO ADD:: But seriously, I am not the bookkeeper, I am an employee. My paycheck bounced. And now it turns out other employees have reported bouncing paychecks.\n\nMy general sense is I need to just quit with no notice, because it looks like this company is about to go down in flames. But there are OTHER issues here in my situation which I felt the need to ask a professional (or two, or a hundred) about.\n\nAnyone care to hear my sad tale of woe of being stiffed for over $800?\n\n::EDIT #2 on SUNDAY Jan 17, 9:30 AM Eastern Time::\n\nI'm back! I have a long long story to tell. I am going to do a copy-paste of the whole saga in the next couple of minutes right here in the OP. I hope it all fits. Stay Tuned!\n\n::EDIT #3 on SUNDAY Jan 17, 10:40 AM Eastern Time::\n\nGreetings! I am a CNA (certified nursing assistant) and I work for two different HHA agencies (home health aide agencies) here in Massachusetts. AS A LITTLE BACK STORY, I get live checks from this one agency with the bouncy-fun payroll checks, NOT direct deposit only because it's my preference (although, my OTHER employer made us all go to direct deposit this past April, we had no choice). And also, payday is ALWAYS on Fridays (not Thursdays, and instead of weekly paychecks (52 paychecks per year), we get bi-weekly checks (26 paychecks per year). Also, I operate my life on a cash-only basis. I do not have a checking account, I have a savings account instead (it is the only account I have at this time, so that fact right there will hopefully keep this story simple for you to follow, as complicated as it all is). I withdraw the cash every week, keep a super-low balance, and I live my life via the hard cash.\n\n(If you're wondering why I am a cash-only person, it's because I just don't trust banks. And be assured that because I am a CNA I am automatically NOT a criminal because I can't get state certification, nor can I legally obtain ANY job in healthcare, without yet again passing both CORI and SORI every time I apply for a new job.)\n\nMy bank is a small credit union. My employer's bank where they have the payroll accounts is one of those mega-huge investment banks which are \"too big to fail.\" Meanwhile, the bank lobbies are all closed right now due to the pandemic, so the only option when you physically go to the physical bank is the drive-thru. Any really involved banking issues need to be handled by making an appointment ahead of time to meet with someone in the lobby, and you must go through all the screening ahead of time. So as I tell my tale of multiple trips to the bank, imagine me sitting in my car at the speaker thing and the vacuum-tube-cannister thing.\n\nWhat follows is my story of the bounced payroll check saga. Maybe it's a little wordy (a lawyer could probably pare this down by 70% in length), and for that I apologize.\n\n\\---------------\n\nTimeline of events:\n\n\\----\n\nTHUR DEC 31 -- The office was scheduled to be closed on Friday, Jan 1 for the holiday, so they instead issued Thursday checks this one time during that that one week just because of the holiday. Normal payday is a always a Friday. I didn't bother going in to pick up my check that day. It was a busy day for me, and this is only one of my jobs. I have another job with another agency. so I have two sources of income. So I told myself to wait until next week (first week of January) to go and get my check.\n\n\\----\n\nTUE JAN 5 -- I went to the home office of this agency (the one with the bouncy-fun checks) to pick up my (live!) paycheck which had been sitting there since the previous Thursday. Receptionist said to me as she handed me my check: \"Examine your check before you leave. Some of the girls have reported that their checks were short.\" \\[I know it's not politically correct to say \"the girls\" but that's literally the jargon we use in healthcare when referring to the aides.\\]  The supervisor was standing there nodding her head at me. So I opened the check right there, and I discovered that instead of 28 hours for a two-week period, it was just 10 hours. The supervisor wrote down my name and the number 18 for the number of missing hours. She said they would reimburse. \\[SIDE COMMENT: My previous paycheck from 2 weeks earlier was also 10 hours. I am wondering if perhaps this error was someone in payroll --maybe a total newbie-- just did a copy-paste of my prior pay cycle without realizing the folly of that move. Another theory I have is maybe they switched over at the end of the year to a new payroll system, and they tried to carry over all the old data into the new system, and this mirroring of the previous hours was the result of the bulk data transfer. Maybe it's a combination of both of these two theories of mine (a newbie payroll clerk combined with a new payroll system). I don't know, just spit-balling here.\\]\n\nMy check was only $137.95 (should have been well over $300). \\[THIS IS THE CHECK THAT EVENTUALLY BOUNCED!\\]\n\nI left the office, drove to my bank (credit union), and (I am in the drive-thru, mind you NOT inside the bank itself) I did NOT deposit that check into the savings account. Instead I cashed it for the full value, and drove off with the cash. My bank honors all payroll checks and government checks (not personal checks), and will cash them on the spot for you.\n\nMy closing bank balance at the end of the business day (and I do not dispute this balance at all) was:\n\n$68.36\n\nAnd again, I will remind you, this is a savings account, not a checking account, and it's the only account I own right now.\n\n\\----\n\nFRI JAN 8 -- Unbeknownst to me, a special run of new payroll checks got issued on this day for all of us girls whose paychecks of the week before had gotten shorted. This employer does paycheck cycles of 2 weeks (26 paychecks a year) so this was an off-Friday for paychecks. I just didn't know they would print these checks. So I didn't pick it up. It just sat there at the receptionist's desk in the main office for another full week.\n\nMeanwhile my OTHER job, on this same Friday, did a direct deposit of $126.38 in my credit union savings account. I didn't go and withdraw that money from the direct deposit because I was busy that day and didn't need it. I let it sit in the account over the weekend.\n\nMy closing bank balance at the end of the business day (and I do not dispute this balance at all) was:\n\n$194.74.\n\n\\----\n\nMON JAN 11 -- I drove to the post office so I could retrieve the latest mail from my PO Box. And in there I found a late Christmas card from my favorite Auntie with a personal check in it for $50 (she lives 2 counties away from me, so not only is it a personal check, but a way-the-heck-out-of-town check as well). I also found my COVID stimulus check for $600. I drove to the bank (my credit union) and when I got my vehicle up to the speaker-vacuum-tube-cannister thingy of the drive-thru, I did the following transactions:\n\na) withdrew $180.00 cash from that day's balance of $194.74\n\nb) deposited my Auntie's personal check for $50 (couldn't cash it outright because it is a personal check, it HAD to be deposited)\n\nc) cashed the full $600 stimulus check for full value\n\nI pocketed the entire $780 in cash, and went about my business that day. I knew my Auntie's check would be held for another 3 or 4 days, so I just let that go for the time being.\n\nMy closing bank balance at the end of the business day (and I do not dispute this balance at all) was:\n\n$64.74.\n\nAnd the $50 Christmas check was being held by the bank for a few days, so my \"Available Balance\" was listed as being only:\n\n$14.74\n\n\\----\n\nTUE JAN 12\n\nWhile I was busy with life, my bank (a credit union) got the message from my employer's bank (a really huge investment bank) that the payroll check for $137.95 which I had cashed at my bank exactly one week earlier on Tuesday, January 5, was rejected for insufficient funds in my employer's payroll account over at the mega-huge investment bank. All this happened without my knowing about it.\n\nSo on this day, January 12, after my bank/credit union received the bad payroll check back from the mega-huge investment bank, my bank/credit union turned around and raided my bank account to recoup their losses. They also charged my account $7.81 (really strange number!) for a bounced check fee. (I reviewed my account ToS and the standard charge for a bounced check is $7.81. Maybe it's an old bookkeeper's trick to be able to scan down a very lengthy ledger of numbers and find that one odd-ball number in the mix. Idunno, I'm just spit-balling.)\n\nThis generated a letter from the bank to me, letting me know I had a bounced check fee. The letter went to my PO Box, but I still didn't know any of this yet. (I only go to my PO Box every now and again, not every day.)\n\nMeanwhile, by the close of business that day, my account was now registering a negative balance of:\n\n\\- $81.02.\n\n(I also don't go online and check my bank balance every either. Believe me! If I had seen a negative balance in my account at any time, I would have been all over it!)\n\n\\----\n\nFRI JAN 15\n\nA direct deposit from my OTHER employer (the one whose payroll department has their act together) hit my account. It was for $67.79. This reduced the negative balance of my account down to just:\n\n\\- $13.23\n\nand I still knew nothing about this (yet).\n\n(SPECIAL SIDE NOTE -- there is a minimum balance requirement at my credit union of $5.00. So there were actually 2 different versions of the negative balance: the -$13.23, and then an adjusted negative balance of -$18.23, which of course is a difference of exactly $5.00.)\n\nThis same day, I drove to my employer around 3:30 PM to pick up my latest paycheck. They handed me TWO payroll checks. These were, 1) the special reimbursement check from last week which I never knew existed, and then 2) the normal Friday paycheck for the latest 2-week payroll cycle. The special payroll check was $248.32. And my regular payroll check was $415.08. Grand total of $663.40. (MINOR SIDE NOTE: I didn't notice at the time, but this was actually way too much money because I deliberately specify a very high tax withholding on my checks. Someone, somewhere in the payroll department of my bouncy-fun-paycheck employer reset the withholding to a lower amount, and I don't know why. But I can certainly fix that in the upcoming weeks. And so, because of this reset of my withholding, I am AGAIN suspecting that this is possibly a case of a new payroll software being used by my employer.)\n\nI then drove to my bank to cash these two payroll checks. I arrived around 4 PM. As I sat in my car, in the automobile line for the drive-thru, waiting my turn to get my car up to the speaker-vacuum-tube-cannister thingy for the drive thru, I took out my cell phone to glance at my bank account balance, and figure out how much I needed to withdraw after the latest direct deposit from my other employer.\n\nMy phone's screen told me that my account balance was in the negative by just under $20, or\n\n\\- $18.23.\n\nI didn't panic, I was merely puzzled. So I got up to the speaker and the vacuum tube thingy, and I politely asked the teller what was up with my account balance being in the negative.\n\nShe got a look and said: \"You deposited a check that bounced. It was for $137.95.\"\n\nI realized it was my payroll check from 2 weeks earlier that she was referring to. And after another few moments of polite discussion about it, she said \"My manager just told me we can't cash these other two payroll checks that you just now presented to us from that same employer. So we're going to send them back to you \\[via the vacuum tube thingy\\] right now.\" She apologized, I said it was okay. She suggested I try driving to the mega-big investment bank to see if they would honor the two payroll checks for $663.40.\n\nI thanked them for their explanation. Then I drove a few hundred yards away to park, and I called one of my best friends in the world, a wonderful woman I've known for over 20 years, and whose wedding I was in. She's a human resources officer in New York, so she is very well versed in employee payroll disputes and all the legal ramifications as well as the options for what employees can do when their payroll is messed up. (It's so awesome to have friends who work in these kind of specialty fields, and knowing you can call them and ask for advice and guidance. John and Paul were right: \"I get by with a little help from my friends.\")\n\nShe said go back to my employer right now (it was already 4:15 at that point, and the office was closing at 5 PM) and tell them what was going on. She said I should ask them if they would make good on this money by tomorrow (by Saturday, January 16). And if they hesitated in any way to make me whole again by Monday, then I should go to the Department of Labor. I asked her if I should go to the mega-huge investment bank to try and cash these other two checks that got rejected by my credit union just now. She said if I had time, yes. But in her opinion, going to my employer over the bounced check was the priority at this moment. The bounce itself was a legality that carried more weight than the rejection of the other two checks in this particular instance (a distinction with a difference). If I could financially afford to hold off on those other two checks, go to the employer immediately, worry about the other two checks later.\n\nI went back to my employer. I got there by 4:30. I spoke to the receptionist. She said: \"Wow, a lot of other girls here said their paychecks have been bouncing lately!\"\n\nI smiled and secretly thought to myself (Oh my dear God!)\n\n\"Can I talk to someone in payroll?\" I asked (very politely, not a molecule of anger or sarcasm or emotionalism).\n\nThe receptionist called human resources (which is in Connecticut for some reason!) and then after she explained all of this to the HR rep, she handed me the phone. I chatted with HR for about 10 minutes (I kept it very polite, no anger, no snark). HR said they found out several days earlier about the bounced check (their bank called THEM!), but then they were told by their mega-huge investment bank that my check (and I presume other such bounced checks) were eventually cleared. I said no, my bank said it wasn't cleared.\n\nSo then I asked \"How can I get my money for this check? My bank account currently has zero dollars in it. And the bank also refused to accept these other two payroll checks that I only just now picked up today. So I literally have no money.\"\n\nShe said: \"Maybe we can resolve this on Monday. And maybe we can do a direct deposit for you instead of a check. So I will call you back on Monday. Okay?\"\n\n\"When on Monday?\" I asked.\n\n\"In the morning,\" she said.\n\n\"When in the morning?\" I asked.\n\n\"I'll mark my calendar right now,\" she said \"I will call you back at 11:30 on Monday morning.\"\n\n\"I look forward to your call,\" I said. \"Have a good weekend.\"\n\nWe each hung up. I called my friend back. She said \"I forgot to mention: Monday is MLK day. They might not be open.\"\n\n(Awww! Man!)\n\n(And I totally do not like the idea of a direct deposit because of how much I hate direct deposit.)\n\n\\----\n\nSAT JAN 16\n\nSo .... first thing in the morning, I got up super early, gathered as many documents as possible, reviewed them, tried to piece together a timeline, and then I cam here to this message forum and posted this post.\n\nThen I made the following trips (I had to be early because ALL of these destinations were going to close by noon time because that's how Saturdays go. And so I had to squeeze everything into a 3-hour window of time). My mission was to go to three separate banks plus my PO Box. All in one outing. FOUR destinations on a rainy Saturday morning.\n\nFIRST I drove to my credit union, got in line at the drive-thru, and when I got to the speaker, I said, \"I need to make my account whole for now.\" So I deposited $24.00 in cash. This raised up my negative balance from the -$18.23 to a positive number of $10.77 (and $5.00 is the minimum balance, so I really only have access to an \"Available Balance\" of $5.77).\n\nHowever, this deposit (because I waited until Saturday to do it, rather than doing it in the drive-thru yesterday, which I would've if I'd been thinking) won't kick in until Tuesday, January 19, the first business day after the MLK holiday on Monday, January 18. So technically, my account is still in the red.\n\nI also asked them if I could have a printout with formal ledger items on it itemizing the details of each transaction. . They said I should have a letter sitting in my PO Box with the bounced check notice. I said I needed an explanation in writing detailing the $137.95, because that check is nowhere to be found in my account history due to the fact that the check never actually hit my account. I merely cashed it at the window. They accommodated me with printouts of several screen shots of THEIR database which only THEY get to see (very helpful!) showing me the dates and the check number for the bad check, and the dollar amounts of the check and the fee.\n\nSECOND, I drove to ANOTHER credit union about 6 blocks away. I got my car up to the speaker of the drive-thru and asked if I could open an account. The reason I wanted to do this is because if my employer --the one with the bouncy-fun payroll checks-- is going to continue to present difficulties for me with the cashing of paychecks, I want a separate bank account for now, so that my OTHER payroll deposits from my OTHER employer don't get confiscated anymore. This other credit union politely said that the opening of an account on a Saturday during the pandemic is not possible. They said all regular transactions are currently being done only via the internet and the drive-thru, and that the opening of a new account, as well as all other specialty banking services, requires an in-the-lobby meeting with a bank specialist by appointment only, and their bank specialists are not available at all on Saturdays. They said I should come back on the next business day, which will be Tuesday (since Monday is MLK Day, and they will not be open at all). So I made an appointment with them for an in-the-lobby meeting as I was talking with them at the speaker. I will be there first thing Tuesday morning.\n\nTHIRD, I drove to my PO Box. I retrieved from it the letter from my credit union which was auto-generated back on Tuesday, January 12, stating that my account had been subjected to a Return Check Fee of $7.81. They itemized the check (the bad payroll check) and the dollar amount it was for, as well as the check number (a 6-digit number from my employer's business/payroll account). The letter also declared that my account was now in a negative balance.\n\nFOURTH and LAST, I drove to the mega-huge investment bank where my employer has their payroll account. I presented the two payroll checks totaling $663.40, which my credit union said they were not allowed to honor this past Friday. The tellers at the mega-huge bank didn't bat an eye. They cashed them both! Hooray! I now have cash!\n\nThe only drawback here is that they had to charge me two $6.00 fees since I do not have an account with them. So I am now out $12.00 more. (I am going to request that my employer reimburse me that $12.00 in addition to the $7.81.) So instead of $663.40, they gave me $651.40. (I failed to get documentation of this $12 fee. I will need to negotiate this with my employer when they undertake reimbursing me.)\n\nSorry for the long drawn out story. I can come back and keep you all posted on the upcoming developments.\n\n\\-- IB\n\n::EDIT #4 SUNDAY Jan 17, 10:45 AM Eastern Time::\n\nI forgot one detail: it seems that my credit union has placed a 14-day hold on my payroll check --or else it has placed a 14-day hold on the funds for my payroll check. I have come to understand that the bounced payroll check was indeed honored, but my credit union is choosing to withhold the funds from me. (I am a cash-only person, so I'm not an ideal customer. I can only presume that they would treat me better if I maintained a high balance at all times.) Those funds will not be released into my account until January 26, which is exactly 14 calendar days after the January 12 date when they charged me the Returned Check Fee.\n\n&#x200B;",
    "title": "What if a whole week's worth of employee paychecks you sent out should all bounce?",
    "subreddit": "Accounting",
    "timestamp": 1610796408,
    "score": 5,
    "keyword": "woman lawyer"
  },
  {
    "text": "Starting to sense a No Offer I am a rising 3L in the top 15% at a T40 law school. I made law review and scored a seat on the executive board. I compete on the trial team.\n\nI took a firm SA position at a 20 lawyer firm in a small market. It’s been fine. I’ve worked hard to impress, and I’ve turned in top notch work. I’ve heard positive feedback all summer, and I was told I would be getting an offer.\n\nIt’s my last week, and people seem…distant. Work has dried up for me, but not for the other two summer associates. People seem to be avoiding me.\n\nI have some social anxiety that I do my BEST to mask, but maybe it isn’t convincing. I’m also a woman who isn’t conventionally attractive at a firm where the three female attorneys are 8s. \n\nI’m not a looker, and I don’t have sorority-ready social skills. But I am polite and friendly, and I’m whip smart. You need to find a precedent? If it exists, I’ll find it. What’s the legal standard for blah blah blah? Give me a couple of hours, and you’ll have a memo a law professor would be happy to slap an A on. \n\nBut that’s it. All I can do for this firm is do good work. I haven’t missed a day of work all summer. My work ethic is strong. And my work quality is strong. \n\nAdd to all of that, this firm told me during my screener, “When we haven’t extended offers in the past, it could NOT have come as a surprise.” \n\nSo, maybe I am panicking for no good reason. After all, I may still get an offer, and even if I don’t, I have the credentials to do better than a small firm in a small market. I’m here because I like the city, period.\n\nBut, let’s say I am on to something, and they are leaning on passing on giving me an offer. Is there anything I can do in these last few days to change their minds?",
    "title": "Starting to sense a No Offer",
    "subreddit": "LawSchool",
    "timestamp": 1627344636,
    "score": 27,
    "keyword": "woman lawyer"
  },
  {
    "text": "What is the court case/footage where a woman judge screams and throws lawyer out of the court? I saw this court judge outrage moments compilation video recently but can't find it any more, in it there was this female judge vs a male attorney. Don't know how it got started but the attorney told the judge something along the lines of \"watch your mouth\", then the footage cut to judge screaming \"get the hell out of my court\", and then asked some black deputy officer to escort the attorney out and attorney said \"I will make you pay if he dare touches me\" to which judge replied  in a yell, \"I hope (the escort officer name) will beat you to a pulp\" and I think the court laughed.\n\nCan't find the video any more and wonder if anyone know the source.\n\nP.S., the footage as I remember looked kinda old, not sure if it was from an olden time or just bad quality.",
    "title": "What is the court case/footage where a woman judge screams and throws lawyer out of the court?",
    "subreddit": "LawSchool",
    "timestamp": 1636929577,
    "score": 0,
    "keyword": "woman lawyer"
  },
  {
    "text": "Feeling like I suck at law This is going to sound hectic and confusing, but I feel very bad about it and it is starting to hurt my self esteem. No reason to downvote.\n\nI want to know if I am being over dramatic or if law is just not for me. Years ago when I was around 16/17,  I bought a domain name with the intention of selling it to a certain company, so decided to make the domain name the company name. This was before law school. I did not know much about law back then, I was still young. I send them an email with the question if they wanted to buy it. Instead they went to court. I found out later. I never went to court because the company that sold me the domain name was handeling it. Did not have to pay anything, just give the domain name to them. Did not really gave it much thought back then but now think about it and feel stupid. I do want to add that I used a fake name back then (because I was privacy obsessed) and they went with it and it is not on my name. \n\nLater I went to law school. Passed the tests quite easily and understand it pretty well. But when I had to do moot court, I said something stupid. It was a fake case about a foreign woman that was staying in a place that was a pilot for illegal foreigners but the pilot ended after a while and they were supposed to know it. Anyways, I had to argue that she had to move to a different place to stay. When I was speaking, I called her a refugee. When the moot court was over they were quite positive. I was a little stale, but did know my lines blabla. But they said that I called the person a refugee, even though it is still not determined if the woman is a refugee. I should have called her a foreigner. Sorry, I don't really know the precise English terms because it is not my native language. Anyways, they did not make a big deal out of it. Professor continued to say that I was 'very convincing'. But I still feel like such an idiot. Like I worked months on that fake case to make such a stupid mistake. I also knew it, but still said it. Also, we only had moot court one time in my studies and that's why I feel so bad about it.\n\nI don't know if I am being over dramatic, but I just feel like maybe law is not for me. Don't know if it is just my real event OCD triggering me or if I just suck at it. But then again, I did went through classes pretty easily. I just feel down because I don't know if I ever become succesful in law. When I see other lawyers they just seem to know what they are doing. Would appreciate it if you can give your thoughts on it.",
    "title": "Feeling like I suck at law",
    "subreddit": "LawSchool",
    "timestamp": 1619039444,
    "score": 0,
    "keyword": "woman lawyer"
  },
  {
    "text": "What path i should choose I just graduate from law school and still wandering around to find my destination. So i wondering, what kind of lawyer should i be?\n\nI dont wthether i should enroll in corperate or get in civil \n\nI just want to enjoy life and be rich\n\nSo any kind man or woman can enlighten me",
    "title": "What path i should choose",
    "subreddit": "LawSchool",
    "timestamp": 1637077967,
    "score": 0,
    "keyword": "woman lawyer"
  },
  {
    "text": "Is following your passion and dream worth it? Hello everyone :)\n\nI hope you’re all well. I can’t really talk to my family about this properly because the are biased. \n\nI feel like being a black woman, an African woman living in an African country puts so much fear into you. \n\nMy family are all lawyers and believe it’s a respectable profession and naturally I did law too. I finished my first degree this year and I did a really good job. I’m proud of myself.\n\nThe problem is I’m so jaded about law now. It’s all I’ve ever known in my life. I took a leap and did a gap year to pursue fashion, which gets me so excited and giddy and happy. I don’t want to pursue law anymore. They make it seem like the end of the world because they think I’ll be broke and unhappy. I’ve seen the life of a lawyer and while i can do it if I wanted to. I simply do not. I want to wake up everyday excited and happy to problem solve and design and make beautiful things. Is it worth it to follow my dreams with all the uncertainty of if I’ll make it big in fashion or should I just be obedient and become a lawyer?\n\nThank you.",
    "title": "Is following your passion and dream worth it?",
    "subreddit": "blackladies",
    "timestamp": 1639834776,
    "score": 42,
    "keyword": "woman lawyer"
  },
  {
    "text": "PSA: the stable career fields that are considered as staples for Asians once had very few Asians. The reason why I'm writing this is because I am reminded of an [op-ed](https://www.cosmopolitan.com/entertainment/celebs/a36501041/ashley-park-aapi-heritage-month/) by broadway actress Ashley Park. There was this one part that stood out to me: \n> If you’re educated in a traditional profession—like if you’re a doctor or a lawyer—no one can take that away from you. Those jobs have stability. So I can see how it could be so hard for immigrant parents to support their kids who want to go into the arts when they’re looking at TV and stages and don’t see any Asian people there. There’s no way parents can expect that their kids could succeed in that if they don’t see it happening.\n\nOf course, the professions of medicine, law, STEM, etc are considered as safe and stable career choices for Asians. But let me also tell you that at one point in history, that was not the case at all, especially for Asian American women. It took certain people to push and break the barriers. For example, Patsy Mink, former senator from Hawaii, initially wanted to pursue a career in medicine but couldn't due to the discriminations she faced as an Asian woman. So she turned to law instead. Even in that field she faced numerous challenges. But she fought and pushed through. \n\nSo if you ever feel discouraged from going into a certain field because of the lack of representation, don't. I do understand that there are various other reasons why people get discouraged from pursuing a certain career, such as lack of pay and job stability. However bottom line is don't pigeonhole yourself into something which society expects of you. Imagine if Patsy decided to give up just because there weren't anybody like her in her field? She would've never been able to do what she did. Same thing with RBG.",
    "title": "PSA: the stable career fields that are considered as staples for Asians once had very few Asians.",
    "subreddit": "asianamerican",
    "timestamp": 1628875663,
    "score": 58,
    "keyword": "woman lawyer"
  },
  {
    "text": "Pushing Hands (1991): A movie contrasting Confucian tradition with Western Life &#x200B;\n\n[ Sihung Lung as Mr. Chu  and  Deb Snyder as Martha Chu, his daughter-in-law](https://preview.redd.it/y9s3brwjheq61.jpg?width=338&format=pjpg&auto=webp&s=1169587db08c2da3e0924d70663722bd4675816c)\n\nI watched this movie last night on Amazon Prime. The movie starts with Mr. Chu practicing Taiji Quan in the living room while Martha is sitting rigidly at a computer. After the elderly man finished his routines, he set about making lunch for himself. Since there was no plastic wrap, he covered a bowl in aluminum foil and stuck it in the microwave. The first words that are spoken between them are from the woman who hears the crackling discharge as the foil sparked in reaction to being microwaved.\n\nAfter racing to the kitchen, she pulled the bowl out of the microwave, ripped off the foil, and held it up to Mr. Chu. \"NO METAL\" she snapped. \"NO METAL.\"\n\nThere was no reply. \n\nDuring lunch, Mr. Chu ate from the bowl with chopsticks. The woman ate a completely different meal of vegetables with bread. The meal was eaten in complete silence. \n\nIt took me a while to figure out that Mr. Chu was a retired Taiji Quan Master whose son Alex, had saved money for years in order to bring him to the United States. Martha was Alex's wife. The couple had a son, Jeremy who was played by Haan Lee. \n\n[Mr. Chu smokes outdoors while Martha tries to ignore him by reading a book.](https://preview.redd.it/bma6ybkymeq61.jpg?width=1280&format=pjpg&auto=webp&s=815d9969732d76cf00d2b68278457a5c4e26cce1)\n\nThis film is about the clash between eastern and western cultural values. Mr. Chu believes in traditional Confucian virtues. He does not speak English and has no interest in learning. Martha is an American novelist who is suffering from writer's block because she finds her father-in-law's presence in their \"cramped home\" distracting. She wants to move into a larger home which would have an in-law suite that would then allow her some degree of privacy while she writes. Although she has picked up a few words of Chinese, she does not speak enough to communicate with her father-in-law. \n\nAs Chinese Americans Alex and and Jeremy straddle both cultures. As a first generation ABC (American born Chinese), Jeremey attends a Chinese language school in an effort by the parents to keep him in touch with his culture. Alex disagrees with his wife about their \"cramped home\" and tells her that in China 4 families could live in a home of this size. He refuses to move because moving would mean that he would have to accept financial assistance from his mother-in-law. \n\nMr. Chu does not think much of American parenting skills. When  Jeremey asks to be excused from dinner, his mother tells him that he may leave after he finishes his milk. The father-in-law observed to his son that American parents think that all interactions with their children are business transactions that have to be negotiated. When Jeremey turns on the TV to watch cartoons, the old man deplores the senseless violence that his grandson is being exposed to. The translated conversation appears as English subtitles. \n\nWhen Martha asked her husband what the father-in-law had said, Alex tactfully mentioned the cartoons but left out any mention of his father's thoughts about American parenting. \n\nWithout saying more, I will simply observe that the characters have been introduced and the tone of the movie has been set. Will the four of these people be able to coexist in their home? If they are not able to live together, what will happen? \n\n[Mr. Chu uses his Taiji Quan skills to teach at the community center. ](https://preview.redd.it/9ll4polmneq61.jpg?width=688&format=pjpg&auto=webp&s=6327aaf8b15f6a8897b2469e86b477e94536e0b4)\n\nIt was somewhat painful to watch this movie. I'm a sixty year old 3rd generation American and a 1st generation ABC. Watching this movie brought back some bitter sweet memories of visiting my paternal grandparents in California. It also made me think about my relationship with my father. \n\nAlthough my father was the eldest son of his generation, when the time came for someone to take care of his aging parents, he declined to do this. He was employed by the U.S. Public Health Service as a tropical disease specialist and at the time this conversation first came up, he was on TDY (tour of duty) in Bangkok, Thailand. Taking care of his parents would have meant returning stateside to California and possibly ending his career. The responsibility for taking care of the parents fell to his younger brother who was a doctor with the California Public Health Service. \n\nAs with the Chu family in the film, my cousins were raised in a multi-generational home. Since my Uncle's wife was also ethnic Chinese, they were not raised in a biracial home as Jeremey was in the movie. \n\nWhile my grandfather did not practice Taiji Quan, he did meditate. He would sit on the floor in his Tang suit with his limbs cross legged under him and would remain absolutely still with his eyes closed in complete silence. \n\nUnlike Mr. Chu in the movie, my grandfather was a Presbyterian who had been converted to Christianity by American missionaries. My father tells me that when my grandfather caught his wife offering rice to a Buddhist monk,  he seized the monk by his robe and booted him out on the street while yelling in Chinese, \"HALLELUAH, I'M A CHRISTIAN!\" \n\nMy cousins all spoke some Chinese and attended a Chinese language school. They also attended a Chinese American church which offered bilingual sermons. I didn't speak Chinese at all and since my parents wanted me to assimilate into the American culture, they had made the conscious decision to not teach me any Cantonese.\n\nWhile my cousins grew up using chopsticks while eating Chinese food prepared by my grandmother and aunt, I grew up using a fork and a knife to eat American food that my mother made using recipes from a Betty Crocker cookbook. While they ate sticky rice, congee, and bao, I grew up eating spaghetti and meatballs, meatloaf with mashed potatoes, brown gravy, and peas, and pot roast with potatoes, onions, cabbage, and carrots. \n\nMy father has long since deplored the decision to raise me as an American because he thinks that I am much too independent.\n\nIf I were a dutiful son, I would have followed his advice to become a lawyer instead of becoming a teacher. I would have met a woman, married, and given him grandchildren. After he retired, I would have quit my job to move back to California to act as an adult caretaker for my aging parents. I've always wondered about the hypocrisy of this last expectation because my father declined the same request when the time came for him to take care of his parents.",
    "title": "Pushing Hands (1991): A movie contrasting Confucian tradition with Western Life",
    "subreddit": "asianamerican",
    "timestamp": 1617217919,
    "score": 5,
    "keyword": "woman lawyer"
  },
  {
    "text": "I finally have full custody. Stick with it guys, sometimes it does work out. I don't want to write a book here so to summarize my three year old son has been in very serious danger when visiting his mom. I've spent an obscene amount of money and gone to court repeatedly over very serious things my son's mother has done to him including taking him to the hospital high on meth claiming bugs were coming out of his skin as she clawed and pinched his skin to prove it. The courts would not take me seriously and favored the mom repeatedly. Many lawyers and people in the system told me if I was a woman I would have had full custody from the start. I was at my wit's end, a very bad place, didn't know what to do. I would post on this sub and get a lot of support and positive feedback. It really helped level me out. I appreciate you guys. Keep up the good fight. Sometimes it does work out.\n\nEdit: A lot of people are asking what it took. The judge still ruled for 50/50 custody after the meth incident. It took three assault charges, a house fire, a totaled vehicle (all with my son there) three Baker acts, and a shit ton of physical abuse to my son. I fought like hell for a clause in the parenting plan that states if either parent is involuntarily committed, they lose visitation pending an emergency court hearing. The third Baker act (her father committed her) did it.",
    "title": "I finally have full custody. Stick with it guys, sometimes it does work out.",
    "subreddit": "MensRights",
    "timestamp": 1610120680,
    "score": 2327,
    "keyword": "woman lawyer"
  },
  {
    "text": "After a father uses a recording of mom threatening him during custody exchange to defend himself in court, the local Ohio courts reportedly have prohibited the use of recordings from child custody exchanges After a father uses a recording of mom threatening him during custody exchange to defend himself in court, the local Ohio courts reportedly have prohibited the use of recordings from child custody exchanges\n\nSummary: An Ohio woman reports in a closed Facebook group that after her significant other's ex threatened him in front of the children he presented the recording as evidence to protect himself and his children. The court subsequently changed the rules to prohibit recordings of any kind only during child custody exchanges. \n\nI am not a lawyer and this is not legal advice.\n\nDomestic violence in front of a child is child abuse. A professional who willfully refuses to review evidence of child sabuse may be committing a crime.\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n18 U.S. Code § 2258.Failure to report child abuse\n\nhttps://www.law.cornell.edu/uscode/text/18/2258\n\n This rule may have been put in place after a father showed he was a victim, and various court officials were offended that he was capable of using evidence to defend himself.\n\nThis rule may not be lawful and may have been specifically enacted to prevent fathers from being able to defend themselves from domestic violence and their children from child abuse during custody exchanges.\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\n\nPossible failure to \"protection of civil rights\". Failure to \"use of the reasonable and prudent parenting standard\"\n\n42 U.S. Code § 671 \nhttps://www.law.cornell.edu/uscode/text/42/671\n\nPossible failure to respect:\n\n\"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\nTroxel v. Granville, 530 U.S. 57 (2000)\nhttps://supreme.justia.com/cases/federal/us/530/57/\n\nVAWA funded officials must honor nondiscrimination on the basis of gender.\n\nAll victims have equal access:\n\n> \"No person in the United States shall, on the basis of actual or perceived  ...sex..be excluded from participation in, be denied the benefits of, or be subjected to discrimination underany program or activity funded in whole or in part with funds made available under [VAWA]\"\n\n> https://www.justice.gov/sites/default/files/ovw/legacy/2014/06/20/faqs-ngc-vawa.pdf\n\nGiven the totality of circumstances, it seems possible that this rule change is specifically intended to aid moms who commit domestic violence and abuse fathers during custody exchanges. If so, the actions of officials may be possible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nState child support, parenting time, and child protection are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\nHHS Office of Inspector General\nPhone. 1-800-HHS-TIPS (1-800-447-8477)\nhttps://oig.hhs.gov/fraud/report-fraud/contact.asp \n\nHHS Office of Civil Rights \nhttps://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights \n\nThe Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\nhttps://www.justice.gov/crt \n\nAnyone may report federal crimes to the FBI.\n\n(202)324-3000\nhttp://tips.fbi.gov/\n\nTweet with me to seek justice:\n\n> After father uses a recording of mom threatening him during custody exchange to defend himself in court, the local Ohio courts reportedly have prohibited the use of recordings in court. Look  @OIGatHHS @HHSOCR @CivilRights @MikeDeWine @OhioAG #FathersRights https://www.reddit.com/r/MensRights/comments/oa01d3/after_a_father_uses_a_recording_of_mom/\n\nEnd.",
    "title": "After a father uses a recording of mom threatening him during custody exchange to defend himself in court, the local Ohio courts reportedly have prohibited the use of recordings from child custody exchanges",
    "subreddit": "MensRights",
    "timestamp": 1624937221,
    "score": 1848,
    "keyword": "woman lawyer"
  },
  {
    "text": "\"men\" are not taking away womens abortion rights I keep seeing comments that men are taking away abortion rights, men are controlling womens bodies, abortion would be legal if men could get pregnant, etc.\n\nThis is largely ignorance and misandry.\n\n\n**In Alabama not only are the majority of pro-life voters women, but also the legislator that wrote the bill severely restricting abortions and the governor that signed the law that didn't have a vetoproof majority.** All I saw in the press was how \"old white men\" were restricting women's abortion rights. The voters, bill sponsor, and governor bore no responsibility. The blame was put entirely on the male legislators that voted for the bill based on their constituents wishes, but  is that honest?\n\n\nI can't find a direct link to PEWs results anymore, but PEW indicated that in **2014 58% of Alabama adults wanted abortion illegal in all or most cases - 49% of them were men and 51% of them were women**. Plenty of articles still around on the web that cited them. For example...\n\nhttps://eppc.org/publications/democratic-politicians-ignore-pro-life-women/\n\nVoting against what the people want doesn't work in a democracy. It ends your political career. Voting for what the people want gets you personally branded a sexist. Lose lose for the legislators.\n\nThe Texas house bill was also  sponsored by a woman legislator in the house\n\n\"Once that heartbeat is detected, that life is protected,\" said Rep. Shelby Slawson, the House sponsor of the measure said before the bill passed 81-63. \"For far too long, abortion has meant the end of a beating heart.\"\n\nhttps://www.nbcdfw.com/news/politics/texas-politics/bill-to-ban-abortion-after-6-weeks-given-preliminary-approval-by-texas-house/2624812/\n\n**Abortion is not men vs women.  In the US it is rural religious Republicans vs abortion.**\n\nHere are the numbers for people who support abortion in most circumstances for recent years. It is pretty equal with the split being only a few percent on either side. (Note: Men are the green line which is usually showing more support.)\n\nhttps://content.gallup.com/origin/gallupinc/GallupSpaces/Production/Cms/POLL/epzl_ukea0ghgz14q5fsxa.png\n\nVox did a breakdown by gender by country with similar results - \n\nhttps://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion\n\nPEW says in 2019 60% of women and 61% of men say abortion should be legal in most cases. In 2021, women are slightly higher (61%) than men (56%).  It is always pretty close.\n\nhttps://www.pewforum.org/fact-sheet/public-opinion-on-abortion/\n\nThis is not a new trend.\n\nhttps://www.lifenews.com/2013/11/04/polling-data-consistently-shows-women-are-pro-life-on-abortion/\n\n\n\nLet's look at the reproductive rights \"the patriarchy\" that is \"controlling womens bodies\" has given men.\n\nAfter [Hermesmann v Seyer] (https://en.wikipedia.org/wiki/Hermesmann_v._Seyer) set the precedent, courts around the country have decided that male victims of women owe the perpetrators child support for decades, while other precedents (Roe v Wade) and laws (safe haven laws) generally allow female victims many options to get rid of the product of their rapes.\n\n> Hermesmann successfully argued that a woman is entitled to sue the father of her child for child support even if conception occurred as a result of a criminal act committed by the woman.\n\nE.g.\n\nAlabama man - https://law.justia.com/cases/alabama/court-of-appeals-civil/1996/2950025-0.html\n\nArizona boy - https://www.usatoday.com/story/news/nation/2014/09/02/statutory-rape-victim-child-support/14953965/\n\nCalifornia boy - https://www.chicagotribune.com/news/ct-xpm-1996-12-22-9612220045-story.html\n\nOthers in this paper \"Victims with responsibilities\" -https://lawpublications.barry.edu/cgi/viewcontent.cgi?article=1017&context=cflj\n\nThere are many others out there. I do not believe there has yet been a single case where a boy or man has gotten out of paying child support to an adult woman that statutory raped, raped, sperm jacked, etc.\n\nThe good news is that in recent years feminist lobbiests have pushed for laws to prevent rapists from getting child custody. Without custody the child wouldn't be raised by a rapist and the victim wouldn't owe child support. So the day that a male doesn't owe his perpetrator may be coming soon. The less good news is that just over half the states that passed these laws passed them as the feminist lobbiests proposed them - only preventing rapist **fathers** from getting custody. (https://www.ncsl.org/research/human-services/parental-rights-and-sexual-assault.aspx)\n\nTerrell v Torres recently set a precedent and invalidated a signed contract to let a woman use embryos created with her ex and have him owe child support. \n\nhttps://www.azcentral.com/story/news/local/arizona/2019/03/18/arizona-court-ruling-use-preserved-embryos-without-ex-husbands-consent-ruby-torres/3205867002/\n\nCourts have ruled the same way in Illinois and the US supreme court agreed.\n\nhttp://www.fathers4equality-australia.org/fathers-rights/woman-wins-custody-of-embryos-after-separation/\n\nCourts have ruled the same way in a very similar situation in Italy.\n\nhttps://www.ansa.it/canale_saluteebenessere/notizie/lei_lui/vita_di_coppia/2021/02/25/si-allimpianto-dellembrione-dellex-marito-anche-se-lui-dice-no_05230156-95ea-406a-aa7e-4e90cf2d7c93.html\n\nCourts ruled the same way in yet another similar case in Israel.\n\nhttps://he.m.wikipedia.org/wiki/%D7%A4%D7%A8%D7%A9%D7%AA_%D7%A0%D7%97%D7%9E%D7%A0%D7%99\n\nIn several other cases women who forged her ex's signature to implant have been awarded child support from the unwilling father. E.G. https://www.dailymail.co.uk/news/article-5687477/Ex-husband-ordered-pay-child-support-former-wife-forged-signature-undergo-IVF.html\n\n\nReproductive coersion of men is also an issue that would be drastically reduced with financial abortion.\n\n> approximately 10.4% (or an estimated 11.7 million) of men in the United States reported ever having an intimate partner who tried to get pregnant when they did not want to or tried to stop them from using birth control\n\nhttps://en.wikipedia.org/wiki/Reproductive_coercion\n\nAmerican talk shows for women encourage women to stop birth control without telling their partner with the applause of their audiences.\n\nhttps://youtube.com/watch?v=5CNHwhHWPoQ\n\nWhat about IVF with sperm taken from a condom without the man's consent?\n\nhttps://www.mommyish.com/woman-steals-ex-boyfriends-sperm-has-twins-sues-for-child-support-836/\n\nHow about when they only engage in oral sex which should have no pregnancy risk?\n\nhttps://rollingout.com/2014/02/04/woman-uses-sperm-oral-sex-get-pregnant-force-man-pay-child-support/\n\nHow about court orders mandating men give their wife sperm so they can impregnate themselves during divorce proceedings?\n\nhttps://theprint.in/judiciary/court-orders-man-to-donate-sperm-to-estranged-wife-who-says-no-time-for-2nd-marriage/255215/\n\nFinancial abortion would solve all the financial issues for victimized males and remove financial incentives for women to do these things, **but** many pro-choice folks immediately start making pro-life talking points that if he didn't want a kid he should have used a condom or kept it in his pants.  \n\n**Financial abortion is about bodily autonomy.** No out for child support forces a man to spend years of his life working to pay for a child he does not want. If he loses his job and is unable to pay, he will be locked in a cage.\n\n1 in 8 men in South Carolina jails are there for failure to pay child support. They are not given court appointed lawyers until they are $10k behind and most are arrested and lose their job way before that limit making it extremely difficult to pay.\n\nSrc: https://www.nytimes.com/2015/04/20/us/skip-child-support-go-to-jail-lose-job-repeat.html\n\nIn the US,\n\n> 66 percent of all child support not paid by fathers is due to an inability to come up with the money\n\nSrc: https://www.huffpost.com/entry/the-myth-of-the-deadbeat-_b_4745118\n\nMothers owing child support are more likely to not pay fathers than visa versa, but women are rarely jailed for it.\n\n> we found that 32 percent of custodial fathers didn't receive any of the child support that had been awarded to them compared to 25 percent of custodial moms\n\nSrc: https://www.npr.org/2015/03/01/389945311/who-fails-to-pay-child-support-moms-at-a-higher-rate-than-dads\n\n\n\n\nWhat choices do raped men and boys have in the US?\n\n- pay your rapist child support for 18-21 years - probably more than 5 years income that you can't use to better your own life\n\n- spend your adult life in and out of jail for contempt of court meaning you can't hold a meaningful high paying job\n\n- leave the US forever and never enter a country thst enforces international child support or extradition for contempt of court\n\n- ending their lives on their own terms\n\n\nThe Texas thing sucks, but there are still morning after pills, abortion pills, surgical abortion before six weeks in Texas, surgical abortion after six weeks outside Texas, and Texas was the first place in the world to get Safe Haven laws so a woman can abandon their baby and responsibilities at most hospitals and fire stations. Raped men don't have any of those much better options.\n\nSo when you read that these laws are discrimination against women and men have it better, or that pro-life is all about men controlling women's bodies, please speak up. Let the truth be known.",
    "title": "\"men\" are not taking away womens abortion rights",
    "subreddit": "MensRights",
    "timestamp": 1630708506,
    "score": 1234,
    "keyword": "woman lawyer"
  },
  {
    "text": "Just lost my scholarship because of a false harassement accusation This girl I dated for about two months one day stopped answering my messages when in friendship terms after the relationship. Stopped talking for a year and wondered if she was alright because of the pandemic. I sent a couple messages asking her in a span of 2 weeks without answer. Everything from a respectful place and even stated in every message that of she wanted me to stop texting her she should just say it and there would be no problem with it.\nReceived a 'trial' citation because of this incident where she accuses my of her rasing her for year and a half. Also talking about other girls I did the same to. I don't drink, get into fights, I'm not violent and have a really small social circle. Tried to get an exs testimony for my good behavior but she put sorority first, so she could not help me when the problem involved another woman. It's really sad having to realize two of the people you trusted the most just weren't really backing you up. I'm scared to death as this can mean being kicked out of my university. My hearing is tomorrow but I can't sleep or let alone think anything besides all of these. All proof point to a civil behavior towards her.\n\nEdit: Wrote this yesterday, but forgot to update it before publishing it. Just lost my scholarship and this will be in my record for anyone to see. Really afraid of the problems it can cause when looking for a job or a master's degree. My evidence was ignored and my lawyer was asked to leave the hearing.",
    "title": "Just lost my scholarship because of a false harassement accusation",
    "subreddit": "MensRights",
    "timestamp": 1613585488,
    "score": 1136,
    "keyword": "woman lawyer"
  },
  {
    "text": "We now have many more female magistrates than men and the way they were chosen is shameful. In my country, it does not take much to become a magistrate. You have to be a lawyer who has been practising in any field for at least 10 years. The minister of justice then nominates whoever he wants to become a magistrate. \n\n1. Any successful lawyer is not going to accept the post of a magistrate because sucessful (good) lawyers make much more money than magistrates. So we are left with the kind of lawyers who never win a case to make into magistrates.\n2. To impress the European Union and the electorate more women are being chosen to show that the government is pro feminism. Now, about 75% of magistrates are women. \n3. These women magistrates are not assigned complex cases like for example money laundering or murder cases. Instead, they are given cases of 'abuse', family matters, 'hate crimes', sexual harassment, etc.\n\nSince most of the people accused of such crimes are men, we start at a disadvantage. You get a woman to judge whether it is you or another woman who is telling the truth.",
    "title": "We now have many more female magistrates than men and the way they were chosen is shameful.",
    "subreddit": "MensRights",
    "timestamp": 1626813067,
    "score": 364,
    "keyword": "woman lawyer"
  },
  {
    "text": "\"Women are victims of the death penalty to a great extent even when it is mostly men who are tried, sentenced and executed. While men are in prison, it is left to women to hold the family together, to earn a living, perhaps for the first time, to support the children, to organise lawyers...\" [https://www.deathpenaltyproject.org/world-day-against-the-death-penalty-women-and-the-death-penalty/](https://www.deathpenaltyproject.org/world-day-against-the-death-penalty-women-and-the-death-penalty/)\n\n&#x200B;\n\n>Gender-based bias permeates the criminal justice system, manifesting itself in the investigative stage, in the form of law enforcement biases; the trial stage, in which a fair trial may be unavailable for economically disadvantaged and uneducated women; and in sentencing, when women defendants are sentenced to death after being prevented from arguing that gender and patriarchy affected their criminal conduct.  This discrimination can also lead to critical mitigating factors not being considered during arrest and trial, such as being subjected to gender-based violence and abuse.\n\nLet's not even talk about gender and patriarchy affecting criminal conducts. It is simply a way of saying that women should be treated differently for simply being women.\n\nLet's talk about gender based bias in criminal justice system. Yes, there is a biais but this bias is against men and boys :\n\n[Racial, Ethnic, and Gender Disparities in Sentencing: Evidence from the U.S. Federal Courts](https://www.reddit.com/r/MensRights/comments/l417sb/racial_ethnic_and_gender_disparities_in/) :  Males offenders receive substantially longer sentences.  Males are also less likely to get no prison term when that option is available; less likely to receive downward departures ; and more likely to receive upward adjustments and, conditioned on having a downward departure, receive smaller reductions than females.\n\n[The Determinants of Punishment: Deterrence, Incapacitation and Vengeance ](https://www.reddit.com/r/MensRights/comments/l417da/study_the_determinants_of_punishment_deterrence/):  Male offenders receive a 6.2 year longer sentence than female offenders if the victim is female and a 6.9 year longer sentence if the victim is male.\n\n[Help seeking experience of male Intimate Partner Violence victims: Police more likely to jail him than to jail the woman (29.7% vs 20.9%) when he calls them.](https://www.reddit.com/r/MensRights/comments/ljcbet/help_seeking_experience_of_male_ipv_victims/)\n\n[Women in UK cannot be send to prison for non violent offense. Men can.](https://www.gov.uk/government/news/secretary-of-state-launches-dedicated-strategy-to-break-the-cycle-of-female-offending)\n\n&#x200B;\n\n>In countries where the death penalty is a mandatory sentence for murder, such as in Trinidad and Tobago or Ghana, a woman’s prior history as a survivor of physical or sexual abuse is simply irrelevant. The death penalty is automatically imposed for death-eligible offences without consideration of the woman’s background or the circumstances of the crime.\n\nNow background and circumstances. Let's remind everybody that +80% of rough sleepers are male. +70% of suicide are men. Male victims of domestic and sexual abuse are more likely to not be believed, to not be protected and to be punished. Also several decades of studies have shown how male prisoners had on average a far worst live than others. Eg :\n\n[https://pubmed.ncbi.nlm.nih.gov/32533348/](https://pubmed.ncbi.nlm.nih.gov/32533348/) :  Most participants (84.2%) had suffered at least one ACE and 45.5% had suffered ≥4 ACEs. Prevalence of lifetime mental illness diagnosis, self-harm (lifetime and lifetime in prison) or suicide attempt (lifetime and lifetime in prison), and current low mental wellbeing increased with exposure to ACEs.\n\n&#x200B;\n\n>Women are victims of the death penalty to a great extent even when it is mostly men who are tried, sentenced and executed.   While men are in prison, it is left to women to hold the family together, to earn a living, perhaps for the first time, to support the children, to organise lawyers and support, to travel sometimes great distances at great difficulty to visit their husbands, partners, sons and fathers in prison.   It is not a comment on the treatment of women when they are charged, but an important and often overlooked component of the criminal systems and the death penalty everywhere. Women are left to pick up the pieces and try to recreate lives for their families.\n\nClassic, we can't let men being talked about without making it about women. It will not go well with the narrative that women are most affected when most executed victims are men if they did not try to parasite conversation about men.\n\n&#x200B;\n\n>In order to tackle the problems that exist, I believe we need to implement the following steps: repeal provisions that allow for the mandatory imposition of the death penalty, which do not allow judges to consider the circumstances of the offence or of the defendant at sentencing; acknowledge the compounding forms of violence suffered by girls and women – including gender based violence and early and forced marriage; ensure the training of all those involved investigation, representation and prosecution of crimes involving women; ensure that all those facing the death penalty have access to free and effective legal counsel – specialised in capital representation and trained to recognise and bring forward claims of gender-specific defences; increase the number of women involved in decision-making positions within legal systems, including judges, prosecutors, and court administrators, and develop and implement programmes to prevent gender-based violence and discrimination.\n\n&#x200B;\n\n1. Make a problem a women's issues\n2. Argue that the solution is to give women privileges and power and push them into high positions.\n3. Use those newly gained positions to push even more feminim and expand toward other institutions.\n\nEdit: I truly believe that nothing will get changed if men don't start to act and advocate as men like women do. If not, we will have men fighting for people while women will fight for women. Men working for things to be better for everybody. Women fighting to get women privileges and superior care. In this example, women will fight against death penalty against women only while men will fight against death penalty itself.  This is history reppeating itself. Women fought for non prison sentences for lesser female criminals. Women fought for domestic and sexual abuse laws only for female victims. Women fought for food distribution in disaster zones to be given for women and girls. When given occasion to talk in newspaper, TV or in Parliament/Government, women will explicitly isolate and focus on women. Time for men to be tribal.",
    "title": "\"Women are victims of the death penalty to a great extent even when it is mostly men who are tried, sentenced and executed. While men are in prison, it is left to women to hold the family together, to earn a living, perhaps for the first time, to support the children, to organise lawyers...\"",
    "subreddit": "MensRights",
    "timestamp": 1640700469,
    "score": 303,
    "keyword": "woman lawyer"
  },
  {
    "text": "Welcome to Brazil, where sexist laws are passed I'm going to say something funny in Brazil. The entity responsible for statistics on domestic violence requires that only cases of violence against children, the elderly, and women be reported by the police stations. This makes it appear that women are the main victims of domestic violence. Now it gets thicker, men are in the lead with a lot of space ahead of women in terms of general violence. So statistically they are the ones who suffer the most from domestic violence, but here we will never really know, as the person responsible for this information creates a \"favorable\" environment for women. \n\nAnd how can not stop there. Here, due to sexist laws, a man who ends up in the ICU is less serious than a woman who is slapped. Here the penalty for a crime committed by a woman is lesser just for being a woman, and a crime committed against a woman has aggravations.\n\nAnd as if all this is not enough, in 2021 a law that opens a huge loophole for anything to become a crime against women was approved. In direct translation: \nLaw 14188 of 2021 also includes in the Penal Code the crime of psychological violence against women, to be attributed to those who cause emotional harm \"that harms and disturbs their full development or that seeks to degrade or control their actions, behaviors, beliefs and decisions ”.\nA fews days after this law, news came out of lawyers wanting to use this law because the boyfriend broke up with the girl. And as all this is not enough. \n\nNow they are trying to pass a new law, in which it decriminalizes false accusations of rape, something that has happened a lot here in the last few years, and in 99% of cases when the farce is found the woman is not penalized.",
    "title": "Welcome to Brazil, where sexist laws are passed",
    "subreddit": "MensRights",
    "timestamp": 1631872547,
    "score": 211,
    "keyword": "woman lawyer"
  },
  {
    "text": "Michigan father reports he is a victim of domestic violence and describes circumstances with the mother which endanger his child. Legal expenses are bankrupting him. \"I just want to be a father to my son\" A Michigan father in a private Facebook group writes about a the mother of his child and his ex wife who has made false allegations against him, has allegedly killed his animals, spied on him, stalked him, beat him, stabbed him, stolen from him, neglected his child due to alcoholism, and generally endangered his child. Legal expenses are bankrupting him. He concludes \"I just want to be a father to my son\"\n\nHere is my reply, in hopes that it may help others who seek justice:\n\nI am not a lawyer and this is not legal advice.\n\nSeems you are alleging you have been discriminated against on the basis of your sex as a victim of domestic violence.\n\nFirst I would maintain excellent documentation. I would attempt to use witnesses. I would consider if I should record all interactions.\n\nAll victims have equal access:\n\n> \"No person in the United States shall, on the basis of actual or perceived  ...sex..be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity funded in whole or in part with funds made available under [VAWA]\"\n\n> https://www.justice.gov/sites/default/files/ovw/legacy/2014/06/20/faqs-ngc-vawa.pdf\n\nIf I were you I would consider a protective order including supervised drop offs at your abuser's expense. \n\nI would also consider a lawsuit against the agencies involved for:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nI might consider a lawsuit against my abuser and her co-conspirators for intentional infliction of emotional distress.\n\nhttps://www.law.cornell.edu/wex/intentional_infliction_of_emotional_distress\n\n> To constitute depraved indifference, the defendant's conduct must be 'so wanton, so deficient in a moral sense of concern, so lacking in regard for the life or lives of others, and so blameworthy as to warrant the same criminal liability as that which the law imposes upon a person who intentionally causes a crime. \n\n> https://definitions.uslegal.com/d/depraved-indifference/\n\nI would recall everything I told the professionals involved in my case regarding my child and the threats to my child by my ex. Ignoring child endangerment because the perp is a woman may be a crime:\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n> 18 U.S. Code § 2258.Failure to report child abuse\n\n> https://www.law.cornell.edu/uscode/text/18/2258\n\nThis could amount to  a de-facto conspiracy to kidnap, because the secret goal of the professionals is to maintain mom as the primary caregiver, regardless of dangers to the child. As such, the conspiracy of silence regarding those dangers may amount to a conspiracy to deny dad primary custody, and may be a conspiracy to kidnap, which may be racketeering:\n\n> (1)“racketeering activity” means (A) any act or threat involving murder, kidnapping, gambling, arson, robbery, bribery, extortion, dealing in obscene matter, or dealing in a controlled substance or listed chemical (as defined in section 102 of the Controlled Substances Act), which is chargeable under State law and punishable by imprisonment for more than one year;\n\n> 18 U.S. Code § 1961.Definitions\n\n> https://www.law.cornell.edu/uscode/text/18/1961\n\nA conspiracy to maintain mom's custody while the child is endangered may be a conspiracy against the child's civil rights to safety:\n\n> safety, sanitation, and protection of civil rights\n\n> https://www.law.cornell.edu/uscode/text/42/671\n\nAny conspiracy against the civil rights of the child or father in which any official collects any money or allows child support to flow to mom from dad as a result of the conspiracy may be a conspiracy to defraud the United States, which funds child support and other activities through Title IV-D and Title IV-E:\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\nState child support, parenting time, and child protection are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\nHHS Office of Inspector General\nPhone. 1-800-HHS-TIPS (1-800-447-8477)\nhttps://oig.hhs.gov/fraud/report-fraud/contact.asp \n\nHHS Office of Civil Rights \nhttps://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights \n\nThe Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\nhttps://www.justice.gov/crt \n\nAnyone may report federal crimes to the FBI.\n\n(202)324-3000\nhttp://tips.fbi.gov/\n\nTweet with me to seek justice:\n\n> Michigan father reports he is a victim of domestic violence & describes circumstances with the mother endangering his child \"I just want to be a father to my son\" @MIAttyGen @GovWhitmer @MichStatePolice @OIGatHHS @HHSOCR @POTUS @CivilRights #FathersRights https://www.reddit.com/r/MensRights/comments/pvbiwq/michigan_father_reports_he_is_a_victim_of/\n\nEnd.",
    "title": "Michigan father reports he is a victim of domestic violence and describes circumstances with the mother which endanger his child. Legal expenses are bankrupting him. \"I just want to be a father to my son\"",
    "subreddit": "MensRights",
    "timestamp": 1632591083,
    "score": 192,
    "keyword": "woman lawyer"
  },
  {
    "text": "Falsely Accused - My Story Hey Everyone\n\nThis is a throwaway account because I do not want any of this in any way shape or form coming back to me, its a horrible nightmare I want to forget but I feel its important to share. \n\nI like to think that I am a good person and never in a million years could I ever see myself going through something like this. I am in my early thirties and run a small successful company consisting of roughly 20 employees. I started it myself and I always go out of my way to make sure that everyone working for me is happy, and they all are! I have worked for so many assholes and douchebags so I made sure that everyone who works for me is respected and feels heard. The place is relaxed, fun and most of all, stress free! I have male and female employees and everyone gets along. This all began when we were hiring for a new entry level position and had a current employee (I'm gonna make a fake name and call her Ashley) recommend a friend of hers. Normally I would not hire someone based on a friendship but I went against my better judgement and told her to have her friend come in for an interview. \n\nThis girl came in for the Interview (For the sake of this story, we are going to call her SCUM), Late, No resume, and reeking of pot! I smoke more weed than anyone I fucking know, but I wouldn't show up to a job interview smelling like I showered in bong water! She had a resume that was longer then the lord of the rings trilogy and everything about me said red flag with this train wreck. I do not want to go into more detail, I could, But I won't. Ashley asked me how it had gone and I told her pretty much what I just wrote above. I could tell from the look on her face that she was not surprised, but she then proceeded to \\*Pretty much beg me\\* to give her friend the job. She explained how she had a really rough childhood, and just got out of a messy relationship, and that no one gives her a chance, and on and on and on. I would have said no to any other person, But this woman had worked for me since I began the company, she had done a lot of work for me and handled things in my absence tons of times when I was away or off sick, she was someone I trusted! The position we were hiring for was on its best day a glorified receptionist, all the person had to do was answer phones and reply to emails, so I agreed. That was the BIGGEST mistake I had ever made!\n\nAfter just a week, EVERYONE HATED SCUM! She was rude, Ignorant, Abrasive, Confrontational, The entire mood of the work space was different having her there, it was like everyone was walking on eggshells. I had half the team ask me to get rid of her and I wanted her gone to, But I held out because Ashley asked me to give her at least one more week. It was the longest week of my life, I can not explain to you how much I HATED SCUM! When the time came to let her go, I did it with a calm and professional demeanor. When Scum arrived I asked her into the meeting room where Myself and another employee spoke with her. We let her know politely that it was not a good fit, and we were probably just going to leave the position vacant as we were not that busy, (a lie but we wanted to let her down easily). I have NEVER in all my life seen a more ugly exit! She began to cry and scream so loud that her words were not even comprehensible. She was screaming about men, and the patriarchy, and how people needed to die. She began throwing things from peoples work spaces, running around like a madwoman! No one put their hands on her but we had to corner her to force her out of the office, like a wild animal, and on the way out she kicked in and smashed our front door and a big glass window! It was crazy! The police were called and we all gave reports on what had happened. That day I let everyone off early and we all went out to go get drinks on me! (this was a bit over three years ago and pre-the virus)\n\nThat night, we all drank, Joked around, and laughed about how CRAZY Scum was. That was when we named her too! Ashley was coincidentally not here on the day of her firing! It all should have been over right then and there... But it was not.\n\nLife went on as normal for the next few weeks until one night, around 7pm, I got a knock at my front door. I opened to two police offers, a man and a woman. I am not a bad person and have NEVER broken a crime in my life! I have no police record! So having two police show up at my door randomly was quite the shock. I asked how I could help them and they asked If I was ... .... and I said yes, that's me. The male police officer took a step forward and told me i was under arrest for sexual assault. I was absolutely shocked, dumbfounded. The female police officer could see the look on my face and she actually said to me, and I quote \"I'm very sorry\"\n\nI was in absolute panic! I explained to them that I had NEVER done such a thing and it had to be a mistake, but they told me they couldn't speak to me or give me details until we got to the police station, I wanted to scream! I started to have a bit of a panic attack and I think the officers could tell, I asked if they could just let me get in the car and not be handcuffed but they explained that wasn't an option, and again, they both apologized, they were very good police officers and quite understanding. The female officer convinced her partner for them to handcuff me with my hands in my front, and they let me put a jacket over my hands so that too my neighbors and such it would look like I was carrying some stuff and just going with them for a ride. \n\nI felt like I was going to throw up, The entire ride I kept telling myself, they had to have the wrong person, this had to be some sort of mistake. When I arrived at the police station I found out it was not a joke. They informed me that Scum was charging me with three counts of forced sexual assault. Scum was claiming that I forcibly drugged her and entered her on three different occasions and also, just for fun on top of all that, Threatened her with death if she ever told anyone, Fun right? I was IN SHOCK! My first reaction was to begin laughing hysterically which to the police officers view probably looked like I was insane! They began asking me questions but I am a smart man and had more than enough movies and t.v shows to know that to do in this situation. \n\n\"I'd like to speak to a lawyer\" I said before hanging my head, this was a NIGHTMARE!\n\nLike I said earlier, I am a good person, I have never broken any serious laws and never been in trouble with the police. I run a company but we are small, we don't have lawyers. The police connected me with some public council at 3am and the conversation was short. He told me. SAY NOTHING! NOTHING AT ALL, EVEN IF YOUR INNOCENT! NOTHING! I thanked him and then he probably went back to bed. \n\nWhere I live, In Canada, this was my first experience with the courts, and it was a shit show! Scum had ZERO EVIDENCE, Just her word against mine! and the courts took that and ran with it, They were trying to put me in prison for 35 years! For the next few days I did not eat or sleep, I felt sick and I wanted to die! I wanted to go find Scum and strangle her and then end myself because I did not see a way out of this! \n\nI connected with a Lawyer who I did not have enough money to pay, I had to take out a loan just to get a consultation. I run my own company but I put everything I make back into it to help it grow, You need to make sacrifices and I keep just enough to live and barely enjoy myself. I explained to him that I was a good person, That I had 20 EMPLOYEES WHO COULD BACK ME UP, They could give character references, I explained how the times she said I was doing these things I was not even at the office! I was at home! I told him how I have had TONS OF GIRLFRIENDS, And I even spoke to a few exs about the situation and they said they would come to court and speak on my behalf saying this was ridiculous and not in my character! My lawyer just shook his head, he could see how desperate I was but he explained that the courts and odds were against me on this. He explained to me how, The victims now, do not need anything even remotely close to evidence. They only need a good story. He told he that everything I had mentioned are not things that can hold up in court, and that they have to go off her story, that's it. \n\nThe lawyer I worked with was also great just like the cops who had originally picked me up. He explained to me that this was not a game we play in court, calling in surprise witnesses and shit like that, my expectations were way off lol. He explained that it is more like a formula, we follow it and plug in the proper things in the right places and hopefully, the truth will prevail. He told me to go home, go back to work, Live my life like normal and that he would take care of everything. It was hard, going back to normal when I was thinking about my life ending, going to prison, spending all my time in a cell, worst of all for a crime I did not even commit. One thing I am thankful for is that NO ONE in the office believe the accusations Scum had made, Not a single person. Ashley cried apologizing and I was angry but I made sure not to show it, It was my fault for hiring the trainwreck and I couldn't blame her for a mistake I made. \n\nThis went on for THREE YEARS! Because of the Virus my lawyer was able to keep delaying things but the courts were aggressively trying to get me in so they could convict and put me away. Three years of court date adjustments, three years of meetings with my lawyer, Three years of hell. The only reason I am not in prison right now is because my Lawyer was able to get ahold of Scums police record and it was just as long as her resume! Not only has she had run ins with the police every other week, But she has accused more then 10 other men of this same crime! I do not know any of these other men, but I can only assume they wronged her in some way and she did this to get revenge, Like she did to me for firing her! My lawyer had a meeting at the court house and then let me know the charges had all been dropped. \n\nThree years, $30,000 in lawyer bills, and an indescribable amount of stress, but I am free. \n\nDuring these three years, I found the MGTOW community and the RP. I had my eyes opened. The amount of suffering, Stress, and pain I went through is hard to even describe. I had to fight for my life. And Scum... She gets to live her life, No punishment for making a false accusation, She gets to go on and more than likely do this to more men. Yet women everywhere complain how we live in a culture of rape, and to believe all women, These things make me wanna scream! I feel like I am taking crazy pills! \\*Insert Mugatu Gif here\\* The way men are shit on now is honestly a joke, and the saddest part is that the larger majority of women after hearing my story would probably still think I'm guilty! \n\nThe one thing I can count as a win, is that during these three years, My company took off. I began making over 20k a month, and easily paid off all my lawyer bills. My life changed during this time and for the better, Because now I have the RP and I am much more aware to what's going on around me. I try to introduce all my male friends to what I have learned but so many men are so deeply ingrained into the feminist agenda that they can't or are not willing to let go! It's this sort of male submissiveness that let people like Scum continue to hurt more people! But what is there we can do? The politicians are against us, The media is against us, Schools are against us, Hell even other men are against us. Men are truly an endangered species! \n\nI am going to stop here because If I keep going I am going to begin ranting and rambling. If you are currently going through a False Accusation. Here are my tips.\n\n1 - DO NOT TALK TO POLICE! Be polite, But your only words should be \"No Comment\"\n\n2 - GET A LAWYER! I am sure you are smart, I am smart, but guess what, WERE ALL FUCKING DUMB... Get a lawyer! You can't do this yourself. \n\n3 - Talk to your friends, you will find out who your real friends are REALLY QUICK lol!\n\nFeel free to message me on this account privately if you need advice, I will check it from time to time! I hope you are all doing well, And Good Luck Guys!",
    "title": "Falsely Accused - My Story",
    "subreddit": "MensRights",
    "timestamp": 1629860678,
    "score": 166,
    "keyword": "woman lawyer"
  },
  {
    "text": "Two years of fighting are over (long) In March of 2019 I told my live-in girlfriend of 4 years to get her own place nearby, because the dynamic of our relationship had increasingly become a therapist/patient one, with me being the therapist. She was 100% dependant on me with literally everything. I was her Google, her mentor, her coach, her atm, her provider, her security, but not her lover anymore.\n\nShe agreed to move out for a year to learn to function on her own for a while. Her new place is about 150 metres away, literally around the corner. She still stayed at my/our place most of the time, did her laundry here, ate, slept and showered.\n\nFast forward to May 2019. On May 23rd she came over with two massive bags of dirty laundry. No big deal. Problem is, this was a break up visit. So she broke up and still expected me to do her laundry. That's when I lost it. The lion, the witch and the audacity of this bitch. It got loud, she stormed off, I went after her with her laundry and told her that there was no way I would wash her clothes. She starts screaming bloody murder in the hallway. I back up immediately in case a neighbour came to her aid. She calms herself, grabs her bags and leaves. At that point I'm in absolute shock. She still has my coffee maker, headphones, 2 cats and a bunch of other shit at her place. Oh and she still owed me a little over ten grand in rent. I think to myself, let's burn that bridge when we get to it, and calm myself with a cigarette.\n\nThree days later, the doorbell rings. Three police officers, armed to the teeth, tell me to come with them, because my ex filed several reports earlier that day, including continued use of violence over the past four years, stalking, death threats and imprisonment. So I went with them, which is where the nightmare began. She apparently showed bruises on her arms (between us: she didn't bruise her own face because she's a coward. Bruised arms are easy and can be covered for work). I was looking at actual prison time. I gave my side of the story, showed her last text message she sent me the week prior, in which she essentially describes me as a super hero. Two of the officers then inform me that they always believe the woman in cases of domestic violence. Great.\n\nSo I lawyered up. Put down four grand. A week later, our version of the DMV tells me that Ms. X apparently told the cops that I was unstable and dangerous, so they would like me to turn in my drivers licence, as I am clearly not fit to operate heavy machinery. What the fuck. My lawyer tells me to ignore it, they have no right to do that. A week after that, I get a letter from the police saying that somehow they connected me to organised crime, I have to come in to get my fingerprints on file. Again I am told to ignore it, they have no right. A week later, Ms. X files a restraining order, and takes me to court. Finally a break, as the judge doesn't believe a word she says, but we sign a document saying we won't go near each other. Fine by me.\n\nSeptember 2019, 3 am. Ms. X rings my doorbell, I go outside to talk to her, while recording the conversation. She tells me I scare her, she cries and reeks of booze. I tell her to go away and to never come near me again. It's all on tape. Needless to say she has no reason to be scared of me, this is all in her head or maybe she was recording too in hopes of catching me in the act. She tries to push my buttons and fails. I don't know what she was expecting to be honest. \n\nNovember 2019. Case dismissed by the DA.\n\nAnd for the past year and a half I've been fighting to get my money, my belongings and my cats back, and I won everything except for the cats, although that ship hasn't sailed completely. There's still a glimmer of hope. She acted like a child in court and almost got thrown out of the room twice. It was great. And now it's finally over, I have my things and she has to pay installments every month.\n\nWhat an absolute shit show, and to think I had proposed to this lunatic. I honestly did not see any of this coming. What a little cunt, all MY friends of 35 years sided with her, no one even asked me about it.\n\nGuys. GUYS. Be very careful. I mean it, there are books out there teaching women how to destroy men. It's becoming a pandemic. Don't be an atm, don't be Google, don't let them use you.",
    "title": "Two years of fighting are over (long)",
    "subreddit": "MensRights",
    "timestamp": 1622990671,
    "score": 128,
    "keyword": "woman lawyer"
  },
  {
    "text": "A UK/United Kingdom father reported that he only sees his son through a visitation center, after his son hugged him mom who was outside the room began shouting and then physically yanked her son out of visitation A UK/United Kingdom father reported that he only sees his son through a visitation center, after his son hugged him mom who was outside the room began shouting and then physically yanked her son out of visitation\n\nThe following is my response, reproduced here in the hope that it may help another father who is seeking justice and a positive relationship with his child or children:\n\nI am not a lawyer and this is not legal advice.\n\nI think you are alleging parental alienation and emotional abuse a form of domestic violence:\n\n> The new definition of domestic violence and abuse now states:\n> Any incident or pattern of incidents of controlling, coercive or threatening behaviour,  violence or abuse between those aged 16 or over who are or have been intimate partners or family members regardless of gender or sexuality. This can encompass but is not limited to the following types of abuse:\n\n> psychological\n> physical \n> sexual\n> financial\n> emotional\n\n> https://www.gov.uk/government/news/new-definition-of-domestic-violence\n\nYou may also believe a woman in your position would never be treated so poorly by the contact center as to have the father of her child rush in and snatch the child from her arms. This may be discriminatory:\n\n> Services provided by a public authority - taking legal action about discrimination\n\n> The law which says you mustn’t be discriminated against is called the Equality Act 2010. Discrimination which is against the Equality Act is unlawful.\n\n> If you’ve experienced unlawful discrimination by a public authority, like the police or local authority, you may be able to take legal action under the Equality Act.\n\n> https://www.citizensadvice.org.uk/consumer/discrimination-in-the-provision-of-goods-and-services/discrimination-in-the-provision-of-goods-and-services1/discrimination-in-services-provided-by-a-public-authority/services-provided-by-a-public-authority-taking-legal-action-about-discrimination/\n\nI would probably not file a complaint though, because you are able to see your child, but I might express my sadness at how my child is suffering  from witnessing mom's domestic violence in the contact center, and how I wish they would treat me and my child in the same manner as I know they would if I were a woman the other parent were a man.\n\nI would consider applying to modify child custody:\n\n> Apply for a court order\n> Follow these steps to apply for a court order.\n\n> Read guidance CB001 on making an application.\n\n> Fill in the C100 court form. You must show you’ve attended a meeting about mediation first - except in certain cases (there’s been domestic abuse, for example).\n\n> Send the original form and 3 copies of it to the nearest court that deals with cases involving children.\n\n> https://www.gov.uk/looking-after-children-divorce/apply-for-court-order\n\nEmergency complaint:\n\n> What evidence will I need to present at an emergency child custody hearing?\n> In order for an emergency custody order to be obtain one the parent making the application must present evidence and the need for emergency. A parent must typically show that the child faces “immediate harm.”  It is therefore important to note and write down the events that lead you to believe your child is in risk of harm. If you gathered this through a conversation with your child or the other parent then write this down, and collect any emails, notes or photographs which may be of assistance.\n\n> This evidence will be useful for both the emergency custody hearing as well as any subsequent hearings if you would like to apply for full custody.\n\n> https://www.kabirfamilylaw.co.uk/emergency-child-custody-orders/\n\nI would ask social workers when I could have my child away from my abuser and how long they intend to allow my child and myself to suffer as a consequence of her abusive behaviors.\n\nIf I am punished by being denied time with my child, I might consider a complaint due to the sexism of the contac center.\n\n> Please note, if your complaint is about a social worker you need to complete the online concern form instead. Raising a concern about a social worker means giving us information about something a social worker did, or information about the social worker themselves. \n\n> Raise a concern about a social worker\n\n> https://www.socialworkengland.org.uk/about/contact-us/feedback-and-complaints/\n\nIf I felt that reports to the court were factually inaccurate, I would consider filing a criminal complaint:\n\n> Perjury Act 1911\n\n> Perjury.\n> (1)If any person lawfully sworn as a witness or as an interpreter in a judicial proceeding wilfully makes a statement material in that proceeding, which he knows to be false or does not believe to be true, he shall be guilty of perjury\n\n> https://www.legislation.gov.uk/ukpga/Geo5/1-2/6",
    "title": "A UK/United Kingdom father reported that he only sees his son through a visitation center, after his son hugged him mom who was outside the room began shouting and then physically yanked her son out of visitation",
    "subreddit": "MensRights",
    "timestamp": 1634410667,
    "score": 100,
    "keyword": "woman lawyer"
  },
  {
    "text": "JK Rowling helped me realize I was a woman and not just a transgender woman I'm a amab transgender woman. My whole life growing up in rural town I  had to fight the transphobia of society, my peers, and most of all myself. Some people say trans people make a choice when they transition. The choice for me was be miserable but safe, or be happy with danger. This isn't a choice anyone should ever have to make.\n\nAnyways after finally beginning my transition after years of denial I find myself drawn into a political war I want no part of. I am forced to fight for my own validation for being myself. Some want to use me to increase their influence, others want to exclude me scared of my own potential influence I may one day possess. \n\nAnyways the whole JK Rowling had been bothering me a lot lately.  I always liked the books when I was little, so I guess part of me  wants to be accepted by her. Yet another part of me felt something more important could be gleaned looking at it.\n\nWhy would a multimillionaire author against the advice of all her publishers, lawyers, advisors campaign so admentally claim that transwomen are not women? I don't know why she has such phobia to include fellow sisters whom are transgender into the category of 'women' but I could tell based on the massive twitter scuffle that occurred that this concept of 'woman' is extremely important to a lot of people. Before I had taken it for granted but since our concept of gender influences public policy which has real impact to people's lives I was forced to reassess my view on what being female meant to me.\n\nEven though I completely disagree with her I can atleast agree with her on the point that no one can tell another person what being a man or woman means to them. FYI Jo  that includes trans people too. If a trans person says their a certain gender you have to respect it in the same way you would expect others to respect your idea of gender. \n\nWhile I haven't accepted my female identity for very long this is what I have come up with so far as for what it means to me. For me being a woman has nothing to do with birth circumstances. To me being a woman is about having a loving heart. A heart that connects with all the people in her life, a heart that bleeds for other suffering whom are not in it. She loves her loved ones so much that sometimes she forgets to send a tiny bit of all that love she has to herself. She may be breathtakingly beautiful on the outside but her true beauty will always lie on the inside, her inner glow.\n\nThis is the aspect of being  woman for me that feels most defining. This the part of myself that I find most sacred now. Never again will I take this identity as female for granted. I want everyone to know that the only person who has to validate you is yourself. No matter what adjectives are used to describe a woman be it straight, lesbian, tall, short, young, old, cis, or trans. At the end of the day they are all women, and what that means to each of us is different for everyone. Know what this is for you and never let anyone convince its wrong because only you gets decide it.",
    "title": "JK Rowling helped me realize I was a woman and not just a transgender woman",
    "subreddit": "Feminism",
    "timestamp": 1621646156,
    "score": 7,
    "keyword": "woman lawyer"
  }
]