[
  {
    "text": "My employer stole from me So there's been a big push in my line of work for increased productivity lately. The regional VPs have really been focusing on that. Just this past week and also this week, myself and 5 of my coworkers have noticed time missing from out labor log in an attempt to artificially make it look like we're more productive than we actually are. And in some of our labor logs we're able to see who amended our time....it was our regional VP. And she did it just prior to our payroll closeout. And with that closeout complete, individual employees are unable to amend their time if a discrepancy is noted.  \n\n\nFor these managerial positions they're able to receive bonuses if their territory goes above and beyond in terms of productivity, so she had quite a few reasons to steal from myself and others. We've all taken screen shots of our altered labor log. None of use consented to this(why the fuck would we?) and nothing that I've signed in the last 3 years(including my offer letter) included anything about docking my pay or time for ANY reason whatsoever. I've been in this field for nearly 12 years and this is the first time I've ever dealt with this. Even just one hour per week through the duration of a whole year adds up to thousands of dollars missing from my paycheck. The amount of hours I work also affects how much PTO I accrue per pay period. So it's kind of a double whammy.  \n\n\nOf course I want this woman to be fired, to no longer work under her, and to get my money back(and then some to be honest)....but at the same time I don't think I can trust the leadership of this company any longer regardless if we get the outcome we want. And maybe I feel like being petty and sticking it to all the higher ups. I don't have much faith in modern HR departments as I think they're only trying to protect the company from the employees and not the other way around as it should be. So should I go to the department of labor? Contact a lawyer to get a lawsuit going? This is not a situation I know how to navigate but clearly something immoral, unethical, and illegal has taken place.  \n\n\n**TLDR**:  \nCaught a higher up in the company shaving time off mine and coworkers paychecks. What do? Contact HR to get her fired(hopefully) or Department of Labor/Litigation Attorney to burn the place to the ground?",
    "title": "My employer stole from me",
    "subreddit": "jobs",
    "timestamp": 1683855561,
    "score": 1,
    "keyword": "woman lawyer"
  },
  {
    "text": "\"Ghosted after X years of relationship\" Just read a post on a dating sub where a man complains that his gf of X years ghosted him. So many men in the comments that say the same happened to them. Wife moved out while he was at work, gf visited parents and fell off the face if the earth, etc.pp. All the other men in the  comments commiserating how shitty it is to end a relationship like this, how the women are cowards, etc.pp.\n\nI did that too. Moved out while he was on a business trip. Kept my new address secret. Communicated only through a lawyer. Y'all know why? Because he fucking threatened to KILL ME if I leave him.\n\nYes there are probably shitty women who just ghost their great, caring and respectful partner. More likely though that in the majority of these cases there has been some abuse going on.\n\nWomen aren't cowards. Men are dangerous.\n\n**Edit** \n\nTo all the men in the comments who took offense with the last statement: I know it's \"not all men\". But let's not pretend domestic violence is not a gendered thing. Yes, I know there are abusive women too. But where I come from, every 3 days a woman is killed by a man she has a relationship with. Recently there was a survey where 30 percent of the male respondents said it's ok to hit their female partner sometimes. And when your first reflex upon hearing this and reading all the heartbreaking stories by women in the comments is not being horrified, but becoming defensive and spouting whataboutism, you're absolutely part of the problem.",
    "title": "\"Ghosted after X years of relationship\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687624789,
    "score": 15566,
    "keyword": "woman lawyer"
  },
  {
    "text": "My husband pled guilty after raping me Back Story:\n\nWe were separated, he'd been sexually assaulting me for years and I had finally filed gotten the courage to file for divorce. He kept making excuses for why he could not hold up his end of our custody agreement. I'd just started a new job and did not have daycare lined up yet. The agreement was for him to stay for 4 days to watch over the kids while I worked for that first week.\n\nI hadn't been assaulted by him in a while, he seemed to have excepted the divorce, he had a new partner from what I understood, and I thought I was safe again.\n\nThe assault:\n\nOn 09/12/2019 (the last of the 4 days he was staying, I was taking him home in the morning) I went to sleep after coming home from work (evening shift nursing so around midnight). I woke up twice in the middle of the night because I could feel what he was doing. I turned my head to look at him and he immediately stopped. He had been masturbating and penetrating me with his fingers. I was still too weak to move my body and dozed off again. The second time I woke up he had immediately started again. This time I was awake enough to move my body. I. Kicked. The. FUCK. Out of him. I kicked him hard enough that he fell from the bed and hit the floor. But while I was kicking him, I felt myself hitting a smaller body. He had our 3 year old (unpotty-trained) son laying naked next to him while he did this.\n\nI don't remember if I slept again. I know that in the morning I sent him a message to confront him. I knew if I went downstairs to confront him face to face, I would kill him. He apologized and said he never meant to hurt me and he just didn't want a divorce. He always said this after he assaulted me. It was like he had a script in his mind of what to say to make me let it go. I got up. I put on something, I don't remember what I wore this morning. I marched downstairs, past him, grabbed my keys, went to the police station and told on him.\n\nReporting:\n\nThe first officer to greet me listened to my story and said \"Okay.......he's your HUSBAND.\" As if that should have excused it. I don't know what it was about the way that I looked at him but he immediately went and got the detective they had who specialized in sex crimes. HE listened to me and took the report seriously. They let me write it out in detail. He asked me what I wanted to happen. He told me what the next steps were. I asked that they made him go to therapy. I knew that he likely did these things to me because he was violated the same way throughout his childhood. I knew he was a first time offender and jail was not likely so I wanted to make sure he was rehabilitated in SOME way.\n\nHe found the police report paper as soon as I got back (I'm sure someone who knew him saw the car parked at the police station after I went and told him). He ran from the officers for 10 days and then went in to talk to them and tell them that he did it because \"it was his kink\". They'd already filed charges and put out a warrant the day before, so they booked him 09/23/2019. He stayed there until March of 2020 when he was released on house arrest. This was when quarantine began.\n\nThe courts were closed until 2022 and then they continued. Lots of stalling over these years from his lawyer. Even a no call no show from his lawyer. They offered him a couple f reasonable plea deals. He came back with one for misdemeanor assault. We said no. I did not want it to look like this was not a sex crime. That was really important to me. No deal was reached. They marched on to trial. It was set for earlier this year. In the weeks leading up to trial, things were looking shaky. I was advised that cases like mine were extra hard because many people this men should be able to brutalize their wives. But I stuck it out. If I didn't fight for me, I knew I could not live with myself. No matter the result. About 4 days before the first day of trial, the prosecuting attorney and victim advocate (amazing women who were my only support through this process. I hope life is extra sweet to them for the rest of their days) called to tell me he agreed to plead guilty to misdemeanor domestic assault and 2 years of probation on the sex offender case load. A PO who works with sex offenders and sex offender therapy. No hand guns. And although it was not a rape conviction, it was him admitting to harming me on purpose, which felt great.\n\n&#x200B;\n\nI wanted to share this because, in the months leading up to trial, I **SCOURED** this reddit. Looking for someone with a story like mine. Looking at stories from women who had won their case. Looking at stories from women whose abusers got away with it. I wanted to be prepared for it all. So, I hope that any other woman going through this can find this story as well. If a woman like me is reading this, I just want you to know that it is not okay for a person to violate you, **no matter what** their role in your life is. It was hard, but every moment of freedom after stepping into that police station was worth it. Every night that I got to sleep and not wake up to him touching me. Learning how to stay inside of my body again. Learning how to say \"NO\" and set boundaries without fear. Seeing myself start to smile and laugh again. Finding my personality again. Seeing our kids change now that they do not have to witness abuse anymore.\n\nThere is SO much good life to live outside of abuse.\n\n&#x200B;\n\n\\[Editing to add more information\\]\n\nI did not expect so many people to see this. Thank you all for your kind words and support. After I reported him I ended up moving to where he could not find us. I was facing heavy harassment from his family and it was the victim advocate and detective who suggested moving for safety.\n\nNo contact with him since 2019. Our kids have been doing great. A lot of you asked how the son who was assaulted is doing. He is neurodivergent so it is hard to really discuss this with him. However, he has become a very happy and creative kiddo. Always laughing and singing and dancing. He is very protective of other people and hates to see others be hurt or picked on. My daughter who is the eldest is old enough to communicate for herself and I have asked her if her dad ever did anything inappropriate to her. She says no but she has also asked not to see him outside of occasional visits and even then she asked for no in person contact at all.\n\nSeeing this post reach women who have experienced the same has been a healing experience in itself.",
    "title": "My husband pled guilty after raping me",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1682146697,
    "score": 9509,
    "keyword": "woman lawyer"
  },
  {
    "text": "He plead guilty! 5 years ago I pressed charges against the man who drugged and raped me. I was overdosed and nearly died. He got a really good lawyer who pushed everything back as far as possible, then Covid hit which delayed things for almost two years. He was ready to go to trial because he didn't want jail time, but once we were up next and about ready to select a jury he got cold feet and decided to negotiate. \n\nWe worked out a plea agreement which included a suspended year of jail time and a 30 year criminal order of protection. If he gets arrested for any reason he will have to serve that year of time. The order of protection bars him from a firearm license, federal employment, and shows up on the most basic of background checks. They cannot be expunged and lying about having one against you in certain situations can land you 5 years in jail.\n\nFor whatever reason he decided to bring his parents to the sentencing hearing. I had spent hundreds of hours working on my victim impact statement which detailed the grittiest details of the incident. So for a half hour his mom and dad sat there listening to how their son drugged and raped a woman, then watch him plead guilty.\n\nHe was sentenced before the weekend and served with the order of protection. It's officially over. I should be happy and proud of myself but I don't feel that way, and I don't know why. Maybe it just hasn't set in yet. Once I get the copy of all the paperwork on the mail maybe that's when it will hit me.\n\nBut no matter what I feel, HE PLEAD GUILTY. The five years was worth the wait.",
    "title": "He plead guilty!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1675019545,
    "score": 6209,
    "keyword": "woman lawyer"
  },
  {
    "text": "The prosecutors of Andrew Tate leaked to the Romanian press a number of transcripts of wiretapped conversations held among the victims, the Tates and the 2 women arrested. The transcripts contain admissions of criminality, manipulation, violent threats and more corroborating victim testimony It has become the most common talking point among Tate's supporters, and even his own lawyer, to say that there is actually zero proof of any of the allegations made against the Tates. It has been widely known in Romania for a week now that this is simply not the case, since the prosecution has leaked a number of snippets from wiretapped transcripts they obtained during their investigation.\n\nThese transcripts were used, along with the victim statements, expert psychological reports of the victims and Andrew Tate's own words published to social media in public videos to convince the Judge that there is at least a reasonable suspicion that the defendants committed the crimes of human trafficking and forming an organised crime group, while the judge asked for more evidence of the rape accusation (it is notoriously difficult to prove rape, especially if said rape happened a long time ago).\n\nOne of the defence strategies Tate's lawyer used was to say that Tate was simply playing a character, or persona, in his videos so the videos shouldn't be used as evidence. However, the judge disagreed with this defence as the wiretapped transcripts obtained by prosecutors showed Tate with the same attitude and personality in private messages between himself and the victims and others.\n\nI will layout all of the transcripts that have been leaked so far along with the sources for each transcript, they have been translated from Romanian using Google translate.\n\n**TRANSCRIPT 1: Andrew Tate manipulates one of the victims into flying to Romania by promising marriage, then discusses said victim as a commodity to be used for making money.**\n\nSource: [https://spynews.ro/monden/showbiz-intern/stenogramele-incendiare-dintre-andrew-tate-si-o-victima-cum-o-vrajea-prin-metoda-loverboy-vei-fi-a-mea-pentru-totdeauna-297133.html](https://spynews.ro/monden/showbiz-intern/stenogramele-incendiare-dintre-andrew-tate-si-o-victima-cum-o-vrajea-prin-metoda-loverboy-vei-fi-a-mea-pentru-totdeauna-297133.html)\n\n**Conversation 1 (promise of marriage):**\n\nEmory (Andrew Tate): You have to understand that once you're mine, you'll be mine forever. A woman never leaves her man. I will be the last man in your life.\n\nEmory: what do we do if we fall in love and I kidnap you to bring you to Bucharest?\n\nGirl: I don't think it's kidnapping, if I want to come.\n\nEmory: first I have to see in your eyes that you will never be able to live without me. And then I can trust you to show you everything\n\nGirl: Bring a ring with you when you come 😊\n\nEmory: Can you be loving enough to be a wife? To always be by my side, wherever I go? Talk to 0 men besides me? Ride or die? 😊\n\nEmory: you have to move to Romania with me, to keep an eye on you.Emory: You're mine. Do not forget that. And act like it. We will be together soon.\n\nGirl: but can I trust you?\n\nEmory: Yes. You can.\n\nEmory: You will move to Romania with me. I plan when I get there. First, I might have to go to Prague for a few days.\n\nEmory: and we meet in Romania.\n\nEmory: and I want to know that you are committedEmory: Serious about marriage.\n\nGirl: Yes. I am serious.\n\n**Conversation 2 (discussion of victim as a commodity, PI in this context is one of the women who was arrested along with Tate):**\n\nANDREW TATE: Did you tell the new one that you make a lot of money?\n\nANDREW TATE: ask her to take pictures of you\n\nPI: yes.\n\nPI: you mean me and her in the pictures?\n\nANDREW TATE: yes\n\nPI: what kind of pictures?\n\nANDREW TATE: anything for onlyfans\n\nPI: in underwear? She won't\n\nANDREW TATE: see\n\nPI: G talked to her today and will go live with B tonight to try\n\nANDREW TATE: And with Tristan's new girl you're doing a really good job\n\nANDREW TATE: Tristan wants you to bring her back and stay there\n\nANDREW TATE: I'm taking care of B and U tomorrow, we have to be alone and find a solution to to stay\".PI:. does she know about onlyfans?\n\nTRISTAN TATE: no\n\nTRISTAN TATE: and she's studying to be a lawyer, she doesn't care\n\nTRISTAN TATE: and she never would\n\nPI:. know. She asked me to show her my TikTok and I wasn't sure.\n\n**TRANSCRIPT 2: Supports the prosecutions case that Andrew Tate is the leader of the organised criminal group and there is a hierarchy with Andrew Tate at the top**\n\nSource: [https://www.gandul.ro/actualitate/cum-le-amenintau-andrew-tristan-tate-fetele-exploatate-studioul-videochat-tunari-este-ultimul-avertisment-exclusiv-19903663](https://www.gandul.ro/actualitate/cum-le-amenintau-andrew-tristan-tate-fetele-exploatate-studioul-videochat-tunari-este-ultimul-avertisment-exclusiv-19903663)\n\n**Conversation 1:**\n\nGirl: I heard you're the one running the OnlyFans and TikTok girls business.\n\nAndrew Tate: Tristan and Georgiana are there, but I lead them\n\n**Conversation 2 (Radu Luana to one of the victims demanding money and saying that the victim is accountable to her, she is accountable to Tristan and Tristan is accountable to Andrew, the hierarchy of the criminal group is demonstrated):**\n\nRadu Luana: The money from yesterday, 3 dollars\n\nRadu Luana: Give me something, I'm foaming at the mouth\n\nRadu Luana: That at the end of the month Andrew will argue with Tristan Tate, Tristan Tate with me and I with you\n\n**Conversation 3 (Andrew tells the victim not to leave the house without one of the 3 trusted employees (Tristan, and the 2 \"angels\" arrested) following and watching her, making a clear threat despite the victim pleading that she wants to leave the house alone:**\n\nAndrew Tate: You don't go anywhere without one of the three (trusted employee nos).\n\nYoung woman: Why are you so cold to me?\n\nAndrew Tate: Don't go out alone without telling me.\n\nAndrew Tate: Mall, supermarket, nowhere from now on.\n\nYoung woman: I told you I wanted to go alone\n\nAndrew Tate: It's the last warning!\n\n**TRANSCRIPT 3: Andrew Tate admits to victim that he \"has to hide\" what he is really doing and that he does money laundering, exploiting women by using them to do illegal activities for him such as moving money and illegal items/documents, he also claims \"he would never do that\" to the victim, presumably another form of manipulation to make the victim feel \"special\" and that he \"cares\" about her:**\n\nSource: [https://www.digi24.ro/stiri/actualitate/stenograme-din-dosarul-fratilor-tate-facute-publice-cei-doi-si-ar-fi-obligat-victimele-sa-isi-tatueze-numele-lor-2207105](https://www.digi24.ro/stiri/actualitate/stenograme-din-dosarul-fratilor-tate-facute-publice-cei-doi-si-ar-fi-obligat-victimele-sa-isi-tatueze-numele-lor-2207105)\n\nAndrew Tate : You're not stupid and you can probably guess how I make so much money. I have to hide what I'm really doing.\n\nVictim : Web cam?\n\nAndrew Tate : I've been doing this for a long time with a team of girls working on video chat. The company was fake, but this is how I laundered my dirty money. Some of the girls who worked for me (...) I used them to do other things. To move money or illegal things, documents, etc. I will never do that with you.\n\n&#x200B;\n\n**TRANSCRIPT 4: Tate's \"angels\", the 2 women arrested along with Tate, make violent threats including death threats to one of the victims saying that if she does not post pornographic content to Onlyfans/Tiktok she will be \"thrown off the balcony\" by Andrew Tate.**\n\nSource: [https://www.romaniatv.net/noi-stenograme-incendiare-din-dosarul-fratilor-tate-daca-se-uita-andrew-sa-vada-daca-ai-postat-tiktokuri-nu-vei-avea-timp-nici-sa-iti-faci-bagajul-zbori-de-la-balcon-direct\\_7137791.html](https://www.romaniatv.net/noi-stenograme-incendiare-din-dosarul-fratilor-tate-daca-se-uita-andrew-sa-vada-daca-ai-postat-tiktokuri-nu-vei-avea-timp-nici-sa-iti-faci-bagajul-zbori-de-la-balcon-direct_7137791.html)\n\n&#x200B;\n\nIn these conversations R.L is the policewoman arrested alongside the Tate brothers, NG is the other woman who was Tristan Tate's personal assistant who was also arrested, and PI is the victim in question\n\n**Conversation 1:**\n\nRL: You are free tonight to sleep. Do not waste time!\n\nR. L: So that you can be rested tomorrow, Saturday.\n\nR. L: And Sunday for the weekend.\n\nNG: So clearly there is no longer the problem of recovery.\n\nPI: You mean?\n\nPI: But I didn't say I'm not going in today at all.\n\nNG: Well, how much did you have to recover so far?\n\nNG: I. Don't lie to me, because you didn't do anything today.\n\nANDREW TATE: Did you tell the new hooker that you make a lot of money?\n\n&#x200B;\n\n**Conversation 2:**\n\nR. L: You see we split on Only\n\nR. L: G. takes O.R. L: I take you.\n\nR. L: Maybe you're not listening, because I will kill you\n\nR. L: If we don't make money.\n\nNG: Punch yourself in the mouth until I arrive, because then I'll give you another 10, you incurable slacker.\n\nNG: I break you when I get there.\n\nPI: What did I do?\n\nNG: You have one hour and 10 minutes to disappear.\n\nPI: But what did I do??\n\nNG: Better said, what did you do yesterday for an hour.\n\nNG: You're 20% down, four days since you posted.\n\nR. L: I'm waiting for the money yesterday.\n\nNG: Well, if Andrew looks to see if you've posted TikToks, you won't even have time to pack, you're flying off the balcony straight away.",
    "title": "The prosecutors of Andrew Tate leaked to the Romanian press a number of transcripts of wiretapped conversations held among the victims, the Tates and the 2 women arrested. The transcripts contain admissions of criminality, manipulation, violent threats and more corroborating victim testimony",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1673398429,
    "score": 5832,
    "keyword": "woman lawyer"
  },
  {
    "text": "My ex made my kids watch an anti abortion video without telling me. I’m so livid right now. My ex husband is very Baptist. I am very agnostic. I just picked up my 7 year old Daugher from school and on the drive home she described a gory anti abortion video that her dad made her and her sister watch last night in graphic detail. She said it was all about how the woman regretted her abortion and triumphed over planet parenthood when she had another baby. I just... What? Why is it okay for him to make them watch that?\n\nWhat are age appropriate resources I can share with my daughters to show them planned parenthood is not the devil, and that abortions happen for lots of reasons, and those reasons are none of other people's business but a personal choice each pregnant person makes on their own.\n\nUpdate: The video was Unplanned, which is rated R. I'm calling her physician tomorrow to request a referral for a therapist because I've been looking for one for months now and can't get her in anywhere\n hopefully a direct referral will move us ahead. I'm also considering reaching out to a family lawyer to see if I have any grounds to increase my custody from 50/50 to...more than 50/50. It also looks like going forward we are very  busy until the afternoon every other Sunday.",
    "title": "My ex made my kids watch an anti abortion video without telling me.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1683143334,
    "score": 2227,
    "keyword": "woman lawyer"
  },
  {
    "text": "My soon to be ex-husband acts like he owns me because we have a child together and no one is taking me seriously, not even the police CW: stalking behavior\n\nDisclaimer: I am ***not*** asking for relationship advice because there is no relationship here, and it's against the sub rules. I'm just ranting about the unfortunately common experience of being a woman and not being taken seriously regarding my own safety.\n\n\n\nI started dating this dude when I was freshly 18 and he was 21 turning 22. I got knocked up. My Catholic family shamed me a ton for it so when he suggested eloping, I was on board. We got married and then I found out it was because his mother, a very strict Christian, convinced him to do it. We worked it out, moved on. MIL was heavily interfering and in October of last year I decided I was done.I moved out and attended a few sessions of counseling with him and then I started the divorce proceedings because he didn't seem like he wanted to cut the umbilical cord still attaching him and his mother.\n\nOur divorce is moving at a snails pace because of him being late with forms, not attending meetings etc. During the time he has bought himself by being an idiot, he's been stalking me. Before I filed for divorce in late November, I hardly saw him out in public by chance. Suddenly when divorce is filed, I'm seeing him **everywhere**. Stores, work, near my home and even outside my doctor's office. In January, I confronted him because I saw his car drive by my house twice in an hour, his response? \"I'm allowed to keep an eye on my son's mom\". He's even paid for my shopping when he 'runs into' me at the store and he'll tell the cashier that I'm his wife. I was at a cafe in their dedicated study space trying to get some college work done and I had bought a coffee that I wasn't done with, when the barista brings me another coffee and says 'your husband bought it for you'. I look around, he's not in the store. He's sitting in his car outside and he has the audacity to wave at me. One day, I was out getting coffee with a male friend, when I got home, my ex was outside in his car waiting for me and he kept asking me who my friend was. He doesn't even deny that he's following me.\n\nI've been documenting whenever I run into him by taking pictures and he knows and doesn't care. I try my best to be discreet but the few times he caught me, he **posed** for the photo. I told my family and friends and they think it's alright because I haven't been threatened. My own father who paid for my divorce lawyer actually told me to sympathize with my ex because 'he's losing his family'. My mom thinks it's sweet that he pays for my shopping or sends things to my house. I was celebrating my 20th birthday last weekend with some friends at home and guess who shows up? My ex, with a bouquet of red roses and a necklace and he shows me a tattoo he got of our son's name and he tries to convince me to get a matching on. He also says that he plans to get **my** name tattooed.\n\nHis brother who's the only decent member of his family convinces me to call the cops. An officer comes to my home on Monday, and I get told off like a child. He says things like 'you should be grateful he cares so much' and 'you're much better off than some other ladies I've spoken to'. He ends the meeting by saying that he won't punish a man for 'missing his family'. I live in a small conservative town so I'm not surprised but I'm still upset. I can't move because of my college and I'm terrified.\n\nI know he's not being threatening and I'm much luckier than some other women, but he could escalate. He's completely different from the man I fell in love with and I'm terrified and no one is taking me seriously. Everyone keeps calling me his wife and referring to me and our baby as 'his family' which yes my son is, but I'm not anymore. It seems the days of women being the property of their husbands have never left us. Why are we only listened to when we've been attacked? If the police took me seriously enough even to have a conversation with him, they could be preventing a much worse crime from taking place. I don't see why I should have to become a victim before I'm listened to and it's so frustrating. Has anyone else had an experience like this? I don't want to be alone in this.",
    "title": "My soon to be ex-husband acts like he owns me because we have a child together and no one is taking me seriously, not even the police",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678322501,
    "score": 892,
    "keyword": "woman lawyer"
  },
  {
    "text": "I'm fighting for Abortion Rights for all of us Hello,\nMy name is Carmen Broesder, and I'm a resident of Nampa, Idaho. I spent the majority of December enduring massive pain, hemorrhage, cramps, contractions, and periods of blacking out because of government regulations surrounding women’s health care.\n\nAfter 8 days, on my 3rd ER visit, I finally received minimal but life-saving care for my miscarriage. However, I still spent 11 more days bleeding and praying for my life, because doctor’s hands were tied by draconian legislation.\n\nIn total, I bled for 19 days. It took 25 more days to get confirmation that the heartbreaking miscarriage was finally over. My health crisis that began on 12/ 8 wasn’t over until the new year.\nI tried to speak to the legislators who are supposed to represent me. I started researching and found a plethora of similar legal problems and decided to ask for help. My representatives have stated openly that they won't listen to me. Rather, they mock me and repeatedly block me, thereby violating my First Amendment rights.\n\nIdahoans are under attack by our Republican representatives. They are using their personal and religious agendas to hurt their people.\nWe are fighting back, but we need help.\n\nWe need a lawyer willing to fight this government overreach on a national level because abortion regulations have been implemented that shouldn't exist. The three-fold increase in maternal death is a clear indication that this is a war on pregnant people. The current slew of abortion regulations do not only impact families seeking abortion, rather they negatively impact every aspect of reproductive healthcare. \n\nMiscarriage management, birth control options, and infertility care are all being eviscerated as a result of the government’s intrusion into personal medical decisions. Forced pregnancy not only violates international law, not only violates the separation of church and state, but also risks women’s lives. Pregnancy is the most dangerous time in most women’s lives- every pregnancy puts a woman’s life at risk.\n\nWe need a lawyer to coordinate with the ACLU, for our rights to bodily autonomy and our constitutional rights as citizens and human beings...\n\n\n Given my recent experience with an inhumanly managed miscarriage, I have the standing to challenge the religious fundamentalists who run Idaho in Federal Court. My plan is for my legal counsel to work with the ACLU, for additional support. Roe V Wade has been overturned, it’s time for Broesder V Idaho.\n\nThank you all so much. This is all new to me. I appreciate your kindness and support.\n\nCarmenbroesder.com",
    "title": "I'm fighting for Abortion Rights for all of us",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678088486,
    "score": 871,
    "keyword": "woman lawyer"
  },
  {
    "text": "Is it weird that I want a baby pre-nup situation before getting married? Before I begin - let me preface with this. \n\nThis is not a reflection of my fiancee or our relationship. This is not me not trusting him, or picking the wrong guy. I think it's madness that we sign ourselves into marriage, destroy our bodies for children, and if our husband leaves - we're left holding the kids with very few prospects for ourselves and very little by way of support. Why is this not commonplace?\n\n&#x200B;\n\n**My biggest fear in life is being a poor single mother.** \n\nI know, like every other single-mother-wonder-woman out there, I would do what needs to be done. Lay down my life, work extra shifts, get sh\\*t done. However, I don't want to and don't feel like I should have to - if it were to come to that. \n\nI'm getting married next year and realized I don't fear divorce. Yes, it would be hard, heartbreaking, sad, etc but I would get through it. It's the kids. Divorce with kids would break me. \n\nI have ADHD, I can barely hold down a job, I'm the black sheep of my family who's mother is the black sheep of her and her husband's family. All this to say - I have no support.\n\nAs a family unit - yes, all the kids, let's go!! but alone? not so much. \n\nSo, for the last while I have been pondering how to navigate around this... And basically, if I have kids and get divorced, I want a lump sum on divorce and some form of maintenance going forward. \n\nToday when researching if that is something that can actually be done in my country, I was pleasantly surprised with the amount of praise I received from women. I also got a lot of misogynistic \"gold digger\" bull from the usual suspects. \n\nThe pseudo-intellectuals started shouting \"trauma\", \"childhood\", \"and anxiety\" - which of course who TF doesn't have trauma and/or anxiety? HAVE YOU SEEN THE WORLD????? But on top of that is running head first into a statistically worse situation (marriage with children) with no safety net or security other than the promise of a man to love you forever not the crazy scenario? \n\n&#x200B;\n\nMy brain is a bag of knots right now. I'm 33, my biological clock is ticking, the world at large is a mess, capitalism, and I'm newly diagnosed ADHD - so literally see the world differently. \n\n&#x200B;\n\nI have no f\\*cking clue how to proceed but know that I must proceed because life moves forward one way or another and no action is a decision in itself. So, can some of you wonderfully intelligent people advise? Am I right? Am I crazy? Is this even a thing? And what kind of lawyer would I need to speak to with this?",
    "title": "Is it weird that I want a baby pre-nup situation before getting married?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1698930301,
    "score": 408,
    "keyword": "woman lawyer"
  },
  {
    "text": "A civil servant in South Korea, who secretly took pictures of a female colleague, gets caught and laments \"What a difficult world to live in as a man!\" News article:\n\n[https://www.chosun.com/national/national\\_general/2023/01/13/JKJMZWEP5RFU5GZWZYJXGE5XDQ/](https://www.chosun.com/national/national_general/2023/01/13/JKJMZWEP5RFU5GZWZYJXGE5XDQ/)\n\n&#x200B;\n\n>A civil servant in Korea made a post on Blind, an anonymous office worker forum app, complaining about being charged after getting caught while secretly taking pictures of a female colleague.  \n>  \n>You can sign up for Blind only by verifying your workplace with your company email, and your nickname and workplace are displayed in your posts/comments.  \n>  \n>**The civil servant said in his post:**  \n>  \n>**\"I got caught, secretly taking pictures of a woman I like at my workplace. Not 'porny' pictures, but just pictures of her at work. But she's pressed charges against me. Is this something to be charged for? I didn't even distribute the pictures on the internet, but just kept them for myself, but I'm now perceived as a pervert. Is what I did sexual harassment?**  \n>  \n>**Now people look at me funny at work. If I'm proven not guilty, can I press charges against her for false accusation? Lawyers, I need advice.\"**\n\n&#x200B;\n\n>He faced backlash on the forum but he didn't care and mocked people who criticized him.  \n>  \n>A user said \"It's disgusting to think a coworker is secretly taking pictures of me at work.\"  \n>  \n>And he replied \"I wouldn't take pictures of someone like you. Go make me some coffee, Miss Kim.\"  \n>  \n>**The legal advice he got is \"Secretly filming/taking pictures of someone (without permission or against their will) is a crime. If the woman feels violated, then it's sexual harassment. Since you're a public servant, you might face some disciplinary actions.\"**  \n>  \n>**He later posted \"I'll just give her 500,000 won (about $500) and ask her to settle out of court. What a difficult world to live in as a man!\"**",
    "title": "A civil servant in South Korea, who secretly took pictures of a female colleague, gets caught and laments \"What a difficult world to live in as a man!\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1673740738,
    "score": 361,
    "keyword": "woman lawyer"
  },
  {
    "text": "A cop told my friend not to report sexual assault TW sexual assault. \nMy friend had been married for 5+ years. They have 2kids together. He’s always been pretty shitty imo but she’s finally done taking care of a man child and started separating. Moved into her own bedroom next to the kids room. \n\nHe snuck into room the other night while she was sleeping and sexually assaulted her.  He stopped when she woke up and said stop, but that’s irrelevant. Because she was already living in another room that she asked him not to enter. No consent! She told me the next morning what happened and she just mentioned it like you would mention that you broke a glass or something minor. She didn’t want to report it because she didn’t want to traumatize the kids. Many talks and an emergency call to her therapist convinced her to call and file a report of what happened. She ended up kicking him out of the house that next morning so he was gone. But when the police came after he’d left. The officer did clarify that what happened was considered a violent crime and sexual assault. Then he proceeded to convince her that she SHOULD NOT REPORT HIM because it “could ruin his life”. \n\nThis “officer of the law” stood in this woman’s home, looked her in the eye, and said this felony isn’t worth ruining this man’s life over. I’m fucking sick. She said he was older 60+ year old cop. He probably has a wife, kids (maybe daughters), nieces, sisters whatever women in his life and he told her not to say anything because her “husband” may never be able to get a good job again. ….. what about her life?! What about what he’s already fucking ruined?! I’m so mad. It’s all I’ve been thinking about. She’s got a lawyer whos got her thinking more clearly. but I’m so fucking pissed. She’s got resources. She’s going to report him. I drove down and changed her locks and garage remotes and installed window locks. This absolutely will be handled. But there’s been several other people (women and men) and who have made her feel dismissed or like she’s somehow the one who’s fucking her soon to be ex over!I really just cannot fucking wrap my head around any of it. This really is why women (or anyone) don’t report. They probably started the process then felt forced to give up.",
    "title": "A cop told my friend not to report sexual assault",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1681935119,
    "score": 315,
    "keyword": "woman lawyer"
  },
  {
    "text": "Romanian Police Helped the Tate brothers and their collaborators escape charges after a victim escaped the compound after being beaten, because Luana Radu, one of the defendants, was a former policewoman. The police pressured the victim to drop the charges of assault and deprivation of liberty.  Source: [https://www.gandul.ro/actualitate/exclusiv-politisti-de-la-voluntari-suspectati-ca-i-au-ajutat-pe-fratii-tate-sa-scape-de-unele-acuzatii-fosta-politista-luana-radu-ar-fi-fost-omul-de-legatura-19913869](https://www.gandul.ro/actualitate/exclusiv-politisti-de-la-voluntari-suspectati-ca-i-au-ajutat-pe-fratii-tate-sa-scape-de-unele-acuzatii-fosta-politista-luana-radu-ar-fi-fost-omul-de-legatura-19913869)\n\n&#x200B;\n\nTranslation:\n\n&#x200B;\n\n**EXCLUSIVE | Voluntari police officers suspected of helping the Tate brothers escape charges. Former policewoman Luana Radu is alleged to have been the contact**\n\n&#x200B;\n\nThe investigation into the case of brothers Andrew and Tristan Tate, who are in pre-trial detention after being charged with human trafficking and rape, has also brought to light possible abuses committed by some Voluntari police officers. They allegedly tried to persuade at least one victim of the Tate brothers and their two female accomplices to drop the charges.\n\nThe arrest of the two Britons has raised questions about how, from 2016 until the end of 2022, they managed to raise millions of euros from the sexual exploitation of young women without ever getting into trouble with the law, especially in the context of the human trafficking charges brought by DIICOT prosecutors in December, when they also arrested them.\n\nJudicial sources revealed to Gândul that the Tate brothers did in fact get into trouble with the law, but were allegedly helped by some Voluntari police workers.\n\nIn this sense, it would be an incident that took place before the first searches in April 2022, when the villa of brothers Andrew and Tristan Tate, in Pipera, was raided by the police of Ilfoveni, mobilized after a referral from the US Embassy. At the time, the diplomatic staff informed the police that a young woman, an American citizen, had been lured to Romania and kidnapped in a villa in Pipera, where an attempt was being made to sexually exploit her in a videochat studio.\n\n&#x200B;\n\n**The case was closed**\n\nDuring the investigation, which reached DIICOT shortly after the April 2022 searches, prosecutors established that at least one woman had gone to Voluntari police headquarters to complain that she had been kidnapped in the building where the Tate brothers' videochat studio was set up, and had been beaten there by former police officer Luana Alexandra Radu and Georgiana Naghel.\n\nThe victim allegedly managed to escape from the videochat studio to the Voluntari police, where she filed a complaint.\n\nAccording to the sources cited, the police officer who recorded her complaint would then also have called Luana Alexandra Radu to the Voluntari Police headquarters, where he would have recommended her as his \"former colleague\".\n\nThe policeman allegedly insisted that the woman complaining that she had been kidnapped and assaulted drop the charges. Subsequently, sources say, the case was closed by the investigators of Ilfoveni.\n\n&#x200B;\n\n**Britons Andrew and Tristan Tate arrested in Romania for human trafficking**\n\nBrothers Andrew and Tristan Tate, together with Georgiana Naghel and Luana Alexandra Radu, received their first pre-trial arrest warrants on 30 December 2022, after being detained by DIICOT prosecutors the day before, following raids on their villa in Pipera and videochat studio.\n\nOn 20 January, at the request of the prosecutors, the Bucharest Court extended their remand warrants for a further 30 days, from 29 January to 27 February. Although the decision is not final and has already been challenged by the Tate brothers' lawyers, they remain in custody at least until 28 January, the last day of the first arrest warrant. In the coming days, the Bucharest Court of Appeal is due to decide whether Andrew and Tristan Tate and their two accomplices will remain in pre-trial detention or will be released or placed under house arrest from 29 January.\n\nThe DIICOT prosecutors managed to convince the Bucharest court judge to extend the Tate brothers' arrest warrants, arguing that if they are released they \"may exercise psychological control over the victims\".\n\nProsecutors also say that brothers Andrew and Tristan Tate could flee Romania if released from custody. In the context, DIICOT prosecutors used an earlier statement by one of the two eccentric millionaires, in which he said he had accounts in 19 countries around the world and could fly using several passports.\n\n\"If I make a mistake and England wants me in jail, I can fly with a Nigerian or American or English or Polish or Estonian passport. I have bank accounts in 19 countries,\" prosecutors quoted a statement by one of the Tate brothers in the indictment.\n\nThe arguments and evidence presented by the DIICOT prosecutors convinced the Bucharest court to extend their pre-trial detention warrants for another 30 days, and the judge considered that leaving them at large \"would create real risks for the proper conduct of the criminal trial\".\n\nAndrew and Tristan Tate are accused of \"setting up an organised criminal group in 2021 with a view to committing the crime of trafficking in human beings on the territory of Romania and other countries such as the United States and the United Kingdom\".\n\n\"The victims were then transported and sheltered in buildings in Ilfov county where, through acts of physical violence and psychological coercion (through intimidation, constant surveillance, control and the invocation of alleged debts), were sexually exploited by members of the group by being forced to engage in pornographic acts with a view to producing and disseminating material of such a nature via social media platforms and by being forced to perform forced labour in order to obtain significant financial benefits consisting of sums of money obtained as a result of users accessing the material\", according to the DIICOT.",
    "title": "Romanian Police Helped the Tate brothers and their collaborators escape charges after a victim escaped the compound after being beaten, because Luana Radu, one of the defendants, was a former policewoman. The police pressured the victim to drop the charges of assault and deprivation of liberty.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674657617,
    "score": 194,
    "keyword": "woman lawyer"
  },
  {
    "text": "Women want to take used sperm out the dumpster to get child support! Some men being paranoid that women want their sperm badly enough to impregnate themselves by jumping into a trash can in order to gain child support money cracks me up. Some condom companies use spermicide. Even if not all companies use spermicide, sperm doesn't last long outside when exposed to open air. The dude argued that if men tie their condoms before throwing them, then the content is \"wet\" and women can impregnate themselves with it. It's almost like some ppl don't realize what outside temperature does to the contents of a condom. Let's ignore basic science and consider that some woman was dumb enough to try this. I guarantee you it would be done on a  wealthy dude who has enough money to buy decent lawyers that could easily get the case dismissed. I don't get why some men are this paranoid when the statistical likelihood that they will end up with this particular issue is next to nil. What do you guys think?",
    "title": "Women want to take used sperm out the dumpster to get child support!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674074426,
    "score": 109,
    "keyword": "woman lawyer"
  },
  {
    "text": "Promising Young Woman My husband and I just watched this movie. How did I miss this when it came out in 2020. I wonder if it was affected by the pandemic. Because I had no clue what this movie was. But wow. It is such an impactful film. It does such a great job at showing the affects and effects of sexual assault on women and those who love them. As well as how non affected and undisturbed the perpetrators are. The system that protects these men (both systemically: dean, lawyers, etc, and socially: peers, other women, bystanders witnessing an assault or seeing a vulnerable woman is a dangerous situation and turning a blind eye etc). The victim blaming. It so masterfully captures men who view themselves as “good guys” and “gentlemen” but are nothing more than rapist. It so well visually (the notebook with marks and names) and narratively (she goes out every weekend) illustrates how rampant the problem is. It makes it clear it isn’t a few bad apples. It’s the entire huge apple barrel or the whole apple field, if you will!  This movie is so well acted and structured. There is so much to discuss within it. The scene of her getting catcalled and then their reaction to her reaction to them. There is just so much there  within a 30 sec scene. Have you seen this movie? Were you just as interested and affected as I and dh were? It’s available on Amazon Prime if anyone would like to check it out (but obviously TW it is about SA, misogyny, and sexism so watch only if you’re ready). I tried not to be too explicit and give away too many details, I hope, but I was very impressed with how the movie dealt with these very serious things (especially for someone like my husband who as a man just doesn’t have our lived experience and as a truly good man really couldn’t understand some of it. We legit had a conversation about a lot of this as he’d ensure I got home safe and even tuck me in a blanket and let me sleep if I was black out drunk—neither of us drink so it’s totally hypothetical—and is so removed from the idea of assaulting someone who is incapacitated! Ie basic human decency. It also flowed into me showing him the tea/consent video which he somehow never saw before). \nNecessary disclaimer: like all fictional movies there is obviously a plot and narrative drive the movie needs and some things are debatable as to the main character’s morality or ethical degree of her choices etc. I wasn’t focusing on that as much as the movie’s dealing and basically explaining of a lot of the stuff this sub talks about a lot and a lot of incel type/not all men types seem to just not understand or are determined to be blind to. I’d love to hear what you thought if you saw the movie. I had just recently (a few days previously) watched the same actress in She Said (also on Prime) and was so struck/pleased with her seeming desire to do “feminist” content and being happy she did and did such a good job in both.",
    "title": "Promising Young Woman",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687893636,
    "score": 96,
    "keyword": "woman lawyer"
  },
  {
    "text": "Putting in effort for patients who aren't fully invested in their own well-being or don't respect my time I thought I could do it, you guys, but it's kind of wearing me down. Recently got a string of frustrating patient encounters. I'm an outpatient psychiatrist (2 years out of residency) and I do a mix of medication management and therapy. \n\nI feel ashamed about it because I feel I shouldn't let these things bother me, but it's been tough. I'm pretty worried I might be getting burned out because of these things and that makes me feel resentful because I have a full panel of other patients. \n\nI try to set boundaries but each time I'm putting in effort and thought into it because I want to be professional and healing and this is extra draining. It'd be easier in the moment if I can just say what I think without all the empathy and the compassion but I also know it's not helpful and obviously unprofessional. \n\nI think maybe I feel resentful for all the effort I put into patients who aren't fully invested in their own well-being or don't respect my time. \n\nExamples:\n\n1. A young woman who decided she wanted to go \"natural\" and stop her mood stabilizer, but then later emails me and asks about getting a prescription for Adderall because she took one of her boyfriend's and felt better. And when I tell her we need to meet and discuss, she says, \"why? We just met. What else do you need to know?\"\n\n2. A young tech guy who literally told me \"I haven't had vacation in like 6 months and it's really hard for me to ask for it because I'm so junior on the team. Can I get a medical leave? I've called out of work and I feel less anxious when I do that.\" We ended up negotiating starting a medication and he'll consider therapy while he gets on leave but this also makes me feel frustrated because on the one hand I feel I should meet patients where they are and I do believe this will net help him, but on the other hand I feel my goodwill is being taken advantage of.\n\n3. An elderly guy who keeps making sexist comments and downplays his drug use. He is a recent transfer from a colleague moving away and he's only on Vyvanse (low dose). I feel maybe it's worth the not ideal stimulant use to work on the therapeutic rapport and explore his substance use without alienating him now, but I also feel he's not that invested in getting better and I don't feel good about this.\n\n4. A young man (very wealthy) who recently got into a fight with a server because they had a bad attitude. This led to verbal confrontations and ultimately a physical fight. The one that made first physical contact, according to patient, is the server; police were called. This patient expresses a lot of frustration over being disrespected, and uses his usual coping mechanisms of buying things, but tells me he went and bought a luxury car but still feels way too angry. He's decided the only way to feel better is to hire the best lawyer and \"ruin them financially\". He says he doesn't care about the money but he bets this server and this restaurant would because apparently it's a small business. I'm trying to talk him down / see this as an opportunity to work on emotional regulation in ways that will benefit him, but like, it's so gross and sad. I'm trying to remember I'm this guy's psychiatrist and not like a judge, and life is unfair, but it's hard for me to keep the empathy. \n\nI think about taking some personal time off but there's so many patients and needs... and I also feel I shouldn't be struggling with this because I should be better somehow.\n\nOh, and in addition I feel like 150% Mom guilt so in addition to all of this I feel I'm abandoning my own family for this job.",
    "title": "Putting in effort for patients who aren't fully invested in their own well-being or don't respect my time",
    "subreddit": "medicine",
    "timestamp": 1682448694,
    "score": 385,
    "keyword": "woman lawyer"
  },
  {
    "text": "Need advice for dealing with discrimination at hospital Edit: Thanks for the comments/advice. We'll look in to suggestions here and hopefully find some solution. \n\nTL;DR\n\nI believe there is some systemic discrimination against minorities and women in my hospital system. This has not only negatively affected me and other employees but has also had a negative effect on patient care. The hospital is not accredited by the joint commission. I have spoken to an attorney who says I have a case but I don’t think this will cause large scale change as this is a very wealthy organization. Any ideas of who I can report to or what I should do to actually improve the situation here?\n\nLong Bit\n\nI work in a small town hospital in a conservative state. I originally trained in a large city in this state and my first job was in a large, liberal city in another state. The town has \\~100k population the hospital serves the surrounding area. All the leadership positions are white men and one white woman. Several incidents have happened in my time here.\n\n1. Soon after I got here they tied compensation in form of bonus to patient satisfaction (not uncommon) I objected in writing because of the demographics of this town being predominantly white and I had already experienced some racist comments from patients. I thought this would influence my patient satisfaction scores. I was given a handout from leadership with lists of things to improve satisfaction. One was “know the background of you patient population and the culture.” The following one was “ hire employees with similar backgrounds”. I was told this how things were going to be done.\n2. About 2 years into my time here a young white male colleague left the hospital for a new job. Prior to starting he was told the system that hired him was going do pay cuts across the board. He asked to come back to our hospital - the leadership took him back and promoted him to the head of the group replacing the older white gentleman (who was the boss when I was hired) passing over a minority gentleman who was the assistant head to the former boss. Relative to myself and the assistant head, the younger colleague has much less experience.\n3. In the time that all this happened several instances of discriminatory practices against patients of color occurred and I reported to my direct bosses.\n4. 2 female colleagues of color faced discrimination from colleagues and ultimately resigned from practice. Meanwhile white male physicians received at the most slaps wrist for major issues.\n\n\\-One sent inappropriate pictures to a subordinate- she somehow left the practice but he remained head of a department. This same physician got into a verbal altercation where a subordinate felt physically threatened. She ultimately resigned her position. He not only kept his employment but also kept his position as head of a department. This same physician has verbally attacked female physicians (two of color) which has influenced pt care decisions which were not consistent with best practice.\n\n5) Just recently I was not given an opportunity to apply for a position I wanted. I expressed interest to my boss about applying for it and was told I would be good fit. However less than a week later I was told the position was already given to another white male who has much less experience than me and hasn’t been at the hospital as long as I have. Nor did he have any qualifications that superseded mine.\n\nThen a few weeks ago my direct boss was promoted to a senior level position. He has participated in discriminatory jokes (openly) and does not consult female physicians of color. Despite it being best practice, he openly admitted to me he does not consult these other female physicians because another white male physician had spoken poorly of them\n\nWith his promotion he also informed he that he had chosen another white male to be the head of department. This gentleman had been part of the organization less than a one year. When I asked what his qualifications were above anyone else in the group – he became flustered and couldn’t give an answer. The final reply by the now promoted boss was it was “his decision”.\n\n\\*I understand things don’t always go your way careerwise but I feel there is some kind of systemic discrimination going on here when there are so many instances of more qualified minorities being passed over for less qualified white males. I understand there may be some “X” factor when the hired person has 3 years’ experience vs 5 years of experience but when several candidates with 5-10 years experience are passed over for someone who has <1 year experience and who just happens to be a white male…something doesn’t seem right. Especially when similar things or other discriminatory things keep happening here.\n\n6) A non-white patient who was also an employee of the hospital was hospitalized with a major medical problem requiring months of hospitalization. I joined her care team and saw she was developing complications from being hospitalized too long. I inquired as to why she was still hospitalized because I was confused about why she had not been moved to rehab where she could be better served. I was told that higher ups had decided not to let her go on to rehab because she was under the hospital’s insurance (they are self-insured) and do not want to pay for rehab when she could stay in the hospital within their own system. I raised a stink saying it was unethical as she was developing complications from not having more intensive therapy at rehab.\n\n7)During COVID a white pt who did not require ICU care was moved to the ICU without doctor approval as his white family member who was employed by the system was belligerent with a house supervisor and demanded his family member be moved. During that time many patients (including one of my own) coded and died while waiting for an ICU bed. I raised this issue to quality and did not see any repercussions or changes to policies.\n\n8) Also, another thing that happened during COVID, 1000+ death certificates were assigned to me by a nurse and then when the mistake was found I asked that it be rectified because this is a legal document- leadership said “oh don’t worry about it”.\n\n9) While I was sitting in the office my boss (white male) made a joke about how the “AMA recommended no longer identifying race for example 43 y.o. black female”. A white female colleague in the office (openly not behind closed doors) said, “ What do they want us to say 43 yo lazy mother fucker” and both people laughed. I understand everyone has prejudices but I cannot comprehend how in 2023, a person educated and trained to the same degree as myself, would be comfortable speaking this way in a professional setting.\n\n\\-There have been other similar comments like this amongst the staff here this one was just the most recent.\n\nI have spoken to a lawyer who tells me I have a personal case under title 7 of the civil rights act with max of 1 million in damages. The thing is that would be *a drop in the bucket* for this organization. They have a very large endowment and I’m aware of several lawsuits that were simply settled because they can easily afford it. I also spoke to a few colleagues who ended up resigning due to what they felt was discrimination against them but they ultimately did not want to go through the trouble of pursuing some legal solution.\n\nI’m trying to make a change in this system for patients many of whom are non-white in this town who have no choice in healthcare as this is the only option as well as for the female and/or non-white employees.\n\nI do not know if I have broader legal grounds due to discrimination affecting patient care in this town. Something like a class action lawsuit with more financial impact on them so they are motivated to change, or finding legal counsel that would take this to trial so that more attention can come to what is happening in this town. Media in this town is limited and most people who control media have connections or ties with the healthcare system.\n\nIs there an agency to report these things to? The Joint Commission apparently does not come here. But someone who has actual teeth and can enforce change on this place. I feel like its crazy this kind of stuff is happening in 2023 in a professional, somewhat large institution.\n\nThanks for any comments or advice you can give.",
    "title": "Need advice for dealing with discrimination at hospital",
    "subreddit": "medicine",
    "timestamp": 1682126622,
    "score": 39,
    "keyword": "woman lawyer"
  },
  {
    "text": "Charged misdemeanor assault pled down to 4th degree misdemeanor aggravated disorderly conduct Hi, over a year ago I was at a bar with friends. I noticed a man being physical with a woman and me being the person I am, always trying to make sure everyone is okay, checked to see if the girl was alright. The man got angry, told me to mind my business, pushed and spit on me. I open hand hit him off me. This happened as a police officer was approaching. I was never arrested. I was wrote a ticket for M1assault. Later in court, they gave me a plea deal and said they would let me off with M4 aggravated disorderly conduct if I plead guilty to that. I did, to avoid going to trial. I had no jail time, just a small fine and an anger management course. I’ve never been in trouble before. I have a bachelors degree from a competitive university and have worked hard to get to where I am, however it seems as if one mistake has ruined my life. The past year, I’ve done a lot of reflection and have decided that I care for others health and safety deeply. I want to make an impact on someone’s life. I want to be a nurse…. Will my misdemeanor aggravated disorderly conduct stop me? I’m in Ohio. I contacted the board and they told me they can’t give me an answer until I submit an application. I’m just so drained because of this. I feel like my life is ruined. I have the opportunity for expungement soon with a lawyer, however I know it will still show up on my background check. Can someone give me advice or has anyone been able to become a nurse with something similar? Please give it to me straight. Also, I wouldn’t say I have ever had an alcohol problem but I was definitely drinking that night. I haven’t drank since because I’m terrified from that night. I am over a year sober. Please give me your thoughts. Thank you so much",
    "title": "Charged misdemeanor assault pled down to 4th degree misdemeanor aggravated disorderly conduct",
    "subreddit": "nursing",
    "timestamp": 1696043349,
    "score": 2,
    "keyword": "woman lawyer"
  },
  {
    "text": "Is it wrong to feel this way? I had a terrible experience the last two years I taught at my previous district.  I had a student accuse me of impropriety that was proven false, and that student’s mother was an aide whom obviously coached their daughter on what to say.  After that I had the student ejected from my class and that student and their mother both started spreading rumors about me and lying about why the girl was kicked out of my classroom.  You know FERPA, I can’t defend myself without violating this child and their lying parent’s “privacy”.  Anyhow, I put my notice in last year in January and they began to just let that woman and her child run ramped all over me and it was terrible because the district’s lawyers pretty much told my admin to leave me the hell alone and keep that woman away from me, I filed multiple grievances last year and prevailed on every single one of them.  The buddy system was strong in that school.  It also has a “D-“ ranking of which they were blaming covid, but it was obviously poor leadership.  I got a new job over the summer at a new school district and moved 4 hours away.  We had some PD today and my new school is an “A” ranked school, and the difference in leadership here is like night and day.  I am seriously wanting to never fall asleep again because I am afraid I will wake up and be back in the bad place.  Is it wrong to feel that way?  I just feel like my previous district has so jaded me that I am going to seriously screw this sweet job up at this awesome district.",
    "title": "Is it wrong to feel this way?",
    "subreddit": "Teachers",
    "timestamp": 1691467070,
    "score": 2,
    "keyword": "woman lawyer"
  },
  {
    "text": "Do people even realise how harmful rich, or so-called elites are? by the definition of psychopath, or antisocial since psychopath, that defines rich perfectly, is not recognised officially, but antisocial, that doesn't exactly fit the elites, fits. And it doesn't fit exactly because one of the criteria is visible violence.... that is only visible if you dare bothering a rich.... yes, they fit perfectly the criteria of antisocial, however, because they are spending millions and millions on themself to stay sane (you know, how you eat snacks, or watch a show, psychopaths need millions), it's not clear.\n\n&#x200B;\n\nWithout owner class: prices will go down, since we are not extra taxed to pay a debt or other economical terms that legally allowed elites to get rich without working, you know, like slave owners\n\n&#x200B;\n\nwithout owner class, workers get paid, instead of mass layoff, underpaid, and other legalised strategies to maximiex the profit shareholders and other owner class recive on the same modern slavery system where we play with world but the end result is the same as slavery. After all, just like in slavery, you are motivated to work to take care of yourself, family, and more, since otherwise you can't survive. Just like in slavery, if you are not working, there are tons of penalty work force can enforce\n\n just like in slavery, the ownerclass has no obligation, or what, do you see any government push for for lawyers? and no, I'm not talking about the one representing the comany but one representing yourself. Why do companies not support unions? Why does no work training teach you your work rights other than superficially go thorough as they are obligated? How comes during wars, pandemics, and more, all comaies are rising their prices, not to meet dements, but for extra profit, when all of them should push for a 0% profit to help others as much as needed, since this is the argument why we need rich: to help society growth, yet all the rich prove, is exactly what they are: antisocial being, who have hoarding issues, and suffer from god complex.\n\n&#x200B;\n\nthe laws have been rewrritend, repharesed, new added, until we are in a situation where:\n\n&#x200B;\n\nif a friend give you 10, you give them back 10 without paying tax since you returned your friends capital\n\n&#x200B;\n\nso if a company, singing contract, borrows 10 billion, the investors gets back 100% of that money, on top % profit via interest that other work to produce on top of the 10 billion, and because of word play, this is considered investor getting back thir capital = no tax paid.\n\n&#x200B;\n\ndo you people even understand how much 1 bilion is?\n\n&#x200B;\n\nif you receive 1 million every day, it would take almost 3 year to get 1 bilion.\n\n&#x200B;\n\nduring pandemic, some companies made over 10 bilion, just because their raised prices, and the people suffering who of course had no other chose since the one in charge are psychopaths who by definition don't care about the life of others \n\n&#x200B;\n\nif slavery was legal for thousens of years, if woman not voting or working was illegal for many years, why are we still not banning rich to exist when the only thing they do is destroy everything, blame others for it, and if someone dares to upset them, they will become violent and cause even more suffering, destruction and more just to prove they are suffering from god complex",
    "title": "Do people even realise how harmful rich, or so-called elites are?",
    "subreddit": "WorkReform",
    "timestamp": 1699797547,
    "score": 434,
    "keyword": "woman lawyer"
  },
  {
    "text": "Toxic workplace environment Before I start my story I would like to note that this story of my place working at this company has been amended so that only the first name of the workers given are named so that the full identity is not revealed. Also the business name is not revealed as this is a true story of my time working at the business as I worked at the business for around 7 months in the finance department before I left.\n\nI start working at the business in early January 2023 and am trained by a person called Morgan who is a few years younger than me. There is also my boss who is a woman called who has been working at the business for quite a while as well. I start working there and my boss tells me that Morgan will be leaving the business at the end of January 2023 and Morgan and his girlfriend will be doing a world tour covering various different countries located in east Asia as well as also travelling to parts of Oceania like Australia and New Zealand and are planning on doing this trip for approximately 3 months then returning back to the home country. That gave me approximately 3 weeks to spend with him before he left the business to go on his travels. At the end of my first day I was about to leave the office however Morgan tells me that before I leave the office I need to send a email to the CEO (Paul) to let Paul know all the tasks that I have completed today. I was confused by this but Morgan tells me that it is a mandatory procedure that everyone in the business is required to do (there is approximately 75 people who work in the business). Then I kept forgetting for the next few days after that to send the email to Paul about this which Nicola tells me to do. I quickly figured out that most of the job could be simplified and automated away given that it was all in excel and functions such as (COUNTIF, SUMIF, IF and VLOOKUP) could be used to simplify my job. Then around a week before Morgan was due to leave a woman called Catherine started working at the business and stated that she previously worked at her previous company for over 20 years but was forced to leave her previous job after it was announced that her job was being moved to Canada which she was not willing to relocate to. I got along with her well and it got to the end of the day and I asked her that I will see her tomorrow and she then looked at me and said “I think that I will see you tomorrow”. This left me confused as she was implying that she wasn’t sure if she was or wasn’t going to go to work the next day. The next day she arrived to work and Nicola told me to show her Sales Invoices and I provided a detailed explanation of how to do them and she stated that it is too complicated for her. Nicola then called Catherine into her office and they were in the office for over a hour which confused me and then Catherine announced that she was leaving the business and got her stuff and said that it was nice meeting me and Morgan and she left. I asked Nicola why she left given she only worked there for around 10 hours and she stated that the job was too complicated for her to do however a few days later Morgan told me that she got “bad vibes from the office” which caused her to leave. Then a few days before Morgan left the business he looked at me and told me that Nicola was also planning on leaving the business. I then asked him when Nicola was planning on leaving the business and he shrugged his shoulders and stated that he didn’t know when she was planning on leaving the business. It got to Morgan’s final day in the office and I said my fair wells and wished him the best of luck in whatever he decides to do in life. I then looked at Nicola and told her that I would see her tomorrow. I arrive to work the next day and walk over to my desk only to discover that my computer has disappeared which confuses me and I look around the office trying to find my computer. Then Paul the CEO asks me to go into the boardroom which is a separate room from where everyone else sits and another person called Andrew who is second in command is also in the room. I sit down and Paul tells me that not only did Morgan leave the business yesterday but also my boss Nicola also left the business on the same day even though she was meant to leave at the end of April 3 months after her original departure as she left at the end of January. He told me that I was the only person in the finance department for now and I would have to report directly to Paul if I got stuck. I was then moved to sitting near a woman called Tina who was the head of HR (Human Resources) and was also personal assistant to the CEO. I then started implementing the formulas that were required shortly after I sat at my new desk to simplify my job. \n\nAround a month after I started, I started doing IM’s which are Profit and Loss statements where you have your gross and net profits and then you have addbacks once the business is sold as our business is basically the business equivalent of selling houses and we earn between 2% to 5% commission per sale based on the business sale price. The IM’s are used in brochures which we send to the clients who might potentially buy a business. I start doing it alongside 2 other people who are new to it and then one day Paul the CEO sends a email stating that I won’t be doing that job and it will instead be done by 2 other people exporting some of my job out to others which normally takes me 5-6 hours per week to complete as when Morgan worked at the business he did briefly show me it but didn’t have much training in the task and it was instead going to be done by James and Daniel as Daniel was partially doing it anyone alongside Morgan before Morgan left. Paul then had a quick meeting with me and stated that there was no better place to work than here and he was more than happy to invest in me for my Accounting studies. Also Paul was in the process of hiring someone to replace Nicola for the position of management accountant. Also around mid February a new person called Kevin had started working for the business as he is the COO (Chief Operating Officer) and is the 3rd most important person in the business as his job is to be the go between person between the regular workers and the CEO as the regular workers go to him for any questions / problems / concerns and he then reports to the CEO so that the CEO Paul has a good grasp of the day to day running’s of the individual departments delivered by Kevin as well as Kevin also performing other tasks.\n\nThen at the start of March 2023 the business had successfully hired someone new to replace Nicola as the head of Finance which was a woman called Hiba. She started working at the business and I was impressed with her knowledge as she was born in Morocco and was fluent in 3 different languages which was (English, French and Arabic) and also had a degree in something medical related (can’t remember the exact degree name) and was now training to become a accountant and had also read multiple religious texts of the (Qua-ran, Bible, Torah and Talmud) as well as other texts and was well educated on religious beliefs from different religions. I was then moved away from where I was sitting with Tina after having a few laughs with her as the funniest was when I asked her how her weekend was and she said it was good as she states that she played a water fight with her kids in the garden where she was spraying her kids with a hose and they were running away. She asks me if I did that when I was younger with my parents and I said no I don’t think so but stated that we did have a pond. She then asked me if my parents took me down to the pond and looked at me and said “get in the pond you fuck” and then push me in which I couldn’t stop laughing at. My new boss Hiba was very calm and relaxed and we had a good working relationship and got along with her well. (Apologies if the story has been a bit boring up to this point as it will get good now). Then a woman called Jenna who was the head of one of the departments and had no prior knowledge or experience in finance advised me that the way I was doing a part of my job was wrong. I queried it with her and stated that I was following a series of notes to do this task which was typed up by Morgan before he left the business and was following them. She stated that the notes that he had typed up were wrong and stated that the breached company policy even though I had never been advised this prior to this point and also my previous worker never made any mention of this and Jenna also provided no proof or evidence to prove that what I was doing was breaching the company contract. I spoke to Hiba about this but she stated that she didn’t know much about it and I told the IT department to make this change even though as I stated I was sceptical of this claim and he changed it and it caused some changes on the system which I corrected. Then a few days later the changes that I made a few days prior due to this amendment caused over 4 million emails to be generated and I had to attend a meeting with Kevin and Andrew about this. I provided my evidence as I had email evidence from Jenna to me confirming me to make this change and also provided other evidence with regards to this and I didn’t face any consequences and Andrew had a chat with Jenna as I don’t know what was discussed. \n\nThen one day I was in the office and Kevin who as I stated was the 3rd most important person in the company was overseeing the development of Daniel and James who as I stated were working on the Profit and Loss statements for the IM’s and wanted to have a meeting with them to discuss there progress and performance. Kevin’s office was a single square office that was separate from the open planned office were me and everyone else sat. Part of the way through the meeting Kevin told Daniel to leave the meeting as Daniel got up from his seat and walked out of the office and sat at his desk and Kevin and James were sat in the office with the door closed. I was sitting there doing my work and was literally maximum of 4 walking steps between were I was sat and the office door to Kevin’s office. Then all of a sudden I heard this super loud shout from Kevin that was so loud that me and multiple other workers in the office could all hear it were Kevin shouted at James stating that “if James was not happy with his job then you should Fuck off yes you should Fuck Off”. Then shortly after this event James launched a complaint to the new head of HR named Janine as Tina who was the previous head of HR left the business due to her having a feud with Paul. Janine got Kevin and James around a table and James launched the complaint that Kevin was engaging in bullying in the workplace and Janine asked Kevin if this was true. Kevin then sat there and paused and then stated that these allegations were not true as Kevin would never swear at any of his workers or engage in bullying at the workplace and denied all allegations. Kevin faced no consequences for this and as far as I know didn’t receive any disciplinary action for his behaviour.\n\nThen on a different day in the office I received a letter from the post which I opened and read and was a bit unsure on what to do with it and was not sure who to give it to. I then looked over to see if my boss Hiba was there which she wasn’t and continued working (which was spent implementing excel formulas because I had completed all my work for that week). She then arrived back around 10-15 minutes later as prior to this she took a few random days off work and had a few meetings with the CEO Paul. I gave her the letter and explained that I didn’t know what to do with it and she advised on what to do with it and I was about to go back to my desk but she stated that she had an additional comment to make. She told me that she was leaving the business around 10 weeks into the job and I asked her why she was leaving and was a bit shocked by this announcement. She stated that she was told that it was going to be a management account position but she viewed the job as being more like admin work and that you don’t need to have any prior knowledge or experience in finance in order to do her job as they could drag anyone to do the job and they would be capable of doing it. She also stated that she doesn’t have much work available to do and she has quite a lot of free time in her job and gets a bit bored and stated that I was capable of doing my job and her job and that would also benefit the company so instead of hiring 2 workers they hire 1 worker saving money on wages. I then put a email to Paul the CEO for this which he denied due to the fact that I make a few mistakes which I get Paul to correct which literally is just amending a 4 digit number to fix. Then the next day I had a meeting with Paul and Kevin and Paul told me that Hiba had left the business and stated that due to the minor mistakes that I had made and also due to the fact that I was on my probation Paul was in the position to fire me at any given time if he wished to do so if I continued to make mistakes. He then looked at Kevin and stated that as of now Kevin would be my go to person if I had any questions or queries and to not contact Paul directly even though Kevin has no prior knowledge or experience in Finance as only Paul had knowledge in finance alongside me. I was at this point a bit unhappy about the decision to put Kevin in charge of me if I got stuck on anything given how he acted towards James and his behaviour and also thought that it was rude for Paul to potentially threaten to fire me at any point even though that is part of the job position that you have. \n\nThen shortly after this there was a amendment made in my “Daily Report” emails so instead of sending a email to the CEO Paul at the end of the day specifying what tasks I had completed on a daily basis I had to specify the tasks that I had completed on a daily basis and also specify the amount of time spent completing the tasks that I completed in my email for a day to day basis which I wouldn’t of usually had to do on a daily basis in terms of specifying the time it takes. I then start sending my daily emails at the end of the day giving the honest amount of time that it took for me to complete the amount of time that it takes for me to complete my tasks and there is easily over 100 minutes every day as a minimum that I had of free time that I had available in my emails which I didn’t specify what I was doing as I was implementing formulas in excel to simplify my job in the spare time but as I stated I didn’t specify this in the emails. Then after a week or so Paul notices this pattern and sends me a email if I didn’t have enough work to do which I tell him that I don’t have enough work to do and have a few hours per day for free time as he knew from the “Daily report” emails. He then tells me that he wishes that I told him this earlier and he sends me a email for a report on a website and then on that day Kevin then organises a meeting with him in the boardroom. I attend and Kevin states that I don’t have much work to do and I have been given the log in details to the website that I am required to do the report and I have been tasked with investigating over 400 different business that deal in various different investment companies and I have to put the business names, address, business occupation type and business investments and general business info about the business into a excel file for each individual business. I then start this process and start working through the list and continue sending the “Daily reports” with a full days worth of work to complete with the report I was tasked with completing factored in. Shortly after I start working on this task I receive a email from Paul stating that I will be training a worker called Emma who works downstairs training her on how to do sales invoices which is a task that I usually complete but is given to her before I continue doing the report as this meant that around 70% of the sales invoices task that I complete will now be exported out to Emma to complete which would normally take me 3-4 hours per week to complete. I then continue working on the report and after around 4 weeks I complete the report and tell Kevin this as I briefly interrupt him in a meeting with a woman called Corelia in a meeting. I apologise afterwards for interrupting which they state that they are okay with and I email the excel spreadsheet to Kevin and he opens the spreadsheet and asks if I had completed the task and I say yes I have and he then says that there is not that much info on the spreadsheet. He then scrolls to the top of the spreadsheet and I quickly realise that there was a filter applied on the spreadsheet which therefore explains why the full list is not shown and ask him that if he wants to view the full list then he has to clear the filter. He then tells me that he can do it and he highlights all of the rows on the spreadsheet and then right clicks after that and then clicks on find and replace and starts typing into the find box and then in the replace box and then clicks on replace all and it comes up with a error message. He then sits there and tells me that he doesn’t know what to do and I say to him “click on the banner at the top that has the word data” he clicks on that then I say to him “next to where it says the word filter click on where it says clear” he clicks on that and I say to him “you now have your full list of businesses on the spreadsheet.” Then the next day at work he then sits there in his office and asks me if he can borrow me and I walk into his office and he sits there and says that yesterday I showed him how to clear the excel filter however he has since forgotten on how to clear the filter and wants me to tell him how to clear the filter again which I tell him. He then puts the occupation in alphabetical order and then manually scrolls down the list to find the list that starts with the letter “H” and then tells me that if he wanted to read the list of businesses that have the name of healthcare then he knows that because it starts with “H”. I then advise him that this is a false claim to make as not all of the businesses for occupation are in alphabetical order in the list and when you filter in excel by alphabetical order it only does the order for the first word and ignores the rest meaning that they are not all in alphabetical order. I instead ask him to click on the drop down and type in the word “Health” which he does and then press enter and that gives him the full list of businesses that have the word “Health” in the list which he thanks me for. Then a few days later Paul the CEO then sends me a email asking me where I am up to with the report and I send him the spreadsheet with the info in it which indicates that Kevin did not complete his job of sending the report to Paul which is one of his tasks for his job title.\n\nThen after this I go back to having less work to do and as I briefly stated the sales invoices tasks had been exported out to Emma with no reason specified why this was the case and giving me less time now to complete my tasks and I continue to send my “Daily reports” emails with even less time now available to complete my job. Also as I stated earlier the IM task for Profit and Loss was also exported out to James and Daniel reducing my workload further as well. Also another task that I do is the AKS and the AML reports which I put together every Monday which I put together on excel and usually takes around 10 minutes to complete however that task is given to the other people due to the simple nature of the task and how quickly it takes to complete meaning that this task is also exported out to the other workers just before I completed the report task. I then continue sending the “Daily reports” emails and I again start to have a significant decrease in the amount of time that I have available to complete my job which is stated in the emails at the end of the day by the amount of minutes specified. Then after over a week after having little work to complete I have a meeting with Kevin towards the end of the day specifying what tasks I have completed and is shocked that I have several hours per day of no work to do. Also Paul the CEO also starts sending me emails saying that it is very frustrating about what I am doing on a daily basis and not specifying the full time of what I do. I then have daily meetings with Kevin giving a list at the end of each day asking me what I do and I state that I do other excel tasks. Then one day I go into work and Kevin taps me on the shoulder and asks to have a short meeting with me. I sit down and he closes the door and gives me a letter. He then tells me that in 2 days time on Wednesday (he tells me this on Monday) that I will be attending a disciplinary meeting on the basis that I have several hours free time per day and my time and communication skills and wants to know what I am doing and not stating earlier that I don’t have anything to do. I then walk out of the office room in shock that I am attending a disciplinary meeting over my productivity given the fact that I complete all of the tasks that I am scheduled to complete with several hours to spare. I then start thinking to myself that when I attend the meeting I need to prepare evidence which proves that they had foreknowledge that this was going to happen and start making plans to do this as I complete all the work that I need to complete on Monday and on Tuesday morning start preparing the documentation for my meeting on Wednesday. \n\nThen I go into the disciplinary meeting and point out these points about parts of my my job being exported and state that by default when you do that you reduce your workload giving yourself less stuff to do. I also state that when I did the requested report when I put information together for over 400 businesses during that time the amount of time spends doing my finance job is minimal when the required report is factored out and use my daily reports as evidence as proof of this fact and ask why plans were not put forward to increase my workload whilst I am doing it. I ask Kevin why the decision was made to reduce my workload and he stated that he will ask Paul this and get back to me (he never specified why this was the case). Kevin then asks me what I spend the rest of my day doing and I state that I implement formulas in excel to help simplify my job to reduce the amount of data that I put in excel. He then sits there and says that he thinks that I am lying and that I haven’t done the things that I have said. He doesn’t ask for any proof or evidence of this and then he asks me to leave as in the meeting Janine who works in HR is making notes of the conversation. I then leave the meeting room and he stated that he will discuss with Janine and I am then called back around 30 minutes later and go in the meeting room and Kevin states that I have received a first disciplinary warning which will remain on my system for 6 months because of the fact that I complete my work before the end of the day and didn’t request additional work. I then continue my job and state that the remains time I have free is implementing formulas in excel to simplify my job in my daily report emails. Kevin then again calls me into his office early next week and talks that since the meeting he has spoken to a woman called Vicki and a man called Greg and told me that if I run out of work I should speak to Vickie first and then Greg second asking for additional work which they will provide to me and that my probation period has been extended by an additional 5 to 6 months and I will have a monthly meeting to access my performance (which never happened a month after he specified this). I then continue doing my job and 1 of the 2 reports which took 10 minutes has now been given back to me to complete and have been given some additional work to complete which generates a extra 4-5 hours of extra work per week which is good but still not enough additional hours to fill the total gap of work available. Also after I received the disciplinary warning I was very annoyed and also mind blown that they thought that there is significant downsides to being a productive worker and thought to myself if these people lived in an alternative reality whereby according to them there is almost a universal consensus from experts that being productive is a bad thing.\n\nI then start doing tasks set out by Vickie and quickly complete them them and ask her for additional work but she states that there isn’t any additional work available for me to do. Then I go and see Greg and ask him for additional work and he gives me a task of doing research for Photography companies based in 2 different parts of the country and I put together a spreadsheet and put this information together which he is happy about. I then ask for additional work and a girl called Hannah gives me a excel file task which she states will take 2-3 hours to complete. She gives me the task and within 5 minutes I walk over to her desk and tell her the task that she asked me to do has been completed. She acts surprised and opens up the excel file to find it completed and is left speechless and I state that I used VLookups to complete the task and give her a set of detailed instructions of how to complete the tasks as she stated that she does this task on a weekly basis and it takes her several hours and thanks to me it will now take her a few minutes. She then gives me another task for whether businesses have or haven’t signed a NDA (Non disclosure agreement) which I complete in around a hour which she says that it takes a few hours to do. Then later on in that day I state I have spare capacity and another worker called Bradley states that all of the businesses that have a NDA need a email sent out to them and the format of the email is largely the same the only thing that changes is the business ID number. He gives me the task and within a few minutes I complete it and send out all 200+ emails. He then looks at me and asks me if I did it which I said yes and he tells Hannah this and everyone in the office is left speechless and James who I am friends with says that I am more intelligent than the CEO. I then send a email out to multiple people telling them all how to do mail merge and they all said that this will be hugely beneficial as it will help to simplify multiple people’s jobs.\n\nThen on this Monday a new girl called Maria worked for the company and I showed her how to do my job and showed her the stuff and she wrote a series of notes on how to do the tasks that she is required to do. I then showed her a excel file which had formulas in it and simplified the job and showed her how to do it which left her speechless. Then the day before I am due to leave the business I arrived to work and tried to log into my computer but came up with incorrect password. I tried again and nothing happened and then asked IT to update my password. Then Kevin tapped me on the shoulder and I went into his office and sat down and he said that he found out from someone in the business that I had implemented formulas to simplify my job and that I was planning on selling the formulas and deleting them. I tell him that I had no plans to sell them (as what is another business going to do with a bunch of data that has no relevance to there business anyway) but was thinking about deleting them because of how badly I have been treated. Kevin then tells me that he has no intention of telling the CEO Paul about this but if I delete the formulas I could be financially nuked and have a lawsuit filed against me but I state that even if I did delete them they are backed up onto a server anyway meaning that they can be re retrieved even if they are deleted of which he has no response. He asks me if I plan on deleting them of which I say no and then my password is reset and he again has a second meeting with me and he states that he has spoken to Paul and Paul has contacted his lawyers in case I do delete them to threaten legal action as Paul was on holiday at this time. He also stated that he understands what I have gone through and states that he has been in a similar situation in jobs where he has simplified and automated processes in his working life (none of which I believe). I have kept the formulas in place. Then on the final day that I work there on the Monday I again try to log into my computer and am again locked out of my computer as the password on my computer has been changed again over the weekend and I ask IT why I was locked out of my computer and he asks me to speak to Kevin which I don’t do as I get the impression that he doesn’t like me and finish my final day not being able to send a goodbye email to people I was friends with and keep in touch. Then after I finished my final day at the office I went on Linked In and posted a message on my account basically stating that I had automated away large parts of my job for the next few years and am looking forward to starting working at my next company.\n\nAlso I started looking for other jobs and have got a new job working for a different company and start my job in early August 2023 with towards the end of July 2023 being my final working day at the current company I am talking about and the remaining time is extra holidays I have left over to take. I again gave the business 24 hours notice given the short time span I had between finding out that I had a interview and when the interview takes place and it got later on into the day before I was having the interview as I booked Friday of work first thing on a Thursday and Kevin again asked me at my desk why I wanted Friday off as what my valid reason for this was and I stated that it was for a dentist appointment as I have to have braces fitted in a few weeks time due to a large gap in between the bottom of my teeth and he stood there and said that was a valid reason and authorised it.\n\nAlso another thing is that I had a leaving event a few days before I left on Monday and sent a email out to a series of people to see if anyone wanted to attend and shortly after I sent the email a person forwarded the email to the CEO Paul (as I didn’t include him in the email) and he responded stating that I had to get direct approval from him first before I should of announced the leaving event even though I finish work at 17:15 and the leaving event was going to start at 17:30 which is outside of work hours. I spoke to a local pub for the leaving event and a series of people attended the event and I had a chat with James who was the person who Kevin repeatedly swore at. James was giving me his opinion on the business as he stated that he recorded a video with audio of Kevin repeatedly swearing at James during a meeting and stated that the event where I heard Kevin swear at James was not the first time that has happened and he could of brought this up in his meeting when he accused Kevin of bullying in the workplace but decided against it due to fears he would get fired from his job. He also stated that the new person who works as the head of one of the departments who is a guy called Sunil was not a good boss as he spends most of his day on his phone and whenever he does get work to do he instead shifts the work from himself and instead gives it to a worker below him to complete so that he can do as little work as possible. He also stated that the workers who work in the sales department don’t receive any commission from any sales that they complete in the sales department as they only receive bonuses however the CEO Paul deliberately sets unrealistic targets so that as few workers as possible receive any bonuses from there work. The only person in the business who does receive commission from sales is Nathan and the reason why he receives commission on the sales of the businesses is because his dad is the CEO of the business. Also he stated that Nathan use to work in 1 of the businesses but has recently been transferred to a different department for a different business. James stated that the reason why this is, is because of the fact that there is more completion sales in the new department he works in than there is in the other company and also if another worker in the new department he works in is getting close to completing a deal the CEO Paul will contact this worker and will state that his son Nathan can handle it from here and Nathan would get the deal across the finishing line and complete the sale and earn commission from it. Also James stated that 2 of the 3 businesses were significantly underperforming and were no where near hitting there quarterly sales targets as the goal was to achieve a target in sales in 3 months but they only achieved 60% of the total amount required in sales and in a different department Paul got angry at Sunil as his department were less than 0.1% short of hitting there quarterly target which Paul was furious about. He also stated that he thinks that I was a great worker and I could easily do the same amount of work as 10 regular workers due to my productivity and also my simplifying of jobs to reduce tasks that are required to be completed to a fraction of the time that it usually takes to complete the task. I then spoke about the researchers jobs which is carried out by 4 different works at the company and asked James if he has heard of “web scraping”? He stated that he hasn’t heard of it and I say to him that web scraping is where you do a search result on a website and then you use the web scraping tool to pick out what pieces of data that you want to pick out and then select scrape and it gets the pieces of data that you need and compiles it in a excel file in a matter of minutes and also contact one of the researchers about this before I leave the business. Also on my final day I state this to a different worker and state that this would be beneficial to the business as it would require less workers to do that job in less time to complete saving the business money on wages and then after that you can then send this excel file to the workers in the sales group and they can then use mail merge to these businesses therefore allowing you to contact more businesses in a shorter period of time and then some of these businesses then might offer viewings and then a smaller amount will put down potential offers and then these offers might potentially lead to sales which would then lead to increased sales and a higher profit. \n\nApologies about the length of this text as it took me a while to type up as hope that you enjoyed it as it was a very toxic place to work and had a high turnover of staff in general and look forward to reading anyone’s comments.",
    "title": "Toxic workplace environment",
    "subreddit": "WorkReform",
    "timestamp": 1696187160,
    "score": 0,
    "keyword": "woman lawyer"
  },
  {
    "text": "Was I wrongfully terminated to job due to poor training? Basically my question is, was I wrongfully terminated from my job due to lack of training since the mistake I made was a direct result of lack of training.\n\nLast week, I was hired at a Private Healthcare facility with my first day being the 11th of March.\n\nI was told during my initial hiring that the job I worked would be fast paced and that job training would take place “on the job.”\n\nThe first day I arrived, my “training” consisted of my supervisor asking if I needed help with anything and then re asking if I didn’t understand something. Since I’ve never worked in a healthcare setting ( and the employer knew this) there was obviously some things I did not know.\n\nOn Tuesday, I had a coworker appointed as my “trainer” who would take over job training. This person had been on the job for 6 months and told me straight up they had never trained a person before. Again this “training” consisted of them asking me questions and if I needed help understanding stuff.\n\nYa don’t know what you don’t know. Well today, we had an incident in which a mistake was made on my part. Without going into specifics, this had to do with a patient complaining about something that was done by me ( not direct care).\n\nI was called into the office and immediately told that I was not a “good fit” and asked to portray my side of the story. I gave my version of events and they did not match the patients. I was very upfront and told them that this was information I was not aware of and that I had not been trained to deal with situations such as these.\n\nAgain, I was given the “not a good fit” line and then a person from HR came in and handed me termination papers.\n\nI was told to leave and then come back to collect my paycheck.\n\nI wasn’t even hired a week.\n\nWhat can I do in this situation ? Move on? Get a lawyer?\n\nEdited for more clarification: \n\n**I was hired as an Activities Coordinator at a Private Senior living residence. My employer was aware that I had never worked in healthcare and was still willing to hire me since they said that my Job would not include things that had to do with caring for residents' needs. My Job description was to play games with residents, design activities that promoted social and emotional growth, and occasionally take them out of the residency.** \n\n**On Friday, we took the residents out for an outing. This place was very crowded and I was told to look after a resident who has early onset dementia. I was not told that this woman suffered with this and was left alone with her and 5+ other people. At one point, she became lost in the crowd. I was told by my co-worker to leave our able bodied residents at a cafeteria while we went and looked for her. We did. The resident's were told what had happened and they all agreed that we needed to find the woman with dementia.** \n\n**Well, one of the residents called and said that we had abandoned them for no reason at our outing and when we got back to the residency, I was fired on the spot. I explained that I was not aware that this patient had dementia and that this was something I probably should have been aware of. I also pointed out that I followed instructions from the co-worker who was training me. It fell on deaf ears and they said that my co-worker would be dealt with, but that I was not a \"good fit\" if I thought leaving residents somewhere was appropriate. I had no idea that this counted as abandonment, especially when all of the seniors were very independent.** \n\n**It should be known that the day prior they had found out that I was on a certain ADHD drug because my drug test came back. And that I had asked about PTO policies.**",
    "title": "Was I wrongfully terminated to job due to poor training?",
    "subreddit": "careerguidance",
    "timestamp": 1679108483,
    "score": 77,
    "keyword": "woman lawyer"
  },
  {
    "text": "Career change? Lawyer to hairdresser Hi 😄 I (30, M) will try to keep this as brief as I can.\n\nI’m a corporate lawyer & tax adviser, which is the product of many years of straight A grades and lots of study in my home (EU) country. I work in London, UK and earn a pretty crazy salary. My partner and I rent our home and don’t yet have children/dependents.  \n\nWhile I’m OK at my job, I’m not passionate about it. I never have been. I’ve always viewed it as a somewhat interesting means to a secure life for my partner, my family/friends and I. I’m fortunate to have a loving partner and good friends, but over my ~8 years’ professional experience I’ve found I can struggle to connect with other lawyers beyond surface level.\n\nFor as long as I can remember, genuinely, I’ve daydreamed about becoming a hairdresser and following my passion. But when I think about the practicalities of actually doing this I quickly become anxious and overwhelmed.\n\nI’ve known I’ve been fascinated with hairdressing since childhood. My aunt had a small salon at home and I loved nothing more than spending time there with my mother and grandmother. Though, I knew they both had strong views that hairdressing is a ‘woman’s job’ and that my ‘intelligence’ would be ‘wasted’ in such a job.    \n\nWhen I daydream lately, I find myself less and less capable of seeing the big picture, which is why I think I’m posting here. Specifically, I feel anxious and overwhelmed when I imagine ‘what would X think?’, ‘how could I explain this?’, ‘shouldn’t you stick it out for longer before walking away from a lucrative career’?\n\nAny help/guidance for my situation would be so greatly appreciated. Thanks!",
    "title": "Career change? Lawyer to hairdresser",
    "subreddit": "careerguidance",
    "timestamp": 1700583830,
    "score": 3,
    "keyword": "woman lawyer"
  },
  {
    "text": "How do I deal with my violent boss? \nI am 28f and the boss in question is 45m. He got extremely angry, abusive and even violent toward me the day before New Years break. This is a family business so his father is the owner, and his younger brother helps his father run the business. 45m is rarely there.\n\nIt all started with a call from a customer saying \"hi, we bought a machine from there last year after Thanksgiving, here it's New Year the next year and I'm STILL missing the light bar\". I tell the customer I'll look for it and to call me back at her leisure. A few hours later she calls, and I answer \"hi ma'am, unfortunately I wasn't able to find the light bar, let me speak to my boss (45m), who sold you the machine and I'll find out if he put it somewhere special for you\". This of course didn't sit well with the woman and she started making threats about lawyers. I put her on speaker for another boss and the secretary to hear both sides so that there could be no accusations or issues. We decided that I'd speak to my boss about a refund for the lights instead. However upon hanging up I remembered I had previously done inventory on small whole goods and it may be on that list with a location. Thankfully it was. I found it and called her back but got no answer. \n\n3 minutes later my boss (45m) calls. I answer the phone and he begins by saying \"I got a call from a Mrs.____, who says she hasn't got her light bar she bought from there LAST YEAR!\" I say \"yeah I actually just found one, I tried calling back but got no answer, she's being a bit of a c***, but I put her on speaker for others to listen and remained professional\" he says \"well she has been perfectly nice to me and YOU DO REALIZE SHE HAS HAD TO GO TO ANOTHER DEALER TO GET STUFF BECAUSE SHE CANT GET IT FROM US\" I respond \"yes, but you realize this wasn't my sale right? It was yours, you sold it to them\". This of course makes him even more irate and he yells loud enough for his brother and the secretary to hear thru the phone \"DONT START YOUR FUCKING SHIT WITH ME DONT START BEING RUDE DO NOT MAKE ME COME UP THERE!!\" to which I respond \"Well I mean.. come up here (insert name of 45m), but I didn't even do anything..\" he screams \"OKAY!\" and proceeds to hang up on me. \n\n15 minutes later he comes FLYING into the parking lot in his company truck, jumps out with his chest puffed out, fists clenched and teeth gritting together - ready to physically fight it appears. He BURSTS through the showroom door and in doing so nudges the Christmas tree and decides to go ahead and punch it over, then gets in my face screaming \"YOU WANTED ME UP HERE? NOW HERE I FUCKING AM!\" I said \"(45m name) what?? I didn't even do anything!\" He screams \"YOU GET YOUR GOD DAMN ASS INTO THE OFFICE IN HERE RIGHT FUCKING NOW\". Of course after the violent outburst, I'm not about to go ANYWHERE alone with this man so I say \"what? No! Why?\" He yells \"BECAUSE IM YOUR FUCKING BOSS AND YOU DO WHAT I GOD DAMN TELL YOU TO DO!!\" Being scared to death at what this man will do, again I said \"NO! I am NOT doing that!\", keep in mind, my 7y/o son is hearing ALL of this, along with his brother, the secretary and customers at the parts counter just outside the showroom. He then proceeds to walk aggressively toward me again, getting in my face and screaming \"IVE HAD E FUCKING NOUGH OF YOUR GOD DAMN BULL SHIT, YOU WILL DO WHAT I TELL YOU TO DO\" I respond \"NO, (45m name) I didn't even do anything, this was your sale, how was I supposed to even know she needed a light..\" before I can finish he continues screaming profanities and insults, all the while his younger brother just stands there with his head down allowing the violent interaction to continue. The secretary has left the room scared and uncomfortable and my son is nearby at the parts counter. My 45m boss then continues screaming saying something about how I'm fired, I better be getting my shit and leaving (which I do, although his father, the owner, later rescinds because the son does not have this authority, especially when the father realized how bad this was and how wrong his son was). As I'm gathering my things he starts screaming again saying something along the lines of \"99% OF THE TIME WHEN I GET THESE CALLS IT IS YOUR SALE AND YOU DID FUCK SOMETHING UP\" I respond with \"(45m name) that's not true! My customers don't even know you, IF they ever had a complaint they'd call up HERE and speak to your father!\" His response seems to be an attempt to cover his a** when he says \"WHEN I FUCKING TELL YOU TO SHUT UP AND LET ME TALK, THATS WHAT YOU DO! WHEN I CALLED YOU GOT SMART ASS AND DECIDED TO SAY \"HA FUCK YOU GO AHEAD AND COME UP HERE!\" to which I responded \"THATS A LIE! YOUR OWN BROTHER AND SECRETARY HEARD THE WHOLE DAMN THING!\" He says \"WHATEVER, FUCK YOU. I SAID GET YOUR SHIT AND GET OUT\". So I yell for my son to come on, and we leave. \n\nThis family has ALWAYS been good to me. The father is an older, very wonderful man, the younger brother is the same, they are both family men and love their wives and children more than I think I've ever seen. Even 45m is generally a pretty good man, has loaned me money, let me borrow his farm truck to haul things, etc. I do not want to cause them ANY legal harm. However, I do need to do something. I need to feel safe working there and I currently do not. I had to work a few hours Saturday and spent the whole time panicking about whether he would show up being crazy for something again. I should add, this is NOT the first time he has had violent outbursts, its just the first time he has actually come at me aggressively, the man literally \"flinched\" on me twice as if he would hit me. Previously he has kicked a hole in my office door while screaming at me over selling a tractor at a price his father set because he intended to sell it for more and personally profit. As I said, I don't want to cause them any legal harm, I'm not even sure I could, but I do know that I want something SERIOUS done this time,  dealing with these violent outbursts is NOT okay, especially when he acts as though he is going to hit me. If something isn't done about it, I guess I'll explore legal options, but I'd prefer to keep my job and find some sort of solution. \n\nAny thoughts or advice?",
    "title": "How do I deal with my violent boss?",
    "subreddit": "careerguidance",
    "timestamp": 1672637109,
    "score": 4,
    "keyword": "woman lawyer"
  },
  {
    "text": "Grieving 3L with no motivation I got some news last month that a very close college friend had been murdered by her partner. We were very close and ultimately fell out due to a disagreement about her partner. He was way older (~ 20 yrs older) and always saying things that made her feel bad about her self, but he bought her whatever she wanted so she dropped out of school moved in with with. \n\nI want to do criminal law, so the first thing I did when I got the news was read the indictment and some articles. He shot her in cold blood 6 times. I’ve been messed up about it ever since and it’s been impacting my productivity. She was like a sister to me and now all I have it the Snapchat memories that pop up every day it seems. Idk, I’m just sad and it was so traumatic. She didn’t deserve that, no one does. Just got word today that he hired a woman lawyer and was going to trial. It made me ill because I already knew the argument. “This young woman was lost with an extensive history of mental health issues…” I was holding out hope that he would take a plea deal and spare her family, but looks like he’s taking the self defense route. Unfortunately, but as expected, it’ll be a while before trial. \n\nSince then, I’ve struggled to read for class and finish assignments. Every time I try to be productive, she comes to mind. I think about all the things she’ll never get to experience and how I wish she would’ve listened to me years ago. Any advice?? Should I just not be as thorough on notes and focus on graduation??",
    "title": "Grieving 3L with no motivation",
    "subreddit": "LawSchool",
    "timestamp": 1697042222,
    "score": 101,
    "keyword": "woman lawyer"
  },
  {
    "text": "Some tips for aspiring stay-at-home wives I know that the two ppl in this video are white but the woman is a marriage and family lawyer and I’ve had black women friends get married and fall into this trap of not working and getting stuck in a bad marriage. I think they could’ve benefited from this advice. One woman had actually been holding her husband down through his SoundCloud rapper career and the minute he started making $125k, he told her she didn’t have to work, she stopped and a year later, he started being abusive, cheating, spending their money on other women and himself. Another friend has not had any problems yet but she just married a man who makes $80k as a paralegal and she thinks that’s going to be enough to sustain the both of them and her child while she just takes dance classes. I just don’t see that in this economy but go for it. She did kinda get stuck like this in her first marriage. Her ex made her quit college to take care of his girlfriend’s child. Just have a plan.\n\nBasically, the lawyer recommends a prenup or a way to save alimony while you’re married. I personally think it’s a good idea to find a passive form of income if you want to be a stay-at-home wife/mom.",
    "title": "Some tips for aspiring stay-at-home wives",
    "subreddit": "blackladies",
    "timestamp": 1703214983,
    "score": 340,
    "keyword": "woman lawyer"
  },
  {
    "text": "A History Of Black Women Lawyers: In Books (Part One)...",
    "title": "A History Of Black Women Lawyers: In Books (Part One)...",
    "subreddit": "blackladies",
    "timestamp": 1678394474,
    "score": 49,
    "keyword": "woman lawyer"
  },
  {
    "text": "Black lady lawyers I got a question in regards to law school admissions I’ve been debating for a year now in regards to what my personal statement should be about. I’m a first generation daughter to Caribbean parents whose incredibly proud of her heritage. I’m uncertain on whether to write a sad statement that discusses the adversity I’ve faced in the privileged spaces my parent’s hard work allowed me to access. Or a happy statement discussing the community that raised me, my pride in being Trini, and how I want to be a lawyer to protect that community. \n\nNow that affirmative action is basically over I feel like I have to write a sad statement that details the reason I- a black woman deserve a space in a law school that could go to a rich white person instead. I feel like I have to write about adversity and racism. Any advice?\n\nEditing to say thank you so much for all the help! I didn’t expect to get as much advice as I did. Seeing comments from all you amazing Black lady lawyers gave me so much confidence and inspiration. Thanks for making this prospective law student’s week!",
    "title": "Black lady lawyers I got a question in regards to law school admissions",
    "subreddit": "blackladies",
    "timestamp": 1694096834,
    "score": 26,
    "keyword": "woman lawyer"
  },
  {
    "text": "Black people and forgiveness: my mom told me I can’t forgive My dad used to treat my mom really badly and my mom would often come to me for emotional support. When I asked her why she stayed with him, she’d say “Because I can forgive! You can’t forgive!” \n\n\n-He cheated on her at least 5 times unabashedly and unapologetically.\n-He put her in a chokehold when she confronted him about his cheating.\n-He started a business in her name to get minority business grants and ran that business into the ground (my mom was black; my dad is white).\n-He’s voted for Trump.\n-He picked fights with her on the way to Christmas and Thanksgiving dinners to make her look like the angry black woman.\n\nBut something is wrong with me because I ask her why she continued to allow herself to suffer? I see other women who’ve been treated like this or sometimes not even 1/4 as bad as this get divorced and I realize this is not normal. I just don’t understand.\n\nAnd now that my mom is dead, my dad has been using all the energy he used to abuse her to abuse me, usually financially.\n\n-He found out I inherited some of my mom’s pension (not because I told him but because he could tell through the type of envelope I got in the mail). He asked me how much I got, I told him I didn’t know, he told me I was lying and I showed him the letter that had no specified amount. He went to the pension office to see how much I was getting and they told him it was confidential so he asked his sister to go through my mom’s mail to figure it out.\n-when he found out how much I was getting, he told me how much and told me i could buy a car. I told him I already had a car and he said “That’s my car.” He said my mom’s car belonged to him and I could buy it from him (even though he had a car and I used her car to take her to appointments)\n-He told me I needed to “hurry up and get well” so I could “help out around the house” after I broke my ankle only a month after my mom’s death.\n-he kicked me out of the ICU because I was crying when the doctors told us there was nothing else they could do.\n-Any time I got any money from any kind of inheritance from my mom or from my wages at work, he wanted me to give that money even though his costs were low since my mom paid off the mortgage largely without him.\n-He threatened to have me evicted essentially kicking me out in the middle of the pandemic.\n\n I went no contact with him back in 2020. I decided I had had enough of his bullshit and my life was a lot better after that.\n\nHowever, when he finally was able to sell the house he owned with my mother, he, my brother and their real estate lawyer tried to get me to sign a Quit Claim Deed (QCD) to give my interest in the house over to my dad in exchange for way less what I would’ve gotten as a seller (my parents owned the house 50/50. So because my mom died and she only had two children and no will; I owned half of 50% which was 25%. My dad wanted me to sign in exchange for 5% of the proceeds as opposed to the 25% I would’ve gotten as a seller). \n\nI did not sign and was part of the process as a seller but at closing, my brother yelled at me basically implying I didn’t deserve anything. Since my mom has died, he’s taken my dad side when it comes to matters of emotionally and financially abusing me. When I try to remind him of the things our dad has done, he’s like “Oh yeah…That did happen.” During this argument, I told my brother that he chooses to forget the bad things our dad did. He says “I don’t forget, but I forgive.”\n\nIt feels like the black people in my family keep telling me I don’t forgive but the way I see it is they’re angry at me for not accepting my dad’s abuse.\n\nAnd my brother really does seem just delusional when it comes to my dad. He said “Dad wants the best for you. You’d know this if you just talked to him.” But if you look at the situation logically, my dad has shown that he does not give a shit about me. Nothing I tell my brother will change his mind. And it feels like he wanted to punish me for trying to break free from my dad.\n\nHave you experienced anything like this in your family? Why is the expectation of forgiveness pushed on or by black people? I feel like white men don’t deserve anymore forgiveness from black ppl. And I feel like black ppl in my family use the concept of forgiveness in such a toxic way.",
    "title": "Black people and forgiveness: my mom told me I can’t forgive",
    "subreddit": "blackladies",
    "timestamp": 1699841891,
    "score": 23,
    "keyword": "woman lawyer"
  },
  {
    "text": "Law firm undermining Black & other POC academics and journalists exposed - what can be done though? [https://thisisthesqueeze.substack.com/p/pulling-back-the-curtain-on-prxs](https://thisisthesqueeze.substack.com/p/pulling-back-the-curtain-on-prxs)\n\nIt's well known how few women of color especially are allowed to thrive in academia, journalism, law, careers with prestige or power. Hardly ever do we hear the behind the curtain stuff of how people are discarded, careers deaded, livelihoods stripped away though, and I think this is really critical to widely understand. It makes me want to scream reading this (like the author says, and she's surprisingly a WW), but I don't know what can be done and thought I'd search for collective action ideas. Anyone have suggestions or insights? \n\nIt's at least satisfying as a really scathing takedown. This Boston law firm, Prince Lobel, helped a podcast company, PRX's white women management whitewash its driving out Black women journalists, helped a university justify unprecedented attacks on its Africana Studies department, and has a First Amendment group led by an anti-Critical Race Theory scholar. Some excerpts-\n\n\"Of course, I realize that this pattern, in which law firms descend upon media companies to [defend against allegations of racism and/or sexism](https://www.wnyc.org/story/investigation-harassment-nypr-finds/?utm_source=tw&utm_medium=spredfast&utm_content=sf87544532&utm_term=wnyc&sf87544532=1), [weaken their unions](https://www.thedailybeast.com/ny-times-lawyers-accidentally-send-private-strategy-memo-to-staff-union), [quell labor complaints](https://twitter.com/mplaceunion/status/1575600155427975168), etc., is common and outcomes are often predictable.\"\n\n\"Not only are Prince Lobel partners overwhelmingly non-Black (and mostly white), but all Black partners at the firm are men. **There is not a single woman of color, who is also a partner, working at Prince Lobel today**.\"\n\n\"So PRX hired Prince Lobel, a firm with only one WOC partner in the entire firm at the time, to lead an investigation into a Black woman’s claims that she was one of multiple Black women who had left an organization due to systemic racism. This feels preposterous — like a joke, or as a former PRX employee put it to me months ago, a farce.\"",
    "title": "Law firm undermining Black & other POC academics and journalists exposed - what can be done though?",
    "subreddit": "blackladies",
    "timestamp": 1675732756,
    "score": 10,
    "keyword": "woman lawyer"
  },
  {
    "text": "I was falsely accused of SA and Assault a year ago. Last week I had my trial and walked out a free man. Posting from my main account because I don't care. I need to get this off my chest to atleast somebody.\n\nIn 2021 I began seeing a girl we will call Stacy. Everything was fine in our relationship, almost too good until an ex i had a bad break up with because I was an alcoholic at the time got involved and told her things I allegedly did to her. Stacy and i  talked it out and everything seemed fine. Fast forward to the next week, we just finished having sex and we begin play fighting. It devolved into us just slapping each other in the legs but what I didn't know at the time is that Elhers Danlos (sp?) would cause her to have a severe reaction days later In the form of bruises. Stacy told a few people including my ex that I \"did that\" to her even though it was 200 percent consensual and no ill will was intended. I even have a Screen cap of her saying \"it's okay babe we were just play fighting!\" After she sent me photos of her legs and insisted \"I like olay fighting with you\"  obviously her spelling mistake was meant to say \"play\".\n\nFast forward a few more weeks shes decides to go to bed early but says \"wake me up with your cock if you feel like it\" so after a few hours and a \"hell yeah brother\" had passed and i was ready to hit the hay i did exactly that. She was into it. I was into it. Once done we fell back asleep. She commemted it was exactly how she wanted to be woken up. She sent me several texts in the past too saying similar things. Thank god i saved them all. \n\nNow a few more weeks later, I pick her up from work and she straight up asked me if she could fuck her same sex friend. I was appalled and disgusted and felt like our relationship meant nothing  to her anymore. This is where our relationship became toxic and she turned me into an angry jealous monster and for some reason wondered why I didn't like her friend very much. \n\nNow for the juice. \nIn early 2022 we were off and on again every other week it seemed and the thought of her with someone else drove me crazy. I went off my meds (gabapentin, clonzepham, latuda, mitazipine, Vyvanse) and spent days wide awake, got fired from my job and was at my wits end. I then tried to end my own life after Stacy said in text she was gonna go \"spend the night with someone else\" while i was in the middle of a emotional meltdown. That someone else was her ex. I woke up in the hospital the next day hooked up to several machines and one hell of a sore throat from getting my stomach pumped. I spent a few days in the hospital while I'm sure she was having a great time with her ex.\n\nWe tried talking it out over the next few weeks but one morning I caught Stacy red handed talking to my ex about me. I immediately asked her what she was talking about and to show me. She said no and I told her to leave. She initially refused until i threatened to start tossing her property off my one story deck. She didnt take me seriously until i grabbed her bag and tossed into the snowbank below. I then grabbed several items incluiding a coffee cup, clothing and amything else that is hers including and unfortunately food. I was completely manic at the time and didn't have a single brain cell left. One of the items i tossed down was a container of yogurt which didnt directly hit her however the weak little plastic container immediately busted open on impact like a baby yogurt bomb and she got some on her jacket allegedly. \n\nFast forward a few days later and Stacy is STILL sending me mixed signals about our relationship and really playing with my love. Stacy  then filed a restraining order against me without notice. She continued the conversation with me 5 days after she got the order. It was valentines day so I gave her the ultimatum finally,  be with me or I'll be with someone else tonight. She called me briefly and she asked what i meant and i said exactly what i said. She told me to \"work on myself more and maybe\". I wasnt having any of that so i went out with a girl I had matched with on Tinder earlier that day to begin the getting over it part.\n\nTwo days later i hear a knock at my door.l I had 8 cops knock on my door and place me under arrest for assault causing bodily harm (the leg photos), harassment (calling and texting repeatedly), violating the restraining order that was in place(that I had no idea existed) I was brought to the police station first, I tried explaining my side of the story and even offered evidence in the form of the texts about the \"assault\" and give full detail, the police officer told me to \"shut the fuck up woman beater\" the cop and I then got into a childish back and forth before finally I was brought to the station. I maintained my right to remain silent once at the station, called a lawyer from the telephone book then transported to another area. As it was winter I wearing a winter jacket. I took my jacket off and stuck the sleeve through the top of door then then around the corner of the door, tied both arms together to make as effective of as noose as possible because I was tapping out. I didn't belong there. Obviously this got caught on camera and my cell got rushed by officers who used what I believe to be excessive force by slamming neck first into the bench behind me not only causing me to hit my head really hard but also could've obliterated my neck. Luckily for me I guess I've drank my milk.\n\nI get held overnight for my court appearance in the AM and get 1000 no cash bond (meaning I don't pay it unless I fuck up again). I'm then under the impression I'll be good to go home soon. Nope. Apparently after I left the judge didn't realize I violated a restraining order and sent me to jail for 4 of the longest days of my life. In a suicide blanket. Locked up. Did nothing wrong. My 4 days in jail could be a whole other post but anyway, I got out.\n\nI go down the straight and narrow and keep my nose clean and that's when Stacy contacts me. St Paddy's day. She got drunk, called me, offered to uber to see me and she did. It was a dumb call on my end but i just missed her and loved her so much at the time. She comes over at like 5am and she immediately \"lets just pretend its like old times\" and we did for 2 days when she stayed with me. She told me she told police what she did because she just wanted a break and \"didnt think theyd take it this seriously\" . When it was time for her to go she said \"call me later, love you\" and I left back home. Couple hours later I get a knock on my door from police again. Apparently she ratted herself out to police prompting a warning. It was clear to me she was as good for me as Flint water and that was the last time we spoke. \n\nAt my first court appearance a week or two later I was tapped on the shoulder by a detective and asked to speak with me outside. He identified himself and told me he's working with Stacy and that I should be \"hearing from him soon\", knows we've seen/spoken with each other and he expects \"more charges\".\nHe calls me a couple days later and schedules a day for an \"intervirew\". My lawyer told me he would likely be arresting me for something else but i had no fucking clue what. But he told me to keep my composure and most importantly, Shut. Up. I go for the interview and you guessed it. I'm immediately placed under arrest. I wasnt handcuffed or anything but thats when he told me im being placed under arrest for SA and another assault. Contrary to my lawyers advice I fucking lose it on the cop and tell him the story and facts, again offer to show him texts, screenshots etc. He doesnt care. When he alluded to the second assault charge I kept my mouth shut as I had no idea what he was talking about. He kept trying to pry at me and finally he asked \"did you throw yogurt at her?\". I laughed and said \"ok I think I'm done answering questions and I will wait for disclosure from my lawyer\". The cop got curt and ended the interview and I was free to go. \n\nI then had to sit and wait for a year and a half for my court date. In that time Stacy took to social media to \"cancel me\", claiming I'm a \"violent person with violent tendencies\" or something to that effect, posting photos of me along with my full name and left me a loner for the last 8 months because everyone I know hates me over her social media post which garnered alot of attention because I had ALOT of friends, especially in the local music scene and hospitality industry. I became withdrawn from society, I thankfully acquired a girlfriend prior to the grand cancelation whom I'm still with and supported me through it all as best she could. Unfortunately the idea of hitting Stacy with a cease and desist didn't happen until the post was already screen capped and shared among other people. She complied but it had gotten out of control by the time i got my lawyer on it. I was being publically shamed because someone got yogurt on their jacket In an unideal situation for both parties. I almost died and she got to go fuck her ex over it. \n\nSeems fair. \n\nAbout a month ago my lawyer gave me two options go to trial (20K  including the fees I've already paid him) or B) I plead guilty to one count of assault (the fucking yogurt) It took me a few days but I decided to opt for the latter only because I know our justice system is fucked and fighting ALL charges VS Taking the hit on one and getting discharged from my record after 2 years would is a MUCH safer bet. So I did exactly that. Unfortunately I have to report to a probation officer once a month now but other than that I am finally free of her and the pain she has caused me. \n\nThis week I've decided I'm going to be happy. I bought lots of music recording equipment. Some games I've been dying to play. I don't know if I should publically address my friends on my currently deactivated social media accounts explaining my side of the story. I went to the grocery store without a facemask, tattoos out and hatless and it felt liberating. Like I was finally back in control of my life. \n\nAnd this my friends is why you never stick your dick in crazy. Thanks for reading if you did.",
    "title": "I was falsely accused of SA and Assault a year ago. Last week I had my trial and walked out a free man.",
    "subreddit": "MensRights",
    "timestamp": 1687223459,
    "score": 885,
    "keyword": "woman lawyer"
  },
  {
    "text": "Family court is absolutely stacked against men. A personal story. When I was 19 years old I made the mistake of marrying the wrong woman. Soon after getting married she was pregnant and gave birth to our son. Shortly after we divorced. The reason for the divorce was that she needed her independence. Apparently financially providing for somebody for multiple years while expecting absolutely nothing of them is abusive. But all that's for different sub. The divorce was uncontested, and rather amicable. Despite her cooperation, the squadron of lawyers and many hours of filings and paperwork I came out of court with a verdict that was, at best, tolerable. Now you might be wondering why we even went to court if we agreed so much on the divorce. That's because in the state of Georgia if a married couple has a child they must go to court to get a divorce and there must be a child custody plan on court order. And there must be an order for child support. \n\nDespite the fact that I raised my son from infancy by working night shifts, and my ex-wife both wanted nothing to do with the child nor did she help in any way, the best I got from the court was joint 50/50 custody. The caveat to that was even with joint custody one parent is awarded the title of primary, and the non-primary parent had to pay the primary parent child support. By default and impossibly to change my ex-wife was awarded primary. Even though I had paid for her to start her own company that did not pull in any revenue, since she had no income, my monthly child support payment was set at $1,000.\n\nYears pass and everything is fine. I pay my child support on time. I see my kid every other week for a full week. Eventually I remarry. With much more experience and dating and partnerships, I actually found myself in the company of a fantastic woman. She had been raped a little over a year ago and decide to keep the child, so when I married her I formerly adopted her 6-month-old son. Everything was going well, my new wife was even expecting a new baby. I was excited to finally have a second chance at a proper family. And then, as life likes to do, shit hit the fan. In September of last year, my colon ruptured. This led to immediate surgery, where they remove all your organs clean as much of the shit out of your body cavity as they can and put your organs back. I was in an ostomy bag though it was expected to be reversed in the coming months. I suffered multiple infections and follow up surgeries. During this time my very pregnant wife ended up falling down a single stair and breaking her foot. With both of us being varying levels of medically compromised, we made the difficult decision to place her son with her mother and my son with my father until we both recovered.\n\nDuring this time, CPS was called to our house, the accusation being that my home was uninhabitable due to the mess that had accumulated. And while it is true that my home was unfit for children, we had already come to that conclusion and removed the children from the home. Upon informing CPS of this, they immediately dropped the case. Because of the amicable nature and cooperation after our divorce, I didn't think my ex-wife was the one who called, however, given my mother was already suing me for grandparents rights, I was pretty confident and it took very little persuading by my ex-wife that my mother was the one who made call.\n\nDecember ends and I have my final surgery. My bowel is reconstructed, I no longer shit in the bag, my wife's foot is healed and I'm ready to return to work. However, FMLA only protects your job for measly 12 weeks. So I returned to work to find that I was not employed. Scrambling, I used my networking to get a job as quick as possible, however this job was out of state. Not far, in North Carolina about 3 hours away. But obviously I would have to move to work there. I take the job pack up the wife and kids , and move up there. I didn't have time to sell the house so I rented it at cost for my mortgage, and we rented a new house near my new job. Everything was going well and spring break was approaching. I had made new agreements with my ex-wife in terms of time with my son. This new agreement fell well within the confines of our previous court order for custody. Instead of the whole week every other week I would simply come down on weekends and hang out with my son at my dad's place. And then I would have him for spring break and summer break. I intended, since my ex-wife was now a teacher, to renegotiate custody to where I keep him full time in North Carolina and she has him over the summer and all weekends. If you do the math on that she'd have more actual time with him but it would prevent him from having to go to daycare as my wife is a stay-at-home wife. Spring break comes and goes, my son and I have a great time and I even bought him a tortoise. But this is where the trouble begins.\n\nOn the last few days of spring break, my ex-wife asks if she can have my son early to take him to her mother's musical performance. I personally don't believe my 5-year-old son would enjoy listening to a sultry old fart play the piano for a couple hours, but like a good parent I ask him what he would prefer. He declines to go with my ex and instead wants to spend his last day with me. The next day my wife comes and collects him and they go back down to Georgia.\n\nMy next weekend is coming up and I'm coordinating with my ex to pick up my son. She informs me that because I have not yet paid child support, she's not going to allow me to see him. Even if I hadn't paid child support, you can't withhold court ordered visitation for any reason. The Idiocracy of her statement is the fact that I hadn't yet paid child support for the month that we were currently in. I had until the end of the month to pay it and as the end of the month was my next paycheck that's when I told her I would. This went on for the next couple of months, her using the same excuse, and me not getting to see my son. My only reprieve is that the court order states that I have the right to call my son and speak to him on the phone at any reasonable hour. So at least I still got to hear from him. That is until the summer was coming up. I finally had the funds to start paying child support in advance to get rid of her stupid excuse, I had done so and texted her to request my son that weekend and coordinate summer drop off. This is when she informs me that she will no longer be abiding by that agreement and I will not be seeing my son for the foreseeable future.\n\n\nMy only recourse to this is to go to the court and file a motion for contempt of court where they can give her a court order to obey the court order that she's already not obeying. Wow. Of course this costs money, you need a lawyer and a hearing. But it's my only recourse and so I was preparing to do so. However, before I got the chance CPS was once again called to my household. However, my ex-wife was the only person who knew my new address. This made me realize that it was My ex who was calling CPS the entire time. CPS again came and went finding nothing wrong. But now I was livid. As I squared up to start my motion with the court I had another bomb dropped on me. My ex would no longer answer any of my phone calls and I could not speak to my son. And then, as icing on the shit cake, I got slapped with a temporary restraining order. The charge? Harassment. My crime? Calling and texting her every day.\n\n\nThere were a couple legal issues with this TPO and it's the main purpose for my post here today. What I've gone through highlights the intrinsic bias of the system against men in particular fathers.\n\nTo start, the TPO was signed and issued in Walton county, Georgia. I live in and had at no point left North Carolina. I was not subject to the jurisdiction of Walton county. The TPO was erroneously written from the first page. Section two of the TPO literally outlines jurisdiction in which you have to sign an affidavit stating that I live in \"blank address, Walton county.\"  To which they wrote that I lived in 123 fake road name, city, North Carolina, Walton county, Georgia.\n\nMy petitions for a change of venue due to the lack of jurisdiction were summary dismissed. I then asked for a dismissal based on the grounds that the alleged crime violated a pre-existing court order stating I had the right to do what I did. Again, rejected. Unfortunately, my wife was coming to the end of a very complicated pregnancy and was scheduled for a 39 week induction. This cannot be moved up for the baby's health and it cannot be delayed for my wife's health. Her induction is the same date as my court date. As much as I did not want to prolong my inability to contact my son, I motioned for an extension on the grounds that my wife would be giving birth that day. Again rejected. I figured the issue was the fact that I was trying to represent myself pro se in all these motions, so I scraped together enough cash to get a lawyer. She submitted everything I had mentioned above again. If all else failed I could at least have the lawyer go in on my behalf so that I could be with my wife during her labor. not only was all of it rejected, the lawyer informed me that she would not be allowed to represent me in this case and the judge told her that he \"better see my ass on that bench the day of court.\" \n\nDid I mention that the district attorney for Walton county is the one who filled out the civil TPO petition? Because guess who was representing my ex-wife at my court date. I then proceeded to get absolutely railroaded in this hearing. Not only did they decide to enforce the TPO preventing me from contacting my ex-wife or child. The judge went beyond the scope of the hearing to amend my custody agreement to in I have no visitation rights whatsoever.\n\nSo now I have a son that I never get to see,and  a woman I have to pay $1,000 a month to for the privilege. And no prospects for changing the situation.",
    "title": "Family court is absolutely stacked against men. A personal story.",
    "subreddit": "MensRights",
    "timestamp": 1684513792,
    "score": 721,
    "keyword": "woman lawyer"
  },
  {
    "text": "Supreme Court Sides With Woman After DNA Test Shows Husband Isn't Father Here is the full link : [https://www.ntv.com.tr/turkiye/yargitaydan-emsal-karar-10-yil-sonra-cocugu-olan-adam-dna-testiyle-gercegi-ogrendi,jvWtgqaJx0iP4TRG\\_72OyA](https://www.ntv.com.tr/turkiye/yargitaydan-emsal-karar-10-yil-sonra-cocugu-olan-adam-dna-testiyle-gercegi-ogrendi,jvWtgqaJx0iP4TRG_72OyA)\n\nMustafa Y., who lived in Taşkent district of Konya, Türkiye married A.Y. (38), through an arranged marriage in 2005. Before getting married, Mustafa Y. had a health issue and underwent a surgery that doctors told him was necessary but could make him unable to have children.\n\nMustafa Y. and A.Y. did not have a child for 10 years. He started an herbal medicine treatment that he saw on TV. During this time, his wife A.Y. said she was pregnant. Mustafa Y. was very happy to have a child and even bought a  car on loan for his wife's comfort during pregnancy. A.Y. gave birth to a girl in a private hospital in July 2015 after the pregnancy period.\n\nLater, the arguing couple decided to divorce. When A.Y. filed for divorce, Mustafa Y., on the advice of his lawyer, asked for a DNA test for the child, saying he couldn't be the father due to his health issues. The DNA test and forensic report in September 2019 showed he was not the father. In January 2020, Mustafa Y. filed for divorce and cancellation of paternity.\n\nThe lawsuits were combined. The court granted divorce but ordered A.Y. to pay 40,000 TL in material and moral damages to Mustafa Y. A.Y. The appellate court canceled the compensation order but  ordered Mustafa Y. to pay A.Y. monthly interim alimony of 400 TL until divorce finalization, and a one-time poverty alimony of 12,000 TL in favor of the woman.\n\nMustafa Y. appealed this decision to the Supreme Court. The Supreme Court reversed the lower court's decision, saying Mustafa Y.'s  adultery-based divorce lawsuit  was filed outside the 5-year statute of limitations, so the woman cannot be found at fault for adultery. Considering the case file, the man could not prove any other faulty behavior by the woman, so she should have been awarded appropriate material and moral damages, which the lower court failed to do.\n\nMustafa Y. said that he suffered trauma when he learned the child was not his. \"I had a stroke. I was in the ICU  for 20 days during the  pandemic period. During this time, doctors told my relatives that I only  had a 20% chance of surviving. After getting  out of the ICU, I couldn't speak for a while, and I still have weakness  in my right hand. This has become permanent after the illness.\" This incident caused him  about 1 million lira in financial loss. \"I still can't accept this, I can't sleep at nights. I don't know at all who the father of the child  is, but I'm curious. Let this person come forward and serve the  punishment for the torment they have caused me. They can't restore my  health but they should face the consequences.\"\n\n&#x200B;\n\n&#x200B;",
    "title": "Supreme Court Sides With Woman After DNA Test Shows Husband Isn't Father",
    "subreddit": "MensRights",
    "timestamp": 1689433562,
    "score": 413,
    "keyword": "woman lawyer"
  },
  {
    "text": "Debunking the myth that women cheat because they \"weren't feeling loved\" or because he's a \"bad boyfriend\". This is a big myth that many people promote, including feminists. If a man cheats, he's a shitty person and a womanizer, but if a woman cheats, she wasn't feeling loved and was dealing with a bad relationship.\n\n[Contrary to popular belief](https://www.researchgate.net/publication/265950325_The_Opposite_of_the_Double_Standard_Gender_Marriage_and_Adultery_Prosecution_in_Late_Medieval_France), society never had a double standard giving male cheaters a pass. In fact, historically, they punished them just as often, if not more than female cheaters. [You also weren't historically allowed to kill your cheating wife](https://www.jstor.org/stable/24771507#metadata_info_tab_contents), and if you were, you had to catch them right in the act, react in a fit of passion right away and kill even the cuckolder. You could never kill only her or kill her premeditatedly. Many societies didn't allow you to kill her, period, even if you killed the cuckolder.\n\n[A lot](https://www.psychologytoday.com/us/blog/after-service/201910/are-women-and-men-more-likely-punish-male-cheaters) [of evidence](https://www.americansurveycenter.org/a-moral-double-standard-on-marital-infidelity/) has shown people are more lenient towards female cheaters. Many people believe she wasn't feeling loved or he must've been a bad boyfriend. Some surveys show this is the case, but this is often self-report and many women could experience a social desirability bias. They often could lie to get sympathy. Also, many women might feel their reason has to be an emotional reason so they aren't a \"whore\". [According to the New York Times](https://www.nytimes.com/1997/10/12/magazine/adultery-s-double-standard.html), Eleanor Alter, a prominent New York divorce lawyer, says of her 30 years' worth of clients: ''Women are more likely to use the word love to justify adultery to themselves. You have to be in love. Otherwise you're a whore.'' Raoul Felder, another prominent divorce lawyer, says after 39 years of watching people who have committed adultery: ''**Women are motivated by the same forces as men** \\-- loneliness, hostility, boredom, the need to feel younger and attractive, the need to be worshiped.''\n\nThis one [study](https://www.dailymail.co.uk/sciencetech/article-11417879/amp/Affairs-boost-self-esteem-life-satisfaction-youre-woman.html) found that women who cheat have a boost in self esteem after cheating but men who cheat feel worse after cheating. They concluded it could be because women who cheat felt dissatisfied with the relationship. It sound that couples who cheat usually had more relationship conflict as the relationship went by, but it didn't clarify who was causing the conflict, which could've been the cheater. The reason why women had an ego boost after cheating was probably because studies show women are more likely than men to be sexually bored after a while in a relationship, not because \"men bad at sex\", but because women crave novelty and usually need to have sperms from multiple men in case they're with one who has bad quality for offspring. Because women eventually get bored more than men being with the same person whereas society is harsh towards male cheaters, that's why women become better in self-esteem after cheating but men become less so. It's not because women were dealing with bad boyfriends. One 2011 [study](https://kinseyinstitute.org/pdf/Infidelity%20in%20hetero%20couples.pdf) found that women who were dissatisfied were more likely to cheat, but aside from possible social desirability bias, they found this was more true for male cheaters, but swept that under the rug.\n\nIn fact, many relationship experts will say that many cheaters still love their significant other and aren't always dissatisfied with the relationship. They aren't usually sexually dissatisfied either, maybe sexually bored but not sexually dissatisfied. [In fact](https://andreameltzer.com/wp-content/uploads/2019/09/JPSP-2018-McNulty-et-al..pdf), the most sexually satisfied couples cheat the most, and they then found that marital satisfaction was positively associated with infidelity among women (although marginally), but negatively associated with infidelity among men.\n\n**The conclusion is:** many people actually have a double standard favoring female cheaters. People never really had a double standard favoring male cheaters and viewed them as disloyal cads. Women and men cheat for similar reasons. Although some might feel a lack of love in the relationship or dissatisfied, they usually both cheat due to loneliness (which can happen in satisfactory relationships), boredom, hostility, the need to feel worshipped, craving novelty, or to feel young or attractive. Women usually will say they cheated to feel loved or due to a bad boyfriend to feel less like a \"whore\" or to get sympathy from society. People just think women cannot be antagonists and can only be victims, and people tend to view male cheating victims are unmanly, so people tend to defend female cheaters over male cheaters.",
    "title": "Debunking the myth that women cheat because they \"weren't feeling loved\" or because he's a \"bad boyfriend\".",
    "subreddit": "MensRights",
    "timestamp": 1678740854,
    "score": 271,
    "keyword": "woman lawyer"
  },
  {
    "text": "This is why you should pull your phone out and start recording when your woman goes off or might go off. Wish I had this advice 10 years ago. If I had had my phone out recording my ex wife when she went Full Metal Jacket, it would have saved me more than 10K (US dollars) in lawyers, 30K+ in alimony, possibly 50K+ in child support (we have 50/50 custody) and all the reputation damage I took from her total fabrications. Luckily her accusations were not DV. But she pulled that level of crazy out of nowhere and kept it away from other people, so no one believed the level of bat sh!t I was experiencing from her. The first video examples in the link is close to my experience. I did not seeing a whisper of it for our first 12 years so I wasn't thinking about recording.\n\nThe moment the tide started turning was when I actually DID have some video evidence I had documented of something (not an interaction). My lawyer told me it was pivotal.\n\nMen you will ALWAYS be wrong in a domestic violence call without crystal clear evidence to the contrary. You will ALWAYS be wrong in any Family Court dispute without indisputable evidence to defend yourself with. I am not exaggerating when I say men have have been stabbed by women, called the cops, and been the one arrested even though he never touched her and there is zero evidence he did, except for her Oscar Worthy Performance.\n\nI am glad I didn't call the cops the night my ex decided to clock me. I didn't have video evidence and might still be in jail if I had called. As my ex told a mutual friend later, \"I wasn't worried about it. They never arrest the women in those situations.\"\n\nIn a Family Court it is, 'pics or it didnt happen', for men. But if a woman cries hard enough, sometimes her word is enough to make a Family or Criminal Court believe her accusations against, \"that monster\".\n\nVideo is the best. Audio is better than nothing. Normalize whipping out that phone and starting to record a video when the crazy tsunami starts bearing down on your location. The first two examples in this video are really the best examples of how a woman can try the most outrageous things you never expected during drama. Be prepared.\n\nGet evidence. Then later, when you are safe at home and not being transported to the police station, you can think about what sort of red flags you missed with this crazy person so you don't make that mistake again.\n\n[https://youtu.be/2P9f4vycrHY](https://youtu.be/2P9f4vycrHY)",
    "title": "This is why you should pull your phone out and start recording when your woman goes off or might go off. Wish I had this advice 10 years ago.",
    "subreddit": "MensRights",
    "timestamp": 1680447504,
    "score": 248,
    "keyword": "woman lawyer"
  },
  {
    "text": "The Jonah hill controversy is a sign of the times As many of you know Jonah Hill was the most recent “metoo” target.\n\nTo sum it up. He dated a woman for roughly 6 months. Turns out he gave it a go but wasn’t into it. He sent her some texts saying he didn’t like her behavior and lifestyle choices. \n\nNamely around him feeling: \n\n-She posted photos that were too provocative on social media. \n\n-That she has inappropriate relationships with other men (no context here.) \n\n-That he didn’t like her hanging out with mentally unstable friends. \n\nThe relationship ended a year+ ago and the guy just had a kid with his new gf. \n\nDays after, his ex starting posting HUNDREDs of instagram stories of their private convos, claiming he’s a narcissistic abuser, and everything under the sun.\n\nCue the heroics. Yes, brave queen. I wonder what other innocent motivations she had? \n\nThese texts were pretty fucking polite if you ask me. Perhaps one of the mildest breakup exchanges I’ve seen. \n\nThe sign of the times is the definition of abuse, also namely, “narcissism” has lost all concrete meaning. \n\nThere is no longer “room” for disagreements, god forbid an argument less ye later be labeled a narcissistic abuser. \n\nThe new domestic violence industrial complex has muddied terminology so severely that anything can be labeled as abuse or narcissism. Why? $$$\n\nThe more victims the psychology industry creates, the more money and clients they get. The more they affirm the abuse to the patient the more they come to therapy. The more someone aggrandizes themselves as a victim the more “you’re a hero,” attention, followers, speaking engagements, clout, and book deals you get (cough, Amber Heard.) Don’t forget the lawyers cut and lawsuits from false accusers looking for a pay day. Or just plain making a false accusation to fuck someone over. \n\nNone the less, there used to be a sane world that allowed people, namely men, to be human beings. \n\nPeople used to have arguments. Disagreements. And yes, expectations and compromise in relationships. These are normal human behaviors. \n\nNow in the domestic violence industrial complex that we live in, all relationships must be sanitized and give no room for negative feelings or else you are truly a narcissist. \n\nThe irony is that Jonah hill had a amicable breakup with this woman a year ago. His sin? Citing to her why they were incompatible. \n\nHer response was to smear his reputation incessantly on the internet a year later days after his wife gave birth. Who really sounds like the narcissist?",
    "title": "The Jonah hill controversy is a sign of the times",
    "subreddit": "MensRights",
    "timestamp": 1689687853,
    "score": 223,
    "keyword": "woman lawyer"
  },
  {
    "text": "Feminist society pushes women into re-calibrating their past history into a #metoo moment There are countless examples that you can find out there on the internet, but I'll give only two infamously known incidents.\n\n&#x200B;\n\nIn August, 2023, after female Spanish football (\"soccer\") team won world cup against UK's national team, Luis Rubiales, the president of the governing body of football in Spain, gave a 1-sec fleeting celebratory kiss to female football player - Jenni Hermoso.\n\nShe didn't mind the kiss at the time, as was seen by her reaction 1hr after the \"incident\" [here](https://www.youtube.com/watch?v=4uz-HP2fvBI).\n\nHowever, due to how powerful feminism has become, and how many notable people reacted to it, Jenni Hermoso re-calibrated the event in her mind, and later perceived it as much worse than how she'd first perceived it initially. A term called \"light-switch effect\" was coined [here](https://www.reddit.com/r/TheRedPill/comments/4cax09/the_lightswitch_effect_why_women_rewrite_the/) to describe such behavior.\n\nA long time ago, when I was first reading posts in manosphere about women regretting their past consensual sexual encounter and #metoo'ing the men (which in this day and age is easy to do for a woman), I thought that was very rare, turns out it's not. Perhaps, due to women's brains being programmed since early childhood with feminist, misandrist #metoo ideology.\n\n&#x200B;\n\nAnother example, in January, 2023, in a small Tennessee town 5 police officers were fired after it was uncovered they had sex with a female colleague called Maegan Hall.\n\nThe reports didn't indicate non-consensual interactions at the time. Just an adult 26 year old woman hooking up with her fellow colleagues.\n\nBut after investigation into the police department, and the news broke, she decided to [file a lawsuit against the people she hooked up with, alleging she was pressured into doing it](https://www.dailymail.co.uk/news/article-11804297/Maegan-Hall-says-sexually-groomed-fellow-cops.html).\n\nAn excerpt from her complaint/lawsuit (which was written with the help of her lawyer no doubt):\n\n    They colluded in using their authority to systematically disarm her resistance and\n    entrap her in degrading and abusive sexual relationships\n\n\\---\n\nIt was quite beneficial for Jenni Hermoso to turn around and say she was SA'd by Luis Rubiales. Which is what she did when she filed a lawsuit against him. The benefit includes the connections and stronger support for her in life/society, career opportunities as well as financial ones, she'd be invited to speak at venues and would be heralded as one of the champions of feminism etc.\n\n&#x200B;\n\nFor Maegan Hall, it's to salvage her reputation, if she did what she did out of her free will - then she's a promiscuous woman, if not, then she's a poor victim (\"survivor\") who deserves sympathy and whatever perks that come with victimhood status these days.\n\nGuys these days need to ensure that a woman doesn't regret what happened post fact, if doing so becomes beneficial to the woman, otherwise they'll get #metoo'ed and their lives will be ruined forever.",
    "title": "Feminist society pushes women into re-calibrating their past history into a #metoo moment",
    "subreddit": "MensRights",
    "timestamp": 1695547779,
    "score": 190,
    "keyword": "woman lawyer"
  },
  {
    "text": "Woman assaults me in the testicles, and there are no consequences? I’m posting here looking to see if anyone has any legal advice for me, because I’m pretty fed up with having been injured in the testicles by a woman being seen as funny and not being taken seriously.\n\ntl;dr: Woman assaults me(male) with a groin attack unprovoked, police refuse to do anything, injuries sustained have caused me serious pain and impacted my life, lawyers don’t seem interested in offering me any counsel.\n\nBackground:\n\nLast month while staying over at my girlfriend’s house and enjoying a bottle of wine together, she had me go to the kitchen for her to get a cup of ice. As I was doing that, her female roommate (who had been drinking vodka all evening with her boyfriend) stormed out into the kitchen. The roommate and my girlfriend were on bad terms and said roommate had apparently previously screamed at my girlfriend that same day. Roommate began drunkenly screaming in my face to “get the f%#+ out of her house.” I calmly told her that because I was a guest of my girlfriend (co-lease) she had no right to tell me to leave. Not wanting to be yelled at, I turned to go tell my girlfriend about it— but before I could walk away the roommate ran up behind me and kicked me between the legs as hard as she could.\n\nAfter that, I called the police as an entire scene broke out with my girlfriend defending me and roommate and roommate’s boyfriend began screaming in her face. While I was still on the phone with dispatch, roommates boyfriend pushed my girlfriend and was looking over her like he was about to hit her. I pushed him away from her, and told dispatch I needed first responders. \n\nWithin ten minutes two sheriffs deputies arrive and take our accounts, but weren’t interested in filing any police report— apparently because I’m a male calling them to report an assault by a female. In fact, they seemed more interested in possibly arresting *me* even though I’d done nothing criminal and was the one who had called them. I went to the sheriffs department the next day and had a sheriffs sergeant tell me, in essence, that I “should walk it off, at least it wasn’t a 6-foot Samoan man who had kicked (me).” Seeing the sexist attitude for what it was I asked him if I had done exactly what she had would I have been arrested? His answer, in plausible deniability fashion, was a condescending metaphor using my current job that “every situation is different and depends on the circumstances.” He refused to take a police report and to file a TRO.\n\nAfter that, in excruciating pain and barely able to drive or walk, I went to Urgent Care and waited for 3 hours only to be told I needed to go to the ER. After having a CT scan and an ultrasound on my scrotum, they told me that luckily I didn’t appear to have a shattered testicle or any testicular torsion. However, I did have a varicocele, hydrocele and inflamed epididymus due to the assault. After this, I waited a few weeks using ice packs and was unable to work or maintain my daily activities, not to mention have any form of sexual activity because of the pain. I then got a referral to see a urologist who ordered another ultrasound, and I am waiting for his office to set up an appointment with him because currently I am still in pain over a month later. \n\nI’ve tried calling attorneys but no criminal attorneys will take my case because I don’t have the cooperation of the sheriffs department to file a report. Personal injury attorneys haven’t been interested either because they’d probably prefer to handle $100k car accident cases. I’m at a loss of what to do to get any justice here for my loss of income, medical costs, and pain and suffering. Meanwhile the woman who assaulted me has been doing everything in her power to fuck with my girlfriend and otherwise enjoying her life feeling free of any consequences (especially because her career as a WFH therapist would be over if she had been charged with any type of assault and battery, which would be for the best as she makes fun of her male clients and talks about their personal info).\n\nCan anyone here advise me what I should do in these circumstances? I would truly appreciate some guidance.",
    "title": "Woman assaults me in the testicles, and there are no consequences?",
    "subreddit": "MensRights",
    "timestamp": 1682047804,
    "score": 162,
    "keyword": "woman lawyer"
  },
  {
    "text": "Ex wife unjustly claims her ex husband trafficked her and persecutes him on social media This woman claimed she was trafficked by her ex husband, she started a relationship with him when she was 17, over the age of consent in Colorado and she confirms in the video that he never hit her but that she hit him. She confirmed that she cheated on him after their baby was born. The state prosecutors wont prosecute because they say she couldn't convince a jury. She used 3 strike DV laws in Colorado to have him removed from house in 2016, which she proudly refers to as her house, the house was given to him by a military charity for his military service. \n\nShe got sole custody of his daughter by legal tricks and attributes it to her clever lawyer. She has a money raising page for cosmetic breast surgery as she feels she deserves it because of his \"abuse\" and people have been contributing since summer 2022. Many gullible people are blindly supporting her. She blames him for everything, even claiming she may have cancer because of him. She contradicts every claim she makes in the same video. \n\nHe is a multi-decorated war veteran who was blown up by a grenade in 2006 and is reduced to sending a cease and desist letter from his lawyers to stop her persecution of him,7 years after they separated.\n\nIt's one of the most unjust cases of lack of responsibility I have ever seen. Its 2 hours long but I can put timestamps in the comment section to locate the most egregious parts.\n\n[https://www.youtube.com/watch?v=cCBJKyF5iao](https://www.youtube.com/watch?v=cCBJKyF5iao)",
    "title": "Ex wife unjustly claims her ex husband trafficked her and persecutes him on social media",
    "subreddit": "MensRights",
    "timestamp": 1676459436,
    "score": 157,
    "keyword": "woman lawyer"
  },
  {
    "text": "If women are so protective of their friends, why do they tell one another things that they want to hear and often give them bad advice? I've always wondered this... And especially even more so now that I'm getting up towards my 40s. I was dating someone over the winter briefly, and even before we met, she kept talking about her one friend who was very protective over her. That friend even took her phone at one point during a call and warned me not to hurt her. The relationship didn't last long, and things ended amicably, but it was always in the back of my mind that I wasn't just dating the one woman, but dating her and the group of friends that came along with her.\n\nAlso around the same time, my ex girlfriend filed a court petition for custody and child support for our child even though she had agreed to go to mediation with me first before getting lawyers involved. We had an informal agreement that worked fine — not perfect — but enough for us to be productive. But it was also time for a formal parenting agreement. She didn't even try mediation and lied to me, saying that she was open to it and willing to do it and completely double-backed on me. I even found a service that could provide us with 4 free hours of mediating time. Instead, she paid $15,000 to hire a lawyer and go after me. My suspicion was that she reached out to a lawyer for a consultation, but then they got into her ear and head and then she started making stupid decisions. I just kept thinking that she was probably talking to her friends and they all probably told her to throw the book at me and that I'm a scumbag and who cares what I think or what I want and to just go after me. \n\nNow, our co-parenting relationship is completely destroyed and I feel like I can't trust her, but yet she acts like the victim still. She refuses to take responsibility for her own part in all of this. And she absolutely doesn't want to hear from me that I'm hurt and traumatized by it. It bothers her to hear that someone else is suffering because of her actions and she'd prefer to ignore it entirely. I can only imagine that her friends and lawyer are not only telling her what she wants to hear, but they're telling her things and giving her advice that is actively harmful to her co-parenting relationship and actively harmful to our daughter. \n\nWhy can't more women think for themselves? Or why don't they listen to their friends advice but only look it as advice or suggestions and then make a decision based on all of the input they've gathered — including their own intuition — instead of just doing whatever their friends tell them?",
    "title": "If women are so protective of their friends, why do they tell one another things that they want to hear and often give them bad advice?",
    "subreddit": "MensRights",
    "timestamp": 1688311089,
    "score": 150,
    "keyword": "woman lawyer"
  },
  {
    "text": "Mistreatment of women in my country  \n\nHello girls, I'm Moroccan and I just want to let my thoughts about because I'm frustrated, I have observed that a significant number of Moroccan Muslim( my default assumption) men, and men from other Muslim-majority countries like Egypt and Algeria, treat women unfairly and disrespectfully. Some women also exhibit this behavior, but it is unclear what else these individuals have in common other than the religion, I'm trying to understand what is the common ground that they share. although it mostly has nothing to do with what Islam preaches. For instance, I have come across a Facebook group with over 200K members that refers to women in derogatory terms such as \" lmra hashak\" which is kind of hard to translate correctly but it means something along the lines of \" women are something disgusting, something you're sorry to see\" because the term \" hashak\" is mostly used while talking about donkeys or dogs  ,and \" 9hwya\" which literally means \" the brown girl\" but in a very offensive manner, obviously both racist and degrading because that's what their intention is while using it. Other Arabic groups share similar content, including pictures that are demeaning to women. Additionally, there was a post mentioning a national team competing in mathematics with only one girl and four boys, people left derogatory comments, calling women stupid. because there aren't more girls there, and because in my country it's known that girls mostly get higher grades and pass more exams than men, such as exam to become a lawyer teacher etc., so when there is any post about any team that contains more men than women they immediately make everything girls did worthless,  And It happens with any post where there is anything about women sadly. I always check the comments hoping I'm wrong, just to be let down. They also do not acknowledge women's achievements throughout history or recognize the success of many women who did not get the recognition they deserved due to historical discrimination.\n\nIt is disheartening to see that many individuals in these communities blame the victim in rape cases and even defend pedophilia. In my high school, I witnessed four teachers who slept with 13-15-year-old girls or even younger. I want to understand why such mistreatment of women is prevalent in these societies and why some individuals think it is acceptable. I had hoped that in other environments such as university, things would be better, but unfortunately, I was once again disappointed. Even my professors speak about women in a derogatory manner, giving examples of them being stupid, crazy, and so on, even when the material they're teaching is unrelated to such topics. When they ask my mostly male classmates if they agree, they laugh and make even more offensive remarks. Some even go as far as to suggest that they would do worse things themselves.\n\nI once even tried to stop the professor and all he did was telling me \"you'll understand why men are better when you get married\". \n\nI just want to know if it's okay for me to have hatred for men in my country, and all the ones with similar mentality, or am I wrong? because I don't know why even the girls agree with them, if there is a rape case, it's women's fault, if there's assault case, it's women's fault. etc.\n\nThere is also a whole group that has the hashtag \"#NoToMarryingWorkingWomen\" where they say they won't marry any woman who works, because she gets exploited by her director and she isn't only his, but his and the director's too, and that they don't cook, and won't find time to take care of the children and him, and because she will start to go out with friends etc.\n\nAnd the list goes on obviously. \n\nI just don't get the hatred, is this also this common in your countries?\n\n Examples of such posts that they share, I provided translation :\n\n[https://ibb.co/c8Rn9ZM](https://ibb.co/c8Rn9ZM) \\- this photo was taken from a video where a girl was walking with a skirt and some man lifted her skirt and obviously sexually harassed her and slapped her bottom. they call him king for doing so. and when this happen most men were saying the girl deserved it for going out like that.\n\n[https://ibb.co/wQwzDm3](https://ibb.co/wQwzDm3) : insulting an inventor, and the comments kept saying she didn't help them make WIFI, she just opened her legs.\n\n> [https://ibb.co/jwM9Cjh](https://ibb.co/jwM9Cjh) : as for this one, the post says \" does women deserve to and the answers are \" she does \" \"she doesn't\" and everyone picked she doesn't, meaning they stopped at \" she doesn't deserve \" referring to she doesn't deserve anything. \"",
    "title": "Mistreatment of women in my country",
    "subreddit": "Feminism",
    "timestamp": 1683878025,
    "score": 542,
    "keyword": "woman lawyer"
  },
  {
    "text": "Legally Blonde as example of situated knowledge? I've been been learning about Donna Haraway and feminist epistemology, Sandra Harding's idea of 'strong objectivity', and standpoint theory in general. For those who don't know, standpoint theory basically states that knowledge is always partial, and that instead of that partiality being hidden, it should be an asset of that specific knowledge. It advocates for knowledge production taking into account power relations, sociocultural background, biases, etc.\n\nI just realized that Legally Blonde is a perfect example of situated knowledge, as a contrast to the traditional view of \"objectivity\" as some kind of universal truth. In the film, she is ridiculed for being different (more feminine) than the average lawyer in her field, but she ends up winning a case by using this difference, her situated knowledge, as an asset instead of a hindrance. \n\nWhat do y'all think?\n\nEdit - I wrote some more about this:\n\nLegally Blonde is a prime example of the way situated knowledge can be effective in a practical setting. Elle Woods is ridiculed throughout the film for being overly feminine, energetic, allegedly unintelligent, and superficial. These traits are positioned as hindrances to a successful law career. But time and time again, she proves that these specific traits - including her feminine, situated knowledge - can be assets instead of obstacles. First, she values her client Brooke Windham’s trust and privacy above all, in contrast to her colleagues wanting to disrespect her wishes, which would lead to the unnecessarily ruining of Brooke’s fitness career. Instead, Elle uses her feminine knowledge to invalidate the pool boy’s claim of having an affair with Brooke, by proving that he is gay and has a boyfriend, and to invalidate Chutney’s alibi, by proving that she couldn’t have been in the shower with her freshly permed hair on the day of the murder, leading to Chutney’s final, damning confession. Elle Woods uses her personality and background to win the trial, using what previously seemed a weakness as a source of strength. The film rejects the prominent cultural idea that women must be masculine in order to be strong or competent, instead positing, through the character of Elle Woods, that a woman’s specific standpoint in society - her situated knowledge - not only matters, but is something valuable and worth embracing.",
    "title": "Legally Blonde as example of situated knowledge?",
    "subreddit": "Feminism",
    "timestamp": 1674143915,
    "score": 259,
    "keyword": "woman lawyer"
  },
  {
    "text": "If there are any female attorneys on this subreddit, what’s it like? I (16 F) am interested in becoming a lawyer and want to know how does being a woman in law work.",
    "title": "If there are any female attorneys on this subreddit, what’s it like?",
    "subreddit": "Feminism",
    "timestamp": 1684713626,
    "score": 8,
    "keyword": "woman lawyer"
  }
]