[
  {
    "text": "Lawyers of 'third world countries', what should every woman in your country know?",
    "title": "Lawyers of 'third world countries', what should every woman in your country know?",
    "subreddit": "AskReddit",
    "timestamp": 1483795367,
    "score": 6,
    "keyword": "woman lawyer"
  },
  {
    "text": "My employer is insisting that I am the victim of sexual harassment even though I said I am not. They even hired a lawyer for an investigation. I WAS NOT SEXUALLY HARASSED WHY ARE THEY SAYING I WAS??!?!?! Obvious throwaway account, because... yeah...\n\n&nbsp;\n\n\nI dated a guy. I started working at his family's business. (About 50 employees) We broke up. (My idea) It was hard, but we made it through and continued to work together. We had some emotional struggles, but whenever something came up at work, we took distance or a mental health day or some space. Our work was not impacted. We did not have discussions or anything of the kind in the workplace. We kept that stuff at home, because we're adults. We even own a business together on the side.\n\n&nbsp;\n\nFast Forward to 6 months after the breakup, and the business owners (his parents) inform me they are investigating allegations that I was sexually harassed at work. I didn't make any complaints. In fact, I told his mother in a personal conversation (so personal we discussed her granddaughter's need for easier access to tampons in the conversation), that we had resolved everything and our friendship and business relationship were better than ever.\n\n&nbsp;\n\nOne working day later, she tells me that he is suspended from work. I will now only work in the office under her direct supervision, literally across my desk from me. (I do all their web design, social media, marketing, etc) She tells me they have hired an investigator to look into the sexual harassment that happened at work. I tell her there was nothing, and I don't want an investigation. She tells me she would like me to cooperate with the investigator but I don't have to. I told her I was uncomfortable with the new work situation and wouldn't be into work for a while, jotted off an email about training a replacement if that became necessary (NEVER SAID THE WORD QUIT), and went home. \n\n&nbsp;\n\nI am getting phone calls at home from coworkers I have never even talked to outside of work, asking questions about this alleged sexual harassment. Someone even suggested there was a quid pro quo sex for employ situation. My reputation has been utterly trashed. According to someone else, patrons of the business (I work in the back office, I never encounter patrons) have come forward as witnesses to events that never happened. A coworker I have literally never spoken to allegedly made a report about witnessing an incident... This is the worst game of telephone ever. Everyone is getting in on the action.\n\n&nbsp;\n\nMy Ex/BusinessPartner/NotHarassingBoss is banned from talking to me by his parents. I cannot conduct my own business. (Crucial tight launch schedule, he is integral to our business, this is damaging our business)\n\n&nbsp;\n\nI didn't tell anyone at work about the process of our breakup. Nothing happened at work beyond one or the other of us taking a long lunch break or day off without any drama. I never made any allegations.\n\n&nbsp;\n\nI feel like I am being gaslighted. How can the owners, the coworkers, etc. keep telling me I was sexually harassed, if I wasn't? Can they even do an investigation into something on my behalf if I say it didn't happen? I worked SO HARD to keep it together after the breakup and be a strong business woman and handle things with dignity and I was really proud that it didn't damage my work. But here they are, insisting I am the victim over and over and over with lawyer's letters and investigator phone calls, and emails.\n\n&nbsp;\n\nThe owners have moved my full-time position to seasonal employ and said that even if I did come back, I would end when the season ends on Oct. 31, so I have basically gotten fired. I can't find an attorney who wants anything to do with a mess like this in my small town. Even if I could, I am a single mother of two. I don't have cash for an attorney. I barely have the cash to pay my bills.\n\n&nbsp;\n\nI am trying to hard to deport myself with dignity, but it is not happening. I feel like it is worse harassment to insist to me that I have been harassed when in truth I worked very hard to keep my work life professional to the utmost extent.\n\n&nbsp;\n\nTLDR: I said I wasn't sexually harassed. Why won't they believe me and why are they having a lawyer investigate? This can't be right.\n\n&nbsp;\n\nEDIT: Adding in tons of stuff because I can.\n\n&nbsp;\n\nEDIT: Thank you to everyone for the friendly conversation and suggestions. I haven't been able to discuss this with anyone due to my desire to be discreet, and it has been enormously therapeutic and helpful to vent a bit and hear others thoughts on the issue. I'll be sticking around for a while because it feels really good to discuss this after a long week of keeping everything bottled up. Thank you Reddit.\n\n\n&nbsp;\n\nEDIT: If I feel like I can update without complicating the situation further as things progress, I will. Thank you everyone.\n/endrant\n\nEDIT2: I have details to update. This is structured firing. No question. I have document to post & etc, since nothing can get worse and I appreciate everyone's input and support. I'd rather make you guys happy since the job is already hell. Update post coming shortly.",
    "title": "My employer is insisting that I am the victim of sexual harassment even though I said I am not. They even hired a lawyer for an investigation. I WAS NOT SEXUALLY HARASSED WHY ARE THEY SAYING I WAS??!?!?!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1507758286,
    "score": 68,
    "keyword": "woman lawyer"
  },
  {
    "text": "My niece is being stolen from us because apparently the rights of a bio-mom matter more than the safety of a child. I'm sorry Reddit, but I need to vent and I can't think of anywhere else to do it. Feel free to ignore.\n\nMy sister did what a lot of people wouldn't do, and accepted my now brother-in-law's child, a little girl of 3 years old, with open arms. We welcomed that little girl into our family with happy open arms. I suffer from depression, but I swear to get to have the chance to hear her scream \"UNCLE!\" and run into my arms never made me feel better in my whole life. My sister took to motherhood so well it honestly shocked me. She had always been level headed, strong willed, and creative, but these traits magnified when it came to taking care of this sweet kid. In situations where I was sure a screaming fit would be oncoming, she could work miracles, and we saw her behavior improve vastly from when we first met her.\n\nBut there is her bio-mother. A woman who admitted that my sweet little niece is just a paycheck to her. On record no less. That she poked holes in my brother in law's condom and had been shocked to find out that he wanted to be part of his kids life and that he was just \"Suppose to go away and make the damn support payments.\" This woman was toxic, but we could deal with it.\n\nThen she started showing up with bruises. She wouldn't be changed, wouldn't get fed, would have clothes or precious toys \"Disappear\" and go silent if asked what happened to them or just say \"Mommy was angry.\" or \"Mommy's boyfriend was angry\". We pushed to take custody of her and finally got the majority. However, the GAL said that the \"Biological mother\" should retain half custody and so she got sent back to her mother's. But the bruises got worse. We documented, and pushed, but the court ignored most of the evidence, even such lovely gems as the above comments.\n\nThen came the bomb shell. One of the other little girls in the bio-mom's house had been raped and was abusing my niece. At the advice of my niece's therapist, and my brother in law's lawyer, they took her away from that home. As things have been pushed further, it was found out not only was my niece abused by the other little girl, but that Bio-mom's boyfriend had raped her too. \n\nI didn't want to believe it, but no child should be able to describe the things she did to her therapist. So, the therapist reported it. We all geared up to fight what was gonna be a painful to fight battle. \n\nThen, the GAL tipped off the rapist. Told him the identifying features that my niece had given, and he changed things (Piercings and removals, ect) to prevent ID. She also tipped them off to a polygraph weeks in advance so he could pass it.\n\nHer response when confronted with her actions? \"The mother knows best for the child no matter what dangerous situations other people put her child in.\"\n\nWe're all heartbroken. We could easily lose this fight with such an important figure in the proceedings deliberately moving against us. It isn't fair. My sister is the best mother this girl could hope for, especially with all the pain she's dealing with. But she's going to be stolen away because the Bio-mother matters more than the father or the mother who actually cares and takes care of her. My sister is 100X the mother that awful woman is, but because she isn't \"Blood\", they don't care.\n\nI don't expect anything to come of posting this. I just needed to scream into the void as it were.",
    "title": "My niece is being stolen from us because apparently the rights of a bio-mom matter more than the safety of a child.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1493938931,
    "score": 67,
    "keyword": "woman lawyer"
  },
  {
    "text": "How do I get a job out of college? I graduated college. Had nearly a 3.5 GPA. Got on the dean's list my last year of college. Got my degree in psychology. And now, I can't get a job.  \nIt's been 7 months since I've graduated. I've put in applications from everything from HR positions to psychology research internships. The ones that I have heard back from denied me instantly. One job, which emphasized that it didn't require any previous experience, denied me after the interview (in which the interviewer continuously mentioned the fact that you don't need experience), with an email stating that I wouldn't be hired due to lack of experience. I thought the phone interview went well. I thought all my cover letters have been very good. Thoroughly researched the companies, followed guides for cover letters online, the whole nine yards, and now I wonder if they even read the letters or just see my resume and say \"nope.\"  \nThe only job I could get was in fast food, which was supposed to be temporary.  \nMy resume was created with the help of the career counselors at my school, so it should be proper format, well written, etc.  \nI don't get why I'm getting denied instantly from the over 100+ jobs I've applied to, including ones that don't even require a degree. Some only required a high school diploma or GED, or even associate's degree. I had quit my warehouse job, which paid well enough for me to get out of my parent's house, had a 401k, had vision/dental/health, and was steady, because I was always told that college would get me farther in life, so I prioritized school over work and left that job. And now, I lost the best job I had ever had, and can't get hired anywhere else, had to move back in with my parents, and I have no foreseeable future.  \nI have a college degree, and I work with 16 year olds in fast food. I'm 25, live with my parents, and I can't even afford health insurance. My job has no chance of moving up. I can't even get my foot in the door with any company, whether they are big companies or small companies.  \nI've had a diverse background of jobs, mostly low paying minimum wage standard jobs, from fast food to cashiering, with my warehouse experience and an internship in a completely different field sprinkled in between. Nothing has lasted more than months or a few years, due to the majority of the positions being seasonal. Maybe that's the only reason I get denied from everywhere, because \"jumping around between jobs\" looks bad...but you can't really help that when the only places that will hire you are temporary.  \nI also fear that one of my previous jobs, which I quit due to a hostile work environment, may also be giving me bad recommendations. The boss was extremely discriminatory toward me and other previous employees, and I wouldn't put it past her to lie, or even to disclose confidential information to other companies to get them to not hire me as well. I don't know if she is doing that, and I have no reason to believe she is, but I wouldn't put it past her-this woman bullied and harassed a coworker of mine to the point of suicide, so I wouldn't put much of anything past her. I also know that she knows that I can still sue her for harassment, and also that I refused to give a statement to her lawyers when she was trying to cover her ass from a wrongful death lawsuit. I generally put \"do not contact\" under this employer when applying for job applications, which probably looks bad as well, the whole \"if you don't have anything to hide, then you won't hide it\" reasoning. Even when I do put do not contact under that employer, that probably doesn't guarantee they won't contact them, and if they don't have that as an option, it's just on my resume. I wonder if I should leave that job off my resume, but I don't know if I can, or if having a year gap of unemployment would look worse.  \nI know the biggest thing that would help my resume is experience in a particular field...but no one will give me a chance, so I can't get my foot in the door anywhere. I feel trapped, like I'll never be able to progress in life, that I'll be stuck in fast food forever, that my college degree was useless, that maybe I'm a victim of circumstance or maybe there's just something wrong with me. On paper, I've qualified for nearly every job I've put in for. I've even applied for bullshit data entry positions. I was told that for many jobs, it doesn't even matter what your college degree is, just the fact that you have a degree is enough. So far, it doesn't matter even if the job posting asks specifically for my degree or the area I studied in school, I still get denied.  \nI don't know what else to do. I can't really afford to have an unpaid internship just for experience, and even if I could, the ones I applied for within the past two years all denied me anyways. I don't know if returning to school will help or not. I'm told it would, getting a higher degree would get me the job, but that's what I was told about my first degree, so I'm inclined to think that's bullshit. Everyone I've talked to with decent jobs only got in because of friends or family-it seems like it's all \"who you know\" and not \"what you know\", many of which weren't qualified at all for their jobs. Unfortunately, all the people I know are in the same boat as me.  \nHelp?",
    "title": "How do I get a job out of college?",
    "subreddit": "careerguidance",
    "timestamp": 1499917316,
    "score": 2,
    "keyword": "woman lawyer"
  },
  {
    "text": "Law or IT after maternity leave? For a while now I have been trying to figure out a second career to pursue. Would greatly appreciate some advice. \n\nMy circumstances are as follows:\nI'm an almost 30 years old woman, and with a young toddler. Have immigrated to New Zealand, now living in a small  town. I'm not a native English speaker, although my English is very good. \n\nPre-baby I trained as a lawyer (in a non-English speaking country). I enjoyed studying law, and wouldn't mind working in that field, but i can't say that i'm passionate about it. Retraining as a lawyer would carry a significant cost and time commitment. I have no ambition for ever becoming a partner either. I would quite happily settle for a mid-level position. Ideally I would like to work part-time and have time left for my son.\n\nHusband suggests I start learning something IT-related. He does an IT job from home and enjoys it a lot. I don't mind trying something new, but I also know that ideally I wouldn't like being in front of a computer all day. \n\nAs far as personality, I tend to be just slightly on introverted side. I get along with people reasonably well, however I find it hard to connect with people. I enjoy quiet nature walks, gardening, spending time with my son. I don't need expensive things, but value stability, being able to pay the bills and purchase health insurance. \n\nAt one time as worked as a court clerk and greatly enjoyed it. It had just the right amount of people interaction and rules/structure for me. Unfortunately this career is on it's way out, court clerks being replaced by technology.\n\nI've also dabbled in teaching, non-profits, retail and bakery but concluded neither of these were a good fit for me.\n\nWhere should I turn next in my career search?\n\n**tl;dr: tried many careers, not passionate about any of them. is it worth trying to get into IT?**",
    "title": "Law or IT after maternity leave?",
    "subreddit": "careerguidance",
    "timestamp": 1486244292,
    "score": 0,
    "keyword": "woman lawyer"
  },
  {
    "text": "699 pages into the Dukeminer Property book and I finally lost it. >A New Orleans lawyer had searched title back to 1803 for his client, a federal agency. The agency asked who owned the land prior to that date. The lawyer replied:\n\n>Gentlemen: I am in receipt of your letter of the fifth of this month inquiring as to the state of the title prior to the year 1803. Please be advised that in the year 1803 the United States of America acquired the Territory of Louisiana from the Republic of France by purchase. The Republic of France previously acquired title from the Spanish Crown by conquest. Spain acquired title by virtue of the discoveries of one Christopher Columbus, a Genoese sailor who had been duly authorized to embark upon his voyage of discovery by Isabella, Queen of Spain. Before granting such authority, Isabella, a pious and cautious woman, obtained the sanction of His Holiness, the Pope. The Pope is the Vicar on earth of]esus Christ, the only son and heir apparent of God. God made Louisiana.",
    "title": "699 pages into the Dukeminer Property book and I finally lost it.",
    "subreddit": "LawSchool",
    "timestamp": 1485309782,
    "score": 114,
    "keyword": "woman lawyer"
  },
  {
    "text": "DQed Law Student. WTF. Please help. [Serious] wondering what the hell to do. I was in law school in California. ABA approved. Got in got a scholarship. DQed after my first year. I have crippling Endometriosis that became unmanageable and I  do not know what happened. I was studying 14 hours a day, I knew my stuff. Even talked through property, civ pro, and contracts with counsel at Apple (whom I babysit for) who told me I was ready for finals. \n\nA week before Finals I panicked, went in to try to withdraw and the school didn't let me. \"You'll be fine,\" they said \"you're just paranoid.\" I ended up DQing. It is the hardest thing I have ever been through. I was the first woman in my family to go to any type of graduate school and I failed. The last 3 months have been hell. My confidence is too low to take the baby bar and I had a professor tell that I won't pass it. \n\nI wanted to go to law school to join the fight for criminal justice reform i.e. stopping solitary confinement, bringing awareness to sexual abuse in prisons, decriminalizing the severity of drug offenses...what have you. After DQing another professor  recommended me to a part time non ABA law school that will transfer my credits but will take be 3-4 more years. Do I consider going or do I scrap my dream of a JD, say screw it, and become a writer like I wanted when I was a kid. \n\nFor reference- I'm 24. I know I won't be complete in life until I shed light on the injustices in the criminal justice system and until I personally do something to fight it. I love the idea of working in social/criminal justice reform. Think New Jim Crow. I would love to be featured in a Netflix documentary like 13th or the Kalief Browder story. I want to be a specialist in a field like that. \n \nI also want to be a novelist and am now struggling with the whole idea that maybe I just was not meant to be a lawyer...\n \nOn the other hand...I think I need a JD for credibility in the social/crim justice struggle. I don't know, part of me loves human rights and I want to help by being an advocate. I also love writing books though...Is it possible to do both? Is it possible to be an Advocate like I want to be without law school? \nWTF do I do.",
    "title": "DQed Law Student. WTF. Please help.",
    "subreddit": "LawSchool",
    "timestamp": 1507532160,
    "score": 0,
    "keyword": "woman lawyer"
  },
  {
    "text": "If women shouldn't have to explain anything when getting an abortion, and can get an abortion whenever they want, men should have the right to disown an unwanted child if the woman doesn't wants to have an abortion. Children should not be used as one sex's financial shackle to the other. After seeing a post on the front page about women never having to justify abortion, and worse, to be able to use it as a form of birth control, I feel this should also be mentioned.\n\nStory time! Sorry for the grammar and everything, English isn’t my first language.\n\nThis happened to a family member of mine. He and a girl he met slept together without using a condom. Alright, up until now I'd say screw them both, they knew what they were risking; however, they seemed mature about it. The man (Family member) couldn't financially support a child without dropping out of university. The woman wanted to keep the child for whatever reason (I think it was about morals or something along those lines), but accepted to take care of the child and sever ties with him.\n\nAlright, great yeah!? Mature, reasonable decision on both sides. The man would stay in university and the woman would take care of the child she wanted to keep with the help of her family. That should have been the end of it right? Wrong. Fast forward a couple of years. Yes, YEARS! The man is contacted again by the woman. She wants him to meet her child. I say “her” because it was decided they would sever ties years ago.\n\nAlright, I get news of this. And I'm rather a huge jerk and always assume people will act towards me as I act towards them. They want the upper hand and never do anything out of the kindness of their heart, but we’re not here to judge my character people, it’s just relevant to the story.\n\nSo I tell him not to respond, I tell him NEVER to reply to anything she sends. I explain to him that she just wants money out of this, that it’s not worth it. She’ll fuck him over because she lives in a shit town in a shit part of the country with no jobs and failed relationships and she’s seeking easy money to feed herself because she’s probably a failure.\n\nDid I tell you this family member is sentimental? Well, he is. So the woman beats me by showing him picture of that kid to him and telling him that since she told him stories of his dad the kid wants to meet him. He gets emotional and suddenly he wants to meet the kid and talks to him on skype. I knew where this was leading, he was being manipulated, but I couldn’t reach his guilt tripping mind about how this was only a ploy to get him to get more involved in the life of this kid until she would demand money. \n\nAfter a while, what do I learn about this fuckass woman from nowhere? Just before contacting the family member she had broken up with her loser junky/pusher boyfriend. It didn’t matter though, because he already went to meet that kid and see them in person (kid and woman). They live really fucking far away too. I’ll also mention that he has a good job, north of 45k a year, I just *know* where this is going. So I tell my family to somehow convince him. It fails.\n\nA couple of weeks later what does she asks? That’s right! MONEY. SHE WANTS ZE MONEY. I’m not fucking rejoicing here. This was a failure on my part, but this is only the beginning folks. So the family member says he can take care of them if they move into his town and he’ll visit often. Fair, right? He’s got a heart of gold that guy. He does all this while being married to another woman who’s understanding enough to support him through all this.\n\nWhat’s the response from fuckass woman up in nowhere city? She doesn’t want the kid to meet family member’s wife, and wants him to only have supervised visits at her own place in nowhere. She also wants the money, of course, but the kid is only a tool to get that at this point.\n\nFamily member really fucking wants the best for this kid, so he tells her he’ll accept to have the kid during the summer and pay child support. That’s not enough, she wants more money than that, so she uses the kid again, denying him visits altogether and telling the kid his father doesn’t want to help.\n\nNow, family member paid over $10 000 in lawyers’ fees getting the ball rolling to get full custody of the kid. He and his wife live in one of the big city of the province, making north of 65k a year together. They are married, have a stable life with a lot of relatives living near them. Meanwhile, fuckass hoe has no job, a string of junkie exes trying to get (fuck) her back, live in nowhere town, can’t pay the bills, and is using the kid as an emotional weapon to get money out of him. \n\nFamily court is heavily stacked against men here. You know what his lawyers told him? He has less than 50% chance of even getting custody let alone full custody. Because women, for no good reason, are heavily favored in the courts. It takes child abuse to even nudge the court towards taking the men’s side in most cases. Short of child abuse or a really strong argument by them that would blow the judge away, he’ll only get to see the kid once every two weeks and have to pay out his ass in child support while junkie woman sleeps around and never works a day in her life.\n\nThis is why men should have the right to disown a child before birth up until the time a woman cannot get an abortion anymore. Never having to pay a dime to the woman. Right now, children can be used as financial shackles on men and often are used that way. If a woman can abort a child because of financial reasons, without asking the permission of the father who might want to keep it, that father should be able to disown that child for the same reason and never be bothered by the woman again.",
    "title": "If women shouldn't have to explain anything when getting an abortion, and can get an abortion whenever they want, men should have the right to disown an unwanted child if the woman doesn't wants to have an abortion. Children should not be used as one sex's financial shackle to the other.",
    "subreddit": "MensRights",
    "timestamp": 1487205451,
    "score": 220,
    "keyword": "woman lawyer"
  },
  {
    "text": "My Harvey Weinstein was my high school teacher. This is my story. It happened in a small, wealthy, Catholic high school--run by Catholic brothers, fairly conservative, extremely sexist, extremely homophobic, extremely white, highest position held by a woman was guidance counselor. As a senior, I chose psychology as my second semester elective. The instructor was an alumni, been teaching a few years after 20+ years in law, and well regarded in the school/entire community because he was also the football coach. His son was a student in my year. To the football team, he was not only Coach, he was also their best friend's/teammate's dad. People hung out at this guy's house. This teacher was also my home room teacher all year. He knew exactly what rules to break to make him popular as a teacher--never marked you late no matter what time you strolled in, let you do homework, and didn't care if your shirt was tucked in. Every female was \"sweetheart\". He gave every male a personal nickname. He was very dad-like. \n\nSecond semester, day one of his class, he shut the door and it started. Basically, we were told that what happened in that class, stayed in that class. We were going to talk about things that the \"boss\" wouldn't like--sex, drugs, rock and roll type things. He set up an \"us\" against \"them\" mentality really early. He told us we were going to get really close. He made it clear that if you weren't going to be cool about it, you needed to drop the class. Then, he specifically stated: \"if i ever make you uncomfortable, come to me and we'll work it out, don't get an administrator involved and ruin it for everyone else\". He started slow: making stupid sex jokes, telling us about his glory days as a lawyer in the 80s, making comments here and there about women's bodies in general. Then the \"jokes\" got a little more graphic--throwing in lewd hand gestures. When we got to a lesson that included sexual harassment, he told us that sexual harassment doesn't happen anymore. Women routinely lie or exaggerate and it ruins men's careers. And when men do cross a line, it's because they don't know any better and women need to lighten up. In his unit on abnormal psychology, he thought it was important for us to know that \"some doctors\" say that homosexuality fits the criteria of a mental illness. About this time in the semester, his style of dress started to became more relaxed. He started wearing basketball shorts with no underwear rather than his usual khakis. This was a very small classroom so he was less than a foot away from you if you sat in front, which I did. He told us that he had \"friends\" that commented on how hot the girls were at our school. \n\nOne day at lunch, sitting with 3 girls from my class, I worked up the courage to say, \"so Coach is like...a creep, right?\" The response was essentially \"yeah, you didn't know?\" He only taught 2 classes each semester. All seniors. He was a guaranteed A. That's how he got away with this shit. Nobody is going to rock the boat a few months before graduation and he knew it. Right before final exams we played his version of \"Girls ask Guys\". We were encouraged to ask ANYTHING, without embarrassment, because questions were going to go in a hat. What happens in class, stays in class, remember? We were graded on our discussion participation but we could say \"pass\". A lot of sex questions came up because we were all 17/18yr olds trying to play this demented man's game. We went around the room and were pressured to talk about sexual fantasies, masturbation habits, penis size etc. There was several days of this. Looking back, I think he humiliated us for his entertainment. This was in 2010. Last I checked, he is still teaching. Every word of this is true and I would testify in court if his day ever comes.",
    "title": "My Harvey Weinstein was my high school teacher. This is my story.",
    "subreddit": "Feminism",
    "timestamp": 1508369435,
    "score": 6,
    "keyword": "woman lawyer"
  },
  {
    "text": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things) Hey everybody. I haven't posted here before but I thought this recollection is relevant, both in an alarming way and as an example of the kinds of anti-feminist rhetoric making waves not only on r/Men'sRights, r/the_donald and the alt-reich pits of 4chan, but also on nationwide daily conservative talk radio.\n\nAs a fiction writer intrigued by the depths of conspiratorial thinking, conservative talk radio is like a nightmare paradise. I started tuning in pre-election to try and comprehend some of the right's perspective, principally the stuff the right is being told by their media. Aside from a constant stream of slant and innuendo, and general fear-mongering, this segment from a few weeks back really stuck out.\n\nSavage's topic: \"an epidemic of false rape allegations perpetrated by radical feminists.\" Fitting neatly with the \"Look at what's happening to our poor boys!\" trope, he asked for callers to relay experiences of faked accusations for the purpose of slander and character assassination. His first caller was a woman in tears. She was barely able to speak about experiencing a rape in her youth that she was never able to get herself to publicly admit before. It was very hard to hear, particularly when Savage was less than accepting at first, asking her why she never came forward, asking what she hoped to get out of admitting it now. Eventually he relented and wound the conservation toward some notion of an older, better America where \"your brothers would take care of it.\" \n\nThe next caller was a guy who was utterly on board with Savage's thesis. He said that his sister-in-law cooked up a story about him molesting her kids, even coaching them to lie to lawyers, in order to discredit him and get him fired from his job (which was successful.) When asked why she would do this, he said \"she just didn't like me\" (the most suspect sentence I've ever heard, BTW). Regardless, this fakery, while manipulative and wrong, had nothing to do with feminism and/or sexual assault of feminists. So Savage was 0 for 2 on his big evil topic. \n\nThe third was a guy who was raped while attending a christian monastery. It was another sobering discussion of sexual assault and the effects it has on the body and mind, denial, acceptance, the unstable road to recovery, etc. \n\nCaller after caller...zero examples of false rape allegations. The segment concluded with a nurse who specialized in processing rape victims, she laid out all the gory details of examination, while Savage tried to derail her data and facts with ideas like \"Well if there's no clear DNA evidence, the claim must not be believed, right?\" He didn't get far on this tract. Strangely, they ended up on mutual terms when ascribing a rise in rape incidents and rape culture to violent video games, violence in films and, both inherently racist and lazy, on rap music like Kanye West. The segment trailed off into Savage basically thanking his audience for a frank discussion of a very hard topic, and then the station was barraged by ads. \n\nConsidering where things ended up, it was easy to forget how it began-- Savage wanted to hear about devious man-hating and man-destruction by means of what he sees as a pivotal radical feminist tool, the pointed finger of accusation and the presumed guilt of the men being accused. But when exposed to real people in the audience, with real experiences, there was a near unanimous 180 degree turn. As brutal and frightening as his initial topic was, and how horrific it is that such concepts are preached to the masses as being some epidemic feminazi plot, he totally failed. It was heartening in a grim way. \n\nAnyway, thought I would share this attempt to demonize feminism, particularly because the response was not only lackluster but such a reversal. Other such BS, particularly online, gets hateful and vile very quickly.",
    "title": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things)",
    "subreddit": "Feminism",
    "timestamp": 1483351001,
    "score": 1,
    "keyword": "woman lawyer"
  }
]