[
  {
    "text": "Today, I cross the Rubicon I (45M) have been unemployed since July. I am in IT and live in SF. I have a home, a wife, a daughter, two step-daughters, a step-grandson, a cat, a dog, two guinea pigs, a lizard, a bat, a hat, and something stuck in the roof crawl-space. Oh, and and ailing parent whose rent is 4k a month. \n\nAnyhow, I've maxed my cards, taken an 800 credit score so low it would win in a strip club, sold what I can, and, through the graces of God, other God, Woman God, God's Plural, and Dragon Gods have somehow made it to round four of interviews--the stated final round.\n\nThe job would (theoretically) put me back to where we left off when we committed to all of this pre-pandemic. It would at least keep us housed and moms off the street.\n\nI don't know what the point of this post is other than, if any of you have some karma to spare, I need it today. I promise to update and share what I have left in return.\n\n*whoo-sah* and best of luck to you all.\n\nEDIT 1: The responses have filled me with so much pride and joy to be a part of this community, even when I troll. When people say, \"Mrg, the internet is a hell hole, mar Mar mar,\" or whatever, I'll point those dry ass people here. Humans have humans back. Everything else is a construct \n\nUPDATE: Had the interview. 45 mins. Longest one yet. I feel like I whiffed on a few questions. He's an engineer, and I am not. I also feel like we are connected as humans. The interview went over schedule by 30 mins. I ran out of questions to ask, other than \"You need a back rub, my dude?\" And so called a stop to the interview, which I know is a no-no but in my mind, wasting the time of someone on the clock is a bigger no-no.\n\nFUCK!!! I HAVE NO IDEA WHAT THE FUCK IS ABOUT TO HAPPEN.\n\nI need need need this.\n\nUPDATE 2: it could be a week before I know what happens next, but two things happened today:\n\n1) I did my best\n\n2) A huncka chunka strangers came out of nowhere with 100%  love and positivity (read the comments), thus reminding  me that there's hope no matter what. I fucking love all of you.\n\nUPDATE 3: I was gonna wait for a happy ending to drop this on you but eff it, I wrote a book (an epic really) that doesn't suck (entirely). So have a crack at it if you're into sci-fi/cyberpunk. Just protect my reviews. It's damn near all I have left.\n\nhttps://www.amazon.com/Burning-World-1-Berkley-Hinton/dp/1098339509?ref=d6k_applink_bb_dls&dplnkId=83fee8fd-a9a0-4863-994f-71cd717a512d\n\nAlso, the paperback is $12.00 on EBay, which is half the Amazon price.",
    "title": "Today, I cross the Rubicon",
    "subreddit": "jobs",
    "timestamp": 1702391299,
    "score": 1695,
    "keyword": "woman engineer"
  },
  {
    "text": "Fired for the first time in my life As the title says, I was recently fired from my Job (November 30th).  It was for a stupid reason, but it is essentially preventing me from getting unemployment.  It's currently in adjudication.  I'm basically at the swan song part of my working life, I'm am 59 1/2 years old.  Since I can no longer do the kind of work that I spent the majority of my life doing, I am relegated to no experience labor type jobs.\n\nBeing the age that I am with relatively no lengthy work experience in these no experience labor type jobs has made finding work a real challenge.  Now that I have been fired, I'm stuck trying to explain why I was terminated.  I'm finding my age, the fact that I don't have related work experience, and being recently fired a major hurdle to overcome.  It also doesn't help that I am a woman, people just see me as some old lady, not a potential applicant when I show up for an interview.\n\nI've worked my entire life, never once been fired, just have a skillset that I can no longer work in, and quite frankly, haven't done for the past 10 years anyways.  Did a job at a highly specialized manufacturing place that doesn't translate out of that sort of work.  It was at a high density micro flex manufacturing company, there are only but a handful in the US that do that sort of work.  My last place of employment was at a Amazon warehouse, so now you understand the stupid reason for termination.\n\nI'd like to continue working in some form of manufacturing or warehousing work but lack the work history to apply for anything but no experience.  If I do get an interview, they are taken aback by my age and immediately see me as their grandmother or something.  I also just don't know how to talk about being fired.  In my opinion it wasn't something worthy of a termination, but it's their company, they can fire at-will employees for just about anything.\n\nAny advice on how to get a entry level job in a field that is clearly dominated by men when all you really have is the ability to learn, work hard, and be 100% dependable?  Trying to break that glass ceiling.  Any older female workers out there been in the same boat?  I like working in a labor intensive fast-paced work environment, it makes the day go by faster.  Amazon gave me that.  I've applied to a truck manufacturing job that claims they will train you and no experience required, but fear as soon as they see me, they will assume I am not going to be up for the job.  I can't really blame them, very few women seek out this sort of work at my age.\n\nEDIT:  \n\nI'm so glad I made this post, you all have been very helpful and have picked up my spirits.  The reason I am looking for a labor type role is because I can't sit for long periods of time without developing swelling in the legs, feet, and ankles.  I have lymphedema.  I manage it best by being on the move all day, desk jobs are not a fit for me with this condition, even with compression stockings.  Never had a flair up while working at Amazon.  Every desk job I have ever had has always caused a flair up over time.\n\nMy termination from Amazon was a category 1 safety infraction.  I appealed the termination, but Amazon is not known for overturning such dismissals.  It was a minor incident, no one was injured, no damage to equipment, just let go of a stow cart as I was moving it out of one of my aisles.  No risk to anyone as no one was in the area at the time.  Amazon is pretty black and white about their safety infractions, so they are all treated like someone could have been injured et al.  No gray area.  They don't make it a point to tell their employees what they consider termination offenses, they just call them category 1 offenses.  You basically find out, after the fact.  It's this termination that is causing hiccups with my unemployment claim and my future ability to work at a place that highly values safety in the workplace.  They may not consider it a minor incident any more than Amazon.\n\nA little history of the types of jobs I have done:\n\nWorked at a bicycle manufacturing company where I worked on a moving line attaching components and routing brake cables, among other things.\n\nWorked at a high-density micro flex printed circuit board manufacturing company.  Worked in their imaging department laminating substrate and silk screening solder mask, printed customer designs via laser direct imaging and processed them through a developer bath.  Went on to do the CAM department where I prepared customer files for manufacturing and created laser and CNC files for manufacturing.  Highly specialized work, really only a handful of companies in the entire US that do that sort of work.\n\nWorked in the aerospace industry as a computer-based training multimedia developer.  Worked with engineering models and data to create 3D animations and graphics for their courseware. Worked on both military and commercial training and held a top secret clearance while in that role.\n\nWorked at an Amazon delivery station processing packages for customer delivery.  Worked on both their automated and manual belts.  Scanned and moved packages weighing up to 50 lbs into totes or onto OV racks for pick and stage.  During pick and stage, picked packages and totes from these locations based on delivery route and staged them on carts for the delivery drivers.  These were the primary work paths, also worked in haz mat, problem solve, jackpot, induct, and non-con.\n\nMy resume only reflects the flex printed circuit board company and Amazon because it is the most relevant and most recent.\n\n&#x200B;",
    "title": "Fired for the first time in my life",
    "subreddit": "jobs",
    "timestamp": 1702835320,
    "score": 137,
    "keyword": "woman engineer"
  },
  {
    "text": "I regret applying to a job in a city I don't particularly like... I was laid off for 6 months and I accepted a job in PNW (Portland, OR) which is 1,000 miles away from home and family, my only mother after my father passed away from cancer. It was really an impulsive job application and in the middle of an emotional reaction and thinking about it now, I regret my decision, because it turns out to be a really cruddy city all around and I don't believe it is a city meant for me. I don't know if I should rescind my acceptance this far in. I'm not financially tied, and I can live with my mom. But it doesn't make me feel better either way. I'm not happy in either location..\n\nAnyway, I will be turning 35 very soon and a single woman with no kids. I just want to make a life for myself as I am very behind in that regard, live in a city that makes me feel enlivened and bring about my best self, and hope that everything will fall into place and meet someone. But it's hard to believe this when I have been feeling so down all the time and stuck. I just want to switch to a job I enjoy doing like software engineering. It feels like I'm having a really low phase with dark clouds ever looming over me.\n\nTrying to decide if I should apply to some other random place I've never visited. -\\_-",
    "title": "I regret applying to a job in a city I don't particularly like...",
    "subreddit": "jobs",
    "timestamp": 1697324412,
    "score": 30,
    "keyword": "woman engineer"
  },
  {
    "text": "No idea what I want to do with my life I (F 23) am so done working as a sheep at a basic administration job. Long story short (hopefully) when I was 20 I graduated with business administration but I knew that I could do so much better. So after a gap year I studeed Engineering, because of a traumatic incident I had to quit. Now (almost 8 months) I work fulltime at a building company where I am the only black woman. First I tried taking the benefit of the doubt and just keeping the mindset that this is temporary and that I won’t lose myself. Well that didn’t work, it feels like a prison where they micro-manage me and treat me like I’m stupid (little that they know that this work is sooooo under my level). I keep applying for a job which has more diversity for a short time cuz I wanna study next year. But that’s the thing, I’m not sure I want to study Engineering. I love the way it makes me think etc but idk I want to make a career out of it. This stuff keeps me awake and I don’t wanna end living in a dead-end job where I will except to be the puppet of an awful environment. \n\nPlease help me, what would you do if you where in my place?\n\n*English isn’t my first language, hopefully it’s readable 😅",
    "title": "No idea what I want to do with my life",
    "subreddit": "jobs",
    "timestamp": 1692563492,
    "score": 7,
    "keyword": "woman engineer"
  },
  {
    "text": "Does my job sound toxic? I cant deal with the management and the moaning of the staff anymore! I am going back in tomorrow after my holiday and I am dreading it. \n\nThey made us swap shifts for one new starter, even threatened us with a months notice forcing it. Because her husband elsewhere cant swap shifts and she needs to be on a particular shift for her kids. This toxic woman on the other shift convinced management to get the new starter on her shift as she knows her. So at the end of August we're swapping shifts over. It wrecks my pre-booked holidays. Then after Christmas we usually swap shifts around so we dont always finish at Christmas on afternoon shift. But this new starters husband doesn't do that so we have to stay on the same shift. All for one person who also has no experience at all!?\n\nI am supposed to be training as an engineer. Yet constantly doing other peoples jobs as we're understaffed. I dont have a training plan or anything. Never have a review, my supervisor doesn't really care and you never see the management. I applied for supervisor earlier this year and I heard a manager say nobody applied for it. So did my CV get thrown in the bin or something? I got promised training from outside the company in February. Got told 2 weeks ago they cant afford it now, after they told us all in a company meeting we made £8.6 million turnover already this year. \n\nPeople always complaining about others. Office has different rules than shop floor. Like we cant go on phones but they can. This is my 10th job and I feel stuck. I'm on a decent wage and cant get paid more elsewhere. Its this or minimum wage for me. I feel like I will never become an engineer, I am halfway but its stopped as its the advanced stuff I need now. I am so fed up and stressed. I have told them all this and I moan a lot myself, because I am so frustrated. Is it Toxic or is everywhere like this?",
    "title": "Does my job sound toxic?",
    "subreddit": "jobs",
    "timestamp": 1691349667,
    "score": 6,
    "keyword": "woman engineer"
  },
  {
    "text": "Preparing to be fired TLDR: I work at a small company (in the US for context), my boss has recently become very hostile and clearly wants me gone. I'm preparing to be fired and I want to know if there is a way I can negotiate some kind of severance/keeping my insurance for a couple of months or until I find a new job. Also, I would love to know how being fired works...I know it's silly but I've never been fired before, what kind of paperwork should I expect? Any red flags I should watch for? Thanks!\n\n&#x200B;\n\nI am an engineer at a small company (\\~ 45 people). I interned at the company for six months and was hired on full-time in June after finishing grad school. I have monthly 1x1 with my boss; in June/July, everything was great. August, my boss tells me that everything I'm doing is wrong, 'some people' have communicated that I'm not working hard enough, and I'm not following safety protocol. I was in shock during the meeting and didn't say much, the feedback was not given in a particularly professional manner (if this were actually about being constructive, I would have expected something along the lines of 'There are some concerns with your performance, let's discuss goals and expectations to get you on the right track'). Anyway, I was quite concerned and set up a follow-up meeting for the next week. In that meeting, I asked him to clearly outline his expectations, provide me with deliverables, and ask if there are any other areas of concern/where I can improve. He pretty much gave no feedback and said it would be easier for him if he typed everything out/put it in writing (sure makes sense, I guess). I never received that document. That Friday (10 days after our first meeting), I was handed a PIP by my boss and HR woman. The PIP contained gross exaggerations of the truth as well as straight lies 'We have met many times to discuss the issues, and \\_\\_\\_ refuses to comply\". I informed HR of my concerns, but they, unsurprisingly, ignored them. She has made no effort to confirm the allegations and has not spoken with anyone else in the department regarding my performance. We have had a couple of meetings since, and every time, it's my boss knit-picking every tiny mistake I've ever made (mistakes he and my coworkers have also made and things he has brushed off as 'totally fine' in the past) and the HR woman telling me I'm 'too defensive' and I 'need to learn how to take feedback'...It's straight up emotional abuse, my coworkers agree that I'm being treated unfairly and have been very supportive. Unfortunately, there's only so much they can do without jeopardizing their own jobs, which I totally respect.Anyway, I hit the job search hard the moment I started being mistreated, but it's a tough market. I don't think I'm going to have a job by the time my PIP is up (I'm sure I will be fired then, if not sooner,) and I'd like to somehow get the company to give me severance or keep me on their healthcare for a month or two. I don't really have the means to sue (recent graduate), and while there is some documentation of poor management and I have my coworkers backing, I don't think there's enough evidence for misconduct. Wondering if I have any options here or if I'm just SOL. Would also love to know how being fired works...I know it's silly, but I've never been fired before, what kind of paperwork should I expect? Any red flags I should watch for? Thanks!",
    "title": "Preparing to be fired",
    "subreddit": "jobs",
    "timestamp": 1693101009,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Will tattoos deter me from getting high paying jobs? Within the next three years or so, I’m planning on getting both of my arms, chest and neck tattooed.\n\nI’m an engineering graduate and probably will work white collar jobs for the rest of my life.\n\nI was wondering if an interviewer saw me, will they just automatically reject me?\n\nI’m a woman in my 20s if that matters.",
    "title": "Will tattoos deter me from getting high paying jobs?",
    "subreddit": "jobs",
    "timestamp": 1683738041,
    "score": 3,
    "keyword": "woman engineer"
  },
  {
    "text": "Ghosted after signing an offer letter. As a software engineer with about two decades of experience I thought I have seen it all, ranging from a plush animal stolen from my cubicle to higher-ups bragging about getting banned from an ad platform for clickfarming.  Once I've even exchanged rings with the founder of a startup I was working at.  This last one is not as spicy as it sounds though -- he designs puzzle rings as a hobby.\n\nPlease bear with me if the following reads like a paranoid rant.  Paranoia is a requirement of my profession -- whether it involves ensuring a messaging application is cryptographically secure, or that web services don't fall over costing potential millions and making the company lose face -- and not the result of emotional trauma inflicted by an ex.\n\nIt all started on October 17th when a representative of The Staffing Agency reached out to me on LinkedIn on behalf of their client, The Big Tech Firm In The Silicon Valley That You've Certainly Heard Of.  They needed someone with \"good experience in Developing Python and C++ from Scratch\" (???) and I would \"be well compensated\".  I'm well-versed in both so I figure I could be their unicorn, especially if it's onsite.  I schedule a call and we discuss the role a bit -- which ends up in fact being an onsite contract -- though he has no further technical details to offer.  The subject of compensation comes up and after I inform him of my prior base pay he tells me that The Firm pays better than that.  \"Well, you sketchy enjoyer of mothers,\" I think, \"promising me the Moon right off the bat.\"  I let it slide for now and we decide to proceed with the interviews, though I have to ask them to never cold-call me and always communicate through text or email in the future -- a truly inscrutable notion.\n\nThe introductory, nontechnical call with a manager goes well and I get scheduled to speak with a couple of engineers for 90 minutes.  One day prior I get an email with the job description -- scant on technical details like the software stacks, but offering work on \"many multifaceted projects\".  As a generalist, I figure I can pass the technical interview in Python and excuse myself for being a bit rusty in C++ given that I haven't used it in over 4 years.  The interview comes along and I'm greeted with coderpad.  Compiler?  GCC.  Confused, I ask if I'm interviewing for the hybrid Python and C++ role.  They also appear confused, and inform me that this is a purely C++ position.  Everyone's confused! and, personally, I'm flustered even -- at being put on the spot like that.  I decide to make the best of the situation and plow through knowing that I'll have to look up how do to basic shit like file input/output while under scrutiny.  At some point through the first challenge I try to do something clever with variadic functions but draw a blank that I actually want variadic *template* functions instead, so after much ado in the weeds I finally end up solving it in the most straightforward way possible, and after a little debugging it just works.  And all it took me was 50 minutes instead of the 5 it would in Python.\n\nI'm morally preparing myself for the second, harder challenge -- as that's how I typically conduct my interviews -- when one of the interviewers asks... \"Do you like puzzles?\"  I roll my eyes and sigh \"not really\".  We're about to burn ropes and weigh coins and shit.  After the remaining 40 minutes of the interview is spent burning ropes and weighing coins the interview concludes, leaving me sitting there wondering what the hell just happened.  I ultimately decide not to worry about it too much.  Yet.\n\nEarly evening rolls around and I get a text from Sketchy (as I'll call him from now on) asking me how the interview went and wishing me a good morning.  Taking that in stride I fill him in and that's that for now.  It's a Friday and I don't expect anything definitive until next week.  Monday comes along and I get a text message to call him, which I do, and well what do you know?  They wish to extend me an offer!  There is another person on the call who I presume to be Sketchy's manager filling me in on the details.  Eventually she gets to the actual hourly rate she has in front of her and I resist the urge to check whether I've taken my Math degree off my resume, as not even accounting for inflation it would be below the base salary I've had 3 years ago, at a startup, where the main draw would have been the stock options.  At such a rate I would expect to grow some ever-expanding copypasta and wrangle with brilliantly unorthodox variable naming conventions meant to maximize job security.\n\nSomehow during her spiel the rate gets lower leaving me wondering what I'll even be getting paid in that fluctuates so quickly.  Bitcoin, or possibly Tether?  Near the end she catches herself and reverts to the previous deeply insulting rate and we have a good long laugh about the gaffe.  At this stage I'm wondering if there's even any point in negotiating with these imbeciles.  Sure I could try to haggle it up a couple of bucks, and we can all feel proud about what a tough negotiator I am, but that was literally the only technical interview I've gotten since July and they probably think they have me by the ba-- I mean the economy is doing great and nobody wants to work!  Cynically, I figure my best course of action would be to accept the offer and continue looking for work while having The Firm as my current place of employment.  Normally I wouldn't even contemplate doing something so underhanded, but considering the levels of contempt, I feel entirely guilt-free.  I accept the offer, they are very thrilled about it, and I pretend to be entirely stoked about working at The Firm.  They then inform me that they will send me a verbal offer letter email -- **klaxons blaring in my head** \\-- and then do the background check once I confirm my employment.\n\nFor the uninitiated, there is not -- nor has there ever been -- such a thing as a *verbal offer letter email*.  There is a verbal offer, which is what was being discussed, which I have accepted, and which is legally completely non-binding though it may be considered rude to break depending on circumstances -- I had one rescinded right when the pandemic lockdowns have started and would not blame the other party.  Then there's the written offer, which involves the employer sending you an offer already signed by them, which you then also sign, make a copy, and send it back.  This kind of offer is generally written to be contingent on the background check passing so there's no obligation of employment in case a candidate fails to disclose anything shady in their past, and even in at-will employment states like California there may be legal ramifications for breaking such a contract.\n\nAs far as I'm aware, the only practical reason for an employer to foot the bill for a background check without a legally binding offer is if they think they can bait candidates with their \"verbal\" offers into thinking that they have *actual* offers while having The Firm interview candidates The Agency can lowball even further.  After all, there's a lot of fish in the sea, why not keep fishing for an even bigger one?  They can then give a proper offer to the lowest bidder and pocket the difference, with $40 or so per background check just being the cost of doing business.  At this point every fiber of my being is screaming at me that I'm getting scammed, but we wish each other a good rest of the day and hang up.  I am to start work the Monday after Thanksgiving, almost 3 weeks from today.\n\nBefore doing anything else, I wait for their \"verbal\" offer just to see what they think that looks like.  Sketchy's manager-apparent, who ends up having a much fancier title, sends it to me two days later and it so turns out that a \"verbal\" offer is just a list of colon-separated name-value pairs -- e.g. \"Work Hours: 9am - 6pm\" and yes that was in there -- telling me informative things such as the pay rate and which city I'd be working in.  For some reason the offer is prefaced with a \"Congratulation on your offer\".  I feel a bit cheated for only receiving a single congratulation, but I suppose it's fair as nobody else in their right mind would profess any more of them for a mere \"verbal\" offer.  Perhaps this woman -- let's call her Jiàndié -- comes from some kind of country where they don't have plurals?  Anything is possible at this point.\n\nAfter consenting to the whatever that was, I decide it's time to sit down and try to figure out who these clowns are.  First I pull up the source of the interview invitation email and do a `whois` on the original IP address.  That checks out, so at least my interviews were scheduled by someone actually at The Firm.  Next I look up The Agency to find out that it's located in the very same county as The Firm.  It is very strange, then, that their representative(s) would appear to not know or care about: The Firm's timezone; the job role's technical requirements; The Firm's compensation rates; how job offers work.  I look Sketchy up and turns out he's in the Philippines.  Well, that explains one of the discrepancies though it doesn't excuse it.  Meanwhile, the background check website is asking me for my SSN.  This really doesn't sit well with me, but they seem like a major provider, so I fill out the form and hope my identity doesn't get stolen.  There's nothing to do but wait now.\n\nJust under a week passes, and my offer letter comes in!  Almost had you there for a moment didn't I?  What I actually get is an invitation to log into a staffing portal where I can fill out and sign an entire wastebasketful of forms including the offer letter.  I make time to go through some of the paperwork the following day -- most notably find the offer and sign it just to get that out of the way.  Avoiding anything financial for now -- subconsciously my heart is really not in it -- I continue filling out and signing some of the more trivial stuff, being unable to help but notice how the paperwork is frequently irrelevant if not downright nonsensical.  Among the forms consenting to be drug tested and not being tardy (???), I have to sign waivers for non-exempt employees regarding lunch and work breaks, in one case even having to sign the waiver and the revocation of that very same waiver within the same document.  The laughable rate I'm at is still above California's standards, and the offer letter was explicitly titled \"Exempt Offer Letter\", so none of that particular paperwork even applies to me and is a complete waste of time.  I decide I'm done for now and will fill out the rest closer to the start date.\n\nNothing happens for another week or so, but on Tuesday before Thanksgiving I get a text wishing me a good morning in the afternoon -- I'm used to this by now -- and asking me to undergo onboarding.  That same day I tell them I can show up Monday wherever, ideally not too early.  Afternoon on the following day -- Wednesday before Thanksgiving and the long weekend -- they inform me that it's not for The Firm but for them and ask if I can do so later today.  At this point I'm questioning their lack of planning but within twenty minutes I reply asking if they wish to do so in the next hour or so.  After a couple of hours of not getting a reply I ask if they can schedule something through email, and once more get nothing in return.\n\nAt this point I feel fairly bummed.  Thanksgiving comes and goes.  On Friday I attempt to fill out the rest of the paperwork, but run into a bit of a snag -- I can't log in.  Surely I must have forgotten my password. .......Right.  I try to reset it, twice, no such luck.  It would appear that the contract that I've signed has gone *unilateral*.  I'm shocked. Shocked! Well, not that shocked.  I'd call them but since the Philippines and the country that oughtn't be inquired about haven't reached out to me at all so far, Happy Thanksgiving to the both of them!\n\nThe weekend comes, I do laundry in vain anticipation that I'll have an actual workweek and won't have time to otherwise.  On Monday, still having heard nothing and now feeling like for the first time in my entire professional career I'm a no-show on the first day, I call up an acquaintance at The Firm and try to figure out what's going on.  They tell me they'll check, and get back to me.  Close to 8 PM they tell me that apparently I start work tomorrow...  Still nothing from The Agency, outside of apparently having been signed up for some mandatory training by a third party.  I make dinner around 9, check my email after, yet more nothing.  At this point I'm thinking screw it, so I just hang out online with friends til about 2 AM and try not to think about it.\n\nI decide to check my email one last time before I shower and go to bed and lo and behold!  Turns out I got an email at 10:19 PM from Jiàndié titled \"First Day Instruction\".  Well, at least there's only one instruction.  She \"needs\" me to go somewhere tomorrow before 10:30 AM to get a badge, and then go to Some Acronym building to report to my manager.  OK, that's actually two.  Furthermore, the email is using creative capitalization and various spellings of the word \"you\", and the best part is it's replying to my consent of the \"verbal\" offer letter with the stipulated start date of today.  I'm experiencing a mix of amusement and growing outrage I haven't felt the like of since my ex.  This fish is really getting its chain yanked.  Being too angry to respond I decide to just go to bed for now, but for obvious reasons can't fall asleep until about 7 AM.\n\nAt 9 AM I am awoken by a phone call probably from The Agency that I don't even bother with.  At this stage I'm feeling pretty beat as well as being completely out of any f---s to give.  At 10:07 AM I receive a text repeating the instruction of where I have to be in under 23 minutes from now, and that they can schedule onboarding sometime this week.  I make myself breakfast, sit down, and reply to Jiàndié -- CC-ing Sketchy -- that to the best of my knowledge I have no contract with them, please do not contact me any further, and have a nice day.  She immediately responds asking if I talked to Sketchy and whether I got another job.  And this is the story of how I fired a Big Tech firm on my first day, though they likely think I threw a tantrum and ragequit over a scheduling mistake.\n\nThe cherry on top is that even as I'm editing this on December 10th, I'm still receiving daily email reminders to complete some mandatory training on how to safely browse the web.",
    "title": "Ghosted after signing an offer letter.",
    "subreddit": "jobs",
    "timestamp": 1702249462,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Sketchy Insurance Company Interview Cold Call I’m a software engineer by trade and have been exploring other opportunities within the field. In my pursuit, I uploaded my resume to Monster.com. About a day later, I got a call from an insurance agency in the area (I live in the United States for reference.) They said that they saw my resume and that they thought I had transferable skills that could be applied to a sales or managerial position. I looked up the company, and it’s a real insurance company with an actual office in the town they said they are calling from.\n\nHere’s where it gets weird/where I need advice. The woman on the phone basically said “We would love to schedule you for a preliminary interview on Tuesday.” I thanked her, but asked if she could please send me a job description beforehand so I could basically know what I’m getting myself into. I especially wanted to know benefits / compensation, because if it’s worse than my current position I don’t want to waste my time with an interview. The recruiter apologized and explained that she was only permitted to discuss the time of the interview with me, not the details of the job. This set off about 150 red flags (I’ve had some bad work experiences in the past.)\n\nI hesitantly agreed, but I’m leaning toward calling her back first thing Monday and respectfully declining the position because the more I think about it the stranger and stranger it seems. I’m wondering if there’s anyone familiar with the recruitment process for insurance agencies that can tell me if this is normal procedure or if this is setting off red flags for them as well.\n\nThank you very much for the advice.",
    "title": "Sketchy Insurance Company Interview Cold Call",
    "subreddit": "jobs",
    "timestamp": 1684611853,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "What's next for a jobless Veteran? I am not sure if I should put this in /r/careerguidance or not. I'm former Military and I was in Iraq in 2003 when the war started with the 173rd Airborne out of Vicenza Italy. This doesn't even matter to the story, but my friends all tell me, \"Hey, you should use your veteran status more!\" Honestly, being a combat veteran has never helped me in the slightest. If anything it attracts people who love guns and want to show me their gun collection as they tend to make the assumption that because I was in the Airborne Infantry I'm some sort of gun fanatic. Not true. Anyway...  \n\n\nI left my job as Senior Product Support Specialist at a small startup company back in August 2022. I worked there for five years. I was just one of two people on the team and as the company grew the support team grew to about 8 people. My duties included answering the phone, live chats, closing support tickets, talking to the engineering and product teams about bugs, editing websites, writing documentation, training staff, and general quality control. I also volunteered to manage their IT issues internally. The pay for this role was $32 an hour.\n\nAfter hitting my five-year anniversary I was a bit burnt out from constant work and I hadn't seen my friends and family in Europe for a long time due to COVID lockdowns so I decided to quit my job, sell the stuff I didn't need, and travel Europe for three months. I figured once my trip was over I would just come back to the USA and find a job with no issues. Boy was I wrong. Once I returned to the USA I stayed with many friends scattered throughout the country while I applied for jobs. I started in Northern Virginia, then San Francisco, Miami, Denver, and now back to Northern Virginia.\n\nDuring my exit interview at my last job, HR told me that once I got back from my Europe trip I should check in and see if I can get my old job back or negotiate more pay at a different role. Wow, what a nice offer I thought. Once I returned I did just that. My old manager let me know they were not hiring for any senior roles because they could not afford it and they had coverage from cheaper hires now since I left. \n\nHR then advised I check in with a sister company that handled their customer website creation. This was one of my former duties, so I had experience with website editing. They scheduled an interview with the CEO of that company. We talked for about 30 minutes and he said he would get back to me. A week later he said he felt like I didn't know enough about website editing. This came as a shock to me since that was one of my duties at the sister company...for the very same websites that this company had taken over. So that was it, the door had been closed on my face after three months away. Oh well, it's time for a new job anyway.  \n\n\nSo I have been applying for Product Support roles and IT Support roles since October 2022. It is now July 2023 and I haven't had a single offer. I have been the second pick but never the first pick. Feedback has ranged from, \"You seem desperate\" to \"You're over-qualified for this role\".\n\nSo the reason I'm writing here is for a different perspective. I don't know what to do anymore. I realize that a lot of people who post here are in the same boat, feeling totally hopeless and wondering what to do. I guess I've reached that mental breaking point. I exhausted all my friend connections for places to stay.  \n\n\nI'm not married to the idea that I need to be product support because it seems that job role is flooded with applicants, but I'm not sure with my skills what I should do next or who would even hire me. I have applied to IT roles, but have been rejected for lack of certifications. My past roles have mostly been sales positions but I would go crazy if I went back to that world. I worked at Verizon Wireless and Cox Communications. I also worked at a call center making calls to sell people homeschooling. That was soul-sucking.  \n\n\nWhen a recruiter tells me that I should be applying for Senior roles, but no Senior roles are posted it's pretty disheartening. I'm at this weird place where I don't seem to have any specialized skills that a company is looking for. Besides my work/army experience, all I have is a BA in English.  \n\n\nWhen I look at some of the posts on /r/resumes or even on /r/jobs it seems like the problem isn't even experience, but getting a job where you are behind a computer screen is like winning the lottery.  \n\n\nIf I were to be offered a job sitting in front of a computer screen I would take it, as long as it is not sales. But ideally, I would like to be outside talking to people. I never loved the Army life, but I do miss the adventure side of it. Part of me wants to either teach English in Europe or get a boat captain license and give boat tours or something. Hell, even working a coffee shop job at a resort in Europe would be cool. I met this woman who quit everything to work in a coffee shop in Ibiza. Amazing life. Of course, her brother-in-law owned the shop.  \n\n\nI guess this is more of a rant than anything. I just don't know what to do anymore. Applying for jobs daily is yielding zero results and I'm only wasting my life force with no payouts.\n\n&#x200B;\n\nTLDR - Quit job of 5 years to travel thinking finding a new job would be easy. Now stuck like everyone else on this subreddit. Out of a job and almost out of money.\n\n&#x200B;\n\n  \n\n\n&#x200B;",
    "title": "What's next for a jobless Veteran?",
    "subreddit": "jobs",
    "timestamp": 1690307488,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "My friend divorced her loving husband because he wouldn't leave his job in Saudi Arabia It came as a surprise. They were so in love. He was handsome and she was pretty. A perfect match.\n\n\"He is the one,\" she confided in me when we were in college.\n\nFor years they struggled to find stable jobs in the US. The husband was feeling a bit depressed and, somehow, he found a gig to work as a recruiter for a US oil company in Saudi Arabia. The job was never meant to be permanent but it paid really well. \n\nAt first, she would fly to see him monthly. Monthly visits weren't enough for her. Eventually, she quit her job and moved there with him. \n\nIt was only a few years, she said.\n\nWell, \"a few years\" became longer and longer. We stopped counting.\n\nShe told us she was happy. \"They have everything in the compound. I can do anything I want. There are so Westerners here.\"\n\n\"Aren't you bored?\" I asked innocuously.\n\n\"Not really,\" She lied.\n\nTurned out there was no fulfilling job for Western women. She stayed in the compound all days. Yes, he made enough money for both of them now but she became a prisoner in her own home. She couldn't even leave the compound without permission.\n\nPermission!\n\nAfter 10 years, she couldn't take it any long. She threatened to come back to the US alone. He accused her of being selfish. Afterall, he could provide for both of them now. There was no need for her to work. God forbade if she was lonely. So many content Western women in the compound. She just needed to be like them. So many things she could do in the compound!\n\nShe left. He didn't follow. \n\nHe never understood what she needed.  He could provide for them. She was safe in their home in the compound.  What else she possibly wanted?\n\nNow my friend is alone in the US and her ex is dating another woman. This woman is happy in the compound. She is content to stay at home and wait for him. She is happy to hang out with other Western women during the day inside the compound. \n\nI wonder how many years she can stay happy.\n\nUpdate: I think she studied performing arts and she dreamed to be a performing artist. She is not a doctor and engineer. She loves to dance and sing on the stage. She is now in a local band.\nI confess I don't know much about Saudi Arabia but I know my friend weren't happy there. There was no fulfilling job for her in the compound. Is it wrong for my friend to want to share her talents on the stage?\n\nSecond update: Where did those misogynists come from downvoting my sisters' comments? They speak of the truth. We will not be silenced.",
    "title": "My friend divorced her loving husband because he wouldn't leave his job in Saudi Arabia",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1680470505,
    "score": 4117,
    "keyword": "woman engineer"
  },
  {
    "text": "A work meeting without any men I’m an engineer, which we all know is male-dominated with all the crap that comes along with working almost exclusively with men. I’m so used to code-switching and over explaining myself just so the men will take me halfway seriously. Today I had a inter-agency project scoping meeting and it just so happened that we were all women. It was so nice! No one interrupting, no one being dismissive, no need to code-switch, we could all just talk naturally to each other without putting energy into remembering to remove the softening words because there were no men to read it as lack of confidence instead of the actual meaning of being polite and open to discussion. It was collaborative instead of competitive and it only took 20 minutes to come up with a framework everyone was happy with. One woman said she’s been an engineer 20 years and this is the first time she’s ever been in a meeting with only women. As more women go into engineering I hope it happens more often, it was the easiest meeting I’ve ever attended.",
    "title": "A work meeting without any men",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692382200,
    "score": 970,
    "keyword": "woman engineer"
  },
  {
    "text": "men are so emotional at work if i behaved the way my male colleagues did, idk if anyone would speak to me.  \n\nthey get so angry and start cursing/yelling. they will express their frustrations about certain issues very openly and it scares the fuck out of me. \n\ni just called an engineer at my job to relay a message about an engineering issue. he immediately WENT OFF. he was like “this fucking idiot!!” (referring to the person who had asked me to call).  i didn’t have the name he needed or any other info bc the person who had called originally didn’t give me anything. he yells, “GIVE ME. A FRICKING. NAME!”\n\ni totally froze and waited for him to be done ranting. i honestly couldn’t tell if he was screaming at ME about not getting the name or screaming at me about the other person who didn’t give a name. either way, he was screaming at me and i almost cried when i hung up. there is only one other woman in the office (my supervisor) and it seems she just keeps a calm demeanor when things like this happen (although i haven’t heard her being yelled at like this). we both have this calm, accomodating customer service attitude, while the men just say whatever tf they want.\n\ni don’t know how to deal with this, bc even though i’m not the one who fucked up, i don’t appreciate being yelled at and idk what to say to this engineer when i see him. i need people to know that at a bare minimum, they have to speak to me in a normal tone of voice.  fyi the engineers at my job are normally very friendly, respectful, and nice to me, so this incident caught me by surprise.\n\nwhat would you guys do? talk to the guy next time you see him? i feel like he won’t take me seriously bc i’m so young. am i making a big deal out of nothing? i think men yelling and venting frustrations is normalized in my work place, but i think they can do that without yelling directly at me, no?\n\nedit:\nidk which person it was bc he didn’t say his name over the phone, but i have my suspicions. i’m thinking of saying something like this the next time i see him:\n\n“i know you were frustrated over the phone, but i don’t appreciate being spoken to like that. i am much more able and willing to help you when you speak to me in a calm and respectful tone”\n\nthoughts??",
    "title": "men are so emotional at work",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1683302624,
    "score": 755,
    "keyword": "woman engineer"
  },
  {
    "text": "Why you should not get a Ring camera I see a lot of advice on here telling other women to get a Ring camera in order to feel safe. Look, I totally get it. Being a woman is scary and a Ring camera makes it seem less scary. \n\nHowever, owning a Ring camera is a huge risk, _especially_ for women. \n\nAmazon has made many agreements with the police to access your camera footage. Search for your state. \n\n“The Wareham Police Department signed an agreement with Amazon's home surveillance equipment company, Ring, in 2023 to gain special access to the company's Neighbors app.”\nSource: \n\nhttps://atlasofsurveillance.org/search?utf8=✓&location=Massachusetts\n\nAlso, hundreds of Amazon employees have access to customer data and videos. On top of that, Ring has had terrifying hacks in the past:\n\n“So, then, more abuse of that access occurred. In January 2018, a male employee used his access rights to spy on a female colleague's videos, looking her up using her email address.”\n\n“Importantly, because Ring failed to implement basic measures to monitor and detect inappropriate access before February 2019, Ring has no idea how many instances of inappropriate access to customers’ sensitive video data actually occurred.”\n\n“In some instances cybercriminals used the two-way communication to terrorise Ring customers, like something from a horror movie:\n\n-Several women lying in bed heard hackers curse at them\n\n-Several children had racist slurs thrown at them\n\n-An elderly woman in an assisted living facility was sexually propositioned and physically threatened\n\n-A digital intruder told a woman through her camera that they had killed her mother, and then said: \"Tonight you die\"\n\n-A woman was told her location was being tracked and that her device would self-destruct at the end of a countdown. She disconnected the device before the countdown ended.”\n\n Source:\n\nhttps://www.malwarebytes.com/blog/news/2023/06/amazons-ring-camera-used-to-spy-on-customers\n\nIn general, the best thing to do is limit the amount of data Amazon has on you.\nAmazon Alexa has violated the privacy children before:\n\n“Amazon also offers Alexa-enabled devices and services targeted to children and collects personal data, including voice recordings, from children. Amazon retained children’s recordings indefinitely—unless a parent requested that this information be deleted, according to the complaint. And even when a parent sought to delete that information, the FTC said, Amazon failed to delete transcripts of what kids said from all its databases.”\nSource:\n\nhttps://www.ftc.gov/news-events/news/press-releases/2023/05/ftc-doj-charge-amazon-violating-childrens-privacy-law-keeping-kids-alexa-voice-recordings-forever\n\nUnderstand that these examples are only a drop in the ocean. Do not trust these companies with your video data. \n\nI understand that Ring makes you feel safer, but as women, it is just another way we can be violated. If you want a camera, I highly recommend using a self hosted video doorbell. Try to avoid any cloud-hosted camera services; as a software engineer, I know how much customer data engineers generally have access to. As a woman, I personally am not comfortable using any cloud hosted video/audio service whatsoever.\n\nStay safe out there friends.\n\nEdit: grammar\n\nEdit2: someone made a totally fair comment that it is better to feel safe and ward off any unruly behavior outside their home than worry about being hacked. Honestly, I get it. That’s the tradeoff here. The purpose of this post is to make sure other women understand the risks involved. I see so many “just get a Ring!” suggestions that I just wanted to share that women can still be exploited that way.",
    "title": "Why you should not get a Ring camera",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1697077428,
    "score": 338,
    "keyword": "woman engineer"
  },
  {
    "text": "I’m a female engineer at a large aerospace company. I have done well here. A new coworker is pushing me over the edge. I don’t know where to start. I’m gonna have to water this down to avoid identification. Throwaway account for the same reason. \n\nI am a test engineer at a large aerospace company that does work for the government, and our product is involved in safety-sensitive missions. There are certain codes we have to follow to be able to do business with the government, including something called AS9100 which is basically keeping appropriate paperwork and stamp offs/tracking that certain things have been done before the product gets on the final vehicle. We get audited every couple of years and the auditors are very picky and any findings are a big deal that make pain for all of us.\n\nAbout a year and a half ago, we hired two new guys into the same role as myself to support the test team. We have a lot going on and need the help. \n\nNow, to preface this, I work with ALL men. There are 1-2 ladies around the building with me, but in our dept I am the only woman. I’m in STEM, I’m used to it. I’m happy to say that in my few years in this role up to now, I haven’t had any problems. Maybe some antiquated comments here and there but nothing worth raising a fuss about. I work with a lot of older men with “old-school” mindsets, but I have truly managed to become part of the team and my gender has not mattered one bit. \n\nNow. As for these new guys. There is a particular part of our facility that I have been the focal for for a while. When we hire someone into this role, the natural progression is for them to learn that same role and replace as the focal and the former focal shifts gears. All this to say, I have been more-or-less in charge of training them in this role. \n\nThe new guys have been not great at coming up to speed quickly and have also, in my opinion, been willfully incompetent more than once. However, one (we’ll call him Gary, late 20s) after a few months kicked more into gear and I like him as a person so we have moved past the majority of the friction. When I ask him to do something or explain something, he might have a comment, but he accepts it is part of the role and moves on. I’m good enough with Gary. It is the other guy, we’ll call him Bill (40 YO) that I am absolutely done with. \n\nI am by default a pretty naive person. I try to give people the benefit of the doubt to a fault. I know this position can be a slog. We are doing important things but still get bogged down by ‘annoying’ things like filing all the appropriate paperwork. Sorry to say, but it’s part of the job.\n\nAny time I have come to Bill to explain how certain things work, or ask him to correct something, there is always an excuse or a comment. A complaint about it being annoying is one thing. Debating me on why you shouldn’t have to do something the way I just asked you to is another. It’s exhausting. Mind you, over and over I have been perfectly pleasant, and default to saying something like “I hear you, but X Y Z” and keep a smile on my face. Bc I need the help and I need them to do their jobs and do them right. I don’t want to debate. \n\nAs an example, he forgot to sign something off a couple of weeks ago and I handed him the paper said “hey, I just saw this, can you correct it?”. And his response was “I know for a fact I’ve seen Frank not do it before”. Um. Are you 2 years old? That’s not what I asked. Hand him the paper and walk away trusting he’ll do it and re-file it. \n\nYesterday I was overloaded with a task that was time sensitive and taking most of the day. We were also conducting a test that same day so the new guys were running the show while I focused on that. In general, I have stepped away to let them handle the job. I’m not reviewing their paperwork hardly at all anymore. \n\nWhile I’m working, another engineer comes over to me bc they needed to reference paperwork from last week, and they say, “what’s going on with this?” They show me that the paperwork they pulled was  incomplete. Dozens of items not checked off, yet Bill had filed it as-is and signed off that it had been “reviewed”. I roll my eyes, exhausted that once again I’m going to have to bring it up, bc every time I bring up this shit I know he sees me as bothering him, not trying to help him out. I check other recent test paperwork and find all of it is the same. Messed up/not completed. Sigh. \n\nI put the papers on his desk so we can talk about it. At that time he was away for the test. I notice that the paper that I literally handed to him before saying the 5 second thing he needed to do, was only halfway done, and I can only think it was willfully missed because it’s fucking easy. I become livid. I go to my managers office and relay that I have corrected these guys on this stuff so many times and I’m done. I make sure he knows they, moreso Bill, are still doing it incorrectly and I’m not making it my problem anymore. He understands and agrees. I mention the incident with the signature and say, without saying the quiet part, that at this point I cannot ignore anymore that Bill clearly does not respect me. To that, my manager actually says “You know, you work with all men and you’ve been here a while now without any issues. I know you are socially aware in general so my guess is, if your spidey sense is going off, it’s valid. I will talk with Frank to see if he gets the same treatment or if it may be because you’re a woman. Either way, don’t help them or save their ass on stuff like that anymore. They can come to you if something comes up but other than that I want you to step away”. I feel a bit better and leave his office. \n\nI had already put the paperwork on Bill’s desk before talking with my manager, so I know when Bill comes back he will see it. I plan to talk to him one more time and then be done. \n\nI see him go back to his desk. A couple of minutes go by. He doesn’t ask me about the paperwork. I know he knows I left it there. I walk over and see him filling out the stuff left out. Conversation goes as follows. \n\nMe: “Hey, I guess you figured out why I left that stuff there” \n\nBill: “Yeah, some missing check marks” \n\nMe (tone irritated, but professional): “Yeah. I just need to have a quick talk with you guys” (I lump Gary into it in an attempt to make it less targeted at Bill because his desk is right there). “When you sign off on (other document) that you’ve done this review, you’re saying you’ve done X,Y, and Z. It makes sure we haven’t missed anything and that everything has been turned in. If we had an audit and they saw that paperwork that way, it would be a problem” \n\nBill, smirking/laughing at me and shaking his head says, again: “It’s just a few check marks”\n\nMe, totally DONE: “It’s not up to me, Bill. It’s an audit finding. If someone else found it, it would be someone a lot higher up and meaner than me” and I walk away before I unload on him. He continues to smirk and shake his head as I walk away. \n\nI am so beyond unbelievably DONE. This motherfucker seriously thinks I ENJOY bringing this stuff up to him. If I wanted to be a mother, I’d be trying to get pregnant and it wouldn’t be to have a 40 YO MAN BABY!!! Seriously, Bill? GO FUCK YOURSELF WITH A CACTUS. I resign to avoid talking to him from now on.\n\nI go for a walk to vent with another coworker who knew what was going on. I get back and another friend and coworker of mine messages me to say, “If Bill is talking shit, do you want to know about it?” I sigh and say yes. We go for a walk. \n\nApparently, after I walked away, Bill said to Gary that “he doesn’t deserve to be lectured about this stupid shit” and that I’m PROJECTING because *I* feel like I have something to prove. \n\nThis, in particular, is very rich. Not that it matters in the context of him being an asshole, but. I kick ass at this job. And that is not me being full of myself. I know because I get told by everyone that I am reliable, I take ownership, I got promoted faster than standard AND, I achieved approval to do test by myself faster than anyone in our position EVER has. I bust my ass at this job and everyone recognizes that. \n\nI am done with Bill, and truthfully, I don’t care what he thinks. It’s clearly his problem. I take comfort in knowing that anyone that he might say that BS to out here about me ‘having something to prove’, including Gary, would be like, ‘huh?’. Because I do a GREAT fucking job and everybody KNOWS it. I got affirmation from yet ANOTHER coworker who sensed my frustration and pulled me aside to talk that he also suspects Bill’s problem is really with women and in particular, women in authority, because Bill does not treat him that way. \n\nThis job is a grind as it is, not in a good way. I am often exhausted. And having man babies to mother  is not something I signed up for or am willing to do. I fantasize about the day I stop carrying this team and walk out. Bill has no idea how much work I do on his behalf. If I left? HA. I’m unfortunately stuck here/in the area for a while longer for various reasons. But I have a standing offer/connection at another company that I know would be a better position. Just can’t make the move yet. But… If my tolerance for this BS continues to decrease, I may have to find a way to accelerate my timeline. \n\nLots of love to all the sisters out there in STEM and those who deal with the same BS. Thanks for listening.\n\nTL;DR: New hire I’ve been training doesn’t like that I try to teach him how to do his job or make sure he does it right because he thinks I do it for fun and/or because “I have something to prove”. He’s a lazy dick.",
    "title": "I’m a female engineer at a large aerospace company. I have done well here. A new coworker is pushing me over the edge.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1682116175,
    "score": 225,
    "keyword": "woman engineer"
  },
  {
    "text": "Does working in STEM as a woman ever get better? As a woman who has worked in stem for the better part of a decade, at the same company I’ve experienced many slights and micro aggressions from the “boys club” in charge. To add insult to injury, I kinda just fell into this career as a lab worker, as my degree is not in a STEM field, it’s in psychology and education.\n\nI always loved science and I wanted to study it but the college I went to wouldn’t allow me to declare chemistry as a major because I scored low on algebra 2 in high school. So instead of delaying my degree by at least a year, taking remedial classes, I kinda just rolled over and declared psychology, so that I can graduate early. \n\nI always kinda regretted this decision and I wish I gave my all in science. Especially now as I’m realizing “chemist as a trade” isn’t really a thing and I’ve advanced as far as I can in my career without a science degree/advanced science degree. It’s especially difficult when not even your supervisors are on you side because they think you’re dumb because a - you don’t have the “right” degree even if you do your job just as good as your coworker with a masters in chemistry. \n\nAnd before someone says that it isn’t about gender; let me tell you - guys with bachelor’s degrees were moved up the ladder way faster than women with the same or higher education. And it’s not because women “didn’t want higher positions” because the women in the lab are the ones offering their skills for promotions and training and just consistently looked over.\n\nIt’s to the point where I’m very much considering going back to school for sciences, but to do something different like scientific research and development, or engineering even though I know I’m probably going to still get looked over, but hopefully with a masters or PhD It may be better?",
    "title": "Does working in STEM as a woman ever get better?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1695219598,
    "score": 140,
    "keyword": "woman engineer"
  },
  {
    "text": "Are women more supportive to each other than men are, or do I just have bad guy friends? It's been happening for a while now, and I feel like I'm going crazy. I'm in uni, and every time I tell my girl friends about anything positive that's happening in my life (I published my first article last month and there's a possibility I'll get a scholarship to do a PhD), they are very supportive and I genuinely feel uplifted after talking to them. \n\nI can feel they're actually happy for me, and this is not just a front, too. We celebrate our successes from time to time, and I'm happy for them when they achieve something as well - which, I thought, is the norm in friendships. Even if I talk to a woman that I wouldn't necessarily call a friend, so someone like a classmate or a coworker, they always seem to be very supportive and excited about my prospects and accomplishments (even though they don't have to be). \n\nCue all my guy friends, even the ones I talk to daily: when I mention I got on the Dean's list, got a new job I really wanted, graduated top of my year, got published, got into a research project I'm excited about... there's nothing. Or rather, at best, there's radio silence, at worst, they tell me they think all this \"research\" I'm doing makes no sense and I'm wasting my time. Note: I do my research in a male dominated field (engineering), and most of my male friends are engineers so I'm not sure how exactly the research I do is pointless, when they pursue careers in a similar field? \n\nOne guy literally omits every message in which I tell him I did something, and responds with how his day went. The last conversation I had with him went like this: \"I published my first article! Here's the link to the full text for free if you wanted to read it\". Response: \"I really don't like the guy who's my lab partner lol, he literally does nothing all day\". No response to my message at all.\n\nI would think I just have bad friends (talking about my male friends ofc, I love my girls), but it does seem weird that all my male friends (there are 4 I would consider close) do it. There's also the guy who I thought was flirting with me, who does the exact same thing. \n\nI try not to let it get to me, but it really annoys me that they can't just be happy for me. Is it an ego thing? I'm from Eastern Europe for context, but my parents were always supportive and my mom is an engineer as well, so the thought that STEM is not for me never really crossed my mind. It just feels awful that someone I would consider a friend can't even say \"Congrats, happy for you\".",
    "title": "Are women more supportive to each other than men are, or do I just have bad guy friends?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1701629586,
    "score": 85,
    "keyword": "woman engineer"
  },
  {
    "text": "Is This Real Or Was My Monster Spiked? I have been trying to wrap my head around the shit storm that is the Texas government's take on educational reform for the \"betterment of the students\". Please correct me if I am wrong. Here is what Texas is doing to \"protect the children\":\n\n1) 3rd Graders will learn how to tie a tourniquet in case of a school shooting. Because 8 year olds make great combat medics.\n\n2) LGBTQ+ will not be allowed to be discussed below 9th grade. Because if you say the word \"gay\" near a child they will turn LGBTQ+ with 48 hours. \n\n3) Requires the 10 Commandments to be prominently displayed in every classroom. Because no  Christian has ever done anything bad and no one would break a rule when there is a poster on the wall.  \n\n4) Bans people in drag from reading to children. Because if The Little Engine That Could is read by a man dressed like a woman, the the kids will all turn gay within 48 hours. \n\n5) Gives family $8k towards private school if they don't want their kid in public school. Because everyone in Texas gets paid so much they can afford the other $42k a year in tuition to send their kids to private school. \n\n6) Requires schools to have a \"chain of command\" during an active shooter situation. Because these are now so common that they want a line up of who gives orders over the PA system while people are ducking and diving while trying to not get shot. \n\n7) Banned schools from requiring face masks incase of future outbreaks. Because Covid 19 is gone forever apparently. \n\nOk, so did someone spike my morning Monster and now I am on a bad trip or is this really the direction of the Texas education system?",
    "title": "Is This Real Or Was My Monster Spiked?",
    "subreddit": "Teachers",
    "timestamp": 1683763688,
    "score": 56,
    "keyword": "woman engineer"
  },
  {
    "text": "My wife is a teacher I'm not a teacher, but my wife is, and there is one thing that really boils my blood about her job (actually, there's a lot of things, but this is the top thing). She fairly regularly gets yelled at by a parent for giving their child a bad grade or reprimanding them when they misbehave. Worse is when they do it during dismissal when she's trying to make sure her students are going home safely. Plus, that's so disrespectful to do in front of students. But what really angers me is that admin just lets it happen.\n\nI'm an engineer, and if a customer has an issue with the quality of work I do, they don't yell at me; they go to the project manager or my supervisor. That's the way it works. The laborers/workers do the work. The managers and supervisor manage and oversee the work. If there is an issue with the work, it's ultimately the responsibility of the manager. If the customer has an issue with the work, they go to management to get it corrected. They don't yell at me, because it's the manager's responsibility to ensure the work gets done well.\n\nMore than a few times, admin has sat in on meetings and allowed the parents to yell awful, hateful things in my wife's face. Sorry, but your kid is bad because you're a shit parent and allow him to act like a fucking hellspawn at home and then cover his ass when he acts like that elsewhere. Last time there was a meeting like this, a 6'+ 250#+ man got so close to my wife while yelling at her that he was spitting on her face. The principal is a large man, too, but he just sat back and let this big dude flip out at a woman less than half his size crying get eyes out. It feels even worse knowing I can do nothing to protect her in these situations.\n\nIs all admin this chicken shit everywhere? What is the point of admin if not to act as the manager of the teachers? I can't tell you how fucking livid it makes me. Are all parents like this everywhere? She works in a very poor location because it makes her feel like she's making a big improvement in the kids' lives. Is it this way everywhere? I hate to think that people I know that are parents might be doing this to teachers. Is it a systemic issue or a cultural one? Both? It honestly feels like the entire education system is fubar.",
    "title": "My wife is a teacher",
    "subreddit": "Teachers",
    "timestamp": 1676475284,
    "score": 18,
    "keyword": "woman engineer"
  },
  {
    "text": "Afraid to File a HR Complaint I know this isn't typical \"work reform\", but I feel like it's something that deserves more attention here. \n\n&#x200B;\n\nWarning: Long tl;dr at bottom \n\n&#x200B;\n\nI am a white male, CISHET presenting human. (I'm fairly pansexual) I am currently working as a mountain bike trail builder for a small town, and it's a job I absolutely adore. This is true for my winter role as well. The problem is that in the summer, I loathe many my coworkers. It didn't take long to realize that I just didn't want to interact with them because of their topic of conversation, and the \"know-it-allness\" of one of them. \n\n&#x200B;\n\nSo it all came to a head the other day when I expressed my opinion of what the next work on the trails should be. And the Know-it-all guy rolled his eyes as if to say \"oh look at the dumbass speaking\". This when he hasn't been on our trails all summer due to injury, and every day we go to perform the work he keeps telling the bosses we should do, having a reason not to help. \n\n&#x200B;\n\nSo I called him on it by saying \"Could you not? Especially if you're not going to come help string trim?\" And he fucking blew up at me \"Why, I could string trim circles around you!\" Yeah, I don't really care, it's irrelevant. He continues to lash out and act a fool, even saying I'm the cause for all the problems on the team. \n\n&#x200B;\n\nStatistically, he's right. In a later team meeting I mentioned my being the outsider of the group, and that's okay with me. I always have been. (Two of them and a boss work together on a different winter job, and the other guy has worked with them for years.) I have various examples of this being true, and was told then by one of them \"that's not how it works here, you're not the outside person, you're not a victim.\" or something of this sort. \n\n&#x200B;\n\nI even mentioned to my boss that when I realized their conversation topics were not things I want to talk about, I just stepped out of them. He then proceeded to ask me if that was the best thing to do, placing the blame on me. Here's the conversation topics:\n\n&#x200B;\n\nThis girl they had nicknamed \"solar eclipse\" because she was under 18 and you can't look at her. Now that she's turned 18, she's referred to as \"Lunar\" and they gawk more openly. Kinda like when Emma Watson was turning 18 and people essentially had countdowns for it.\n\n&#x200B;\n\nThey spend much of their time talking shitty about, or making fun of people when they're not around said person. Even those they claim to be friends with.\n\n&#x200B;\n\nI have heard many times the valuation of women according to the size of their tits. Or rather, the only characteristics I hear about women from these men are bodily characterists. And of course one of them who is about to be a father is the typical \"I have to protect my daughter from men\" types, which is to say he feels he needs to protect her from people like himself and his friends.\n\n&#x200B;\n\nThey still call things they don't like \"gay\". They refer to some traits of humans, derogatorily, as \"woman\" or \"female\". \n\n&#x200B;\n\nAnd you can most certainly, according to them, judge the quality of a Mexican restaurant according to \"little abeualitas in the  kitchen.\"\n\n&#x200B;\n\nOh, and they also leave their work trucks idling when mowing large lawns for an hour or two at a time so they can get into a cold truck when they're done. Even when it's parked next to the climate controlled building our team office is in.  Or when they go into the store for minutes at a time, or gather implements for the day from storage, etc.\n\n&#x200B;\n\nFuck this drives me nuts.\n\n&#x200B;\n\nIt's a team of five. I only get along with one of them. And since the foreman is on a winter crew with two of them as EMTs at a different job, he's probably not going to support me in this, either. He's too close to the problem.\n\n&#x200B;\n\nThe boss/manager litterally just sat there while the dude raged at me, and him, about me being the problem with the team, because no one challenged them then. (I've only directly done so twice.) So he's not really capable of being quality help, and spent his time explaining to me that he hired people for their strengths, and thus doesn't focus on their weaknesses. Weaknesses such as laziness, being an argumentative know-it-all, etc. I was also told that if someone is causing problems and can't work as a team member, he has no reason to invite them back for the next season. Which I'm guessing is me, the guy who's waiting to be screened for Autism and ADHD. Cause it's true, I'm the burr under the saddle, and against sexism/racism/homophobia like this, I'm okay with being the odd person out until it makes my life miserable in a place it shouldn't. \n\n&#x200B;\n\nThere is no way there won't be retaliation if I take this to HR. I see no way it will get smoothed over, either. Because I just don't tolerate this sort of shit and don't want to be around it. So by removing myself from it, I'm accused of \"having a shitty attitude.\"\n\n&#x200B;\n\nAnd it's not like they wouldn't hide all this in front of women, or Mexicans, or gay people.  The bosses don't see it, and I do because I'm sort of out in the field with them. And it's not just them. I hear this bullshit in my locker room at the other job, particularly during our Pride week. One guy even talked about how stupid and illogical women are while I was, ironically, on the phone with my partner who is a professor. And if I file a complaint, it's basically the equivalent of dropping an armed hand grenade in the room while they're wearing body armor and I'm not. I really don't know what to do. Especially without putting my winter role at this job in jeopardy, when this crew isn't around and I get along with everyone because they aren't like this. \n\n&#x200B;\n\n&#x200B;\n\ntl;dr I work with a bunch of men who only talk about women according to physical characteristics, judge Mexican restaurants by \"the little abeualitas\" in the kitchen, and spend a lot of time talking shit about their \"friends\" behind their backs, and letting truck engines idle for hours a day. I removed myself from these interactions, and have had to defend myself a couple times, and am accused of having a shitty attitude and being the source of all friction from the team. But if I take it to HR, there is no way there won't be retaliation, and it might cost me ability to work a labor service I really love providing for the community. \n\n&#x200B;\n\nI just needed somewhere a bit to rant. Maybe to get some insight.",
    "title": "Afraid to File a HR Complaint",
    "subreddit": "WorkReform",
    "timestamp": 1690666358,
    "score": 9,
    "keyword": "woman engineer"
  },
  {
    "text": "Viable alternatives for mid-career engineers? I am a woman in STEM and I am beyond burnt out. It’s been about 12 years for me and I absolutely understand why so many women leave the field around this point. What are some jobs (in or out of STEM) I could transition to that might be less obvious than the Dilbert-style traditional engineering jobs? I’m experienced in both lab and office work as well as project management, I’m great at risk mitigation, and I have soft skills that a lot of my colleagues don’t (technical writing, clear communication, etc). I don’t necessarily need to stay in STEM, but I do need something that still pays well (like $100-150k range) or could get there within a few years since I’m the sole breadwinner. I would really, really like a truly remote job, and something that made a positive difference in the world. \n\nI’ve also thought about going back to school to try to switch to software engineering, but I don’t have much coding experience so I’d be starting nearly from scratch. I’m applying for jobs while also trying to improve my current one, but I’m stuck in a toxic culture and it’s really taking its toll. Has anyone else been in a similar situation and if so, how did you handle it?",
    "title": "Viable alternatives for mid-career engineers?",
    "subreddit": "careerguidance",
    "timestamp": 1672719943,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Graduating Early with Honors: Seeking Career Advice for an Ambitious Engineering Student? I'm a 20-year-old who recently graduated summa cum laude from a top-ranked mechanical engineering program, with a minor in aerospace engineering. I finished a year early and had the privilege of attending a prestigious university with the help of scholarships, bringing my tuition costs down to only 2-3k per semester. During college, I worked multiple part-time jobs every semester while taking a heavy course load.\r  \n\r  \nIn addition to my academic achievements, I've pursued my pilot's license, had a solo flight, and even had a checkride planned (though it got delayed due to weather conditions). Currently, I'm away for a prestigious summer internship as part of a fellowship program with a nearly 1% acceptance rate. Moreover, I've been accepted into an excellent Ph.D. program that offers full tuition coverage and a monthly stipend of $1900. This program had a 5% acceptance rate this year, and I'm incredibly proud of my hard work and intelligence (with an IQ in the 140 range and a 1560 SAT score).\r  \n\r  \nBut here's the catch—I can't help but feel anxious and dissatisfied despite my accomplishments. Everyone around me keeps pushing me towards a corporate 9-5 job, where I fear being treated as just another code monkey. Previous corporate internships have left me unfulfilled, and despite finishing work efficiently, I received no rewards or reduced hours; instead, I was given more mundane tasks.\r  \n\r  \nWhile I initially had aspirations for grad school, it seems like it may not be feasible for me at this point. What's more disheartening is that my family, who is covering my sister's expensive college tuition, isn't supportive of my pursuit of a graduate degree. According to them, the purpose of getting a degree is to avoid further schooling and secure a decent-paying job, even if it means sacrificing happiness. As a 20-year-old woman, I worry about the lack of respect and the challenges I may face in the corporate engineering world.\r  \n\r  \nTo make matters worse, my monthly stipend of $1900 (after tax) barely covers my basic expenses. My rent, which is the cheapest I could find near my school, amounts to $1200 per month. Additional fees, books, and supplies cost me another $300 per month. With only $400 left for food, transportation, healthcare, and other necessities, it's challenging to make ends meet, especially in a big city without public transportation. Surprisingly, my parents have dropped the bombshell that they won't be assisting me financially, despite my early graduation and their support of my sister.\r  \n\r  \nI've tried discussing this matter with my parents, but they won't budge on their decision. When their minds are made up, they're not open to change. Now I'm left contemplating my options. One is to succumb to a corporate job that may crush my dreams, at least temporarily. However, I've heard it can be challenging to leave once you're immersed in that lifestyle. The other option that genuinely appeals to me is joining the Air Force, enrolling in OCS, and hoping to secure a pilot slot. But this choice comes with risks such as compromising personal autonomy, risking one's life, low pay, and the inability to leave once committed. Furthermore, my family is strongly against military service and would disapprove if I pursued this path.\r  \n\r  \nUltimately, I don't need an extravagant salary; I just want to make ends meet without significant stress. I have a strong desire to push myself, collaborate towards a greater goal, fly at the most advanced level possible, and explore new places.\r  \n\r  \nSo, I'm turning to you for advice. Have any of you been in a similar situation? What alternatives or paths could you suggest? Any words of wisdom or guidance would be greatly appreciated. Thanks for taking the time to read my story!\r  \n\r  \nTL;DR:\r  \n\r  \nI'm a 20-year-old who achieved academic success, including graduating early with top honors and securing a prestigious Ph.D. program. However, I feel anxious and dissatisfied with the corporate job path that everyone expects me to follow. My family doesn't support my pursuit of further education, and financial constraints make it challenging to survive on my stipend. I'm considering joining the Air Force to fulfill my dreams, but it comes with risks and familial disapproval. Seeking advice and alternative paths from the Reddit community.",
    "title": "Graduating Early with Honors: Seeking Career Advice for an Ambitious Engineering Student?",
    "subreddit": "careerguidance",
    "timestamp": 1688531555,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Degree recommendation at 43? Going to school for Bachelors at 43\n\n\nI was thinking to get a degree in Logistics Operations pay looks reasonable and from what I've seen the work seems interesting. I'm a 43 year old visibly trans woman currently living in the south and won't finish a degree for a couple of years. I'm relatively intelligent and could consider other degree paths but something like software engineering seems really daunting with super rusty and probably outdated study habits and the job market seems to be hitting a glut of candidates and jobs going away.\n\nMaybe I'm rambling. Does anyone have any thoughts on my considered path? I'd also fantasized about doing DEI in HR, but I'm also scared there might not be a lot of work available there.\n\nPreviously, I earned an associates in culinary arts at a now closed for profit school and currently work in call center customer service. I otherwise worked my way up to an operations team for an app based company that got bought out and did not continue employment for most of us. Tried to break in to data analytics with a bootcamp that led to nothing.\n\nI just want to be able to afford a reasonable life and to get to retire for a couple of years before I die.",
    "title": "Degree recommendation at 43?",
    "subreddit": "careerguidance",
    "timestamp": 1697039812,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "How to leverage previous experiences and move towards a holistic health career? Hi all,\n\nI'd like to hear your advice.\n\nI am 30 years old woman who has been dealing with physical illnesses for almost half my life. As of this, I had to find on my own the answers to my healing journey. \n\nFor this reason, even though I got a B.S. in mechatronic engineering and recently a Master's degree in environmental sciences, I have been considering returning to university and studying Medicine. Specifically, I believe many of the root causes of major chronic health problems worldwide are related to unbalanced circadian rhythms, global pollution, and a lack of education on eating habits and good food quality sourcing.\n\nHowever, I don't mean to study the traditional medicine path. The current health system is broken. My recent searches have pointed me to Functional or Integrative Medicine.\n\nI really want to avoid falling into the trap of becoming a pseudo-health practitioner but merging the best of the latest allopathic Med into a holistic practices approach.\n\nHaving said all this, I am afraid it is too late for me to make this career change. Due to economic reasons, I have developed 7+ years of experience in the automotive industry, something far from what I would love to do now. \n\nAlthough this master's degree in environmental sciences has helped to understand the big picture of most pressuring societal problems (including human health challenges), I haven't been able how I can leverage all that I have learned so far (academically and personally)\n\nI am currently searching for ideas about how I can merge the pieces of knowledge from engineering, environmental sciences, and all the info I have collected during my healing journey to come up with a profession that I could enjoy and that offers value to society.\n\nI feel that I need to come up with something that doesn't exist yet. But not sure what next steps to take yet.\n\nSpecifically, I'll appreciate your thoughts about how valid the idea of studying medicine is or if it can be done differently.\n\nAlso, I'd love to brainstorm with you about what other career paths integrate technology, environment, and health.\n\nThank much for your time reading until the end of this post.\n\nThe only idea of posting this here has already helped to organize my thoughts and decompress.\n\nAll the best to all of us ♥",
    "title": "How to leverage previous experiences and move towards a holistic health career?",
    "subreddit": "careerguidance",
    "timestamp": 1679263130,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Is no comment in exit interview okay? Hi all. I'm in need of some advice. I'm handing in my 2 weeks notice to a job I've had for six months on Wednesday (as soon as the paperwork for another offer comes through). This job hasn't worked out for me due to an emotionally abusive coworker and my boss gossiping with him and HR about me instead of resolving the issue. Is it okay for me to have no comment in my exit interview? If not, what should I say? The woman conducting it has been part of why I'm leaving.  \n\n\n**Context:** I was told in my offer letter for this job 6 months ago that there would be sick leave. My first week, I used it when an ulcer burst. My boss and HR then grilled me on the time off, letting me know that PTO and sick leave are coded under the same thing, so they have to be sure that I'm sick before I take time off. I then got a disability accommodation right after for my GI issues so that when I ask for sick leave, it would not be questioned. Instead, things got worse. My boss gossiped with the rest of the team about my accommodation, leading to one coworker constantly questioning my ability to do my job if I \"could just be absent at any time\". It has just kept getting worse and my boss and HR keep telling me that I'm just being oversensitive. When I let them know that I no longer want to be on projects with the coworker who regularly yells at me for my \"unreliability\", I've been told I need to work on my interpersonal skills. Then, my boss went and told the rest of the team (6 other engineers what I told him in confidence about my abusive coworker). Now the rest of the team is \"coaching\" me on interpersonal skills and communication. It's humiliating. I didn't ask to be yelled at everyday by this person. I don't think saying anything is going to change the 3 decade long dynamic HR, my boss, and the emotionally abusive coworker have.",
    "title": "Is no comment in exit interview okay?",
    "subreddit": "careerguidance",
    "timestamp": 1679940979,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "How to deal with communication problems in a team? Hi, I'm a 2 years experienced software engineer and I really need an advice. \nI'm experiencing significant communication gaps within the team (especially with my team lead) at my workplace. It seems that there is a certain distance in his approach towards me, possibly because I am a woman. But my team lead is in constant communication with a male colleague who has almost identical experience and competencies as me. They discuss the project, and naturally, his know-how about the project increases. However, my team lead doesn't share much information with me. It feels as if I am working like a freelancer. I don't expect technical assistance, but I believe I also need conceptual information related to the project. I'm not the only one who noticed this; another female colleague who works with us asked if I felt the same way. Should I discuss this situation with my team leader? If so, how should I approach the conversation? I'm feeling overwhelmed by this situation, and it's making me quite unhappy.",
    "title": "How to deal with communication problems in a team?",
    "subreddit": "careerguidance",
    "timestamp": 1702041538,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Which type of engineering (or anything else)? I'm a young woman and currently studying to become an engineer (or if you have any other suggestion on other types of careers it would be amazing too!) but struggling to decide which type.\n\nI love being active when I'm working, working with my hands to create things or examine things, building/creating and even designing things. I'm not really fond of customer service. I'd say I'm academically I'm above average and I'm very interested in science. Ofcourse, I'm thinking about a relatively high pay would be perfect, and maybe a flexible career would be nice (I love travelling and I wouldn't mind it if my job required me to). I'd like a job that makes me use my brain, maybe doesn't stuck a lot to a routine (?). I'm also a fairly artistic person since I love to draw, sew, paint, knit, again just in general work with my hands to create something, maybe even design things. If I could, I'd like to work individual work instead of group projects. If its a possibility maybe even remote jobs?  \n\nI'm thinking currently of studying machine engineering and then getting a masters in civil ingeneering (in building?)\n\nWhat are your toughts? Ask me anything!",
    "title": "Which type of engineering (or anything else)?",
    "subreddit": "careerguidance",
    "timestamp": 1695267138,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Inconsistent pay scale, what should I do? I moved states to start a new job 2 months ago. I graduated with an M.S. in electrical engineering and I have an EIT certification. It took several months for me to land a job, as I was either “overqualified” or “under-experienced” due to the masters degree.\r  \n\r  \nI got a job that is in a similar field as to what I did my masters degree in. It being my first job, I had no clue what the pay scale was going to be. They gave me $36/hr. It was lower than I was expecting, but it’s a VERY relaxed and fun work environment.\r  \n\r  \nEverything was good until yesterday afternoon when I found out that 1.5 years ago they hired someone on with a BS and no EIT for $37/hr. Around the same time they hired someone with a BS and an EIT certification for $40/hr.\r  \n\r  \nI looked it up and I’m in the bottom 9% of hourly earners for electrical engineering in this area and I HAVE A MASTERS DEGREE. I’m now feeling like they are underpaying me. I’m worried that it’s because I’m a woman.\r  \n\r  \nHow should I proceed? I have a quarterly review in October, where I could negotiate. But that seems so long from now. It’s hard to repay debt and live on this much money. I could also just set up a meeting with my boss to negotiate.",
    "title": "Inconsistent pay scale, what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1692452002,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Is my developer department chaotic by industry standards?  \n\nAbout two years ago, I switched fields for my current employer and became a developer. While a developer, there were days I truly enjoyed the work and other days I felt lost and directionless. Not different from other jobs that I had. One thing that always stood out to me was that the team I was on absolutely did not document anything!!! Also, my immediate manager was pretty bad about handing out work, so most of my assignments came from the Director of the team, but the Manager seemed cool about it because he didn't have to worry about delegating work.\n\nFast-forward a year into the role, and the Director leaves for another position at a different company, the Manager is then promoted to the Director role. I'm cool with him and he's cool with me just continuing to work on and finish up some of the projects that the prior Director had assigned to me. About three weeks into his tenure, he leaves for a different position at a different organization. In the same timeframe a woman who was sort of our data engineering/dba specialist left as well! The team was cut in half in about a months time. What was left was myself, with about a year and a couple months of developer experience, another guy who was ultimately terminated for not doing anything (we are hybrid'ish, but this guy moved about 2,000 miles away and didn't tell anyone), and a guy that was literally hired by the original Director who was gone before his first day. The team is only six to seven people on a normal time frame, we were down to three.\n\nThe Director of the developer team reports directly to the CTO. The department has a Chief Innovation Officer that is \"in charge\" of the entire Department of Innovation and Technology (we are a government organization) that is home to about 40 employees total. While the dumpster fire is burning full blaze, the CTO offers me the Manager role in hopes of holding things together until we can bring an experienced Director on board. We also hired another developer, but since one of the other developers was terminated, we still only had 3 people on the team. Fast forward to six months later and we still don't have a director, I'm still managing the team in a sort of triage fashion.\n\nI approached the CTO about how I'm burning out and we really need to get someone in with a lot more experience than me to Direct this sinking ship. It was more than one occasion, but our most recent talk was about an hour of me explaining why we needed someone to take on more of the bigger picture role and let me bring new developers up to speed and manage the day to day items. He had a conversation with the CIO and came back to me with the idea that I need to think about how I shouldn't think in Director/Manager mindsets as they use to be, but rather think about how I would like to see the team go and what items I think we should take off my departments plate.\n\nFor some context, we manage a lot of different little projects and have to be web app developers, python automation developers, PowerShell developers, dba's, database programmers, cloud specialists, Dynamics 365 developers, WordPress troubleshooters, and that's not including the weird enterprise software that we need to make talk to each other through SSIS packages (and just for fun, so prior developer decided to write some scripts in C#).\n\nMy gut tells me this is chaos and just go...but, from other developers with more experience than me in this field, is this normal? I mean I have years of work experience in other fields, but about two years of developing experience. I definitely feel very \"junior\" still, but here I am managing a small team myself and now I'm tasked with thinking what direction I want to take this team long-term (which just tells me that the CTO and the CIO don't have any clue what to do with this team). Any advice would be appreciated!",
    "title": "Is my developer department chaotic by industry standards?",
    "subreddit": "careerguidance",
    "timestamp": 1678982290,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "I'm lots at choosing my career what should I do? Thanks in advance to those who read So as the title says I (am 21) male and have been struggling to find the right career for me and don't know what to do, a little background when I was in high school I wanted to go to med school but people told me that I wouldn't be able to make it and I panicked and picked engineering since I was good with maths and as silly as it is I was doing great but felt miserable cause I didn't want to be there so after 2y I changed career tried music as a full career but got cold feet and quit then I decided to choose something related to my original dream of med school I got on a pre-med school course and I loved it. but here's when things got sour you see I wanted to get my degree as quickly as possible because I come from a household of poor income and med school wasn't and option for that since getting the degree in my country takes 6 y plus 2 years of residency so I decided to go to radiology but ended up getting scared of the x rays and it's side effects on the body so the college put xme on nursery school at the beginning I thought i could do it since it was also health related but I realize the hard way that nursing and med school are to different things completely I've also learned that I have a big ego I want to have a job were not only I will be important but were I can have financial security and more specifically we're I can make a good amount of money, which is hard to do on nursing either in my own country Venezuela or the country I want to move to Argentina apparently nurses there are heavily underpaid not only the career my teachers and classmates are straight up awfull with me I'm the only man and you would think is a plus, wrong woman's are hard to deal when they are in group. Most of them are old angry women who want to get they're degrees for only personal satisfaction ( I have no issue with that) so here I am without any idea of what to do quitting or staying and manning up. for those who may ask I live with my mom and eat her food while I'm in this mess, I had a job for two years before the career change but I'm currently unemployed any advice you can give me about my career drama would be greatly appreciated also thanks to everybody who takes the time to read you are gold.",
    "title": "I'm lots at choosing my career what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1697713277,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Is 50 too late to start? Hello everyone. I’m a 50 year woman who loves the tech world and computer savvy. My line of work is a dying field and I need to pivot to something new to get a good salary. A friend of mine who is a software engineer told me to look for a job as a technical account manager. He said it was an entry level job, but all the ones I’ve found on LinkedIn asked for a lot of experience and a degree. Could I start a bootcamp to get into cybersecurity? I’m fascinated by hacks and looking for them. \n\nWhat are some good bootcamp to look into? Do I have a chance in the field? Thank you.",
    "title": "Is 50 too late to start?",
    "subreddit": "cscareerquestions",
    "timestamp": 1697874354,
    "score": 100,
    "keyword": "woman engineer"
  },
  {
    "text": "Questions about start-up negotiation Hello all!\n\nI’ve been talking to a start-up about coming onboard as an early hire engineer (I’m the second full time engineer that’s not a founder).  I have a final interview round on Thursday, and heard back from references that things went well.  I’m trying to anticipate how to negotiate salary for the role, as they posted a salary range for the role of 120-160k, plus some minor equity.  The role is for early to mid-level engineer, I meet all the qualifications and then a couple and have 3 YoE, and already passed the technical round and mesh with the existing engineers well.  I was thinking about asking for 140k + equity, but my partner, who is not in CS says I should just ask for 160k out the gate.  \n\nI am reticent to ask for that much as I’m a woman and tend to suffer from minor imposter syndrome in the field already.  What are other people’s thoughts on how I should approach negotiation with a seed level start up? \n\nThanks!",
    "title": "Questions about start-up negotiation",
    "subreddit": "cscareerquestions",
    "timestamp": 1687924676,
    "score": 3,
    "keyword": "woman engineer"
  },
  {
    "text": "need advice on whether to start an internship next month or 3 months from now (i dont feel like I have enough knowledge to start in january) hi everyone!  i am a third year computer science student (21F) and I recently secured a software engineering internship at a venture studio that focuses on ai startups and I need some advice on when to start this internship. I am overall VERY excited to work there and be surrounded by founders, venture partners, and people with decades of industry experience working on ai startups. it is a pretty well known place where I live. \n\n&#x200B;\n\nI have been super interested in tech startups for the past two years, and took an interest in ai / nlp for the past year or so. I did a very minimal experimentation project with llama index and took an ai class and was able to speak to some of this during my internship. I also have some past internship experience. the problem is i don't think i know enough about the ai field or gen ai stuff to go work at the startups, seriously my knowledge is SO LITTLE. i had originally planned to take 3 months off before the internship to do some concrete self learning and experimentation with some genAI tools and then start at the internship. \n\nthe internship was supposed to be for the summer, but since i am still interviewing for other startups for the summer, they gave me an exception to do the internship winter/spring based on whats best for my schedule. they said they PREFER i start in january over april, but i dont think one month is enough for me to learn. during the interview, I didnt lie, i told them my knowledge is SO little and im taking time off school to self learn and also take care of my health. i really dont know why they offered the position but they really want me to join and i also REALLY want to do this. essentially i would be helping launch and rapidly prototype and validate new AI startups. I get to experience what its like to be a founder and engage in customer research, work alongside very smart people and learn from people who invest in startups. this is a once in a lifetime opportunity. im a woman of color and never would've imagined myself in this situation. \n\n&#x200B;\n\nplease provide advice? should I start January (they said they really prefer January) or should i tell them i need to learn for 3 months and start april? I guess maybe im just really scared, my past internships ive always felt pretty comfortable going in, this time around i feel very terrified and dont feel qualified. maybe this is the only way i can grow is if i just take this leap and start in january. idk\n\n&#x200B;\n\nthank you so much!!",
    "title": "need advice on whether to start an internship next month or 3 months from now (i dont feel like I have enough knowledge to start in january)",
    "subreddit": "cscareerquestions",
    "timestamp": 1702804793,
    "score": 1,
    "keyword": "woman engineer"
  },
  {
    "text": "Do you believe in Meritocracy? Meritocracy is the idea that positions of power should be awarded to those most capable of wielding that power.\n\nImagine there's a big machine that gives people jobs (There isn't, but stay with me). There are two people applying for an engineering job, one that requires math. James was born to a rich family, had every advantage growing up, breezed through school and doesn't even really need this job. Robert was born in the slums, clawed and scratched his way into every scholarship he could find, fighting his way to the top despite every turn life could throw at him. He's worked hard his entire life to get here. The machine doesn't give a damn. Rob got a 97 on the exam and James got a 98. James gets the job.\n\nThat's what a \"perfect\" meritocracy is. It gives power (or authority or opportunity, whatever your social currency of choice is) to whoever is shown most capable of wielding it. The machine doesn't care that Rob worked harder or needed it more. It can't care; it has to show that one of the candidates is more suited than the other. The machine is accountable for its choices, transparent. The best man (or woman) for the job gets it, every time.\n\nI'd love to hear your thoughts.",
    "title": "Do you believe in Meritocracy?",
    "subreddit": "cscareerquestions",
    "timestamp": 1684123601,
    "score": 0,
    "keyword": "woman engineer"
  },
  {
    "text": "Agencies that work with clients other than Microsoft for mid-level PM work? I've worked as an IT consultant for the better part of the last 11 years or so, almost exclusively at Microsoft (greater Seattle area). I've worked for a variety of different agencies, and the story is always the same. A ton of amazing opportunities with MS clients, but 99% of the time 18/6 rule applies, and you can only work for the 18-months in which you're \"on-network\"/have an active v- alias. So 18 months on, 6 months off. There have been a few cases in which a MS client allows vendors to stay on contract during the 6 month off-network time period, but those opportunities are few and far between. I recently worked for such a team at MS, but they recently changed their policy and will no longer be allowing consultants to stay on without a v- alias.\n\nAs a single woman on one income, I CANNOT afford to continue taking these breaks and I really need something more stable, as much as I enjoy working with Microsoft. \n\nMy question is this: what are some reputable consulting agencies who tend to work with NON-Microsoft clients and have  opportunities/open roles with a variety of companies? A bulk of my experience is in project management (non-technical. I'm not an engineer or a dev), program management, marketing, business management/operations, communications, etc. I also have a few years in HR, however, I'm not certified. \n\nAnd/or companies without a bench? So, agencies that don't boot you immediately after a client contract ends. I'm open to all industries, not just tech. \n\nAny help/advice would be very much appreciated.",
    "title": "Agencies that work with clients other than Microsoft for mid-level PM work?",
    "subreddit": "consulting",
    "timestamp": 1692250854,
    "score": 14,
    "keyword": "woman engineer"
  },
  {
    "text": "Agencies currently hiring that work with clients other than Microsoft for mid-level PM work? I posted the below a month ago and got a few good responses, so hoping it's OK to re-post, as my situation haasn't changed (albeit desperation has increased). I've been out of a job officially since last Friday, and have been looking for work for over a month without much luck...\n--\nI've worked as an IT consultant for the better part of the last 11 years or so, almost exclusively at Microsoft (greater Seattle area). I've worked for a variety of different agencies, and the story is always the same. A ton of amazing opportunities with MS clients, but 99% of the time 18/6 rule applies, and you can only work for the 18-months in which you're \"on-network\"/have an active v- alias. So 18 months on, 6 months off. There have been a few cases in which a MS client allows vendors to stay on contract during the 6 month off-network time period, but those opportunities are few and far between. I recently worked for such a team at MS, but they recently changed their policy and will no longer be allowing consultants to stay on without a v- alias.\n\nAs a single woman on one income, I CANNOT afford to continue taking these breaks and I really need something more stable, as much as I enjoy working with Microsoft. \n\nMy question is this: what are some reputable consulting agencies who tend to work with NON-Microsoft clients and have  opportunities/open roles with a variety of companies? A bulk of my experience is in project management (non-technical. I'm not an engineer or a dev), program management, marketing, business management/operations, communications, etc. I also have a few years in HR, however, I'm not certified. \n\nAnd/or companies without a bench? So, agencies that don't boot you immediately after a client contract ends. I'm open to all industries, not just tech. \n\nAny help/advice would be very much appreciated.",
    "title": "Agencies currently hiring that work with clients other than Microsoft for mid-level PM work?",
    "subreddit": "consulting",
    "timestamp": 1695191006,
    "score": 2,
    "keyword": "woman engineer"
  },
  {
    "text": "Imposter Syndrome… let’s talk about it This shit is soo annoying!\n\nAs a young black woman in engineering I have to fight like all hell to get what I’m worth and what I deserve. \n\nI got promoted a couple of months back because I put my foot down after realizing my worth. \n\nSince then I’ve been working my ass off but there’s a few people in my office that throw me off my game sometimes. \n\nInstance 1: Our manager assigns me to assist person X on something. I ask person X to fill me in just for them to take that opportunity to talk down on me and tell me “shouldn’t be difficult to get done”. They work in an entry level role below me but I’m assuming they caught the attitude bc they’re trying to go for the open lead role which will put them in my same position. They also like to double check my work like a teacher. \n\nInstance 2: Just today I was in a cross functional meeting with members of a different team. I explained why I thought X was better than Y after he asked for my opinion and I literally got laughed at like I was an idiot. \n\nInstance 3: Colleague on my team tried to sabotage my work multiple times until they got promoted to a different area and now I don’t see them often. Blessing in disguise. They now resort to watching my social media and eavesdropping on me during lunch. \n\nAll of these things make me feel like I don’t belong where I’m at even though I’ve earned it. Like why are the people who have the same objective as me actively trying to tear me down?! Wtf did I ever do to you? I’m honestly at the point where I’m about to stop giving a damn and pull out the chair when people start to get outta line. \n\nThank you for listening to my irritated TED Talk. To all the other women feeling this way: You’re not alone and your feelings are valid. ❤️",
    "title": "Imposter Syndrome… let’s talk about it",
    "subreddit": "blackladies",
    "timestamp": 1691519129,
    "score": 66,
    "keyword": "woman engineer"
  },
  {
    "text": "Lonely at a PWI - Black Women In Comp Sci So the semester is wrapping up and I feel like I’m drowning. I’m a Computer Science major and was supposed to graduate May of 2023, but some stepbacks is delaying that (that alone makes me feel terrible about myself). I feel so lonely because I’m always either the only black woman or one of two black women in all of my classes and I feel like I’m under a microscope because of it, that I can’t get the same grace if I make mistakes as much as my peers do. We had a group presentation today and the entire class I was fighting back the urge to just bust into tears because I felt so incredibly judged due to my code breaking last minute. Again I’m almost done with my degree so this isn’t new to me, but some days are worse than others and today was just completely awful. \n\nNot gonna lie I want to give up and switch majors so badly sometimes, because the Comp Sci/Engineering programs at my school lack black people but black women specifically. I’ll never forget an interaction I had freshman year where I asked a classmate for help with a question and he was so condescending about it that it made me so angry and upset, but not much I can do but laugh it off so I don’t cry. I already struggle asking for help so that definitely made things worse. The same year in intro to Comp Sci, there was a black woman other than me and one day she just stopped showing up and I never saw her again so that really sucked because we had this unspoken understanding that we had to have each other’s backs no matter what.\n\nAnyways before this gets any longer, I could really use and would extremely appreciate any advice or words of encouragement because again I’m really discouraged right now.",
    "title": "Lonely at a PWI - Black Women In Comp Sci",
    "subreddit": "blackladies",
    "timestamp": 1701990862,
    "score": 28,
    "keyword": "woman engineer"
  },
  {
    "text": "How do I stay resilient when faced with racism at work? I'm writing this because it's still at the forefront of my mind, I can feel my fight or flight engaged because I'm still rattled. \n\nI'm an almost 30s engineering PhD student with some months left to finish and I'm so excited because whilst it's been a wonderful journey, lord I'm tired! Anyway a couple days ago I'm out with some colleagues, from several different departments, my closest friend and I had made some new buddies recently so decided to bring them along to meet everyone else for a drink. I come from the south but study in the north of the UK and have gotten used to the fact that I am usually the only black woman in any situation involving academia, it's lonely but I get by. One of these new \"friends\" decided to begin the n-word chat and why he should be able to say it; the skin on the back of my neck tenses and I brace for battle, something I despise doing because I'm not good at it. I just wanted an evening to unwind at the end of a hard week and now I'm on edge, I can feel the misery setting in.\n\nUnlike many situations I'd been in before where people felt comfortable enough to spill all their problematic BS about this, this guy felt bold enough to actually use the word. I was so shocked because he kept saying it, I tried to argue my points as to why he shouldn't but I was cornered and I felt so heated I was struggling to get my words out; I felt so alone. My best friend/colleague was elsewhere so I only had a couple people around me backing me up. But honestly having back up didn't matter, this man was on a mission to enrage me, and he was winning. \n\nHe's french btw and this is important because I speak the language and am well aware that many of them have the same sentiments, not all, but enough. It's so unfortunate because the language is so beautiful to me but the people, sheesh! For me, the point at which you start saying the word just to piss me off \"pretending\" you're trying to make a point, well, that there is the literal definition of racism, he'd massively crossed the line. Oh and it wasn't just pejorative terms towards black people, also Jewish people, LGBTQ+ people, anyone could get it as far as he was concerned. It was about \"humour\" and we were all \"snowflakes\". I had to pinch myself, was I in a pub or at home reading YouTube comments?! It was wild! I told him if that's so why is nobody laughing, clearly you're not very funny. \n\nI know I'm going to be in this situation again, not necessarily with him but definitely some other wretched goon on a mission to provoke. What actions can I take so I don't become so flustered, I know I can't change their minds, some of these people are so privileged I'm surprised they're not defecating gold coins. But how can I hold myself? I've been rewatching interviews with Dr Angelou; she's the person I go to when I feel like screaming into the void, despondent. My grandma from another mother. I wish I had her patience, her fortitude, but I know it's okay to get angry too.",
    "title": "How do I stay resilient when faced with racism at work?",
    "subreddit": "blackladies",
    "timestamp": 1682243706,
    "score": 11,
    "keyword": "woman engineer"
  },
  {
    "text": "Looking for a Black Woman to do an Informational interview Hello, I am a freshman in college with a major in computer engineering. I want to become an embedded software engineer and it’s really male dominated so I was wondering if there are any black woman in this subreddit or someone you know that is willing to set some time aside for an informational interview about their career as an embedded software engineer?\n\nThank you ❤️",
    "title": "Looking for a Black Woman to do an Informational interview",
    "subreddit": "blackladies",
    "timestamp": 1683265307,
    "score": 10,
    "keyword": "woman engineer"
  },
  {
    "text": "Debunking the \"Gender Pay Gap\" Copied from the [original post here](https://www.reddit.com/r/TraditionalMuslims/comments/14p3dwq/debunking_the_gender_pay_gap/).\n\nSo I didn't think I needed to debunk this as it's been done a million times before. However, it's come to my attention that apparently some still believe it. So, just to have an easy-to-reference, codified treatise on the issue, I'm writing this piece to utterly decimate this commonly propagated liberal trope.\n\nMainstream media presents [articles like this](https://www.businessinsider.com/gender-wage-pay-gap-charts-2017-3) that claim there is a pay gap between men and women, and that it's on the sole basis of gender. While it is true that men tend to earn more money than women, it is absolutely false that it's due to gender bias in favor of men (if anything, it's actually in favor of women). The problem with the statistics shown is that they only take into account median yearly salaries without accounting for any other confounding variables that may be skewing the data. For example, if I told you that the more people drown the more often ice cream is sold, would you take that to mean that ice cream causes people to drown? No, you'd probably say that it's because of ice cream sales increasing in the summer when it's hot, which is simultaneously when people go swimming more, thereby increasing the likelihood of drownings to happen; this shared commonality (i.e. the heat) is a confounding variable.\n\nFor the so-called \"gender pay gap\", here are the confounding variables:\n\n1. This statistic does not account for what types of jobs are being worked, as **men choose higher-paying jobs**.\n   * [*Source 1.*](https://pubsonline.informs.org/doi/10.1287/orsc.1120.0757) *Demonstrates how women choose different jobs than men because they value and/or prioritize different things than men (e.g. better work-life balance). Because of this, the jobs they prefer tend to be lower-paying.*\n   * [*Source 2.*](https://academic.oup.com/oep/article-abstract/57/3/479/2361925?redirectedFrom=fulltext) *Same as Source 1, but also found that \"job satisfaction of men increases with additional earnings while that of women does not\" (p. 486).*\n   * [*Source 3.*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *Landmark study; displays evidence that men choose higher-paying jobs. The more egalitarian/feminist a country is, the fewer women choose careers in science, technology, engineering, and mathematics (i.e. traditionally male-dominated roles). Giving greater career choice to women increases (apparent) gender disparities within the workforce.*\n   * [*Source 4.*](https://www.jstor.org/stable/2525981) *Cited over 11,600 times. Demonstrated very directly that women choose jobs that are lower-paying, and that women are NOT being paid less to do equal work; and this was in 1973, almost 50 years ago. Please note that any discrimination found thereafter is really just residual unaccounted variability rather than actual discrimination per se, as detailed in the conclusion.*\n   * [*Source 5.*](https://journals.sagepub.com/doi/abs/10.1177/0891243210361475) *So ignoring the ideological bullshit that's indirectly being pushed, it demonstrates clearly that women choose different jobs than men and that it is solely due to their own choice; and that the only time women don't choose traditionally female jobs over male jobs is when they're essentially forced to take the male job.*\n      * *Interestingly enough, this supports the findings of* [*this study here*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *(which was a MASSIVE, catastrophic blow to the \"men and women are equal but female oppression and gender discrimination are the only reason why we aren't\" narrative); the researchers found that the more egalitarian/feministic a society is, the greater the gender differences will be (regarding what people will choose to pursue). In other words, when you give women free choice to pursue whatever they want, they will willfully choose occupations/education/life goals that will only increase the gender gap between men and women.*\n2. The statistic does not account for **different positions within a respective field** (e.g. head/lead developer vs senior developer vs junior developer; they're all developers, but different rankings/positions). We know this because it's not possible to know the relative rankings/positions of people's careers if they don't even know what those careers are in the first place.\n   * [*Source 6.*](https://www.jstor.org/stable/1808858) *Looked at a company from the years 1966 and 1969-1971; found no gender discrimination when accounting for all variables. States that at most, there may be gender discrimination with regards to promotion, but even this is speculative as it is not explained why this may be the case (and truth be told, we already know why this is; I will explain later on). If the concept of a gender wage gap was already being debunked/disproved back then, it definitely doesn't exist now (at least, not in favor of men anyway...).*\n   * [*Source 7.*](https://www.jstor.org/stable/30038574) *Studies a company that was sued for ACTUALLY discriminating against women with regards to promotion, and found that there wasn't any pay differences between men and women who were given the same job/assignment. In other words, even when discriminating against women, they were still being fair about the pay.*\n3. The statistic does not account for **age** (e.g. a young person may make more money than an older person in a physically-taxing field, older people in fields that would require more knowledge/wisdom to handle, etc.).\n   * [*Source 8.*](https://www.nber.org/papers/w26623) *Generally speaking, workers over age 40 are only about half as likely to get a job offer as younger workers if employers know their age*\n4. The statistic does not account for **job tenure** (i.e. how long someone has been working for their respective employer for).\n   * [*Source 9.*](https://journals.sagepub.com/doi/abs/10.1177/0003122413514584) *Shows men in general have greater job tenure than women. It's decreasing overall (particularly for men) but there are various reasons for it, many of which are oftentimes advantageous from a career/monetary standpoint, which men are going to be more receptive towards since men typically prioritize money more than other aspects of a career (see Source 1).*\n   * [*Source 10.*](https://www.jstor.org/stable/1831432) *It's in the title; job tenure typically entails higher wages. In recent times, this has been changing within certain fields (hence why it's been decreasing as shown in Source 8 above), but the point still stands overall.*\n5. **Men work more than women**, which implicates in the previous 2 points with men being able to develop greater job tenure and work experience. More men work full-time than women. Moreover, the term 'full-time\" means anyone working 35 hours or more (with some lowering it to 30 hours or more to further skew the stats in favor of their social agenda); this could mean anywhere from 35 hours to 135 hours per week, and I can tell you right now that the vast majority of people who are working an exorbitantly high number of hours are men, NOT women.\n   * [*Source 11.*](https://www.bls.gov/opub/ted/2015/time-spent-working-by-full-and-part-time-status-gender-and-location-in-2014.htm) *Statistics from the US government. Men simply work more than women, even when comparing men who work full-time to women who work full-time, and men who work part-time to women who work part-time.*\n   * [*Source 12.*](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) *More statistics from the US government for 2019.*\n      * *\"Among full-time workers, those usually working at a job 35 hours or more per week, men are more likely than women to work more than 40 hours per week. In 2019, 25 percent of men who usually work full time worked 41 or more hours per week, compared with 14 percent of women. Women were more likely than men to work 35 to 39 hours per week: 10 percent of women worked such hours in 2019, while 4 percent of men did\" (p. 8).*\n      * *Women were more likely to be working a part-time job than men.*\n      * *\"Women who worked part time made up 23 percent of all female wage and salary workers in 2019. In comparison, 11 percent of men in wage and salary jobs worked part time.\"*\n   * [*Source 13.*](https://www.bls.gov/opub/reports/womens-earnings/2020/pdf/home.pdf) *Even more statistics from the US government for 2020.*\n      * *19.6% of men working full-time worked 41 or more hours per week, compared to only 10.2% of women who were working full-time. This means that men working full-time were nearly twice as likely as women to work 41 hours per work or more (Table 5). This coincides with* [data discussed at the 2019 G20 Summit](https://www.ilo.org/wcmsp5/groups/public/---dgreports/---cabinet/documents/publication/wcms_713376.pdf)*.*\n      * *Men working full-time were also 2.3 times more likely than women to work 60+ hour weeks: 4.3% of men worked 60 hours per week or more compared to only 1.9% of women.*\n      * *Women working full-time were more than twice as likely as men to work shorter workweeks of 35 to 39 hours per week: 7.7% of full-time women worked those hours, compared to only 3.6% of men who did so.*\n      * *Men working 35-39 hours per week earned only 92.4% of what women earned working those same hours ($600 median weekly earnings for men vs. $649 for women). This means there was a 7.6% gender earnings gap in favor of female workers (for that cohort), and this is BEFORE accounting for any confounding variables!!!*\n      * *Women were more likely to be working a part-time job than men.*\n      * *Although not reported by the BLS, it can be estimated using its data that the average workweek for full-time workers (in 2020) was 41.3 hours for women and 42.8 hours for men, meaning the average man employed full-time worked 1.5 more hours per week compared to the average woman. This adds up to men, on average, having worked an additional 78 hours per year compared to the average full-time female worker.*\n      * *Some of the raw earnings gap naturally disappears by simply controlling for some of the variables. For example, women technically earned 82.3% of median male earnings for all workers working 35+ hours per week (i.e. full-time). But for those workers with a 40-hour workweek (more than three-quarters of all full-time female workers), women earned 87.4% of median male earnings, and that's after accounting for just one variable: hours worked.*\n      * *For young, full-time workers aged 16-24, women earned 94.7% of the median earnings of their male counterparts. Once again, controlling for just a single important variable—age—we find that more than two-thirds of the \"gender pay gap\" disappears. There are tons of other factors like these that go unaccounted for when you hear people/the media talk about the gender pay gap. Keep this in mind from now on.*\n   * [*Source 14.*](https://www.bls.gov/opub/mlr/2008/02/art5full.pdf) *Conducted by the US government. Looks at 12 European nations and shows that men work more than women in all of the countries studied, among many other things.*\n   * [*Source 15.*](https://www.bls.gov/news.release/atus.t04.htm) *Government statistics for 2021. Men clearly work more than women.*\n   * [*Source 16.*](https://journals.sagepub.com/doi/abs/10.1177/00197939211045376) *Some people may not think that men work more than women enough to help warrant the pay gap, but this paper explains otherwise (they basically accounted for the jobs being worked and how men and women vary in the number of hours worked within these specific jobs rather than ignoring the types of jobs worked).*\n6. Building off the previous point, **men work more overtime**, and the gender pay gap statistic does not account for overtime pay. And if men are working more hours than women, that means that men are going to make more money from overtime which is higher than your standard base rate.\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *This is one of my favorite studies ever. It's just so well-done and is, in my opinion, the epitome of what research is supposed to look like. It was conducted by Harvard University, and one of the authors is literally a woman (meaning there isn't any bias caused by sexism or misogyny on behalf of the authors). It demonstrates a multitude of things, but as it relates to this specific point, it shows clearly that men work more overtime than women (p. 2–3; Figure A.16, p. 85).*\n7. **Men are more likely to accept overtime, and especially when presented without prior notice** (e.g. if someone had an emergency and couldn't come in, and employees are asked if they can stay, men are more likely to accept it). This means men tend to be more reliable workers overall. It's technically a separate point from the one above because the frequency of accepting overtime is different from actually working it (e.g. someone could work a lot of overtime one week and not work it at all for the next 12 weeks, vs someone who works only a few hours of overtime every week).\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Also shows how men are more likely to accept overtime when it's presented to them and that men in general are especially more likely to accept overtime without prior notice (p. 3; Figure 6, p. 49; Figure A.17, p. 86).*\n8. **Men are less likely to have unexcused absences.**\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Women have more unexcused leave of absences than men (Figure 22, p. 65). This further implicates men as being more reliable workers. What's ironic is that men face harsher penalties/disciplinary measures than women (Figure 21, p. 64), contrary to popular belief.*\n9. The statistic does not account for **work experience** (i.e. how long someone has been working in their respective field).\n   * [*Source 18.*](https://www.jstor.org/stable/2535309) *In general, men have greater work experience than women (courtesy of working more than women); the timing of work experience and overall work matters a lot as well, and since men are simply working more than women, the advantages of this timing will be more apparent in men than women. This study has data directly showing that men have greater actual work experience, potential work experience, and job tenure than women (the last of which relates back to the previous numbered point).*\n10. **Men do not get pregnant and are less likely to leave work for kids** (e.g. paternity leave); pregnancy forces women to stop working, which relates back to points 4, 5, 8, and 9, and men being less likely to leave work for kids also shows more dedication to work.\n      * [*Source 19.*](https://onlinelibrary.wiley.com/doi/full/10.1111/gwao.12506) *The abstract alone states \"mothers with young children have reduced their work hours four to five times more than fathers\". Some of you may say that this therefore nullifies Source 12 as supporting evidence for point 5, but it actually strengthens it because it exemplifies the gender differences that can cause a skew in the gender wage gap myth and highlights the behavioral dimorphism between the sexes. At most, it would only nullify SOME of its generalizability on a year-to-year basis, but even then, it still showcases how statistics can be skewed/misrepresented to provide a false narrative about gender discrimination that doesn't actually exist with regards to pay. Anyway, Source 13 also states similar as well due to the Family Medical Leave Act (FMLA) where women are far more likely to leave work/not come in, but I don't want to be redundant and keep using the same source even though it's a fantastic study.*\n11. **Men are less likely to take sick days.**\n      * [*Source 20.*](https://academic.oup.com/occmed/article/68/5/320/4973626) *Women take more sick leave than men, even after accounting for many variables.*\n      * [*Source 21.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6070205/) *The introduction alone is enough to show that women take more sick leave than men, this is undisputed and has been for decades. This study sought to determine whether there were differences in attitudes towards sick leave based on gender, and whether this contributes to women's absenteeism. They did not find much support for this, indicating that women take more sick leave regardless of societal norms and expectations.*\n      * [*Source 22.*](https://journals.lww.com/joem/Abstract/2015/08000/High_Job_Demands,_Job_Strain,_and_Iso_Strain_Are.5.aspx) *Women take more sick leave due to mental health reasons than men (p. 860), with 90% of \"mental health\" reasons being either stress, mood, and/or anxiety-related.*\n12. **Men are less likely to take vacation days.**\n      * [*Source 23.*](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1019.5400&rep=rep1&type=pdf) *Great study that shows how women take more vacation days than men, while also discussing why it is the case. Has several other findings/key points that showcase male-female dimorphism as it relates to work and the family, and they are very interesting; they essentially prove what is already self-evident with regards to gender roles, despite what mainstream society is trying to push today.*\n13. **Men are more likely to move for a job.**\n      * [*Source 24.*](https://www.demographic-research.org/volumes/vol40/53/40-53.pdf) *Shows conclusively that men are more willing to move for a job. They try to say that single women are just as likely as single men to move for a job after accounting for confounding variables, but that's nonsense because one of the variables was essentially how well they like the job (i.e. \"job characteristics\"), when the location of a job doesn't have an impact on how much the job itself should or should not be liked (and if any of you researchers disagree, you will need to account for the Halo Effect to fully make sure that distance isn't what's making them view those same \"job characteristics\" as distasteful enough for them to not want to move). It's as if they're trying to say that jobs should cater to women by changing how they operate so women will like them better, rather than simply just acknowledge that women do not want to move for work as much as men. In fact, it's not even as if they're saying that, they literally suggest it lmao! It's very gynocentric when you look at it. The reason why they say this is because they do not want to admit that the gender gap is literally caused by women's own personal preferences, because then that would mean that the gender gap is normal, natural, and that women willfully make the choices that cause the gender gap, essentially nullifying any narrative that women are victims of oppression and that the gender differences that exist between men and women are caused by men and women ACTUALLY being different. This last point really irks the ideologues. In addition, it would place accountability over the gender gap on women, and women absolutely cannot handle having accountability.*\n      * [*Source 25.*](https://www.glassdoor.com/research/app/uploads/sites/2/2018/05/GD_ResearchReport_MetroMovers_Draft4-1.pdf) *Literally the same thing as the previous source (including all of the progressive diatribes that I dismantled) but with a massive online job search website.*\n      * [*Source 26.*](https://web.stanford.edu/~niederle/CEN_discrimination.pdf) *This one has some progressivism within it as well, but ignoring that, we find that any discrimination against women isn't due to them on the sole basis of them being women, but rather because of beliefs over how well they would do the job. In fact, it shows that people are MORE likely to favor women as job candidates when a negative belief is ascribed to a woman rather than when it is ascribed without the gender being stated. In other words, gender discrimination isn't gender discrimination at all but rather performance discrimination, which is the definition of a meritocracy (i.e. a system in which people are judged based on their merit/how good they are at their job, rather than characteristics unrelated to said job/merit).*\n14. **Men are more likely to work night shifts.**\n      * [*Source 26.*](https://www.bls.gov/opub/mlr/2021/article/nonstandard-work-schedules-in-29-european-countries-2005-15-differences-by-education-gender-and-parental-status.htm) *Government study looking at data across 29 European nations from 2005-2015. It shows that in every region, save for Scandinavia, men are more likely than women to work hours outside the standard 9-5. This coincides with data from Source 14 and Source 17, which showed similar findings.*\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Shows definitively that men are more likely to work night shifts than women.*\n15. **Men are more likely to work weekends.**\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Also shows that men are more likely to work weekends than women.*\n      * [*Source 28.*](https://www.bls.gov/opub/mlr/2011/07/art1full.pdf) *While also showing that men are more likely to work nonstandard work shifts, it also shows that men are more likely to work weekends as well, which Source 11, Source 14, Source 15, and Source 17 also demonstrated.*\n16. **Men are more likely to work holidays.**\n      * *Yet again, this was already shown by Source 11, Source 14, and Source 15.*\n17. **Men are far more likely to work dangerous jobs** such as oil riggers, underwater welders, etc. These male-dominated jobs pay higher than nurses and hair stylists on the basis of danger, hence why it's separate from the first point.\n      * [*Source 29.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4880472/) *Men are more likely to work dangerous jobs and are simply more willing to accept risks that jobs may have in general. This is represented by the fact that men make up most workplace deaths.*\n         * [*Source 30.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2004_chart11.pdf) *US government data for 2004; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 31.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2006_14.pdf) *US government data for 2006; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 32.*](https://www.bls.gov/iif/oshwc/osh/os/oshs2008_33.pdf) *US government data for 2008; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 33.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0009.pdf) *US government data for 2010; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 34.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0011.pdf) *US government data for 2012; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 35.*](https://www.bls.gov/iif/oshwc/cfoi/cftb0292.pdf) *US government data from 2014; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 36.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi-chart-data-2017.htm) *US government data from 2017; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 37.*](https://www.bls.gov/news.release/pdf/cfoi.pdf) *US government data from 2016-2020; shows that men make up the overwhelming majority (93%, 93%, 92%, 92%, 92% for each consecutive year, respectively) of workplace deaths.*\n         * [*Source 38.*](https://www.ualberta.ca/anesthesiology-pain-medicine/media-library/eliassons-wellness-docs/mens-mental-health/a-roadmap-to-mens-health.pdf) *97% of workplace deaths in Canada between 1993 and 2005 were men.*\n         * [*Source 39.*](https://www.safeworkaustralia.gov.au/sites/default/files/2020-11/Work-related%20traumatic%20injury%20fatalities%20Australia%202019.pdf) *97% of workplace deaths in Australia were men in 2019, with similar trends from 2003-2018 as well. These are the things feminists will never, ever talk about.*\n18. **Men are more interested in jobs that are scalable**; men are more interested in physical things, while women are more interested in jobs that deal with people. The former is scalable, the latter is not; that means Elon Musk is able to service millions of people with Tesla whereas Mrs. Johnson is only able to teach a class of 30 students per year. This point is separate from the first point because scalability relates to potential growth/earning, and based on the laws of chance, you're more likely to find some major hit successes in professions that are scalable rather than unscalable.\n      * [*Source 40.*](https://pubmed.ncbi.nlm.nih.gov/19883140/) *Meta-analysis showing men are interested in things, and that women are interested in people.*\n      * [*Source 41.*](https://www.frontiersin.org/articles/10.3389/fpsyg.2015.00189/full) *Another meta-analysis that supports the previous one above; \"patterns of gender differences in interests and the actual gender composition in STEM fields were explained by the people-orientation and things-orientation of work environments\". Basically, even in male-dominated fields, women are overrepresented in service-based and people-oriented STEM fields such as the health sciences, with the trend being found on a multinational level. This also acts as evidence for the very first point about men choosing higher-paying jobs.*\n         * [*Source 42.*](https://www.bls.gov/cps/cps_aa2018.htm) *Evidence from the US showing this trend with women.*\n         * [*Source 43.*](https://afmc.ca/sites/default/files/pdf/CMES/CMES2018-Complete_EN.pdf) *Evidence from Canada showing this trend with women.*\n         * [*Source 44.*](https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance-2017/doctors-by-age-sex-and-category_health_glance-2017-53-en) *Evidence from OECD countries (38 in total, with another 10 non-OECD countries included throughout in some data).*\n19. **Men are more likely to ask for a raise.**\n      * [*Source 45.*](https://crl.acrl.org/index.php/crl/article/view/16689) *Men are more likely to ask for a raise; the only exception is when women enter managerial positions (i.e. are put in male roles, basically). It also shows that women are basically worse at negotiating than men (\"less successful\" = euphemism for being worse at).*\n      * [*Source 46.*](https://pubsonline.informs.org/doi/abs/10.1287/mnsc.2014.1994) *Women are only as likely as men to ask for a raise when they are explicitly told they can negotiate for one. I can tell you right now that most jobs rarely ever directly tell its employees that they can freely ask for a raise lol.*\n      * [*Source 47.*](https://escholarship.org/content/qt9978v172/qt9978v172.pdf?t=omys3w) *Women are less comfortable engaging in salary negotiations, they're less likely to negotiate salaries overall, and they're not as good at it as men (the researchers don't word this last point this way because it angers feminists, but that's the gist of it). There are many other reasons that they go into as well.*\n20. **Men are typically more aggressive/competitive in their mindset and attitudes regarding work** which helps them climb the corporate ladder more (e.g. you make more off commission in sales because you close more sales due to being more competitive).\n      * [*Source 48.*](https://archive.bio.org/sites/default/files/docs/toolkit/Why%20Men%20Still%20Get%20More%20Promotions%20than%20Women_HBR%20article.pdf) *Upon reading this, you find that women are essentially not as willing to do what it takes to climb the corporate ladder; the report says that therefore the entire civilizational structure should change to favor women, but that's just ridiculous. Why not just admit that women are not as willing to hyperfocus on their careers in the same way as men? Why not just admit that women don't do it because they simply don't want to sacrifice other areas of their life for a career? Why not just finally admit that women are different from men? They can't. And that's a problem for BOTH genders.*\n21. **The top people are always going to be men due to the variability hypothesis.**\n      * [*Source 49.*](https://www.journals.uchicago.edu/doi/abs/10.1086/493921) *Men vary greater than women; when seeing any of the extremes, men are more likely to be represented on both ends. That means the most successful people in the world are going to overwhelmingly be men, and the most unsuccessful dregs of society will also be men. This represents a problem with feminist thinking because they want \"equality\" when it comes to powerful, important, and successful positions in society and say that a lack thereof in these top positions are due to sexism and discrimination (and that therefore all of men and society need to just give women these positions to \"make it fair\"), but they will never talk about the men at the lowest ends of society or talk about equalizing that. I'm not saying they should become homeless criminals and whatnot either (rather they should focus on decreasing the amount of men that are disenfranchised here; but they'll never do that since they would have to admit that men aren't oppressors and would have to actually acknowledge the plights of men), I'm just saying there's a double standard here whereby women want the rights and privileges of both sexes with the responsibilities of neither, all the while blaming men for any (and all) of their own shortcomings and faults.*\n      * [*Source 50.*](https://www.sciencedirect.com/science/article/abs/pii/S0191886913003036) *Men vary more than women yet also tend to be better on average on measures of creativity.*\n      * [*Source 51.*](https://en.wikipedia.org/wiki/Variability_hypothesis#:~:text=The%20variability%20hypothesis%2C%20also%20known,most%20traits%20than%20females%20do.) *For those who still don't get it, here's a Wikipedia article since they tend to describe things fairly simply and succinctly.*\n\nJust to really drive home the point, I quote the official statement of the US Department of Labor after having a massive [study](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) conducted for them:\n\n>**This study leads to the unambiguous conclusion that the differences in the compensation of men and women are the result of a multitude of factors and that the raw wage gap should not be used as the basis to justify corrective action. Indeed, there may be nothing to correct. The differences in raw wages may be almost entirely the result of the individual choices being made by both male and female workers.**\n\nAnd even ignoring the technical research aspects, just think about it like this: If a woman were to do the same job as a man for less pay, only women would get hired because that would be CHEAP LABOR. And for those who don't know, there's a whole sexism argument that claims men get hired more easily than men (which also isn't necessarily true either, but that's a separate discussion).\n\nThere isn't a single statistician who isn't braindead, let alone competent, who takes the statistics presented about the gender pay gap myth at face value when drawing conclusions. It's only after you account for all the variables available can you really begin to extrapolate true causality, and even then it is still weak with these types of statistical analyses anyway since it's virtually impossible to account for every variable that exists *and* have a full consensus for data rather than a statistic that has a much smaller sample size. Plus, when it comes to statistical analyses like this, you're ultimately seeing how things relate to one another (i.e. correlated) rather than seeing how they directly influence/cause something. The only way to truly test for causality is by running actual experiments with strong controls in place (which is nigh on impossible to do in situations like these). If you take a statistics class or two, you'll learn about this stuff more in-depth. Multivariate analyses are pretty much always better than univariate ones (when drawing final conclusions from, anyway), and it's due to reasons like this where society perpetuates the gender pay gap myth as a social dogma.\n\nIf women can do anything men can do (and \"do it better\"), then why are they still supposedly \"oppressed\"? Why are they still the victims? And why do they need government legislation to mandate \"gender equality\" in order to achieve it? If they were really the same as men (i.e. \"equal\") in all these regards, wouldn't perfect equality naturally occur based on merit alone? It doesn't make sense, and it's simply because it's just not true. Men and women aren't the same, and we won't ever be the same. That doesn't mean we shouldn't be treated fairly—equity over equality, always—but this myth needs to die once and for all.\n\n﷽\n\nوَلَا تَتَمَنَّوْا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا ٱكْتَسَبُوا۟ ۖ وَلِلنِّسَآءِ نَصِيبٌ مِّمَّا ٱكْتَسَبْنَ ۚ وَسْـَٔلُوا۟ ٱللَّهَ مِن فَضْلِهِۦٓ ۗ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
    "title": "Debunking the \"Gender Pay Gap\"",
    "subreddit": "MensRights",
    "timestamp": 1688347611,
    "score": 196,
    "keyword": "woman engineer"
  },
  {
    "text": "I am so so very tired from the overtime I need to work because of women in the teams I work with who aren't functioning. I'm working until midnight day after day and into the weekend week after week. It's all a lie. Almost no woman I work with who has a demanding position actually works. I do it all Such women have the degree (I have it too) or a title in the email signature three-four words long.  Equal, no? Well no. Most of the time, almost always, she won't have a clue on how to do the work her job requires. They will spread confident statements that will sound knowledgeable but if you actually know what they are talking about you will know it's complete nonsense - mistakes and fabrications - they are simply making it up (instead of simply looking it up). It becomes obvious to you after a while that they see their competence not as being skillful, experienced and as a result very effective - but as being good at throwing around the right \"buzz sentences\" to make it look as if they are someone you can trust with that job. They will send you their \"completed task\" and it will almost always be half baked. You will need to do your share - and 50% or more of theirs, you will need to spend more time on fixing problems they created (by never asking how something is done and instead \"throwing something\"), and then you will find out that while they know you are leaning over your computer at 10 pm working to fix it, they are out of office.\n\nThese \"a woman can do anything a man can\" women, holding \"same position as a man\", simply create a facade, a theater show. Mostly the only thing equal to a man they have is the job title and degree - they don't actually have the knowledge, know how to do the job or put in the effort needed, rather, the \"equal number of women\" in such positions is made possible by men doing their own 100% and then 50% of the women's work.\n\nThis is the reality of it all. Not all women in these positions are like that - absolutely not! I worked with bright, hard-working, responsible, knowledgeable women (\"knowledgeable\" means: being responsible enough to spend time looking for all the needed knowledge and making sure you really understand it, instead of relying on mumbling something and on someone else \"taking care of it\"), who will hold their end of the pole with you and won't let go until it's in place, but they were a rare sight. In nine out of ten cases, it would be sleepless nights, no weekends, to do the woman's part and then some (as for men, my experience was that they do their best - each according to his capacity. If they're not holding their end it's because their mother is in hospital, not because they don't want to \\[edit: come to think of it, a slouchy man in these responsible roles just gets replaced as soon as everyone have time to breath again. Maybe knowing this pushes men to deliver while women might get the opposite message - we need you for the body count so as long as you don't shoot a missile at the office you won't get replaced\\]. And if men don't know something they just say it and ask, instead of inventing nonsense that create problems that you need to then solve. Them not minding their \"ego\" and simply asking for instructions saves unimaginable amounts of time). Has anyone else had this experience? Any doctors or engineers here who can tell how it works in their field? (I'm so tired).",
    "title": "I am so so very tired from the overtime I need to work because of women in the teams I work with who aren't functioning. I'm working until midnight day after day and into the weekend week after week. It's all a lie. Almost no woman I work with who has a demanding position actually works. I do it all",
    "subreddit": "MensRights",
    "timestamp": 1680759478,
    "score": 166,
    "keyword": "woman engineer"
  },
  {
    "text": "Red Pill saved me from being a \"captain save h**\" I'm not even sure if this post belongs here or not but I couldn't find anywhere else to write this. I have been a MRA for a little over a year now, and I read this subreddit all the time and want to first say thank you for a lot of the insights you guys share. And for the record I do NOT believe that MRA and Red Pill are exactly in the same category. But I would like to share how streamers in the Red Pill/Manosphere community like Kevin Samuels, Think before you sleep, and even AT, have helped me realize how much self worth you should have as a man, what we deserve, what it takes to achieve it, how to know if a women is a asset to you or a liability, to stop putting women on these pedestals, whether they're western or from overseas!  \n\n\nThis dive into the more red pill communities came when I would be thinking about my (29M) relationship, while I was in it with this woman (25F). Now I had known this woman since highschool, and man she was fine af. Now I wasn't no lame(prepare for humble brag), in fact quite the opposite, I was the star athlete in highschool, top 3 recruit in my state(US), 15th ranked recruit nationwide, and I was great looking, and for a lack of better words, I had hoes. But there was this one girl that I couldn't get and man she was fine. For whatever reason she would mess with almost all my other friends/teammates but me. Now this didn't really upset me(she was a freshy and I was a senior) but there was always this \"I'm gonna get her someday\" attitude that always stayed with me. Anyways after highschool I went and had a pretty successful career in my sport, becoming a 3 year starter, winning many championships in college eventually graduating, playing pro, and a few years ago I retired.   \n\n\nNow it took me about 2 years to really get back on my feet after retiring, since I hadn't really developed any skills outside of my sport, and I didn't want to be a coach. Since I have always loved video games, I ended up getting into programing which I cant be thankful enough for since it really opened up some doors. I busted my ass and swallowed my pride by working as a maintenance tech while I taught myself to program for 2 years, and sure enough towards the end of last year I was able to land a position as a Mid level software engineer. Now all this time me and that chick have been following each other on IG, and while she was partying, doing onlyfans, and getting passed around, I was grinding, but for some reason I still wanted her. Last year, I reached out to her and she's surprised and flattered and blah blah, so eventually we go on a date, and lo and behold, she has a kid she's been hiding... Now normally thats a dealbreaker for me but since this was my dream girl back in the day and coming from a single parent home myself, I had a soft spot for her, I brushed it off like it wasn't a big deal.... I know I was simping hard lol. I learned a lot about her when we were dating, somethings I wish I hadn't lol. Just to name a few, she was basically a major thot her whole life, also she was struggling real bad jobless, her and her kid living with her parents, barely surviving off of the onlyfans/stripper money she made(she stopped for the kid, plus aging). The BD wanted nothing to do with her, hell he moved out the country. Even her own family barely liked her and etc. All in all she had some MAJOR baggage/issues, but it again that didn't matter too me. I was being a captain save a h\\*\\*. She convinced me that she found god and that she changed and became celibate, and finished her degree and blah blah, and I believed it. I know, how stupid.   \n\n\nNow the relationship was going smooth, I mean she had some great qualities, and things seemed to be going at a good pace, not bringing me around the kid etc, until one day about 3.5 months in she really started pressing me, like hard. Saying how much loves me and respects me, how she wants me to be stepdad and get married, blah blah, I mean love bombing the shit outta me, and my dumbass was eating it up, because in MY MIND she's still that girl from highschool that got away. So now she's more demanding, but I've always been pretty good about setting boundaries and being patient so nothing ever went outta my comfort zone. But of course like most of us have been through, I ended up paying for every date, always picking her up, buying her things, giving her emotional support, helping her with jobs/finances, which I don't mind doing for my girlfriends, as long as there's some reciprocation besides sex...  \n\n\nNow what setup my path down the red pill rabbit hole was when I was looking for a new place, she never insisted on living together and I told her it was too soon (only 3 months in at this point) but I realized that eventually she will try to strong arm herself and her kid into my home, because she had been lowkey doing that already. I had been looking for a new but bigger one bedroom initially, but then when I would think about her, and I would start looking for two bedrooms, even houses. At the time I didn't even realize why I was doing that, and I was also looking for advice on being a stepdad, even though deep deep down I didn't want to be. That lead to me seeing these redpill videos talking about why men shouldn't date single moms, red flags to look for in women, etc.. I was curious so I watched them, then it all hit me. I was being so blinded by the fact I got my dream girl from highschool that I didn't see all the other MAJOR OBVIOUS RED FLAGS that even a blind man can see. Mainly how she wasnt that girl anymore, how manipulative she was, the wishy washy attitudes/temper tantrums, not taking accountability, the VERY disturbing sexual past, the not so subtle \"I hate all men but not you\" attitude, the kid who was 2 already, I mean the list goes on and on. Soon I found myself thinking, WTF am I doing? How does this relationship benefit me besides sex whenever I want? Sure she's great... sometimes, and makes me happy... sometimes, but like I'm way better than this. Sure she's still hot but not as hot as she was when she didn't want me, she didn't want me when she was childless, she didn't want me before she was used up, I mean for gods sake she didn't want me when I was pro athlete, her decision making is terrible lol. So what am I doing? Why am I even considering taking on all her burden and past mistakes when I've worked so hard to put myself where I'm at? It's because I didn't have a healthy sense of myself, I didn't see how valuable I was, my whole identity was sports and when I lost that, I didn't know who I was and I had to figure out who I was all over again, all alone. And idk if this sounds bad or not and I really dgaf but, the manosphere helped me realize this. Those men along with a few others in person really helped me realize, how stupid I was being, how much better I deserved and how much better off I am to stay away from women like that, cause even a guy like me who seemed to have it all can fall flat on his face and fall for the okie doke.   \n\n\nNow there's no excuse, I ignored all those red flags, I chose to be with her, and I own up to it. And I can respect someone wanting to change, but in her case it was too late, and I realized I or any other man should have to fix her messes. I also took responsibility and dumped her ass, not in a mean way of course, and she still did not take it well lol. Now all I can do is continue to move forward, and learn from that experience, and to keep putting in the work no matter how small everyday to better myself. I know this got really long and is off topic about what normally goes on in here, but I just wanted to share, I know some men out there went through something similar. And if you are currently, for god sakes stop.  \n\n\nTLDR, How the redpill/manosphere online communities helped in convincing me to dump a downbad thotiana.",
    "title": "Red Pill saved me from being a \"captain save h**\"",
    "subreddit": "MensRights",
    "timestamp": 1678221450,
    "score": 73,
    "keyword": "woman engineer"
  },
  {
    "text": "Trying to find an article from a woman journalist who spent time with men and wrote a positive article about them and her experience. Hi - I realize this is a long shot, but I am trying to find a somewhat older story about woman reporter who spent time with men and began to realize her conceptual model of men was a lie and that she began to see that the vast majority were not the ogres she had been told they were, but were instead the caring souls who would work together and agonize to find the right answers to difficult problems. She said in the story that she felt honored to have been able to witness their struggles to help others and to do the right thing and felt that she was a small person in a room of giants.   \n\n\nI suspect the article has been purged from search engines and wondered if anyone might know who the author was and/or could provide a link? Many thanks ahead of time.",
    "title": "Trying to find an article from a woman journalist who spent time with men and wrote a positive article about them and her experience.",
    "subreddit": "MensRights",
    "timestamp": 1691426295,
    "score": 31,
    "keyword": "woman engineer"
  },
  {
    "text": "How do I create a wall between me and my assets? I'm 22m, have a large asset base of stocks, house and possessions. Some possessions include classic cars and bikes and expensive equipment.\n\nBefore I enter into a defacto relationship or potential marriage, I want to create a brick wall or many walls between me and assets.\n\nI was in a relationship in highschool/uni for 2 years. I was living with my parents and when we broke up she asked for money that she had \"invested into the relationship\". Told her to get stuffed but it was an eye opener for me.\n\nI take it child support is an unavoidable cost, but can be minimised based on how much I \"legally earn\".\n\nI've worked hard in oil and gas as an engineer, and I don't want all my time to be wasted by some woman trying to take half.\n\nAny tips appreciated. People at work have given me a few tips they would've done before their divorce. My legal system is Australian.",
    "title": "How do I create a wall between me and my assets?",
    "subreddit": "MensRights",
    "timestamp": 1692762282,
    "score": 26,
    "keyword": "woman engineer"
  },
  {
    "text": "What is the crudest things you've heard being said about women in a male dominated space? I am interested to know if anyone has any similar experiences to me.\n\nI am currently studying in an engineering course and I have been really bothered by the remarks I have heard over my past 2+ years studying here. Usually, I am the only woman in my class.\n\nPersonally, one of the worst things I've heard was a conversation between 2 guys, and one of them said, \"When you're doing it with her, and she's ugly but hot, cover her face. And if she's pretty but has a bad body type, cover her body with a blanket.\" \n\nI don't understand how they are able to say such foul things in close proximity to me, a woman and not feel shame or guilt.\n\nedit: thanks for the responses, it's sad really.",
    "title": "What is the crudest things you've heard being said about women in a male dominated space?",
    "subreddit": "Feminism",
    "timestamp": 1695591139,
    "score": 140,
    "keyword": "woman engineer"
  },
  {
    "text": "Products for Women Please remove if this is not allowed. I am frustrated that so many products made for and marketed to women are produced by companies that are largely controlled and managed by men. I am currently thinking about a tech company that is creating lab grown diamonds for jewelry designed specifically for women, and the entire company with the exception of one engineer is made up of men. To be honest I find their jewelry rather generic and uninspired, but I’m not sure how companies continue to make products for women without any input by women.\n\nI would really like to be able to see a list of the companies leadership before I purchase a product because I’m tired of being talked down to by CEOs and marketing managers who think that they know women need when they’ve never had to spend a day dealing with safety issues, hormones, or any other issue that any woman has to deal with in a day.\n\nI’m sick of being underrepresented in the marketplace, and I want more transparency from the companies that I purchase products from. Thank you for listening.",
    "title": "Products for Women",
    "subreddit": "Feminism",
    "timestamp": 1685159018,
    "score": 92,
    "keyword": "woman engineer"
  }
]