[
  {
    "text": "Am I an employee or independent contractor?   My fiancé is a nurse, she worked for a women helping her special needs child in NC, USA. she did not receive a  W-2. The women set her hours and sent her payment via PayPal. No taxes were taken out.\n   IRS states that since the woman controlled her hours and what she was paid for, she was an employee.  Can someone help?",
    "title": "Am I an employee or independent contractor?",
    "subreddit": "jobs",
    "timestamp": 1676423074,
    "score": 5,
    "keyword": "woman nurse"
  },
  {
    "text": "Doctors and nurses of reddit: what's the funniest/craziest thing a woman in labor has yelled at you?",
    "title": "Doctors and nurses of reddit: what's the funniest/craziest thing a woman in labor has yelled at you?",
    "subreddit": "AskReddit",
    "timestamp": 1693665024,
    "score": 2,
    "keyword": "woman nurse"
  },
  {
    "text": "I went to a Texas ER yesterday. It was bad. tl;dr - Title\n\nYesterday I went to a Dallas, TX ER. About ten minutes after I woke up that morning I collapsed as sudden, sharp, pain started spreading from my lower left abdomen. It was *excruciating*. I have a very high pain tolerance, and I couldn't speak, or stand up, or walk. All I could do was writhe and cry and vomit in agony. I've had an ovarian torsion that required surgery before, as well as several instances of ruptured ovarian cysts that caused full-on internal bleeding. This felt like that.\n\nMy husband called 911 for an ambulance, as he did not believe he could get me safely to the car and drive with me in that condition.\n\nThe EMTs wouldn't even look at me and clearly didn't want to take me to the hospital. You see - we just moved, and the neighborhood is poor. I have 'locked hair, piercings, and tattoos and I wasn't obviously gushing blood from something like a gunshot wound. They quite clearly assumed I was faking and drug-seeking.\n\nAnd the rest of the day got no better.\n\nThese medical professionals let me writhe in agony for well over an hour while they grilled me about whether I was pregnant or not, over and over. Ironically - I'd actually really love to have another baby, but I had to be surgical sterilized (cauterized tubes) for my own safety over a decade ago. AND I haven't had sex in six months, which my husband confirmed for them at my bedside. None of those facts, or that trauma mattered to them. They angrily demanded that I *stand up* and go do their piss-test. I had to remind them, nearly screaming, that I couldn't stand up or walk and they begrudgingly and resentfully got me a bedpan.\n\nAll my blood and urine work came back clean because *of course it did*. I am not pregnant, and I wasn't on any illicit substances.\n\nThey did finally, at this point, provide a small amount of pain relief.\n\nThey did an ultrasound. They CT'd my abdomen.\n\nAnd much later an exasperated male doctor comes back to tell me I have a UTI. I know my body - this was *not* solely a UTI. I said as much, and restated my history.\n\nFriends, I shit you not, this is what he said to me (pissily):\n\n\"Well, *yes*, we found ruptured hemorrhagic cysts on your ovaries. And *I guess maybe* that could've caused your pain. I don't know. But there's no way to be sure. There's nothing we can do for you - we're discharging you.\"\n\nAs you might imagine - I have concerns at this point. I've been through this before, and both the internal bleeding and the recovery pain are things I wanted clearly addressed by the staff before I left.\n\nDespite my pain and the medication, I was calm and very polite as I tried to ask my questions. The doctor just walked away. And when I tried to ask my nurse she literally wouldn't stop interrupting me to talk over me. When my husband asked her why she wouldn't let me speak, she literally threw up her hands and said she wasn't going to talk to us anymore and walked out. I was discharged, and I needed to *fucking leave*.\n\nWhen my husband asked for a Patient Advocate, no one would acknowledge the request or even look at him. We didn't get a patient advocate, despite asking multiple times.\n\nThere was nothing to do but leave. Despite my medical history, proof of currently rupturing cysts on my ovaries, and clean drug tests - they still treated me like an addict using them to get high. And the second I wasn't pregnant, they didn't give a single flying fuck. I was a living incubator, or a drug addict, or both. And they didn't let me be anything else - I couldn't just be a person in crisis who needed help.\n\nThey didn't even note the ruptured cysts they found on my discharge paperwork - just the UTI.\n\nI don't want to hear excuses about the pandemic or worker burnout. It simply *isn't* an excuse. If you can't do your job without punching down on sick people *it's on you to find a new job*. Period.\n\nThe woman who personally performed my ultrasound, and the gentleman who directly performed my CT were both kind, empathetic people who obviously did their best. Being decent is clearly still possible.\n\nNo one else chose to be decent yesterday at DALLAS REGIONAL MEDICAL CENTER.\n\nI would tell you all to please be safe, but I don't really know how that's possible all things considered. Be aware, if nothing else, of how little you matter to these people.\n\nEdited to add: We have insurance, so that certainly wasn't the issue here.\n\nEdit #2: I can't see *any* comments left in the last 45 minutes or so you guys. I get phone notifications, and nothing is there, though the comment count continues to go up. From what little research I've done, it looks like A TON of comments may be being moderated, or auto-moderated. I'm not sure why, as I can't see the full comments but what little I can see doesn't look rule breaking. I appreciate the guidance, I just wish I could actually see it. Do the mods have any insight, here?\n\nUpdate: From the mods (thank you!) - \"Some comments are removed for moderator approval. Your post has hit [r/all](https://www.reddit.com/r/all) so comments are being made faster than they can be approved.\" I will check back later, and I really appreciate everyone taking the time to share what they know and offer their support. <3",
    "title": "I went to a Texas ER yesterday. It was bad.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676640168,
    "score": 20446,
    "keyword": "woman nurse"
  },
  {
    "text": "Husband cleared a private space for a nursing friend Had some friends over for brunch today. They have a 3mth baby. As I was flipping pancakes my husband comes in and says \"I cleaned LO's room and cleared the couch [in our child's room] in case she wants a private space to feed the baby.\" \n\nI said that was a thoughtful thing to do. He said he's learned a lot about women from me & it doesn't matter if HE knows he's a \"safe\" man to nurse in front of, what matters is how the WOMAN feels about it.",
    "title": "Husband cleared a private space for a nursing friend",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1672729787,
    "score": 11252,
    "keyword": "woman nurse"
  },
  {
    "text": "My husband pled guilty after raping me Back Story:\n\nWe were separated, he'd been sexually assaulting me for years and I had finally filed gotten the courage to file for divorce. He kept making excuses for why he could not hold up his end of our custody agreement. I'd just started a new job and did not have daycare lined up yet. The agreement was for him to stay for 4 days to watch over the kids while I worked for that first week.\n\nI hadn't been assaulted by him in a while, he seemed to have excepted the divorce, he had a new partner from what I understood, and I thought I was safe again.\n\nThe assault:\n\nOn 09/12/2019 (the last of the 4 days he was staying, I was taking him home in the morning) I went to sleep after coming home from work (evening shift nursing so around midnight). I woke up twice in the middle of the night because I could feel what he was doing. I turned my head to look at him and he immediately stopped. He had been masturbating and penetrating me with his fingers. I was still too weak to move my body and dozed off again. The second time I woke up he had immediately started again. This time I was awake enough to move my body. I. Kicked. The. FUCK. Out of him. I kicked him hard enough that he fell from the bed and hit the floor. But while I was kicking him, I felt myself hitting a smaller body. He had our 3 year old (unpotty-trained) son laying naked next to him while he did this.\n\nI don't remember if I slept again. I know that in the morning I sent him a message to confront him. I knew if I went downstairs to confront him face to face, I would kill him. He apologized and said he never meant to hurt me and he just didn't want a divorce. He always said this after he assaulted me. It was like he had a script in his mind of what to say to make me let it go. I got up. I put on something, I don't remember what I wore this morning. I marched downstairs, past him, grabbed my keys, went to the police station and told on him.\n\nReporting:\n\nThe first officer to greet me listened to my story and said \"Okay.......he's your HUSBAND.\" As if that should have excused it. I don't know what it was about the way that I looked at him but he immediately went and got the detective they had who specialized in sex crimes. HE listened to me and took the report seriously. They let me write it out in detail. He asked me what I wanted to happen. He told me what the next steps were. I asked that they made him go to therapy. I knew that he likely did these things to me because he was violated the same way throughout his childhood. I knew he was a first time offender and jail was not likely so I wanted to make sure he was rehabilitated in SOME way.\n\nHe found the police report paper as soon as I got back (I'm sure someone who knew him saw the car parked at the police station after I went and told him). He ran from the officers for 10 days and then went in to talk to them and tell them that he did it because \"it was his kink\". They'd already filed charges and put out a warrant the day before, so they booked him 09/23/2019. He stayed there until March of 2020 when he was released on house arrest. This was when quarantine began.\n\nThe courts were closed until 2022 and then they continued. Lots of stalling over these years from his lawyer. Even a no call no show from his lawyer. They offered him a couple f reasonable plea deals. He came back with one for misdemeanor assault. We said no. I did not want it to look like this was not a sex crime. That was really important to me. No deal was reached. They marched on to trial. It was set for earlier this year. In the weeks leading up to trial, things were looking shaky. I was advised that cases like mine were extra hard because many people this men should be able to brutalize their wives. But I stuck it out. If I didn't fight for me, I knew I could not live with myself. No matter the result. About 4 days before the first day of trial, the prosecuting attorney and victim advocate (amazing women who were my only support through this process. I hope life is extra sweet to them for the rest of their days) called to tell me he agreed to plead guilty to misdemeanor domestic assault and 2 years of probation on the sex offender case load. A PO who works with sex offenders and sex offender therapy. No hand guns. And although it was not a rape conviction, it was him admitting to harming me on purpose, which felt great.\n\n&#x200B;\n\nI wanted to share this because, in the months leading up to trial, I **SCOURED** this reddit. Looking for someone with a story like mine. Looking at stories from women who had won their case. Looking at stories from women whose abusers got away with it. I wanted to be prepared for it all. So, I hope that any other woman going through this can find this story as well. If a woman like me is reading this, I just want you to know that it is not okay for a person to violate you, **no matter what** their role in your life is. It was hard, but every moment of freedom after stepping into that police station was worth it. Every night that I got to sleep and not wake up to him touching me. Learning how to stay inside of my body again. Learning how to say \"NO\" and set boundaries without fear. Seeing myself start to smile and laugh again. Finding my personality again. Seeing our kids change now that they do not have to witness abuse anymore.\n\nThere is SO much good life to live outside of abuse.\n\n&#x200B;\n\n\\[Editing to add more information\\]\n\nI did not expect so many people to see this. Thank you all for your kind words and support. After I reported him I ended up moving to where he could not find us. I was facing heavy harassment from his family and it was the victim advocate and detective who suggested moving for safety.\n\nNo contact with him since 2019. Our kids have been doing great. A lot of you asked how the son who was assaulted is doing. He is neurodivergent so it is hard to really discuss this with him. However, he has become a very happy and creative kiddo. Always laughing and singing and dancing. He is very protective of other people and hates to see others be hurt or picked on. My daughter who is the eldest is old enough to communicate for herself and I have asked her if her dad ever did anything inappropriate to her. She says no but she has also asked not to see him outside of occasional visits and even then she asked for no in person contact at all.\n\nSeeing this post reach women who have experienced the same has been a healing experience in itself.",
    "title": "My husband pled guilty after raping me",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1682146697,
    "score": 9510,
    "keyword": "woman nurse"
  },
  {
    "text": "Over 200 Women's Pain Ignored, nurse was stealing anesthesia drug: \"This American Life\" This American Life addresses how women's pain is blatantly ignored and minimized.\n\nhttps://www.thisamericanlife.org/804/the-retrievals\n\nA nurse at a fertility clinic stole the fentanyl used for EXCRUCIATING egg retrievel procedures at a YALE FERTILITY CLINIC!\n\nShe replaced the vial's liquid with PLAIN SALINE. \n\nThese women were ignored and their pain was waved away for MONTHS until the truth was discovered.\n\nWhat's really fucked up is no one batted an eye with Woman One, right? Surely she said \"WHAT THE FUCK?\" but they wrote her off as hyperbolic, exaggerating. \n\nAnd so on and so forth.\n\nWoman Two, Woman Three, Woman Twenty... Woman Ninety: And so on. . . COMPLETELY IGNORED. All DISMISSED as exaggerating or drug-seeking.\n\nSurely, at Woman One Hundred someone said \"dang, why are these women feeling so much pain?\"\n\nFUCKING NOPE\n\nSo many women saying \"uhhh this hurts a lot more than you said, than I was told, than I read online, than my friend/sister experienced?\"\n\nA L L F U C K I N G  I G N O R E D\n\nGuess what?\n\n200 women experienced intense pain due to lack of medication.\n\nHow? HOW THE FUCK DID IT GET THAT HIGH BEFORE SOMEONE TOOK A WOMAN SERIOUSLY????\n\nBecause no one takes women's pain seriously AND THAT'S DOUBLE IF YOU'RE BLACK OR BROWN!!!\n\namazing.\n\nYou will never convince me that this nation doesn't hate women. *****Please, please subscribe to \nr/WeDeserveBetter to keep tabs on women's MALTREATMENT in the medical field, from IUD insertion to unmedicated biopsies and LEEPs, etc. \n\n*CAUSE IT'S REALLY FUCKED UP Y'ALL*",
    "title": "Over 200 Women's Pain Ignored, nurse was stealing anesthesia drug: \"This American Life\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1688776499,
    "score": 5285,
    "keyword": "woman nurse"
  },
  {
    "text": "Are you comfortable going to a male OBGYN? To preface this, I don't think men who choose gynecology do so with any hidden agenda. That's never the issue.\n\nI've been going to the same OBGYN lady doctor for over a decade, but she retired this year. In my hunt for a new doc who accepts my insurance I was recommended one in my area by a women's clinic. The doctor's name was foreign but they said \"she sends us a lot of patients\", so I assumed it was a woman. \n\nI went in for my PAP and to get my IUD replaced. A lovely female nurse practitioner did my exam, and she scheduled me for two weeks later to get the IUD sorted since they had to order in my brand. When I came in she wasn't able to get the old one out.  I was a little freaked out but she scheduled me with the doctor for the next morning, and then I found out it was a man. \n\nI was already anxious over my stuck IUD and the possibility of it being embedded. I got very uncomfortable with him being a man, him not understanding the pain of IUD removal/ insertion. Now, he did it all very quickly but with such a lack of empathy. I'm used to women who handle my business down there being very communicative; this is my finger, this is the speculum, you'll feel cold, you will feel a cramp. This guy just went in there saying nothing and ripped the damn thing out of me. I felt like my insides were being pulled out of my vagina. I asked for a break before inserting the new one but he kept preping for insertion and saying \"I'm not doing anything yet, just cleaning\". When I said I'm ready he just went for it without telling me what's happening, and I just started tearing up between the pain and feeling so anxious and distraught. \n\nI can't help but to think had it been a woman she'd have more empathy and understand the level of pain, albeit for a short time, I was in. It would have made the process a little bit easier. The female nurse stayed in the room with me after he walked out like it was nothing to make sure I was ok. Her patience and kindness helped. He got the job done quickly, sure, but I felt dismissed in a way, and I really don't want to be in his care again. This has been my experience with every male doctor I've ever been to. \n\nHas anyone had positive experiences with male OBGYN?",
    "title": "Are you comfortable going to a male OBGYN?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690400162,
    "score": 2916,
    "keyword": "woman nurse"
  },
  {
    "text": "This guy I’ve been seeing just revealed his true colours and I’m a little shook This is our 4th date and I had him sleep over last night. We knew each other in high school but recently reconnected last year. We normally go on walks and eat out but because of all of the forest fires, neither of us can do much with our bad lungs. I have asthma and he is bouncing back from being pretty sick. \n\nThis is where things got interesting… he said that was his first time in a hospital in his life, was appalled by the way he was treated, and declared that white privilege doesn’t exist because he had one bad experience in life. \n\nI was APPALLED. I wanted to kick him out of my house in that instant but I was scared. Then—THEN he starts going off about vaccines giving masses of children heart attacks and his mom (who works in a hospital) can confirm it. \n\nMy granny, an indigenous woman who survived the horrific residential schools, has been a nurse her entire life and still is. The office she works in deals with children and she hasn’t said a word about kids getting heart attacks recently. I didn’t tell him any of this, I just let him keep talking.\n\nHe said there’s NASA footage from the 70’s about chemtrails being real, and I finally spoke up and asked him “do you thing the moon landing was real?”\n\nThis caught him off guard. He thought about for a second and says “yes” and I could just see in his face that he might blow a fuse by saying it’s real. \n\nHe has all sorts of conspiracies that he dumped on me and I’m mentally exhausted from today. From sex trafficking, vaccines, white supremacy, pedophile this and pedophile that, the government “gets or dna through our phones” and I couldn’t even do my makeup I was shaking so hard. I put on baggy jeans and a tshirt because I felt dirty after having him sleep in my bed.\n\nIn my fucking house… the way he hugged me before, he can snap me like a twig if he really wanted to. I admit, I was scared. I had to bite my tongue for hours until his ride home was arranged and pretend to listen without getting visibly angry. A part of me wants to address the white privilege part very badly over text, and another part of just wants to ghost him forever. I wish I was more assertive.\n\nI don’t know. I’m just venting. I think I’m shocked because I actually liked him, I started feeling sympathy for this guy. Now I know he’s a very bitter and afraid man.\n\nEdit: I would like to thank everyone for the affirmations and thoughtful responses, this is not easy for me since I have very little experience with dating 😢 I feel invested, I feel tricked, I feel disrespected, and I don’t feel safe. All of you have helped immensely with that, especially after a good nap with some sweet dreams… I feel good now",
    "title": "This guy I’ve been seeing just revealed his true colours and I’m a little shook",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687657724,
    "score": 2097,
    "keyword": "woman nurse"
  },
  {
    "text": "My primary care doctor humiliated me today. I am so hurt and unsure what to do. Update - I have been diagnosed with Alpha Gal. The red meat allergy, amongst other problems it causes. I’ve altered my diet and already feel tons better. Now, the urge to make an appointment with this lady again and tell her off is strong. Thankful to feel better.\n\n\n\nMy family has went to the same practice starting with my grandmother as a young lady. Eventually doc had to retire as he is getting older. He trained a nurse practitioner alongside him for 10+ years, with doc running things behind the scenes after “retiring”. He’s since retired completely and there are a couple of nurse practitioner’s that work in the office now including the one he trained. Let’s call her Karen for today. I love Karen and have always trusted her. She’s very knowledgeable and actually listens to you. Over the last couple of years she’s become a little rough and tough but what healthcare worker hasn’t? I am a nurse myself and she’s known me my entire life basically. I don’t go to the doctor too often as I’m generally pretty healthy. I have some female issues and have been diagnosed with diverticulosis. This combo makes it hard for me to know where the pain is actually coming from at times. Three years ago I was diagnosed with Autism and ADHD, by a licensed psychiatrist. I didn’t believe it at first and don’t talk about it much as people don’t generally take it well. Usually they don’t believe someone like me could have Autism. \n\nFast forward to Monday and I wake up a little dizzy, fevers, chills, just feeling terrible. I rarely don’t get out of bed. I have to be very sick and people know when I’m down, I’m really down bad. I nursed myself the best I could and kept hydrated. Was vomiting, and sweating so bad my sheets were drenched multiple times. Couldn’t hold food down. Only other symptom was a flare up of this lower left abdominal pain and an earache. I’d been swimming several times over the weekend and figured I’d got water in my ear and now it’s infected. My nursing knowledge told me probably an ear infection or maybe diverticulitis flare up again. I went to the urgent care Monday night as I couldn’t hold fluids down anymore. They couldn’t find anything wrong and said there’s a stomach virus going around. Gave me some Zofran. I had already made an appointment with my regular NP for today to follow up on this abdominal pain. \n\nArrived at the office on time and only one car in the lot. Thought should be good to get in and out which is what usually happens. I’ve often narrowed down symptoms and it’s easy breezy visit. Today I waited two hours. Thought that was off but whatever, no biggie. She’s usually bubbly and you can hear her greet other patients as she enters their room. Didn’t hear that today either. Finally she comes in and I begin to explain my symptoms. I start to say I have a couple things going on and I’m not sure which is causing the fevers. She had such a flat affect today. She stopped me and said tell me the main reason you’re here, top one or two, that’s the best I’ve got and best anyone will have to offer you. Because of my autism I struggle to understand sarcasm and jokes. Assumed she was kidding. She briefly checked me out, didn’t listen and continued to rush the visit along. She ask me to show her where the abdominal pain was. I kept having to ask clarification questions because she was being so short. These are a few examples of what she said to me. She told me it was in my head. It’s anxiety. Said I know your mom died when you were a child and said to stop playing the victim. She said I can tell by the look on your face you’re not being receptive to what I’m saying. She said just because you work with cancer pts all day doesn’t mean you have cancer. She said you’re just gonna have to make another appt I don’t have time for all these questions today. I was only responding to what she was saying. Told me to stay off google that it makes me worry. Told me I know your sister is sick but you’re not a sick person. She said it’s hard to help people who don’t want to help themselves. Told me you communicate just fine with your daughter. You don’t just have social problems with one person and not others. Said I have one of the easiest nursing jobs there is and I shouldn’t have trouble coping. I’m a hospice nurse. My husband and I have had some troubles lately and she said she said, it’s not like he hits you. I didn’t ever say he did! She was jumping from subject to subject so quickly. She even clapped her hands and kept putting them on her forehead like she was praying. I said I’m sorry this ain’t in my head. I can’t make up fevers. She said no, but why are you telling people you have Autism?? \n\nI began to cry as she continued. Eventually turning into an ugly cry. She looked me dead in the eyes and said all of this to me. No remorse whatsoever. I let her finish because I was honestly frozen in such shock. She basically called me a total hypochondriac. No one else was in the room with me. I trusted this woman. I’m still in shock, and still sick. I don’t know what provoked this. \n\nLate last night I reached out to someone in her family and they told me they’re very concerned because something is wrong with her. Said the business is failing and people are leaving the practice. They mentioned thinking she has dementia. I’m concerned what she’s going to put about me in my medical record. I am so hurt and still don’t understand what provoked this. Does she really have dementia? Is that why?  Am I really all those things she said?? Struggling to process this.",
    "title": "My primary care doctor humiliated me today. I am so hurt and unsure what to do.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1691652478,
    "score": 1904,
    "keyword": "woman nurse"
  },
  {
    "text": "The Chen 2023 Paper Raises Serious Concerns About Pediatric Gender Medicine Outcomes When I started my Child and Adolescent Psychiatry training in the 2010s, the diagnosis and treatment of gender dysphoria were rapidly becoming controversial in the field. Doctors and nurses who had spent decades on inpatient adolescent units, usually seeing one gender dysphoric child every 4-5 years, now saw multiple transgender-identifying kids in every inpatient cohort. It was a rare patient list that did not include at least one teenager with pronouns not matching their sex.\r  \n \r  \nViewpoints about this differed, with every student, resident, fellow, and attending having their own perspective. All of us wanted what was best for patients, and these discussions were always productive and collegial. While I am not naive about how heated this topic can be online, I have only ever had good experiences discussing it with my colleagues. Some of my attendings thought that this was merely a social fad, similar to Multiple Personality Disorder or other trendy diagnoses, like the rise in Tourette's and other tic disorders seen during the early pandemic and widely attributed to social media. Others, including myself early on, thought we were merely seeing psychological education doing what it is supposed to do: patients who would, in earlier decades, not realize they were transgender until middle age were now gaining better psychological insight during their teen years. This was due to a combination of increased tolerance and awareness of transgender people and was a positive good that shouldn't necessarily raise any red flags or undue skepticism.\r  \n \r  \nDuring my outpatient fellowship year, I began to suspect a combination of both theories could be true, similar to ADHD or autism, where increasing rates of diagnosis likely reflected some combination of better cultural awareness (good) and confirmation bias leading to dubious diagnoses (bad). Confirmation bias is always a problem in psychiatric diagnosis, because almost all psychiatric diagnoses describe symptoms that exist along a spectrum, so almost anyone could meet the DSM5TR criteria for any condition, so long as you ignored the severity of the symptom, and people are often not good at judging the severity of their own symptoms, as they do not know what is \"normal\" in the broader population.\r  \n \r  \nI considered myself moderate on these issues. Every field of medicine faces a tradeoff between overtreatment and undertreatment, and I shared the worries of some of my more trans-affirming colleagues that many of these kids were at high risk for suicide if not given the treatment they wanted. Even if you attribute the increase in trans-identification among teens to merely a social fad, it was a social fad with real dangers. If an influencer or spiritual guru on social media was convincing teens that evil spirits could reside in their left ring finger, and they needed to amputate this finger or consider suicide, the ethical argument could be made that providing these finger amputations was a medically appropriate trade of morbidity for mortality. \"How many regretted hormonal treatments, breast surgeries, or (in our hypothetical) lost ring fingers are worth one life saved from suicide?\" is a reasonable question, even if you are skeptical of the underlying diagnosis.\r  \n \r  \nAnd I was always skeptical of the legitimacy of most teenagers' claims to be transgender, if for no other reason than because gender dysphoria was historically a rare diagnosis, and the symptoms they described could be better explained by other diagnoses. As the old medical proverb says, \"when you hear hoofbeats, think horses and not zebras.\" The DSM5 estimated the prevalence of gender dysphoria in males as a range from 0.005% to 0.014%, and in females as a range of 0.002% to 0.003%, although the newer DSM5TR rightly notes the methodological limitations of such estimates.\r  \n \r  \nRegardless, most of the symptoms these teens described could be explained as identity disturbance (as in borderline personality disorder and some trauma responses), social relationship problems (perhaps due to being on the autism spectrum), body image problems (similar to and sometimes comorbid with eating disorders), rigid thinking about gender roles (perhaps due to OCD or autism), unspecified depression and anxiety, or just gender nonconforming behavior that fell within the normal range of human variation. It seems highly implausible that the entire field of psychiatry had overlooked or missed such high rates of gender dysphoria for so long. Some of my colleagues tried to explain this as being due to the stigma of being transgender, but I do not think it is historically accurate to say that psychiatry as a field has been particularly prudish or hesitant to discuss sex and gender. In 1909 Sigmund Freud published a case report about \"Little Hans,\" which postulated that a 5-year-old boy was secretly fixated on horse penis because of the size of the organ. I do not find it plausible that the next century of psychoanalysis somehow underestimated the true rate of gender dysphoria by multiple orders of magnitude because they were squeamish about the topic. In fact, the concept that young girls secretly wanted a penis was so well known that the term \"penis envy\" entered common English vocabulary! Of course, the psychoanalytic concept of penis envy is not gender dysphoria per se, but it is adjacent enough to demonstrate the implausibility of the notion that generations of psychoanalysts downplayed or ignored the true rate of gender dysphoria due to personal bigotry or cultural taboo.\r  \n \r  \nTherefore, for most of my career I have been in the odd position of doubting my gender-affirming colleagues, who would say \"trans kids know who they are\" and talk about saving lives from suicide, but also believing that they were making the best of a difficult situation. In the absence of any hard outcome data, all we had to argue about was theory and priors. I routinely saw adverse outcomes from these treatments, both people who regretted transitioning and those whose dysphoria and depression kept getting worse the more they altered their bodies, but I had to admit this might be selection bias, as presumably the success cases didn't go on to see other psychiatrists. I could be privately skeptical, but without any hard data there was no public argument to make. The gender affirming clinicians claimed that they could correctly identify which kinds of gender dysphoria required aggressive treatment (from DSMIV-TR to DSM5 the diagnosis was changed to emphasize and require identification with the opposite gender, rather than other kinds of gendered distress and nonconformity), and even when they were wrong they were appropriately trading a risk of long term morbidity for short term mortality. There was nothing to be done except wait for the eventual long term outcomes data.\r  \n \r  \nThe waiting ended when I read the paper \"Psychosocial Functioning in Transgender Youth after 2 Years of Hormones\" by Chen et al in the NEJM. This is the second major study of gender affirming hormones (GAH) in modern pediatric populations, after Tordoff 2022, and it concluded \"GAH improved appearance congruence and psychosocial functioning.\" The authors report the outcomes as positive: \"appearance congruence, positive affect, and life satisfaction increased, and depression and anxiety symptoms decreased.\" To a first approximation, this study would seem to support gender affirming care. Some other writers have criticized the unwarranted causal language of the conclusion, as there was no control group and so it would have been more accurate to say \"GAH was associated with improvements\" rather than \"GAH improved,\" but this is a secondary issue.\r  \n \r  \nThe problem with Chen 2023 isn't its methodological limitations. The problem is its methodological strength. Properly interpreted, it is a negative study of outcomes for youth gender medicine, and its methodology is reasonably strong for this purpose (most of the limitations tilt in favor of a positive finding, not a negative one). Despite the authors' conclusions, an in-depth look at the data they collected reveals this as a failed trial. The authors gave 315 teenagers cross-sex hormones, with lifelong implications for reproductive and sexual health, and by their own outcome measures there was no evidence of meaningful clinical benefit.\r  \n \r  \n315 subjects, ages 12-20, were observed for 2 years, completing 5 scales (one each for appearance, depression, and anxiety, and then two components of an NIH battery for positive affect and life satisfaction) every 6 months including at baseline. The participants were recruited at 4 academic sites as part of the Trans Youth Care in United States (TYCUS) study. Despite the paper's abstract claiming positive results, with no exceptions mentioned, the paper itself admits that life satisfaction, anxiety and depression scores did not improve in male-to-female cases. The authors suggest this may be due to the physical appearance of transwomen, writing \"estrogen mediated phenotypic changes can take between 2 and 5 years to reach their maximum effect,\" but this is in tension with the data they just presented, showing that the male-to-female cases improved in appearance congruence significantly. The rating scale they used is reported as an average of a Likert scale (1 for strong disagreement, 3 for neutral, and 5 for strong agreement) for statements like \"My physical body represents my gender identity\" and so a change from 3 (neutral) to 4 (positive) is a large effect.\r  \n \r  \nIf a change from 3 out of 5 to 4 out of 5 is not enough to change someone's anxiety and depression, this is problematic both because the final point on the scale may not make a difference and because it may not be achievable. Other studies using the Transgender Congruence Scale, such as Ascha 2022 (\"Top Surgery and Chest Dysphoria Among Transmasculine and Nonbinary Adolescents and Young Adults\") show a score of only 3.72 for female-to-male patients 3 months after chest masculinization. (The authors report sums instead of averages, but it is trivial to convert the 33.50 given in Table 2 because we know TCS-AC has 9 items.) The paper that developed this scale, Kozee 2012, administered it to over 300 transgender adults and only 1 item (the first) had a mean over 3.\r  \n \r  \nThese numbers raise the possibility that the male-to-female cases in Chen 2023 may already be at their point of maximal improvement on the TCS-AC scale. A 4/5 score for satisfaction with personal appearance may be the best we can hope for in any population. While non-trans people score a 4.89 on this scale (according to Iliadis 2020), that doesn't mean that a similar score is realistically possible for trans people. When a trans person responds to this scale, they are essentially reporting their satisfaction with their appearance, while a non-trans person is answering questions about a construct (gender identity) they probably don't care about, which means you can't make an apples-to-apples comparison of the scores. If this is counter-intuitive to you, consider that a polling question like \"Are you satisfied with your knowledge of Japanese?\" would result in near-perfect satisfaction scores for those in the general public who have no interest in Japanese (knowledge and desire are matched near zero), but lower scores in students of the Japanese language. Even the best student will probably never reach the 5/5 satisfaction-due-to-apathy of the non-student.\r  \n \r  \nI am frustrated by the authors' decision not to be candid about the negative male-to-female results in the abstract, which is all most people (including news reporters) will be able to read. I have seen gender distressed teenagers with their parents in the psychiatric ER, and many of them are high functioning enough to read and be aware of these studies. While some teens want to transition for personal reasons, regardless of the outcomes data, in much the same way that an Orthodox Jew might want to be circumcised regardless of health benefits, others are in distress and are looking for an evidence-based answer. In the spring of 2023, I had a male-to-female teen in my ER for suicidal ideation, and patient and mother both expressed hopefulness about recently started hormonal treatment, citing news coverage of the paper. This teen had complicated concerns about gender identity, but was explicitly starting hormones to treat depression, and it is unclear whether they would have wanted such treatment without news reporting on Chen 2023.\r  \n \r  \nMoving on to the general results, the authors quantify mental health outcomes as: \"positive affect \\[had an\\] annual increase on a 100-point scale \\[of\\] 0.80 points...life satisfaction \\[had an\\] annual increase on a 100-point scale \\[of\\] 2.32 points...We observed decreased scores for depression \\[with an\\] annual change on a 63-point scale \\[of\\] −1.27 points...and decreased \\[anxiety scores\\] annual change on a 100-point scale \\[of\\] −1.46 points...over a period of 2 years of GAH treatment.\" These appear to be small effects, but interpreting quantitative results on mental health scales can be tricky, so I will not say that these results are necessarily too small to be clinically meaningful, but because there is no control group these results are small enough to raise concerns about whether GAH outperforms placebo. It is unfortunate that it is not always straightforward to compare depression treatments due to several scales being in common use, but we can see the power of the placebo effect in other clinical trials on depression. In the original clinical trials for Trintellix, a scale called MADRS was used for depression, which is scored out of 60 points, and most enrolled patients had an average depression score from 31-34. Placebo reduced this score by 10.8 to 14.5 points within 8 weeks (see Table 4, page 21 of FDA label). For Auvelity, another newer antidepressant, the placebo group's depression on the same scale fell from 33.2 to 21.1 after 6 weeks (see Figure 3 of page 21 of FDA label).\r  \n \r  \nI won't belabor the point, but anyone familiar with psychiatric research will be aware that placebo effects can be very large, and they occur across multiple diagnoses, including surprising ones like schizophrenia (see Figure 3 of the FDA label for Caplyta). I am genuinely surprised and confused by how minimal this cohort's response to treatment was. Early in my career I thought we were trading the risk of transition regret for great short-term benefit, and I was confused when I noticed how patients given GAH didn't seem to get better. This data confirms my experience is not a fluke. I could go in depth about their anxiety results, which on a hundred-point scale fell by less than 3 points after two years, but this would read nearly identically to the paragraph above.\r  \n \r  \nA more formal analysis of this paper might try to estimate the effects of psychotherapy and subtract them away from the reported benefits of GAH, and an even more sophisticated analysis might try to tease apart the benefits of testosterone for gender dysphoria per se from its more general impact on mood, but I think this is unnecessary given the very small effects reported and the placebo concerns documented above. Putting biological girls on testosterone is conceptually similar to giving men anabolic steroids, and I remain genuinely surprised that it wasn't more beneficial for their mood in the short term. Some men on high doses of male steroids are euphoric to the point of mania.\r  \n \r  \nBut my biggest concerns with this paper are in the protocol. This paper was part of TYCUS, the Trans Youth Care in United States study, and the attached protocol document, containing original (2016) and revised (2021) versions explains that acute suicidality was an exclusion criterion for this study (see section 4.6.4). There were two deaths by suicide in this study, and 11 reports of suicidal ideation, out of 315 participants, and these patients showed no evidence of being suicidal when the study began. This raises the possibility of iatrogenic harm. It would be beneficial to have more data on the suicidality of this cohort, but the next problem is that the authors did not report this data, despite collecting it according to their protocol document.\r  \n \r  \nThe 5 reported outcome measures in Chen 2023 are only a small fraction of the original data collected. The authors also assessed suicidality, Gender Dysphoria per se (not merely appearance congruence), body esteem and body image (two separate scales), service utilization, resiliency and other measures. This data is missing from the paper. I do not fully understand why the NEJM allowed such a selective reporting of the data, especially regarding the adverse suicide events. A Suicidal Ideation Scale with 8 questions was administered according to both the original and revised protocol. In a political climate where these kinds of treatments are increasingly viewed with hostility and new regulatory burdens, why would authors, who often make media appearances on this topic, hide positive results? It seems far more plausible that they are hiding evidence of harm.\r  \n \r  \nOf course, Chen 2023 is not the only paper ever published on gender medicine, but aside from Tordoff 2022 it is nearly the only paper in modern teens to attempt to measure mental health outcomes. The Ascha 2022 paper on chest masculinization surgery I mentioned above uses as its primary outcome a rating scale called the Chest Dysphoria Measure (CDM), a scale that almost any person without breasts would have a low score on (with the possible exception of the rare woman who specifically wants to have prominent and large breasts that others will notice and comment on in non-sexual contexts), even if they experienced no mental health benefits from the breast removal surgery and regretted it. Only the first item (\"I like looking at my chest in the mirror\") measures personal satisfaction. Other items, such as \"Physical intimacy/sexual activity is difficult because of my chest\" may be able to detect harm in a patient who strongly regrets the surgery but is worded in such a way as not to detect actual benefit. They should have left it at \"Physical intimacy/sexual activity is difficult\" because a person without breasts can't experience dysphoria or functional impairment as a result of having breasts, even if their overall functionality and gender dysphoria are unchanged. Gender dysphoria that is focused on breasts may simply move to hips or waist after the breasts are removed.\r  \n \r  \nTordoff 2022 was an observational cohort study of 104 teens, with 7 on some kind of hormonal treatment for gender dysphoria at the beginning of the study and 69 being on such treatment by the end. The authors measured depression on the PHQ-9 scale at 3, 6, and 12 months, and reported \"60% lower odds of depression and 73% lower odds of suicidality among youths who had initiated PBs or GAHs compared with youths who had not.\" This paper is widely cited as evidence for GAH, but the problem is that the treatment group did not actually improve. The authors are making a statistical argument that relies on the \"no treatment\" group getting worse. This would be bad enough by itself, but the deeper problem is that the apparent worsening of the non-GAH group can be explained by dropout effects. There were 35 teens not on GAH at the end of the study, but only 7 completed the final depression scale.\r  \n \r  \nThe data in eTable 3 of the supplement is helpful. At the beginning the 7 teens on GAH and the 93 not on GAH have similar scores: 57-59% meeting depression criteria and 43-45% positive for self-harming or suicidal thoughts. There is some evidence of a temporary benefit from GAH at 3 months, when the 43 GAH teens were at 56% and 28% for depression and suicidality respectively, and the 38 non-GAH teens at 76% and 58%. At 6 months the 59 GAH teens and 24 non-GAH teens are both around 56-58% and 42-46% for depression and suicidality. At 12 months there appears to be a stark worsening of the non-GAH group, with 86% meeting both depression and suicidality criteria. However, this is because 6/7 = 86% and there are only 7 subjects reporting data out of the 35 not on GAH from the original 104 subject cohort. The actual depression rate for the GAH group remains stable around 56% throughout the study, and the rate of suicidality actually worsens from Month 3 to Month 12.\r  \n \r  \nWe cannot assume that the remaining 7 are representative of the entire untreated 35. I suspect teens dropped out of this study because their gender dysphoria improved in its natural course, as many adolescent symptoms, identities and other concerns do. However, even if you disagree with me on this point, the question you have to ask about the Tordoff study is why these 7 teens would go to a gender clinic for a year and not receive GAH. Whatever the reason was, it makes them non-representative of gender dysphoric teens at a gender clinic.\r  \n \r  \nThe short-term effect of GAH is no longer an unanswered question. Its theoretical basis was strong in the absence of data, but like many strong theories it has failed in the face of data. Now that two studies have failed to report meaningful benefit we can no longer say, as we could as recently as 2021, that the short-term benefits are so strong that they outweigh the potential long-term risks inherent in permanent body modification. Some non-trivial number of patients come to regret these body modifications, and we can no longer claim in good faith that there are enormous short term benefits that outweigh this risk. The gender affirming clinicians had two bites at the apple to find the benefit that they claimed would justify these dramatic interventions, and their failure to find it is much greater than I could have imagined two years ago.\r  \n \r  \nI am not unaware of how fraught and politicized this topic has become, but the time has come to admit that we, even the moderates like me, were wrong. When a teenager is distressed by their gender or gendered traits, altering their body with hormones does not help their distress. I suspect, but cannot yet prove, that the gender affirming model is actively harmful, and this is why these gender studies do not have the same methodological problem of large placebo effect size that plagues so much research in psychiatry. When I do in depth chart reviews of suicidal twenty-something trans adults on my inpatient unit, I often see a pattern of a teenager who was uncomfortable with their body, \"affirmed\" in the belief that they were born in the wrong body (which is an idea that, whether right or wrong, is much harder to cope with than merely accepting that you are a masculine woman, or that you must learn to cope with disliking a specific aspect of your body), and their mental health gets worse and worse the more gender affirming treatments they receive. First, they are uncomfortable being traditionally feminine, then they feel \"fake\" after a social transition and masculine haircut, then they take testosterone and feel extremely depressed about \"being a man with breasts,\" then they have their breasts removed and feel suicidal about not having a penis. The belief that \"there is something wrong with my body\" is a cognitive distortion that has been affirmed instead of Socratically questioned with CBT, and the iatrogenic harm can be extreme.\r  \n \r  \nIf we say we care about trans kids, that must mean caring about them enough to hold their treatments to the same standard of evidence we use for everything else. No one thinks that the way we \"care about Alzheimer's patients\" is allowing Biogen to have free rein marketing Aduhelm. The entire edifice of modern medical science is premised on the idea that we cannot assume we are helping people merely because we have good intentions and a good theory. If researchers from Harvard and UCSF could follow over 300 affirmed trans teens for 2 years, measure them with dozens of scales, and publish what they did, then the notion that GAH is helpful should be considered dubious until proven otherwise. Proving a negative is always tricky, but if half a dozen elite researchers scour my house looking for a cat and can't find one, then it is reasonable to conclude no cat exists. And it may no longer reasonable to consider the medicalization of vulnerable teenagers due to a theory that this cat might exist despite our best efforts to find it.\r  \n \r  \n\\-An ABPN Board Certified Child and Adolescent Psychiatrist\r  \n \r  \nPS - To be clear, I support the civil rights of the trans community, even as I criticize their ideas. I see no more contradiction here than, for example, an atheist supporting religious freedom and being opposed to antisemitism. If an atheist can critique both the teachings and practices of hyper-Orthodox Hasidic Judaism, while being opposed to antisemitism at the same time, I believe that I can criticize the ideas of the trans community (\"born in the wrong body\") while still supporting their civil rights and opposing transphobia in all forms.",
    "title": "The Chen 2023 Paper Raises Serious Concerns About Pediatric Gender Medicine Outcomes",
    "subreddit": "medicine",
    "timestamp": 1691100364,
    "score": 2010,
    "keyword": "woman nurse"
  },
  {
    "text": "I saw another dead body the other day. I saw another dead body the other day.  A kid who died on the street.  The notes said that someone had overdosed and that a bystander was doing CPR.  With so much narcan on the streets, I wonder how necessary that is.  We go on this call a lot.  My partner flips a switch and pulls a slow U-turn through the traffic.  Lights. Sirens.  \n\nWhen we get there, we have to park a little further off than normal.  As we walk over, I take measure of the scene.  Fire is presiding over the patient, some are crouching, and another stands with a tablet.  As we approach, the captain states the facts as he knows them: unknown downtime, bystander CPR, fixed pupils.  They are attaching the cables and the paddles to confirm asystole.  Maybe there's a workable rhythm. \n\nHe's just a kid, 24 maybe.  He's stuffed up against a wall behind a slew of boulders placed there to prevent camping. It's a popular spot, but a rough one, for sure.  There's scorched foil and a torch on the ground, covered in dust and stepped on.  He's dirty and wearing a stained, blue wife-beater and some old gray jeans that look like they were cut into shorts ages ago. Shoes, but no laces or socks.  His hands are puffed red and under his nails are black.  There's vomit coming from his nose. \n\nThe paddles are on now, and the tracing jumps to life, but then it slowly arcs downward and settles into a long flat line.  He's dead.  Fire says he still feels warm.  It's hot out today, though, so I feel his flank, and it's just a little cool.  Just a little.  There's no point.  He's dead.  \n\nI reach down again to get a closer look and turn his head toward me.  For some reason, I just want to look at him for a second.  His hair looks like it was shaved clean a month or two ago and has grown out evenly since then. My fingers find something wet.  It's more vomit in his hair.  I reflexively wipe it off my glove onto his shirt and am struck at how callous that seems. He's probably got a family somewhere.  I wipe my fingers again.  His eyes are lifeless but not glazed over yet. They say the dead are supposed to look peaceful, but this kid doesn't.  His body, though, is still.  \n\nThat's enough, I suppose.  I stand up and shake my head at all of it.  The scene pauses for a moment in agreement.  \n\nFire says he looked like he took his hit and then fell backwards, pinning his feet behind his rear.  That's how they found him. We stand over him for a moment longer.  Usually there's more work to do, but this time it's like we are up on the stage but we forgot our lines. I take my gloves off and step over the boulders and back onto the pavement.  Fire says we can clear and that they'll wait on the ME.  I ask them if they're sure, and they tell us we can get back in service, which I appreciate.  I'm not quite done here yet, though. \n\nA couple yards away sits a 20-something girl.  The captain and I walk over to her.  She's the one who did compressions.  What happened, we ask. She says she was walking home from school, or work, or someplace when she saw another woman trying to wave people down in traffic.  She said she seemed frantic. That's when she spotted our kid.  She called 911, and did all of what that entails.  They had her start CPR about five minutes before we all got there.  As to what happened to the other woman, she says she doesn't know.  She's gone.  That's pretty typical, really.  Fire asks her if she's a nursing student, and she says no.  She's pretty composed, but maybe she's just stunned and doesn't know it yet.  We both thank her, and I step away. The captain tells her to hang out and wait with them for the ME.  They probably have more questions, he says.  Fire is packing their gear, and I thank them and say that we'll see 'em on the next one.  I turn my back and walk away.  \n\nOn the way back to the ambulance, we pass by a large memorial to another death, faded by the sun and wilted in the rain.  There's a picture there, but I don't look too closely.  At the ambulance, I toss my gloves in the trash and climb into my seat. \"Welp, that's fucked up,\" I say to my partner.  He clunks the transmission into gear and cranks the wheel around.   I ask him if he saw the memorial on the wall and he says that he had.  I toss my sunglasses on the dash and am back on the radio to dispatch to tell them our status.  I drop the radio into its cradle.  I rub the heels of my hands into my eyes and press deeply.  A deep breath.  We are back in service.",
    "title": "I saw another dead body the other day.",
    "subreddit": "medicine",
    "timestamp": 1689931863,
    "score": 1083,
    "keyword": "woman nurse"
  },
  {
    "text": "2 nurses, medical resident slashed by woman at Newark Beth Israel Medical Center, police say",
    "title": "2 nurses, medical resident slashed by woman at Newark Beth Israel Medical Center, police say",
    "subreddit": "medicine",
    "timestamp": 1702132323,
    "score": 567,
    "keyword": "woman nurse"
  },
  {
    "text": "Death stuck in my head, please help make sense of it  Hi  everyone! Im a recently graduated dr that comes from a really  conservative and oppressive country and moved into a much more  progressive one and did my studies here. Throughout my studies i allowed  my true self to come out more and more and recently thanks to my  amazing wife have finally become happy with how i come out i to the  world. Sad part coming up:\n\nA  little under 6 mo ago i was working as an intern in the ER and i love  emergencies so even when it wasn’t my job or i was off id like to go  help out when the alarm sounded, except this time it was different.\n\nI  entered the trauma room and i saw an unconscious woman with the most  perfect nose you have ever seen. It was so perfect i immediately noticed  it and also saw she came in already intubated which was weird since she  just got here and none of us had gotten to her yet. I saw people werent  running to help her and i asked what happened why didn’t they (older  docs) move!? So they told me she came in dead from a private clinic and  there was nothing else they could do and left to talk to incoming  family. I stayed behind and saw her more and couldnt stop looking at her  nose when a nurse came and probably saw my confusion and told me she  was a trans person that had been getting her nose done and died due to  anesthesia. At the moment i was fine but then her family came in and  heard the news right after i did and the screams began. Horrible screams  from various family members both old and young male and female. Thought  it was nice she had that love around her despite everything. Went home  and dreamt about her. Queue a week later and she still pops into my head  with a tinge of sadness until one day im in bed with my wife who i  havent told at that point and we had some drinks to relax on the weekend  when she saw a tiktok about someone getting a nose job and i panicked  and started crying and thinking about that poor woman who all she wanted  was to look how she felt. Its been 6 motnhs and i still cry about her sometimes and no matter what i still see her nose and feel her with me  and i just want to know she is ok and to possibly let her go.\n\nIve had other patients die with me, even when im more directly involved in their care and havent had this happen to me, at most a week of sadness. \n\nThanks for listening.",
    "title": "Death stuck in my head, please help make sense of it",
    "subreddit": "medicine",
    "timestamp": 1679948343,
    "score": 343,
    "keyword": "woman nurse"
  },
  {
    "text": "Please help with a case of geriatric anxiety I have a problem with the patient. She's an elderly woman who became my patient last year after her previous PCP fired her. She's been fired by multiple PCPs in her area due to what I am about to describe. She's now driving 2.5 hrs to see me..\n\nShe's severely hypertensive. She is allergic to all anti-hypertensives that exist. In fact, she is allergic to pretty much every medication with an allergy list over 80 medications long, and she refuses to start new medications.\n\nShe constantly has symptoms. Chest pain, short of breath, can't sleep, stomach pain etc. They will last a week then something new. You name it. She calls the office every day and often uses the emergency nurse line and ends up taking up about 30 minutes of my nurse's day every day. To visit the ER multiple times a week. To the point where ED attendings are reaching out to complain to me. Her husband and her daughter are convinced that there is something wrong with her that nobody else can find it.\n\nBetween her multiple ER visits, she's had every amount of imaging known to man. Every blood test you can think of. Truly outside of her elevated BP, there are no objective findings of illness. She has been on benzodiazepines for over 30 years and recently changed psychiatric providers when her current ones started to taper her. I have got her in with geriatric psychiatry at my hospital, and they are also now weaning her Xanax. All of her symptomology is worsening during this Xanax wean and during this, no new anxiety medications because she refuses to start any of them.\n\nI'm at a loss with her as she's tying up my clinics time my time and the ER's time substantially but I also cannot think of any more interventions to help her. I'm afraid I'm going to end up discharging her from the practice, but then I would just be doing what every other PCP has done for her. My clinic management is asking to start the discharge process. \n\nMy current solutions are:\n\n1. Do as my clinic manager asks and discharge her from the clinic, thus perpetuating the cycle\n\n2. Have her stop seeing psychiatry, and myself take her back up on her xanax to a level that controlled her anxiety better. \n\nPrevious solution attempts by myself:\n- having an appointment every 2 weeks scheduled to talk about her symptoms\n\n- I convinced her to start trazadone for sleep at one point which she developed side effects to and now cites this as a reason why she can never try any new psychiatric medication\n\n- have geriatric medicine consult on her case( they had no suggestions other than to have receive geriatric psychiatry which has worsened the issue).\n\n- having a discussion with her and the family about a more palliative approach. They are only interested in diagnostic approach at this time.\n\n- setting boundaries on how many times she may call the clinic. (She has not been able to follow this)",
    "title": "Please help with a case of geriatric anxiety",
    "subreddit": "medicine",
    "timestamp": 1696305124,
    "score": 303,
    "keyword": "woman nurse"
  },
  {
    "text": "Need advice for dealing with discrimination at hospital Edit: Thanks for the comments/advice. We'll look in to suggestions here and hopefully find some solution. \n\nTL;DR\n\nI believe there is some systemic discrimination against minorities and women in my hospital system. This has not only negatively affected me and other employees but has also had a negative effect on patient care. The hospital is not accredited by the joint commission. I have spoken to an attorney who says I have a case but I don’t think this will cause large scale change as this is a very wealthy organization. Any ideas of who I can report to or what I should do to actually improve the situation here?\n\nLong Bit\n\nI work in a small town hospital in a conservative state. I originally trained in a large city in this state and my first job was in a large, liberal city in another state. The town has \\~100k population the hospital serves the surrounding area. All the leadership positions are white men and one white woman. Several incidents have happened in my time here.\n\n1. Soon after I got here they tied compensation in form of bonus to patient satisfaction (not uncommon) I objected in writing because of the demographics of this town being predominantly white and I had already experienced some racist comments from patients. I thought this would influence my patient satisfaction scores. I was given a handout from leadership with lists of things to improve satisfaction. One was “know the background of you patient population and the culture.” The following one was “ hire employees with similar backgrounds”. I was told this how things were going to be done.\n2. About 2 years into my time here a young white male colleague left the hospital for a new job. Prior to starting he was told the system that hired him was going do pay cuts across the board. He asked to come back to our hospital - the leadership took him back and promoted him to the head of the group replacing the older white gentleman (who was the boss when I was hired) passing over a minority gentleman who was the assistant head to the former boss. Relative to myself and the assistant head, the younger colleague has much less experience.\n3. In the time that all this happened several instances of discriminatory practices against patients of color occurred and I reported to my direct bosses.\n4. 2 female colleagues of color faced discrimination from colleagues and ultimately resigned from practice. Meanwhile white male physicians received at the most slaps wrist for major issues.\n\n\\-One sent inappropriate pictures to a subordinate- she somehow left the practice but he remained head of a department. This same physician got into a verbal altercation where a subordinate felt physically threatened. She ultimately resigned her position. He not only kept his employment but also kept his position as head of a department. This same physician has verbally attacked female physicians (two of color) which has influenced pt care decisions which were not consistent with best practice.\n\n5) Just recently I was not given an opportunity to apply for a position I wanted. I expressed interest to my boss about applying for it and was told I would be good fit. However less than a week later I was told the position was already given to another white male who has much less experience than me and hasn’t been at the hospital as long as I have. Nor did he have any qualifications that superseded mine.\n\nThen a few weeks ago my direct boss was promoted to a senior level position. He has participated in discriminatory jokes (openly) and does not consult female physicians of color. Despite it being best practice, he openly admitted to me he does not consult these other female physicians because another white male physician had spoken poorly of them\n\nWith his promotion he also informed he that he had chosen another white male to be the head of department. This gentleman had been part of the organization less than a one year. When I asked what his qualifications were above anyone else in the group – he became flustered and couldn’t give an answer. The final reply by the now promoted boss was it was “his decision”.\n\n\\*I understand things don’t always go your way careerwise but I feel there is some kind of systemic discrimination going on here when there are so many instances of more qualified minorities being passed over for less qualified white males. I understand there may be some “X” factor when the hired person has 3 years’ experience vs 5 years of experience but when several candidates with 5-10 years experience are passed over for someone who has <1 year experience and who just happens to be a white male…something doesn’t seem right. Especially when similar things or other discriminatory things keep happening here.\n\n6) A non-white patient who was also an employee of the hospital was hospitalized with a major medical problem requiring months of hospitalization. I joined her care team and saw she was developing complications from being hospitalized too long. I inquired as to why she was still hospitalized because I was confused about why she had not been moved to rehab where she could be better served. I was told that higher ups had decided not to let her go on to rehab because she was under the hospital’s insurance (they are self-insured) and do not want to pay for rehab when she could stay in the hospital within their own system. I raised a stink saying it was unethical as she was developing complications from not having more intensive therapy at rehab.\n\n7)During COVID a white pt who did not require ICU care was moved to the ICU without doctor approval as his white family member who was employed by the system was belligerent with a house supervisor and demanded his family member be moved. During that time many patients (including one of my own) coded and died while waiting for an ICU bed. I raised this issue to quality and did not see any repercussions or changes to policies.\n\n8) Also, another thing that happened during COVID, 1000+ death certificates were assigned to me by a nurse and then when the mistake was found I asked that it be rectified because this is a legal document- leadership said “oh don’t worry about it”.\n\n9) While I was sitting in the office my boss (white male) made a joke about how the “AMA recommended no longer identifying race for example 43 y.o. black female”. A white female colleague in the office (openly not behind closed doors) said, “ What do they want us to say 43 yo lazy mother fucker” and both people laughed. I understand everyone has prejudices but I cannot comprehend how in 2023, a person educated and trained to the same degree as myself, would be comfortable speaking this way in a professional setting.\n\n\\-There have been other similar comments like this amongst the staff here this one was just the most recent.\n\nI have spoken to a lawyer who tells me I have a personal case under title 7 of the civil rights act with max of 1 million in damages. The thing is that would be *a drop in the bucket* for this organization. They have a very large endowment and I’m aware of several lawsuits that were simply settled because they can easily afford it. I also spoke to a few colleagues who ended up resigning due to what they felt was discrimination against them but they ultimately did not want to go through the trouble of pursuing some legal solution.\n\nI’m trying to make a change in this system for patients many of whom are non-white in this town who have no choice in healthcare as this is the only option as well as for the female and/or non-white employees.\n\nI do not know if I have broader legal grounds due to discrimination affecting patient care in this town. Something like a class action lawsuit with more financial impact on them so they are motivated to change, or finding legal counsel that would take this to trial so that more attention can come to what is happening in this town. Media in this town is limited and most people who control media have connections or ties with the healthcare system.\n\nIs there an agency to report these things to? The Joint Commission apparently does not come here. But someone who has actual teeth and can enforce change on this place. I feel like its crazy this kind of stuff is happening in 2023 in a professional, somewhat large institution.\n\nThanks for any comments or advice you can give.",
    "title": "Need advice for dealing with discrimination at hospital",
    "subreddit": "medicine",
    "timestamp": 1682126622,
    "score": 39,
    "keyword": "woman nurse"
  },
  {
    "text": "Is there a doctor or a nurse on board?! \nUpdate: I received a text from the flight attendant on 19 April. The lady survived. \n\nTLDR: we saved woman’s life in the air. Airlines carry IVs and cardiac drugs. Teamwork is awesome. \n\nYesterday I heard those words in my dream and woke up. The flight attendant repeated the phrase.  I’m surprised to hear the sounds of fluid bubbling in the back of someone’s mouth, a familiar but alarming sound.  \n\nI look back and notice a flight attendant looking slightly distressed and I, being a fresh nurse and seasoned medic, decide to go and assist.  A woman, who had a seizure and vomited, was slouched unresponsive in her seat. Her young grandson next to her was terrified. \n\nI ask the flight attendant for any medical equipment and she brings me a blood pressure cuff and stethoscope. 72 systolic and I couldn’t hear where the diastolic ended with the noise from the aircraft and she didn’t have a radial pulse. Pulses were high 40s, weak, via the carotid. I do a sternum rub to get there to come to.  She wakes up for about 90 seconds before her head slumps down again. During that time I was able to get some info that she takes lisinopril for HPTN and do a rapid stroke scale. She had left arm drift however I’m not sure if it’s because she is so weak she can’t hold her arms up or if it’s because she had a stroke. I place an oxygen mask over her face. \n\nAt this point the FA is on the phone with the doctor on the ground. \n\nAs I’m fighting to keep her up right in the seat 2 more nurses come up and ask if they can be of assistance. I tell them what I had found and said I think she may be having a stroke.  We come up with the idea to use my apple watch to get a single lead ecg (sinus Bradycardia on Lead II) and an SpO2 (undetectable on my watch assuming because it was so low).  A passenger offered her glucometer with a reading of 150.   \n\nAs I’m collaborating with these 2 the FA says the doc on the ground wants an IV and fluids run bolus. The FA gets the aid bags (they have 2 of them BTW) we start spiking the NS and getting equipment in place for an IV. We get 2 lines in her and start dropping fluids. \n\nWe give the FA report that her pressures (60/palp) and pulse (low 30s) are trending down. I grab the AED and put the pads on her. She’s cold, clammy and pale now. Still unresponsive but breathing on her own. The FA advises us the doctors want us to administer 0.5 mg of atropine. \n\nOne of the nurses is standing behind the woman in the isle behind her holding her body up while the other nurse is getting the atropine out. I admin the atropine after verifying with both nurses this is the order received. \n\nFive min or so pass and her pressure and pulse are still shit. No radial pulse. Shit…. We barely felt a carotid. The doc orders 0.5mg 1:10000 epi via IV and to repeat after 5 min if not helping. She got the full 1mg because the initial dose didn’t help. \n\nAt this point the plane is about to land and we have strong radial pulses in the 80s.  We brace to land and keep the PT staying in the chair. This whole situation took place over about 75 min. We were going to do an emergency landing but we were essentially not near another airport. The closest one being the direction we were heading. \n\nThe entire team I worked with no doubt saved this woman’s life. The 2 nurses that helped me were amazing. The FA assisted in changing the bottles of oxygen over, recorded the code, maintained a calm cabin environment and communicated with the pilots and doctors. People whom have never  met before with one common goal. Made me feel proud of this profession and others alike. \n\nThis all happened front of a packed cross country flight. We were in the very front so everyone in the back was watching us do this. You could feel the cameras peering though your nursing license. We had 3 clapping ovations from the aircraft… one of the cooler experiences I have ever had.\n\nEdit: this app was recommend for in air emergencies. \n[AirlineRx App](https://apps.apple.com/app/id1031955544)\n\n\nUpdate: Airline has given me a 50$ voucher for assisting\n\nEdit:  I forgot to mention one of the other nurses had the smart idea to take her shoelace off to hang the NS bags on the overhead bin. Lots of ingenuity going on.",
    "title": "Is there a doctor or a nurse on board?!",
    "subreddit": "nursing",
    "timestamp": 1680272599,
    "score": 4595,
    "keyword": "woman nurse"
  },
  {
    "text": "It took so much willpower not to strangle my patient today I work ICU and I had two patients today. One was super unstable. Intubated, multiple pressors, art and swan line, BP all over the place. The other was admitted for septic shock and had been off pressors for 24 hours, A&Ox4, stable, no drips, just waiting for a floor bed but our hospital is at capacity and ED is full of boarded patients so I was stuck with her.\n\nThis was the rudest and most demanding patient I’ve ever had. The second anybody stepped foot in her room, she started barking orders. She kept putting her call light on immediately after I turned it off, all day long. I was in her room at least once every 3 minutes. She demanded nebulizer treatments every hour, screaming that she couldn’t breathe, even though she was able to scream and satting 100%.  All her meals were “nasty”, even though the kitchen sent her what she ordered. When I called to order her something else, and asked her before hanging up if she wanted anything else, she’d say no, then tell me she wanted something else as soon as I hung up! She needed a new soda every 30 minutes because it was “warm”, even though she only took a few sips of each one. She kept demanding specific snack items the hospital doesn’t carry. She kept messing up the TV, then demanding I get her channel back, even though she didn’t know which one she wanted! This was not an old or confused woman. She was able bodied and not even retirement age.\n\nThe last straw was when she demanded I give her a back rub! I’ve never had a patient request that before, though I’ve seen others talk about it on this sub. I literally saw red. I just told her “I am not doing that”. She she asked why not, I lost my cool for the first time ever with a patient. I blew up at her and said something to the affect of “this is a hospital, not a hotel. You’re not at the spa, you’re in the ICU. My job is to keep you alive, and that’s it. You’re stable and no longer ICU status and you have taken up the majority of my today, when I should have been caring for my other patient, who is incredibly sick and unstable, you’re literally putting their life in jeopardy by wasting all my time for stupid shit. Next time you put that call light on, it better be for something important”. Then I just left. She didn’t bother me for the hour that was left of my shift.\n\nMy coworker was right outside the door and heard the entire thing. She actually gave me a high-five. I feel kind of bad, looking back, but everybody on the unit, including the Secretary, RT, residents, tech, and nurses were absolutely done with this patient’s shit by the end of the day. She was making it impossible for me to properly care for my actual sick patients who actually needed me.",
    "title": "It took so much willpower not to strangle my patient today",
    "subreddit": "nursing",
    "timestamp": 1688189262,
    "score": 1382,
    "keyword": "woman nurse"
  },
  {
    "text": "Nearly lost it on an NA last night. Go into the patient room at 5:30am to start my morning med passes and the NA is in the room doing vitals. I address the patient and ask for Name and DOB for med pass and tell them about the plan for today and ask how they're doing. After my speil as I'm drawing up the SQ heparin I hear somebody repeating the NA's name over and over again and angrily asking who the NA is with. I notice a light in the NA's pocket and realize his phone was on an active phone call and I was hearing the person on the other end.\n\nI quietly tell the NA to immediately shut their phone off. The NA pretends not to hear so I repeat it louder. The NA takes their phone out and says I'll call you back. The voice on the other end then gets angry and starts to argue and say \"what does that mean you'll call me back? Who are you with? Who is [patient's name]?\" And the NA proceeds argue back with the woman for a couple minutes, on speaker phone, in a patients room before hanging up. \n\nI dropped everything once they finally hung up and said \"Outside. Now.\" It took a lot of willpower not to verbally flay the skin off him I was so angry. I told him that what he did was a gross violation of patient trust and privacy as well as the most unprofessional thing I have seen since I started nursing (only two years in and hopefully this is the worst). I told him that I have literally no choice but to report this because some random bitch on their phone heard protected patient information.\n\nNA didn't reply and just went to the next room and started vitals there. I wrote my manager and ANM an email about the situation and filed a safety report. I honestly hope this NA gets fired not only because of this incident, but because they're a shitty NA to start with when it comes to doing anything.",
    "title": "Nearly lost it on an NA last night.",
    "subreddit": "nursing",
    "timestamp": 1692546206,
    "score": 1167,
    "keyword": "woman nurse"
  },
  {
    "text": "AITA for reporting a co-worker for being late every single shit? So there's this night shifter I've had the displeasure of working with who is late every single day. I'm not exaggerating. She is late **EVERY. SINGLE. DAY**. She doesn't even walk onto the unit till 7:05-7:10, then she takes 5-10 minutes putting her stuff down and getting her papers.\n\nShe knows she's late. She has a pin that says \"voted most likely to be late\" on her backpack, like it's a cute quirk. When I've confronted her about it in the past, she tries to make me think I'm dramatic or too military because \"It's only 5 minutes\" and \"we get paid by the hour\".\n\nIt's not just 5 minutes or if I'm being paid, it's the complete disrespect for everyone else's time!\n\nI've actually worked at 2 different hospitals with this nurse. At the old hospital, I thought it was tolerated just because we were so desperate for staff. But this hospital is much better and she's still somehow not being reprimanded! Everyone knows about it. All the other day shifters complain amongst ourselves about it.\n\nSo, I reported her to our manager, so apparently had a stern talking with the late nurse. The late nurse obviously got upset about it and knew it was me since I'm the only one who's confronted her about it before. I stood by what I did because this is ridiculous, right?\n\nShe's a grown woman, this is a professional setting. Actually, this is literally life or death situation in an ICU, if you aren't capable of being on time, how are you competent enough to do this job?\n\nBut now, a lot of night shifters look at me like I'm Major Houlihan or something. One who came to me for report at 7:01 joked, \"don't write me\". Some of my friends, who are just as frustrated by her, have told me I shouldn't have reported it because it caused drama.",
    "title": "AITA for reporting a co-worker for being late every single shit?",
    "subreddit": "nursing",
    "timestamp": 1686189337,
    "score": 1110,
    "keyword": "woman nurse"
  },
  {
    "text": "Local Nursing Student goes missing while helping a toddler on the highway. [Story](https://www.al.com/news/birmingham/2023/07/smart-courteous-carlee-russell-left-imprint-on-alabama-police-department-before-going-missing.html)\n\nThis is some Steven King level shit. She stopped in an insanely busy section of the highway in Birmingham because a toddler was walking on the side. Called the police, got out of her car, was on the phone with her family and just disappeared. Phone line still open no one was there. Police arrived a couple of mins later and no woman, and no toddler. \n\nFrom all accounts she was going to make an excellent nurse. She stopped to help a child and now she's gone. Very strange.",
    "title": "Local Nursing Student goes missing while helping a toddler on the highway.",
    "subreddit": "nursing",
    "timestamp": 1689439696,
    "score": 1115,
    "keyword": "woman nurse"
  },
  {
    "text": "Casual conversation with a customer changed my life I was waiting to pick up a prescription earlier today and there was another woman waiting. There were only 2 people working, 1 stuck in a prolonged discussion with a customer on the phone, the other busily filling prescriptions. The one on the phone acknowledged us, smiling apologetically.\n\nThe woman expressed that she always has to wait for her meds. The other pharmacy in our neighbourhood is absolute trash, and I said as much and she emphatically agreed. We got to chatting about just how shitty people are now. She also shared that she’s observed how horrible, angry, and wilfully ignorant people have become over the past year, post-pandemic.\n\nWorking in emergency medicine I’m now burnt out. It has become an exercise in every last shred of my being to go to work and not lose my shit. \n\nMy latest approach is when a patient is staring at me, the one that has been waiting 42 minutes, waiting for eye contact, is to simply turn slowly in my chair and then leave. I no longer want to engage with a grown ass adult with a hangnail who will whine, “hoooow much looonger?” when we have patients who are critically ill, requiring all staff to provide care. I am abused at my desk, on the phone, basically all the time. Management is completely absent/unsupportive/totally inept. It has created a trickle down effect where we are all doing more than ever. No raises. Not even pizza. \n\nThis woman shared something that completely changed my perception. She has massive complications from a surgery (20 additional surgeries, her final one this coming week). “I’m scared. Over the past few years I’ve been treated so badly post-surgery. Why are they working as a nurse when they make me feel like they hate me?” \n\nThis stranger literally changed my life today and I wish I could let her know. I went to work afterwards to an absolute shit show. We had a green resident (who was actually really amazing for his first shift), high volume and acuity, and we were running short. A pharmacist said, “oh, fuck you” when I could not connect them to an on-call physician after providing them with the paging number. This was my fourth shift and my filter is usually quite tenuous. But after that short conversation it didn’t bother me. \n\nThe smallest kindness that literally takes next to nothing could make a massive impact.\n\nI’m leaving my job for a similar one in a few weeks and I will forever carry what she said whenever I feel overwhelmed.",
    "title": "Casual conversation with a customer changed my life",
    "subreddit": "nursing",
    "timestamp": 1689581797,
    "score": 1080,
    "keyword": "woman nurse"
  },
  {
    "text": "An ER nurse called the cops after a woman suffered a miscarriage at home She’s now charged with felony abuse of a corpse. This is why politics DO matter when it comes to healthcare and who is taking care of you.",
    "title": "An ER nurse called the cops after a woman suffered a miscarriage at home",
    "subreddit": "nursing",
    "timestamp": 1703277588,
    "score": 1007,
    "keyword": "woman nurse"
  },
  {
    "text": "“Do you even know what you’re doing? How long have you been doing this? I know it’s not supposed to hurt if you do it right, it doesn’t hurt in the lab.” Starting an IV on a nervous and impatient older woman as the intake nurse in the ED. When I got a flash, she immediately pulled her arm back and the catheter dislodged. That’s when she jumped into the classic barrage above. I told her it always hurts just a little, and apologised. She still complained about my incompetence to another nurse and said I was rude. What’s the best retort when people hurl these kinds of insinuations? \n“No I don’t know what I’m doing. 13 years as an ER nurse has taught me nothing about this task. How foolish I am, let me call the lab tech to start this IV. I’m sure they’ll painlessly navigate your flabby scar tissue spider veins with this 20g iv so you can get that CT chest with contrast.”",
    "title": "“Do you even know what you’re doing? How long have you been doing this? I know it’s not supposed to hurt if you do it right, it doesn’t hurt in the lab.”",
    "subreddit": "nursing",
    "timestamp": 1692303085,
    "score": 985,
    "keyword": "woman nurse"
  },
  {
    "text": "I just can’t anymore I just found out from the NT that my noncompliant, frequent flyer, attention-seeking, I’m-going-to-continuously-change-and/or-make-up-my-neuro-symptoms patient is using disinfectant wipes that her husband brought in to clean her privates. We’re talking Lysol here people. I just don’t have it in me to walk all the way across the unit to explain what is wrong with this situation to a grown woman. I swear, I’m a good nurse 🤦🏼‍♀️",
    "title": "I just can’t anymore",
    "subreddit": "nursing",
    "timestamp": 1687768010,
    "score": 947,
    "keyword": "woman nurse"
  },
  {
    "text": "Nurses - what is something that happened to a patient that will haunt you for life? Here is mine: I was a new grad nurse, just two months off of orientation. We had a woman that was admitted on a Friday for a stroke. Over the weekend, she had another stroke while on our unit. They had called a “stroke alert” on her and she was found to have had a stroke in another part of her brain. \n\nMonday comes around and I am her nurse. I took care of her all day, nothing seemed out of the ordinary to me.\n\nPatient did have a high SBP (190s) in the morning prior to receiving her scheduled medications and also vague complaints, like headache and nausea. I treated these things with PRN medications from her MAR with her morning med pass. She felt relieved with these treatments and there were no other complaints from her for the rest of the shift. \n\nAround 3pm, the doctors put in a discharge order for her. I didn’t discharge her until about 6:30 - per her request. She told me that her son would be off work at 6pm and she would need him to pick her up and also need help getting into her house. So I waited and discharged her hours after the order was put in. \n\nBlood pressure at the time of discharge was 130s and I even asked her if any headaches or nausea were present. She denied both. \n\nAbout an hour after I discharged her , we received a call on the unit from her family saying she was unresponsive at home. I lost sleep over that, thinking maybe I missed something or that I could’ve done something better to prevent that from happening. It’s been a long time since that happened but I still think about it from time to time.",
    "title": "Nurses - what is something that happened to a patient that will haunt you for life?",
    "subreddit": "nursing",
    "timestamp": 1698256688,
    "score": 798,
    "keyword": "woman nurse"
  },
  {
    "text": "I’m a nurse manager. And I’m fed up. I’m a nurse manager for a large department in an even larger hospital organization. I started here as a young nurse and I used to love my job, looked forward to coming to work. The patient population is exactly what I wanted and my coworkers were incredible. I quickly rose through the ranks and when a manager spot opened up, my coworkers and leaders alike encouraged me to apply.\n\nI have always been very upfront about my intentions as a manager. I didn’t take an office job to get off the floor or have an easier gig or make more money. (In fact, if you factor in shift differential, overtime, and COVID incentives from that time, I ended up taking a pay cut by promoting, as confirmed by my tax returns.) I took a leadership role because I wanted to improve working conditions for the staff on the floor. I believe that if management takes care of nursing, nursing will in turn take care of the patients effectively (excluding the bad apples that you have to weed out occasionally). I was excited to update policies to reflect actual practices. I was eager to implement ideas I had been polishing in my head for the last few years. I was hungry to invoke a change in the mindset of leadership and address the dwindling morale of the nursing profession.\n\nBut after years of trying, I give up. “Management/admin doesn’t care about floor staff” isn’t just something nurses say when they’re burnt out; I can confirm with first-hand experience that it’s true. And I’m heartbroken.\n\nI believe most of the members of my mid-tier management team care about staff, or at least try to, but the senior leaders make it difficult. At any given moment, I have between 110-130 employees who report to me. That’s 130 timecards to correct every other Monday. 130 employees to follow up with when they lapse on certifications or employment requirements. 130 employees who come to my office with concerns. 130 employees who call and text me outside of business hours. 130 evaluations to sign annually. How are you supposed to make a meaningful connection with 130 employees? You don’t. But try telling that to a high-up who has maybe 5-10 direct reports at the most. 130 employees alone is enough to burn out even the most empathetic manager.\n\nThen there are the meetings. Some days I am double or triple booked with meetings, and most of them are just opportunities for people above me to pat themselves on the back. Or for them to tell managers that employees aren’t happy and we aren’t visiting them on the units often enough. Or there’s the HR-led meeting about how to be an effective leader, run by a woman who has never led people a day in her life. She tells us to make face-to-face connections with every single one of our employees. This is said during a virtual meeting because she cannot be bothered to drive to our departmental campus.\n\nAnd here is where my morale tanks: Human Resources. The backbone of a company, meant to be impartial and policy-focused, right? Not here. Ours is run by a woman who doesn’t even have a degree in HR. She’s been a VP with us less than a year and already ruined this organization. First and foremost, if you have a serious employee issue, good luck getting HR to help. I once had an employee situation that involved a very serious racism allegation. I sent multiple emails and texts to my HR rep asking for assistance and outlining the problem. No response. I finally had to involve the CNO TWICE before a meeting was arranged. What’s the first thing the HR VP said to me in this meeting? “You should have involved us sooner.”\n\nAnd before someone says I need to speak up, I have. Last year HR hosted a meeting where management teams from all departments were expected to attend and suggest quality improvements. I talked about having too many direct reports, too much meaningless busy work, too many meetings. I told them I hated that I was forced to attend meetings that did not impact me in any way when I could be on the units helping my nurses who are working short staffed. Many others agreed. Nothing changed. In fact, lately I have been forced to attend a subcommittee where we are forced to redefine leadership terms to fit the organization. No joke, we sit there for hours while others pedantically argue over the verbiage of something I can just google. I spoke up about that too. Why am I wasting my time when there are already evidence-based definitions and leadership courses that address this? This does not help floor staff in any way. I was told those EBP courses focus too much on EMPATHY.\n\nWanna know the cherry on top? My department works with incredibly dangerous patients and the risk for injury is higher than most. If an employee is injured and goes to get checked out or is told by a doctor to be off of work, they are forced to use their own PTO. The organization used to use admin pay, but stopped years ago. My direct leader told us to use the employee’s extended illness leave instead because that’s rarely tapped into. HR caught wind of that and told us to cease and desist. So my employee who was punched in the face just for doing his job is now out 24 hours of PTO because a patient decided to hit him. This happens multiple times a week. (Also, many of our employees are from other countries and save their PTO to use on trips to visit home.) This has led to nurses not wanting to report injuries and assaults to avoid being off the schedule. But sure, company, tell the public all about how you value your nurses and we’re healthcare warriors.\n\nI’m so lost. I don’t know if I should keep fighting in the hope that something will change, at the risk of ruining my mental health. Or do I go back to the floor that I enjoyed so much? Or do I completely jump ship because I know the truth about how corrupt the core of this company is? Even thinking about stepping down makes me feel like I failed my employees. But I feel like I would be more help to them while working alongside them rather than sitting in my office listening to a bunch of big wigs wonder why nurses don’t want to work here. (Even though I am vocal about better pay/benefits/working conditions. I even told them how offensive pizza parties are when that idea was brought up.)",
    "title": "I’m a nurse manager. And I’m fed up.",
    "subreddit": "nursing",
    "timestamp": 1680828651,
    "score": 600,
    "keyword": "woman nurse"
  },
  {
    "text": "If student loan forgiveness or reform doesn't happen, we're all going to have to become okay with there being no teachers Or social workers, counselors, nurses, or any high stress, high education, low pay careers.\n\nI had to turn down my first pick school after student teaching because I couldn't afford to live in the district or in the surrounding communities. I would have either paid 50% of my monthly income on just rent or move back home in my late 20s. \n\nSo I went with a Title-1 school with no support, no community, no accountability, but it has low cost of living. I'm miserable here and so lonely but at least I can cover all my bills plus have a savings account. \n\nIf Forgiveness doesn't pass, I have to quit teaching. My mental health cannot handle another year at this school but I can't afford to live anywhere in my state on a teachers salary. I'm looking for corporate jobs right now, it's really my only option. I've been priced out of my career as a single woman. \n\nI think this will happen to a lot of teachers in the next few years. Fewer will go into the field because the financial risk is too high, and more will leave because they're not going to choose raising someone else's kids over having a roof over their head.",
    "title": "If student loan forgiveness or reform doesn't happen, we're all going to have to become okay with there being no teachers",
    "subreddit": "Teachers",
    "timestamp": 1677696488,
    "score": 276,
    "keyword": "woman nurse"
  },
  {
    "text": "Thinking of wearing (nurse) Scrubs to work-- thoughts? Just want to say that, yes I know I'm coming from a relative place of workplace wardrobe privilege. I see that there are some places where you have to pay money to wear jeans or something like that. We don't have an official dress code that I'm aware of where I teach. \n\nPreviously, I would typically wear jeans and a nicer shirt to work. Then COVID hit and work from home and I pretty much lived in yoga pants. \n\nPost covid, I came back in jeans and then got pregnant. I was wearing a lot of maternity clothes. Now for whatever reason my jeans aren't fitting that well.\n\nI took my kids to the doctor a couple days ago and was noticing some of the nurses scrub pants that a lot of them were wearing. They looked pretty durable, comfortable and had tons of pockets. I was thinking I might try and get a couple pairs of those to alternate with my jeans. \n\nHas anyone wore in medical scrubs for teaching? \nAny tips either way? \n\nI teach middle school if it matters.\nI am a 6 ft tall woman, so may need to look for men's scrubs just to get the height right.",
    "title": "Thinking of wearing (nurse) Scrubs to work-- thoughts?",
    "subreddit": "Teachers",
    "timestamp": 1688065836,
    "score": 65,
    "keyword": "woman nurse"
  },
  {
    "text": "Paras being physically attacked Hello everyone, I am coming to y’all today for advice. \nI am a young woman in my 20’s working with about 7 other women from different age ranges in a small town elementary school. We work for a SPED CO-OP made up of several districts making less than $13/an hour. And this year is the worst. \n\nWe have a very large, Very violent and very low functioning autistic student. She is close to 5 foot tall, 120 pounds at age 9. Us paras rotate our time with her throughout the day. She has always been violent, but this year has been worse. She is learning that she can get what she wants using her body as a bulldozer, hitting, biting, pinching, kicking, dropping to floor, etc… we have no male staff that is trained to help us so we are on our own. Our SPED teacher is older and has been the punching bag most of the year as well. So we are left with one CPI trained individual out of almost our entire school. \n\nI feel as if though I’m at my wits end. I absolutely LOVE my job. And my students. But I am physically exhausted. I have more bruises and pain than ever before. Today I was bit so badly that I’m pretty sure she bit into a nerve because of how bad my pain is. We make all the necessary incident reports but our supervisors at the CO-OP do nothing to support us. They provided us with arm protectors but the student can still bite through them and break skin. We’ve been choked, our eyes gouged and scratched, heads smashed into walls and we are still not allowed to protect ourselves more than defensive positions. We have never been trained for any violent situations. Ever. \n\nLuckily, I have an autistic brother who is aggressive and I have spent over 20 years learning from him. My parents put my brother into a facility for autistic children and it was truly a miracle. The parents of the student absolutely refuse to even consider this option for their daughter. I know that decision would be the hardest in the world to make as a parent so we don’t push it. But the paras who work with this student are so lost, depressed and overwhelmed and frustrated that we don’t know what to do anymore. Our phones are filled with pictures of our injuries, our nurse has tons of incident reports stacking up and yet we don’t have any help. We have an autism specialist in our building but all she ever does is sit in her office and not even dare to come out of it and even try and help. We are completely on our own. We hate seeing our SPED teacher get hurt but we get hurt just as bad. At least our SPED teacher is allowed to protect herself but we aren’t. \n\nWe each spend at least 1 hour per day alone with this student basically babysitting her. She can’t speak, she’s not potty trained, she doesn’t communicate with sign language, she can barely understand us pointing to pictures. And if it’s something she doesn’t want to do? Forget about it, she will hurt you. She comes do school for 6 hours a day (shortened days) and all we can let her do is watch her iPad all day and we are lucky if we can get her to do a craft or two. Her cognitive abilities are so low that everything is hand over hand or putting stickers on papers. \n\nWe are scared for the future because we know this student will keep growing because both of her parents are very large. Over 6 feet tall and on the heavier side. Soon she will start puberty and I’m not even sure if that’s legal to have someone that’s not potty trained in diapers all day having their period?? \n\nWe don’t see things getting any better anytime soon but in the meantime is there anything us as paras can do to help things get better? I feel like we don’t get paid enough ($13/hour) for what we have to go through lately but I know they won’t give us raises. We’ve asked for more paras and we’ve been denied. We are just stuck. \n\nAny advice would be amazing at this point. Or even any stories on how you guys have survived. \n\nThank you all for being amazing teachers and helping our students grow and succeed ❤️",
    "title": "Paras being physically attacked",
    "subreddit": "Teachers",
    "timestamp": 1674283581,
    "score": 7,
    "keyword": "woman nurse"
  },
  {
    "text": "I got a $2 \"raise\" and lost all of my government benefits because I \"make too much\" now to qualify. It's not enough to live off of. This really sucks. I know I'm going to get raked over the coals for this and I'm really ashamed and honestly embarrassed as hell about this. I went from making $18 an hour and received a \"raise\" of $2.25 and now make $20.25 an hour. Under any other circumstance, I think most people would celebrate because yay, a raise. But because I received SNAP, Medicaid and WIC for myself and my daughter, I had to notify my case worker (and got scolded by her for not informing her \"immediately\" when I received my raise. Now I'm worried I'm going to get in trouble with social services) and received a letter in the mail earlier this week that my SNAP benefits went from $208 a month...to $28 a month. I lost Medicaid because I am above the limit. The only thing I didn't fully lose was my WIC benefits.\n\nIt's still not enough to live off of. My rent is going up $200 in April from $900 to $1100. I have a one bedroom apartment and still co-sleep with my toddler because I can't afford a toddler bed for her. That $208 a month I would receive in SNAP benefits is what really fed us throughout the month - shopping at Aldi and WalMart, mostly. I buy the cheapest diapers and wipes, eat a lot of peanut butter and potatoes and sometimes skip meals so my daughter has enough to eat, only shower every other day to keep the water bill low, keep our apartment at 66 to keep our power bill low. According to my case worker, I should \"make enough\" to cover rent, electric, water, gas, trash, the list goes on and on. But I don't. I regularly have to juggle which utility can be paid, which can be put off, I have to calculate groceries down to the penny.\n\nMy child's biological father doesn't pay child support and hasn't in months. He's currently in jail for sexually assaulting a minor. He was abusive to me so it doesn't surprise me that he went after someone younger. Of course his parents and siblings and friends are saying he's innocent because the child he assaulted \"looked older and he had no idea\" 🙄\n\nHe is required to pay $80 a week in child support but I might have seen that every other month, if I'm lucky. My case worker knows he's supposed to pay but he can't pay anything if he's in jail so it's just sitting in arrears. He doesn't care about her and never did in the first place. I've done everything I can to keep her happy and healthy but here I am, looking at lower paying jobs again just to get my assistance back.\n\nYesterday I sent my kid to daycare like normal. Got a call on my lunch break that she was coughing and I needed to come pick her up because the woman running the daycare said it sounded like a wet cough. I had to leave work early and get a passive aggressive \"Wow, your kid gets sick a lot huh?\" from my manager - which I don't blame her for. She doesn't have kids but damn, it sucks. Whenever my kid is sick and has to have a doctor's note to go back to daycare, I get one for myself too so I'm covered.\n\nPick my kid up and yeah,she's sick. She has a fever and a cough. Her pediatrician couldn't see her because they had no sick appointments available and the on call nurse said to take her to urgent care. Spent almost two hours waiting to be seen at urgent care and failing to keep a mask on my toddler. When the doctor saw her, he said it was a chest cold and there was nothing to really be done besides giving her fluids, meds for her fever and recommended over the counter cough medicines for her. Said to take her back to her pediatrician if it got worse or if her fever spiked to 104. We ended up being at the urgent care until after 7 pm and I went to WalMart to get her medicine.\n\nAt this point, my daughter was tired, cranky, coughing hard enough to constantly drink out of her water bottle. She looked and felt miserable. I had less than thirty dollars in my bank account until I get paid again, and that's when all of the bills are due. The zarbee's cough and mucus was nearly $20 for the night and day two pack, or almost $13 for just the daytime pack. My daughter was going in between coughing and crying, ripping her mask off, practically going feral to get out of the cart and I was getting nasty looks from others (because I know how awful it is to take a sick kid out but I didn't have much choice, couldn't leave her in the car for fucks sake) I just got so overwhelmed, put the zarbee's in the cart and grabbed other few groceries we needed, Just a few things to get us through until my WIC reloads. When I went through self check out, I just didn't ring up the zarbee's because I couldn;t afford it. I just sat my other bags on top of the box and walked out feeling like I was sweating bullets the whole time.\n\nI still feel so guilty and gross and felt even worse when we got back home and I had to practically force my daughter to take it. She ended up spiting over half of the medicine back out, all down her shirt and tried to wipe her face, which got the medicine in her hair, so she had to get a bath. Ended up giving her another half dose in the bathtub while she cried and had a fit to get out because all she wanted was \"uppy uppy\". I just cried along with her because I felt so bad. For her being sick and miserable and mad at myself that I had to stoop so low. I know WalMart isn't going to hurt that much over some zarbee's, but I've never stolen anything in my life before. I shouldn't have to do this. I am straight up terrified of going back to that WalMart and my stomach turns into knots when I think about it.\n\nThe welfare cliff really fucking sucks and I wish I could be happy about getting a \"raise\" and making slighty more money but now I'm just feeling down and low and shitty. It shouldn't be this hard to provide for my child, it shouldn't be this hard to live period. Her cough is getting better so I'm hoping I can take her back to daycare on Monday with the note from the urgent care doc but I am just so tired of struggling and having anxiety nightmares about which bill's gonna get paid this time or not. I just want a little breathing room and to wake up one morning feeling okay and not a pit of despair in my stomach. I know I'm not alone in feeling this way but damn it would be nice not to worry or stress for just a few goddamn days.",
    "title": "I got a $2 \"raise\" and lost all of my government benefits because I \"make too much\" now to qualify. It's not enough to live off of. This really sucks.",
    "subreddit": "WorkReform",
    "timestamp": 1676758771,
    "score": 1101,
    "keyword": "woman nurse"
  },
  {
    "text": "They almost fired the wrong person I work in a large metro hospital.  A nurse who I've known for years grabbed me at the end of my shift and asked if I could be her moral support as she has an interview with HR.  I suggested a union rep but this was a surprise meeting and she said no time.  Ok so off we go through the labyrinth to where the uppity ups reside far away from patient care.\n\nI will be vague and leave out a lot of detail for obvious reasons.  It wasn't just HR but there was legal and two security guards present.  They were terminating \"Olivia\" (fake name) for cause and reporting her for stealing drugs from terminal cancer patients.  She was shocked, I was shocked.  I know this woman and that doesn't sound plausible.  \n\nShe proclaims innocence and I believe her.  She can't compose herself to sign papers they put in front of her and there's no way I would let her sign but if she did this she's on her own so I ask what evidence they have against her.\n\nThey produce key card withdrawals of  Dilaudid and charting for patients where were supposed to get dilaudid who didn't receive it.  I'm not going to describe details of how this evidence was obtained because this kind of thing happens and I want the pieces of crap who do this to be caught.\n\nApparently there was an investigation lasting days were multiple offenses occurred and all of it documented with her ID.  They have the logs and still images of her stealing the drugs but there's one problem.  The picture isn't her.  The woman in the picture was younger and more heavy set.  I asked for the charting and it was not ICU charting.  Every area of the hospital has slightly different charting.  OR, PACU, med/surge, ICU, ER etc.  Now it is possible she took some shifts in med/surge so I don't dismiss it but the loginID is not hers either.  Her hospital badge was on the table and we could all verify that it was not her ID.\n\nThe withdrawals from the drug dispensary was the same ID as the charting, not Olivia's.\n\nThe ID's had two number transposed but were otherwise identical and when they punched up the other ID that nurse had the same first name and worked in med/surge.\n\nSo to sum up.  There was a complete investigation of a bad nurse stealing drugs from terminally ill cancer patients.  They have logs, photos (video actually) and at least one witness along with the complaint to a supervisor that started the investigation.\n\nBut when it came time to act this huge, faceless corporation didn't take the time to message the correct \"Olivia\" and sent the wrong person the message to come to HR immediately.  They were going to terminate and walk out with a security escort the wrong person.  I don't know what they wanted her to sign but I'm guessing she would have signed it if she thought it would make things better or just to get out of there.\n\nI'm sure the mistake would have been caught quickly.  Probably before the other Olivia's next shift but that doesn't reduce the trauma this Olivia faced.  Fired, career over, 4 years undergrad +2 years postgrad worthless.  Then criminal charges on top of that.  All because some head honcho couldn't be bothered to make sure they shit-canned the right person.\n\nThey apologized but Olivia is distraught.  I told her to contact the union rep and don't talk to management until you do.\n\nTLDR: An innocent person was going to be fired and have criminal charges because a boss couldn't be bothered to check the ID",
    "title": "They almost fired the wrong person",
    "subreddit": "WorkReform",
    "timestamp": 1674843442,
    "score": 339,
    "keyword": "woman nurse"
  },
  {
    "text": "The absurdity of the \"American System\". What kind of world do we live in where healthcare workers get treated the way they do?\n\nBackground: I'm a mid-level manager for a \"nonprofit\" healthcare center, skilled nursing type. I'm the Director of Nursing, and I oversee 12 nurses, 3 department heads, and 30ish CNAs. I'm younger, 29, and have been a nurse manager since I started. I'm not a jerk. I know my staff's names, their situations, and I listen to them. I'm regarded as a great manager and am asked daily to \"please not leave\". Same with my other facilities I've been at. I work at a combination assisted-living-skilled-nursing in the Bay Area of California in the US. It's a \"nonprofit\" operated by a larger company, and the building has been around for 110+ years.\n\nToday, my boss said the most absurd thing to me. I told her how I worked 45 hours last week (which is overtime but not for me because I'm salaried) and how I'm trying to figure out what else I can do. This woman, full-throated and unashamedly told me to do more work. \n\nSeriously. She told me later on to get out of the \"mindset\" of 40-hour weeks and start doing 65-80 for the foreseeable future. She told me I'm doing a great job, but to cut out some of the things I do, and that I spend 4 hours a day \"talking to people\" like our residents, resident families, and other staff. She managed to squeeze in a complaint about the last manager in a similar role, that he was \"trying to be everyone's friend too much\". She openly acknowledged that much of our efforts to improve the facility are being sabotaged by the executive director and his \"consultant\" (read: budget-slashing eye candy), but that regardless, we needed to be throwing ourselves even harder to stop this from happening, despite the VPs having knowledge of this going on. She advised that while I'm at work, I listen to podcasts about how other facilities are struggling with similar issues, and that I don't \"check out\" when I leave each day. She walked the last statement back, especially when I reminded her I was on the phone until 11:30pm dealing with a large patient issue last night.\n\nI've been a nurse since 2017. I was a huge part of saving my first job's reputation while we dealt with the pandemic, which was rewarded by a local paper publishing a hit piece on our county's mental health system (I worked as a mental health nurse). I've sacrificed my time, my energy, relationships, friendships, and my health to serve other people. And to be told I'm \"doing a great job\" and that my reward needs to be to almost double the time I spend there or working? She even advised me to take work home and respond to emails until midnight like she does. While she openly acknowledged a lack of work-life balance. \n\nWhat is this world coming to? How is it acceptable to treat a caregiver like this? I worked in for-profit care for 6 months before this and that was more bearable. Why is this country allowed to do this? It seriously hurts my heart and soul.",
    "title": "The absurdity of the \"American System\".",
    "subreddit": "WorkReform",
    "timestamp": 1678335429,
    "score": 32,
    "keyword": "woman nurse"
  },
  {
    "text": "Quitting a job strictly based on the employees. Is it a terrible idea? I work as a nursing assistant at a hospital, and I hate it. I hate it so much. I love my patients. I try to go above and beyond for them. I try to make a difference in their lives.\n\nI hate my coworkers. I’ve done just about everything. I’ve waited tables, worked construction, an office job, etc. I’m currently a volunteer firefighter. I’ve never hated coworkers, as much as I do now. \n\n99% of my coworkers are female nurses. Some have been totally fantastic. Most leave me on the verge of tears. They’re so snotty. They’re so rude. I will never be able to forget The faces they give me, after I ask a genuine question.\n\nIt’s snotty stuff to. The other week I asked a nurse where the neuro floor was. She responds with “look at the signs. I’m not a tour guide”. I asked the nurse if she could help me find this patients pulse. She said “The only help you can have, is with your own stethoscope. Practice resourcefulness” \n\nWe have weekly meetings where we sit in a conference room, and go over checklists. I walk in, and there are only a few seats left. I sit next to this woman. She immediately, stands up and moves. I just think my coworkers view me as white trash. Or low class. I have no idea what I’ve done wrong. I feel like I’m in high school again. \n\nI hate going to work everyday. I’ve never hated going to work everyday, as much as I do now. \n\nI know it’s dumb to quit a job because of coworkers. I know that it’s not a valid reason. I just don’t know how much longer I can be there.\n\nI’m going to try and get a job in ems. I have firefighting experience, so hopefully that will help me. I’ve been at the hospital for 2.5 months. I’m going to try my absolute hardest to stay until august\n\nIs this a dumb decision?",
    "title": "Quitting a job strictly based on the employees. Is it a terrible idea?",
    "subreddit": "careerguidance",
    "timestamp": 1686804699,
    "score": 11,
    "keyword": "woman nurse"
  },
  {
    "text": "Feeling Lost and Don't Know Where To Go Next In My Career? I am a 28 YO woman and I feel lost and kind of hopeless as I'm searching for my place in the world. I feel like it might be too late to discover what I really want to do and what I'm meant to do, but I thought posting here would be a good place to start.\n\nI have a Bachelor's degree from UT Knoxville in Communication Sciences and Disorders. I thought I really wanted to be a Speech Language Pathologist, but with some hindsight, I think I realize that was more my father's dream than anything else. \n\nI grew up in the type of community where women really had two options as far as careers went, you either became a teacher or you became a nurse. I mean zero disrespect to either of these fields, but I never liked kids and I get squeamish easily, so neither of those careers were going to work for me.\n\nAnother crucial bit of context is that I was born with a rare eye disorder and  Autism Spectrum Disorder, in a community where it was better to assimilate to everyone else as opposed to finding your own way to do things. \n\nI made it until my last semester of classes, but I just couldn't make anatomy and physiology adaptable with my vision. Both the school and myself tried really hard, but it just wasn't meant to be I suppose.\n\nThe school knew how hard I tried and they again transferred me over to vocational rehabilitation, because they figured it would suit me because of my passion for individuals with disabilities, however, the program ended up discontinued and now I don't know where to go from here. I don't even know that I was even passionate about it. I am currently working as a researcher on the college campus and next week I am taking a plunge to take a career aptitude test to try to find where I really and truly belong, but I feel a need for some form of guidance.\n\nAll I know for sure about myself is that I love things like public speaking, writing, and researching. I also love college students and want to help them find their place in the world as well. I love the campus I currently am working at and wish to stay here in Carbondale for the foreseeable future. I feel like if put in the right program I can make graduate school work for me, but after two failures I do kind of doubt myself.\n\nI don't have children and don't want them (I'm not rushing to pass down the medical issues) so I'm not worried about family planning on top of a career. I just...I want to feel like I do something worthwhile with my life, not just because someone other than me wants it for me, but I've spent so much of my life trying to do what others want for me that I don't even know who I am meant to be for myself.",
    "title": "Feeling Lost and Don't Know Where To Go Next In My Career?",
    "subreddit": "careerguidance",
    "timestamp": 1687212557,
    "score": 5,
    "keyword": "woman nurse"
  },
  {
    "text": "What do I do about my coworkers concerns? So yesterday my coworkers had an intervention of sorts with me about our CEO who is relatively new to our hospital. I am the chief nursing officer and they are directors over different departments. They came to me upset that my CEO will tell me things first and then they find out afterwards and that he comes to my office more than he comes to theirs. \n\nOne of them brought up that she thinks our work relationship is “inappropriate” and it makes her uncomfortable. I have NO idea what she is talking about because we do not flirt with each other (I’m happily married with a baby on the way) but we do talk about things not work related on occasion. He is pretty impulsive so if he gets good news about something related to our hospital he comes to me to tell me right away (making budget, authorization for more beds, etc.) however he asks me to not saying anything and then he updates the team a couple days later. \n\nThey think that we have a lot of closed door conversations but that’s because I run the biggest department with a bunch of nurses with a lot of demands that only the CEO can approve. \n\nIm not sure what to do because I feel like if the CEO was a woman, this wouldn’t even be an issue. Do I just not talk to him besides work? If he comes to me for advice about work drama and how to handle it do I not engage? \n\nI guess I’m just at a loss on why they are so suspicious and don’t like that we have more meetings than they do….",
    "title": "What do I do about my coworkers concerns?",
    "subreddit": "careerguidance",
    "timestamp": 1689437347,
    "score": 4,
    "keyword": "woman nurse"
  },
  {
    "text": "After 12 years as a woman in IT, I want to move into healthcare (Midwife/Nurse) - anyone done a similiar transition (in Australia)? Hi! Serial stalker, first time poster.\n\nLong story short, I want to move out of IT and into healthcare. I can't decide between Midwifery or Nursing (either paediatrics or special care/NICU). **Am I crazy to leave a stable, well paying office job to chase the dream of career satisfaction? Please tell me your stories; success or otherwise.**\n\n**Currently**: I'm 33yo and have 2 kids (1yo and 4yo). I have been in the IT industry for over 10 years now working as a Senior Business Analyst for a tech company in the education industry. Whilst my job absolutely has it's perks (flexible work arrangements to WFH, pays well, great team, lots of opportunities), it ultimately doesn't fill my soul/cup in any capacity and I don't have ANY drive/motivation left. I don't hate it, but I certainly don't love it and life is too short to be wasting (the majority of your) time doing something you're not passionate about.\n\n**Background:** I never knew what I wanted to study at 18, was crippingly indecisive and heavily influenced by others. I changed my course 3 times! Ironically, I started off with a double degree Nursing/Human Movements (because mum/sister), changed to Science (because boyfriend at the time) and ended up with an IT degree (because I wanted to graduate with \"something generic\" as I still didn't know what I wanted). Since then, I've \"stuck to my IT lane\" and been a Business Analyst across 3 industries: event management, healthcare (IVF) and education.\n\n**About me:** I am hands-on, practical, detailed, curious, observant, logical and organised.  \nI am kind, caring, empathetic, open-minded, honest, genuine, friendly, reliable and responsible.  \nI love self-growth, learning and emotional intelligence/resillience.  \nI'm physically fit, healthy, well-travelled and love exploring the world.  \nI love kids and babies, was \"fun aunty\" for years before having my own kids.  \nI'm an introvert at heart, but still love and crave connecting with people (I just need \"time off' to recharge my batteries).\n\n**What I'm interested in:** I long to be in healthcare for the job satisfaction and where what I does matter/has an impact on someone else's life, where I'm not just a number or a cog in a wheel.\n\nOver the last 5 years (since becoming a mum), I'm passionate about:- **Midwifery**; from both my own experiences and a general interest. I have consumed A LOT of birthing content out of pure interest - listening to others stories, reading online, watching doco's/tv shows, listening to books/podcasts. I'm a big advocate for womans rights and listening to the mum.- **Nursing**; my baby was admitted into PICU when she was 2 weeks old. The paedatric ICU nursing team were phenomenal and inspiring. My general interest then struck around childrens nursing OR neonatal ICU.\n\nI've applied for both, but need to decide by January when the offer round gets release.",
    "title": "After 12 years as a woman in IT, I want to move into healthcare (Midwife/Nurse) - anyone done a similiar transition (in Australia)?",
    "subreddit": "careerguidance",
    "timestamp": 1699166023,
    "score": 2,
    "keyword": "woman nurse"
  },
  {
    "text": "Nursing school or bachelors in psych? Hi everyone! I’m a 26 y/o woman living in the tristate area and I’m struggling to figure out what I should do next. \n\nI’ve worked as a massage therapist (MT) for the last 6 years and about a year and a half ago I began taking the necessary prerecs for a local nursing program. With this, I quit my job as a full time MT and became a tech at a hospital. \n\nLemme tell you, I hate being a tech. It’s the worst job imaginable and I want nothing more than to quit \n\nOver the last few months though, my thoughts on becoming a nurse have drastically changed and I, intuitively, don’t think that’s what I want anymore. \n\nSo, I thought maybe I’ll go back and get a BA in psychology and go from there. Local schools offer this degree fully online. \n\nAny and all advice is greatly appreciated. \n\nThank you 😌",
    "title": "Nursing school or bachelors in psych?",
    "subreddit": "careerguidance",
    "timestamp": 1692211828,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "People who live in self denial. Experienced that? Is that the reason they got stuck? I work for the back office team. It has lower status than Front Office. Front office requires a master and more strategic thinking. That is a fact. My team lead is a woman and she refuses to admit that fact. I accidently told her people who climb the ladder want to be promoted to Front Office. She got so mad saying we are all the same. Ever since I started working there the Front Office has more status, is better paid, and higher in the organization. Why live a lie? She even claims to have a master degree which she doesn’t have. She talks badly about the FO all the time. I can’t deal with it anymore. \n\nI see the same at hospitals where nurses claim to be equal to doctors. They complain about making less money. \n\nWhy? Ever experienced this?",
    "title": "People who live in self denial. Experienced that? Is that the reason they got stuck?",
    "subreddit": "careerguidance",
    "timestamp": 1693290223,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "Stuck at a crossroads, what should I pursue? Buckle up this is kind of long.\n\nI'm a woman in my early 20s. Last year I started taking Horticulture classes at a nearby community college. I've always really liked plants, so why not? And I was pretty engaged with the material. Then I looked at the job listings in my area. I have 2 jobs. A food service job and a plant nursery job. I wouldn't really be making much more money with an associates in Horticulture working under someone else. So I figured environmental science must be the next best thing, right?\n\nI work with some people who have their Masters in envisci and have worked as field biologists. I think it works very well for them, and while I love the outdoors and science, that job just doesn't align with a lot of my long-term goals that are separate from my career. The seasonal nature of the job, lack of jobs in certain areas, the field work that's a long ways from where you live, sometimes hazardous conditions, and honestly, environmental scientists definitely deserve higher pay. One of my coworkers mentioned a colleague of theirs left the field entirely because he couldn't handle the field work while also being a husband/father. \n\nAnother career I've looked into recently is nursing. No, not because everyone tells you to do it if you're a woman in your 20s lol. I love connecting with people and helping them out. I feel like I could really see myself doing L&D, pediatrics, or working at a women's health clinic after having bedside experience. Women getting adequate medical care has been a very strong conviction of mine after watching many women in my life have their health issues downplayed, misdiagnosed or ignored. Hell, I've experienced it too to a degree. I know birth can be traumatic for women as well (luckily not for my mom, she said the nurses were actually the best part about giving birth, which gets me a bit excited as well.) I feel it would be great to help women and be someone who actually listens and cares. As for pediatrics, I just like kids. I'm trying to get a volunteer position at a local children's hospital either reading to kids ages 6 and under or just helping the nursing staff. I've also seen envisci majors in the second career nurse posts on Reddit 👀 \n\nI grew up poor, and I think that's adding another layer of stress. I really can't afford to go into debt studying anything for funsies. Debt to income ratio is something I cannot ignore. And I don't want my salary to max out at $50-$60k. I'm paying for all my school. I want to be able to retire, own a home, help my future kids with their own college, etc. I also want something stable. I live in a state where nursing pays very well. Starting salary is usually around $80k here. Usually more than that too. I'm not in the South.\n\nSorry this is so long lol \n\nI'm very confused because a year ago I felt so excited about Horticulture. May not be easy to tell from the post, but I really am a huge plant nerd. But admittedly, I did not do a lot of research into the jobs before jumping in and studying. Maybe I romanticized it a bit as well, I think a lot of people do. I've gotten mild hypothermia working outside (my fault, should've layered more) and those summer shifts can be fucking brutal. My best bet for making money would be to open my own business, but I'm not sure if that's my dream. Both of my bosses are business owners too, I know it's not glamorous (but neither is nursing!). I know many hospitals put profit over staff and patient safety. I know patients can be awful. I've been paying attention to all the strikes. I know it's not all sunshine and rainbows. I know the schooling will kick my ass too like it does to everyone else.\n\nTL;DR\nStarted studying horticulture. Not sure if I should pursue it as a career, or leave it as a hobby and go into nursing. Both of these paths will require hard work and dedication, but nursing is a bit more clear cut, it's easier to see where your destination will be.",
    "title": "Stuck at a crossroads, what should I pursue?",
    "subreddit": "careerguidance",
    "timestamp": 1695622787,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "I'm lots at choosing my career what should I do? Thanks in advance to those who read So as the title says I (am 21) male and have been struggling to find the right career for me and don't know what to do, a little background when I was in high school I wanted to go to med school but people told me that I wouldn't be able to make it and I panicked and picked engineering since I was good with maths and as silly as it is I was doing great but felt miserable cause I didn't want to be there so after 2y I changed career tried music as a full career but got cold feet and quit then I decided to choose something related to my original dream of med school I got on a pre-med school course and I loved it. but here's when things got sour you see I wanted to get my degree as quickly as possible because I come from a household of poor income and med school wasn't and option for that since getting the degree in my country takes 6 y plus 2 years of residency so I decided to go to radiology but ended up getting scared of the x rays and it's side effects on the body so the college put xme on nursery school at the beginning I thought i could do it since it was also health related but I realize the hard way that nursing and med school are to different things completely I've also learned that I have a big ego I want to have a job were not only I will be important but were I can have financial security and more specifically we're I can make a good amount of money, which is hard to do on nursing either in my own country Venezuela or the country I want to move to Argentina apparently nurses there are heavily underpaid not only the career my teachers and classmates are straight up awfull with me I'm the only man and you would think is a plus, wrong woman's are hard to deal when they are in group. Most of them are old angry women who want to get they're degrees for only personal satisfaction ( I have no issue with that) so here I am without any idea of what to do quitting or staying and manning up. for those who may ask I live with my mom and eat her food while I'm in this mess, I had a job for two years before the career change but I'm currently unemployed any advice you can give me about my career drama would be greatly appreciated also thanks to everybody who takes the time to read you are gold.",
    "title": "I'm lots at choosing my career what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1697713277,
    "score": 1,
    "keyword": "woman nurse"
  },
  {
    "text": "Where do I go from here? Hi Reddit, it is new to me to come here or anywhere online for advise but I am just not sure what to do next. For a little context, I am a 25 year old female living in a new town (that I moved to for a job) and just got fired. I have been working at a healthcare recruiting company as a recruiter for the last year. There were lots of hurdles but all of those were organizational and operational, our leadership team was fired and replaced 3 times in the 11 months that I worked at this organization. In the time I was there, I took initiative to write our offer letter, build out our ATS process flow, all while hiring and placing 41 travel nurses in my 11 months. None of my directors ever gave me constructive feedback until the day I got fired, just a few days ago. The directors of the Recruiting Team and Transportation team were fired and replaced at the beginning of last month. They came in, changed our teams direction and took me off the project I had been instructed to work on by the previous director for a number of months. I was happy to adapt but was also very anxious that all of the work I have done to make this organization functional was just going to get ruined. I also had the most healthcare providers working than any other recruiter so I was working a lot to ensure that all organizational changes would not negatively impact the folks I have out in the field. I had a meeting with both new directors (which was suggested by previous leadership) for me to give them a two hour run-down of the current state of the team and organization. At one point, the Transportation Director Michelle, asked Jenny (other Director) a question about a facility that I had been staffing for months. I jumped in and answered her question. To my interuption, Michelle responded in a very serious tone \"Jenny is a grown-ass woman and can speak for herself. If I wanted your opinion, I would have asked you\". After this I did my best to keep my head down, stay quiet and do my work when around Michelle and not say anything or cross her in any way. Then I came to notice that Michelle was with-holding important contract and job description orders away from me and never sent me open orders for my region. With this lull, I decided to do some facility sourcing for the sales department. Then, last week, Michelle sent me an incorrect job order. I decided to send it to the sales representative who closed the deal to let them know that I would start sourcing for their position now and was informing them of the specs I had been given. As soon as I sent this (which is common practice in our organization), Michelle messaged me and asked why I would send the info to the sales rep if I knew it was wrong. I told her that I did not know it was wrong and was assuming that it was correct, so I was just wanting to keep close contact with the sales rep. She was then typing for at least 20 minutes and then deleted it all and send \"Lol ok. Do whatever you want...\" and then I was fired the next day. I asked why and HR said that I was fired for not hitting my numbers in two weeks and for being \"insubordinate\". All of which is feedback I had never received before. They then told me I would not be getting severence and hung-up the call. I don't know where to go now or what to do. Can/should I fight this? Do I move on and get another job in this new town? Do I move back to where my friends are and then look for a job there? I am 25, single, totally financially independent, and do not have a huge savings. I now want to work in organizational design and operational design management but that wasn't my official title before, will anyone take me seriously for this type of role with the experience I have? I have been working since I was 13 years old, with 10 years in the service industry until I broke my back last spring. What do I do? How do I choose what type of next step to take? I do not have very practical or involved parents and am coming to you with some wisdom and advise!!",
    "title": "Where do I go from here?",
    "subreddit": "careerguidance",
    "timestamp": 1688420723,
    "score": 0,
    "keyword": "woman nurse"
  },
  {
    "text": "MEDICAL NEGLECT but what can I do? ELDER NEGLECT IGNORED BY DON\n\nNursing home neglect by CNA. The CNA is the DON'S family member. EVERY nurse (LPN, RN) and all the CNA's, as well as multiple residents have reported the obvious neglect being done to these elders by this CNA.  He (CNA) doesn't change anyone, often times comes up missing or is caught sleeping or on Snapchat with a woman. Refuses to help other CNA'S. Refuses to ask for help. Lies about the residents, is rough with the residents to the point of making one 100yr old woman scream out in pain. When I tell him to do something, he doesn't do it. Refuses to do rounds and speaks hateful to my residents. I have found my residents soaked out and even with dried BM on them every time this CNA works. This CNA has been written up and we have directly spoken with our DON about our concerns. The other CNAs are having to pull double duty to go backtrack and change this mans residents as often as they can...they are overworked at 28:1 ratio most being total cares and X2 and X3 assists. I try to stay on him, but our DON told us that we need to be \"nice\" to him (if we correct his behavior nicely or tell him to do something the CNA says we are bullying him based on his dwarfism) we're also told to \"let him work as fast or slow as he feels necessary\"...which, AGAIN is doing nothing. Sometimes he will watch my other CNA'S do his job for him. He refuses to provide care. Everyone has complained but somehow the DON says she hasn't heard any complaints. I've seen emails from my coworkers where they have had conversations with the DON. I've seen the write ups. Our DON is throwing them in the shred box. I'm afraid to call adult protective services or go above his head as I know I'll be retaliated against and likely lose my job. In fact, everyone feels the same way and someone has already lost their job just after going above his head to try and speak with administration. We can't keep CNA'S as our CNA turn over rate is high because they're not fairly compensated for the work they have to do. I wouldn't do what they do for their pay rate as fast food workers get paid more than they do. How can we resolve this issue without our DON finding out it was us? Do we also need to report the DON for failure to correct this man and failure to file the neglect write ups?",
    "title": "MEDICAL NEGLECT but what can I do?",
    "subreddit": "careerguidance",
    "timestamp": 1693902704,
    "score": 0,
    "keyword": "woman nurse"
  },
  {
    "text": "I don't like my black female doctor I know that typically speaking black people have better outcomes when treated by black providers. I joined a weight loss clinic and was honestly thrilled when my nurse and doctor were both black. The nurse is amazing. I can't stand the doctor. She is negative about everything I say I'm doing. I stopped eating pork and beef, she said it's not enough of a diet change to make an impact. I walk a mile on the treadmill daily, she says that's a waste of time, strength training is better. She asked about my support system, I tell her my boyfriend is really encouraging me. She says find someone who didn't love you while you were fat. I cry every visit. I want to report her, but I mean she's a black woman. I feel guilty not being supportive. We get so few opportunities and I know she must have worked hard.",
    "title": "I don't like my black female doctor",
    "subreddit": "blackladies",
    "timestamp": 1682538375,
    "score": 177,
    "keyword": "woman nurse"
  },
  {
    "text": "Triggered by a Black Nurse in the ER So I went to the ER today because of a health issue. My nurse was Black. She gave me a cup of water and was supposed to give me a pill. \"Where's the pill?\" I asked. She then started making faces and said \"I'll get you the pill. One thing at a time first.\" Then I laughed because I guess it seemed like I was rushing her. \"I was like, okay,\" she joked. She then left the room. I then realized she dropped the pill and went to get a second pill. When she came back, she lowered the movable table next to me and told me I could put my cup down. \"You're not a morning person, are you?\" \"No,\" I said. \"Yeah, I can tell,\" she said. I asked her why. She said, \"You seem like a smart girl, but your reaction time...\" She finished off at that. She then dropped the SECOND pill she brought. So she had to get me a THIRD pill. \"I guess you're not a morning person, either,\" I laughed at her, giving her a taste of her own medicine. She then said she was one. \n\nI don't understand why a nurse in the ER is MAKIG FUN OF a PATIENT in PAIN. She was an older Black woman, and I know some girlies in the sub have had the same kind of bad treatment from an elder. But in the ER?? And how was my reaction time an issue? What in the world?",
    "title": "Triggered by a Black Nurse in the ER",
    "subreddit": "blackladies",
    "timestamp": 1698457354,
    "score": 24,
    "keyword": "woman nurse"
  },
  {
    "text": "Do you hesitate to report issues with other black women when you know their supervisor is white? I ask because I recently visited a new doctor(white) and her nurse(black) left a bad taste in my mouth during our short interaction. First off instead of trying to say my name she just called out to the waiting room for \"the lady\" to come up. Now my name isn't \"lady\" so I was confused as to what's going on and thought she couldn't be talking about me but sure enough she was. Then later on when she was doing preliminary intake stuff she was very curt which I didn't care too much about until she was being very pushy, rude, and tactless about asking if I was depressed. It was honestly just weird and I know I was looking at her like wtf so she curtly responded \"it's just a page I have to get through\" before leaving. I had a friend with me and after the nurse left they were also kinda baffled by how weird she was. Later on when I saw the doctor she also asked about depression but she did it in such a kind and compassionate way that it made the nurses questioning seem even worse. For the record I'm **not** planning to make a fuss over this because everyone has off days but it got me wondering what I'd do if my future interactions with this nurse became worse. \n\nSo that brings me to my question: what do you all do when you have an issue with another black woman in a professional setting?",
    "title": "Do you hesitate to report issues with other black women when you know their supervisor is white?",
    "subreddit": "blackladies",
    "timestamp": 1690478271,
    "score": 15,
    "keyword": "woman nurse"
  },
  {
    "text": "AITA for not liking my coworkers I (19 F) work as a part-time patient care technician to gain experience while in nursing school. Most of the employees are nurses or other techs, but they are older than me. Some closer to my parents’ ages. My coworkers know my mother because she’s a nurse there, too, but she works PRN for now.\n\nSo here’s the thing: \n\nMy coworkers tease me every shift about how I am not like her. They say that she’s more “animated,” she “opened up” on her first day of work, and other things like that. They say I am too “quiet” and “timid” to be her daughter and to be a nurse, which is BS because we’re both introverts. Plus, they only know the woman they work with. The difference is that she been at her job longer, and she’s closer to their ages. \n\nI’ve been working for two months. When I go to work, I just want to do my job then leave. I make small talk if I find the conversation interesting, but I don’t share my personal life with anyone. I only talk if it’s something important or interesting. Also, I’m probably going too far with this, but I think it’s because I’m a young black woman that they expect me to “act” like other black women my age. Most of the comments come from other black women.\n\nI feel like I am not gonna be able to work here anymore if they keep teasing me. There’s been too many times I would have to excuse myself to the restroom to let out my feelings. A doctor called me emotionless the other day because I didn’t laugh at their joke! I was occupied with my duties. Plus, the joke wasn’t funny! I love my job, but I hate the coworkers.",
    "title": "AITA for not liking my coworkers",
    "subreddit": "blackladies",
    "timestamp": 1693339129,
    "score": 16,
    "keyword": "woman nurse"
  },
  {
    "text": "Should I hurry up and have kids and settle down? Hi! I’m nearing my 30’s and I’ve been feeling pressure from society and social media(I’m embarrassed, but I’m honest), that I need to hurry up and find a man and have kids with him.\n\nHowever, idk about anyone else but it’s not that easy to find a decent man, especially one that I would want to bear children for. And also, I’m not against having children, but I don’t want to because I felt like I was forced.\n\nAlso, I have a friend who is married with a child and she’s been kinda annoyingly pressuring me to find a man and have kids because that’s a woman’s true purpose in life, but she doesn’t seem or sound happy in her situation.\n\nAnd, I’ve heard stories from nursing home nurses who say that the elderly women who were childless were incredibly miserable and they had an intense look of loneliness in their eyes.\n\nFinally,here is my question: is it necessary for a woman to have kids or is it possible to live a happy child free life?\n\nAlso: if you’ve worked in a nursing home or been around older women could share some stories or advice from them?",
    "title": "Should I hurry up and have kids and settle down?",
    "subreddit": "blackladies",
    "timestamp": 1677403666,
    "score": 7,
    "keyword": "woman nurse"
  },
  {
    "text": "The 'gender pay gap' is a myth. It should be called the 'gender earnings gap'. The so-called ‘gender pay gap’ is one of the central tenets of feminist doctrine. Of course, in one sense, it is a fact. Estimates vary, but on average, women will earn about 75-85% of what men earn over their lifetimes. We might more accurately refer to this as a gender earnings gap than a gender pay gap, but whatever you call it, I won’t argue. It seems pretty clear to me, and I don’t doubt the statistics. The question is whether or not it matters. If one can reasonably extrapolate from those figures that women earn less than men purely because of workplace discrimination, then that’s an issue. But the correlation between gender and lifetime earnings is nowhere near as simple a picture as feminists make out.\n\nThe idea most frequently conflated with the gender earnings gap is that of unequal pay. The notion that women are paid less than men for doing the same work is often—implicitly or explicitly—touted as the reason women earn less. But paying one gender less than the other for the same job is illegal, and it has been for over fifty years. Indeed, if it were possible to pay women less than men for the same work, one would expect businesses to reduce their labour costs by employing more women. But that’s the opposite of what happens. \n\nOn average, even the women who work 'full time' work far fewer hours than men, and this is just one of the many reasons they may earn less over a lifetime. They also choose different careers from men, are less likely to do dangerous jobs or relocate for a higher salary, and tend to prioritise other things, like children and family. None of this has anything to do with the relative amounts men and women might be paid for doing the same work. The difference between equal pay and the gender pay gap is important and seems straightforward enough, but the deliberate conflation of the two concepts is ongoing, and many feminists are desperate to keep it alive.\n\nTake the Fawcett Society’s ‘Equal Pay Day’. This is described as “a national campaign led by Fawcett Society in the UK. It marks the day where women effectively on average, stop earning relative to men because of the gender pay gap.” In the US, the Whitehouse itself is in on the act, which it does to highlight “how far into a new year a woman must work, on average, to earn what a man did in the previous year.” In 2023, it was March 14th. The justification for this is that “women working full-time, year-round are paid an average 84 cents for every dollar paid to men.” \n\nThe implication is that throughout the workforce, and with consistent and predictable regularity, employers are breaking the law by paying women 84% of what they pay men for the same work. But is that really what’s happening? How could such a flagrant disregard for employment legislation be taking place on such an enormous scale, and all through the relatively quantifiable, traceable conduits of taxable salary payments? The answer is that it’s not. Women are not being paid 84% of what men get paid for the same work. They can’t be, because they’re not doing the same work. \n\nAmongst the top female-dominated jobs in the US and the UK are nursing, childcare, and secretarial work; amongst the top male-dominated jobs are construction, plumbing, and vehicle maintenance. In the US, the annual mean wage for all occupations is $58,260. Out of the top ten female-dominated professions, all but three pay an annual mean wage which is lower than that, and the annual mean wage for the top ten female-dominated professions combined ($50,581) is almost ten thousand dollars lower than the national mean. On the other hand, five of the top ten male-dominated fields pay higher than the overall mean, and the average for the top ten male-dominated jobs comes in at $59,643, or in other words, $1,383 higher than the overall average.\n\nThe average annual pay in the UK is £31,285. Again, only three of the top ten female-dominated professions pay more than that, compared to five of the top ten male-dominated professions. The top ten female-dominated professions in the UK pay an average of £26,925 for 35 hours of work; the top ten male-dominated professions pay an average of £30,451 for 48 hours of work. The Fawcett Society takes care not to highlight facts like this on Equal Pay Day, but it’s worth noting that in the UK, not only are men working longer hours, they are actually getting paid a *lower* average hourly rate than their female counterparts.\n\nSo what does all that tell us? Men and women pick their careers with some predictability along gender lines. Men work longer hours and get paid more overall, although their hourly rates aren’t always better. They also do some of the more dirty, dangerous jobs that women don’t like. Similarly, women tend to do things men don’t like. These jobs often require fewer working hours and offer more flexibility. That’s hardly a fashionable thing to say, and I am by no means advocating for adherence to traditional gender roles, but the statistics reflect a freely exercised choice, and remain true whether you like them or not. \n\nThis element of choice is crucial when discussing the gender earnings gap with any nuance. Another key element is age. When you bring age into the equation, you realise how much of a blunt instrument those much-touted ‘gender pay gap’ statistics are. Longitudinal studies tracking the trajectories of professional men’s and women’s careers over time have shown a negligible earnings gap for the first ten years after university. Around ten years in—which coincides with the time most graduates start having families—a divergence between average male and female earnings starts to set in. Feminists waste no time in concluding that this is due to sexism. But could it be that women at that stage in their careers just have different priorities in life?\n\nIn a recent Yale study of management-track employees from a large retail chain, researchers lamented the failure of higher-ups to promote female employees. In their abstract, the study's authors rush to conclude that this is due to hiring managers' inability to recognise women's leadership potential. Yet the researchers also found that female employees were less likely to accept promotions when they were offered, citing longer hours, less flexible working patterns, and potential relocation as barriers to acceptance. Indeed, when isolating promotions requiring relocation, the ‘gender promotion gap’ was significantly more pronounced. The researchers’ data also showed that men were more likely to leave the firm to look for promotion elsewhere if they were passed over internally. In other words, more men than women were prepared to secure a higher salary by committing to work longer hours, enjoy less flexibility, and undergo the upheaval of leaving the company or moving home. \n\nIt may reasonably be deduced that not only do women tend to choose different careers from men, but they may also exercise greater freedom of choice when navigating those careers. Should work and family issue competing claims for their attention, they at least have the option of picking between the two. The element of female choice is often missing from the gender earnings gap debate, presumably because it might make the gap look like a good thing for women.\n\nAnother frequently absent point of discussion is the financial pressure upon men starting a family. Whilst it is perfectly obvious why a new mother might want to work less, it is equally logical, although less commonly talked about, that a new father might feel he needs to work *more*. The financial anxiety that comes with children can be terrifying for men, not least in a society where high-earning careers are touted as a birth right attendant upon ‘male privilege’. However, when men do pursue advancements in seniority and salary, their actions are often attributed to an ugly desire for power and domination. \n\nYet the average man is not an individual economic entity; he exists as part of a household structure which commonly includes a woman, and she benefits as much as he does from any advancements in his career. This particular elephant in the room is often ignored, but cohabiting heterosexual couples are the norm, particularly amongst those who have children. As such, the amount of money a woman earns and the amount she can access are not the same. The average married woman is hardly likely to oppose her husband seeking a pay rise so he can provide for their children. In doing so, rather than embodying the stereotypically selfish, domineering corporate pig, he may be seeking greater financial reward out of a sense of responsibility, duty, and love. And it so happens that the time this becomes most pressing for him is the time that many women are pulling back from their careers. It will be an unpalatably congenial thing for a feminist to admit, but when viewed this way, the divergence in male and female earnings after a decade of work seems to be less about female subjugation than it is about female choice, male sacrifice, and familial cooperation.",
    "title": "The 'gender pay gap' is a myth. It should be called the 'gender earnings gap'.",
    "subreddit": "MensRights",
    "timestamp": 1682969563,
    "score": 491,
    "keyword": "woman nurse"
  },
  {
    "text": "Debunking the \"Gender Pay Gap\" Copied from the [original post here](https://www.reddit.com/r/TraditionalMuslims/comments/14p3dwq/debunking_the_gender_pay_gap/).\n\nSo I didn't think I needed to debunk this as it's been done a million times before. However, it's come to my attention that apparently some still believe it. So, just to have an easy-to-reference, codified treatise on the issue, I'm writing this piece to utterly decimate this commonly propagated liberal trope.\n\nMainstream media presents [articles like this](https://www.businessinsider.com/gender-wage-pay-gap-charts-2017-3) that claim there is a pay gap between men and women, and that it's on the sole basis of gender. While it is true that men tend to earn more money than women, it is absolutely false that it's due to gender bias in favor of men (if anything, it's actually in favor of women). The problem with the statistics shown is that they only take into account median yearly salaries without accounting for any other confounding variables that may be skewing the data. For example, if I told you that the more people drown the more often ice cream is sold, would you take that to mean that ice cream causes people to drown? No, you'd probably say that it's because of ice cream sales increasing in the summer when it's hot, which is simultaneously when people go swimming more, thereby increasing the likelihood of drownings to happen; this shared commonality (i.e. the heat) is a confounding variable.\n\nFor the so-called \"gender pay gap\", here are the confounding variables:\n\n1. This statistic does not account for what types of jobs are being worked, as **men choose higher-paying jobs**.\n   * [*Source 1.*](https://pubsonline.informs.org/doi/10.1287/orsc.1120.0757) *Demonstrates how women choose different jobs than men because they value and/or prioritize different things than men (e.g. better work-life balance). Because of this, the jobs they prefer tend to be lower-paying.*\n   * [*Source 2.*](https://academic.oup.com/oep/article-abstract/57/3/479/2361925?redirectedFrom=fulltext) *Same as Source 1, but also found that \"job satisfaction of men increases with additional earnings while that of women does not\" (p. 486).*\n   * [*Source 3.*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *Landmark study; displays evidence that men choose higher-paying jobs. The more egalitarian/feminist a country is, the fewer women choose careers in science, technology, engineering, and mathematics (i.e. traditionally male-dominated roles). Giving greater career choice to women increases (apparent) gender disparities within the workforce.*\n   * [*Source 4.*](https://www.jstor.org/stable/2525981) *Cited over 11,600 times. Demonstrated very directly that women choose jobs that are lower-paying, and that women are NOT being paid less to do equal work; and this was in 1973, almost 50 years ago. Please note that any discrimination found thereafter is really just residual unaccounted variability rather than actual discrimination per se, as detailed in the conclusion.*\n   * [*Source 5.*](https://journals.sagepub.com/doi/abs/10.1177/0891243210361475) *So ignoring the ideological bullshit that's indirectly being pushed, it demonstrates clearly that women choose different jobs than men and that it is solely due to their own choice; and that the only time women don't choose traditionally female jobs over male jobs is when they're essentially forced to take the male job.*\n      * *Interestingly enough, this supports the findings of* [*this study here*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *(which was a MASSIVE, catastrophic blow to the \"men and women are equal but female oppression and gender discrimination are the only reason why we aren't\" narrative); the researchers found that the more egalitarian/feministic a society is, the greater the gender differences will be (regarding what people will choose to pursue). In other words, when you give women free choice to pursue whatever they want, they will willfully choose occupations/education/life goals that will only increase the gender gap between men and women.*\n2. The statistic does not account for **different positions within a respective field** (e.g. head/lead developer vs senior developer vs junior developer; they're all developers, but different rankings/positions). We know this because it's not possible to know the relative rankings/positions of people's careers if they don't even know what those careers are in the first place.\n   * [*Source 6.*](https://www.jstor.org/stable/1808858) *Looked at a company from the years 1966 and 1969-1971; found no gender discrimination when accounting for all variables. States that at most, there may be gender discrimination with regards to promotion, but even this is speculative as it is not explained why this may be the case (and truth be told, we already know why this is; I will explain later on). If the concept of a gender wage gap was already being debunked/disproved back then, it definitely doesn't exist now (at least, not in favor of men anyway...).*\n   * [*Source 7.*](https://www.jstor.org/stable/30038574) *Studies a company that was sued for ACTUALLY discriminating against women with regards to promotion, and found that there wasn't any pay differences between men and women who were given the same job/assignment. In other words, even when discriminating against women, they were still being fair about the pay.*\n3. The statistic does not account for **age** (e.g. a young person may make more money than an older person in a physically-taxing field, older people in fields that would require more knowledge/wisdom to handle, etc.).\n   * [*Source 8.*](https://www.nber.org/papers/w26623) *Generally speaking, workers over age 40 are only about half as likely to get a job offer as younger workers if employers know their age*\n4. The statistic does not account for **job tenure** (i.e. how long someone has been working for their respective employer for).\n   * [*Source 9.*](https://journals.sagepub.com/doi/abs/10.1177/0003122413514584) *Shows men in general have greater job tenure than women. It's decreasing overall (particularly for men) but there are various reasons for it, many of which are oftentimes advantageous from a career/monetary standpoint, which men are going to be more receptive towards since men typically prioritize money more than other aspects of a career (see Source 1).*\n   * [*Source 10.*](https://www.jstor.org/stable/1831432) *It's in the title; job tenure typically entails higher wages. In recent times, this has been changing within certain fields (hence why it's been decreasing as shown in Source 8 above), but the point still stands overall.*\n5. **Men work more than women**, which implicates in the previous 2 points with men being able to develop greater job tenure and work experience. More men work full-time than women. Moreover, the term 'full-time\" means anyone working 35 hours or more (with some lowering it to 30 hours or more to further skew the stats in favor of their social agenda); this could mean anywhere from 35 hours to 135 hours per week, and I can tell you right now that the vast majority of people who are working an exorbitantly high number of hours are men, NOT women.\n   * [*Source 11.*](https://www.bls.gov/opub/ted/2015/time-spent-working-by-full-and-part-time-status-gender-and-location-in-2014.htm) *Statistics from the US government. Men simply work more than women, even when comparing men who work full-time to women who work full-time, and men who work part-time to women who work part-time.*\n   * [*Source 12.*](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) *More statistics from the US government for 2019.*\n      * *\"Among full-time workers, those usually working at a job 35 hours or more per week, men are more likely than women to work more than 40 hours per week. In 2019, 25 percent of men who usually work full time worked 41 or more hours per week, compared with 14 percent of women. Women were more likely than men to work 35 to 39 hours per week: 10 percent of women worked such hours in 2019, while 4 percent of men did\" (p. 8).*\n      * *Women were more likely to be working a part-time job than men.*\n      * *\"Women who worked part time made up 23 percent of all female wage and salary workers in 2019. In comparison, 11 percent of men in wage and salary jobs worked part time.\"*\n   * [*Source 13.*](https://www.bls.gov/opub/reports/womens-earnings/2020/pdf/home.pdf) *Even more statistics from the US government for 2020.*\n      * *19.6% of men working full-time worked 41 or more hours per week, compared to only 10.2% of women who were working full-time. This means that men working full-time were nearly twice as likely as women to work 41 hours per work or more (Table 5). This coincides with* [data discussed at the 2019 G20 Summit](https://www.ilo.org/wcmsp5/groups/public/---dgreports/---cabinet/documents/publication/wcms_713376.pdf)*.*\n      * *Men working full-time were also 2.3 times more likely than women to work 60+ hour weeks: 4.3% of men worked 60 hours per week or more compared to only 1.9% of women.*\n      * *Women working full-time were more than twice as likely as men to work shorter workweeks of 35 to 39 hours per week: 7.7% of full-time women worked those hours, compared to only 3.6% of men who did so.*\n      * *Men working 35-39 hours per week earned only 92.4% of what women earned working those same hours ($600 median weekly earnings for men vs. $649 for women). This means there was a 7.6% gender earnings gap in favor of female workers (for that cohort), and this is BEFORE accounting for any confounding variables!!!*\n      * *Women were more likely to be working a part-time job than men.*\n      * *Although not reported by the BLS, it can be estimated using its data that the average workweek for full-time workers (in 2020) was 41.3 hours for women and 42.8 hours for men, meaning the average man employed full-time worked 1.5 more hours per week compared to the average woman. This adds up to men, on average, having worked an additional 78 hours per year compared to the average full-time female worker.*\n      * *Some of the raw earnings gap naturally disappears by simply controlling for some of the variables. For example, women technically earned 82.3% of median male earnings for all workers working 35+ hours per week (i.e. full-time). But for those workers with a 40-hour workweek (more than three-quarters of all full-time female workers), women earned 87.4% of median male earnings, and that's after accounting for just one variable: hours worked.*\n      * *For young, full-time workers aged 16-24, women earned 94.7% of the median earnings of their male counterparts. Once again, controlling for just a single important variable—age—we find that more than two-thirds of the \"gender pay gap\" disappears. There are tons of other factors like these that go unaccounted for when you hear people/the media talk about the gender pay gap. Keep this in mind from now on.*\n   * [*Source 14.*](https://www.bls.gov/opub/mlr/2008/02/art5full.pdf) *Conducted by the US government. Looks at 12 European nations and shows that men work more than women in all of the countries studied, among many other things.*\n   * [*Source 15.*](https://www.bls.gov/news.release/atus.t04.htm) *Government statistics for 2021. Men clearly work more than women.*\n   * [*Source 16.*](https://journals.sagepub.com/doi/abs/10.1177/00197939211045376) *Some people may not think that men work more than women enough to help warrant the pay gap, but this paper explains otherwise (they basically accounted for the jobs being worked and how men and women vary in the number of hours worked within these specific jobs rather than ignoring the types of jobs worked).*\n6. Building off the previous point, **men work more overtime**, and the gender pay gap statistic does not account for overtime pay. And if men are working more hours than women, that means that men are going to make more money from overtime which is higher than your standard base rate.\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *This is one of my favorite studies ever. It's just so well-done and is, in my opinion, the epitome of what research is supposed to look like. It was conducted by Harvard University, and one of the authors is literally a woman (meaning there isn't any bias caused by sexism or misogyny on behalf of the authors). It demonstrates a multitude of things, but as it relates to this specific point, it shows clearly that men work more overtime than women (p. 2–3; Figure A.16, p. 85).*\n7. **Men are more likely to accept overtime, and especially when presented without prior notice** (e.g. if someone had an emergency and couldn't come in, and employees are asked if they can stay, men are more likely to accept it). This means men tend to be more reliable workers overall. It's technically a separate point from the one above because the frequency of accepting overtime is different from actually working it (e.g. someone could work a lot of overtime one week and not work it at all for the next 12 weeks, vs someone who works only a few hours of overtime every week).\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Also shows how men are more likely to accept overtime when it's presented to them and that men in general are especially more likely to accept overtime without prior notice (p. 3; Figure 6, p. 49; Figure A.17, p. 86).*\n8. **Men are less likely to have unexcused absences.**\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Women have more unexcused leave of absences than men (Figure 22, p. 65). This further implicates men as being more reliable workers. What's ironic is that men face harsher penalties/disciplinary measures than women (Figure 21, p. 64), contrary to popular belief.*\n9. The statistic does not account for **work experience** (i.e. how long someone has been working in their respective field).\n   * [*Source 18.*](https://www.jstor.org/stable/2535309) *In general, men have greater work experience than women (courtesy of working more than women); the timing of work experience and overall work matters a lot as well, and since men are simply working more than women, the advantages of this timing will be more apparent in men than women. This study has data directly showing that men have greater actual work experience, potential work experience, and job tenure than women (the last of which relates back to the previous numbered point).*\n10. **Men do not get pregnant and are less likely to leave work for kids** (e.g. paternity leave); pregnancy forces women to stop working, which relates back to points 4, 5, 8, and 9, and men being less likely to leave work for kids also shows more dedication to work.\n      * [*Source 19.*](https://onlinelibrary.wiley.com/doi/full/10.1111/gwao.12506) *The abstract alone states \"mothers with young children have reduced their work hours four to five times more than fathers\". Some of you may say that this therefore nullifies Source 12 as supporting evidence for point 5, but it actually strengthens it because it exemplifies the gender differences that can cause a skew in the gender wage gap myth and highlights the behavioral dimorphism between the sexes. At most, it would only nullify SOME of its generalizability on a year-to-year basis, but even then, it still showcases how statistics can be skewed/misrepresented to provide a false narrative about gender discrimination that doesn't actually exist with regards to pay. Anyway, Source 13 also states similar as well due to the Family Medical Leave Act (FMLA) where women are far more likely to leave work/not come in, but I don't want to be redundant and keep using the same source even though it's a fantastic study.*\n11. **Men are less likely to take sick days.**\n      * [*Source 20.*](https://academic.oup.com/occmed/article/68/5/320/4973626) *Women take more sick leave than men, even after accounting for many variables.*\n      * [*Source 21.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6070205/) *The introduction alone is enough to show that women take more sick leave than men, this is undisputed and has been for decades. This study sought to determine whether there were differences in attitudes towards sick leave based on gender, and whether this contributes to women's absenteeism. They did not find much support for this, indicating that women take more sick leave regardless of societal norms and expectations.*\n      * [*Source 22.*](https://journals.lww.com/joem/Abstract/2015/08000/High_Job_Demands,_Job_Strain,_and_Iso_Strain_Are.5.aspx) *Women take more sick leave due to mental health reasons than men (p. 860), with 90% of \"mental health\" reasons being either stress, mood, and/or anxiety-related.*\n12. **Men are less likely to take vacation days.**\n      * [*Source 23.*](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1019.5400&rep=rep1&type=pdf) *Great study that shows how women take more vacation days than men, while also discussing why it is the case. Has several other findings/key points that showcase male-female dimorphism as it relates to work and the family, and they are very interesting; they essentially prove what is already self-evident with regards to gender roles, despite what mainstream society is trying to push today.*\n13. **Men are more likely to move for a job.**\n      * [*Source 24.*](https://www.demographic-research.org/volumes/vol40/53/40-53.pdf) *Shows conclusively that men are more willing to move for a job. They try to say that single women are just as likely as single men to move for a job after accounting for confounding variables, but that's nonsense because one of the variables was essentially how well they like the job (i.e. \"job characteristics\"), when the location of a job doesn't have an impact on how much the job itself should or should not be liked (and if any of you researchers disagree, you will need to account for the Halo Effect to fully make sure that distance isn't what's making them view those same \"job characteristics\" as distasteful enough for them to not want to move). It's as if they're trying to say that jobs should cater to women by changing how they operate so women will like them better, rather than simply just acknowledge that women do not want to move for work as much as men. In fact, it's not even as if they're saying that, they literally suggest it lmao! It's very gynocentric when you look at it. The reason why they say this is because they do not want to admit that the gender gap is literally caused by women's own personal preferences, because then that would mean that the gender gap is normal, natural, and that women willfully make the choices that cause the gender gap, essentially nullifying any narrative that women are victims of oppression and that the gender differences that exist between men and women are caused by men and women ACTUALLY being different. This last point really irks the ideologues. In addition, it would place accountability over the gender gap on women, and women absolutely cannot handle having accountability.*\n      * [*Source 25.*](https://www.glassdoor.com/research/app/uploads/sites/2/2018/05/GD_ResearchReport_MetroMovers_Draft4-1.pdf) *Literally the same thing as the previous source (including all of the progressive diatribes that I dismantled) but with a massive online job search website.*\n      * [*Source 26.*](https://web.stanford.edu/~niederle/CEN_discrimination.pdf) *This one has some progressivism within it as well, but ignoring that, we find that any discrimination against women isn't due to them on the sole basis of them being women, but rather because of beliefs over how well they would do the job. In fact, it shows that people are MORE likely to favor women as job candidates when a negative belief is ascribed to a woman rather than when it is ascribed without the gender being stated. In other words, gender discrimination isn't gender discrimination at all but rather performance discrimination, which is the definition of a meritocracy (i.e. a system in which people are judged based on their merit/how good they are at their job, rather than characteristics unrelated to said job/merit).*\n14. **Men are more likely to work night shifts.**\n      * [*Source 26.*](https://www.bls.gov/opub/mlr/2021/article/nonstandard-work-schedules-in-29-european-countries-2005-15-differences-by-education-gender-and-parental-status.htm) *Government study looking at data across 29 European nations from 2005-2015. It shows that in every region, save for Scandinavia, men are more likely than women to work hours outside the standard 9-5. This coincides with data from Source 14 and Source 17, which showed similar findings.*\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Shows definitively that men are more likely to work night shifts than women.*\n15. **Men are more likely to work weekends.**\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Also shows that men are more likely to work weekends than women.*\n      * [*Source 28.*](https://www.bls.gov/opub/mlr/2011/07/art1full.pdf) *While also showing that men are more likely to work nonstandard work shifts, it also shows that men are more likely to work weekends as well, which Source 11, Source 14, Source 15, and Source 17 also demonstrated.*\n16. **Men are more likely to work holidays.**\n      * *Yet again, this was already shown by Source 11, Source 14, and Source 15.*\n17. **Men are far more likely to work dangerous jobs** such as oil riggers, underwater welders, etc. These male-dominated jobs pay higher than nurses and hair stylists on the basis of danger, hence why it's separate from the first point.\n      * [*Source 29.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4880472/) *Men are more likely to work dangerous jobs and are simply more willing to accept risks that jobs may have in general. This is represented by the fact that men make up most workplace deaths.*\n         * [*Source 30.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2004_chart11.pdf) *US government data for 2004; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 31.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2006_14.pdf) *US government data for 2006; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 32.*](https://www.bls.gov/iif/oshwc/osh/os/oshs2008_33.pdf) *US government data for 2008; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 33.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0009.pdf) *US government data for 2010; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 34.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0011.pdf) *US government data for 2012; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 35.*](https://www.bls.gov/iif/oshwc/cfoi/cftb0292.pdf) *US government data from 2014; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 36.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi-chart-data-2017.htm) *US government data from 2017; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 37.*](https://www.bls.gov/news.release/pdf/cfoi.pdf) *US government data from 2016-2020; shows that men make up the overwhelming majority (93%, 93%, 92%, 92%, 92% for each consecutive year, respectively) of workplace deaths.*\n         * [*Source 38.*](https://www.ualberta.ca/anesthesiology-pain-medicine/media-library/eliassons-wellness-docs/mens-mental-health/a-roadmap-to-mens-health.pdf) *97% of workplace deaths in Canada between 1993 and 2005 were men.*\n         * [*Source 39.*](https://www.safeworkaustralia.gov.au/sites/default/files/2020-11/Work-related%20traumatic%20injury%20fatalities%20Australia%202019.pdf) *97% of workplace deaths in Australia were men in 2019, with similar trends from 2003-2018 as well. These are the things feminists will never, ever talk about.*\n18. **Men are more interested in jobs that are scalable**; men are more interested in physical things, while women are more interested in jobs that deal with people. The former is scalable, the latter is not; that means Elon Musk is able to service millions of people with Tesla whereas Mrs. Johnson is only able to teach a class of 30 students per year. This point is separate from the first point because scalability relates to potential growth/earning, and based on the laws of chance, you're more likely to find some major hit successes in professions that are scalable rather than unscalable.\n      * [*Source 40.*](https://pubmed.ncbi.nlm.nih.gov/19883140/) *Meta-analysis showing men are interested in things, and that women are interested in people.*\n      * [*Source 41.*](https://www.frontiersin.org/articles/10.3389/fpsyg.2015.00189/full) *Another meta-analysis that supports the previous one above; \"patterns of gender differences in interests and the actual gender composition in STEM fields were explained by the people-orientation and things-orientation of work environments\". Basically, even in male-dominated fields, women are overrepresented in service-based and people-oriented STEM fields such as the health sciences, with the trend being found on a multinational level. This also acts as evidence for the very first point about men choosing higher-paying jobs.*\n         * [*Source 42.*](https://www.bls.gov/cps/cps_aa2018.htm) *Evidence from the US showing this trend with women.*\n         * [*Source 43.*](https://afmc.ca/sites/default/files/pdf/CMES/CMES2018-Complete_EN.pdf) *Evidence from Canada showing this trend with women.*\n         * [*Source 44.*](https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance-2017/doctors-by-age-sex-and-category_health_glance-2017-53-en) *Evidence from OECD countries (38 in total, with another 10 non-OECD countries included throughout in some data).*\n19. **Men are more likely to ask for a raise.**\n      * [*Source 45.*](https://crl.acrl.org/index.php/crl/article/view/16689) *Men are more likely to ask for a raise; the only exception is when women enter managerial positions (i.e. are put in male roles, basically). It also shows that women are basically worse at negotiating than men (\"less successful\" = euphemism for being worse at).*\n      * [*Source 46.*](https://pubsonline.informs.org/doi/abs/10.1287/mnsc.2014.1994) *Women are only as likely as men to ask for a raise when they are explicitly told they can negotiate for one. I can tell you right now that most jobs rarely ever directly tell its employees that they can freely ask for a raise lol.*\n      * [*Source 47.*](https://escholarship.org/content/qt9978v172/qt9978v172.pdf?t=omys3w) *Women are less comfortable engaging in salary negotiations, they're less likely to negotiate salaries overall, and they're not as good at it as men (the researchers don't word this last point this way because it angers feminists, but that's the gist of it). There are many other reasons that they go into as well.*\n20. **Men are typically more aggressive/competitive in their mindset and attitudes regarding work** which helps them climb the corporate ladder more (e.g. you make more off commission in sales because you close more sales due to being more competitive).\n      * [*Source 48.*](https://archive.bio.org/sites/default/files/docs/toolkit/Why%20Men%20Still%20Get%20More%20Promotions%20than%20Women_HBR%20article.pdf) *Upon reading this, you find that women are essentially not as willing to do what it takes to climb the corporate ladder; the report says that therefore the entire civilizational structure should change to favor women, but that's just ridiculous. Why not just admit that women are not as willing to hyperfocus on their careers in the same way as men? Why not just admit that women don't do it because they simply don't want to sacrifice other areas of their life for a career? Why not just finally admit that women are different from men? They can't. And that's a problem for BOTH genders.*\n21. **The top people are always going to be men due to the variability hypothesis.**\n      * [*Source 49.*](https://www.journals.uchicago.edu/doi/abs/10.1086/493921) *Men vary greater than women; when seeing any of the extremes, men are more likely to be represented on both ends. That means the most successful people in the world are going to overwhelmingly be men, and the most unsuccessful dregs of society will also be men. This represents a problem with feminist thinking because they want \"equality\" when it comes to powerful, important, and successful positions in society and say that a lack thereof in these top positions are due to sexism and discrimination (and that therefore all of men and society need to just give women these positions to \"make it fair\"), but they will never talk about the men at the lowest ends of society or talk about equalizing that. I'm not saying they should become homeless criminals and whatnot either (rather they should focus on decreasing the amount of men that are disenfranchised here; but they'll never do that since they would have to admit that men aren't oppressors and would have to actually acknowledge the plights of men), I'm just saying there's a double standard here whereby women want the rights and privileges of both sexes with the responsibilities of neither, all the while blaming men for any (and all) of their own shortcomings and faults.*\n      * [*Source 50.*](https://www.sciencedirect.com/science/article/abs/pii/S0191886913003036) *Men vary more than women yet also tend to be better on average on measures of creativity.*\n      * [*Source 51.*](https://en.wikipedia.org/wiki/Variability_hypothesis#:~:text=The%20variability%20hypothesis%2C%20also%20known,most%20traits%20than%20females%20do.) *For those who still don't get it, here's a Wikipedia article since they tend to describe things fairly simply and succinctly.*\n\nJust to really drive home the point, I quote the official statement of the US Department of Labor after having a massive [study](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) conducted for them:\n\n>**This study leads to the unambiguous conclusion that the differences in the compensation of men and women are the result of a multitude of factors and that the raw wage gap should not be used as the basis to justify corrective action. Indeed, there may be nothing to correct. The differences in raw wages may be almost entirely the result of the individual choices being made by both male and female workers.**\n\nAnd even ignoring the technical research aspects, just think about it like this: If a woman were to do the same job as a man for less pay, only women would get hired because that would be CHEAP LABOR. And for those who don't know, there's a whole sexism argument that claims men get hired more easily than men (which also isn't necessarily true either, but that's a separate discussion).\n\nThere isn't a single statistician who isn't braindead, let alone competent, who takes the statistics presented about the gender pay gap myth at face value when drawing conclusions. It's only after you account for all the variables available can you really begin to extrapolate true causality, and even then it is still weak with these types of statistical analyses anyway since it's virtually impossible to account for every variable that exists *and* have a full consensus for data rather than a statistic that has a much smaller sample size. Plus, when it comes to statistical analyses like this, you're ultimately seeing how things relate to one another (i.e. correlated) rather than seeing how they directly influence/cause something. The only way to truly test for causality is by running actual experiments with strong controls in place (which is nigh on impossible to do in situations like these). If you take a statistics class or two, you'll learn about this stuff more in-depth. Multivariate analyses are pretty much always better than univariate ones (when drawing final conclusions from, anyway), and it's due to reasons like this where society perpetuates the gender pay gap myth as a social dogma.\n\nIf women can do anything men can do (and \"do it better\"), then why are they still supposedly \"oppressed\"? Why are they still the victims? And why do they need government legislation to mandate \"gender equality\" in order to achieve it? If they were really the same as men (i.e. \"equal\") in all these regards, wouldn't perfect equality naturally occur based on merit alone? It doesn't make sense, and it's simply because it's just not true. Men and women aren't the same, and we won't ever be the same. That doesn't mean we shouldn't be treated fairly—equity over equality, always—but this myth needs to die once and for all.\n\n﷽\n\nوَلَا تَتَمَنَّوْا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا ٱكْتَسَبُوا۟ ۖ وَلِلنِّسَآءِ نَصِيبٌ مِّمَّا ٱكْتَسَبْنَ ۚ وَسْـَٔلُوا۟ ٱللَّهَ مِن فَضْلِهِۦٓ ۗ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
    "title": "Debunking the \"Gender Pay Gap\"",
    "subreddit": "MensRights",
    "timestamp": 1688347611,
    "score": 196,
    "keyword": "woman nurse"
  },
  {
    "text": "Single motherhoods and its effects are exactly why traditional gender roles in marriage existed (i.e.: biology), not \"patriarchy\". Normalizing single parenting and changes in gender roles were due to advancements in medicine and plentiful human population, not feminism. **Introduction**\n\nFeminists often complain that traditional gender roles in marriage were a result of patriarchy and women having no rights, but they looked at it through a presentist point of view. Yes, single parenthood was taboo historically, but it wasn't realistic. As a woman, you had to get pregnant with several kids to populate the Earth and even make up for all the kids who died due to high infant mortality rates. We didn't have prenatal care, medicines, baby formula, child support, birth control pills, etc. Pregnancy was very dangerous and maternal mortality rates were high, and you had become pregnant constantly back then to populate Earth and compensate for all the children who died. People didn't even name kids until they were a few years old. You didn't have baby formula and unless you had someone to be a wet nurse, you had to breastfeed the babies yourself. Women couldn't be incapacitated by childbirth and take care of kids with potential infant mortality to nurture them to make sure they safe and then provide for the kids all by herself. Some tribal societies and other communities may have had women rely on non-spouses, but overall, having two parents was crucial. Men had to provide for children, and even women worked all the time back then and so did children to support the family because one parent wasn't enough given that we needed to nurture children and make sure they wouldn't die and become pregnant several times. Women weren't forbidden from working historically, and men weren't the sole breadwinners. That's just a 1950s America thing. It's a myth women didn't work to support the family with him, because everyone in the family needed to work, and single parenting was rare and difficult.\n\n**Changes in traditional gender roles and family was caused by now-sufficient human populations, medicine and technology advancements, not feminism.**\n\nInfant mortality and maternal mortality rates declined in the 20th century, which is why in the 2nd half of the decade, single parenthood became more normalized. The reason wasn't due to feminism, but because the invention of prenatal care, baby formula, medicines and more knowledge on how to handle a pregnancy safely alongside a now populated-enough Earth made it convenient to safely take care of children by oneself. Funny thing is, even now, it's still often difficult for many parents to do by themself. Most people raised by single moms fare quite well, but there is an increased risk of issues. In non-Western countries, these gender roles still exist not because they're backwards, but because they still live in these harsh environments where these inconveniences exist. Just look at Africa.\n\nIt's still an issue in the West, too. Although the evidence is mixed, [quite a lot](https://www.tandfonline.com/doi/full/10.1080/1068316X.2020.1774589?fbclid=IwAR3LdQCK5jhuU1qOCfwfgSCUfx4NxHXQKccQ3u_8RTGl68VOBg2yZJc1TRQ) [of evidence](https://www.civitas.org.uk/pdf/Experiments.pdf?fbclid=IwAR232YpHqPKT--eQwm4ngH43sq-3HMC6H9-c6tdJjjkhwUAvqEAcOS_6B3o) [shows](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3904543/?fbclid=IwAR0wk37MHF12JoiKMXTtdGWztP6u8yYLwlvomjYLXD9LRth7KlRAdznvPzQ) that being raised by a single parent can increase the risk of kids dealing with delinquency and crime or emotional and behavioral issues, even when controlling for income, family history, and many other factors. Some stats show that it has to do with socioeconomic problems, which is why single parenting isn't good if you can't make the money to provide for kids all by yourself, but some studies show even when controlling for socioeconomic factors, single parenting does increase the risk of problems. The evidence is mixed, but some evidence shows children fare worse without a father, and some studies show this isn't a causation and some research shows it is. Even having stepdads didn't improve it. I don't mind gay couples raising kids, because they are two-parents and one can use the gender roles fathers normally had for supporting kids, but single parenting, although often okay in our more convenient environment, can in many other cases, do harm. [Even in egalitarian countries](https://link.springer.com/content/pdf/10.1007/s40865-021-00183-7.pdf?pdf=button%20sticky&fbclid=IwAR2amf8juqnV-NoHB6mphZD8-NuXy79SK7e4IoIiPVt-x9WQ3rbw13NIMxo) and many European countries, (see: link https://www.europarl.europa.eu/RegData/etudes/STUD/2020/659870/IPOL_STU(2020)659870_EN.pdf) even when controlling for many factors, single motherhood increased risk of problems to children but not single fatherhood. Typically, having a close relationship with a father lowered these risks. A well-written *Slate* [article](https://slate.com/human-interest/2012/07/single-motherhood-worse-for-children.html) clarifies everything:\n\n>Single mothers, even from wealthier families, have less time. They are less likely to be able to monitor their kids. They do not have a partner who can relieve them when they are tired or frustrated or angry with their kids. This isn’t just a question of taking kids to the array of pampered extracurricular activities that many affluent, two-parent families turn to; it’s about the ways in which two sets of hands, ears, and eyes generally make parenting easier. \n\nObviously, many children raised by a single mom do just fine, but there is an increased risk of problems caused by single motherhood or growing up without a father. Obviously, gay couples who raise kids usually did really well, but they were two parents, and they played their roles that fathers could've played. Single parenthood, on the other hand, can be risky. See? Even to this very day, although single parenthood is much more achievable thanks to advances in medicine and technology to handle safer pregnancies and the need to have several children for species survival no longer being necessary, it can still potentially cause issues. In other countries, we still have the inconveniences of the past though, which is why they don't adapt to the times, not backwardness.\n\nNow, [contrary to popular belief](https://www.jstor.org/stable/pdf/44735319.pdf?refreqid=excelsior%3A199b367927cb82179fca2b1fa966b2a2&ab_segments=&origin=&initiator=&acceptTC=1&fbclid=IwAR3Izbwy3N8InfXYjQZ9fdwtwquMiS0UaozFpqLC310nsMfMe1WDK3J3bms), it wasn't just men historically who had jobs and made money. Women had jobs and shared these gender roles, making money. Even children had jobs and made money because everyone needed to support the family because people would have several kids and we needed as much resources as possible to support several kids with high infant mortality rates. The male breadwinner/female housewife concept is a 20th century Anglosphere thing. Men did marry later than women and women did rely on men's income because women had to marry and reproduce at a young age to populate the Earth when her reproductive value was at its peak, and men didn't have to begin reproductive careers young as much because they don't have the tendency to carry the baby and only carry one at a time, 9 months each. Because very young women did not have the wealth/resources to support a child all on her own, aside from working to make that wealth, she needed an older, wealthy man to help support her, too, and who had enough money to pay a sufficient dower in case he died or divorced from her and she needed enough wealth to support herself and her kids (that's why dowers existed). This is why age gaps of older men and younger women were evolutionarily beneficial. It wasn't usually a 30 year difference, but a 5 to 10 year difference. [In fact](https://www.cold-takes.com/hunter-gatherer-gender-relations-seem-bad/amp/?fbclid=IwAR2q6EuRLvxnyqEhopbTrayV9Cm2xAbGcINrs9c7gDFl-zKoeSpr2PxVvwI), mainstream researchers were incorrect when they made headlines claiming that the pre-agricultural Stone Age societies were generally egalitarian about gender. [In fact, in the Stone Age, age gaps in sexual relationships were very common, and have been common for 250,000+ years](https://www.sciencealert.com/fathers-have-been-older-than-mothers-for-250000-years-study-finds).\n\nThis is why having premarital sex wasn't good, because birth control wasn't as effective as now and so unwanted pregnancies were very high. Child support didn't exist as much either. A woman could not have a pregnancy without a husband, and thus, shotgun weddings existed for premarital pregnancies.  Otherwise, you'd have no choice to get an abortion because you couldn't bring a child into this world if you couldn't care for it enough or it'd die or suffer. Men could only have sex with escorts, and escorts were not expected to become mothers and often engaged in infanticides or sterilized themselves. Men could never have sex with any unmarried woman, contrary to what feminists say. The invention of the birth control, which is 99.7% effective, is what started the sexual revolution because people could now easily deter illegitimate children from being born. Feminism didn't start the sexual revolution. The pill's invention did.\n\nIn fact, a [study](https://pubmed.ncbi.nlm.nih.gov/27804061/) found shotgun marriages weren't necessarily more likely to divorce. They only divorced more if they were white or wealthy. Black and poor couples were not more likely to divorce because they probably felt a commitment to this marriage. [In fact](https://slate.com/human-interest/2012/08/myths-about-single-mothers-what-bloggers-and-pundits-are-getting-wrong-about-them.html), most unwanted pregnancies were from men the woman had relationship with, and many times, lived with. However, it wasn't unusual for the relationship to have began not that long ago, and they potentially didn't relate or were emotionally distant. Nonetheless, these weren't just mere one-night stands. Most unwanted pregnancies came from women who didn't use enough birth control, if at all, and most simply said they didn't mind getting pregnant or thought they wouldn't. Just 2% said they couldn't afford birth control. They often refused to use birth control. These people should've used birth control consistently, and if they can't take care of the baby, unless they can deal with a shotgun wedding or unless the man can provide enough child support and the mother can feel she can make her kids grow up prosperous, an abortion shouldn't be viewed as a mere choice, but necessary.\n\n[Already, many changes such as later-age marriages and decline of age gaps already happened in Western and Northern Europe in the early 20th century](https://www.un.org/development/desa/pd/sites/www.un.org.development.desa.pd/files/files/documents/2020/Jan/un_1990_patterns_of_first_marriage_-_timing_and_prevalence.pdf?fbclid=IwAR1VmUDAChQvwsR8s4rkRnAQo15VaSOnBF0dGBwI1fJMm-2-DjD5fV1WKHQ) (but not as much in the US) because of their advancements already happening at the time more compared to outside Europe), with the typical marriage age being higher and average age gap being smaller in European countries compared to other countries, including the U.S. at the time. Europe was becoming more modernized early. This is due to European countries having a larger drop than the U.S. in [maternal](https://www.gapminder.org/documentation/documentation/gapdoc010.pdf) and [child](https://ourworldindata.org/child-mortality) mortality rates at the time. Compare the infant mortality rate [in the US](https://www.statista.com/statistics/1041693/united-states-all-time-child-mortality-rate/) to [European countries](https://www.researchgate.net/publication/26465837_Rural_Infant_Mortality_in_Nineteenth_Century_Norway) in the 1800s, too, and you'll see it was much more common in the US. These changes happened earlier in Europe than the US way before second wave feminism, yet people think second wave feminists caused this change. They didn't. Maternal and infant mortality rates declined dramatically in the 20th century, prenatal care and baby formula were invented, the Earth began to have billions of people, etc., and that's why nuclear families and traditional gender roles in marriage became less normalized, not because of feminism.\n\n**Discrimination against men leads to more problems in families, and** **most deadbeat dads aren't selfish men who don't care for their kids**\\*\\*.\\*\\*\n\nSo now we can see that this concept that nuclear families or having two parents are outdated isn't yet completely true. Women are told they can handle single parenting but many still have to rely on a husband to co-parent with her these days. Some of them could handle single parenting a child successfully, but it can be a difficult task sometimes. Having a positive male role model is what helps boys and girls prosper and actually deters \"toxic masculinity\" when you have more masculinity, but in a positive way, shown to them as children. [Most deadbeat dads aren't refusing to support a child, but often are poor, unemployed or paid a low wage](https://www.fatherly.com/love-money/deadbeat-dad-the-myth-and-reality-of-americas-feckless-fathers). Most child support pays are done by men with little to no money, and some of them deal with women **who don't file for support because they don't want their child to see their father**. In fact, research on deadbeat dads found that they usually did try to pay child support, and the ones who didn't were unable to due to poverty, but they often still tried their hardest to contribute in some way. Although just 61% of child support payments were made by men to the mothers of their children, [the percentage of mothers who didn't live with their kids who did not pay child support was equal to that of the percentage of fathers who did not pay](https://time.com/3921605/deadbeat-dads/). This means dads who didn't live with a child paid more often than mothers who didn't live with a child! [Unfortunately though, the court system has a bias favoring women in custody battles](http://www.breakingthescience.org/SJC_GBC_analysis_intro.php) and women initiate most divorces. Fathers now are seen as secondary parents.\n\nAs you can see, people don't seem to realize why nuclear families, men being wealthy, age gaps of older men and younger women, etc. were normalized and why single parenthood, unwanted pregnancies, fornication before the invention of the pill, etc. were stigmatized because people are presentists. Many countries still have the inconveniences of the past, which is why they haven't changed their gender roles, not due to backwardness, and the Western countries force them all to be like us, and call these countries \"developing\", even if they're a country like China or Saudi Arabia, which are richer or powerful countries for not being copycats of the West. Even now, some parents have to rely on traditional gender roles, and although single parenthood can work out, having a father and having two parents, at the very least, is ideal. I don't mind gay couples adopting kids though. In fact, the wage gap is mostly explained by women becoming mothers, not discrimination. [In any country (even egalitarian ones)](https://www.henrikkleven.com/uploads/3/7/3/1/37310663/kleven-landais-sogaard_nber-w24219_jan2018.pdf), the pay gap didn't exist until a woman became a mother. This is an example of how hard it can be to work and be a mother concurrently. It's able to be done, but not necessarily.\n\n**Men vs. women's reproductive rights**\n\nIf child support doesn't work for you and the man because he's poor and can't provide, then you better go get an abortion if you aren't financially stable enough or capable of taking care of the kids all on your own, which is already a hard task, even in \"egalitarian\" countries. Most unwanted pregnancies were found to be from a complete absence, or at the very least, inconsistent, use of birth control. The pill is 99.7% effective when used correctly, and there's no evidence that factors like weight necessarily deter it from working effectively. Most women with unwanted pregnancies due to no birth control usually were able to afford it and were simply found to be making foolish reasoning with their behaviors (cited above). Although birth control should be free, women who are unable to have a baby right now should be using birth control consistently in order to stop unwanted pregnancies.",
    "title": "Single motherhoods and its effects are exactly why traditional gender roles in marriage existed (i.e.: biology), not \"patriarchy\". Normalizing single parenting and changes in gender roles were due to advancements in medicine and plentiful human population, not feminism.",
    "subreddit": "MensRights",
    "timestamp": 1685627801,
    "score": 128,
    "keyword": "woman nurse"
  },
  {
    "text": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed. A feminist from the 1940s named Mary Beard wrote a book called *Woman as a Force in History*. It critiques the myth that women were historically treated as subordinate to men and they were restricted from contributing to society or having basic human rights. Her book only includes just a portion of what women contributed to in society, and she says there's so much more. She has no idea how it got erased from history, but critiques the idea that women were historically oppressed compared to men.\n\n**Women did have an education in medieval times.**\n\nFeminists like to think that women were denied an education historically because people hated them and wanted them to suffer, but that's false. In fact, in medieval times, women were being educated all the time, and were as literate as men. G. G. Coulton, the life-long student of mediaeval history, gives a cautious answer: “Though very few women arrived at anything like the university stage in education, it seems probable that more of them could read and write than the men,” especially in the upper classes “at the period when romances of adventure were offered in profusion.” Interestingly, going to university was less common back then.\n\nThis [chapter](https://www.marxists.org/archive/beard/woman-force/ch11.htm) from her book elaborates on all the education women had back long ago in medieval Europe. It was very normal for them to have an education. Italian and German women especially had the most education of the Middle Ages. You can see that women had education and high literacy rates, and were more literate than men. They succeeded a lot in education. Maybe there were some societies that normalized education for boys, but that's because in those societies, education taught discipline, not facts, and people believed girls were more well-behaved than boys and thus didn't need it. Moreover, corporal punishment was used on boys much more, and boys were subjected to forced labor. This was meant for build character and discipline in children. Women weren't educated because it was believed they were less prone to bad behavior and didn't need to be educated. There was only a small overlap between education becoming useful for learning things, and women not being allowed to be educated. Later on, corporal punishment and forced labor declined in schools. It was actually seen as unmanly for boys to be willing to learn.\n\nEven in the later 19th century, girls performed better than boys in elementary schools and outnumbered them, and even in the early 1900s, when high school became more common, girls went to high school more often. Girls even had free education whereas boys in high school had to have their parents pay a fee. You can read more about this from the book *The Privileged Sex*.\n\n**Women did build society and contribute to the social and economic realm of society.**\n\nIn [Chapter 10](https://www.marxists.org/archive/beard/woman-force/ch10.htm), Beard wrote:\n\n>AFTER the dissolution of the Roman Empire, nearly all the economic activities connected with the production of food, clothing, and shelter were carried on in rural villages and their outlying fields everywhere in Western Europe. Whether the village was a free community or property belonging to the estate of a great feudal lord or lady, it was largely self-sufficing; its inhabitants supplied nearly all their needs for the maintenance of life. Furthermore, the industries of households and fields were not like the modern “heavy industries.” Women could handle nearly all of them alone or with some aid from men.  \n>  \n>Thus there was no sharp division of labor as a rule. Men and women worked together for the most part. If the major responsibilities for spinning, weaving, and cooking were women’s tasks, if wood-cutting and ditching were generally men’s tasks, men and women commonly worked side by side in the fields and to a considerable extent in all the processes of transforming raw materials into commodities for use. Whether the toilers on the land were bond or free, men and women labored under similar conditions and enjoyed similar liberties of choice such as they were. Though women gave birth to the children, both parents had the services of children to help them in their work. In the records of mediaeval rural life that are available in our age, no specially onerous burdens are found to have been laid on women as women by men as men. On the contrary the records show a sharing of the toilsome tasks on about the same terms.\n\nWomen were also, even in the Indian and Middle Eastern regions, just as involved in gilds as men. Beard writes:\n\n>While in some of the records the details are lacking, Smith’s *English* Gilds contains accounts of the structure, membership, functions, and proceedings of about eighty-five gilds. In at least seventy-two of them women were members on an equal basis with men. That is surely a large proportion. In some of the other gilds a slight qualification was placed on widows; they were accepted if their husbands had been gild men. Lest the idea of sheer generosity or friendship for the deceased be adjudged the reason for admitting widows to gilds, let it be remembered that, in innumerable cases, widows carried on the craft in which their husbands had been active, being directly familiar with it as a household industry at which they had themselves labored or in connection with which they had borne responsibilities for training and directing apprentices.\n\nWomen were not in a segregated gild, and mixed gilds were common. Some men didn't approve of women in some gilds, but it wasn't due to hatred of women, but because they believed women weren't strong enough for things like bread-kneading and bread-baking. Nonetheless, these men didn't get the monopoly they looked for:\n\n>But a French Parlement refused to prohibit the customary baking by women and declined to back up the men’s opposition to the women. A French parliamentary decree even accorded some gild women rights frequently denied to English widows; it ruled that a widow could retain her membership in a gild even if she took as her second husband a man who did not work in her craft.\n\nWomen also were involved in all kinds of parts of society:\n\n>Just as women took part and carried full loads of work in agriculture, domestic industries, and trading, just as they participated in the activities of craft, trade, and social gilds or corporations, so they shared and expressed themselves in all the forms of social life in town and country. In everything human their qualities and force were expressed – from religious and secular festivities, sports, games, and riots to the **discussion of religious and moral questions and the management of charitable undertakings**. In castles and cottages, in fields and in gild halls, on village greens and in churchyards, in towns and on city streets, in taverns and at market fairs they sought release from the rigors of earning a livelihood, from burdens of domesticity, or responsibilities belonging to the status of their class, whatever it was.\n\nWhen knights even had tournaments to display prowess, it was often done to impress female spectators. **Women's cheers brought outlets in arguments over public, private or religious matters, and in disputes about property, trade, marriage arrangements, family problems, tastes, habits and good or bad manners**. In fact, in medieval times, women were very fierce in many cases, and they would steal husbands' money and run with monks, get in violent fights with women in arguments, smash knights with swords, drinking and singing in taverns, etc. One woman even bloodied a priest's nose after he tried to rape her. When the priest ordered to her to become a pilgrim to Rome, Thomas of Cantimpre laughed and advised to the woman that if a priest sexually assaults or inappropriately pursues her:\n\n>then thou smite him sore with thy clenched fist, even to the striking out, if possible, of his eye; and in this matter thou shalt spare no order of men, for it is as lawful for thee to strike in defense of thy chastity as to fight for thy life.\n\nIn medieval times, women were seen as sinful or wicked, resorting to magic, or the originators of sin, and in need to obey priests or obedient to their husbands, but men were seen as brutal or vulgar, and he had to love his wife, help her support the family and never harm her, and charivaris were done against him or even family intervention if he abused his wife. This was all a reaction to the aggression women engaged in then that people thought women would never do and that only men would do (and feminists reinforce this gender role by portraying all violent women as victims):\n\n>Also, repeated again and again and again in mediaeval documents was the idea that women had been better, if not ideal, “in the good old days,” but were now given to luxury, assertiveness, display, love of worldly goods and pleasures. Hence it would appear that the newest clichés are not so new after all.\n\nMen fought at wars more than women and committed crime more, but women who had power waged wars. Women assembled soldiers. Women fought side by side with men. Women were guilty of many cruelties, and women aided and approved the worst. Women conformed to no type, and they weren't \"tame\" in a \"man's world\". \n\n**Women had a lot of power in marriage and family that men had.**\n\nAccording to the same chapter, Beard wrote:\n\n>Beyond all question the weight of documentary evidence is against any simple conclusion that men handed women around like chattels; that boys were free to make their own choices of mates, while girls were helpless creatures at the disposition of men. After the rise of the centralized state, no one, male or female, was actually “free,” save perhaps the king or queen as highest lord, and even members of royal families had to be on guard against actions likely to stir up revolt among underlings. As a matter of fact, fathers and mothers of the middle and lower classes, as well as lords and ladies, took part in arranging the marriages of both boys and girls under the almost universal rule of “convenience.” The boy apparently had no more choice than the girl. There are records indicating that boys and girls sometimes made vigorous protests without avail; other records show that their protests were effective. But the general rule of marriage for convenience long prevailed.  \n>  \n>Whether fathers or mothers , men or women, usually dominated in the making of matches is a matter buried in the silence of unrecorded history, but there is abundant proof that women were active in the business and were no less circumspect or ruthless than men at the business. Women looked about for marriageable boys and girls to be convenient mates for girls and boys in their own families. Maidens were inclined to be shrewd and insistent – that is, “practical” – in marrying men with property, when they had any chance of selection, as they often did. Mothers were zealous in procuring for their daughters men who had property and in making sure that the property was good, and carefully guarded by proper legal titles. In other words, the marriage of convenience was no one-sided affair in which fathers and sons “had their own way” with the women concerned in it.\n\nAnd women still owned property. It's a myth they couldn't historically. They always were allowed to even back in antiquity. \n\n**Women were involved in warfare and building antiquity.**\n\n[According to chapter 12](https://www.marxists.org/archive/beard/woman-force/ch12.htm), German writer Sir Galahad described the ways of aggressive women long ago. Proof of armed women was found in European ancient ruins, proving that Amazons, the Greek female warriors, were real. Some people think early human years were peaceful, but fights broke out and disrupted it, and women were active in these conflicts in every way men were:\n\n>Where they had power as rulers or in ruling families they often instigated and proclaimed wars and even marshaled their troops as they went into battle. They incited men to ferocity at the fighting fronts. They accompanied men on marauding expeditions. They fought in the ranks. They took up arms to defend their homes. They nursed men on battle fronts or kept households going while men were at battle, and they looked after the wounded on their return to civilian life.  \n>  \n>There was not a type of war in which women did not participate. They were among the primitive hordes which went on looting expeditions against their neighbors or stood fast on their own ground in defense of their lives, herds, and fields. Old Roman records testify to the savagery of women in the Cimbrian tribes that swept down from the north into Rome. Among the Cimbrians, priestesses took charge of war captives. Standing on ladders which they carried with them to battle, they cut off the heads of prisoners, caught the blood in pots, and gave it to their men to drink, in the belief that it would double their strength.\n\nAncient women also initiated or inspired military efforts to subjugate others. Alexander the Great's militant Epirote mother, \"a priestess to whom his father, Philip, had been attracted when he saw her as a maiden prancing to or from a temple with a snake, a god symbol, held high in her arms, and attended by a procession of other maidens\", drove Alexander to become the master of the world. In most of Europe in antiquity and even during Arabia when Islam spread and people declared war against the Muslims, women fought at war. Even Muhammad had his female warriors who teamed up with him.\n\n**Women did influence politics, economics and social change historically.**\n\nFeminists argue women were forbidden from politics. Not exactly. While people were serving in the government were men in many societies, it's because they believed those who fought for our country were the ones allowed to form the government, but not all societies only sent women to war. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), in almost all countries, originally, neither men nor women could vote, and they usually granted suffrage to both concurrently. In some countries, they originally granted it men, then later women. In the US and UK, men originally could only vote if they owned property, and only 3% of British men and 6% of American men did (women were never property). In 1828 during the presidential election, the vast majority of states gave all men the right to vote, but it wasn't in all states until universal white male suffrage was given to men in North Carolina in 1856. Later on, women were given the right to vote more and more. It was simply because men served in the military in the US back then, not because women were considered inferior.\n\nNonetheless, women DID influence politics historically. Not voting didn't stop this, [and many women were originally against the right to vote](https://www.societyforhistoryeducation.org/pdfs/M15_Miller.pdf) because they worried it'd take away their soft power in influencing politics. In fact, many men supported their right to vote for equality, and while people who supported women's suffrage thought it was unfair they couldn't vote, people who opposed it worried that women had more power influencing politics than men because the government responded to women's needs more while men just cast in a vote that only wins if it's the majority opinion. Susan B. Anthony said women's suffrage laws \"probably never would have passed if it had been up to women to vote on them,\" and that men were actually more progressive about women’s suffrage than women were (1902). This [thread](https://www.reddit.com/r/MensRights/comments/15ac3xy/women_did_influence_politics_before_suffrage_and/) of mine elaborates on how women influenced politics easily before voting.\n\nContrary to what feminists think, laws weren't created based strictly on the opinions of men. Only 1% of men worked for the government, and they usually made laws based on what they thought was best for the land or its people, but not for men. Totalitarian leaders might be all about themselves, but certainly not men either. Women's opinions mattered a lot to men. [In fact](https://presidentlincoln.illinois.gov/Blog/Posts/141/Abraham-Lincoln/2021/8/Lincolns-avoided-duel/blog-post/), [Abraham Lincoln](https://www.battlefields.org/learn/articles/abraham-lincolns-duel) even used female pen names pretending to be a woman to attack political rivals, including James Shields.\n\nAlongside speaking against recent policy decisions made by Shields, Lincoln implied that his opponent was weird and unpopular with women.\n\n>*\"His very features, in the ecstatic agony of his soul, spoke audibly and distinctly – 'Dear girls, it is distressing, but I cannot marry you all. Too well I know how much you suffer; but do, do remember, it is not my fault that I am so handsome and so interesting.’”* \\-- Rebecca (Abraham Lincoln)\n\nLincoln's wife also wrote several letters against Shield under a female penname. Lincoln apparently consulted with her about his letters to make them sound like a woman wrote them. What does this mean? Women were seen as pure and moral compared to men, so their voices mattered a lot in politics, and because they couldn't vote, they were seen as fair and reasonable. **This is why women often opposed the right to vote, because they worried it would prevent them from being influential in politics.** If the 1800s were so patriarchal, why would he have used a female penname to pretend that a man was unpopular with women to destroy that man's career?\n\n[Moreover](https://daily.jstor.org/women-against-womens-suffrage/), Catharine Beecher, an advocate for women’s education and economic advancement, argued that women were most effective when they united to press their fathers, brothers, and husbands for reforms in terms that rose above intense partisan politics. Using anecdotal evidence, she pointed to her sister, Harriet Beecher Stowe, whose [*Uncle Tom’s Cabin*](https://daily.jstor.org/frederick-douglass-feud-over-uncle-toms-cabin/) had contributed to anti-slavery sentiment in the country, selling quickly before the Civil War and humanizing enslaved black people. It changed American's views of enslavement at the time, especially in the North. Another example was the women’s clubs that fought for pure food laws, [compulsory schooling](https://daily.jstor.org/why-would-parents-oppose-compulsory-education/), and other reforms that were easily framed in terms of maternal care.\n\n[Women influenced politics in many other ways, too](https://americanhistory.si.edu/blog/5-ways-women-influenced-politics-they-got-vote). In the 1800s, men and women flirted at political rallies and met their potential spouse. Politically-charged women charmed men into supporting certain political views, especially first-time male voters. In his new book *The Virgin Vote*, Smithsonian political history curator Jon Grinspan explains that women even \"turned down marriage proposals specifically because of a young man's political affiliations.\" These actions pressured husbands and suitors to vote in favor of a woman's views.\n\nCarry Nation, a female leader in the Temperance movement, used to use hatchets to smash saloons. Churches and theaters paid her to against alcohol. In the Victorian era, if a man smashed alcohols, he'd be stabbed, but men were chivalrous towards women and refused to harm her. Many people laughed at her, but respected her integrity for her beliefs anyway. Carry's radical approach helped launch the Temperance movement into mainstream American politics.\n\nEven in medieval times, women teamed up with Prophet Muhammad to fight off aggressors against Muslims and helped spread the message of Islam. Women in medieval Europe brought discussions and disputes about moral, societal, or religious issues.\n\nWhen wars happened over the centuries, wars of conquest, defense, crusades, or self-defense did not exclude women. As long as the Eastern Empire lasted, women were involved in situations that led to war. As the empire declined and feudal wars happened for imperialism, women in aristocracies and royal families inspired and initiated wars, and sometimes used their own weapons. They built the state of Western worlds which turned local conflicts into global wars, assisted by women. For centuries in the West and East, imperial power only was ostensibly (but not exactly so) bestowed to men who were head of a family. In reality, official or not, his power was shared by women. Imperial power was often exercised by one or more women. Even in Ancient Rome, the state had lots of power among its women. Beard cited:\n\n>Among such studies of ancient Rome are the 1,124 pages of the old work by J. R. de Serviez, *Roman Empresses ... Wives of the Twelve Caesars,* first published in the eighteenth century – an age of despotism in Europe; and G. Ferrero’s *Women of the Caesars,* published in 1911 when the power of European family clans was rapidly dissolving.\n\nOther wars/conflicts, like the Renaissance, the restoration of the Bourbons, War of the Spanish Succession, War of the Austrian Succession. As medieval Europe was developing, in rural families, men and women worked together almost consistently, and the woman kept the family and its land and house economy going while husbands went to war in England. In royal and aristocratic families in England, women used force in the state of affairs and in the management of the economy helping the monarchy. It wasn't until the the 18th century in England during revolutions destroying the royal/aristocratic families founded on wealth did women and their families in these groups lose power and the parliament and government became solely men. As time went by men, men were the ones serving in military, and they decided men thus would be the ones allowed in the government, but women had soft power in influencing politics as mentioned earlier, which is why people worried giving them the right to vote would get rid of that subtle power. This change happened especially in the French Revolution. In the 1800s, more and more women suffragists were appearing, but men also struggled with the right to vote beside the low minority who had property and thus qualified. In the most progressive societies, women received the right to vote before men's universal suffrage appeared in other societies. Before this point, there were women were highly involved in royal/aristocratic power over influencing politics and society. \n\n[Up until a couple centuries ago](https://www.cracked.com/article_20186_6-ridiculous-myths-about-middle-ages-everyone-believes.html), Europe was agricultural. In medieval Europe, if a father was owning a shop or tavern, his daughters were the ones helping. If her dad became unable to, she sometimes took over the business herself if he was now unable to, which didn't really happen until later in modern times. Women also generally ran taverns in medieval Europe, and [women in England ran the entire beer industry back then](https://books.google.com/books?id=c6MQJ-pdbwAC&lpg=PP1&pg=PA3#v=onepage&q&f=false). Women who didn't run taverns or grow crops often joined convents, and when education was rare at the time, it gave these women access to education. Thus, nuns could read or write in an era where the most powerful kings couldn't. [If women could eventually rule of a house of nuns, they could reach position of power very similar to a male lord, or even slightly higher, seeing as how they technically reported directly to the King of Kings and whatnot](https://web.archive.org/web/20100215224014/http://www.bl.uk/learning/histcitizen/medieval/women2/medievalwomen.html). Sometimes, in monasteries, the abbess had seniority over monks. Outside monastic walls, women could wield political power, especially as queens and regents who exercised royal authority when their husband or underage son was unavailable. A number of powerful queens can be noted in English history, of whom one of the most remarkable was Queen Isabella (1295-1358), who (in collaboration with her lover, Sir Robert Mortimer) ended the rule of her husband, Edward II (1284-1327).\n\n[Even in the Middle East](https://anthrosource.onlinelibrary.wiley.com/doi/pdf/10.1525/ae.1974.1.3.02a00100), women DO influence politics and society. They do it from private positions, and exercise influence over men, by being mediators in natal or affinal groups in marriage alliances, wielders of authority in the domestic sphere, educating their children, or controlling products or property. Women form kinship groups, act as \"data brokers\", mediating social relations in family and society. Women also notify men in their household about what happens in other homes and in extended family. Women also, despite being segregated by sex at times, join with other women in forming solidarity groups and spreading social influence. It helps cause political influence and raises her social status. Women also can influence men's behavior by spreading rumors or gossip, writing mock songs, and spreading social influence to boost or ruin his reputation, especially in social and political issues. Women there might not be in the government, but men rarely make it in the government, and women have so much widely ignored soft power in influencing society and politics, but feminists don't realize in some countries where dictatorships occur, they won't always get what they want, but some of the women's opinions there ARE socially conservative. Women there do influence how people think there and eventually these countries will lose their social norms if people figure their way around their countries' domineering government.\n\nWe have laws pandering to women, including battered women's shelters, campaigns and organizations for women's health, laws against violence against women, etc, but while these politicians are men, they don't make these laws for men. People have always responded to women's soft power historically and politicians' success depended on his support from women more than from men. Men weren't always able to vote historically, but when men served in the military more, they were given the right to vote, but women were still granted soft power that made more changes than mere marks on ballots that only won if a majority. That's why suffragists were originally a minority, but still managed to spread enough influence to become a majority.\n\n**Women were not excluded from history from men, but by feminists.**\n\nIn Chapter 12, Mary Beard wrote:\n\n>Certainly the original sources, which scholars use for the study of men in long and universal history, often mention and even recount stories or give elaborate data of many kinds about women. For example, Herodotus, whom historians of the modern age have called “the father of history,” deliberately included women in his history. Tacitus, the Roman, also observed and commented on the women of his time. Indeed ancient writers in various societies often thought it necessary to consider women and among their works are to be found statements respecting women’s force of character, learning, physical energy, military and political power, and creative intelligence – statements made by the contemporaries of such women.\n\nSo obviously, writers and historians didn't exclude women and even wanted them included. Mary Beard wrote in her book that the idea that women were men's subordinates and were forbidden from contributing to society is one of the biggest myths told in history. Feminists have erased the fact that 40% of slave owners in the US were white women and that women had soft power or even before the 1700s, had royal and aristocratic power, and promoted myths that women were property, were expected to be asexual beings even in marriage, were allowed to be beaten/raped by their husband, or were violently hated. Feminists probably originally removed women's contributions to society from history. Then decades later, feminists wanted to educate society about women's contributions to society they claimed were erased by men because they are clueless about what the first wave feminists did.",
    "title": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed.",
    "subreddit": "MensRights",
    "timestamp": 1700510201,
    "score": 127,
    "keyword": "woman nurse"
  },
  {
    "text": "Does society actually live in a rape culture? Debunking the myth that society is pro-rape. **Statisticians exaggerate how pro-rape society is.**\n\nStatisticians will conduct research on attitudes towards rape, including comparing date rape and stranger rape. When they see an increased likelihood of victim blaming, even if the rate of victim blaming is still low, they conclude: people tend to victim blame date rape victims. Let's look at what the data really shows.\n\nThis [study](https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1559-1816.1994.tb01571.x) from 1994 showed that yes, participants were slightly more likely to victim blame date rape victims or were slightly more likely to relate to a date rapist than stranger rapist, but they usually didn't victim blame date rape victims or relate to date rapists. Scores for victim blaming ranged from 5 to 19.\n\nhttps://preview.redd.it/dlbrlinoab9c1.png?width=498&format=png&auto=webp&s=6d371ded7dd06328c8e5d0d97b9ea6dd22e351ec\n\nThis [study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6818332/pdf/TPPL_24_1315787.pdf) when looking at drunk rape victims, and acquaintance rape victims, found that people usually didn't victim blame that much, but the mean probably would've been lower if it wasn't for outliers. They ascribe high blame to rapists. This [study](https://e-space.mmu.ac.uk/620036/1/Victim%20blame%20nurses%20revisions%202018%20%281%29.pdf) found that although nurses blamed acquaintance rape victims more than stranger rape victims (but usually didn't blame either), general people blamed stranger rape victims more, and had some degree of blame on average but not a high degree, but low victim blaming towards acquaintance rape victims. In this [study](https://link.springer.com/content/pdf/10.1007/BF00289907.pdf), while participants did ascribe a disreputable qualities to a date rape victim or acquaintance rape victim a little bit, they usually didn't do it to a high or even somewhat high extent. Male participants ascribed a medium amount of provocativeness to female rape victims if it was someone the victim knew or dated. Participants did not ascribe much carelessness to female rape victims. Male participants did ascribe some degree of failure to control the situation to female rape victims who were raped by someone they knew or dated but this could be because they don't think someone can control how to act with someone they date raping them. Both male and female participants viewed rapists as accountable but had mixed feelings on average about whether they had an excessive libido or misunderstood the situation. People took rape more seriously than proposition. This [study](https://bpspsychub.onlinelibrary.wiley.com/doi/abs/10.1111/j.2044-8333.2012.02044.x) found that people blamed stranger rape victims more, especially people who believed in the just world fallacy, but women who believed in the just world fallacy especially victim blamed stranger rape victims. Overall, as long as you didn't believe in a just world, people didn't blame rape victims, but men who believed in a just world engaged in moderate victim blaming.\n\nThis [1980s meta-analysis](https://sci-hub.wf/10.1111/j.2044-8309.1992.tb00975.x) found that although people did view rapists as less guilty or rape victims as more responsible when they were promiscuous, they had mixed feelings on average rather than all or nothing, but these effects reduced when looking at a woman of any sexual history raped by a partner. This could be due to society thinking promiscuous women are easy and would say yes to any offering of sex, rather than being pro-rape. In fact, this seems to be usually what leads to people thinking rape didn't happen or that she was at fault. Nonetheless, they often ascribed high responsibility to rapists and low-moderate responsibility to rape victims. They also found mixed evidence that women would victim blame less than men, with some evidence showing no difference.\n\nThis [study](https://sci-hub.wf/10.1177/0146167282083013) found that participants ascribed 70.3% of the responsibility to the rapist, 17.6% to the situation and only 12.1% to the victim. When offenders were drunk, 63.7% (majority) of the blame was ascribed to them, 23% was ascribed to the situation and a low minority of it was ascribed to the victim. Even when victims were drunk, they only shared 12% of the blame from participants. It didn't make a difference in how they perceived the victim in terms of blame. On a scale of 1 to 7, a drunk victim was given a responsibility rating of 2.75 vs. 2.34 while sober. The victim's intoxication did not affect responsibility ratings given to the offender, but drunk offenders, on a scale of 1 to 7, were given a 6.11 vs 6.37 when sober. In other words, people usually viewed him as very responsible, but there might be some people who view him as somewhat responsible. Participants gave a likeability of 1 to 7, a 4.54 for drunk victims vs 5.10 for sober victims and viewed them as somewhat moral (4.78) on average compared to decently moral (5.47) for sober victims. In other words, they usually still hold the rapist accountable and not the victim, and they might view a drunk victim as a bit of a junkie, but they don't outright dislike her. The vast majority of participants believed the offender should be punished and the men advocated longer sentences than the women. Although the women endorsed slightly lower sentences if the victim was drunk, for drunk victims, they endorsed a 12 year sentence on average for the rapist whereas the men still advocated the maximum sentence they were allowed to answer with.\n\nThis [study](https://link.springer.com/content/pdf/10.3758/BF03330577.pdf) finds that although men did find seductively dressed raped victims not that responsible nor irresponsible for what happened on average, they viewed modestly dressed victims not responsible. Female participants viewed both as irresponsible for it. Usually, people still held the rapist responsible even for a sexily dressed woman.\n\nHere's a [survey](https://www.bbc.com/news/uk-england-47652050) showing not only do most people consider rape unforgivable, but people are more likely to forgive a murderer than a rapist. The only criminal people found less forgivable than a rapist was a child abuser.",
    "title": "Does society actually live in a rape culture? Debunking the myth that society is pro-rape.",
    "subreddit": "MensRights",
    "timestamp": 1703912030,
    "score": 102,
    "keyword": "woman nurse"
  },
  {
    "text": "Domestic Violence: Who Speaks For Men Abused By Wives?  Everyday men abuse women. Until in recent years, such abuses went unreported. Nowadays, due to advocacies by gender activists, violence against women and girls now feature more prominently in the media.  \nEven with the level of publicity that it receives, gender activists insist that gender-based violence remain largely under-reported.  \nIn a twist of fate violence against men by their spouses are rarely reported nor even mentioned in public.  \nIn some instances, women are known to have murdered their husbands due to one grievance or another. Infidelity features frequently in such cases.  \nFor instance, in January 2020, a High Court of the Federal Capital Territory, Abuja, on convicted and sentenced Maryam Sanda to death by hanging for killing her husband, Bilyaminu Bello.  \nDelivering judgment, Justice Yusuf Halilu said every available evidence had proved that Maryam ‘fatally‘ stabbed her husband to death in Abuja on Nov. 19, 2017.  \nSimilarly, Symphorosa Otike-Odibi, a Lagos-based lawyer, was in 2018 murdered by his lawyer wife, Udeme for having extra-marital affairs.  \nUdeme on May 3, 2018 allegedly stabbed Symphorosa, to death and mutilated his corpse by cutting off his genitals at their Diamond Estate, Sangotedo, Lekki, Lagos home.  \nShe claimed that whenever she raised the issue infidelity with him his responses were not satisfactory and nonchalant.  \n“When I returned to where the deceased was, I hit him on the head with the frying pan and continued to hit him on the head and used the knife to stab him in his abdomen”, she said.  \nAlso in 2018, Rachael Adetsav, killed her husband and three children, she was said to have been having issues with her husband, which culminated into killing him and the children.  \nAdetsav was said to have killed her husband and immediately rushed out of their apartment to smash the victim’s car before she committing suicide.  \nIn February 2019, a 19-year-old girl, Mary Adeniyi, was arrested by police in Lagos for allegedly stabbing her husband to death.  \nAdeniyi, a nursing mother and her husband, Solomon Nduka, 30 had a fight over alleged infidelity.  \nHe allegedly stabbed him on the neck region with a knife which prompted neighbours to rush him to a nearby hospital. He later died.  \nAlso, in 2012, Hadezia Abutu (nee Afegbua), was accused of killing her husband, Ibrahim, just two days after a new wife was welcomed into the family in December 2011.  \nShe was said to have allegedly shot her husband, Ibrahim, in their Wuse II, Abuja residence just two days after Ibrahim married another wife.  \nBefore he died he informed his younger brother, Obotu, that he had been shot by his wife, Hadezia.  \nMrs Titilola Vivour-Adeniyi, Coordinator, Lagos State, Domestic and Sexual Violence Response Team said men have difficulty reporting incidents of assault by their partners, a situation she attributes to cultural norms.  \nAccording to her, patriarchy is an enemy of everybody because it keeps people in silence.  \n“From a young age, males are not allowed to express themselves when they are experiencing trauma and that lingers on to adulthood”, she said.  \nShe said between January and June 2021 there were about 194 reported assaults by wives against their men in Lagos state alone.  \nFagbohungbe Oni, a professor of psychology, University of Lagos, said that one of the most common attributes displayed by a potential killer-woman display is destructive tendency.  \nMr David Aloysius, a psychologist said domestic violence is committed mainly against the women but recent events show that women as also perpetrate violence against their husbands.  \nAloysius said some men are daily being beaten, subjugated and traumatised by their wives, adding that most of the abuses go unreported.  \nThis according to him is because of the notion that the man is always superior to the woman in terms of physical strength.  \nHe said while the ‘norm’ was men abusing their spouses, the table seems to be turning against men as they now face regular abuse in the hands of their women.  \nHe called on gender right advocates to beam their searchlight on the plight of men who are under the subjugation of women.  \nAloysius said that domestic violence involving wives physically assaulting their husbands was assuming a dangerous dimension.  \nHe said some wives not only beat up their husbands to stupor but kill them in some cases.  \nAccording to him, though men are naturally perceived as being mentally stronger in some instances the reverse is the case.  \nDr Kehinde Samuel, a psychiatrist, said domestic violence could be drastically curtailed through counsel and mental evaluation of potential couples.  \nIt is gladdening to note that the law has not spared women brought before it for abusing their spouses.  \nHowever, analysts say it is necessary for stakeholders to make conscious efforts to bring to the front burner that plight of thousands of men suffering in silence from abuse by their partners.",
    "title": "Domestic Violence: Who Speaks For Men Abused By Wives?",
    "subreddit": "MensRights",
    "timestamp": 1688347941,
    "score": 33,
    "keyword": "woman nurse"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 18,
    "keyword": "woman nurse"
  },
  {
    "text": "Parenting Is this unsanitary and is it normal that a mother who is a nurse does things like this to the younger daughter and not the older son? As a Father/Step Father is it wrong to feel Enraged because you observe your  daughter(3yrs) gets treated differently. Btw the Mother never takes accountability and ⛽️ 💡, and points finger whenever it’s time to say I screwed up? Btw Im not perfect but things like this is only the tip of the iceberg. She also tries to let the step son who’s 8 and I’ve raised since 2 be the Man of the house with no recourse for bad behavior. Literally will physically attack you if she doesn’t like how he’s chastised but will yell and scream at the 3 yr old who’s copied her brother and parents  to a T(which Dad tried to stop). Dad can’t leave out of fear for lack of care, and attention to detail to his child.She won’t “mean” for anything to happen but it always will as usual.  Dad is also on the brink of sincerely losing his mind in said woman….please advise Sn:I said nothing and just fixed it, no need for arguments first thing(been there but try not to)",
    "title": "Parenting",
    "subreddit": "MensRights",
    "timestamp": 1696941913,
    "score": 15,
    "keyword": "woman nurse"
  },
  {
    "text": "Am I wrong to be annoyed with something our couples therapist said? **Update**\nWe will be finding a new therapist. We have already started reaching out to some female therapists our age/younger. Thank you everyone for your kind words and support. \n\nSide note: If anyone has recommendations for someone in NC that would be great. \n\nMy husband read through everyone’s comments and when we talked more he now understands what I was trying to say and that it isn’t that I was trying to keep him from getting recognized for his contributions to our family but rather that it isn’t right in general for only men to get praise for parenting, but even moreso in the context of a marriage counselor for a couple that is intentional about having an equitable distribution of labor in all areas of our relationship. \n******\n\nMy husband and I, both 32, started seeing a couple's therapist, (m, \\~60 yo) about 2 months ago. For some general background, my husband and I have been together since we were 16 and married for 6 years. We have a 3 yo and a 6 month old. We are overall very happy, we are best friends and are committed to breaking generational trauma for ourselves and our kids' sakes. The reason we started seeing a therapist was more of a maintenance/care thing than for any huge glaring issue.\n\nSo the comment in question was when I was telling our therapist about our overnight routine with the baby. Baby is breastfed so I wake up to nurse him as needed overnight. My husband sleeps while I nurse and then I let him know when I'm done nursing and he does diaper change and puts baby back in his crib. For some context that will be relevant in a bit, I nursed our first for 2 years and my husband didn't do this with him, this is something I asked him to do with this new baby because it seemed more fair than how things were the first time around. \n\nSo, back to me telling the therapist how I hand off baby to husband to change his diaper and get him back to sleep after I nurse him. His jaw dropped and he was offering all kinds of praise to my husband. He then asked me \"have you thanked your husband for how he helps you at night?\" I said I do, and that I'm grateful to have a husband who helps share the load of taking care of our children. Which is true, I am grateful. But the more I think about it the more his comment rubs me the wrong way. Why is it only me that needs to be grateful for my husband's contributions in caring for our baby overnight? I am also waking up and taking care of the baby. How come he didn't ask my husband if he has thanked me for what I do? It just seems so taken for granted when I do it, but when a man helps all of a sudden I need to jump for joy. After therapy, I shared how I feel about this with my husband I really thought he'd agree with me and see how sexist the therapist's reaction was, but he doesn't see it?! He agrees with the therapist and is now mad at me for making it all about me and feels like I'm trying to steal his spotlight. My thing is, we either both deserve praise for the way we take care of our baby overnight or neither of us deserve praise because we're just doing what is our responsibility. But it can't be praise for him, and none for me because I'm just doing what I'm supposed to.\n\nAm I wrong to think our therapist's reaction was rooted in sexism and traditional gender expectations? Does it not highlight the way a woman's contributions to her family are undervalued? It's become an ongoing argument between us, I am starting to feel like it's the therapist and my husband against me since this is not the only comment of this type he's made.",
    "title": "Am I wrong to be annoyed with something our couples therapist said?",
    "subreddit": "Feminism",
    "timestamp": 1692177908,
    "score": 1612,
    "keyword": "woman nurse"
  },
  {
    "text": "I'm tired of men mistaking basic human decency for flirting Edit: whoever gave me my first award (!) and said they fucking hate what is happening and fucking love F1, you’re a gem \n\nUpdate for a mild rant: today I was talking to a couple of the other ladies in my class during break. One of them mentioned they love car racing, so I asked if she watches the F1. The other lady said “oh Jordan told me you like F1” and I was like wtf how would they even come up?? I forgot to ask her what context it was in but I definitely will on Friday (I think I’m going to tell her about it). Today in labs we tried out using a peak flow meter, which is a very phallic looking long tube thing you need to put your whole mouth over and forcefully blow into. Before I realised how it looked, I had a go facing the others and saw him watching me so I quickly spun around and faced the wall. Later he asked me how to do it (instead of asking the teacher) and wanted me to show him, obviously I just explained it and said “here’s the instructions”. He kept laughing at my jokes when he wasn’t even part of the conversation. I don’t think I spoke to him today other than like “excuse me” and he was very moody all day, idk if that had anything to it. It’s 50% lol and 50% wtf\n\n\nI (28) started in a new uni class for nursing about 3 weeks ago and there's a guy (22) who seems to assume I've been flirting since the very first day. He made a strange comment about my Blundstone boots (pull-up tradie boots in Aus) saying he hasn't seen them since he was a kid, which is strange considering they are very common. That's not to do with him flirting, but just a weird tidbit. Also, he's brought it up my boots twice.\n\nI'm only doing 2 units with this class as I have a bunch of credits. He messages me about assessments that he and the whole class know I'm not doing rather than asking in the group chat. The first time he messaged, he said he heard me saying I like naps (who doesn't) and wanted \"advice on how to nap\". I told him to get chronic fatigue and that will help wonders lol. Another time, I told him about ChatGPT and he keeps asking how to use it rather than googling it. A couple of days ago during break, he asked me to show him how to do custom instructions. I just told him what to do, and he went, \"okay. doesn't matter then.\" and walked off. \n\nLast week we had a 1 hour break between labs and class so I decided to drive up to the shops and get lunch. He saw me walking out and asked where I was going. When I told him, he said \"do you want some company or would you rather be alone?\" which is such a loaded question because how do I say no without it being weird? He went on saying he doesn't want to sit alone on his phone like everyone does and was super mopey. I couldn't think of an excuse quick enough so I said sure. I had planned to eat out but got takeaway so he wouldn't think it was a date vibe. He asked me so many things about my life, like where I grew up and went to school. He thanked me like 5 times and I was like sure no biggie, because it really isn't. He said it again at the end of class in front of everyone and put his hand on my shoulder. I see him looking at me from the other side of the classroom *all the time*. The other girls in my class are mostly 18-19 and stick together, but they're still nice, so I'm the only woman who really speaks to him. \n\nI'm dreading the moment he either asks me out or gets mad that I'm not showing interest because the whole class will pick up on a vibe and it will be so strange. I know I shouldn't have to lie about having a partner, but it's the only real option without making things extra weird for the next 18 months. He probably won't believe me anyway but at least that will hopefully get him off my back. He 100% has an incel vibe which makes everything worse.\n\nI just want to be left alone. Class isn't a place to pick up girls and it will never end well unless you're soulmates. I want him to act the same around me as he does with the other guys and the 40yo lady in my class. I don't want there to be a weird vibe in my class or have him mope around and be salty to me for the foreseeable future. I'm going to ask my lecturer not to pair me with the guys for the labs where we have to touch each other, especially for manual handling when you have your hands on the person's butt and lower back. I don't think mentioning him in particular is a good idea. \n\nThis happens to me *so much* because I'm very friendly and polite, and have basic human decency. But of course it always comes back to bite me in the ass because men can't seem to grasp the fact that women can be nice without being interested. Ugh.",
    "title": "I'm tired of men mistaking basic human decency for flirting",
    "subreddit": "Feminism",
    "timestamp": 1693813802,
    "score": 646,
    "keyword": "woman nurse"
  },
  {
    "text": "Doctors, consent, and infantilizing senior women My 86 year old mother is in the hospital and from the first day her 40ish WM doctor has greeted her as if she’s a child. She has all her faculties (not that her having dementia would excuse his behavior) and yesterday she complained to me that every time he comes in her room he pinches her cheek and says “aren’t you so cute.” \n\nI was shocked and told her to tell him to cut it out if he tried it again. She has no trouble standing up for herself, she’s at an age where she’s not willing to take any BS. So today when he tried to pinch her cheek she told him not to touch her. And he said it was part of his “exam.” She told him she knew damn well it wasn’t and to cut it out. \n\nI spoke with patient services, her nurse, and the charge nurse (and the charge nurse’s assistant who had witnessed the incident this morning). Every woman I have described this to has had the same reaction: wincing, a look of disgust, and an eye roll. They have agreed that it’s inappropriate and I’ve asked they have someone explain to him that it’s condescending, infantilizing, sexist and especially annoying for someone who doesn’t feel well to begin with.  They have agreed to speak with him and have someone with him on his rounds tomorrow (his last shift this week) so he doesn’t make my mother uncomfortable.\n\nI guess I’m wondering is this a common issue? I’ve had bad doctors before…and even one sexist doctor who refused to speak with me without my husband present. But never one that treated me like I was a toddler. Or one that needed someone to explain consent to them. I’m sure there’s a whole host of issues that happen to seniors and especially senior women, but this seemed really weird to me.",
    "title": "Doctors, consent, and infantilizing senior women",
    "subreddit": "Feminism",
    "timestamp": 1683495826,
    "score": 83,
    "keyword": "woman nurse"
  },
  {
    "text": "Feminism and trust It seems like often times no matter our knowledge, qualifications, intelligence and expertise  all of this is questioned. I am getting really burned out and jaded from experiencing this from all sides. From men, I am tired of the 'well actually' and to these guys most of the time ' I have already considered your well actually' so 'well actually' back at you. I am a medical doctor and that already getting assumed to be a nurse (no offense to nurses I am just not one) whenever I say I work in healthcare or by patients. I have also been called 'little girl' (I am in my 40's but maybe look sorta young) by patients and asked to see the real doctor. I have 4 degrees, publications, a CV, and a whole bunch of stuff but sometimes this stuff just gets to me and I feel big imposter syndrome. On the other side, my community is pretty traditional where the gender norm is to for women to remain housewives (also nothing against housewives) and have several kids. Women can be the strictest enforcers of this sexism in this setting, I am assumed to be a lower women because I am not meeting these expectation let alone I am unable to have children due to infertility which is also shamed in this community. I never step in with parenting stuff but there have been times when they ask me medical questions but then it 'well I dont think you know more than me' 'will cut me off when I try to explain something after being asked' and recently ' one of their daughters was having some pain in her arm and it was getting worst' 'the girl asked me a question her pain' I asked if it was getting worse and then they quickly said ' it is not not a big deal just take some ibuprofen and stopped the conversation' a few days later the problem turned in a bigger problem and the girl had to go to see the ER urgently.  \n\nThis is a complex issue, and I want to be responsible and not be overstepping my bounds or making others feel less than but then I also feel this constant feeling like ' women shouldnt be doing this ' you cant be accomplished if you are a woman and if you are you arent allowed to feel like you are' ' women arent allowed to be intelligent and if you are be quiet'. Like it feels like there is no trust that we are capable of thing we have achieved, and as in the case of this traditional community I am breaking some sort of taboo just by existing and doing what I do. I am really really burnt out about this, I kind of wish I could live alone in the desert with goats or something.",
    "title": "Feminism and trust",
    "subreddit": "Feminism",
    "timestamp": 1675718743,
    "score": 68,
    "keyword": "woman nurse"
  },
  {
    "text": "Want to become infuriated? Listen to this podcast about a male  doctor who unnecessarily did hysterectomies and ovary removals on women in for profit ICE prisons. \n\nIf you want to feel inspired, listen to the incredible nurse who blew the whistle. Brave woman with a good heart. \n\nhttps://spotify.link/DQVDOFBOkDb",
    "title": "Want to become infuriated?",
    "subreddit": "Feminism",
    "timestamp": 1695494813,
    "score": 24,
    "keyword": "woman nurse"
  },
  {
    "text": "Tales of a queer woman: IUD and endometriosis A woman got her first IUD; not to prevent pregnancy. She does not plan on having intercourse with a man anytime soon as she has branded herself as queer. She didn’t start birth control for her boyfriend or significant other, or start it in her teens to regulate her period. She was alone in this decision. What reason did she undergo this notoriously painful procedure? She did it because of her endometriosis diagnosis. The pain of her periods has been debilitating and has landed her in the ER two times. The most recent episode left her collapsed in the woods, hiking on a particularly hot day. She felt that her body betrayed her in her favorite place in the world. Of course, the first time she went to the ER she was left with nothing, but debt and little to no answers other than a possible kidney stone. This time around, she was determined to have a solid answer to what the hell was wrong with her. Based on her symptoms, endometriosis was the likely diagnosis. Although there is no easy treatment for this disease, birth control was screaming loudly and waving vigorously from the back row like a proud and boisterous mom at a high school graduation. It was something she was trying to avoid all of her life because of the countless horror stories of weight gain and women feeling out of control of their bodies and minds. Also, is it an anti-feminist decision to start birth control? As a developing feminist, she supposed it was… depending on the context. She has always been against medications and unnatural things. Now, she had to consider if it was worth having another endo episode or ending her ongoing avoidance of birth control. There is peace of mind that if she were to be r\\*\\*\\*d, the likelihood of an unwanted pregnancy has been significantly reduced. The world she lives in and the men she lives amongst might make any conscious woman consider these thoughts. \n\nWhen she initially sat down with her gyno, he mentioned that there is no actual cure for this disease other than contraception or pretty invasive surgery that might help for a short time. She was hesitant to start any contraception and wanted to do more independent research. This led her to the Planned Parenthood website where she concluded an IUD would be best. She made the decision to schedule an appointment within a week. Falling down the Reddit rabbit hole, she divulged in the horror stories about how painful it is to have an IUD inserted. Not only is the insertion expected to be painful, but the pain and discomfort that follows are expected to linger for 3 to 6 months. Periods might or might not happen. Who is to say, what is she to expect since it seems everything is on a case-by-case basis?\n\nThe day of her appointment arrived, and dread sank. Her overactive stomach began to churn. The kind female nurse whom she had met once before prompted her to pee in a cup to run a quick pregnancy test since it is their policy. After peeing in a cup, she entered the examination room stripped down her lower half, and covered herself with a blue paper sheet. Staring at the tools that lay before her, nausea resonated throughout her body. Her male gyno, which she had seen once before, although she was hesitant to have a male associated in any way with her womaness, entered the room. He discussed the possible malfunctions of having an IUD, which made her sick to her stomach. She asked how long the procedure would take. “It should take about 3 minutes, he said.” “That’s it? I thought it would be ten minutes or so,” she felt some sort of relief. “It might feel like ten minutes,” the gyno said jokingly. He mentioned that there was a numbing agent available that might help to alleviate pain during the insertion. She decided against it because of her finances and the likelihood of it even working or being worth it since the injection of the numbing agent is painful in itself. The time had come to lay down on the table with her feet in the stirrups. She felt like she was submitting her body to a medieval torture device to have her insides ripped out. Her male gynecologist and female nurse had a kind demeanor and made casual conversation while preparing their instruments, which she knew was a way to comfort her. Within minutes, blood-curdling screams came from her in the exam room. She liked to use the word “f\\*\\*k” to exclaim her pain. She didn’t think she was saying those words, since she had dissociated into the black flecks on the drop ceiling above her. She thought of how it would be with her mom there, holding her hand. While it was some of the worst and most violating cramping she had felt, she compared it to the cramps of that time she fell in the woods. “This is nothing compared to how I felt before,” “This is worth it,” she kept telling herself. She was comparing pain levels to justify a procedure that she had never been on board with fully because she felt like this was the only option. No one should feel this much pain, with such little preparation as taking 800 mg of ibuprofen, in addition to the pain that would follow months after. She felt the room spinning and lay down for a bit in the same position on her back. The room was still spinning. The gyno asked if she would like anything to nibble on or anything to drink. She opted for water since her lips and mouth were dry as sand. The kind nurse came in with a plate of saltines and a large cup of ice water. She slowly sat herself up on the table, cloth on her lap, and pain surging through her stomach and lower back. After some small talk with the nurse, she was free to go. Standing up, she felt a change in her balance and equilibrium, like a small weight had been put inside of her.\n\nShe knew so many women who had undergone this procedure. So many women have felt this pain and had the same experience. She hoped that the other women were taken care of kindly and were listened to when they experienced their pain because this could easily be a traumatic experience. She wished that their workplaces were supportive through their healing process. She also wished that others were more on board with this process, particularly those who were also diagnosed with endometriosis, and told that BC is the only realistic solution. Not only is endometriosis traumatizing and excruciating, but so is the IUD and the stigma surrounding birth control. She waits to see how BC will impact her image and mind.",
    "title": "Tales of a queer woman: IUD and endometriosis",
    "subreddit": "Feminism",
    "timestamp": 1697386101,
    "score": 18,
    "keyword": "woman nurse"
  }
]