[
  {
    "text": "Men ruining hobby/gaming groups As the title says, I'm sick of men ruining hobby groups for me.\n\nWhen I was 7 my sister and her friend brought home some Choose Your Own Adventure books that were based on Dungeons and Dragons, and I quickly became obsessed with them, the obsession lasting throughout my childhood and teens.\nFast-forward thirty years and I started collecting them again, for the sake of nostalgia and fun - they are great to read during pandemic lockdowns and I can race my husband through them when we have double-ups of the more common books.\n\nBut the hobby is dominated by dudes. So dominated that the ratio is about 100 to 1 of men to women gamebook enthusiasts. And of course, that means there will be problems. After joining a few groups to find books I was missing, a man messaged me to tell me that he got his first boner to a magazine cover depicting a female antagonist in one of the books. I blocked him. Other guys from the group went through my facebook profile and 'liked' all my profile pics, back as far as 2015. I blocked them. I posted in one of the groups the maps I used to draw of the castles and dungeons in the books, and one guy started creepily messaging me to buy the *original* copies of the maps I drew as a kid. I also posted about how excited I was that Rhianna Pratchett (daughter of Sir terry Pratchett) had written a gamebook that was released last year, and got immediately hate bombed by sour dudes who didn't think her book was any good because she's a woman. \n\nAnd lastly, one of the guys in the biggest gamebook group posted a drawing he'd done of a woman's ass and vulva in a thong, thrust at the camera. I complained about the image, pointing out that a) it was gross and sexist and b) there are kids in the group as the recent releases of these books are marketed at teens.\n\nI was inundated with insults by the artist and his friends, then the admins of the group banned me for 'causing trouble'.\n\nWhy, why WHY the fuck can't men stop themselves from ruining hobby groups for women? All they need to do is stick to the subject matter - the hobby - and talk about that.\n\nApparently I'm asking too much.",
    "title": "Men ruining hobby/gaming groups",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630612617,
    "score": 1274,
    "keyword": "woman artist"
  },
  {
    "text": "I pissed off the mailman, and I liked it. CW: men who think it's couth to talk about women like sex objects, let alone publicly disrespect them.  Sharing here, because there's nowhere I can take delight in this win, outside of with the friend it involves.  \n\n\n I work in a tattoo studio with my co-worker (we'll call her Cheryl) and two guys (the owner and an artist we just got from LA).  While this story may have never occurred if the owner knew where to step in, I'm used to men not knowing what to do in the face of other men being asshats.  I've grown used to being the balls for myself and my friends.\n\nSo, several months ago, we got a new mailman. The first day we all met him, it was Thanksgiving and he was in sour spirits.  Of course, very nice Cheryl asked him why he was so glum.  \n\nWell, it turned out this poor guy moved to Kansas from Florida for a woman he loved.  When he got here, she left him, and he was suddenly all alone in one of the most geographically different places than his beloved Florida.  He was just drinking himself silly, all alone, and that made us sad.  \n\nSo for the next several months we began building a rapport.  Anytime he'd stop in, he'd take 10-30 minutes to gab away with myself and Cheryl. We'll call him \"Florida Man\".  At first, I thought this was really sweet.  You could tell Cheryl made Florida Man light up and that he looked forward to laughing with her.  \n\nHowever, he started giving me bad vibes. \n\n It started with how he'd start dick-nosing his mask whenever he stopped in.  He talks a million miles, a minute, and clearly the mask was too cumbersome for him.  My best friend is in his 70's.  I'd gone from being a bar fly to completely isolating myself to home and work.  Meanwhile, Florida Man goes to God knows how many businesses a day, and he's definitely not getting vaccinated.  Yet, he thinks we just love his pathogens, so he starts dropping his mask, entirely, at times.  \n\nThen, he said something about Cheryl's vagina, and I told him to watch his mouth.  He then \"joked\" about bending me over to give me a tattoo on my ass of his name.  At that point, I decided I didnt like Florida Man, but Cheryl does and as long as someone else talks to him, I don't have to.  \n\nBut eventually, he got too comfortable.  He started making some really crass remarks about Cheryl.  Mind you, he's saying these things not just to her, but loud and ostentatious enough the whole studio has no choice but to listen.  Examples include such gems \"Damn, you'd think we were fucking with how you treat me.  Do you see how she talks to me? I swear, I should be getting some.\"  \"Dont worry, ol' [insert actual name here] will give you something to walk weird about.\" and \"If I had that vagina at my disposal, you'd be in bed for days.\"\n\nI'm beginning to understand why his ex left him. \n\nWhen he would say things like this, the men folk never spoke up or told him he was going too far.  But Cheryl was clearly uncomfortable.  She got giggly in that \"I don't know what to say\" way and would try to change the subject.  I counted three days in a row he brought up her vagina and I'd had it. \n\n When he left, I asked \"Do you like the way he's talking about you?\"\n\nCheryl: \"No, I hate it.  It makes me really uncomfortable. Why can't he stop talking about my body?\"\n\nMe: \"Why don't you ask him to stop?\"\n\nCheryl: \"I don't know.  I just kind of freeze and laugh.  I know it doesn't help, but I'm not good at speaking up for myself in situations like that.\"\n\nMe: \"it's a defense mechanism.  It's not helping, but I understand what it is to be so uncomfortable you can't come up with the words.\"\n\nCheryl: \"I wish he'd stop.\"\n\nMe: \"Do I need to be your bitchy friend?\"\n\nCheryl: \"Please.\"\n\nSo the next day Florida Man came in, I got up, excused myself from my customer, and grabbed some new latex gloves.  I walked over and stood beside her silently and just waited.  He mentioned fucking her and I snapped the gloves hard around my hands and held his gaze.  I then asked him when was the last time he had a rectal exam.  He was clearly confused, and Cheryl started laughing and caught on.  We started talking about all the things we'd love to see shoved up his ass.  He left after being weirded out.  \n\nThe next day, he came in again, and brought up her sex life.  So I started asking him if he was familiar with the concept of docking.  Cheryl and I then digressed into sounding, and how cool it would be to see him with a rod up his dick.  \n\nBy the third day, he still hadn't gotten the message.  We had no incoming mail, no outgoing mail. And yet there he is, leaned over the desk making creepy eyes and comments at her. This time, he didn't even try to wear his mask.  \n\nSo I finally just asked him what he was doing here?\n\nFlorida Man: \"What do you mean?\"\n\nMe: \"I mean we have no incoming mail, no outgoing mail, and you're standing here without a mask, endangering myself, the rest of the artists, and our customers.  All so you can degrade my friend and talk about her body like a starving dog.  Why are you here?\"\n\nFlorida Man: looking to Cheryl \"Is she being serious right now?\"\n\nCheryl: \"As a heart attack.\"\n\nFlorida Man: to me \"Are you being serious right now?\"\n\nMe: \"I'm so fucking serious. Get out of my shop.\"\n\nFlorida Man: In disbelief, he looked over to our two men folk.  \"She's for real?\"\n\nThe owner:  \"You heard her.  Move on, man.\"\n\nAnd that was the last time Florida Man bothered us.  He spent three days just poking his very masked face in to see if we had mail, refusing to say a word.  For a week, he had someone else take us on his route.  Now, he's back on the route and has finally gotten the courage to step in to ask for our mail.  But all conversations are off Cheryl couldn't be happier.\n\nTLDR; my friend laughs as a defense mechanism and was being made to feel uncomfortable.  So I made him very uncomfortable and the behavior stopped.\n\nEDIT: thank you guys so much for the karma and the awards. It's nice to feel like I made a good call, even if roundabout.  As per recommendation, I've put in a complaint with USPS.",
    "title": "I pissed off the mailman, and I liked it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1621551090,
    "score": 593,
    "keyword": "woman artist"
  },
  {
    "text": "Strong Female characters in media are done so often in a way that demonizes feminine traits and I'm tired of it When people make strong Female characters in movies or games and whatnot I've noticed that their definition of Strong always involves them being hyper masculine in personality or role and it's honestly always come across as bad to me. It's always \"oh I hate makeup\" or \"oh im strong cause I have 8 brothers\" and that kind of bullshit. \n\n\n\nI'm writing a story with characters of my own and my intention is for the protagonist to be strong but also not masculinized. She's muscled, she's a warrior, and she gets shit done. But she also enjoys things that society sees as typically feminine. She enjoys putting on makeup and making herself feel fancy. She likes getting new outfits. She's an artist who likes to make stuffed animals for fun. And she does this all while being capable of winning fights against people twice her size, all so she can get home before dinner to kiss her wife. \n\n\n\nStrong doesn't have to mean masculine. It doesn't have to mean \"the type of girl who hangs out with the boys\" and shit. Strong Female character to me means a woman character that isnt helpless in the story and gets shit done without a dudes help. But I see it so often that they write woman characters that are just like... written to be dudes then changed last minute to get the attention of girls for profit. \n\n\n\nFemininity isn't bad unless it's forced apon you as a gender role. Masculinity isn't either, but strong Female characters don't have to be men in all but body. \n\n\n\nCharacters in media I think do this whole thing correctly would be characters like Moana. Travelled the ocean to demand a God fix his own bullshit, then travelled even more to fight an angry death God before slowing down and being empathetic enough to realize that the situation was different.  She's empathetic, and strong. She wasn't ashamed of crying when she needed it. Yet she was still a princess in a skirt, who was able to step up and save the world when no one else was willing. \n\n\n\n\n\nIt's just a rant and im not expecting anyone to read this but if people do then thanks I guess aha.",
    "title": "Strong Female characters in media are done so often in a way that demonizes feminine traits and I'm tired of it",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1632511351,
    "score": 521,
    "keyword": "woman artist"
  },
  {
    "text": "A man tried to do something to me last night I am a 39 year old woman, I have never feared walking alone at night, when I was a teen I had insomnia and I would walk miles and miles in the evenings trying to get tired enough to sleep. Any time I've encountered another person while out walking they've either ignored me or nodded hello and we've both gone on our ways. \n\nWhich gets me to last night. I have a dog who is an escape artist. We've installed a wired fence that pairs with a collar that corrects him when he gets too close to the fence. It works pretty well - unless something REALLY interesting is on the other side of the fence. Since we've had him neutered he hasn't jumped out of the fence. \n\nLast night I thought my son put him out, but we couldn't find him in the yard. We called and looked under all his favorite bushes and hiding spots and didn't see him. So, it's almost 11 and the dog isn't anywhere to be seen, so I grab his leash and start walking toward where he tends to go when he gets out.  I walked about three blocks from home when my partner called me - the dog had been in the house the whole time, he'd crawled under a bed I didn't think he even still fit under and was asleep. \n\nSo I turn around and start walking home. And here's where the creep comes in. I was walking up the left side of the street because there were no sidewalks in that part of the street and a man was walking the opposite direction on the opposite side of the road. No big deal until he CROSSED THE STREET TO PUT HIMSELF ON A COLLISION COURSE WITH ME. Any time I tried to angle my direction to go around him he'd side step so that he was right in front of me again. He changed direction at least 3 times to stay like that. \n\nSo I yelled at him to keep walking. And he says something along the lines of he was just trying to be friendly, so I YELLED EVEN LOUDER \"YOU WALK ON YOUR WAY OR I AM GOING TO MAKE A WHOLE LOT OF FUCKING NOISE\" and I kept walking towards my house which was less than a full block away. \n\nI don't know what his real intentions were, but I think he was trying to get close enough to me to put hands on me. I'm only 5'2\" but he wasn't much taller than me and I am pretty sure my fatass outweighed him. \n\nI got home and I was rattled and told my boyfriend what had happened. He encouraged me to call the police and report the event, I didn't want to at first but he dialed the number so all I had to do was quickly talk to dispatch. \n\nEveryone I told has taken me seriously, no one has acted like I overreacted or was being dramatic about it. I really expected to have a little bit of push back about it. \n\nAnyway, that's my story. Guy put himself in my way multiple times and I got meanly, aggressively loud with him on a residential street to get him to leave me alone. It worked and everyone I told about it has agreed that he had bad intentions and that I did the right thing. \n\nDon't be afraid of being called an overly dramatic bitch, nice is how they get close enough to mess with you.",
    "title": "A man tried to do something to me last night",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624371073,
    "score": 164,
    "keyword": "woman artist"
  },
  {
    "text": "The Gabby Petito and Brian Laundrie Traffic Stop is Fucking Me Up I know there are specific subreddits about this case and lots of true crime fans who are very fascinated by this, but I wanted to bring it up somewhere specifically with women. I just watched the Moab traffic stop and I just feel triggered and disturbed by the micro aggressions and coded/veiled misogyny. Has anyone seen it?\n\nOne thing I noticed so obviously is the amount of projection the lead officer is doing, where he is constantly relating himself to Brian, and his anxious wife to Gabby. Many people in the comments on the YouTube video are people saying how nice the officers were. And there’s no doubt that they were “nice”. But the way they speak to and about Gabby has very 1960s-hysterical-woman vibes to it.\n\nThe cop throughout the video refers to her as hyperventilating when she’s crying, and later when he’s telling her she’s not going to be charged, she starts crying again and he says “there’s no reason to be crying right now,” and later when he’s driving Brian in the cruiser he’s basically encouraging him to get Gabby on antidepressants even though he knows VERY LITTLE about their relationship. He’s projecting his own relationship on to this couple, and now that child (22 years old!) is very likely dead.\n\nI dated a man when I was 22 who I thought was a “nice guy” who was actually incredibly emotionally manipulative, and toxic, and he turned out to be a con artist who was stealing money from all of my friends. I was so anxious and neurotic the entire time we dated, because he was constantly picking fights that made no sense, and looking back, it’s just so obvious that our society creates these chasms in the ways we treat men and women. And so we behave differently, to varying degrees. But I feel that since there is no emphasis on mental wellness or psychology or defining healthy relationships, we leave young women extremely vulnerable. And then you see situations like this, where laws were designed to help women in domestic violence situations are twisted and blown out of proportion, and made huge and scary with real world consequences. And when we (women), show any emotion, the cops assume we are insane, because they also have not been trained in psychological welfare and de-escalation. \n\nThat cop sounds like a total noob. I really hope he learns from this terrible situation.\n\n[Traffic Stop Full Video](https://youtu.be/fCGsW41aQEw)",
    "title": "The Gabby Petito and Brian Laundrie Traffic Stop is Fucking Me Up",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1631991328,
    "score": 152,
    "keyword": "woman artist"
  },
  {
    "text": "Posing with artwork I'm sure most of you have witnessed this phenomenon. A woman will post a piece of artwork to reddit, with her face or body in the picture, and without fail dozens of people will voice their displeasure. I don't think I've seen a single post of a woman with her artwork that didn't have several negative or boderline abusive comments of that nature.\n\nWhenever people call out these commenters on their misogyny, their defence is usually something like: \"It's not because she's a woman! I'd say the same if a man did it, but men never get upvoted.\"\n\nNow today, I see a picture just like that, but with a male artist posing in it. The post has tens of thousands of upvotes and over a thousand comments. As I scrolled through them, I couldn't help but notice the distinct lack of any of those complaints. Nobody accusing him of using his attractiveness for clout, nobody annoyed at having to zoom in to see the painting, nobody preaching about how the art should speak for itself. Any criticisms were purely about the art itself. There were even several comments praising the artist's good looks, and they weren't downvoted or called simps.\n\nSo, it really isn't about the \"integrity of the art\" is it? They don't say the same thing when it's a man showing off his work and being proud of his talents. It's pure sexism.\n\nNothing against the artist in question, of course, but he happened to perfectly showcase the double standard. Maybe now people can just admit they hate to see women publicly promoting themselves and not being ashamed of existing and.. I don't know, having a physical form? Since apparently that's an issue for these guys.",
    "title": "Posing with artwork",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616648667,
    "score": 98,
    "keyword": "woman artist"
  },
  {
    "text": "Corporate picture: naked woman on conference room desk Hey guys, I could do with some advice as I'm an anxious person who tends to over think things after the fact. \n\nMy office building has recently been refurbished. A few months ago I was walking through a hot desk area, and noticed some new 'artwork' had gone up on one of the walls. \n\nThis consisted of three photographs.  One of a naked woman, facing away from camera, sat on a conference room desk. One of a woman kneeling on a kitchen work surface with her head in a sink, and one of a woman sat on the floor between two isles of seating. \n\nI mentioned to my male line manager at the time, that I wasn't sure if the pictures (especially the nude) gave off the impression of the business we would want them to. He said he'd raise it with HR and come back to me. \n\nLast month, I was walking through the area again and noticed they were still up, and asked him if anything had ever come of it. He said that in all honesty he had completely forgotten as we've been going through some big organisational changes which had taken up most of his time. Fair enough. He suggested I might consider mentioning it to hr myself as it might be taken more seriously coming from a woman. \n\nFine whatever, I did so. I messaged my HR rep over an instant chat application, asking for her to take a look at them and let me know what she thought. \n\nShe confirmed she would, but never came back to me. A couple of days later I asked again over instant chat, no response. \n\nA week or so after that I saw her in person in passing and she said she 'thought she would probably ask for them to be taken down'. \n\nCut to this week, which is two weeks after that, and I'm walking through the area again and they are still up. Impulsively, I take them down - no damage to the wall as they are just hanging - and stack them next to the desk, facing the wall. The wall is now bare with three studs hanging on it. For context it's a high use area that several directors walk through so the lack of 'art' is probably noticeable. \n\nMost stupidly, I also took down the small artist info card and threw it away. I don't know why I did that, it was an impulse decision id take back if I could. \n\nExcept now I'm obsessing over it. I want to be a person who stands up for what is right but I'm worried I'll get into trouble at work. A friend suggested telling my line manager what I did but I'm worried that I have my annual review coming up and it would affect my pay increase for the year. Someone else suggested putting the frames back up with different art, or editing the pics, but I don't want to do further damage. \n\nThey can easily know it was me through swipe card access records, CCTV, and the fact I'm the person who has complained about them. \n\nHonestly I'm a little stuck as to what to do and could really use some advice. I'm just so frustrated because I feel if a man had complained, or if I had gotten emotional about it, it could have been taken more seriously. But that shouldn't have to be the case! \n\nThanks in advance!\n\nEdited to add:\nHow I think I'm going to handle it: \n\nDo nothing. \nIf asked if I took them down, say: \n\nOh yeah, sure did! I had a chat with (hr lady) who agreed they would be taken down. \nA few weeks later I noticed it hadn't been done and I just figured everyone is so busy, so I just took them off their hooks and put them to one side, ready for them to be replaced :)",
    "title": "Corporate picture: naked woman on conference room desk",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633857808,
    "score": 93,
    "keyword": "woman artist"
  },
  {
    "text": "Why do men assume we don't know anything about video games I know this isn't as serious of a problem as many of you have, but it's a new experience to me and I find it frustrating and wanted to vent for a minute.\n\nSo, I like video games, a lot. I've been playing them since I was a toddler and at this point have probably played thousands of games. It's a silly flex, but I do know a LOT about gaming, moreso than most. I'm working towards a degree in computer science and in my spare time teaching myself Unity and Blender so that I can make VR games, which to me is the next big leap in game design. Long story short, I know a lot about video games.\n\nI'm also a transgender woman. I've been working very hard on my transition for years now and, at this point, I think that I look pretty good. I'm fashionable and stylish in ways I never could be before and I like how I look. I have also always liked striking up conversations about video games with people. Talking about all sorts of obscure or lesser known titles, hearing about their experiences, discussing good and bad design practices, it's an artistic medium that has a lot to talk about and I'm passionate about it. \n\nIt's something that I like talking about, but I've noticed the conversations going differently since I transitioned, and especially since I started looking good. Now that people no longer read me as male it seems like their knee-jerk response to me talking about video games is to quiz me. Like I get a lot more questions from people, as if they're trying to test my knowledge. Or they're a lot more likely to assume I don't know about something really obvious and talk down to me about it. These people almost never know a fraction of what I do on the topic, and I never had to prove myself before. Now when I mention really liking a game that they consider \"hardcore\" (it's usually not that hardcore but they think it is) I'll either get eye rolls or incredulity, like how could a girl POSSIBLY have played all the Devil May Cry games or how does a girl know about Deus Ex. Usually guys will assume I don't know really obvious stuff and go into an explanation on it without seeing if I've played some super mainstream game.\n\nThis never happened when I was acting as a man. When I talked about games there was no testing phase where I had to prove I was worthy of the conversation. I just talked about stuff and there was a mutual feeling of equal footing.\n\nI've always heard about gendered gatekeeping in geeky hobbies, and had a sort of vague idea that it was real but I didn't experience it so it wasn't a huge problem to me. But FUCK it's annoying.",
    "title": "Why do men assume we don't know anything about video games",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616849281,
    "score": 67,
    "keyword": "woman artist"
  },
  {
    "text": "I find the drag term \"fishy\" to be thoughtlessly offensive With the rise of the art form of drag in recent years, its starting to become mainstream. I enjoy watching Queens (and Kings, and non-binary monarchs of all kinds) celebrate femininity (and other gender traits for non-Queens). But I'm really uncomfortable with a lot of the subtext and the undertones that go along with drag.\n\nFor the most obvious issue, there is a common term for an AMAB person who passes well for a woman: \"fishy\". You know, fishy like the smell of some vaginas that men have weaponized against us? How many women have been mocked by men for an, often imagined, smell of fish? How often is that term used against us? How upsetting is it for so many AFAB people, and yet here are these AMABs using it like a badge of honor without stopping to think \"hey, ya know, I've never been victimized by this term. It's never negatively impacted my life. Maybe I shouldn't use it because there are so many people that have been hurt by it, and it is not mine to reclaim.\"\n\nThankfully there are some Queens who are openly talking about this term being inappropriate (Cheddar Gorgeous, Ana Phylactic). Their support and championship mean the world to me. But far more seem to not have any qualms with the word, and no problem using it. Last year some Queens received backlash in the UK for using the term on a non-drag related show (The Big Fat Quiz 2019) and when the backlash hit, ya know, because it's an offensive term, The Vivienne had nothing to say about the inherent misogyny of the term, just lashing out at the people calling her transphobic (which, let's be clear, the term is that as well by linking true womanhood to ownership of a vagina) before giving a very half-assed apology.\n\n\nFor an art that purports to celebrate femininity, the artists sometimes seem to revel in misogyny, and there have been too few Queens who stick up for their AFAB sisters and see how harmful not only this term, but the mindset behind using it despite its offensiveness can be. Often I see Queens, instead of celebrating femininity, making a caricature for people to laugh at, a mockery, which feels awfully familiar.",
    "title": "I find the drag term \"fishy\" to be thoughtlessly offensive",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1609881368,
    "score": 38,
    "keyword": "woman artist"
  },
  {
    "text": "September 24th & 25th - General Strike - #StopSB8 September 24th & 25th - General Strike Against SB 8 in Texas - Abortion Rights\n\n(No matter who you are, this affects us all. Women, men, enbies, and anyone else are all encouraged to participate)\n\nSeptember 25th was the first day a woman was ever appointed to SCOTUS. In light of the most recent attack on human rights in Texas, SCOTUS has abandoned us by refusing to halt SB 8, and they need to be reminded that this country cannot and will not run without our half of the citizenry. I propose that on September 24th and 25th we need to fight back. Help spread the word and start a general women's labor strike.\n\nThis is a grassroots effort, not run through any particular organization. Share on every platform, tell your friends, set your calendars.\n\nThe three goals of this protest are:\n\n1. Pressure SCOTUS to halt the SB 8 bill until after their Spring 2022 ruling on heartbeat bills.\n2. Bring attention to the issue, raise funds for pro choice groups and abortion funds.\n3. Push congress to act in the case that SCOTUS does not. Push them to protect our constitution, to protect our right to autonomy, and to pass legislation to further cement and strengthen abortion access at the Federal level.\n\nWHAT YOU CAN DO:\n\nCALL OUT sick or take time off if you are able to. Ask your partners to call out as well in support of you.\n\nCANCEL your dating apps for the same weekend. Refuse to go to restaurants, to go on dates, to give money or time or attention (except for necessities, of course). Bars, restaurants, movie theaters, dating apps- you are the commodity. They are relying on women bringing in traffic. They are relying on half of their local citizens buying from them. Don't.\n\nWALK OUT: Students Middle School to College can choose to walk out together. Parents, consider calling your girls (and other children) out of class for the whole day. Teens, consider organizing with your classmates whether you are in person or even virtual.\n\nCALL OR EMAIL your representatives in the days leading up to the strike, and especially the two days during. Tag them on social media so they cannot ignore you. Make them do their jobs and protect our rights.\n\nPRESSURE large media stars (singers, performers, comedians) to cancel tours in Texas. Tell them to withhold their business and presence. Hold them accountable. Call them out publicly.\n\nPOST: Take to social media. Videos, songs, poems, your own stories. Make your loved ones see you. Make them realize that it is with us or against us. They can have you alive and healthy, or they can risk your death under the new bills. Use #StopSB8\n\nCREATE art to spread awareness of the strike, and awareness of the abuse women will experience across the country if this bill goes unchecked. Wheatpaste your neighborhood, leave fliers at coffee shops, whatever you have to do. Artists, consider creating info-graphics, comics, or protest art and sharing them with the hashtag #ArtistsAgainstSB8\n\nDONATE to an abortion fund, to Planned Parenthood, to the ACLU, to the Satanic Temple, or to another organization you know and trust. Consider hosting a fundraising event among your family and friends.\n\n\\*\\*\\*Consider wearing your support on either day. Either dressing in all white, or wearing/carrying other symbols of support. Please only do so if it is SAFE for you to do so in your area.\\*\\*\\*\n\nIf you need help finding out who your representatives are, I am willing to help you. If you need guidance on organizing on in person protest alongside the above, I am willing to offer advice and help where I can.\n\nNON AMERICAN FRIENDS: Consider urging your governments to condemn Texas's actions, along with the silence from SCOTUS. Share your own stories online to help show just how widespread these issues are. Support your American friends and family in their fight. Speak out where you can. Donate to Planned Parenthood, the Satanic Temple, US based Abortion Funds, or other abortion protection and services organizations.\n\n&#x200B;\n\nEdit: Adding future updates of tools you can use below this edit.\n\nREPORT the whistle blower website to its current domain registrar, GoDaddy, as being dangerous and abusive materials.\n\nPETITION: Sign petitions put out by the ACLU, PP, and other organizations that are fighting for your legal rights.\n\nMARCH: If it is safe for you, consider joining the Women's March on October 2nd. Details are here [https://womensmarch.com/mobilize](https://womensmarch.com/mobilize)  Remember to bring sunscreen, extra water, first aid kit, and layers appropriate for your local weather.",
    "title": "September 24th & 25th - General Strike - #StopSB8",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630611091,
    "score": 36,
    "keyword": "woman artist"
  },
  {
    "text": "Financial Confessions of an Indian Bride-to-be (Warning: Text-heavy) **There are more important things in life than money.** For the last 25 years of my life, this is something I’ve strongly believed, from the comfort of my figurative ivory tower.\n\nI’ve always seen myself as a frugal spender, a strong, independent woman who can survive on her basic salary - all while living rent-free in the home that my grandparents built, and surviving off of the food that my parents provided. My only true expenses were travel, the occasional shopping trip, and a few gadgets. Everything else went into investments and savings.\n\nAnd then came the talks of marriage. An arranged marriage of course - I was introduced to a nice guy with a sunny disposition, who I found charming and down-to-earth. We spoke, we laughed, and while I didn't quite fall in love, I could see myself spending the rest of my life with him. So I said yes.\n\n**Surely, a small and simple wedding ceremony would suffice? We're in the middle of a pandemic!**\n\nBut no, my family has a reputation to uphold. We can't afford to offend my aunt's friend's sister's son by not inviting him. And of course the bride has to wear real gold jewellery, none of that cheap stuff!\n\nThe visit to the jeweller was an eye-opener for me. Traditionally, a married woman in my community is required to own two chains - a gold chain with tiny black beads, two corals, and a pendant, and a second gold chain with two large black beads, and twelve corals, to be worn on special occasions.\n\nThe price of the gold was something I was mentally prepared for. The price of corals, though! That really shocked me. My parents, however, didn’t even blink, which made me realize that they’ve been saving for this their entire lives. It was an extremely humbling experience.\n\nUsing fake corals seemed like the obvious solution, but my family was offended by the mere suggestion. But spending so much on a chain I would barely wear a handful of times? It makes no sense to me.\n\nThen come the wedding saris, the rest of the jewellery, the marriage hall, the priest, the makeup artist, the photographer, the decorator, the caterer, accommodations for the guests, and so many other expenses that are still barely a blip on my radar.\n\nAnd the expenses that will crop up post-wedding: the honeymoon, the rent, furniture, a scooter, a car, kitchenware, and so much more that I haven’t even begun to think about yet. And while these expenses will fall to me and my husband-to-be, that just makes them all the more intimidating. \n\n**Suddenly, my 4 years’ worth of savings, which I have always been so proud of, is beginning to feel like mere pocket change.** And while my savings can cover all of these costs (except the car), I'd still be pretty much penniless at the end of it if I wasn't splitting these expenses with my fiancé.\n\nIf there’s one thing this experience has taught me, it’s that as long as reputations and egos colour our perceptions of the world, money will always rule us.\n\n\\_\\_\\_\\_\\_\n\nSharing this here and not on my social media because I just *had* to send this rant out in the world, but anonymously. **God forbid, I may offend someone otherwise.**",
    "title": "Financial Confessions of an Indian Bride-to-be (Warning: Text-heavy)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1629459981,
    "score": 32,
    "keyword": "woman artist"
  },
  {
    "text": "My boyfriend wants to start with child planning and i am kind of frightened So basically i (32) want to have Kids but i am not one of those people who would be devastated If it wouldn't work out, because i pretty much love my life as it is right now.\n\nSo, my boyfriend wants to start having kids and now i am  a bit frightened. I love the thought of having a little friend and teaching them everything i know, but honestly, i Look more forward to the times where they are old enough to speak and Not so much on the pregnancy and infancy. Also, the thought of being responsible for a Tiny human being and the fear of doing something wrong is kinda overwhelming. Then the financial stuff will be a Challenge too. We'll need to move into a bigger Appartement and this means much more rent, but then again, i am the only one who is employed, while my bf works Part Time as a teacher at University and is an Artist who builds stuff. We said, that we would share the upbringing 50/50, so i can continue working in my job, because i doubt, that we could afford living If i stayed at Home, but then i am afraid that it wouldn't work out in practice because of my boyfriend's workload.\n\nI feel kinda pathetic because we haven't even started to try yet and i am already shitting my pants but i needed to get this off my chest and because 32 is quite old to start with child planning in the First place and still i have Problems to Woman Up apparently.",
    "title": "My boyfriend wants to start with child planning and i am kind of frightened",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1623929251,
    "score": 22,
    "keyword": "woman artist"
  },
  {
    "text": "I'm obsessed with women supporting one another And I think I found my place. \n\nI met some of the greatest women ever in my uni, both students and professors. \n\nMy all-woman group got a separate group chat for off topic talks and we can discuss anything. If somebody gotta vent, we let her. Class notes? Trouble choosing an outfit? Generic complaints? Ugly selfies? One hasn't left home in many days and needs help existing? We got it all. We got amusers, hustlers, mum friends, fashionistas, order keepers, geniuses, artists. I'm still in awe thinking how such distinct personalities work together so well. \n\nMost of my profs are women. Yes, some of them can be assbaggy, but most are there to instigate the learning in us. They're open to discussions, provide feedback, negotiate freely. Heck, we even happen to chit chat and refresh our brains. \n\nI'm loving it here. While I'm saddened to think about graduation someday, I've already met quite a few people in my (also predominantly feminine) working field and they're awesome. Plus we can always keep in touch!\n\nI really wish younger women and girls learned to create alliances instead of the dog eat dog narrative. It's a real treasure and the mutual support is immeasurable.",
    "title": "I'm obsessed with women supporting one another",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1638317591,
    "score": 19,
    "keyword": "woman artist"
  },
  {
    "text": "Do not approach women like this. I wanna know who's giving these men the idea that acting like this is okay. I need fucking names. I witnessed the most obnoxious shit I've seen all year last night. Dear fucking god.\n\n&#x200B;\n\nSo I'm at a local bar hanging out with the bouncer and I see a few of my girlfriends come through. We chatted a little then they went to get drinks. I was sitting by my bouncer friend and watching my new friend Ashley get me a redbull from the bar (I had to DD). Her process was interrupted by some dude emphatically talking to her. I had seen this dude going to random girls around the bar and hadn't seen him have any luck. I approached her at the bar with my two other girl friends, ready to separate them swiftly so we could return to our night.\n\n&#x200B;\n\nThat's when he turned his attention to me. He kept telling me that I looked familiar. I told him I have over 1,000 friends on facebook, he might have wandered in at some point. How could I possibly keep track of such a thing, right? Then he said, \"No, no. I know I've seen you in porn!\" I had a good laugh at that because I'm asexual, that was one of the first things I told him. He kept repeating that he knew me from somewhere but had no idea where. Then he went on to say that he was just looking at a picture of my \"beautiful face\" on his phone earlier that day. That's weird as fuck, because I haven't posted a picture of my face in literal weeks. I tried telling him we probably knew each other online but he kept pushing the porn thing. He was like, trying to wear me down to get me to say I do porn or something. (I did mention my [OnlyFans](https://www.reddit.com/r/offmychest/comments/pefftu/i_feel_empowered/) but told him he couldn't afford it). He kept trying to get closer and closer to me, but my homegirl Emily got between us and wouldn't let him go any further. I kept telling him that Emily was my girlfriend and she was gonna get jealous of me getting hit on. I'm extremely chaotic so I was having some fun with the situation. I continued with this conversation because I felt the need to tell him how bad he is at this. He eventually maneuvered around Emily and tried to sneak in an \"innocuous\" touch of my arm. I slapped at his hand and screamed like the guy in the beginning of The Lion King, then sang from my chest to not fucking touch me. Emily quickly escorted me outside before I could cock back and swing at the guy. I was heated.\n\n&#x200B;\n\nWhat a fucking creep, right? I could see what was happening. This poor sap had fallen victim to the manipulation tactics used by self proclaimed \"pick up artists\" who have never successfully picked up a woman in their lives. They've convinced themselves they're masters of persuasion and understand the psychology behind hooking up. I can tell you without doing much research, these are not desirable individuals. They've taken all this time to fool girls into thinking they're likeable, they forgot entirely to actually try to be likeable. These pick up artists encourage these dudes to fucking touch you. Yeah. It's to see if you react or not. If you don't react, they assume its okay to push further and touch you more in other ways. That's why I made sure to make a scene as soon as he fucking touched me. I can't imagine if some poor 21 year old got cornered by this guy. Someone who doesn't have the defense mechanisms to spot and effectively deal with a creep. Someone who would not react to being touched because they're afraid to make a scene. Not I. I'll put on a 3 part symposium on why you need to get tf out of my face. And I'm gonna make sure everyone around us hears that you touched me and I told you not to. Because my potential boyfriend is the bouncer, he's right over there. I don't think he would have any qualms with removing you, and wouldn't be gentile about it. I'm also convinced he was pretending to be drunk to have something to blame his heinous behavior on. I didn't see him with a drink.\n\n&#x200B;\n\nAfter I had appropriately calmed down, I returned inside to say my goodbyes, it was bed time. I hugged Ashley at the bar and she told me how happy she was to meet me and held me close. The creeper happened to be sitting right next to her, staring directly at me. As I hugged her, my face was in the vicinity of his. I kept my smile and did my best not to make eye contact. When I was released from the hug, the guy tried to talk to me. Said he had something to settle with me. I wasn't interested in anything else he had to say, so I just left. I can only imagine what his version of \"settling things\" would have looked like. What did he expect, that I'd dutifully stay in that spot and hear what he had to say? How entitled can you be?? You think I owe you after you crossed a line with me? Kick the sharpest rocks. And if you're a guy who's getting his tips from these pick up artists, I suggest you go outside more.",
    "title": "Do not approach women like this.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1631398176,
    "score": 22,
    "keyword": "woman artist"
  },
  {
    "text": "Menopause at 38. Cis woman, South Asian. A variety of emotions as I finally confirmed it with an endocrinologist after 10 years of no natural periods (and tepid investigation through Provera tests and, finally, an FSH and estradiol test earlier this year, which confirmed my FSH is at menopausal levels and my estrogen is undetectable). \n\nI feel a lot of things. \n\nI have never been fixated on having children (and never been pressured to marry or have children), but I wanted it to be my choice -- it seems my body has made the choice instead.\n\nI know being a mom doesn't make you a woman and being a parent doesn't make you valuable, and I lead a rich, fulfilling life full of mentorship and young people who adore me, but I feel a bit like my body has broken. Weight gain, thyroid issues and normal aging changes have also done a number on my sense of beauty and feminine power, so even though I recognize not all women (even young cis women) menstruate, there's an inescapable, probably socialized sense of youth and beauty slipping away. \n\nI do feel grateful to have missed 120 periods and spent a year of my life not having cramps. So many better things to do instead.\n\nI feel a resentment at the assumption that women endlessly bond over periods even though I know some women do. Even when I got mine (from about 13-28) it wasn't a big deal. \n\nI feel poignance that out of all of my generation of women in the family, I am likely to be the only one not to give birth to a child, especially as my cousin gets ready to welcome her first child. I feel more closeness now to my aunt, her mom, who adopted her after battling infertility. \n\nI feel pissed at terms like \"ovarian failure\" and \"insufficiency\" and \"infertility.\" I was joking with a friend last night that I refuse that framing. I prefer to call it early ovarian retirement. \n\nI feel grateful that I probably, basically never have to worry about birth control now. I know, I know, I should still be careful and watch out for STDs. But the doctor said with an FSH of 51 if I ever got pregnant I'd be a miracle case study. \n\nI feel, as a brown, queer, single, artistic and \"infertile\" woman, in some ways more valuable now than I did before. Every one of those descriptors diminishes my worth in the eyes of a white, patriarchal, capitalist society. But my worth remains intact. I am here for my own purpose and goals, not to exist or be erased in relation to anyone else. \n\nI also wonder if I fucked up by not getting this examined earlier (I would halfheartedly bring it up with obgyns and primary caregivers but they all simply said \"take birth control.\") This doc thinks it might be autoimmune, thyroid-related and we are checking it out.\n\nI feel amused that I now need to schedule bone density checks like my 67-year-old mother. \n\nI feel lots of contradictory things. So I just wanted to write them all out. If anyone experiencing something similar wants to DM me, please feel welcome. \n\nI both feel like a part of my life has ended and the rest has begun. \n\nLittle old young lady out.",
    "title": "Menopause at 38.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1638410536,
    "score": 21,
    "keyword": "woman artist"
  },
  {
    "text": "Q: Women who code, what's it like to be a software dev in 2021? Are the interpersonal issues I'm experiencing in my bootcamp what I can expect on the job as well? Hi there, I couldn't find a woman-centric programming sub so I'm asking here hoping I can get relevant answers.\n\nI've been into tech news and developments and building computers for years, so I finally decided I wanted a fat paycheck and a job that challenged me and got myself into a coding bootcamp. \n\nThe bootcamp itself has been great! It's challenging and coding (what I've learned so far) is really amazing. The pace is *intense* and I'm glad I'm learning it.\n\nMost of my class is men, it's about 10/1 ratio m/f. A bit above half of my dude classmates have been kind and welcoming. The rest have ranged from indifferent and cold to me while warm to the other guys / kind of ignoring my answers to their questions / somewhat talking down to me about classwork / being nearly hostile, and one guy has messaged me personally so much I had to block him because he kept trying to ride the line -- seemingly pursuing me romantically but acting like he wasn't. (I've asked my fellow women in the class, he did this with me until I blocked him then switched immediately to another woman who was also uncomfortable.)\n\nI've been around the tech sphere long enough to know that being a woman in programming can be... challenging... but I'd thought that by now that was mostly in the past and that coding workplaces and learning environments were pretty egalitarian. It's been eye-opening and upsetting to be pursued romantically when I'm just trying to learn and dismissed when I answer some of the guys' questions only to see a dude who answered what I did praised and thanked (not everyone does this, but it's awkward and obvious for me when it happens.) Sometimes my answer will go ignored for 10+ minutes but a dude's followup a chat line below mine gets thanks 30 seconds after it posts.\n\nThis is hard to deal with. I've been an independent self-employed artist up until now and haven't really been exposed to how invisible and dismissed (unless I'm being pursued, then it's straight uncomfortable :/) I feel when this stuff happens.\n\nI'm starting to feel like maybe being a software engineer isn't going to be worth it if the job is going to be like this too. I don't want to be ignored or talked over or dismissed or treated like I'm not competent enough by some of my coworkers.\n\nMy big question is... is this what I can expect? It this \"sink or swim\" and I just have to... deal with it? I honestly thought  that the coding sphere was mostly past this nonsense.\n\n(Throwaway account -- I don't want this much information about me on my main)\n\nThank you for reading.",
    "title": "Q: Women who code, what's it like to be a software dev in 2021? Are the interpersonal issues I'm experiencing in my bootcamp what I can expect on the job as well?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1619328074,
    "score": 20,
    "keyword": "woman artist"
  },
  {
    "text": "Last-Ditch Effort: Do I Give Up On The Dream? Heyyyooo... coming to you live from a puddle of self-doubt and confusion. \n\nTLDR: I’m a human being, so I need money to live. I don’t find anything pleasing about the Starving Artist idea. I value balance and vitality. I can’t sing consistently enough to be putting out music all the time to break through. **I don’t want to give up on my dream, but I can’t invest ALL my time ALL the time.** Even if I could sing enough, the music I like to make isn’t objectively great music - it’s pop music expressing feelings of a young woman navigating love and life, but not instrumentally technically advanced. I don’t love the music I’m currently making but I need to release it NOW (according to business advisors). **How do I accept that what I make is okay even if its not great???** I don’t want to taint my image with shitty music forever (Alanis lucked out with her bubblegum-alt switch). It feels so silly to ask but, damn. I’m feeling lost.\n\nThe following is a little messy, please be gracious with me😅\n\nI’m (23F) an all-around performing artist: songwriter, actor, multi-instrumentalist, vocalist - you name it, I’ve grown up doing it. I have always felt most comfortable and alive in this sphere, even though most of my “career” has been learning curves atp. I’ve won scholarships and awards for my performances and work, and songwriting comes more naturally to me than breathing (think Alanis Morissette, F+TM, Taylor Swift, KT Tunstall). I have always been confident in my ability to craft the bare bones of lyrics and melody. **Being a mainstream performing artist and songwriter has been my dream ***forever***.** This also includes making money. I want to make money - I need to make money lol!\n\n*However*, in the last 5 years, I have felt a tectonic shift in my confidence and willingness to commit to my art. I feel like the foundation of my self-assuredness has devolved from reliable, compact earth, with responsive soil, to a crumbling mess of dried up dirt. My footing cannot be found. The more I learn and surround myself with colleagues (I’m pursuing an academic career in psych and philosophy), the more I feel like what I do is garbage because it doesn’t make all these incredible musicians, high-thinkers, fine-art-appreciators *feel* something. \n\nI am considering the fact that there is an objective quality to art. This idea comes from the higher-ed folks I have grown up around and the uni classes I’ve been in - it is an idea that is weaving its way into my mind as a stronger and thicker thread every day. How can we equate the skills of someone who puts together a Gentileschi-like work to that of a student of Warhol’s? How can I have grown through my teen years feeling like Taylor Swift had a direct line to my soul, but still feel like if *I* release music like that, it won’t be good enough to satisfy those people who don’t like her? \n\nThis trepidation has been able to grow thanks to an illness that takes away my voice. I’ve been able to sing very infrequently in the last year.5, which means I haven’t been able to consistently sit down and *make* the shitty shit to even get comfortable with growing in the studio. (I have been learning to produce my own stuff since I was 12, but only real, serious stuff in the last year and a half.) \n\nThen we have the whole issue of how fucking constant work needs to be released in order to break through the saturated market. AH! I can’t sing constantly ➡️ I can’t make, produce, release constantly ➡️ I can’t break through at all ➡️ no money and no way to afford to live ➡️ no way to build a life of experiences to continue developing art ➡️ must invest time in other things to make money.\n\nAnyways.. I don’t want to give up on it.. but it seems like unless someone is giving an arm and a leg, they get nowhere... and I don’t believe dreams can survive on an empty stomach.",
    "title": "Last-Ditch Effort: Do I Give Up On The Dream?",
    "subreddit": "careerguidance",
    "timestamp": 1623433718,
    "score": 3,
    "keyword": "woman artist"
  },
  {
    "text": "What kind of career is this? Hello! I am a student and I currently admire the profession of a woman who is on my local news station. She appears during a specific segment produced by the news station and they introduced her as their \"Lifestyle Consultant\" during the segment, she gave advice on how to boost your energy.\n\nI went to her LinkedIn, I saw where she owns her own marketing agency as the \"Lead Marketing Consultant\" and it states verbatim: \"a digital branding and marketing agency serving creative entrepreneurs and small businesses, offering everything from web design and branding strategy, to social media management and creative direction. \"\n\nTo add, there was another woman who is a makeup artist and affiliate with KISS lashes. She's also been brought on to talk about her favorite makeup & products.\n\nSo, how can I get on the news and do that? What are the steps needed to take to get into consulting? or being hired as a company's consultant? I'm currently in market research. What is the appropriate experience or qualifications needed to do this? I'm not too familiar with consulting. Do you have to be considered an \"expert\" to even consult someone or a company?",
    "title": "What kind of career is this?",
    "subreddit": "careerguidance",
    "timestamp": 1632353410,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "Can we have a real, open discussion about black womanhood across the diaspora? Not sure where I'm going with this, but I'd like to hear your experiences from across the globe. A recent post where OP asked if it was ok for her to identity as black has spurred me to reflect about how much our experiences might differ depending on where we are in the world.\n\nI feel like the North American black experience often dominates the narrative around blackness, which isn't much of a surprise considering how much American culture has been exported and imposed around the globe. But I think it's important to say that, for those of us outside US territory, this might end up putting an unnecessary burden on the construction of black resistance across the diaspora. This it not to say that black American authors, thinkers, artists and activists haven't contributed immensely to the advancement of our people - they sure have. Just look at what hip-hop has done for so many young black people across the globe. But there are others. So many others, from so many different places. And I'm bringing all this up this because I believe we can gain so much from being able to unite and construct a coherent movement against the white supremacy that has been rampant across the globe, specially in recent years. This is also about decolonizing our references and working towards a global anti-racist movement.\n\nFor reference, I'm from Brazil. I think we have a lot in common with the US, but at the same time, not so much. Most importantly, I think we can all learn a lot from each other. I believe most people here are from the US - and I would like to hear you too.\n\nSo, what does it mean to be a black woman in your country? Can you maybe recommend some authors and share some of your history? Maybe something you think is often overlooked and not taken in consideration during discussions?\n\nThanks!\n\nEdit: the title should've been \"across the globe\", not only the diaspora. It would be awesome to hear from those in the African continent.",
    "title": "Can we have a real, open discussion about black womanhood across the diaspora?",
    "subreddit": "blackladies",
    "timestamp": 1636912966,
    "score": 136,
    "keyword": "woman artist"
  },
  {
    "text": "Non Black artists depicting only Black people? Ok so this is something I’ve run into a few times and I wanted to get you all’s opinions because it seriously rubbed me the wrong way and I still don’t know how to feel about it. \n\nI’ve noticed (mainly when searching for art by black people) artists that mainly (or completely) depict Black people , usually Black women. The name of the photos will largely be something like. “Trendy art” “Black art” “African woman” something like that. And usually when buying on Etsy because I’d like for my coin to go towards Black artists, I go to check the photo and it’s a white woman? \n\nAt first I thought hey we are being portrayed by others in their art now cool, but something still didn’t sit right with me. When their banner photo is all of Black women, almost hiding the fact they aren’t Black. When I mainly noticed this last year when people pushed for supporting Black artists. When your stuff shows up before Black artists.\n\nWhat do you ladies think?",
    "title": "Non Black artists depicting only Black people?",
    "subreddit": "blackladies",
    "timestamp": 1619750918,
    "score": 53,
    "keyword": "woman artist"
  },
  {
    "text": "covert harassment at fine art museum  When the museum opened, I went straight to view an exhibit featuring prominent Black artists. I was viewing the exhibit alone, reading each description and viewing each piece closely. The exhibit was positioned in a long hallway that opened out to larger exhibits on each end. The museum attendant paced quickly and forcefully behind me, lapsing the hallway by exiting and reentering at both ends of the hallway multiple times while I viewed the exhibit alone. When other visitors came to view the exhibit periodically he would stop and go attend another exhibit.\n\nThe museum was incredibly large with an extensive collection from various time periods. It was sparsely attended and I took my time at each exhibit. Towards the end of the day, an hour before closing when I was viewing a piece in a different exhibit, nearing the end of my lap throughout the museum, the same attendant made a comment while passing behind me, saying \"Have you seen everything yet?” in a condescending tone. I completely ignored him and fully focused on the piece. \n\nI felt that I was stalked and surveilled at this museum. He did these things specifically when I was alone in the exhibits, viewing art created by well highly renowned contemporary Black artists. It seemed he sought to specifically disrupt my experience in seemingly subtle ways, a form of covert harassment. Lighter skinned and white people in couples and groups did not seem to get this treatment, even when they were also the only ones in other exhibits. In those cases the museum attendants were nowhere in sight and far away, hiding in a corner on their phones outside the exhibit. Thirty minutes before closing on another floor as I went to the bathroom, another museum attendant stood around the corner outside the bathroom door, given that I was the only patron on the floor. \n\nIt could be argued that he was doing the job they are paid to do. It could be argued that my behavior was unusual or suspicious, especially being Black woman viewing art closely from opening to closing, alone. It seemed like I was being subtly urged out the door in all these instances, even from the beginning. I’m contemplating whether to file a report, there is no formal place to file a report but a place to email the museum with ‘feedback’. What is the best way to approach this situation?",
    "title": "covert harassment at fine art museum",
    "subreddit": "blackladies",
    "timestamp": 1623044724,
    "score": 19,
    "keyword": "woman artist"
  },
  {
    "text": "Not Feeling Heard... Hi ladies! New to this sub and I'm loving it so much.\n\nI had a few things on my mind and was wondering if anyone else has gone through this? \n\nTLDR; Have you ever had parents that are emotionally unavailable and that trickles into thinking that no one around you cares or truly listens to you? How do you combat this?\n\n\\*\\*I am in therapy, btw. Was just wanting to see if anyone else has dealt with this and has any solutions.\n\nToday, I caught myself starting off having a bad day because a friend of mine listens to a problematic artist who harmed a Black woman late last year. They did not respond to my comment nor did they have a rebuttal which was very shocking. It made me feel like dirt because people don't listen to Black women when they're hurting or in pain and it was just a harsh reminder. Anyways, I go to talk to my best friend about the situation and how it had me feeling a type of way and she seemed to just brush me off and say that I shouldn't be too riled up in the morning. I was really taken back by this comment because she can be so naive to things like this and I truly thought that she would've learned some things, but because she panders to white people, she doesn't notice harsh treatments that happen to Black women (bc it doesn't happen to her as often) ((I'm also 3-4 shades darker than her which is kind of important))\n\nAnyways, I went on about my day and noticed that a lot of my other friends in group messages don't really respond to things that I have to say either. Needless to say, after some sitting time with myself, I realized it all stems back to my parent's inability to help me cope with things properly and them not really caring about emotions that I or my sister felt. It makes me feel so alone and I understand that sometimes people don't know what to say, but I also wish that they would say that instead of nothing or just emphasizing my message.\n\nHas anyone dealt with this or gotten over something like this? What are some ways I can help myself? Because it seems that I'm very alone in all of this.\n\nThanks for reading ❤️ and I hope you all have a better day than I did!",
    "title": "Not Feeling Heard...",
    "subreddit": "blackladies",
    "timestamp": 1623180607,
    "score": 14,
    "keyword": "woman artist"
  },
  {
    "text": "Black spirituality, or the search thereof Being a black femme raised in a pretty christian, american household, I cannot for the life of me understand how my black relatives accept a religion forced on us like it was. I understand why, I understand the importance and community church brings, it's super valid if that's what resonates with them best, but it's... just not for me. It genuinely makes me sick to my stomach to even try. \n\nBut the problem is, I consider myself an inherently spiritual person. I feel and believe things that pretty firmly do not mesh with an atheist or agnostic viewpoint - and more than that, it's incredibly important to me to explore that and figure out what it means all to me. Thing is, it's incredibly difficult to do that alone. I've been studying all kinds of different beliefs and descriptions of spirituality but most of them are so... just not black. Not mine. And sometimes actively racist or appropriative in some cases.\n\nI've come to the realization that believe that these feelings and beliefs are firmly linked to my heritage, and the beliefs my ancestors had, and the ones they continued to practice in defiance of all else. I think those are the only ones that make sense to me, and that I could feel a genuine connection to. And, well... most of those beliefs that've withstood everything that's happened are practiced in pretty closed and private circles, for obvious reasons. Most 'educational' resources about them are from white perspectives looking in, and most others are openly scam artists taking the dressings and sell it back to us. It's really, really hard to find resources that are solid, and even harder to find communities and people willing to let in a stranger on the internet into their circles.\n\nSo, at the end of the day, I'm pretty lost and frustrated and confused and I have no where else to turn. I usually lurk, so this is a pretty weird first post, but I don't really have any other options. If this isn't the right online space for a post like this, please direct me to a better one, but I sincerely hope I'm not the only black woman here who's been down this same road. I'd appreciate any and all help, so please, if you have anything at all, I'd love to hear it. Thanks for reading.",
    "title": "Black spirituality, or the search thereof",
    "subreddit": "blackladies",
    "timestamp": 1620647624,
    "score": 11,
    "keyword": "woman artist"
  },
  {
    "text": "Tattoos Hey everyone I hope you are all well . I've been dreaming of getting tattoos for ever now and it's gotten to a point where I'm getting older and I just want to jump in and do it . Do any of you know any black tattoo artists ( man or woman) in London ? Possibly affordable.  If not do you know where I can get more information about this please , it would be much appreciated ( google found nothing for me ) .",
    "title": "Tattoos",
    "subreddit": "blackladies",
    "timestamp": 1633283029,
    "score": 9,
    "keyword": "woman artist"
  },
  {
    "text": "Looking For a Singer! I've been looking for a singer that would be willing to lend her voice to some of my music. It has been really hard trying to network and find a singer so I thought I would try here. The music is an Erykah Badu, Jill Scott sorta vibe. Having a lady's vocal (specifically that of a black woman) would really fit the vibe and energy I am going for. PM me if interesting or if you could put me on to any other lowkey underground artists you may know! Also hope everyone's mental is good during these wild times.",
    "title": "Looking For a Singer!",
    "subreddit": "blackladies",
    "timestamp": 1610046771,
    "score": 9,
    "keyword": "woman artist"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 33,
    "keyword": "woman artist"
  },
  {
    "text": "I ruined her week Doing so was very simple. I took my hidden 2nd key and went driving while she was at work. When she came home, she saw the lettering on my tires wasn't in exactly the same position as they were this morning. She memorizes this every morning when she leaves. She lost her mind.\n\n\nYou see, I'm not allowed to drive, or have my debit or credit cards, lest I drive off to meet \"some whore\" or buy some alcohol.\n\n\nI'm not a pussy. My first marriage ended in divorce and I was in a bad way. I met her when she used to attend my band's concerts. She loved my whisky-drinking blues guitarist persona (it was exaggerated). She took videos and photos of us. This is how she worked her way into my life. \n\n\nShe claimed we had sooo much in common. She sent me videos of artists I loved until late hours of the night. She brought me food at work. She bought me prime-quality booze and vintage guitar amps. She was a sweet, kind woman who was abused by her evil, right-wing ex-husband who was a traditionalist Catholic who only accepted Latin Mass. She came from money.\n\n\nI fell for it. I was her big 6'4\" he-man savior. She played that up. I married her. But right after the wedding she began tearing into me. All those things which attracted her to me were now \"problems.\" No more music. No more guitar (\"you love that guitar more than me\"), no more playing live gigs (\"you just love the attention of all those sluts\"). She now says she hates the music I love.\n\n\nShe went through my phone and now makes things that happened years before I married her into a huge issue to bitch about. She talked to old girlfriends. She projected the worst of her ex-husband onto me and seemed disappointed and bored when I wasn't similarly cruel and held me in contempt. Anything I do, say, or watch that doesn't meet her pre-approved standards sends her into an existential crisis that never seems to end. Thank God I resisted her pressure to have a kid. \n\n\nSo here I am. Walking on eggshells again. This is representative of the texts I get almost daily. btw, I've never cheated on her: \n\n\n\"Justify yourself as you see fit. I dont have to look for reasons to be angry or upset. As I said, you have lied for 9 years, cheated, and been abusive in other ways.  I have tried to maintain a relationship as best I could. It is unfortunate that it is not the googly-eyed teenager style relationship you want.\"\n\n\nWhen I was dating her she used to say: \"oh, you're the man I've always wanted!\" She was googly-eyed over me and chased me from gig to gig. As soon as I married her, I became the useless fool who can't do anything right. She leaves the house in the morning bitching and complaining, texts me during the day complaining, and comes through the door in the afternoon bitching and complaining. The best I can get is silence, but I know that just means she's thinking of things to bitch about later. \n\nAnd she wonders why I might want to drink!\n\nBut I've learned my lesson. I'll never get married again. No way. I'd rather live in a cave with my dog than live like this. Never again.",
    "title": "I ruined her week",
    "subreddit": "MensRights",
    "timestamp": 1635383109,
    "score": 262,
    "keyword": "woman artist"
  },
  {
    "text": "Single Mothers: Men Don’t Owe You Anything NOTE: This post was deleted right away in the following subreddits - r/unpopularopinion, r/offmychest, r/rant. I really don't know where else to go to interact with people who have differing opinions, so if you know of another place let me know. I'd love to have a debate with people about this issue. Reddit is full of censorship and uncivilized moderators. Anyway, here is the actual text of my post:\n\n&#x200B;\n\nI hear it quite often from single mothers that they are “worth it”, as   they try to convince men to date them. I get it: single mothers have it   tough in the sexual and dating marketplace. It’s like being a divorced   man, in your 30s, and trying to start a new relationship and rebuild   your life -- except HARDER because you got children on you too. Immense   sympathy ought to be afforded to single mothers who are genuinely  trying  to raise their children right and exude the feminine qualities  that men  desire. HOWEVER, sympathy is NOT the reason why men should be  with  single mothers. I get it that something probably went terribly  wrong in  these women’s past that had resulted in their single  motherhood; I’m  sure most of them did not intend it. But the suffering  resulting from  those tragedies/unforeseen events/mistakes/etc cannot be  a cause of  entitlement. Victimhood is not automatically a cause for  entitlement.\n\nWomen  in their 30s,  especially single mothers in their 30s, need to realize  and accept the  laws of physics in the sexual marketplace. A woman’s  allure as a  serious partner (e.g. for marriage or its secular  equivalent) stems  from the perception of purity. Put aside the idea of  “Purity” in the  Ahrahamic religions. The “Purity” that I have in mind is  more objective  than anything. Mainly, it’s less baggage: less years,  less sexual  partners, no previous children, less psychological trauma  and/or  complexes, less financial issues, etc. I know how terrible this  sounds,  because it seems to diminish one’s worth as an individual. But  this is  very much the reality. The feeling of diminishment is merely a   subjective reaction to the reality. To tell a man that a single mother   with 2 children from another man -- or hell, 3 children from two other   men -- “should have” equal worth in his mind as a single, childless, never-married woman in her mid-20s is the same as telling someone that a 10 year old car with 200,000km on it “should be” considered the same as a 3 year old car with 30,000km. “Should” is the feeble attempt to erase unfair laws of nature. Good luck with that because it never works.\n\nNow, I realize that people can fall in love. People of different creeds,   circumstances, etc. I personally believe in Romeo & Juliet; I think   people can fall in love like that. Can a man fall so passionately in   love with a single mother? I think so, it’s possible. The question is,   although it’s possible, how PROBABLE is that? Think about what I said in   the above paragraph: why would a man elect to be with a woman in such a   difficult situation when there are other women out there whose   lifestyles would present far less difficulties to him? Look at it from   the man’s perspective for a second, and remember that he is a free human   being. Entering into the life of a single mother would more likely  mean  that his agency in his own life would be far diminished because he would be funneled into the inertia of HER life. And what inertia drives her! He will have very   little control of the direction of where he is headed, since the   practical status quo of the MOTHER that he married, weighed down by the   presence of the children and the ethical burden that they bring into  the  picture, would dictate the necessary steps to be taken in the   relationship. Also keep in mind that he would never be their father, and   thus would never have the right to hold the same authority over them  as  he would over his children. This affects a man probably much more  than  many women realise. A man has his own needs and desires too, and I  hope  you accept their validity. And would he really want to override  his  (reasonable and valid) needs/desires by bringing a woman into his  life  who now expects him to care for and maintain children who are not  his  own? Would he want to contend with such a situation over the   alternative, where he marries a woman without a bad history and baggage   and fathers children of his own with her, knowing full well that she is   the vessel of all his offsprings? Again, it’s possible that a man may   choose the former because of love and passion. But how probable is  this?\n\nAnd  what kind of man are we  talking about, even? A man younger than you? If  you are serious about  this, I’m sorry, but you’re living in a  wonderland. The chances of that  happening are so slim, not only because a  young man would likely be  terrified at the prospect of marrying a  mother but also because they  have plenty of women to choose from in  their (younger) age group. And  do you really want a young man who  doesn’t know how to be responsible  (and financially mature) enough to  handle your very difficult  situation? So that leaves men in your age  groups: 30s, 40s. First thing  to keep in mind about them is that many  are already married or taken  in some way, so they’re unavailable. Among  those who are left, many are  not “high quality” according to modern  women’s high standards (but I’m  gonna assume you are a reasonable person  with reasonable standards,  considering the experiences which led you to  single motherhood were  probably the phenomenon of reality hitting you  in the face like a ton  of bricks). And I’m going to assume that you  would prefer not to be  with a man who is desperately looking for a woman  to marry. Desperation  is usually not a good sign. This means your list  of choices has grown  rather thin. In this thin list of men in their 30s  and 40s, you’re  likely to encounter more pragmatism than idealism. They  may have been  through similar experiences as you. Perhaps they are  divorced, or even  parents themselves (key difference, though, is their  kids are and will  remain with the ex, not with them), or perhaps they  have been single  all this time (unsuccessful with women, or maybe too  successful with  women). These men have careers, and many may be making  quite the buck.  The thing about the successful among these men -- whom  I’m assuming you  are interested in -- is they DO NOT want to waste time.  And the  motherhood that you bring into their lives may likely be a  major  problem for them, obviously. They may not be looking for a fresh   undergrad in her 20s, but they still want a legacy in the form of   children. And as I said above, just like any other man they don’t want   baggage. Do these men fall in love? Of course! But probably not before   considering many practical aspects of the relationship they are   embarking on and the woman they are dedicating themselves to. They will   not fall in love with you, nor you with them, like a 20 year old or a   teen.\n\nThere is also another aspect   to consider, which is love and passion. This may be less an objective   topic but I truly believe it is significant. Let’s take an extreme   example. Look at Romeo and Juliet: they’re teenagers, not middle-aged.   And there is a reason for that. You know one major factor that separates   the the young and the old? Foolishness. You read classical Western   literature from the ancient Greeks to the 19th century and there is a   common theme to the way writers and artists diagnose the young and the   old. We can understand their diagnosis in the form of an inner conflict   in every human being: an epic battle between Passion and Reason. In   youth, Passion reigns supreme and Reason is an untrained master-to-be;   Passion runs wild, and in its chaos the human being succumbs to   temptation and cannot resist pleasures or powerful rushes of emotions.   In old age, Reason ultimately tames Passion, and the human being is   composed, contemplative, stoic -- thinking before acting. The story of   Romeo and Juliet was only possible because they were young, since very   few people in their 30s would consider the risks of such a relationship   as “worth it”! It’s not worth it, it’s dangerous, it’s foolish --   mindless! Tell me, single mothers, do you think a man can be mindless   like this with you as he looks upon another man’s child that you hold in   your arms before his very eyes? Indeed, can you yourself afford to be   mindless like this with a new man, with your child in your arms? Ask   yourself this question seriously and think about it for a bit. Now,   maybe I’m making things too extreme in my example. But my point is this:   in our more matured state of being, we are more likely to THINK and   CONSIDER and CONTEMPLATE. These behaviours are not going to help the man   who is supposed to fall in love with you. The more he thinks about it,   and he will, the more he will see problems. The same goes with you:  you  are not as foolish as you were 10-15 years ago; indeed you do not  want  to repeat mistakes of the past, you are more careful, all of which   requires more thinking and deliberation. Such mental processes by   definition cannot allow for passion and swift decisions. And this is   thereby more likely to take love out of the picture all the more.\n\nSo   here you are in your single motherhood, complaining about men not  being  interested enough in you, and telling them that they “should be”   because you think you are “worth it”. Please remember that the bulk of   your worth to another person is not defined by you, it’s defined by the   other person! And unfortunately, you will have a very hard time   convincing the other person of your worth because you are at a major   disadvantage in the sexual marketplace. Is this fair? Yes and no. You   may have made a terrible mistake in your past and you may be the direct   cause of it, for which you now are paying the price. In that case, fair   or unfair, it’s karma or whatever you want to call it; actions have   consequences and you are now suffering the consequences of your actions.   Or, perhaps you did not make a mistake and you were harmed. That’s   horrible, and I’m sorry that you are in such a predicament. However, how   can you bring “fairness” into the picture, unless you’re talking to   some supernatural deity dealing wirh ethics and morality? You cannot   tell men who had nothing to do with you that they are being unfair to   you for not dating you for being a single mother -- even if you were a   victim and not the cause of your single motherhood. All of this is no   different from an incel man talking about how unfair it is that women   are not dating him, and that they “should” date him because he perceives   himself to be worth it. I mean, what do you expect people to do?  Should  they be forced to date you? Shamed into dating you? You really  think  this is a solution? You cannot make this into an issue of social   injustice; discrimination in the sexual marketplace is the law of our   reproductive natures. Everyone discriminates (women more so than men   actually), everyone holds their place in a hierarchy, and all of this is   inescapable. No one owes you sex or marriage according to any sort of   law or regulation -- human, God, or nature-made -- and you have no such   rights to be owed it. All you can do is make the best of the situation   that you are in, just as anyone else does. Your situation may be more   difficult than those of others but that is the hand you were dealt.   Perhaps the best you can do is to understand what the men you are   chasing desire from women and then try to change yourself in any way you   can to attract them. There is no ideal way to get yourself out of your   troubles, but you certainly won’t get anywhere by talking about what  men  should be doing for you based on your perceived self-worth.",
    "title": "Single Mothers: Men Don’t Owe You Anything",
    "subreddit": "MensRights",
    "timestamp": 1627499668,
    "score": 124,
    "keyword": "woman artist"
  },
  {
    "text": "Toward a new theory of gender II: on the harmful notion of 'toxic masculinity' This post is about the term \"toxic masculinity\" and why many people in the MRM consider it harmful. As I consider it a slur, the phrase will be abbreviated as 'TM'. Before I go into detail about why I think usage of the term TM is harmful, I want to elaborate on how traditional masculine gender roles have indeed harmed men in many ways. This perspective is important, but as I explain later, the problem is not with the individual man, but that society at large is still blind to the extent of male suffering, and forces often cruel standards on men that they cannot escape if they want to live a happy life.\n\nMen have always been shamed for not adhering to strict standards of masculinity, i.e. what was required of them by society at the time. There is an expectation that masculinity is something that has to be \"earned\". The transition from boy to man is often portrayed to be more of an ordeal based on hardships with the goal to achieve fame and social standing or to preserve some ideal for society's greater good. This can be observed in various cultures around the world, for example the [Filipino tradition called Tulì](https://en.wikipedia.org/wiki/Tuli_(rite)), which is \"regarded as a culturally sanctioned rite of passage from boyhood to manhood resulting in significant PTSD-like symptoms among much of the male population\" ([Post-traumatic stress disorder (PTSD) among Filipino boys subjected to non-therapeutic ritual or medical surgical procedures: A retrospective cohort study, Boyle & Ramos, 2019](https://www.sciencedirect.com/science/article/pii/S204908011930030)). According to the same paper:\n\n>Typically, an elderly man (manong) stretches the boy's foreskin over a wooden anvil (tree stump), places a “cut-throat” barber's razor (labaha) lengthwise on top of the foreskin and then with a few quick blows slices the foreskin wide open, thereby exposing the glans. The resultant traditional dorsal slit (superincision), while damaging in and of itself, at least spares thousands of erogenous nerve endings and highly specialized sensory receptors located within the inner foreskin. The newly-cut boys then bathe in the cool water of a nearby river or stream in order to lessen the pain, and they also apply chewed guava leaves to the genital wound in an attempt to control bleeding and promote more rapid healing.\n\nAnother example is the Sateré-Mawé tribe in Brazil, where they fill wicker gloves with bullet ants and put a sedative on them to make all of them fall asleep. Then they force a ten-year-old boy to put on these gloves, each of them filled with over 120 ants. The boy then has to keep his hands in them for ten minutes as he is being bitten by these ants. It's called a 'bullet shot' because getting a bite from a bullet ant is as painful as being shot. Men have reported wanting to cut off their own hands to escape it. People from the outside of the tribe who came to film a documentary about it were horrified because the boy in question was writhing on the floor in pain, screaming. It is so painful that the boy has to take up to a month to recover. Over the course of his life he has to repeat it 20 times to \"prove\" to the tribe that he is worthy of being a warrior, of being a \"true man\". [Click here for video footage.](https://www.youtube.com/watch?v=Cb5BK2NMAwU)\n\nMasculinity is often described as something that can be taken away at a moment's notice. A man can be \"emasculated\" while there is no similar word for women, and masculinity is frequently sought to be reinforced. Similarly, there is no shortage of terms to disparage feminine qualities in men, and more recently to shame men for not adhering to an adequate version of masculinity (TM). In the past, a husband's impotence or unwillingness to have sex was grounds for divorce. The inverse was also possible, but rare in practice. To determine the truthfulness of the wife's claim in front of the legal authorities, the husband had to prove his ability to perform for the court. This would often entail either actually having sex with his wife in front of the court or a physician, or having his genitals fondled (masturbation) by volunteer women to prove his potency. For example, [one case in 1441](https://historyofyesterday.com/putting-impotency-to-the-test-cb73bd8e92d0):\n\n>\\[The examining woman\\] exposed her naked breasts and with her hands warmed at the said fire, she held and rubbed the penis and testicles of the \\[husband\\]. And she embraced and frequently kissed the \\[husband\\], and stirred him up in so far as she could to show his virility and potency, admonishing him for shame that he should then and there prove and render himself a man. And she says, examined and diligently questioned, that the whole time aforesaid, the said penis was scarcely three inches long.\n\nMasculinity, or so I have seen it described, is very fragile. During WW1 and briefly during WW2 there was the White Feather Campaign where women shamed men as cowards and pacifists by handing out white feathers to men not in uniform. It has been noted that men subject to being \"white feathered\" have been scarred for life, demonstrating how uncomfortable men are at female disapproval, sometimes to the surprise of women. Another example is the sinking of the Titanic, after which surviving men were often shamed for not giving up their life boat seats for women and children.\n\nWomen determine and have always determined the current notions of masculinity and shape what is acceptable behavior for a man; manhod is contingent on the existence of womanhood and masculinity is traditionally defined by its differentiation from femininity. This can be described by [Briffault's law](https://www.psychologytoday.com/us/blog/machiavellians-gulling-the-rubes/201610/briffaults-law-women-rule), namely that \"the female, not the male, determines all the conditions of the animal family. Where the female can derive no benefit from association with the male, no such association takes place\". Women's role as child-bearers and child-raisers is the primary role, men's role only develops in a way to optimally support women in that role; one might say that female is the \"primary sex\". The patriarchy itself is a gynocentric arrangement. In the same vein, a man trying to adopt more feminine traits is seen as attempting to usurp privileges and get out of responsibilities he doesn't have the innate right to get, like a peasant trying to pass off as an aristrocrat. For example, male artists are not seen as 'lesser', they're seen as deserting their labor duties by doing something that might not earn money or will not get guaranteed results.\n\nAs phrases like 'male fragility', 'man up', 'male privilege', 'pussy', and 'grow some balls', TM uses shame and guilt as its vehicle to forcefully shape men's behavior and attitudes into something that the speaker deems more useful to their own goals. Functionally, TM is nothing more than a simplistic but effective marketing gimmick that allows the feminist idea of female oppression and male privilege to spread quickly and shame men to reshape masculinity into something that better serves the current needs of the ruling elite, and through their gynocentric orientation women. We used to need tough men ready to sacrifice themselves and take charge (that is what \"traditional male gender norms\" really are), now those same attitudes that made men sacrifice themselves for the 'greater good' do not rank high enough in a cost benefit analysis in terms of their use for our modern society, and we are shifting to a state of overt gynocentrism.\n\nAs Dr. Warren Farrell once said:\n\n>Regarding a boy as a hero is a social bribe that we created; a social bribe for that boy to be disposable. \\[…\\] Love is blind enough for him to never acknowledge that a woman who falls in love with the officer and a gentleman is attaching her love in part to his potential disposability. \\[…\\] For parents raising a daughter meant caring about her safety but raising a boy meant being caught between a parental rock and a hard place. We wanted our son to be safe, for sure, but we also wanted to feel proud that he served his country in time of war. So whether as a soldier, a firefighter or another first responder we give social bribes for young men to die; why? So that his potential for death might increase our potential for life.\n\nIt should be noted that guilt, shame and lack of self-worth are two of the most salient factors leading to depression in men. Thus, TM amounts to victim-blaming and is akin to telling men their place in society, shaming them for trying to fit into a narrow definition of what behavior is acceptable for their gender. TM is not a diagnosable disorder. It is often used to derail conversations about mental health and detract from the true reasons of men's suffering. On the contrary, it shifts the blame towards men, and ignores why men don't speak up about their problems. TM actually promotes what it pretends to fight because more often than not, it is used to assign blame (i.e. agency) to a man even if he was a helpless victim of his circumstances. When it comes to suicide for example, it has been found that men do open up about their problems, they are just not getting the help they need:\n\n* The paper titled [Masculinities and suicide: unsettling ‘talk’ as a response to suicide in men (Chandler, 2020)](https://www.tandfonline.com/doi/abs/10.1080/09581596.2021.1908959) argues that men do talk and seek help for their mental health problems. And that focusing on getting men to \"speak up\" is counterproductive and \"detracts attention from structural drivers of suicide\" in men.\n* The authors of [Suicide by middle-aged men (UK's National Confidential Inquiry into Suicide and Safety in Mental Health, 2021)](https://documents.manchester.ac.uk/display.aspx?DocID=55305) find that 91% of middle-aged men who committed suicide were seeking professional help for problems in their lives, including 50% who were seeing a mental health specialist.\n\nAs Elizabeth Hobson phrased it in [her 2019 speech \"The History of Feminism\" at Cambridge University](https://www.youtube.com/watch?v=3IFD4rQIX68) / [click here for a transcript](https://j4mb.org.uk/wp-content/uploads/2019/05/190524-transcript-of-Elizabeth-Hobsons-talk-at-Cambridge-Uni.pdf):\n\n>And the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?… We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately… I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying…”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending \\[pride\\] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalize the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonize men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.  \n>  \n>Regardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance.\n\nIn this sense, TM serves as a constant reminder of all the negative stereotypes associated with people of the male gender. TM is anti-male hate-speech, and there are many ways we can observe the cultural demonization of the male gender:\n\n* [Australian college principle Jane Boyle makes 7th-grader schoolboys collectively apologize to the girls for their gender](https://news.sky.com/story/schoolboys-made-to-apologise-for-stuff-we-didnt-do-during-assembly-about-sexual-assault-12260783)\n* [The pathologization of masculinity leads to teenage boy being chemically castrated for 'oppositional defiant disorder'](https://www.latimes.com/california/story/2020-07-15/teenage-boy-was-given-estrogen-developed-breast-tissue-while-in-l-a-county-juvenile-hall-lawsuit-alleges)\n\nAdditionally, the term reinforces rigid gender norms, and [according to labeling theory acts as a self-fulfilling prophecy](https://en.wikipedia.org/wiki/Labeling_theory). TM is a harmful term that makes it hard for boys and men to see themselves as victims, and directly goes against the notion that boys and men should open up about their emotions\n\nThe labeling TM also contributes to the notion of male perpetrator-hood and by extension female victim-hood and thus directly plays into the [Gamma Bias Hypothesis](https://link.springer.com/chapter/10.1007/978-3-030-04384-1_5). For some tangential empirical evidence of the Gamma Bias hypothesis see [Man up and take it: Gender bias in moral typecasting](https://www.researchgate.net/publication/342642686_Man_up_and_take_it_Gender_bias_in_moral_typecasting), a peer-reviewed and global study that shows that people more readily assume female victims and male perpetrators, that people assume that women suffer more pain from their harm, even when women fall in the perpetrator role, see male suffering as more deserved, fair and moral, feel more inclined to punish men and would like to dole out harsher punishments to men, assume more suffering and have more pity for women even in those cases where the real-world discrepancies signal that men have it worse. Women show a greater bias in almost all of the studies conducted. Alternatively, see [Dr. Tania Reynolds' YouTube video](https://www.youtube.com/watch?v=iR9tixOJSi0) about the same topic. Conversely, the same \"poisonously masculine traits\" are often celebrated in women, an effect described by the [Delta Bias Hypothesis](https://www.pjp.psychreg.org/wp-content/uploads/2020/12/seager-barry-168-171.pdf). In this way, TM can also serve as a mechanism of obscuration to hide overarching gynocentric societal attitudes from the average eye. As stated by William Collins in his book \"The Empathy Gap: Male Disadvantages and the Mechanisms of Their Neglect\":\n\n>Evolved matricentrism is enacted by those same emotions which drive the pair bond. This includes, for example, the key element of the ceding of moral authority to mothers, and by extension to women in general. One of the associated correlates of this moral authority is men's discomfort at female disapproval. The veil which has obscured this matricentrism is the traditional patriarchy which the feminists are so intent on smashing. The societal respect which patriarchy embodied hid, and hence made tolerable to men, the underlying matricentric subservience. As matricentrism has intensified into feminist gynocentrism, and the veil of respect for men has been withdrawn, **another mechanism of obscuration has become necessary. This is the doctrine of female oppression and poisonous masculinity.** For most people now, this new perspective on the sexes serves very effectively to hide gynocentrism. But it is a step too far. One cannot sweeten the pill by making it more bitter still. Some people are now rejecting a pill so bitter that it requires service to those who will continue to despise you. Matricentrism was never truly invisible to the  inquiring mind, more of an invisibility of convenience. And gynocentrism can be, and is being, perceived and resisted by many people, of both sexes. For women, resisting gynocentric tendencies may be equated with the responsible use of their power, motivated by the recognition of feminism's corrosive effects.\n\nAdditionally, TM conceals the effect female sexual mate selection has on male behavior and the fact that mothers, not fathers show a \"boys don't cry\" bias; see [Hypergamy](https://en.wikipedia.org/wiki/Hypergamy)^(1) and [Thomassin & Seddon (2019)](https://psycnet.apa.org/record/2019-46241-001) – Implicit attitudes about gender and emotion are associated with mothers’ but not fathers’ emotion socialization (or the [article summarizing the paper and articulating that even the authors expected to find the opposite](https://www.ctvnews.ca/sci-tech/boys-don-t-cry-study-suggests-mothers-not-fathers-show-gender-bias-towards-sons-1.4693208)). It has also been shown that females prefer stoic males for long-term mates ([Female Choice and Male Stoicism, Brown et al., 2018](https://www.ashdin.com/abstract/female-choice-and-male-stoicism-3240.html)).\n\nInstead of TM, prefer more appropriate labels: If a man engages in rape apologia, e.g. saying a boy being raped by an older woman was 'lucky', use the term 'internalized misandry'. If a man struggles to open up about his problems, realize that this is often because no one takes him seriously and use the term 'male invisibility'.\n\n^(1) See [this study that finds income is the primary factor that predicts a man getting married for evidence of female hypergamy](https://www.sciencedirect.com/science/article/abs/pii/S109051382100060X).",
    "title": "Toward a new theory of gender II: on the harmful notion of 'toxic masculinity'",
    "subreddit": "MensRights",
    "timestamp": 1636519422,
    "score": 37,
    "keyword": "woman artist"
  },
  {
    "text": "Is Bill Cosby Being Released From Prison A Major Blow To The #MeToo Movement?? Just a thought, but why hasn't musical artist Cardi B been charged for drugging and stealing from men? The U.S. court system imprisoned Bill Cosby with no physical evidence, but when a woman openly admits to abusing men... Nothing happens? The link below further discusses this topic. \n\n[https://www.youtube.com/watch?v=n91TdxwwQmU](https://www.youtube.com/watch?v=n91TdxwwQmU)",
    "title": "Is Bill Cosby Being Released From Prison A Major Blow To The #MeToo Movement??",
    "subreddit": "MensRights",
    "timestamp": 1627393511,
    "score": 27,
    "keyword": "woman artist"
  },
  {
    "text": "Ran across a new study: The men and women, guys and girls of the ‘manosphere’: A corpus-assisted discourse approach r/mensrights was one of the sources used.\n\n* https://journals.sagepub.com/doi/full/10.1177/0957926520939690\n\n* **The men and women, guys and girls of the ‘manosphere’: A corpus-assisted discourse approach**\n\n* **Abstract**\n\n* This study investigates how the lemmas woman, girl, man and guy are used to discursively represent and construct gender identities in an anti-feminist forum on the discussion website Reddit. The lemmas were analysed using corpus-assisted social actor analysis and appraisal theory. Similarities and differences within three sub-communities of the TRP subreddit were considered: Men’s Rights (activists who believe that men are systemically disadvantaged in society), Men Going Their Own Way (who abstain from relationships with women), and Red Pill Theory (primarily pick-up artists).\n\n* The corpus was characterised by bare assertions about gendered behaviour, although the masculine gender role was less well-defined than the feminine one. Women and girls were dehumanised and sexually objectified, negatively judged for morality and veracity, and constructed as desiring hostile behaviour from male social actors. **Conversely, men were constructed as victims of female social actors and external institutions** and, as a result, as unhappy and insecure.\n\nWell, at least the bolded part seems more or less correct.\n\nLooking through the actual quotes (they quoted one sentence or part of a sentence), I see very few from here, most are from MGTOW or TRP. \n\nI wonder what she would find if she examined FDS and r/ feminism? She'd probably find nothing of concern.",
    "title": "Ran across a new study: The men and women, guys and girls of the ‘manosphere’: A corpus-assisted discourse approach",
    "subreddit": "MensRights",
    "timestamp": 1621034950,
    "score": 10,
    "keyword": "woman artist"
  },
  {
    "text": "A rant about social media I am a 16 year old girl who enjoys social media. However, I've noticed there's a lot of misogyny going around. I was reminded of it recently when I saw a post about Arnold Schwarzenegger's two sons, one which is buff like his dad, who he was supposedly raised by, and the other who is overweight, supposedly raised by his mom. Everyone in the comments were saying stuff like \"this is why women shouldn't be allowed to parent\" and \"women can't raise healthy kids\" and it really pissed me off, becuas I want kids in the future and I don't want to look bad as a parent. \n\n\nAnd it wasn't just that that made me angry: there are memes which promote the idea that \"women cheat more than men\" by posting a quote that says \"like this post if women cheat more, and comment if men cheat more\" and then they disable the comments. \n\n\nThere was another one that I saw that compared women to shoes saying \"imagine you're buying a new pair of shoes, but then you discover that tons of other feet have been inside that shoe. Then you would not want it anymore since it has been used. Women should be seen the same\" or something along those lines. And another one where women are compared to a lock. It goes like this: \"if a lock can be opened by any key, its a shitty lock. But if a key can open any lock, it's a master key\". Ummm excuse me? And I couldn't report it because there is no \"sexism\" option. \n\n\nMeme pages post ads of women sexualizing themselves or someone else sexualizing women, and its all really upsetting to watch. Those posts don't really get taken down either, and I see all these degenerates slobbering over this girl who us probably really insecure and was never taught to act better and more sincere, they probably just need love and support, but all these comments just make it worse. \n\n\nAnd aside from all of that, there's the \" women aren't funny\" menes, and the \"me and the boys\" where men get to be quirky or whatever, but it's \"cringe\" and \"stupid\" if a girl wants to act that way too. There's also the \"woman moment\" comment that people like to spam when they see a girl make some sort if mistake in a video or picture. And to top it all off, girls and even guys are chastised in the comments if they try to point out that it's sexist or misogynistic to say those things. \n\n\nI've ended up unfollowing a lot of meme pages and even artists and stuff that promote this kind of stuff. I'm honestly so tired of it and it needs to stop. Oh, and don't even get me started on the homophobic, transphobic, racist memes too. Like as a whole,  nothing is getting better. Posts like don't even get taken down because there isn't an option to report for racism, homophobia, or sexism. You can report for violence, nudity, animal abuse, t*rrorist theats, and a few other things. Social media apps need to start cracking down on all these other issues and to stop ignoring them.",
    "title": "A rant about social media",
    "subreddit": "Feminism",
    "timestamp": 1629144409,
    "score": 42,
    "keyword": "woman artist"
  },
  {
    "text": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari Excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari\n\nhttps://www.amazon.com/Sapiens-Humankind-Yuval-Noah-Harari/dp/0062316095\n\n***\n\n\"Different societies adopt different kinds of imagined hierarchies. Race is very important to modern Americans but was relatively insignificant to medieval Muslims. Caste was a matter of life and death in medieval India, whereas in modern Europe it is practically non-existent. One hierarchy, however, has been of supreme importance in all known human societies: the hierarchy of gender. People everywhere have divided themselves into men and women. And almost everywhere men have got the better deal, at least since the Agricultural Revolution.\n\nSome of the earliest Chinese texts are oracle bones, dating to 1200 BC, used to divine the future. On one was engraved the question: ‘Will Lady Hao’s childbearing be lucky?’ To which was written the reply: ‘If the child is born on a ding day, lucky; if on a geng day, vastly auspicious.’ However, Lady Hao was to give birth on a jiayin day. The text ends with the morose observation: ‘Three weeks and one day later, on jiayin day, the child was born. Not lucky. It was a girl.’4 More than 3,000 years later, when Communist China enacted the ‘one child’ policy, many Chinese families continued to regard the birth of a girl as a misfortune. Parents would occasionally abandon or murder newborn baby girls in order to have another shot at getting a boy.\n\nIn many societies women were simply the property of men, most often their fathers, husbands or brothers. Rape, in many legal systems, falls under property violation – in other words, the victim is not the woman who was raped but the male who owns her. This being the case, the legal remedy was the transfer of ownership – the rapist was required to pay a bride price to the woman’s father or brother, upon which she became the rapist’s property. The Bible decrees that ‘If a man meets a virgin who is not betrothed, and seizes her and lies with her, and they are found, then the man who lay with her shall give to the father of the young woman fifty shekels of silver, and she shall be his wife’ (Deuteronomy 22:28–9). The ancient Hebrews considered this a reasonable arrangement.\n\nRaping a woman who did not belong to any man was not considered a crime at\n\nall, just as picking up a lost coin on a busy street is not considered theft. And if a husband raped his own wife, he had committed no crime. In fact, the idea that a husband could rape his wife was an oxymoron. To be a husband was to have full control of your wife’s sexuality. To say that a husband ‘raped’ his wife was as illogical as saying that a man stole his own wallet. Such thinking was not confined to the ancient Middle East. As of 2006, there were still fty-three countries where a husband could not be prosecuted for the rape of his wife. Even in Germany, rape laws were amended only in 1997 to create a legal category of marital rape.\n\nIs the division into men and women a product of the imagination, like the caste system in India and the racial system in America, or is it a natural division with deep biological roots? And if it is indeed a natural division, are there also biological explanations for the preference given to men over women?\n\nSome of the cultural, legal and political disparities between men and women reject the obvious biological differences between the sexes. Childbearing has always been women’s job, because men don’t have wombs. Yet around this hard universal kernel, every society accumulated layer upon layer of cultural ideas and norms that have little to do with biology. Societies associate a host of attributes with masculinity and femininity that, for the most part, lack a rm biological basis.\n\nFor instance, in democratic Athens of the fifth century BC, an individual possessing a womb had no independent legal status and was forbidden to participate in popular assemblies or to be a judge. With few exceptions, such an individual could not bene t from a good education, nor engage in business or in philosophical discourse. None of Athens’ political leaders, none of its great philosophers, orators, artists or merchants had a womb. Does having a womb make a person un t, biologically, for these professions? The ancient Athenians thought so. Modern Athenians disagree. In present-day Athens, women vote, are elected to public office, make speeches, design everything from jewelry to buildings to software, and go to university. Their wombs do not keep them from doing any of these things as successfully as men do. True, they are still underrepresented in politics and business – only about 12 per cent of the members of Greece’s parliament are women. But there is no legal barrier to their participation in politics, and most modern Greeks think it is quite normal for a woman to serve in public office.\n\nMany modern Greeks also think that an integral part of being a man is being sexually attracted to women only, and having sexual relations exclusively with the opposite sex. They don’t see this as a cultural bias, but rather as a biological reality – relations between two people of the opposite sex are natural, and between two people of the same sex unnatural. In fact, though, Mother Nature does not mind if men are sexually attracted to one another. It’s only human mothers steeped in particular cultures who make a scene if their son has a fling with the boy next door. The mother’s tantrums are not a biological imperative. A significant number of human cultures have viewed homosexual relations as not only legitimate but even socially constructive, ancient Greece being the most notable example. The Iliad does not mention that Thetis had any objection to her son Achilles’ relations with Patroclus. Queen Olympias of Macedon was one of the most temperamental and forceful women of the ancient world, and even had her own husband, King Philip, assassinated. Yet she didn’t have a t when her son, Alexander the Great, brought his lover Hephaestion home for dinner.\n\nHow can we distinguish what is biologically determined from what people merely try to justify through biological myths? A good rule of thumb is ‘Biology enables, Culture forbids.’ Biology is willing to tolerate a very wide spectrum of possibilities. It’s culture that obliges people to realise some possibilities while forbidding others. Biology enables women to have children – some cultures oblige women to realise this possibility. Biology enables men to enjoy sex with one another – some cultures forbid them to realise this possibility.\n\nCulture tends to argue that it forbids only that which is unnatural. But from a biological perspective, nothing is unnatural. Whatever is possible is by definition also natural. A truly unnatural behaviour, one that goes against the laws of nature, simply cannot exist, so it would need no prohibition. No culture has ever bothered to forbid men to photosynthesise, women to run faster than the speed of light, or negatively charged electrons to be attracted to each other.\n\nIn truth, our concepts ‘natural’ and unnatural’ are taken not from biology, but from Christian theology. The theological meaning of ‘natural’ is ‘in accordance with the intentions of the God who created nature’. Christian theologians argued that God created the human body, intending each limb and organ to serve a particular purpose. If we use our limbs and organs for the purpose envisioned by God, then it is a natural activity. To use them differently than God intends is unnatural. But evolution has no purpose. Organs have not evolved with a purpose, and the way they are used is in constant ux. There is not a single organ in the human body that only does the job its prototype did when it first appeared hundreds of millions of years ago. Organs evolve to perform a particular function, but once they exist, they can be adapted for other usages as well. Mouths, for example, appeared because the earliest multicellular organisms needed a way to take nutrients into their bodies. We still use our mouths for that purpose, but we also use them to kiss, speak and, if we are Rambo, to pull the pins out of hand grenades. Are any of these uses unnatural simply because our worm-like ancestors 600 million years ago didn’t do those things with their mouths?\n\nSimilarly, wings didn’t suddenly appear in all their aerodynamic glory. They developed from organs that served another purpose. According to one theory, insect wings evolved millions of years ago from body protrusions on flightless bugs. Bugs with bumps had a larger surface area than those without bumps, and this enabled them to absorb more sunlight and thus stay warmer. In a slow evolutionary process, these solar heaters grew larger. The same structure that was good for maximum sunlight absorption – lots of surface area, little weight – also, by coincidence, gave the insects a bit of a lift when they skipped and jumped. Those with bigger protrusions could skip and jump farther. Some insects started using the things to glide, and from there it was a small step to wings that could actually propel the bug through the air. Next time a mosquito buzzes in your ear, accuse her of unnatural behaviour. If she were well behaved and content with what God gave her, she’d use her wings only as solar panels.\n\nThe same sort of multitasking applies to our sexual organs and behaviour. Sex first evolved for procreation and courtship rituals as a way of sizing up the fitness of a potential mate. But many animals now put both to use for a multitude of social purposes that have little to do with creating little copies of themselves. Chimpanzees, for example, use sex to cement political alliances, establish intimacy and defuse tensions. Is that unnatural?\"",
    "title": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari",
    "subreddit": "Feminism",
    "timestamp": 1627323647,
    "score": 32,
    "keyword": "woman artist"
  },
  {
    "text": "where did telling women to smile come from? it's such a weird thing to me. I mean, obviously the instinct to harass women on the street doesn't make sense, but like. How did the meme of harassing women in such a *bizarre* way spread from man to man? Does anybody know what popularized it?\n\nI can't picture in my head one sexual harasser turning to the guy next to him on the bus and going, \"hey, the next time you're harassing a woman on the street, try doing it in this very strange way\". Like, I know the \"ask a girl if she has a bf, if she says no then act like that means she can't say no to u, if she says yes then act like her not being married to the guy means she can't say no to u\" sexual assault flowchart came from \"pickup artists\" (read also: sexual assault advocates). Was it something that was on tv somewhere?\n\nI put a little effort in & discovered that google had 0 results for \"stop telling women to smile\" prior to 2012\\*, had 1 result in 2012 then 2013 & beyond there were too many results to count. (everybody I've asked doesn't remember getting this line from before about then so *anecdotally* these dates appear to line up). Which, combined with the fact that it seems to be extraordinarily (not exclusively, of course) popular among older men reinforces my working hypothesis that it isn't a naturally occurring, just like, random meme. If it were I'd imagine it'd have had a more gradual ramp-up in articles talking about it instead of going from 0 per year to thousands. Also the fact that ppl talking about it pretty closely correlates to g@mergate seems... potentially related? Weird coincidence if not\n\n&#x200B;\n\nAnybody know anything abt it?\n\n&#x200B;\n\n^(\\* there was 1 result that google attributes to before 2012 but it's just a sidebar link to an article written after 2012, the actual pre-2012 article itself is unrelated)",
    "title": "where did telling women to smile come from?",
    "subreddit": "Feminism",
    "timestamp": 1627005522,
    "score": 25,
    "keyword": "woman artist"
  },
  {
    "text": "‘Men who hate women’ - Laura Bates 2020 - Has anyone read it? TW discussion of online forums within the manosphere with calls for extreme violence against women and descriptions of terror attacks.\n\nIs anyone else reading this or has anyone else read this book? If so what are your thoughts?\n\nOr if you haven’t read the book; what are your thoughts generally on the ‘manosphere’ and the risks they pose? Or the media and governments response to these issues?\n\nI think quite possibly it’s one of the most important books written recently. Exposing men who hate women. An issue that desperately needed to be highlighted for so long.\n\nIt’s a terrifying eye opener to the extreme online misogyny of Incels, PUAs, ‘so called’ Men’s rights activists and MGTOW which is rarely taken seriously but so often manifests within the ‘real world’ as violence against women and terrorism.\n\nIt’s an uncomfortable read but an important one!\nIt highlights the links between these groups and the Alt-right as well as the misogynistic and orchestrated attack on female politicians, journalists and quite frankly any woman who dares to have an opinion.\n\nIt shines a light on the sexual harassment and violence promoted by some in the PUA industry by so-called gurus’ who advocate for the legalisation of rape on private property. With certain PUA forum users feeling completely comfortable to comment things such as:\n\n‘If they reject me I grope them…I assault them because they deserve it and I take back what is mine and I don’t care about anything other than my own needs’\n\nIt highlights commonly held views of the manosphere about female inferiority. Laura stumbles upon one particular thread entitled ‘should women be considered human’ the general consensus was no because women are all whores!\n\nCasually calling for violence and rape. There are a section of Incels called rapecells (I did not know this) both groups frequently debate which type of women would make ideal sex slaves and talk about Roasties who are women who according to them have ‘too’ much sex and as a result have deformed Labia’s.\n\n‘talking female slaves has always been a normal part of human history’\n\nThis book brings attention to the misogynistic terrorist attacks (12 are listed) between 2009 and the present day by men openly affiliated with online Incel groups alone!\n\nThough the media has consistently failed to report the motivations of such attacks unlike other types of terrorism referring to the men who commit them simply as ‘lone-wolves’ or mentally ill.\n\nFew links are drawn between the attackers themselves or the ideologies they adhere to. Despite the fact most of the terrorists drew links themselves! Many of them ‘hailed’ the misogynistic terrorists that went before them and all either explicitly explained their motivations as a hatred of women or were active members of online misogynistic groups.\n\nThey left ‘manifestos’ or suicide notes saying things such as:\n\n‘The ultimate evil behind sexuality is the human female…they think like beasts and in truth they are beasts’\n\n‘ I will slaughter every single spoiled, stuck up blonde slut’\n\n‘I will be a god punishing women from their depravity… I cannot kill every single female on earth but I can deliver a devistating blow which will shake all of them to the core of their wicked hearts’\n\n3 quotes curtesy of Elliot Rodger 2014\n\nHe went on to kill 6 and injure 14 in a terrorist attack.\n\nOr\n\nBen Moynihan in 2014 (the same year) who attempted to stab 3 women to death in Portsmouth. Before he wrote:\n\n‘I think every girl is a type of slut, they don’t give boys like us a chance’\n\nOr\n\nGeorge Sodini in 2009 who walked into an LA fitness turned the lights off and started firing bullets into a group of women taking an aerobics class because women wouldn’t give him sex. He had links to an online pickup artist community and was directly linked fo Incels.\n\nIn a world where views like this are commonly espoused it is unsurprising real acts of violence and terror are committed against women.\n\nwith MGTOW forums commonly discussing false rape allegations and making outrageous statements like:\n\n‘we do not know how many false accusations there are. They could be the majority’\n\nOr views like this:\n\n‘Women are out of control and have been for a very long time’\n\nor\n\n‘so-called’ Men’s rights Activists who frequently suggest on ‘A voice for men’ that women are intellectually inept:\n\n‘pussy is the only real empowerment women will ever know…wishful thinking of feminist ideology aside, what remains is the fact that it is men and pretty much men only who draw power from accomplishment, who invent technology, build nations, cure disease, create empires and generally advance civilisation’\n\nDoes anyone have any views on these groups and the danger they pose? Or why the media and governments have been so silent on the issue?\n\nhttps://youtu.be/z23mnV3Ga5Y",
    "title": "‘Men who hate women’ - Laura Bates 2020 - Has anyone read it?",
    "subreddit": "Feminism",
    "timestamp": 1609730027,
    "score": 16,
    "keyword": "woman artist"
  },
  {
    "text": "Female leaders of India (way back in time) Hi guys! Just came across a clip which really surprised me: [https://www.youtube.com/watch?v=BlsZvuNhp4U&ab\\_channel=BrutIndia](https://www.youtube.com/watch?v=BlsZvuNhp4U&ab_channel=BrutIndia) \n\nThis is a clip of Sorojini Naidu (ambassador of India) when she gave a speech in America in flipping 1928!! Its tremendously interesting how India appointed a woman as an international ambassador for the entire country a 100 years back. Even more interesting is how determined, intelligent, and educated she must of been to prove her credibility in those days. Note, she spoke perfect English, despite here having to juggle several Indian languages.\n\nI am Indian, and yes, there are certainly many problems in Indian society today which I hope are solved as quickly as possible. But, India was not always like this! In Hinduism, we apparently have many Goddesses (1 which even defeated the most powerful male Gods together). This is just to show that women did play important roles in society. Even today, there are tons of well known female politicians in office. \n\n\\*\\* Totally irrelevant, but when I mean Gods/Goddesses, I actually mean deities. Most hindus believe in 1 God, and the rest are deities (other divine beings less than God). They simply believe 1 of those deities as God and others as deities. There is a sub-religions which also believe in a female goddess to be that 1 supreme God. Unrelated, thought I should just throw it out there.\n\nThat being said, I totally agree that there are certainly problems in today’s Indian society. This can be due to many reasons which were introduced, and maybe some of these reasons always existed, I don’t know. I wish we can treat both genders with the same respect (and maybe show some extra respect to mothers as they are awesome!). \n\nIn fact, India had their first female Prime Minister in 1966 (although she turned out to be a devastating PM - but hey so were some men - I guess evil and failure are just part of some humans no matter the gender). \n\nIn fact throughout history, there are examples of Indian females who lead armies and fought as Queens and while being mothers/daughters/wives/sisters... which is mind blowing. There are also examples of women scientists, artists, e.t.c. Heres a quick google search: \n\n[https://owlcation.com/humanities/Greatest-Indian-Women-From-History](https://owlcation.com/humanities/Greatest-Indian-Women-From-History) Hopefully young women can use these women as role models and accomplish whatever their hearts desire. \n\nSorry for the Indian example, but I’m sure women of all nationalities are just as accomplished or even more so! Feel free to share below!\n\nNOTE - I support feminism defined as: Women should be given the same opportunities as men, nothing more and nothing less. I do not support radical feminist views.",
    "title": "Female leaders of India (way back in time)",
    "subreddit": "Feminism",
    "timestamp": 1616898612,
    "score": 12,
    "keyword": "woman artist"
  },
  {
    "text": "Reclaim your power • reclaim your body • reclaim all that they have tried to rob you of Happy International Women's Day!\n\nhttps://preview.redd.it/tw7xddjfdtl61.png?width=667&format=png&auto=webp&s=9a8f9483ab8bca90e42f779433e7e6a5870906fa\n\ncredit: artist on Instagram @ elwingbling\n\n Reclaim your power • reclaim your body • reclaim all that they have tried to rob you of  \n•  \nrecognize the tools of fear and hatred for your awesome power and reject them • recognize the weapons used against you and that they’ve taught you to use against yourself, pick them up and fight to defend your awesome power  \n•  \n<<and don’t ignore the ways race, class and histories of conquest and colonialism play into this, and the flip side of these terms - the “compliments” that likewise seek to control women’s bodies - of being a “good woman,” “wife material,” chaste, virtuous, the constructs of the virgin, and all the gendered trappings of respectability politics>>",
    "title": "Reclaim your power • reclaim your body • reclaim all that they have tried to rob you of",
    "subreddit": "Feminism",
    "timestamp": 1615213790,
    "score": 8,
    "keyword": "woman artist"
  },
  {
    "text": "I found this initiative and found it incredible. 5 woman artist [https://nmwa.org/support/advocacy/get-facts/](https://nmwa.org/support/advocacy/get-facts/)\n\n&#x200B;\n\nYou can get facts about the lack of representation; and download a pletora of shareable content!",
    "title": "I found this initiative and found it incredible. 5 woman artist",
    "subreddit": "Feminism",
    "timestamp": 1636303495,
    "score": 8,
    "keyword": "woman artist"
  },
  {
    "text": "Emma Goldman Papers Public History Project In addition to Emma’s birthday on the 27th, June toasts many anniversaries:  a time of the solstice, of pride and of celebrated struggle. While we at the EGPPHP may be more familiar with Berkeley’s infamous June gloom fog, we envy the dry heat and choruses of cicadas and ice cream truck chimes of our eastern neighbors. In tribute to the beginning of the summer season, we thus offer our readers what we hope is a refreshing treat.\nDid you know that Emma Goldman was once the proprietor of not one, but two ice-cream parlors?\n\nShe and her comrade Alexander Berkman longed to participate in the shaping and promise of the early revolution in Russia. How the twenty-something year old Emma could raise money for passage seemed almost insurmountable. Wracking their brains they  conjured up a novel idea of opening an ice cream shop.  Even though she never overcame the fears of the Worcester locals who dared not have their children tainted by the presence of a  notorious anarchists in their midst, they managed to turn a profit. Surreptitiously, an entourage of teenagers snuck out of their homes and lined up to imbibe and luxuriate on Emma’s double scoops of chocolate and vanilla ice cream.\n\nThe first volume of our \ndocumentary edition, Emma Goldman: A Documentary History of the American Years: Made for America, 1890-1901**, documents her first foray into the ice-cream world: “...stirred by accounts of the tsar’s latest atrocities, [Sasha, Emma and Fedya] came upon the all-American idea of opening an ice-cream parlor to fund their return…[b]ut even double scoops could not secure a steady flow of cash, 0ff-season in a hot-weather business, thus dashing their hopes of joining the international supporters of the brewing revolution in their mother country”(Volume 1, p.22).**\nIn the January 16, 1954 issue of The New Yorker, the writer S.A. Behrman recalled visiting the Worcester, Massachusetts location of Emma Goldman and Alexander Berkman’s first and successful ice-cream parlor and luncheonette, located at 86 Winter Street (Living My Life, p. 82). \n\n\"The counter was neat, and the blowzy-headed, benevolent deity stood behind it. When...asked ...what I wanted, I was tongue-tied; I fully expected some emanation from the apikorista to pulverize me...When it came—double scoop, twice what you would have got (in town) Miss Goldman left us, and we sat at the counter and ate.”(Behrman, 1954). While Behrman concludes his article with an admission that his recollection may have been a mere false memory, his piece provides a foray into the imagined space.\nA few years later, encouraged by their windfall, they ventured into the proprietorship of yet another ice cream shop--this time in the Brownsville neighborhood of Brooklyn--with much less success. Emma launched her second endeavor into the ice cream world in the Spring of 1895 (Volume One, p. 500). Alongside Claus Timmerman and Ed Brady, and with funding from Modest Stein, she opened a parlor in Brownsville, a prominent working class Jewish neighborhood in Brooklyn, New York. The attempt was unfortunately short-lived: \n“It occured to me that we might try something like our ice-cream parlour in Worcester. It had been successful there; why not in New York? Ed approved of the project and suggested that we proceed at once… I had saved a little money, and Fedya offered us more. Friends advised Brownsville: it was a growing centre, and a store could be got not far from the race-tracks, where thousands of people were passing daily. So to Brownsville we went and fixed up a beautiful place. Thousands did pass by there, but they kept on passing. They were in a hurry to get to the race-track, and on their way home they had already visited some ice-cream store nearer the track… our daily receipts were not enough to cover the venture… Ed tried to laugh away our plight, but he was evidently unhappy. We gave up the business and returned to New York. In three months, we had lost five hundred dollars…”(Living My Life, p. 161).\n\nIn his excellent book, The Dairy Restaurant (Nextbook Press, 2020), Ben Katchor carefully tracks the meals, both eaten and prepared, by Emma: “Through the pages of Emma Goldman’s autobiography, we can chart her socio-political movements by the cafes and restaurants she visits”(Katchor, 280). These included not only establishments she patronized throughout the city and boroughs, including Sachs Cafe (on Suffolk Street), Joseph Knirim’s salon on North William Street, or the Zum Groben Michel Salon, but also Goldman’s very own Worcester and Brownsville parlors. \n\nIn Other News:\n 2021 marks the 150th Anniversary of the Paris Commune, March 18th-May 27, 1871.  Inspired, Emma Goldman often lectured about the significance of the Commune. Subsequently she befriended Louise Michel, communard and anarchist, while Michel was exiled in London. \"Ever since I had read about the Paris Commune, its glorious beginning and its terrible end, Louise Michel had stood out sublime in her love for humanity, grand in her zeal and courage…This…was the woman who had survived the savagery of the respectable Paris mob….she would die for the Cause”(Living my Life, p. 166). There’s a fascinating look at the artistic representation of the Paris Commune in Hyperallergic. \nL’Archive de Paris has several online exhibitions of ephemera and documents from the Paris Commune currently viewable. Also, an animated documentary film about the Paris Commune was recently created and broadcast for the sesquicentennial in France for Arte TV, Les Damnés de la Commune**.**\n📷\nFrom the EGPPHP office:\nWe at the Emma Goldman Papers Public History Project appreciate  your generous donations and continued belief in the value of our work. Candace has been working from home, and remains in constant communication with EGPPHP staff. Right now she’s  in treatment for what she considers to be “a miserable malady”though she is getting better each day. She continues to write acknowledgements to donors with great pleasure, appreciation, and is honored by your generosity-- but is concerned about whether she might inadvertently omit recognition of some of the project’s most loyal “Emmassaries.”  \nYour Support is Greatly Needed at This Time:\nThe EGPPHP has to raise a minimum of $20,000 to compensate for the delayed payments and anticipated expenses incurred by Ayelet Maida, our Publishing Project Manager. \nHelp us complete the last volume by sending a tax-deductible donation through our secure PayPal account: https://www.paypal.me/EGPPHP\nOr send a check by mail to: \n ISI- ℅ Emma Goldman Papers Public  History Project,\n 2241 Channing Way\n Berkeley, CA 94704\nIf you would like to dedicate your donation “In honor of” or “In memory of” a person or event, please let us know.  The dedication will be included in our forthcoming volume — Democracy Disarmed 1917-1919**.**\n📷\nWays to Stay in Touch:\nEmail: egpphp@gmail.com\nFollow project news on facebook: @TheEmmaGoldmanPapers\nWe are now on Instagram! Please follow us to see what we’re up to: https://www.instagram.com/emmagoldmanpapers/\nDon’t forget to subscribe to our newsletter: http://eepurl.com/g3sAZz\n A reminder that our 22,000 document treasure trove is free and accessible to all:\nhttps://archive.org/details/emma\ngoldmanguide00falk\nand\nhttps://archive.org/details/emma\ngoldmanpapers\n📷\nWith love, gratitude, and strength,\nCandace, Alex, Angela, and Vanessa\nAyelet, Kirsten, Sheila, and Susan\nLongtime volunteers: \nJune and Rae\nOutreach mavens:\nLaura, Paul, Cookie, and Jonathan\nFaculty advisors: \nLeon  F. Litwack and Robert P. Cohen",
    "title": "Emma Goldman Papers Public History Project",
    "subreddit": "Feminism",
    "timestamp": 1625105799,
    "score": 6,
    "keyword": "woman artist"
  },
  {
    "text": "The She Series book (Kickstarter) Artist Karen Hallion just launched a Kickstarter for a book that contains 100 essays and portraits of women who inspire. The book is written by 50 different female and non-binary writers. Each portrait is accompanied by a verb that describes an action that relates to the essay and the woman it is about.  \n\n\nhttps://preview.redd.it/rnnz0ua4gza71.png?width=680&format=png&auto=webp&s=650eefae8982fdf84266f6aad932b8c6f32bd53d\n\n  \n[https://www.kickstarter.com/projects/celara/the-she-series-book](https://www.kickstarter.com/projects/celara/the-she-series-book)\n\nFull disclosure, Karen is my wife. She has been working so hard on this series for the past three years and I am so incredibly proud of her. We have both been astonished by the response and the support and believe this book is so important to help shine a light on so many incredible women.  \n\n\nI hope I'm not breaking any of this subreddit's rules, but if I am, please feel free to delete this.",
    "title": "The She Series book (Kickstarter)",
    "subreddit": "Feminism",
    "timestamp": 1626183263,
    "score": 2,
    "keyword": "woman artist"
  },
  {
    "text": "Motherhood's Place in Music - A Look at the Work of Alela Diane Country music has had problems with women, from Tomato-gate in 2015 to the meat-headed dude-bros that filled in the gaps after post-9/11 nationalism was on the outs. And that's with women simply existing, let alone expressing autonomy or the issues and experiences they face. But going to the fringes of the genre may surprise you...\n\n&#x200B;\n\nEnter Alela Diane. An Oregon based country-folk singer with deep, rich vocals and perpetually soulful aura, she debuted in 2003 with a self-released album. Her second self-released album was picked up by a label in 2006 to a dedicated circle. Since then she's been a cult name in folk circuits and has had some interesting twists and turns including unexpected popularity in France, 2 collaboration albums, and a brief stint as the frontwoman in a cover band to name a few.\n\nBut I'd like to highlight her 6th album; 2018's *Cusp*. This post is something of an amalgamation of several interviews and articles on the album. Citations will be numbered with reference links at the bottom.\n\nIn 2012 following her 4th album, she divorced her husband who was also part of her backing band. After all was said in done, she'd lost her marriage, her co-writer, her backing band, and her label.^(\\[2\\]) The experience inspired her 5th album, 2013's *About Farewell*, a shockingly impartial yet personal break-up album. She took a more involved workload on it, including recording and mixing^(\\[6\\]), but faced trouble finding a label because at the time; she was pregnant.\n\n“As soon as \\[record labels\\] found out I was pregnant, it was totally off the table. They assumed because I was having a kid, I suddenly was obsolete and wouldn't be able to continue working.”^(\\[2\\]) \"As a performer especially, there’s pressure to be perceived as available and sexy.... Motherhood is, in a lot of ways, really contradictory to all of those things.\"^(\\[4\\])\n\nAbout Farewell was eventually picked up by Rusted Blue Records. It released in June, Alela remarried in August, and gave birth to her first daughter in October. After a one year sabbatical to adjust to family life and a collaboration album with Ryan Francesconi to ease herself back to work^(\\[2\\]), she begun her next album.\n\nFollowing the changes in her life, her 6th album, *Cusp*, is centered on motherhood^(\\[2\\]). “It was really wonderful to be able to get back in touch with my creative side and just reflect on the intensity of what I’d been going through, becoming a mom.\"^(\\[1\\]) She conceived again during production and recorded while pregnant. During the week in February 2017 mixing was set to start, she went into labor. It was 5 weeks early.^(\\[1\\])\n\nBoth Alela and her daughter survived, but not without trials. \"I had severe complications such as HELLP syndrome and hemorrhaging.\"^(\\[5\\]) \" “I had something similar to preeclampsia and I nearly bled to death,” she nonchalantly states. “So, it was a really lovely time for me, but when I did live and my life was saved and when you have a moment in life when you feel your mortality so intensely like I did, it just makes you appreciate every day so much more and I am not taking anything for granted - and the same goes for this experience of being able to share my music.”^(\\[2\\])\n\n*Cusp* was held for a year while Alela recovered, but the harrowed birthing process and another daughter only reinforced the messaging of both the album and Alela herself who has been stalwart against the industry's pressures.\n\n**In music, one of the most transformative experiences a woman can have is also an unspoken artistic taboo: Have a baby if you must. But for goodness’ sake, don’t write songs about it.**^(\\[1\\])\n\n“I hope that by exploring motherhood in song, I can help demand respect for the life givers we are. Talking and singing about the experience of motherhood is not something I can shy away from. ... This music is about motherhood. Even just by saying that, it feels like people will write you off.\"^(\\[1\\]) \"I tend to write from a very personal narrative perspective, and this is a phase I’m in right now. I have two daughters and I wanted to carve out that space in music.\"^(\\[3\\]) \"I think women are under a lot of pressure to go on as if nothing happened, if they’re working women. As a performer especially, there’s pressure to be perceived as available and sexy.... Motherhood is, in a lot of ways, really contradictory to all of those things.\"^(\\[4\\])\n\n\"I couldn’t pretend that I’m making the same music as I was 10 years ago or that I’m the same person I was 10 years ago, so for me this topic is relevant to my life and I think it’s such an important and transformative experience in a woman’s life that there needs to be a place for it in art.\"^(\\[3\\])\n\nThe impact of touring is also never far off. \"The job of being at home with kids is more exhausting than most things. It’s so under-appreciated. It’s also, in our culture and still to this day, largely viewed as the woman’s job. For me to be able to leave for three weeks, I have such a supportive husband, and I would not be able to do this if I didn’t. It’s also interesting to compare: I’m a woman in music, but for men who are touring musicians and have kids, it’s like, no questions asked, they just leave.\"^(\\[4\\])  “Male artists can have children and they can go on tour more easily, leave the family at home and no one thinks about it all, because women inherently have such an intense role in the child rearing and bearing years. It's the expectation that the women will be at home taking care of the kids and that's not always the case. It's a lot easier for men to just kind of leave and to separate those two things,”^(\\[2\\])\n\nThe new anxieties of touring and being away from her family is touched in the opening track, Albatross. “The chorus is a reference to flying overseas and having to leave my kid at home, the intensity of that,”^(\\[1\\]) \n\n>I'd rather be an albatross, flyin' high  \n>  \n>Than in the tailwinds  \n>  \n>Looking back at what I left behind\n\nIt's one of several perspectives throughout the 11 tracks that extend beyond herself and her daughters.\n\nPerhaps most poignant is *Emigré*, inspired by the widely publicized death of Alan Kurdi in the Syrain refugee crisis. He was 3 years old.\n\n>I can feel the fear hang heavy on the water  \n>  \n>Glinting sharply with the pale moonlight  \n>  \n>Mothers hold on tightly to your children  \n>  \n>As the waves are breaking violently tonight  \n>  \n>Seabirds fly the salty wind  \n>  \n>East to South – North to West  \n>  \n>Can we go, as they go, across the borderlines?\n\n\"When you have children you would do anything to keep them safe. It was that knowledge and that love, the painful aching part you feel for a child, that encouraged me to address that and to write that song.\" On the video, Alela Diane is holding her one year old in her arms. She felt it was justified. \"It felt relevant because what I was trying to show is just every mother wants to keep her baby safe, and to have freedom. Everyone deserves that.\"^(\\[3\\])\n\n*Never Easy* is a striking reexamination of her relationship with her own mother.\n\n>I didn't know how much you loved me  \n>  \n>I didn't know until I had my own little daughter  \n>  \n>Oh, my mama, I understand now  \n>  \n>That you've always loved me more\n\n\"When our first daughter was born, I felt the hugeness of the love that my own mother feels for me. I knew my mom loved me deeply, but when I felt that sort of love for my own child, I realized for the first time that my own mom has always loved me more than I love her. That knowledge is beautiful and heartbreaking.\"^(\\[2\\])\n\n*Song For Sandy* is about processing the tragic death of Sandy Denny and what it meant for her 7 month old daughter.\n\n>How wrestling stars ricochet, and carry on  \n>  \n>Caught in time forever more, just thirty-one  \n>  \n>She said, motherless children have a hard time  \n>  \n>When mother's gone  \n>  \n>But she left her baby girl alone  \n>  \n>And nothing could be done\n\n\"The record was finished being mixed the weekend I had Oona and almost died, consequently. So the record was done, but I was singing about that exact thing on “*Song for Sandy*,” about Sandy Denny. She’s a musician that I’ve respected and loved for a long time, and she died tragically when her only child, her daughter, was like seven months old. After becoming a mom and thinking about Sandy Denny’s story, I felt called to elaborate on it in that song. And when I had Oona and had severe complications and got way too close to the edge, it was strange to me that I had already written a song about leaving your child behind, and the tragedy of that.\"^(\\[4\\])\n\nOf the last I want to touch on, *Wild Ceaseless Song* is a fitting closer, meant for her daughters.\n\n>When the sun is set  \nOn my final hour  \nWill you find me in the water's wild ceaseless song?  \nAnd in your face  \nI see my father’s eyes  \nAnd in your daughter’s eyes you may see me \n\n“Life and death meet in a cusp,” Alela says. “The two are intrinsically linked. My second daughter was born on the cusp.”^(\\[1\\])\n\nI first heard *Cusp* shortly after it released back in 2018 and it's never left me in the 3 and half years since. I'd never heard motherhood and especially birth discussed so openly and unabashedly in music, let alone genres as traditional as folk or country.\n\nThere's a strange dichotomy where women are expected to be broodmares but also never express their motherhood publicly or artistically so that they can remain \"\"\"appealing\"\"\". It's a war on two fronts and while there's certainly cause to reject the pressures of marriage and having kids, there's also cause to have freedom of expression for those who do choose to seek a domestic life. I'm glad Alela Diane is fighting for that.\n\n“As women, our music is sold based on our sex-appeal,” she says. “There’s a lack of spaces for women to move into that aren’t based on appearance. Those are conversations I’m interested in having.”^(\\[1\\])\n\nCitations:\n\n\\[1\\] - [The \"About\" section of her website](https://aleladiane.com/about)\n\n\\[2\\] - '[Alela Diane: “I am not taking anything for granted - the same goes for being able to share my music”' from MusicRadar](https://www.musicradar.com/news/alela-diane-i-am-not-taking-anything-for-granted-the-same-goes-for-being-able-to-share-my-music)\n\n\\[3\\] - [\"American folk singer-songwriter Alela Diane offers an ode to motherhood\" from RFI](https://www.rfi.fr/en/20180222-American-folk-singer-songwriter-Alela-Diane-offers-ode-motherhood)\n\n\\[4\\] - [\"Alela Diane’s Cusp Is a Radical Portrait of Motherhood\" from The Stranger](https://www.thestranger.com/music/2018/05/09/26187580/alela-dianes-cusp-is-a-radical-portrait-of-motherhood)\n\n\\[5\\] - [\"PDX MAMA & SINGER-SONGWRITER ALELA DIANE\" from Mother Mag](https://www.mothermag.com/alela-diane/)\n\n\\[6\\] - [\"About Farewell, Alela Diane\" from Colorado Public Radio](https://www.cpr.org/2013/07/09/about-farewell-alela-diane/)\n\nOther relevant links:\n\n*Cusp* \\- [Spotify](https://open.spotify.com/album/6jGsKEUE3weS6QBs5tR2M4?si=Dl7CzpRTTeS8uQyxKip_kw), [Apple Music](https://music.apple.com/us/album/cusp/1309616936), [YouTube Music](https://music.youtube.com/playlist?list=OLAK5uy_kzm4slL358w6TfMyQniPGQkdpr6FwNrHk), [Genius (lyrics)](https://genius.com/albums/Alela-diane/Cusp)\n\n[Every Mother Counts](https://everymothercounts.org/10things/) an organization which Alela has endorsed that combats maternal deaths, undoubtedly a very personal topic for her as one would expect. They've received positive reviews and have taken stances against abortion bans, so it's an endorsement I'm happy to pass on.\n\nI'd like to leave with the closing lines of the \"Thank You\" section in physical releases of the album:\n\n&#x200B;\n\n>To you listener, for your ears & support of my work; and of course, to the beautiful mystery that walks me through the days of this life. I am grateful to be here.",
    "title": "Motherhood's Place in Music - A Look at the Work of Alela Diane",
    "subreddit": "Feminism",
    "timestamp": 1638519808,
    "score": 3,
    "keyword": "woman artist"
  },
  {
    "text": "Molly the Mechanic [https://www.webtoons.com/en/challenge/molly-the-mechanic/list?title\\_no=577981](https://www.webtoons.com/en/challenge/molly-the-mechanic/list?title_no=577981)\n\n[https://www.facebook.com/mollythemechanic](https://www.facebook.com/mollythemechanic)\n\nTLDR: I'm making a comic about my job in the S.T.E.M. (Science, Technology, Engineering, and Math) field, in hopes to interest other ladies, and to provide some media representation that I didn't see growing up.\n\nI've started making this comic after starting a job as an equipment tech in a manufacturing facility. Molly is a character I've made, based on myself. She is a peppy, purple-haired 22 year old who is scared of bugs, wants to put googley eyes on the machines she works with, and LOVES her job. My goal is to introduce high school and college ladies (ANYONE AND EVERYONE who identifies as a woman!) to the big wide world of S.T.E.M., through stories about my job and my experiences. I hope to cover topics like; funny work stories, not funny work stories and times where I have failed, educational explanations of things like DC circuits and fluid power, how to navigate a work environment where there is sexual or gender-based harassment (and how to have hard conversations about it), and more!\n\nA little about me:\n\nI grew up as an artist, a musician, and a hater of math class! I was raised in an environment where \"girly girls\" were often portrayed as cute, pink-loving, humanities-minded people in the media, and not as kick butt S.T.E.M. workers. Every time I did see a woman mechanic or scientist, she didn't look or act like me. I want to change that narrative. I think I would have absolutely loved to learn more about engineering in high school, if I'd seen more media representation of people like me in that role. Not tom boys, working with their dads in their garage. Not super smart \"nerds\" (I say, lovingly), who ace every math and science test they take. Any and all archetypes can and should work in S.T.E.M.\n\nP.S. You'll have to forgive me, I have never done electronic drawing before the start of this project, and my skills have progressed a lot! However... I can't say that my earliest posts are the best quality. I don't have time to make new episodes and also fix the old ones. Have mercy with your art critic comments <3",
    "title": "Molly the Mechanic",
    "subreddit": "Feminism",
    "timestamp": 1615566314,
    "score": 3,
    "keyword": "woman artist"
  }
]