[
  {
    "text": "Should I quit my stressful job and just temp instead? Hi. I'm at my wits end with my job- apologies for the essay. I had an interview a week ago for the most perfect job for me but to get the time off I said I had a doctors appointment in the morning. The previous afternoon the Principal (yes I work in a school) emailed saying I needed to speak to her before she could authorise my absence? She wasn't available all afternoon so I was feeling anxious all day, not knowing what to do. My line manager has been very reassuring saying it's normal behaviour here. The Principal came into my office at the end of the day and put me on the spot interrogating me about the appointment. She asked me what it was for as if it's a routine appointment she can't authorise it (?) but I said I'd been unwell at the weekend (had been off sick anyway) and that I still didn't feel right and I need to have some tests. She then asked if it was a fasting blood test and being on the spot I said yes and she continued to put words in my mouth that \"those appointments tend to be first thing so you should be back by 9:30 right?\" Me:\"Erm well last time I had to wait hours to be seen\" \"but you can turn up early to avoid that can't you?\"\nShe agreed to the morning off but then after speaking to HR came back asking me why I'd said I might not be back until 1pm? My job interview was the other side of the city at 10am and lasted 2 hours so I knew 1pm could be doable. So the interview ran over and the trains were all delayed so the earliest I could get back to work was 2:30! I decided to lie even more to my kind boss that I'd been ill at the doctors and was sick on the bus so wasn't going to make it in. I felt so guilty! She said that HR will want to see my appointment card! But I never get given an appointment card or letter unless it's something serious like a hospital appointment. I'm feeling super anxious about it now especially if I don't get this job. I'm actually thinking to hand my notice in and join an agency. I have a bit of money saved and a supportive partner but there's that risk of not finding work. I don't know what to do. An agency rang be back straight away after I submitted my cv to say they have clients always looking for my skills so I'm feeling a little more confident.\nThis Principal is a sociopath. She sacked a cleaner for taking unauthorised leave even though the cleaner gave 9 months notice and it was her step sons wedding she wanted to go to! Also she refuses people dentist appointments even if they're at the end of the day when it's quieter. I just want to get out of there. Its really stressful too 😢 Today they handed me a formal letter saying I have to meet with them to discuss my sickness absence as it's gone over their limit (they have a ridiculous HR policy) and that I might be given a written warning! Plus also I was emailed today that I have to start covering on the reception desk as they are short staffed. That job is my worst nightmare I hate anything people facing and it's a really high stress job as the parents that come into the school are abusive and sometimes violent :( plus I've always been let off other duties as my role is so busy that I can't be away from my desk.\nI still haven't heard about the interview and they were supposed to let me know 4 days ago but when I emailed them they said a decision hadn't been made yet. So there's still hope.\nI cried in the toilet at work today and then on the bus home. I feel like handing in my notice asap but I don't think it's a good idea. My boyfriend thinks I should do it the day before the meeting which will be in over a weeks time so maybe between now and then the agency or job offer will come. But also it'll mean I won't have to go through the emotional trauma of that meeting. The last time I had one they told me I need to wash my hands more if I'm getting ill all the time! I told them the stress of my job and the fact we work with over 1000 kids with constant colds is the reason why I've been ill! Plus I had flu and was signed off by my doctor but they just dismissed it. Plus yesterday I found out the head dismissed the manager of the school care takers because she didn't like him! He's a nice guy and works so hard but this woman is so evil! I just can't understand her logic. I think she just sees us as a resource and not humans with lives.\nI'm so sick of this bullying dictatorship and I'm seeing others being treated even worse than me 😢Really wanted to just walk out today and not go back.\nI should also say that this isn't what I really want to do with my life as I'm an artist and I'm getting more and more success and publicity so I know that if I worked somewhere with more flexibility and less hours like temping I could propel my practice. I just need to encouragement and to hear stories from others who may inspire me 😊",
    "title": "Should I quit my stressful job and just temp instead?",
    "subreddit": "jobs",
    "timestamp": 1508444113,
    "score": 8,
    "keyword": "woman doctor"
  },
  {
    "text": "Job is Perfect Except For One Thing I recently got a job at a digital advertising firm. I am the content writer and I pretty much write blog posts all day for our client's blogs. \n\nI like my job, I like the tasks, and I enjoy the company of my other co-workers. I've also made friends with the staff at local businesses and eateries nearby. So far so good. \n\nBut this one girl just kind of ruins it. And what's worse is that I have to work with her directly. She just really gets under my skin. This week there were two times when I felt humiliated by her.\n\nOne of our clients is an OBGYN practice. The blog post I had to write was about questions people ask during pregnancy. One of the questions I put in was about breastfeeding. She calls me over to her desk and says, \"Yeah, I never asked my doctor this.\" Then she turns around and asks another woman, \"Did you ask your doctor about breastfeeding when you were pregnant?\" I felt so relieved because the woman said yes and that it was one of her main concerns. During that whole thing, I felt so embarrassed, I felt my face turn red. It was just so mind-boggling to me that she would question the research I did because her experience was different. \n\nThe next incident was with the same client. I had to write a blog post about pap smear FAQ's. I had 520 out of 600 words written. I asked her, \"Can you give me any ideas on how to meet the word count?\" She just goes, \"I'm not the content writer. Finish it.\" I just felt so bad because I was shot down for asking for help. \n\nThere have been other instances where I have been shot down for asking for help, gotten my ass chewed out for making a mistake due to unclear instructions, and numerous times where I have received such bad feedback and critique that it took longer than usual to turn in a better draft. Problems that should have been quick fixes and fixed in a day extended into becoming a week-long problem because communication was so poor and she couldn't get all her thoughts on one page. \n\nThis one lady quit the company last week after working there for over a year. She said that she saw no future working here if she had to work with this woman all the time. She tells me that she's worried that I won't be able to learn more about digital marketing or get experience doing other tasks such as social media management or digital advertising if I have to work directly with this woman. She would be the one teaching me how to do these tasks and honestly, I don't know if that would work out. She is very bad a communicating, crass, and rude and I just don't see myself staying here by next summer. \n\nI got this job in October and have been working here since. I really like the owner of our company and I like everything else, but having to work with this one girl is just really messing this up and it's making me depressed. I don't want to go to work if she's going to be there. \n\nAnyone else gone through something similar? How did you handle it?",
    "title": "Job is Perfect Except For One Thing",
    "subreddit": "jobs",
    "timestamp": 1512839422,
    "score": 2,
    "keyword": "woman doctor"
  },
  {
    "text": "Is It Worth it To Apply for a Job When There's History? Yeah, I know, the answer seems obvious at first glance, but this is one of those weird situations, so bare with me. This is kind of a long story, so be warned.\n\nBack in the summer of 2014, I had an internship in my field. I was ecstatic about it, but things kinda went downhill. The position was great, the people were great, but I was having some issues. Some with mental health, and some (as it later turned out) with physical health. Long story short, I had an anxiety disorder that is now in remission, exacerbated by pneumonia that I somehow contracted early on the internship, that wasn't caught until towards the end. Because I kept feeling crappy, I definitely missed days, but I was definitely present and accounted for on most days, with most of my absences towards the end. Also, none of them knew about my anxiety. Or, at the very least, I didn't tell them.\n\nThe management ended up receiving a letter from me that was essentially an apology, along with a doctor's note confirming the diagnosis of pneumonia. \n\nAlmost a year later, I run into my favorite ex-boss. We talk. She hadn't been told of the pneumonia stuff, so I filled her in on everything, including my continuation of my Master's Degree program, despite having transferred to a different school. She actually praised my decision to switch schools.\n\nAnyway, fast forward to now. I'm a month away from finishing my schooling, and a posting just went up at this same place. It's a perfect \"starter\" position, and I'd be directly reporting to my favorite ex-boss listed above. The problem is, I don't know if I should do it. With the history there, I'm frightened of even trying at this point.\n\nSo...what do you guys? Is it even worth it?\n\nEDIT: Oh, I should also mention, after I sent out the apology letter, I spoke with the woman who had coordinated the internship on the school's side. She said that they had nothing but good things to say about me. I wasn't sure if they were just being nice because of how sick I was.",
    "title": "Is It Worth it To Apply for a Job When There's History?",
    "subreddit": "jobs",
    "timestamp": 1491105627,
    "score": 2,
    "keyword": "woman doctor"
  },
  {
    "text": "Curious if company is misclassified as 1099 My mother works for a transportation company. They transport elderly and disabled people including those who require wheelchairs and stretchers for transport. Drivers are all required to wear khakis and either a red or white polo shirt with a company logo on it (They usually look like Target employees with a different logo on the shirt), they all drive company vans capable of holding wheelchairs and stretchers (company pays for all costs, the vehicles are not leased to the drivers), and all drivers are given an ipad to assist in navigation and payment. \n\nThere are no exact set hours because the work is based on when clients need to be somewhere like a doctor's appointment. Drivers can technically refuse to drive somewhere, but they risk incurring the wrath of the boss (franchise owner is known as boss) and losing their job, so no one does. People seem to take off of work about the same as they would with a normal job. Notice of leave is required for vacation and family matters, but there's no official minimum forewarning required.\nAll drivers fill out sheets listing what clients they drove, how the client paid, and how much the trip cost, but not how much the driver is owed. That's calculated by whoever does payroll who calculates the percentage of the trip the driver gets based on the full price of the trip listed on the driver's sheet. I think this means it can't be considered an invoice. All drivers are paid every other Friday.\n\nIt just looks to me like this company has misclassified itself as 1099 or just barely qualifies. What do you guys think? \nI thought about this before when my mother's back was injured trying to deal with a 400lbs woman in a wheelchair on a fairly steep ramp. I realized the company wouldn't be required to to help her at all and she could receive no worker's comp. It's come up again because I have agreed in the past and recently to help the company with some work when they were short handed and received a paycheck on Friday that was about $45 short. If they refuse to fix it when I go in today, I don't think I can exactly report them to the department of labor.",
    "title": "Curious if company is misclassified as 1099",
    "subreddit": "jobs",
    "timestamp": 1491835868,
    "score": 1,
    "keyword": "woman doctor"
  },
  {
    "text": "E-mailing HR about missing work Hello.\n\nMy boyfriend started this job in April. Training just ended a week ago. He missed days on training but it was based on a point system and he was fine.\n\nThe start of this week was a new clean slate. But unfortonuately my boyfriend wasn't mentally fit to go to work.\n\nHe missed Monday, Tuesday, Wednesday, and today. He was admitted into the psych hospital today.\n\nThe last 3 days I've been calling him out of work because he's been so bad on anxiety and depression. I called today and told the small story about how he was admitted and I'm not sure when he'll leave. This was just a call center to call in sick/late so he transferred me over to HR. This woman at HR said to e-mail her so she could e-mail his supervisor and HR know. They want to know what's going on.\n\nHow do I go about this? My boyfriend really does like this job. It's a call center tech support position.\n\nDo I go into every bit of detail of how his anxiety/depression is making it where he doesn't even want to get out of bed? He's also started a new medication which may be making it worse. Do I also put in that I tried calling his doctor on Tuesday and they wouldn't help him? Yesterday we went to the psych hospital but received outpatient referrals. Today, he admitted himself.\n\nDoes anyone know how to go about this situation? I just don't want to screw it up for him and really want to help him.",
    "title": "E-mailing HR about missing work",
    "subreddit": "jobs",
    "timestamp": 1495766840,
    "score": 1,
    "keyword": "woman doctor"
  },
  {
    "text": "Recruiter keeps rescheduling interview, should I move on? I recently got contacted by a recruiter inviting me to apply for a position at a fairly big IT company I didn't know about, all through LinkedIn. They asked for my resume and a convenient time to talk. I sent both and thanked them for contacting me.\n\nThe day arrives and I get both a call and an email telling me my original \"interviewer\" was no longer with the company and we would need to reschedule. I do, and a few days later I sit down to wait for the call and it never arrives. I send an email inquiring what happened and the woman tells me she \"lost her voice, went to the doctor and will update me on a new date later\". A day went by and still didn't hear any update.\n\nIs this some sort of elaborate way to tell me they are not interested any more? I mean, they were the ones who pushed to talk in the first place, but it sounds implausible.",
    "title": "Recruiter keeps rescheduling interview, should I move on?",
    "subreddit": "jobs",
    "timestamp": 1496266410,
    "score": 1,
    "keyword": "woman doctor"
  },
  {
    "text": "As a girl who ended up not aborting, I am more pro-choice than ever. It is your life. Hello everyone.\n\n\nFirst of all, I would like to apologize in advance for the numerous grammar mistakes I will be making, since English is not my first language. Also, I am very tired and my head is foggy writing this with less than 3-5 hours sleep for the last 2 weeks, so there is a possibility this will be a incomprehensible mess.\n\n\nQuick back story: I am 21-years-old with a baby who is 1 year and 8 months old. I became pregnant at 19 for my then-boyfriend-ish dude. He isn't really in the picture anymore, with his whole heart. He has his own life with a new girlfriend, he studies, he parties, he goes on vacations. He has a fun and active life. That fun and active life doesn't leave that much of time for our daughter. His effort is maybe once a month, usually a lot less, reaching out to ask how she is doing, otherwise it is 99% of time me who sends the whatsapp messages (who are left unanswered) and calls (who he seems to ignore happily pretty often), trying to get him see our daughter. \n\n\nHe doesn't pay child support since he is a broke student, but most of all we had a deal of leaving third parties out of this to have his relationship with her as good as possible. In his words, he will make it up with love with what he can't pay. Obviously I am considering to break our \"deal\" since he has 0 respect to it anyway. It will be a long, exhausting fight where I will be the cruel, money-thirsty manipulating bitch, his new girlfriend will see me doing this because I want to sabotage their relationship and he will be the victim.\n\n\nAnyway, this post wasn't about my ex, I don't know why I wrote about him. Maybe because I just saw his instragram travelling photos from exotic beaches and felt a sting of jealousy and saddness. \n\n\nAs I said, I was 19 when I became pregnant. You know those girls who say \"I _always_ wanted to be a mother!\"? Yeah, I am the complete opposite of that. I can't understand that, like someone would be speaking a different language. What do you even mean with that?? How can someone dream of having children? My first instinct was to abort, immediately after I took the test. I don't like kids. I never wanted to be a mother. I never, for a second, dreamed of having kids in my life. \n\n\nMy then-boyfriend, took a strong pro-life stand, but made it clear he will respect my choice even if I abort. He didn't push or bully me to anything, let's make that clear. What he did do, though was that he did manipulate me with a rosy view how fun it will be to play with our little kiddo. In his mind it was only ponies and rainbows. I thought we will raise this kid together. He told me so, very clearly.\n\n\nI did book an abortion date. The days before that after school I spend scrolling through pro-life-websites, youtube-videos, sites (even reddit) where women like me where called a whore, why didn't I use contraception, this is my punishment, I will go to hell for this. I could spend 9-10 hours glued on my phone and fall asleep at 3-4 in the morning, since I was too anxious to sleep. My mom was the only one who was relieved that I will abort and supported me. My crazy religious relative (the nuts one in our family) who got to know about my situation and harassed me that I will \"pay for my sins\". Good stuff like that. \n\n\nI live in probably the best country in the world for women. I am _not_ religious. I have never been religious. My country's overall position to abortion is very relaxed and respectful towards the women. The conditions to keep my child as a poor (well, let's be honest, I had no income then, have no income now) woman are the best in the world. We have a fantastic welfare system, free health care, free education. Everything. I saw that a lot on those so called pro-life sites, and have seen them later on. Women who say they are feminist and want the _conditions_ to be so well women don't have to abort. I had those conditions. \n\n\nFrom that day I became pregnant (or let's say, more precisely, that first day when I started to scroll those websites) I have lost my real will to live. That kind of will that makes you dream and enjoy life. That kind of passion where you  _look forward_ to things. Where you are anxious to go to the world and fight for your place in life. Anything can happen, life is so exciting and fun. That was my life before I became pregnant. I had dreams of university, maybe a foreign husband, erasmus, travelling, partying, experiencing.  Learning languages, dancing till the morning, drinking, making friends. \n\n\nThe day before my abortion I had the worst panic attack, my first. After that there has been plenty. I cancelled my abortion the morning of it. I felt enormous relief. \n\n\nLet's be honest about the reasons here: I, a person who was raised in a very non-religious-only-namely-christian household, was convinced I am going to hell if I do this. Yes, you read that right. I would never confess this to anyone else, ever, but I did not keep this baby because I saw a future with her or because I wanted to, I did because I did not see that I could terminate it now. I felt 100% trapped, everything was over. The mistake was already happened, nothing could save me anymore. Either I was going to be a baby-killer or then I was going to have a stupid, boring life. No good options. \n\n\nI am more pro-choice today, as a mother for a very challenging but beautiful almost 2 year old, than ever. I know motherhood now. I know what my life is now when I had this child. I lost myself. I am still not in the university because I can't concentrate on reading for the entrance exam with her. I am trying this year, but it won't happen. I am exhausted. Money is tight and it is _very_ strictly controlled, even though because I live in an awesome country I am not missing anything.\n\n\nMore than anything, life is lonely. My friends are living their own life, no one is a mother. I am the boring, frumpy shell that is nothing like what I used to be. I have strecth marks, my boobs are sagging at 21, I am overweight. I had a very difficult and painful birth that still manifestates itself today in form of me having trouble of holding on farts. I don't use make up anymore, nor do I dress up since I don' have money for clothes and I hate my appearance so much there would be no point anyway. Oh I am sorry, I know that when women become mothers appearance and \"superficial stuff\" don't matter at all since we don't care about anything else than our children's welfare. If we do, it is just to please our husbands. Well, I don't have a husband, and I mourn the loss of my looks very much. It affects my self esteem.\n\n\nI am perfectly aware how society even the most feminist, free countries in the world sees single mothers. I am a fuck up, a mess up, I was \"pumped and dumped\", I deserve this. No good man wants me anymore. I have lost even the boys who used to be my friends, not to mention when my boyfriend left us absolutely no one was interested in me anymore.\n\n\nI spend my days with my little human. I take care of her, I feed her, I bathe her, I play with her, I go to the park with her, I read to her. I am constantly, absolutely constantly, scared of parenting her wrong. I try to learn about parenting methods which I can't seem to really keep up with in real life. \n\n\nNow, let's get to the important part of my mindless, long rambling: **I love her**. With all my heart. I have short times of immense joy with her. My life is for her. I am trying to get into university in a field that would have 9-16 days so I can construct my life around her.  I will fight with everything I have to ensure she has a good life. \n\n\nIf I was sent to that day right now, holding my phone with shaking hands, convinced I have to cancel my abortion, would I still do it? No. I wouldn't. I would abort. \n\n\nPeople don't like extremely complicated answers, answers that actually reflect life that is hard and has a million different view points. They want \"oh not aborting was the most wonderful decision of my life, my child gave me a reason and happiness and everything\". They don't want young women with no realistic opportunities to support themselves without the help of the government to have children, but will judge those who abort.  \n\n\nIf I could, I would go back and abort in a heart beat, actually understanding what it means to stay up alone all by yourself, be left my your boyfriend who has the freedom to just merrily fuck off to his exciting student-life bubble with our old friends. I would understand how taxing the bodily, mental and hormonal changes are. I would understand, than once you have a child _that's it_. Your life is over, or at least put on on hold, and you _never_ get life or those precious years of freedom,  fun, studying and networking back. The reason people make babies in stable marriages is because parenting is FUCKING HARD. It is FUCKING EXHAUSTING. I would give _anything_ in this world to do this when I am significantly older, with a supporting husband, living our on own money, in house. It would be wonderful to have that now, but still it wouldn't be what I really want in life. It would still be a second-place good. \n\n\nI don't need help, or reassuring, or cheering or \"it will be get better when that baby reaches age x\"-thing. Nor I am looking for compassion. I know clear well my post comes off as a selfish, whining bitch. That's how women are seen. We have a motherhood myth, and if you don't fit in you are a monster. I don't need advice or \"why don't you just adopt/quit bitching and enjoy what you have/at least you have a healthy child/most people have it worse\". I don't give a fuck. I know perfectly well I am a good mom and will be a good mom, and I will do everything for her. However I don't like it, I don't like my life. Its lost. \n\n\nI have been to the doctor and yes I am depressed. I don't need \"this is your post natal depression speaking, it will get better when you get sleep, when she is an adult you are grateful for her blah blah, you would be depressed anyway\". I don't believe depression being an illness that just pops out randomly for no reason at all. I am depressed because I hate my life and have no way out, and the reason it is because I hate being a mother. You can reverse every single thing in life except having kids and death. \n\n\n**TL;dr**: Women who are pregnant and thinking whether or not to abort: Do not give a single fuck for _any_ outside opinion. Not the opinion of your boyfriend, or even husband, relative, friend, church member, whatever (I know the husband and boyfriend-part will trigger a massive roar, don't care.) . Look at _your_ life in the future, what you want, and then act accordingly. Keep your child ONLY if you WANT TO BE A MOTHER. Everything else, finances, relationships, people shaming and guilt-tripping you, is bullshit. I am **not** encouraging anyone to abort. I am saying that in the end no one else will be there, and it will be you and only you, with your one, unique life. It needs to be _your_ decision you know you can live with the rest of your life. Those people wanting to influence you are not going to care or help you in the end. \n\n\n\nThe end. \n\n\n**Edit**: I have to go now and it can take me a long time until I get back (I can't be on phone or computer when I am with my kid) , so I am upset I can't answer to each and every post made here, but. Please know that all your positive messages have made a huge impact on me. I am in tears. I shared something painful and instead of a few trolls and ignoring, I got to have so encouraging and beautiful messages and other women sharing their feelings and life situations. I thank all of you for your PMS (except the trolls) and your messages. I will read all of them and try to answer to as much as I can.\n\n\nAnd to that person who gave me gold, I have no words. Just... Thank you. Thank you so much.\n\n\n**Quick edit 2 since this is important**: I would never say to my daughter that she wasn't really wanted,  and I will do everything I can ever to feel the complete opposite. I will never tell her anything what really happened when I considered my options. I've always said to her I loved you since the moment I knew you were coming and that she is my greatest gift, and those things are true. My daughter is the light of my life, and I don't blame her on anything, what I do blame is myself and wish that women could have more support. I know my feelings are more complex than mothers are allowed to have, but to those asking if I hate my daughter that is the last sentiment I have. I will be the best I can for her, and I am sticking to my decision.\n\n\n\n**Edit 3** : Good god I am shaking. I don't understand what is happening here. I am honestly in a state of shock. I thought I would just quickly check this before crashing since I can hardly keep my eyes open, and came back to blown up inbox of hundreds of messages, _four fucking golds_,  this is being in the r/all. I can't wrap my head around what is happening.\n\n\nYour messages. Your private messages. It would be impossible for me to try to put in words how I am feeling right now. It would be too little to say that I am overwhelmed. I have read message after message with my hand covering my mouth since I can't take all these people reaching out to me, telling their stories and sharing how they feel about their situations that are from every perspective of this issue, people sending just LOVE, just lovely, encouraging, loving messages for a complete stranger (and yes so, so many hateful trolls too, btw I don't read further immediately when I spot on a message that was mean simply to hurt). I don't know what to do with all this love. My heart is beating so fast.\n\n\nIt would be absolutely impossible for me to go through all of them right now, it is very late and I have spend much longer on this than I really could. I will read each and every single of them and reply to as many as I possibly can.\n\n\nI can't believe just letting the world see my ugly raw hopelessness and feelings of being trapped could open a gate like this. I dwell on these thoughts hour to hour, day to day alone, month to month, usually when grandma takes my daughter to her so I can have a short break I write to myself in my diary. I can't believe the amount of women reaching out and sharing how they feel. \n\n\nAs I said, I am not religious, but I believe in the universe. But let's just say I've have a _very_ hard couple of months, and _extremely_ hard couple of days, especially this day. i think. I think I was supposed to write this. Something has cracked inside of me, I can't handle my emotions right now but this, this has been more therapeutic than the 7 months I have spent with a professional. I know this sounds ridiculous, but this is some kind of turning point for me. I feel it.\n\n\n\nI don't know how to say thank you. Thank you. Just **thank. you**. Thank you, thank you, thank you. Now I am going to drink about 6 liters of water to hydrate myself after all this crying and then I think I am going to lay down to the bed and be actually able to breath without the heavy feeling of creeping pain and soul-crushing anxiety blocking it. Then I am going to sleep well. For the first time in so long I don't want to write it. I just know it. \n\n\n\nSince I have this one short chance to say how I feel about this and maybe reach out to someone (also because I received so many of those messages of how I promote and encourage abortion), I will repeat this in a shorter way: **Nothing else matters than your own, personal, deep desire and inner voice on choosing what to do. It has to be YOUR choice. Do it ONLY if it TRULY is YOUR choice. Nothing else should do, since nothing else really matters.** Everything and everyone trying to manipulate, influence, bully, shame, or convince you is indifferent. It should go without saying, but since it was confusing to so many people, this applies to those women wanting to keep your baby but feeling that you are too much of x, have too much or too less of x or are being pushed by a partner/parent/important person in your life to abort. That decision _will_ hurt you, greatly.\n\n\nLet's get through this one more time: your marital status, age, education, wealth, what the society and community thinks, your image, how religion/someone from the outside views your decision, every single one of those are not what should be the reason you do what you do. \"But women are struggling to conceive so I should feel lucky, but my married lover wants me to abort, but I have everything I need in life, I am ready\", do not give a single fuck if it goes against your inner voice. If it comes from the outside, it is not yours, and you will have more than a hard time living life that is not yours. If it is, you will find a way to cope with everything and anything that comes along the way, since nothing in life is a greater motivation, source of power than knowing what you are doing comes from you.\n\n\nAnd lastly for those attacking me for bringing up the pro-life propaganda and how much it affected me, being skeptical about how it can get through to someone like me: when you are a confused hadly-an-adult, in a situation that is so panicking you feel like you are in the roof of a burning apartment with no opportunities to save yourself, with a huge hormonal rush, not knowing what to do (or more like thinking you aren't supposed to do what you want to do), you submit to powers you would normally not pay a second to. And I consumed that shit _a lot_. I understand it is hard to understand for an outsider, but when you are in a state of complete vulnerability feeling like it is something too big for you to decide, it is easier to listen to someone who says they know exactly what is right for you even if you know it isn't. They use stuff that cuts down to your emotions and really fucks up your mind.\n\n\nI am not blaming my boyfriend, my internet habits, or anyone outside for my decision. I take full responsibility of what happened. No one forced me with a gun to do anything, even though it felt like it in some way. But just like it was my choice, I should have seen it truly is _only_ my choice and absolutely no one is invested in that I am.\n\n\nAnd that is my goal for women to realize. I belive we are strong together and should celebrate and look out for each other. Womanhood is a beautiful but hard thing and we need to help each other. Thank you, you wonderful ladies and gentlemen. I will get back to all of you soon.\n\n\nThank you for giving me hope, since that is what I got from this. Hope. So much hope. I am now going to bed with a lighter heart I've had in years.",
    "title": "As a girl who ended up not aborting, I am more pro-choice than ever. It is your life.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1490447998,
    "score": 14971,
    "keyword": "woman doctor"
  },
  {
    "text": "Dear Fellow Pro-lifers; We can't legislate away abortion and why we shouldn't want to. Dear Fellow Prolifers,\n\nI am Pro-life. To me, that means caring not only for unborn children but also the women who feel they have no other choice than to terminate their pregnancy.\n\nThe thought of someone having an abortion tears at my heart. The loss of an innocent life physically hurts me. But this isn’t something new. Abortions have been going on since the dawn of time. We will never be able to reverse legislation that makes it legal. And we shouldn’t want to. We shouldn’t want to go back to a time when desperate women would go into an alley and let someone they didn’t know perform a dangerous procedure on them. \n\nI don’t want that and you shouldn't either. Instead, we should be doing everything possible to make it so that women aren’t forced into that position to begin with.\n\nThat starts with education. We need to support legislation that encourages sex education that teaches our young people about safe sex. Not only to prevent pregnancy but to also prevent the spread of STIs. The idea of abstinence, waiting until someone finds their one true love, is great. It’s what we want for our children. But it didn’t work a hundred years ago and it doesn’t work now. Our self-worth, as women and as people, should never be tied to our sexuality. To tell someone they are worth less because they gave in to temptation, the same temptation probably close to 100% of the adult population gave into before marriage, is disgusting. If, as a parent, it is important to you to teach that to your child, then go ahead. But I, as a Christian, am called to love everyone. Even those who don’t agree with me in my beliefs. And I certainly don’t expect others to follow commands I failed to obey. How many abortions are on our heads? How many abortions have been done because single women were too embarrassed to tell their religious families that they were pregnant outside of marriage? I never want my children to feel like they can’t come to me. I don't want them to be afraid that I would disown them or send them away should I find out they had sex outside of marriage. It’s preposterous. We need to stop holding others to a higher standard.\n\nNext, we need to fight for legislation that provides free or low-cost contraception to anyone who asks. If everyone having sex knows about contraception and can go to the pharmacy or the local clinic or their doctor’s office and get it, imagine how much it would reduce the number of abortions in this country. This includes the sixteen-year-old high school student that wants an IUD, the thirty-year-old mom that wants an implant, and the forty-year-old homeless man in need of condoms. And I am including the morning after pill in this, because that is NOT an abortion, and people need to stop acting like it is. All the morning after pill does is makes the uterus inhospitable so that the fertilized egg doesn’t attach. I would rather this than have a woman wait six weeks to find out she’s pregnant and then have an abortion. \n\nWe need to stand together, whether pro-life or pro-choice and find our common ground. We need to fight so that abortion is so rare that it’s no longer a division between us. We are women, we are strong, and we can do this!",
    "title": "Dear Fellow Pro-lifers; We can't legislate away abortion and why we shouldn't want to.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485715929,
    "score": 11373,
    "keyword": "woman doctor"
  },
  {
    "text": "Does anyone else feel like you weren't aware how incredibly hard pregnancy and labour can be to your body? Hi ladies,\n\nI have been thinking for a while about something that has crossed my mind quite often- how many times while enduring the pain from recovering from my catastrophic labour I felt like I was \"tricked\" to have children, which I know isn't true but I felt that before I actually got pregnant, nowhere was I told how destructive labor can be and that pregnancy can be 9 months in hell, not a beautiful thing. Just, why we don't talk about it? I guess what really bothers me was how horribly uneducated I was about pregnancy and labour- and this comes from an university educated woman who lives in a first world country with top education.\n\n\nNo one- absolutely _no one_ told me before my pregnancy that my birth could end up being a diabolic experience with fourth degree tears (I don't know if I translated that correctly, sorry, English isn't my native language), my flesh being cut from anus to vaginal hole, that we would need the assistance of a vacuum. That I could end up having multiple surgeries trying to give back my ability to hold my feces, that it would take **14 months** for to be able to have sex with my husband again and even after that the sex would never be the same. I have suffered from horrible PPD and the feeling that my sex life and body had been robbed from me made me really angry, sad and bitter for a long time. My marriage has suffered from the fact that I couldn't have intimate connection with my husband. The worst part is that even my super patient husband made me feel that I was being selfish or that it was my choice at some points- even thought he knew perfectly well what had happened and had talked to all my doctors. My husband's best friend made a tasteless joke about our lack of sex while he was drunk, one that made clear how he and obviously my husband thought that he was the victim on that situation and I was to blame.\n\n\nI know having a birth as bad I did is very rare, but we do exist. I am not an unicorn, I meet other mums of young children at park every day and all the subjects we discuss are something I would have never known before. How so many ladies (even with minor tears) can have problems holding pee, how common it is to have at least some tearing, how hard it can be to start sex life after labour, how everything your body from your breast to fucking _feet size_ can change shape, how nobody prepared how nauseous you can feel through the pregnancy,   how your belly can look a bowl of oatmeal 3 years after giving birth to your third child, how breastfeeding can be painful and hard instead of being a beautiful bonding experience... The worst one is definitely one of my best friend's whose birth was so excruciating torture she went into psychosis (again, extremely rare but she was never even discussed about the possibility, even though she had a heavy risk factor from her mother's side). Fortunately she recovered because she received immediate professional care and is a wonderful and dedicated mother, but she still refuses to talk about it even with me. It is that shameful and horrible to her.\n\n\nI quite often feel like we don't discuss the possible side effects of something that is so common not nearly enough- most of the stories in mainstream media are raving about mothers who looked like they could walk for Victorias Secret two hours after giving birth, we don't really see how pregnancy and labour can change drastically the bodies even of those mother who take care of themselves, and how it is normal to have a different body afterwards. And that is only about looks, not to mention real life stories about what labour and pregnany can really be about.\n\n\nShould we start educating children on school about what labor and pregnancy can do to your health and body, what is your opinion? Do they already do that in your country?\n\n\nEdit: I forgot to mention that I felt ashamed and that I was wrong if I talked about what I've been through, because that would come as if I am not grateful for having a healthy child and we just have these expectations as a society than once you've had kids nothing else but kids matter and \"sacrifices\" are something all moms are willing happily to pay. I found a support group for women who experienced a traumatic birth and we all there expect two have had bad tearing, so that is why I said we are not unicorns- since if I am a \"statistic exception\" (fourth degree tears are rare, but more than 90% of women get some level of tearing from vaginal birth, I was told) I know quite damn lot of us exceptions. We have discussed a lot about the grief from losing your sexuality and sexual pleasure. Myself I am grateful for still having a working clitoris (for those who don't know, yes you can tear even your clitoris during birth) and it is basically my only source of pleasure, but I don't feel anything else. I have had surgery, I've physiotherapy, I have done pelvic rehab therapy and worked those muscles like a fucking maniac, but it hasn't helped and I've started slowly to accept it never will. Because that is the only thing even doctors say, that it will heal with time. Well guess what, I discussed with one woman who grieves about the loss of sense after her childbirth and who was also told it will come back with time... I guess she isn't holding her breath anymore considering her daughter turned 24 this year.\n\n\nI just think it would've been good to be aware that this can be the price to pay for having children, so I could've done my decision fully aware of them. \n\n\n**second edit**: I can see I struck a nerve with this post. I don't know if it is somehow organized, but I am getting flooded with nasty pms. Pretty great deal of assholes in this thread too. Wonderfully most of people are great and the brilliant conversation in this comment section makes it worth it. I am grateful for this community. ❤️\n\n\nAnyway, so many people are making the exact same comment thatI had to put this up here: for the people saying \"they do tell you this when you are pregnant\", YES they do. They indeed do, the flood gates open once you announce you will have a child. Then it is too late. That was kinda the point of my post. Before that nobody shared a peep with me, even when we told we were trying for a baby. And for those kind souls pointing out google exist, I never found these consequences like losing the ability to control my bowel movements and losing my sex life even with googling. \n\n\n\nI try to reply as many of possible (however I am on a clumsy new mobile abd having to do other things at the same time, so I will type slowly as a grandma and there will be a lot of bad English. Still, for all the ladies sharing, please know I read and like each one of your post), and I appreciate the (civilized) discussion and sharing stories.  It is relieving to see I an clearly not alone, even though I know it. But still. Was somewhat nervous posting this because, well, it is my life. That is maybe why those pm s got me in such a bad mood.",
    "title": "Does anyone else feel like you weren't aware how incredibly hard pregnancy and labour can be to your body?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1497705841,
    "score": 8016,
    "keyword": "woman doctor"
  },
  {
    "text": "Chinese woman commits suicide after family refuses to let her have a C section | In China, family members must give consent before a patient undergoes surgery, so the doctors' hands were tied. They repeatedly tried to get the family to grant permission for the operation, but to no avail",
    "title": "Chinese woman commits suicide after family refuses to let her have a C section | In China, family members must give consent before a patient undergoes surgery, so the doctors' hands were tied. They repeatedly tried to get the family to grant permission for the operation, but to no avail",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1504659903,
    "score": 7373,
    "keyword": "woman doctor"
  },
  {
    "text": "A cranky hospitalist's top 100 pet peeves in inpatient medicine Feeling a little crispy after 6 straight weeks on inpatient wards, I decided to share my top 100 pet peeves, almost all of which came up during this month and a half. Feel free to agree or disagree, or to add your own.\n\n(For the record, I certainly don’t claim to deliver perfect patient care, and have been guilty of committing more than a few of these myself!  Categorization into fields isn’t meant to imply that specialists in each field are the primary culprits.)\n\n\n\n**Cardiology**\n\n* Admitting a patient for “r/o MI”, and not mentioning their ECG in the admission H&P (bonus annoyance points for instead documenting “ECG: NSR”).\n\n* Reflexively checking BID electrolytes in every patient on diuretics (sometimes appropriate, but often not necessary)\n\n* Reflexively repleting every patient’s K>4 and Mg>2. (How did this practice become ubiquitous?)\n\n* Reflexively checking a troponin in response to a brief episode of asymptomatic NSVT (bonus annoyance points if the ordering doc doesn’t bother with a follow-up troponin)\n\n* CT surgeons, anesthesiologists, or emergency med docs who cannot reliably interpret an ECG.\n\n* Fluid restricting patients with heart failure exacerbations. (it’s sodium restriction that’s helpful)\n\n* Placing a patient on two hemodynamic drugs simultaneously which have directly antagonizing effects. (e.g. midodrine and hydralazine, dopamine and metoprolol, etc…)\n\n* Describing a patient as “preload-dependent” because of [aortic stenosis/pulmonary hypertension/ diastolic dysfunction/etc…] (all patients are preload-dependent!)\n\n* Micromanaging the blood pressure in a patient with no other cardiovascular disease (e.g. orders for prn hydralazine for SBP>160).\n\n* Continuing statins in hospice patients.\n\n* Placing a patient on a low fat “cardiac diet” because of a history of CAD. (hospital food is already bad tasting enough!)\n\n* Assuming a patient with an irregular pulse has a-fib without checking an ECG.\n\n* Stating that a patient can’t have tamponade because he/she isn’t hypotensive.\n\n\n\n**Pulmonology**\n\n* Admitting a patient for pneumonia, and not mentioning the CXR in the admission H&P.\n\n* Admitting a patient for any pulmonary complaint, and relying on the formal interpretation of the CXR without even looking at it oneself.\n\n* Assuming that a patient with a chronic cough and strong smoking history must have COPD.\n\n* Diagnosing pneumonia based solely on CXR findings, irrespective of the presence or absence of consistent symptoms/signs/lab tests.\n\n* Stating that a patient can’t have a PE because he/she isn’t hypoxemic.\n\n\n\n**Critical Care**\n\n* “Renal dose dopamine” (yes, our hospital still has docs who insist on this!)\n\n* Using the heart rate as a primary indicator of volume status.\n\n* Reflexively giving Lasix to every patient with pulmonary edema.\n\n* When there is no room for your sick medicine patient to move to the ICU because the CT surgeons refuse to transfer out their post-op CABG patients who have been stable for days.\n\n* When your patient codes, and no one gets around to informing you until hours later.\n\n\n\n**Renal/Fluids**\n\n* When a patient with mild hyperkalemia and no ECG changes is given the full smorgasbord of hyperkalemia treatment - calcium, insulin + glucose, bicarb, albuterol, and tons and tons of kayexalate. (bonus annoyance points if no one even checked for ECG changes before ordering all of that)\n\n* Conflation of “prerenal AKI” with dehydration. (AKI from heart failure is “prerenal” too!)\n\n* Not checking a UA in patients with AKI.\n\n* Giving sodium bicarb for a moderate metabolic acidosis.\n\n* Reporting the results of a UA as “dirty”.\n\n* Placing a patient on overnight IVF when they are NPO from midnight for a procedure scheduled for 8am.\n\n\n\n**GI**\n\n* Ordering a stool guauic for a patient whose stool is visibly bloody or melenic. (bonus annoyance points if the intern is only checking it because the GI fellow insisted).\n\n* Ordering a PPI for a soft reason, which will likely be continued for years before another doctor reexamines whether it’s appropriate.\n\n\n\n**Endocrine**\n\n* Placing an insulin-dependent diabetic on only a sliding scale.\n\n* Continuing qid finger sticks for weeks in chronic patients whose diabetes is controlled well enough to never require insulin.\n\n* Deciding against the use of metformin in a patient solely because his/her creatinine is 1.6 - and above a traditional, arbitrary, and evidence-free cutoff of 1.5. (bonus annoyance points if the doc actually wants to prescribe it, but the pharmacist declines to approve the order.)\n\n* Checking TSHs in critically ill patients (exception: the very rare patients whose critical illness could be predominantly due to thyroid disease)\n\n* Seeing a diabetic food tray full of non-diabetic-friendly food. (bonus annoyance points if it includes an Oreo brownie)\n\n\n\n**Rheum**\n\n* Confirming or refuting a diagnosis of gout in a patient with a hot, swollen joint using a serum uric acid level instead of arthrocentesis.\n\n* Ordering 25 different autoantibodies in a patient presenting with a vague, multisystem disease “just to be sure it’s not autoimmune”. (bonus annoyance points if a 1:40 ANA then prompts a formal rheum consult)\n\n\n\n**Hematology/Oncology**\n\n* When an oncologist declines to consult on a patient with suspected malignancy until the malignancy is confirmed via pathology.\n\n* When a proceduralist/surgeon requires a patient’s INR to be below some low and arbitrary threshold prior to a procedure (bonus annoyance points when they express no interest in the patient’s bleeding history – a much better predictor of bleeding risk).\n\n* Reflexively transfusing at an arbitrary hemoglobin, irrespective of symptoms or other medical problems.\n\n* Using a higher-than-normal hemoglobin threshold for transfusion simply because a patient has a history of CAD. (it’s *active* ischemia that should be a reason to transfuse to higher Hb goals)\n\n* Diuresing an anemic patient for the primary purpose of hemoconcentration.\n\n\n\n**ID**\n\n* Daily ESRs or CRPs\n\n* Feeling obligated to switch to PO antibiotics for 1 day prior to discharge, to make sure the patient’s infection doesn’t worsen due to narrowed coverage or poor absorption. (It will take longer than a day for the infection to worsen to a point that you’ll be able to observe.)\n\n* Insistence on always using the same temperature cutoff as constituting a “fever”, and reacting to every “fever” in the same way. (i.e. sending blood cultures on every patient whose temp is >=101.0, and on no patients whose temp is <101.0)\n\n* Being excessively dogmatic with antibiotic courses in situations of diagnostic uncertainty (e.g. a patient with known Staph bacteremia who is estimated to have a ~10% chance of endocarditis must be treated with 6 weeks of IV antibiotics because endocarditis wasn’t “ruled out”).\n\n* When infection control won’t let us take a patient off respiratory isolation for TB until they have been formally ruled out, despite the order having been placed accidentally. (yes, this really happened!)\n\n\n\n**Pain management**\n\n* Dosing narcotics less frequently than their duration of action. (i.e. oxycodone bid)\n\n* Ordering acetaminophen as the only prn pain med in a patient whose chief complaint is pain.\n\n* Refusing to give narcotics to an inpatient with a history of substance abuse, irrespective of how severe their acute pain is.\n\n\n\n**Neuro**\n\n* Documenting a patient’s neuro exam as “non-focal”. (bonus annoyance points if the reason for admission was a neurologic symptom)\n\n* Not assessing the gait of a patient on admission. (bonus annoyance points if the reason for admission was “weakness” or “falls”)\n\n* The use of a stethoscope head as a reflex hammer.\n\n* Reflexively ordering a vitamin B12, TSH, and RPR in every patient presenting with altered mental status.\n\n* When the reason for a patient’s admission and/or their documented chief complaint is “altered mental status” without any further description (e.g. excessive drowsiness, agitation, hallucinations, disorientation, etc…)\n\n* Reporting the results of a head CT as “negative”.\n\n\n\n**Psych**\n\n* Calling a psych consult on a medicine inpatient with stable depression. (bonus annoyance points if the patient will be discharged within a day and already has a close relationship with an outpatient psychiatrist)\n\n* Overreliance on antipsychotics for delirium before first attempting non-pharmacologic strategies.\n\n\n\n**Orthopedics**\n\n* When a ortho resident attempts to turf an admission to medicine because the patient is “too medically complex”, despite the fact that the ortho service is comanaged by a dedicated hospitalist 24/7.\n\n\n\n**Urology**\n\n* When a medicine resident calls a urology resident for help placing a urinary catheter that the nurses couldn’t place, and the urologist requests that the medicine residents try to place it first. (bonus annoyance points when the urologist then becomes irate when informed that the med resident subsequently caused urethral trauma)\n\n\n\n**Emergency Medicine**\n\n* When the ED calls to admit a patient for “r/o chest pain” without first getting an ECG.\n\n* When the ED gives antibiotics without first acquiring relevant cultures.\n\n* When the ED tells the only family member who can provide critical collateral information that they can go home before the admitting doc has had a chance to speak with them. \n\n* When a medicine R2 debates with a ED attending of 25 years’ experience about the need for a patient to be admitted without consideration of their unequal years of experience.\n\n\n\n**Radiology**\n\n* When a radiologist determines whether a patient with impaired renal function can receive contrast for either CT or MRI based only on the serum creatinine, without considering age, muscle mass, comorbid conditions, indication for scan, or the availability of reasonable alternatives to the scan.\n\n* When the interpreting radiologist for a scan doesn’t address the stated indication for the scan within the interpretation.\n\n* When the primary team orders a radiology study and doesn’t include an accurate indication in the request.\n\n* When a radiologist won’t approve a seasoned hospitalist’s request for an MRI brain until a neurology R2 concurs (bonus annoyance points if it’s July).\n\n\n\n**Communication/Charting**\n\n* Charting “Code Status: DNR/DNI” in an admission H&P without any indication as to how that decision was made.\n\n* When a consultant stops seeing a patient without communicating that they are signing off.\n\n* When a consultant conveys to an intern on the primary team that they feel really strongly about a particular course of action, but then don’t speak with the hospitalist directly, and don’t convey the strength of that recommendation in the chart.\n\n* When a consultant conveys to a patient that they will/will not be discharged that day, without first discussing it with the primary team.\n\n* Referring to a family member as “the wife” or “the son”. (it’s his/her wife, his/her son)\n\n* Referring to the patient as “Mr.” or “Mrs.” so-and-so when speaking to a family member. (much better to say “*your* father/mother/brother/sister/etc…”)\n\n* Ignoring the nurse during walk rounds, despite he/she standing right there at the bedside.\n\n* When housestaff signout to the on-call team and spend 30 seconds on each of 10 patients, rather than handing over a list of 9 patients, and spending 5 minutes discussing the one patient who is particularly sick/complicated.\n\n* Documenting a chief complaint that consists of a laundry list of 15 unrelated medical problems (“Ms. Smith is a 60 year old woman with a past history significant for hypertension, smoking, homelessness, osteoarthritis, CKD, COPD, basal cell carcinoma, breast cancer s/p mastectomy and chemo, DVT in 2010, onychomycosis, and chronic low grade transaminitis, now presenting with LLE cellulitis”)\n\n* Documenting an assessment in an H&P that’s word-for-word identical to its chief complaint.\n\n* Failing to look at the reason for presentation as documented by the ED triage nurse (it’s amazing how often the ED triage nurse, ED doc, and admitting medicine resident’s chief complaints are inconsistent)\n\n* When the med list in the discharge instructions, med list in the discharge summary, and the official outpatient medication list in the EMR all disagree.\n\n* When the respiratory rate of every patient on the ward is documented as either 18 or 20.\n\n* When I/Os are fastidiously recorded on patients for whom it’s irrelevant, and patients with renal failure are recorded as having “bathroom privileges”.\n\n* Stating “the patient *failed* such-and-such chemo regimen”. (Patients don’t fail chemo regimens; it’s the chemo regimens that fail patients)\n\n* Stating “the patient *refused* their 3am lab draw”. (Better to say “the patient *declined* their 3am lab draw”.)\n\n* Getting worked up over the difference between “historian” and “informant”. (This is one word choice on the wards that does actually seems trivial.)\n\n* When a doc talks disparagingly about NAs, RNs, NPs, and/or PAs as an entire profession.\n\n* When a non-doc talks disparagingly about docs as an entire profession (bonus annoyance points if it’s an NP wearing a “heart of a nurse, brain of a doctor” shirt)\n\n\n\n**General**\n\n* Referring to professional society guidelines as if they were laws that must be followed.\n\n* Lean\n\n* Referring to patients as “customers”. (bonus annoyance points if it’s during a daily huddle to discuss lean management techniques)\n\n* When someone cancels a lab order and doesn’t inform the ordering doc. (bonus annoyance points if it’s a phlebotomist who felt that a delirious, semi-comatose patient “refused” the blood draw)\n\n* When an outside hospital transfers a patient and fails to include a discharge summary. (bonus annoyance points if they include 100+ pages of nursing notes)\n\n* Attempting to discharge a patient without first assessing how the patient is going to get home.\n\n* Citing a study in a progress note that doesn’t actually support whatever point the writer was implying it supported.\n\n* Failing to question an unexpected, bizarre lab value as possibly being “bad data”. (“Sure, I suppose this person recovering from a hip fracture, whose sodium yesterday was normal, could have a sodium of 90 today, but maybe we should recheck it first before starting the 3% saline…”)\n\n* When a PMD insists that the patient they are trying to directly admit to a particular medicine ward is appropriate for that level of care, despite the doc never having stepped foot on the ward in question.\n\n* Making a medical decision primarily based on metrics or patient satisfaction ratings.\n\n* Failing to adequately incorporate a patient’s personal preferences and social situation in crafting a treatment plan.\n\n* When one runs to the coffee shop to make it just before closing, only to find that they decided to close 5 minutes early.",
    "title": "A cranky hospitalist's top 100 pet peeves in inpatient medicine",
    "subreddit": "medicine",
    "timestamp": 1506921993,
    "score": 596,
    "keyword": "woman doctor"
  },
  {
    "text": "The Other Side: An EM Intern’s First Shift. *Preface: I shared this with /r/medicalschool and I wanted to share it here with /r/medicine as well. I have changed certain presentations and details to maintain relative anonymity. I wanted to share this narrative to let people see my perspective as a new EM intern. It is long, so please- feel free to ignore it.*\n\nAll the best,\n\n-wtffng\n\nI arrive 30 minutes early to find my ID badge won’t unlock the double wide magnetically guarded doors to the ED. It’s the morning shift, so someone should be close behind me- therefore, I pull out my phone, furrow my eyebrows, and completely pretend to be doing something important.\n\nA nurse walks by briskly and successfully swipes through the door with me stealthily following behind her. I walk to the resident workroom to find my key doesn’t work there either. A PGY-3 spies me fumbling and with a laugh pulls the door wide open.\n\nHe’s smiling. He’s excited for us to be starting. It’s genuine. He runs me through some basic charting requirements that haven’t been covered in 2+ weeks of HR classes and orientation, which at this point have all blurred together, interwoven between each night’s social adventures.\n\nMy shift begins at 07:00, and at 6:45 there’s a loud page “TRAUMA ACTIVATION, ROOM 4.” A grinning attending appears from nowhere, introduces herself- and instructs me to go to the trauma bay.\n\nA life threatening gun shot wound is arriving via ambulance and we’re tying our gowns down. The room is calm, but swelling with people and heat- everyone mutually understanding that this will most likely be futile.\n\nAn older nurse peers around the room, trying to ascertain who to eliminate.\n\n“WHOEVER’S NOT DIRECTLY INVOLVED, LEAVE NOW,” she instructs, likely insinuating me. Several people scurry out the doors and I turn to leave, finding myself facing another attending who firmly says: “Stay here.”\n\nThe nurse starts circulating, instructing people she doesn’t recognize to leave. I’m fully gowned with a mask, but I know this won't protect me. As she nears, I turn to the trauma cart and pretend that I’m seeking some device which will be useful in the near future. She passes and I turn back, an escapee.\n\nThe patient is rolled in and movement starts. Intubation, CPR - but within minutes it is determined that yes, this is most certainly futile, and the patient's time of death is called.\n\nI walk back to my ED section to receive sign-outs. The attending looks up warmly:\n\n“Welcome to the Emergency Department, Dr. Wtffng.”\n\nThere are three Interns, one PA, and one Attending. The attending looks around and wonders aloud “Do we have no senior here? No? Looks like a busy day.”\n\nWe’ve been informed that as interns our expectation for these first shifts are simply this: Do an HPI. Learn the system. Be honest.\n\nI haven’t done an EM shift in 2 years now, and my excitement is tempered by the growing realization that after 8+ years of education, I might know nothing.\n\nI push back against this thinking and set to work as the clock strikes 07:00. I look up at the patient board and see red rapidly disappearing as the team logins to the EHR. I scan the list and pick up the first one I see- a seizure.\n\nThe patient’s from out of town, no history available. No worries, I’ve done seizure work-ups plenty of times in the past, right?\n\nAs I walk towards the room the nurse pulls back the curtain and exits.\n\n“Hi! I’m WTF, the intern working with you today for the first time here.” We exchange formalities and he is kind. He’s patient. I ask him to let me know if he needs anything and what he thinks about the patient.\n\nSo here it goes. The first patient seen with an MD straggling along behind my name.\n\n“Hello, I’m WTF FNG, call me WTF. I’m the resident doctor taking care of you this morning.”\n\nThe patient is younger. Engaged. Smart. Here for work and he certainly knows more about seizures than I do. He informs me he’s got important things to do, and he hasn’t slept well the last couple nights and had a couple drinks the previous- likely the cause.\n\nI do an HPI and order labs. I’m trying to contact an outpatient neurologist in some far away state who I soon realize doesn’t want to respond to pages sent from East Coast Time.\n\nI pick up another patient, dizziness. I whisk into the room to find a pleasant older woman who is here only because her son was concerned. She’s got important things to do, and wants to escape this place to her cabin for the weekend.\n\nI tidy up things for my first patient and discharge him. He looks at me says “Hey- Thank you, that was really quick and thorough.”\n\nI laugh and respond “Hey I appreciate that. Don’t tell anyone on your way out- but it’s my first day as a doctor.”\n\nI smile, shake his hand and leave before I can see if his face drops into disappointment. I exit the room to find the nurse standing there, obviously overhearing this statement, with an expression somewhere between amusement and scorn.\n\nI am admitting the woman with dizziness and break the news that she likely won’t be making it to her cabin this weekend. There’s soft pushback. I explain that if she were my mother I’d want her to stay in the hospital for further evaluation, and I would.\n\nThere’s a small pause and I blurt out “if you want, you can call me Dr. WTF FNG, RUINER OF WEEKENDS. I propose a weekend of awful hospital food and cable TV rather than a relaxing weekend at the cabin.”\nShe stares at me for a moment, and begins to laugh. She agrees to stay. I exit the room again to find the nurse holding onto an expression somewhere between concern and breaking laughter.\n\nThese damn curtains. I speak loudly and everyone can hear my weak passes at wit.\n\nI step backwards onto a small neurologist who has somehow snuck behind me. He does not feel that another patient of mine warrants a neurological consult but he’s already here in the ED and he’s trapped. Success. A tap on my shoulder saves me from the debate and I set to fix one of the many problems I’ve created from bumbling through the EHR.\n\nI don’t know how to document properly for billing, admit correctly for admissions, and discharge sufficiently to get the patient out. The PA is a saint. Seriously. Every question is answered patiently, from phone numbers to drug dosing. My attending, also up for canonization- is juggling every patient in the section while teaching three interns. The nurses are supportive, and graceful as they inform me of each small misstep and how to fix it. I can tell I'm slowing them down, but they're as understanding as over-worked nurses can afford to be, and I'm damn appreciative of this.\n\nI sit and try to catch up on non-existent notes and again my shoulder is tapped as I’m halfway through a sent-\n\n“That’s you.” The nurse informs me.\n\n“What?” I respond confusedly.\n\n“Trauma to Bay 4.”\n\n“What?”\n\n“You. That’s you. Go to Trauma Bay 4.”\n\nIt clicks. Those overhead pages now address me at this time.\n\nThe rest of my shift blows by, fueled by pretzels and coffee. I see the sick and ill alongside the worried well. I witness the aftermath of tragedy that will surface darkly in the newspaper days later.\n\nEach time I sit to chart, my phone rings or my shoulder is tapped. I incorrectly place and fix orders. I am slow. I feel I know nothing. Things that went so fast as a medical student take longer now, and are so much more complex. There was no magic click or growth following the MD that was placed behind my name a month ago. I am still just me, with the same knowledge base. As I work I realize the auditioning medical students likely, or perhaps certainly- know more than me.\n\nI can feel hard in my gut that I don’t have a flow, nor method to manage the tasks constantly flooding me. My shift ends and I melt into a chair in the resident workroom to catch up on my mangled notes.\n\nTwo senior residents slide into the room and flop down on the couch. They are on an off-service rotation and enjoying the periodic downtime and freedom.\n\n“So how’d it go?”\n\nI explain my concerns about flow and knowledge, pace and expectations.\nThey laugh.\n\n“It comes with time. You guys are doing great, seriously. It’s a whole new approach and we all do it a little differently. In a couple months you’ll be managing all of this and more with ease.”\n\nThey pause and one asks “So what did you think?”\n\nI sit for a second and scan my hazy memory of the past 9 hours. For a moment my gut relaxes.\n\n“It was awesome. I made the right choice.”\n\nThey laugh.\n\n“wtf, Welcome to Emergency Medicine.”",
    "title": "The Other Side: An EM Intern’s First Shift.",
    "subreddit": "medicine",
    "timestamp": 1498599672,
    "score": 489,
    "keyword": "woman doctor"
  },
  {
    "text": "Kentucky doctor delivers another woman’s baby before going into labour herself",
    "title": "Kentucky doctor delivers another woman’s baby before going into labour herself",
    "subreddit": "medicine",
    "timestamp": 1501545169,
    "score": 429,
    "keyword": "woman doctor"
  },
  {
    "text": "Toronto doctors save dying woman's life by removing her lungs (and placing her on ECMO while waiting for a transplant)",
    "title": "Toronto doctors save dying woman's life by removing her lungs (and placing her on ECMO while waiting for a transplant)",
    "subreddit": "medicine",
    "timestamp": 1485385879,
    "score": 373,
    "keyword": "woman doctor"
  },
  {
    "text": "San Diego woman dead after turmeric IV infusion by Naturopathic Doctor",
    "title": "San Diego woman dead after turmeric IV infusion by Naturopathic Doctor",
    "subreddit": "medicine",
    "timestamp": 1490333164,
    "score": 314,
    "keyword": "woman doctor"
  },
  {
    "text": "Women who are doctors: What are your experiences with sexism in the workplace and medical school? Does it ever get better? I'm a woman and I'm applying to medical school right now. Every person I meet who asks me what I studied in undergrad or what I do currently cannot seem to grasp that I am going to be a doctor. Every single time I tell someone I was pre-med and I'm applying to med school, the response is always some variation of \"oh, to be a nurse right?\" \"oh, so you mean you're going to nursing school.\" It makes me so mad!! If I was going to nursing school I would've said nursing school, not medical school. I feel like they're correcting me. This happens in bars, in ubers, at the hair salon, at work (pretty much every small talk interaction). And to top it off, when I explain that I am not going to be a nurse, but a doctor, I typically get some sort of laughter and mocking/teasing reaction along the lines of \"oh you must be real smart then right\". My male colleague has been asked by strangers if he is a doctor when he is walking through public wearing scrubs. Meanwhile, I literally tell people I'm going to be a doctor and they still can't understand how I'm not a nursing student. \n\nIs this the norm for other women in medicine? Does this ever change in medical school or the workplace? I want to hear other stories and know what to expect. Also any advice on how to firmly respond to certain comments would be nice too.",
    "title": "Women who are doctors: What are your experiences with sexism in the workplace and medical school? Does it ever get better?",
    "subreddit": "medicine",
    "timestamp": 1496727438,
    "score": 240,
    "keyword": "woman doctor"
  },
  {
    "text": "Fellow outpatient FP and IM providers, what tasks do you delegate to your staff? I recently came close to a nervous breakdown at work, because I was just so tired of working so hard, but seeing the mountain of work in front of me only grow, and facing a daily onslaught of patients and fellow employees annoyed at me for things undone. Our office manager (an experienced nurse and very people-smart woman) had a serious chat with me, and it came to her attention that I'm personally handling a lot of nuts-and-bolts tasks on my job that all the other providers at my practice delegate to nursing or clerical staff:\n\n* routine med renewals by e-script\n* prior authorizations\n* paperwork for durable medical equipment\n* legal forms\n* calling patients about normal labs and imaging\n* researching what the submitter of an unusual or unprecedented form for me to fill out wants exactly from me\n* checking if routine screening or monitoring labs are up to date\n\nI'm a highly self-reliant person, who's been faulted many times for \"trying to do it all\", long before I got into medicine. I don't easily trust people to do things for me and I have a hard time accepting favors. I try very hard not to be a borrower or a buck passer -- when a task is put in front of me, my knee jerk reaction is to just take it on myself and ask nobody for help. Less charitable people have described me as \"a control freak\" or \"not a team player\". I never scored well on Systems-Based Practice, and I'll readily admit that managing human resources is not a talent of mine.\n\nResidency did a piss poor job teaching me what nuts and bolts tasks of outpatient medical practice ought to be farmed out to supporting staff, versus done by the doctor. I was expected to do everything, both as a way to learn how the healthcare system works, and part of the (despicable, IMHO) boot camp culture of \"I can always do more\". Whenever I would ask my attendings, no matter how un-whining-ly, how much more I had to do or whether or not something was my responsibility or someone else's, I'd invariably get rebuked for even daring to ask, for breaking the polite fiction that residents are always happy to do more. So you could say I was conditioned not to delegate, but to put nose to grindstone and just do it.\n\nIt all makes sense now. For my first year as an attending, I've been taking on far too much. All of the items in my bullet list above are tasks my practice *would prefer* I farm out to support staff. Doesn't help that nobody ever told me this, nor that my nurse (medical assistant, actually) is brand spanking new too.\n\nHelp me out here, fellow Medditors. Imbue me with a sense of \"what's appropriate to delegate\" that I've never had.",
    "title": "Fellow outpatient FP and IM providers, what tasks do you delegate to your staff?",
    "subreddit": "medicine",
    "timestamp": 1491506323,
    "score": 42,
    "keyword": "woman doctor"
  },
  {
    "text": "Video shows woman demand a 'white doctor' treat son at Mississauga clinic",
    "title": "Video shows woman demand a 'white doctor' treat son at Mississauga clinic",
    "subreddit": "medicine",
    "timestamp": 1497965500,
    "score": 29,
    "keyword": "woman doctor"
  },
  {
    "text": "I've had the weirdest patients this week Just finished my third of 3 ER shifts. It seemed like all the local weirdos picked this week to have medical emergencies (or 'emergencies') but I got some really top-quality strange shit.\n\n* Normal-appearing woman smoked pot with her friend, then started worrying that her husband would be able to tell when he got home from work. So she called 911, as one does. Doctor saw her, kicked her out to the waiting room, and she sat there for 10 HOURS.\n\n* 4-year-old played on some kind of spinning carousel thing at a playground and felt dizzy afterwards, five days prior to arrival. He kept talking about how dizzy it had made him. Wasn't dizzy now, wasn't dizzy yesterday, wasn't dizzy 20 minutes after getting off the thing. He just kept bringing up how dizzy he *had* been almost a week earlier, and how cool it was. Parents decide this necessitates a 2 a.m. ER visit.\n\n* Guy who sprained his ankle offered me $100 cash for a special work note that said he was okay to go in for the week, but would be unable to attend the company picnic this weekend.\n\n* Another guy begged me to put an unnecessary IV in him, because he wanted to take a picture of himself with an IV.\n\n* Nursing home sent over a resident whose grandson had brought him one (1) unauthorized beer for his 89th birthday. They wanted a BAC and for us to sit on him until it fell to 0.\n\n* My personal favorite, my totally functional and non-crazy-seeming patient who, upon discharge, shit in a basin and winged it at the police officers who were sitting with an arrested patient down the hall.\n\nHow's everyone else's week been?",
    "title": "I've had the weirdest patients this week",
    "subreddit": "nursing",
    "timestamp": 1498689568,
    "score": 263,
    "keyword": "woman doctor"
  },
  {
    "text": "Just a \"thank you.\" I just wanted to say thank you to all of you wonderful nurses. I truly feel like it takes a special individual to get into the nursing profession. \n\nWhen I had my first baby, I was induced. I was a scared new mom, unsure of how everything was going to play out that day. I had the best nurse. I will never forget her. She worked 7am to 7pm. She told me at 6:45 that my doctor was going to call a c-section. I bawled. She told me she wasn't going anywhere. That sweet lady stayed with me through my operation, cleaned vomit off my chest when the anesthesia made me sick, held my hand, explained everything that was going on, and took pictures of my new family of three. She left at 8:30 that night after getting me settled into my postpartum room. I could not believe that this woman cared so much about my emotional well-being to sacrifice her time. Just writing this makes me tear up.\n\n\nI recently had a my third baby. I had a high-ish risk pregnancy (GD) and was monitored twice a week during my last two months of pregnancy. I was treated with the utmost dignity and respect. The nurses would always ask if there was anything they could do for me. When I would say \"no thank you, I'm okay.\" they would say \"let me just refill your water for you.\" Or \"would you like a warm blanket?\" They were always going above and beyond. Bless the CNA that helped me go to the restroom the first time after my surgery. What a shit show that debacle is.\n\nAbout 48 hours after delivery, I started feeling my hormones crash and the \"baby blues\" set in. My husband left to go take our older children to school and I just sat in my bed crying. When the nursery nurse came in, she looked concerned and asked if I was okay. I told her that this was my normal, that my body just freaks out day 2 or 3 from the hormones. She wiped my tears away and sat and talked to me for a good while. \n\nI know she was busy. I know you all are busy. You're over-worked and I'm sure you feel under appreciated. Please just know that lots of patients DO remember your good deeds and appreciate those little touches that you bring to patient care. You are making a huge difference in many people's lives. So thank you. Thank you for all you do, no matter how big or small.",
    "title": "Just a \"thank you.\"",
    "subreddit": "nursing",
    "timestamp": 1511323111,
    "score": 47,
    "keyword": "woman doctor"
  },
  {
    "text": "Looking for support I resigned from my job yesterday. Put in 3 weeks notice, but until my last day, I really need some emotional support from fellow teachers who have been in the same boat. I signed onto my job thinking I landed The perfect job my principal had promised me a salary of around $47,000 a year. However the salary ended up being much much less. I first saw this when I read through my contract. However I know I didn’t sign into teaching for the money so I kept the job anyway. In one of the first meetings I had with my principal he promised me that everything was already set for me. I wouldn’t have to reinvent the wheel all of the curriculum was in place and I would simply have to teach it and get adjusted to my first year of teaching. He also told me that their school was known for having an excellent mentoring program for new teachers. All of these were empty promises. One of the first promises broken was the curriculum. I was told that the curriculum was in a format that I could find online so I researched it. When I looked at the curriculum map, it was the most vague and on organized pathetic excuse for curriculum guide that I have ever seen. I teach high school English and one of the objectives was just “reading has been pushed to a high level.”  that’s just one of the many vague terms on there. Mainly it just has common core objectives listed and alongside with the different books that they’re supposed to read in class. No specific essays listed no specifics summative assessments and no specific overall goals. So basically I have no idea what I’m doing. So being a new person my first stop was teachers pay teachers. I have probably spent over $300 in just lesson plan material because of the lack of preparation that I was given. Believe me I do have a new teacher mentor and I did confront her with this issue. She told me “oh I don’t think the old guy who you replaced knew how to fill out the curriculum guide. “And that was her excuse. Since she didn’t offer to help me, I thought that I would ask for some help among the entire department at our next department meeting. Upon entering that meeting I had made a list of questions to ask because I was unsure and I needed to get help from somewhere. One of the first questions I asked was “does anybody happen to have some really good MLA formatting materials that I could borrow?” Immediately another coworker, let’s call her Jan for lack of confusion, snaps at me “well what do you need MLA formatting materials for? “ I explained to her that I had developed this project where students would conduct research over a different forms of mythology and I didn’t even get to finish the word mythology before she interrupted me and said “they already did that in middle school!” I tried to rephrase what I was about to say and correct myself in stating that it wasn’t Greek mythology but rather modern day forms of myths and legends and yet again she interrupted me and snapped “well I’m already doing that in my class then!” I replied “Well, could we all meet to go over my curriculum guide because I am confused as to what I can and cannot teach. “ their response to me was that they would plan a day when we could do this, only there only free day was nearly a month from that day. I left that meeting feeling very lost, confused, alone, and unsupported. on top of all of this, I am also involved in extracurricular activities. So meanwhile while I am just trying to not lose my sanity in figuring out what I’m doing every day, I somehow am supposed to manage all of this and the extracurricular activities that I sponsor. I would try and ask for help whenever I could during my lunch hour to other teachers, but Jan yet again would cut me off and berate me in front of everyone. When I tried talking to my mentor about this problem, she stated “that’s just how Jan is.” So then I started to eat lunch in my room. So now, I have no friends at the school in fact I have a woman that attacked me every time I have to ask for help and I have no idea what I’m doing with no support from anyone. I came home from school almost every day sobbing to my parents. As I drove home from work, I contemplated suicide. One day, I woke up and I couldn’t breathe. It felt like there was a whole inside of my chest. I decided to take the day off and the panic attack lasted almost all day until finally I took a sleeping pill and try to go back to bed. The next day, I try to force myself to go to school. I was standing in front of the entire class teaching when I felt little droplets of sweat forming on my four head. I went and calmly sat down at my desk and the students continue to work on an assignment I given them. During my prep time I went to the bathroom and I got sick. I told my secretary and she let me go home for the rest the day. I couldn’t eat, couldn’t sleep. In 3 days, I was only able to force down half of a granola bar. That day I went to my doctor and she told me I was definitely developing an anxiety disorder and having severe depression. She told me it sounded like I was so overwhelmed that I might be developing a stomach ulcer. She told me if you have a job that is making you physically ill and mentally ill due to a laundry list of aspects then get out because that is a toxic environment. This really resonated with me and I got put on anxiety medication. She gave me a doctors note so that I could take the weekend to decide what I was going to do. That weekend after crying for what seemed like hours on end and not eating for three days I decided that I was going to resign. I would give them three weeks notice and I would be very professional about it but I just couldn’t live this way anymore. The stress and toxic environment was literally tearing me apart from the inside out. This might all sound dramatic, and you might just think that I’m a quitter or someone who is weak and couldn’t handle teaching. But I needed to learn that my mental health comes first and that I don’t have to push through with something that makes me miserable every day just because it seems like that’s what’s the right thing to do. I learn to put myself first, and I learned that I am in control of my own life and my own happiness. I’m glad that I no longer have to see suicide as my only option. I just need to get through these next three weeks and then I can finally be free. I don’t know if I’m officially done with teaching, but for right now I definitely need some space from it in order to value it again because I feel like my dream has been murdered by a shitty school. Right now, I just really need some support from others who have been in a similar situation. \n\nTLDR: Everything about my job was toxic so I resigned and now I’m looking for support.",
    "title": "Looking for support",
    "subreddit": "Teachers",
    "timestamp": 1508243188,
    "score": 6,
    "keyword": "woman doctor"
  },
  {
    "text": "Teenage Crisis: What should I do with my life? Hey, guys! I'll try to get to the point, as I hate when others drag on in their writing.\nSo, I'm a 16 yo kid, I'm poor (single parent, low wages) and a minority (although I pass as an American). I used to be one of the really smart kids when I was little (winning awards and stuff) but that's changed over the years. I'm a little less active in school, I feel less smart, find it hard to get motivated and am mostly depressed all the time.\nThat said, I am excited for college. I have a scholarship set up already (basically I get to go to uni for free). I'm excited for uni for several reasons: mostly because I look forward to being free of the hindrances of living with my mom (an elderly, sick woman who I love, but who makes me feel old, too, sometimes) but also because I want to FINALLY be myself and pursue my interests. My aunt (a doctor) tells me I should become a doctor too. She thinks if I work hard enough and get off my ass and pursue the dream, I can achieve it. Other people have straight-up told me I'm dumb and lazy and irresponsible and would make an awful doctor. I've been thinking about healthcare, business, law/politics and construction/agriculture mainly as fields I'm interested in.\nFacts about me\nSmarts: 3.8 gpa, mostly A student (and that's when I'm lazy) but I still feel like I'm dumb, probably because I hate myself. I'm a procrastinator, and that makes me hate myself most of the time and I don't know how to stop.\nPros: I'm artistic, creative, good with my hands, imaginative and good at analyzing literature & interpreting stuff, helping others, reading (i love reading) writing, expressing my thoughts, and -sometimes- teaching.\nCons: I'm lazy (trying to be better, though), depressed, slightly erratic, spontaneous, self-belittling, introverted.\nThings I like: Art, Literature Science (even tho I love it, I suck at it sometimes), History, Politics, Social Sciences, Psychology, Health Science\nThings I suck at/would probably suck at: Math, Physics, Engineering, Finances\nI'm torn between wanting to stay here and pursue a cheaper education which probably guarantees more money and moving out in the future OR leaving as soon as I have my bachelor's degree and studying while working & living on my own. I really, really want to live on my own as I HATE my current living situation. But I'm also open to staying, especially if it means a better situation with work in the future.\nWhat do you think? What should I do? What should I study?",
    "title": "Teenage Crisis: What should I do with my life?",
    "subreddit": "careerguidance",
    "timestamp": 1505965898,
    "score": 2,
    "keyword": "woman doctor"
  },
  {
    "text": "White dudes across the internet are being triggered because the new Doctor Who lead is a woman And I'm just sitting here cackling.",
    "title": "White dudes across the internet are being triggered because the new Doctor Who lead is a woman",
    "subreddit": "blackladies",
    "timestamp": 1500252481,
    "score": 2,
    "keyword": "woman doctor"
  },
  {
    "text": "She is a woman, she is educated, she is a doctor, and though she can earn for herself she prefers blackmailing men for money.",
    "title": "She is a woman, she is educated, she is a doctor, and though she can earn for herself she prefers blackmailing men for money.",
    "subreddit": "MensRights",
    "timestamp": 1505814687,
    "score": 219,
    "keyword": "woman doctor"
  },
  {
    "text": "My wife was charged with assault today. And forcible confinement. I put up with the abuse for around 5 years.  She has provoked me into physically defending myself more than once andd it paralyzed me with fear that she could convince the authorities that I was the aggressor.  \n\nThings of course escalated over time, being undealt with.  She started threatening to call the cops\n\nWhat broke the camels back is over mothers day weekend she started drinking and called our daughter an \"attention whore\" within earshot.  Our daughter is 4 and my angel, my pride and joy.  I told her to go fuck herself and went to the shed, then a few minutes later went in to grab a beer and then go sit outside to cool off.  She went ballistic that I took another beer and ended up pushing me and biting me with our daughter in my arms.  \n\nI went to the hospital earlier today to have them look at a bite mark she left on me and to report the incident.  The FEMALE doctor said \"that's assault you know,  you should consider contacting the police. My husband is an officer\".   I ask her - wouldn't be just be my word against hers?  She says \"No, I've seen it and the police will take pictures.  The police will make a judgement call.\"   I then went to the police and showed them the bite and that she was blocking me from leaving the house and ended up shoving and biting me.  \n\nLong story short guys - Don't hesitate to contact the police if you have been assaulted.  Even if you've just been FORCIBLY CONFINED, contact the police.  It is illegal to block someone in a room and not let them leave.  This evokes your right to physically defend yourself, meaning you have the right to push them out of the door to get out, within reason.  You can't purposefully cause injury but you most certain can push them back out of the way and even restrain them if they start assaulting you for trying to escape.  Assault simply means pushing, shoving, body-blocking, etc.  Anything a man would never get away with towards a woman really does apply to us also.   YOU MUST CONTACT THE POLICE FIRST.  The female doctor said I should before the situation gets redirected back on me - because if your abuser contacts the police first because they feel you are about to report them,  you could very well be the one in handcuffs instead of them. \n\nedit: a word",
    "title": "My wife was charged with assault today.",
    "subreddit": "MensRights",
    "timestamp": 1494900545,
    "score": 172,
    "keyword": "woman doctor"
  },
  {
    "text": "Mansplaining is Simply Men Speaking. I couldn't stop laughing at this. Apparently if a man with a M.D. explains the necessity of getting patients moving post-op to a woman with a Master's degree...that's mansplaining. \n\nI'm guessing that in her mind her two-year graduate degree trumps his doctorate in medicine. \n\nThese women are nuts.\n\nhttp://www.scarymommy.com/men-stop-mainsplaining/",
    "title": "Mansplaining is Simply Men Speaking.",
    "subreddit": "MensRights",
    "timestamp": 1508812694,
    "score": 155,
    "keyword": "woman doctor"
  },
  {
    "text": "Feminists oppose men's sexual freedom This web site is named the Campaign Against Sex Robots, but its title should be the Campaign Against Men's Sexual Freedom.  Companies like Real Doll have for years sold realistic looking sex dolls for men (and some women) who want an alternative to the real thing.  They're essentially high-end sex toys.  Now Real Doll, and several other companies, are at work creating sex robots, which will essentially be animated versions of the silicon sex dolls.  They're not for everyone.  Some people will find that strange, but for some people it may be the only sex or companionship they can get.  Other people who have sex lives might want such a toy to enhance their sex lives.  Maybe a guy has a girlfriend and has always fantasized about a threesome.  A sex robot could provide that without the risk of including another actual person.  The bottom line is if a sexual activity does not force any person to do anything against their will, then it's their business and no one else's.  \n\nHowever, the Campaign Against Sex Robots opposes a man's right to make such a choice, even though his doing so hurts no one else.  They make absurd arguments against sex robots.  They claim that the use of sex robots will turn men into rapists.  It's the same old tired refrain we keep getting from feminist hate groups: Everything is rape.  It's not clear from their arguments if they think that using a sex robot will cause a man to go out and rape a real woman or if they think the robot is getting raped.  First of all, women have used dildoes for decades and they've never caused a woman to go out and rape any man, woman, or child.  Sex robots, as high-end sexual enhancers, will not cause men to do that either.  And it's not possible to rape a robot.  The robot is not a sentient being any more than a dildo is.  \n\nThe truth is that feminists simply hate male heterosexuality.  They've bitched for years over what is totally involuntary about male sexuality: That men prefer young and beautiful women.  That's just the way evolution has made human biology.  You could not change that any more than you could change the rings of Saturn.  You'll have about as much success changing that as religion fanatics have converting gays to being straight.  The irony is religion fanatics are hostile toward male homosexuality while feminists are hostile toward male heterosexuality.  \n\nFeminists hate men who go out socializing trying to find a girlfriend.  Supposedly, it's sexist or feeling “entitled to sex” to look for a girlfriend and ask for a woman's phone number.  \n\nFeminists hate men who don't have a girlfriend.  If you decide “fuck it, it's not worth it” and pursue your own life's goals sans female companionship, you're branded a loser.  \n\nFeminists hate men who pay for sexual services.  Pay your hard-earned money for the services of a prostitute and somehow you're exploiting women, even if it's in a Nevada brothel where all the professionals there do their trade willingly.  \n\nNow feminists are adding a new thing to hate men for.  If you don't do any of the above and instead buy a sex robot, something that hurts no one else and doesn't infringe upon anyone else's rights, they hate you for that.  \n\nThe only thing they won't hate you for is for being a man who has a six-figure income, looks like a model, and works as a doctor.  That's probably something like .004% of the male population.  The other 99 plus percentage of men are worthy of feminist scorn.  \n\nI never wanted to have to fight against feminists, but I will.  They're out to oppress male sexual freedom.  If you want to go MGTOW and just have sex with realistic robots, that should be your choice.  If you want to hire sexual services, that should be your choice.  If you want to stay in the game and search for a girlfriend, that should be your choice.  In all of these, as long as you don't force anyone to do anything against their will, it should be no problem.  However, feminists have a problem with you being anything other than a drop-dead model gorgeous dude who earns 500K as a doctor (or some other glamorous profession).  \n\nShoeonhead has made a great video mocking the hatred of feminists over sex robots: \nhttps://www.youtube.com/watch?v=Z2nOsdj8dmc",
    "title": "Feminists oppose men's sexual freedom",
    "subreddit": "MensRights",
    "timestamp": 1503884202,
    "score": 110,
    "keyword": "woman doctor"
  },
  {
    "text": "Former Doctor Who Peter Davison says casting of woman means 'loss of role model for boys'",
    "title": "Former Doctor Who Peter Davison says casting of woman means 'loss of role model for boys'",
    "subreddit": "MensRights",
    "timestamp": 1500633894,
    "score": 93,
    "keyword": "woman doctor"
  },
  {
    "text": "Study on bisexual women's discrimination and sexual experiences Hello,\n\nMy name is Raquel Craney, and I’m a student in the Counseling Psychology Doctoral program at the University of Missouri-Kansas City (UMKC), conducting research regarding bisexual women’s sexual experiences, discrimination, coping, and distress. In order to voluntarily participate in this study, you must a) identify as a bisexual woman (or identify with the experience of being a woman who is attracted to people of the same gender and people of genders different than you), b) be 18 years of age or older, and c) live in the United States. We would like to provide a TRIGGER WARNING because this survey asks questions about unwanted sexual experiences. We are very interested in hearing from BISEXUAL WOMEN OF COLOR, although women from all racial and ethnic backgrounds are welcome to participate.\n\nIf you are interested in participating, you will be asked to complete an anonymous online survey that will take approximately 20 to 30 minutes, one time only. If you are interested in participating, please click on the following link: https://umkc.co1.qualtrics.com/SE/?SID=SV_eII5JmAeCcklliZ\n\nOr, if you would like further information, please email Laurel Watson at watsonlb@umkc.edu\n\nFor your participation, you may choose to enter a raffle to win one of eight $25.00 Amazon.com gift cards.\n\nThis study, protocol number 16-505, was submitted to the UMKC IRB and determined to be exempt from IRB regulations. If you have any concerns about your rights as a participant your concerns please call 816-235-5927\n\nThanks for your consideration, and please feel free to share widely!\n\nRaquel Craney University of Missouri, Kansas City Counseling & Educational Psychology rscbqb@mail.umkc.edu",
    "title": "Study on bisexual women's discrimination and sexual experiences",
    "subreddit": "Feminism",
    "timestamp": 1503499889,
    "score": 111,
    "keyword": "woman doctor"
  },
  {
    "text": "I will not remain silent: A recount of my first molestation. Well, it happened. It was bound to in light of the overwhelming statistics. In fact, I’ve been an outlier for the past 12 years (every 2 minutes an American is sexually assaulted) but on a Friday night, by a friend of a friend, when we were all supposed to be having fun, I was forcibly grabbed from behind (at least twice), while en route to the next bar. He shoved his hand roughly down my stomach to my groin (thankfully over my pants), and fondled my chest while grinding against my back. On the street. In front of hundreds. \n\nI did nothing. \n\nNo pushing him away, no attempts to escape, and not a word of protest. I did not want to cause a scene. I did not want him to call me a cunt, or bitch, or any other of the slew of insults thrown at women for not accepting unwanted attention. I did not want to rock the boat. So, I made my way to the next bar, squirming out of his continued attempts as best I could without being overtly aggressive. Once we made it past the bouncer (another opportunity to ask for help missed), I told him that I needed to “go to the bathroom,” and that I would “be right back.”\n\nI did not go to the bathroom. Nor did I come back. Instead, I escaped through the back door like a burglar, looking sheepishly away from the bus boy who was throwing a bag of rubbish into the over-sized dumpster. I ran through the crowd, from whom I asked no help, and of whom no one stepped forward to ask if everything was okay. I made it to my car, nervously looking about to ensure that he hadn’t somehow realized what I was doing and followed me out, got in, closed the door, and wept. Like a fucking baby.\n\nI am a second-degree black belt. I’ve traveled the world, got my juris doctorate, and bought my own house. I am a grown-ass woman, and was crying like a goddamned baby. Not because I was scared, or felt violated; but because I was so ashamed of myself. I had every opportunity to say something to him; to anyone else. I had every opportunity to run away. I had every opportunity to punch him in the fucking throat. But I didn’t. I was not confident enough—not in my training (you don’t need to be trained in martial arts to gouge someone’s eyes out)—but in my own self-worth. \n\nI did not respect myself enough to speak up when I was being treated as a brainless, soulless piece of ass. I did not think I deserved to bother strangers with my problems. \n\nBut, you know what?\n\nI do deserve to bother people when I’m being attacked. \n\nI do deserve to push misogynistic, soft-skinned, weak-minded, negging, entitled, prissy, fuckface pieces of utter garbage away when they overstep their bounds. \n\nI deserve to be angry. \n\nI won’t press charges for what was absolutely egregious statutory  misdemeanor battery, because I don’t want to spend any more time or energy on a waste of space, resources and oxygen. But, what I am going to do, is rehearse. Practice. Look at my face in the mirror every day and tell it that it’s fucking awesome, and that it—along with the rest of my body—deserves respect. I’m going to rehearse exactly what I’ll do and say to anyone else who thinks they can touch me without my say so. I’m going to practice evasive actions and self-defense tactics.\n\nSo, the next time I go out to dance, and wear sexy clothing, and drink—because I fucking can, and won’t let asshats dictate what I do on my limited and precious time to myself—I will not be passive, sending mind messages to people around me, silently pleading for help. I will not remain silent. \n\nI. Will. Not. Be. Ashamed. \n\n**Update**\nI mustered the courage to report the incident to the local police department. The report was filed for informational purposes only, which means that it will not go to the state attorney for consideration for prosecution (and likely would not have been chosen as a candidate anyone due to the lack of known witnesses). \n\nHowever, now fuckface's name is in the system so that next time he tries his shenanigans and they are reported, there will be a record to help the next victim bring his pathetic ass to court. \n\nIt was also highly empowering to be able to follow though on my promise to myself not to be silent. Of note, the officer who took my statement  was amazing. She listened to my story, prompting me for details as gently as she could; and when she saw the emails he sent me the morning after, which asked \"how dare I leave him,\" she correctly noted his worth as a human. It was not high.",
    "title": "I will not remain silent: A recount of my first molestation.",
    "subreddit": "Feminism",
    "timestamp": 1488897485,
    "score": 105,
    "keyword": "woman doctor"
  },
  {
    "text": "A feminist defending Islam - does this make sense? Anita Sarkeesian did a YouTube video where she [defended Islam](https://www.youtube.com/watch?v=ZVUmpuq7ygg).  My understanding of Islam is that it's the most patriarchal system operating in the world today.  In the last moments of her video she answered the question about patriarchy by saying Christianity is a patriarchy.  That dioesn't seem right since the 1950s American Christianity was patriarchal, [Christianity is dying in the US](http://www.huffingtonpost.com/entry/american-christianity-is-dying_us_582740ade4b02b1f5257a2ff).  \n\nYet, when I hear her defend Islam my mind is filled with what I think I know about Islam:  \nIslam does this: [Michigan doctors charged in first federal genital mutilation case in US](http://www.cnn.com/2017/04/22/health/detroit-genital-mutilation-charges/index.html)\n\nAnd this: [British woman who says she was gang raped arrested on 'extra-marital sex' charges in Dubai as attackers go free](http://www.independent.co.uk/news/uk/home-news/british-woman-tourist-arrested-charged-jail-dubai-gang-rape-extra-marital-sex-hotel-uae-police-a7420616.html)  \n\nWhile searching for more examples, I came across this from [Prager video](https://www.youtube.com/watch?v=wJkFQohIKNI) of Ms. Ayaan Hirsi Ali describing the incompatibilities of Sharia law and the risks to feminism and how allowing it to flourish will harm the advances already made for western women. She has her detractors, but they are doing FGM in MICHIGAN for gosh sakes!\n\nLet's not even get started on how Muslim countries are executing members in the LGBT community. \n\nI promise to have an open mind.  You're the feminists.  Straighten me out.\n\n\n\nEDIT:  There's a lot of commentary around the edges of the topic but nobody has taken the position to refute the claims of Islamic behavior, and nobody has tried to explain why a feminist would defend those who practice the behavior.  I'm just as confused as I was when I posted this.",
    "title": "A feminist defending Islam - does this make sense?",
    "subreddit": "Feminism",
    "timestamp": 1497672943,
    "score": 18,
    "keyword": "woman doctor"
  },
  {
    "text": "My Harvey Weinstein was my high school teacher. This is my story. It happened in a small, wealthy, Catholic high school--run by Catholic brothers, fairly conservative, extremely sexist, extremely homophobic, extremely white, highest position held by a woman was guidance counselor. As a senior, I chose psychology as my second semester elective. The instructor was an alumni, been teaching a few years after 20+ years in law, and well regarded in the school/entire community because he was also the football coach. His son was a student in my year. To the football team, he was not only Coach, he was also their best friend's/teammate's dad. People hung out at this guy's house. This teacher was also my home room teacher all year. He knew exactly what rules to break to make him popular as a teacher--never marked you late no matter what time you strolled in, let you do homework, and didn't care if your shirt was tucked in. Every female was \"sweetheart\". He gave every male a personal nickname. He was very dad-like. \n\nSecond semester, day one of his class, he shut the door and it started. Basically, we were told that what happened in that class, stayed in that class. We were going to talk about things that the \"boss\" wouldn't like--sex, drugs, rock and roll type things. He set up an \"us\" against \"them\" mentality really early. He told us we were going to get really close. He made it clear that if you weren't going to be cool about it, you needed to drop the class. Then, he specifically stated: \"if i ever make you uncomfortable, come to me and we'll work it out, don't get an administrator involved and ruin it for everyone else\". He started slow: making stupid sex jokes, telling us about his glory days as a lawyer in the 80s, making comments here and there about women's bodies in general. Then the \"jokes\" got a little more graphic--throwing in lewd hand gestures. When we got to a lesson that included sexual harassment, he told us that sexual harassment doesn't happen anymore. Women routinely lie or exaggerate and it ruins men's careers. And when men do cross a line, it's because they don't know any better and women need to lighten up. In his unit on abnormal psychology, he thought it was important for us to know that \"some doctors\" say that homosexuality fits the criteria of a mental illness. About this time in the semester, his style of dress started to became more relaxed. He started wearing basketball shorts with no underwear rather than his usual khakis. This was a very small classroom so he was less than a foot away from you if you sat in front, which I did. He told us that he had \"friends\" that commented on how hot the girls were at our school. \n\nOne day at lunch, sitting with 3 girls from my class, I worked up the courage to say, \"so Coach is like...a creep, right?\" The response was essentially \"yeah, you didn't know?\" He only taught 2 classes each semester. All seniors. He was a guaranteed A. That's how he got away with this shit. Nobody is going to rock the boat a few months before graduation and he knew it. Right before final exams we played his version of \"Girls ask Guys\". We were encouraged to ask ANYTHING, without embarrassment, because questions were going to go in a hat. What happens in class, stays in class, remember? We were graded on our discussion participation but we could say \"pass\". A lot of sex questions came up because we were all 17/18yr olds trying to play this demented man's game. We went around the room and were pressured to talk about sexual fantasies, masturbation habits, penis size etc. There was several days of this. Looking back, I think he humiliated us for his entertainment. This was in 2010. Last I checked, he is still teaching. Every word of this is true and I would testify in court if his day ever comes.",
    "title": "My Harvey Weinstein was my high school teacher. This is my story.",
    "subreddit": "Feminism",
    "timestamp": 1508369435,
    "score": 10,
    "keyword": "woman doctor"
  },
  {
    "text": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n\"**Consciousness-raising: A Constant Change of Heart**\n\nFeminists are made, not born. One does not become an advocate of feminist politics simply by having the privilege of having been born female. Like all political positions one becomes a believer in feminist politics through choice and action. When women first organized in groups to talk together about the issue of sexism and male domination, they were clear that females were as socialized to believe sexist thinking and values as males, the difference being simply that males benefited from sexism more than females and were as a consequence less likely to want to surrender patriarchal privilege. Before women could change patriarchy we had to change ourselves; we had to raise our consciousness.\n\nRevolutionary feminist consciousness-raising emphasized the importance of learning about patriarchy as a system of domination, how it became institutionalized and how it is perpetuated and maintained. Understanding the way male domination and sexism was expressed in everyday life created awareness in women of the ways we were victimized, exploited, and, in worse case scenarios, oppressed. Early on in contemporary feminist movement, consciousness-raising groups often became settings where women simply unleashed pent-up hostility and rage about being victimized, with little or no focus on strategies of intervention and transformation. On a basic level many hurt and exploited women used the consciousness-raising group therapeutically. It was the site where they uncovered and openly revealed the depths of their intimate wounds. This confessional aspect served as a healing ritual. Through consciousness-raising women gained the strength to challenge patriarchal forces at work and at home.\n\nImportantly though, the foundation of this work began with women examining sexist thinking and creating strategies where we would change our attitudes and belief via a conversion to feminist thinking and a commitment to feminist politics. Fundamentally, the consciousness-raising (CR) group was a site for conversion. To build a mass-based feminist movement women needed to organize. The consciousness-raising session, which usually took place in someone’s home (rather than public space that had to be rented or donated), was the meeting place. It was the place where seasoned feminist thinkers and activists could recruit new converts. Importantly, communication and dialogue was a central agenda at the consciousness-raising sessions. In many groups a policy was in place which honored everyone’s voice. Women took turns speaking to make sure everyone would be heard. This attempt to create a non-hierarchal model for discussion positively gave every woman a chance to speak but often did not create a context for engaged dialogue. However, in most instances discussion and debate occurred, usually after everyone had spoken at least once.\n\nArgumentative discussion was common in CR groups as it was the way we sought to clarify our collective understanding of the nature of male domination. Only through discussion and disagreement could we begin to find a realistic standpoint on gender exploitation and oppression.\n\nAs feminist thinking, which emerged first in the context of small groups where individuals often knew each other (they may have worked together and/ or were friends), began to be theorized in printed matter so as to reach a wider audience, groups dismantled. The creation of women’s studies as an academic discipline provided another setting where women could be informed about feminist thinking and feminist theory. Many of the women who spearheaded the introduction of women’s studies classes into colleges and universities had been radical activists in civil rights struggles, gay rights, and early feminist movement. Many of them did not have doctorates, which meant that they entered academic institutions receiving lower pay and working longer hours than their colleagues in other disciplines. By the time younger graduate students joined the effort to legitimize feminist scholarship in the academy we knew that it was important to gain higher degrees. Most of us saw our commitment to women’s studies as political action; we were prepared to sacrifice in order to create an academic base for feminist movement.\n\nBy the late ‘70s women’s studies was on its way to becoming an accepted academic discipline. This triumph overshadowed the fact that many of the women who had paved the way for the institutionalization of women’s studies were fired because they had master’s degrees and not doctorates. While some of us returned to graduate school to get PhDs, some of the best and brightest among us did not because they were utterly disillusioned with the university and burnt out from overwork as well as disappointed and enraged that the radical politics undergirding women’s studies was being replaced by liberal reformism. Before too long the women’s studies classroom had replaced the free-for-all consciousness-raising group.\n\nWhereas women from various backgrounds, those who worked solely as housewives or in service jobs, and big-time professional women, could be found in diverse consciousness-raising groups, the academy was and remains a site of class privilege. Privileged white middle-class women who were a numeric majority though not necessarily the radical leaders of contemporary feminist movement often gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential.\n\nSuddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing. These careerbased changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate.\n\nWithout the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make CONSCIOUSNESS-RAISING 11ten gained prominence because they were the group mass media focused on as representatives of the struggle. Women with revolutionary feminist consciousness, many of them lesbian and from working-class backgrounds, often lost visibility as the movement received mainstream attention. Their displacement became complete once women’s studies became entrenched in colleges and universities which are conservative corporate structures. Once the women’s studies classroom replaced the consciousness-raising group as the primary site for the transmission of feminist thinking and strategies for social change the movement lost its mass-based potential. Suddenly more and more women began to either call themselves “feminists” or use the rhetoric of gender discrimination to change their economic status. The institutionalization of feminist studies created a body of jobs both in the world of the academy and in the world of publishing.\n\nThese career-based changes led to forms of career opportunism wherein women who had never been politically committed to mass-based feminist struggle adopted the stance and jargon of feminism when it enhanced their class mobility. The dismantling of consciousness-raising groups all but erased the notion that one had to learn about feminism and make an informed choice about embracing feminist politics to become a feminist advocate. Without the consciousness-raising group as a site where women confronted their own sexism towards other women, the direction of feminist movement could shift to a focus on equality in the workforce and confronting male domination. With heightened focus on the construction of woman as a “victim” of gender equality deserving of reparations (whether through changes in discriminatory laws or affirmative action policies) the idea that women needed to first confront their internalized sexism as part of becoming feminist lost currency. Females of all ages acted as though concern for or rage at male domination or gender equality was all that was needed to make one a “feminist.” Without confronting internalized sexism women who picked up the feminist banner often betrayed the cause in their interactions with other women.\n\nBy the early ‘80s the evocation of a politicized sisterhood, so crucial at the onset of the feminist movement, lost meaning as the terrain of radical feminist politics was overshadowed by a lifestyle based feminism which suggested any woman could be a feminist no matter what her political beliefs. Needless to say such thinking has undermined feminist theory and practice, feminist politics. When feminist movement renews itself, reinforcing again and again the strategies that will enable a mass movement to end sexism and sexist exploitation and oppression for everyone, consciousness-raising will once again attain its original importance. Effectively imitating the model of AA meetings, feminist consciousness-raising groups will take place in communities, offering the message of feminist thinking to everyone irrespective of class, race, or gender. While specific groups based on shared identities might emerge, at the end of every month individuals would be in mixed groups.\n\nFeminist consciousness-raising for males is as essential to revolutionary movement as female groups. Had there been an emphasis on groups for males that taught boys and men about what sexism is and how it can be transformed, it would have been impossible for mass media to portray the movement as anti-male. It would also have preempted the formation of an anti-feminist men’s movement. Often men’s groups were formed in the wake of contemporary feminism that in no way addressed the issues of sexism and male domination. Like the lifestyle-based feminism aimed at women these groups often became therapeutic settings for men to confront their wounds without a critique of patriarchy or a platform of resistance to male domination. Future feminist movement will not make this mistake. Males of all ages need settings where their resistance to sexism is affirmed and valued. Without males as allies in struggle feminist movement will not progress. As it is we have to do so much work to correct the assumption deeply embedded in the cultural psyche that feminism is anti-male. Feminism is anti-sexism. A male who has divested of male privilege, who has embraced feminist politics, is a worthy comrade in struggle, in no way a threat to feminism, whereas a female who remains wedded to sexist thinking and behavior infiltrating feminist movement is a dangerous threat. Significantly, the most powerful intervention made by consciousness-raising groups was the demand that all females confront their internalized sexism, their allegiance to patriarchal thinking and action, and their commitment to feminist conversion. That intervention is still needed. It remains the necessary step for anyone choosing feminist politics. The enemy within must be transformed before we can confront the enemy outside. The threat, the enemy, is sexist thought and behavior. **As long as females take up the banner of feminist politics without addressing and transforming their own sexism, ultimately the movement will be undermined**.\"",
    "title": "Hooked on bell hooks, part 3: \"Consciousness-raising: a constant change of heart\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1507273110,
    "score": 6,
    "keyword": "woman doctor"
  },
  {
    "text": "Fixation on nuclear families at the expense of moms? I posted something https://redd.it/6silnk that made me think about how fixated US culture is on nuclear families. I have a number of friends who are Arab and Asian and I started asking them about the family structures in their cultures, particularly around birth and child rearing. All of them said that it's a given that a new mother will have a ton of support from parents, aunts, and cousins and this continues really throughout childhood, with families helping it seems like a lot more than they do here. The woman moving into her parents' house is pretty common after birth too.\n\nIn the US it seems like there is a strong belief that your family is first and foremost your spouse, then kids, then any other relatives, but it's based around the spouse. Even if your spouse has only known you for a year they're still number 1. And asking for help from family is seen as stunted or immature.\n\nI encountered this recently when I listed my mom as my emergency contact and the doctor's assistant was like why would you not put your spouse? Well because my mom is close by, retired and more likely to be able to actually respond to phone calls, and as close to me as my spouse is!\n\nWhy is that? It seems like we have such high rates of postpartum depression and stressed out mothers, yet maybe we've tossed aside something that makes it a lot easier for everyone.",
    "title": "Fixation on nuclear families at the expense of moms?",
    "subreddit": "Feminism",
    "timestamp": 1503094194,
    "score": 4,
    "keyword": "woman doctor"
  }
]