[
  {
    "text": "Should I quit my stressful job and just temp instead? Hi. I'm at my wits end with my job- apologies for the essay. I had an interview a week ago for the most perfect job for me but to get the time off I said I had a doctors appointment in the morning. The previous afternoon the Principal (yes I work in a school) emailed saying I needed to speak to her before she could authorise my absence? She wasn't available all afternoon so I was feeling anxious all day, not knowing what to do. My line manager has been very reassuring saying it's normal behaviour here. The Principal came into my office at the end of the day and put me on the spot interrogating me about the appointment. She asked me what it was for as if it's a routine appointment she can't authorise it (?) but I said I'd been unwell at the weekend (had been off sick anyway) and that I still didn't feel right and I need to have some tests. She then asked if it was a fasting blood test and being on the spot I said yes and she continued to put words in my mouth that \"those appointments tend to be first thing so you should be back by 9:30 right?\" Me:\"Erm well last time I had to wait hours to be seen\" \"but you can turn up early to avoid that can't you?\"\nShe agreed to the morning off but then after speaking to HR came back asking me why I'd said I might not be back until 1pm? My job interview was the other side of the city at 10am and lasted 2 hours so I knew 1pm could be doable. So the interview ran over and the trains were all delayed so the earliest I could get back to work was 2:30! I decided to lie even more to my kind boss that I'd been ill at the doctors and was sick on the bus so wasn't going to make it in. I felt so guilty! She said that HR will want to see my appointment card! But I never get given an appointment card or letter unless it's something serious like a hospital appointment. I'm feeling super anxious about it now especially if I don't get this job. I'm actually thinking to hand my notice in and join an agency. I have a bit of money saved and a supportive partner but there's that risk of not finding work. I don't know what to do. An agency rang be back straight away after I submitted my cv to say they have clients always looking for my skills so I'm feeling a little more confident.\nThis Principal is a sociopath. She sacked a cleaner for taking unauthorised leave even though the cleaner gave 9 months notice and it was her step sons wedding she wanted to go to! Also she refuses people dentist appointments even if they're at the end of the day when it's quieter. I just want to get out of there. Its really stressful too 😢 Today they handed me a formal letter saying I have to meet with them to discuss my sickness absence as it's gone over their limit (they have a ridiculous HR policy) and that I might be given a written warning! Plus also I was emailed today that I have to start covering on the reception desk as they are short staffed. That job is my worst nightmare I hate anything people facing and it's a really high stress job as the parents that come into the school are abusive and sometimes violent :( plus I've always been let off other duties as my role is so busy that I can't be away from my desk.\nI still haven't heard about the interview and they were supposed to let me know 4 days ago but when I emailed them they said a decision hadn't been made yet. So there's still hope.\nI cried in the toilet at work today and then on the bus home. I feel like handing in my notice asap but I don't think it's a good idea. My boyfriend thinks I should do it the day before the meeting which will be in over a weeks time so maybe between now and then the agency or job offer will come. But also it'll mean I won't have to go through the emotional trauma of that meeting. The last time I had one they told me I need to wash my hands more if I'm getting ill all the time! I told them the stress of my job and the fact we work with over 1000 kids with constant colds is the reason why I've been ill! Plus I had flu and was signed off by my doctor but they just dismissed it. Plus yesterday I found out the head dismissed the manager of the school care takers because she didn't like him! He's a nice guy and works so hard but this woman is so evil! I just can't understand her logic. I think she just sees us as a resource and not humans with lives.\nI'm so sick of this bullying dictatorship and I'm seeing others being treated even worse than me 😢Really wanted to just walk out today and not go back.\nI should also say that this isn't what I really want to do with my life as I'm an artist and I'm getting more and more success and publicity so I know that if I worked somewhere with more flexibility and less hours like temping I could propel my practice. I just need to encouragement and to hear stories from others who may inspire me 😊",
    "title": "Should I quit my stressful job and just temp instead?",
    "subreddit": "jobs",
    "timestamp": 1508444113,
    "score": 10,
    "keyword": "woman artist"
  },
  {
    "text": "When two weeks' notice isn't enough, how do I begin the process of leaving a very small nontraditional company built on tight-knit personal relationships? I work for an artist and his very small company (3 people max) operates by its own very unique rules. I am essentially my boss's right hand woman and handle the maintenance of is studio, online existence, and assist in the art process itself. I have worked for him for three years and am ready to move on. Unfortunately, the position I am in will take some time and training to fill being that the relationship between artist and assistant is very personal/important. Do I notify him at the beginning of my job search and spend that time searching, and eventually training my replacement? What do I do in the event that a great job opportunity should pop up before a replacement has been found? I have all the respect in the world for my boss and want to handle this as professionally as possible despite the lack of traditional company policy. But let's be real... I am in my mid-late twenties and cannot miss the opportunity for better pay and health insurance. Thank you for taking the time to read and appreciate any and all advice!",
    "title": "When two weeks' notice isn't enough, how do I begin the process of leaving a very small nontraditional company built on tight-knit personal relationships?",
    "subreddit": "jobs",
    "timestamp": 1493914718,
    "score": 2,
    "keyword": "woman artist"
  },
  {
    "text": "(Help) Do I hold out for better work conditions or do I gtfo? P.S. my mom is my boss.... I'm a 20 year old woman that lives in an incredibly small town in BC, Canada, and I have been working at the same job for almost two years. It is a receptionist position for my boss who does taxes and bookkeeping, but not just that - we are the local Greyhound (bus) depot; we sell clothes, art and office supplies, and also display and sell art pieces from local artists. And that's not really the worst part.\n\nMy mother is the \"manager\" here and she got me the job.\n\nNow when I started working here it was ok. Gradually it just got worse, with my mother skewing the line between \"boss\" and \"mom\" (if her and I had a fight outside of work she would call me at work to scream at me over the phone, or show up while I was working to try and initiate a screaming match.) It was very unprofessional and stressful.\n\nThe most recent problem I have had would have started a few months ago when my mom, Lana (the boss lady) and I had a \"staff meeting.\" (Also to clarify - my mom and I were the only employees at the time). The meeting was to discuss giving me extra training to prepare for September / October because my mother was going to have surgery and needed 6 weeks off to heal. We were also going to hire another person to help me while my mother was off work.\n\nFlash forward a month later, and we had hired the new person. Except my mother had actually come over to my house after work to inform me that this new employee is going to be getting my training - because I \"simply wasn't ready for it.\" This was decided without talking to me at all. I was pissed but decided to just go along with it.\n\nFlash forward again to September when I am working with the new employee.... and found out they are getting paid more than me to do my exact job PLUS get the training I was promised.... PLUS getting guaranteed full-time hours, WHILE I WAS STILL TRAINING THEM TO DO EVERYTHING ELSE. \n\n(To just add insult to injury, I have never gotten a \"proper\" raise while working here in 2 years, the only time my wage went up was when minimum wage was raised. I'm currently getting paid $11.50 / hr with forced part time hours, and the new employee is getting paid $13.00 / hr, full time, to do my exact freaking job.)\n\nTo wrap it up my mother came back to work recently and I had explained my frustrations I had while she was gone. My boss had me coming in 6 days a week but made me fudge my hours so it looked like it was only 5; she makes me come in every Sunday morning to do greyhound stuff but refuses to pay me the minimum two hours she is supposed to; I was stuck training the new person and helping them while they somehow got the training I was promised. \n\nShe seemed understanding and said that she was going to schedule me to come in for a few extra hours and she was going to give me the training I had asked for, so I was excited! But, lo and behold, she comes to my house yesterday and said that she and Lana had a \"lunch\" and decided I still wasn't \"ready for this training\", that I needed to \"be the best I could be at my current position\".\n\nTheir reasoning as to why I am not ready for this said training is, get this - *the floors weren't clean enough and you didn't do a good enough job sweeping*. \n\nSo in between being underpaid, over worked, belittled and shafted at every turn, I don't know what to do. The reason I have stayed so long is that it's within walking distance from my house, and since this is such a small town there is rarely ever job opportunities. I am too chicken to ask for a raise and I am terrified of being jobless. It doesn't help that my own mother doesn't support me and will sit there and tell me \"you don't deserve shit, you don't do enough.\" Any help / suggestions are greatly appreciated. Sorry for the long post.",
    "title": "(Help) Do I hold out for better work conditions or do I gtfo? P.S. my mom is my boss....",
    "subreddit": "jobs",
    "timestamp": 1509906778,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "I'm 45 and just realised that I am who I am. I look the way I look. And that is ALL THE WAY OK ! Lately I've been reading posts from girls/women strugling and asking advise on how to dress, how to act more business like and how to act more \"grown up\". All of this is something I have been struggling with for decades now.\n\nI'm surrounded by females who daily wear skirts, high heels, perfect hair and make up etc. And every goddam time I open Facebook I'm being bombarded with makeup tutorials by girls who look like greek goddesses even without make up.\n\nI have spent so many years of my life feeling inadequate even though I was lucky enough to have a mother who always reminded me of how beautiful I am. And on top of that, I have a husband who loves me. For me. For my looks. My brain. My humor. But still.....I'm 45 years old so WHY do I still feel like I'm not good enough.\n\nI'm chubby. I have large breasts (an added bonus according to my husband). I fit a L/XL. My hair is all over the place. Compared to my friends and female coworkers I have an eccentric dress sense. I'm always clean, and wear makeup and try my best to look good. I like Converse shoes. Moon boots. Ballerina shoes. Anything made with flower printed fabric. Oversized blouses worn as dresses. Pyjama pants. You get the picture.\n\nBut today, after a shower, I'm standing in front of the mirror doing my makeup. And I began trimming my \"gorilla\" like eyebrows. And it hurt like a mother*****. So I sat down on the toilet and gave myself a VERY STERN talking to.\n\nLook, I'm 45. I'm done with feeling inadequate. And so should all of you guys who have writing stuff like this here! And this is why; Tuesday I had a job interview with this famous photographer/artist. I was wearing my favourite outfit (dark blue multi flowered pyjama pants, gold ballerina shoes and a white oversized chiffon blousy thingy, unruly hair in a bun, and light make-up). When this woman (50+) open the door, she was wearing a bright red Chinese kimono, bare feet, and her hair was all over the place. She was so comfortable with herself that it somehow transcended to me. We sat barefoot in her kitchen and talked art, work, life and whatever else. She was just such an inspiration. Because she new who she was. What she was worth. And couldn't give a rats ass about what other people thought about her appearance. \n\nSo, sitting on my toilet this morning I have decided that who cares if I like to wear pyjama pants with flower print. I will never be one of those high heeled perfect hair office women. And at 45, so what ! \n\nRight now, I guess I feel exactly how my mother felt when she burned her bra !\n\nYoutube makeup girls - keep doing your thing if that makes you happy. \n\nAnd to all you other girls with tummy rolls, big breasts, gorilla eyebrows and no fashion sense what-so-ever! Keep being awesome unicorns. You got this !!! It's not the way you dress that makes you grown up. It's how you act. It took me 45 years to get here. \n\nPS. I got the job :-)",
    "title": "I'm 45 and just realised that I am who I am. I look the way I look. And that is ALL THE WAY OK !",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1504354757,
    "score": 108,
    "keyword": "woman artist"
  },
  {
    "text": "I feel like the average redditor is sexist and sees women as pseudo-human. I've been feeling this way for a while, based on comments, posts, and jokes and how they were received and upvoted. \n\nI'm posting this today after seeing a painting in r/pics of a nature scene with the female artist posing next to her finished work. The comments focus largely on how the woman looks, and many of them are extremely objectifying. \n\nI get that a lot of people are fishing for upvotes and trying to be funny, but I couldn't stop picturing how the comments would be different if the artist had been a man. \n\nDo any women here ever have this same feeling? \n\nI usually don't disclose my gender on reddit because I know the responses I get will leave me extremely frustrated.",
    "title": "I feel like the average redditor is sexist and sees women as pseudo-human.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1503070167,
    "score": 68,
    "keyword": "woman artist"
  },
  {
    "text": "America Ferrera's Fiery Speech at the Women's March on Washington My name is America Ferrera and I am deeply honored to march with you today as the Chair of the Artist’s Table, as a woman and as a proud first generation American born to Honduran immigrants. It’s been a heart wrenching time to be both a woman and an immigrant in this country. Our dignity, our character, our rights have all been under attack and a platform of hate and division assumed power yesterday. But the President is not America. His Cabinet is not America. Congress is not America. We are America. And we are here to stay. We march today for our families and our neighbors. For our future. For the causes we claim and the causes that claim us. We march today for the moral core of this nation. Against which, our new president is waging a war. He would like us to forget the words “Give me your tired, your poor, your huddled masses yearning to breathe free.” And instead take up a credo of hate, fear and suspicion of one another. But we are gathered here and across the country and around the world today to say — \n\nMr. Trump, we refuse. We reject the demonization of our Muslim brothers and sisters. We demand an end to the systemic murder and incarceration to our black brothers and sisters. We will not give up our right to safe and legal abortions. We will not ask our LGBTQ families to go backwards. We will not go from being a nation of immigrants to a nation of ignorance. We will won’t build walls and we won’t see the worst in each other. And we will not turn our backs on the more than 750,000 young immigrants currently protected by DACA. They are hard working, upstanding courageous individuals who refuse to live in the shadow of fear and isolation. They bravely took to the streets to declare themselves and to provide a voice and hope for their community. Today, we march with and for them. Together we, all of us, will fight, resist and oppose every single action that threatens the lives and dignity of any and all of our communities. \n\nMarchers, make no mistake, we are, every single one of us, are under attack. Our safety and freedoms are on the chopping block and we are the only ones who can protect one another. If we do not stand together, march together, fight together for the next four years, then we will lose together. Our opposition knows how to stick together. They are united in their agenda to hold this country back and to thwart progress; it is in their slogan. So we too, must stand united. If we, the millions of Americans who believe in common decency, in a greater good, in justice for all, if we fall into the trap of separating ourselves by our causes and our labels, then we will weaken our fight and we will lose. But, if we commit to what aligns us, if we stand together, steadfast and determined, then we stand a chance of saving the soul of our country. So let’s march together.",
    "title": "America Ferrera's Fiery Speech at the Women's March on Washington",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485015193,
    "score": 40,
    "keyword": "woman artist"
  },
  {
    "text": "Artist defends eyeball tattoo that left Ottawa woman with partial vision loss - Ottawa - CBC News",
    "title": "Artist defends eyeball tattoo that left Ottawa woman with partial vision loss - Ottawa - CBC News",
    "subreddit": "medicine",
    "timestamp": 1506785463,
    "score": 41,
    "keyword": "woman artist"
  },
  {
    "text": "Business Careers for Creatives & Empaths? (ENFP) I feel as though I am shooting myself in the foot by setting my trajectory for a life path in a career that doesn't exist. \n\nAre there any business careers that would be fitting for artistic, empathetic, intuitive, charismatic, high emotional IQ, highly observant, innovative, extroverted, and emotional individuals?\n\nPersonally: \nI am a 24y/o female with an exceptionally established resume in retail, branding, and marketing. I've worked in the video game industry for 9 years (yes) and I am looking to transition to a completely different industry. If I didn't care about being successful, having loads of money to travel, and comfortably living in NYC I would be an illustrator for children's books and a wife. My passion is in the arts but I gave up the practice right before tablets started becoming a thing. (Kicking myself.) Although I was above average in art, I would never make it as an artist. Especially when your immigrant parents kick you out at 15. As a once bullied introvert I forced myself to step into communication-demanding jobs and I have surprisingly excelled to an impressive extent. I can handle jet lag, take on large projects, and philosophical, creative, and theoretical thinking is no thing for me. I might not be able to draw anymore but dare I say I am a visionary with a brain on fire. I want to create beautiful things and share with the world. So I picked up marketing (still earning my degree, paying tuition out of pocket. Sarcastic yay for the pressure put on first gens), managed to settle into NYC (and I got laid off in Dec, so if I don't figure something out quick I'm back to couch surfing.) \n\nIn a nuthsell I'm a once upon-a-time artist who's set her sights for a more left brained career path, but alas, my right brained skills will always be the stronger skill set. I CAN be business savvy if I educate myself but I will never understand numbers. I've learned to tailor my abilities for the business world, I'm an opportunist, I am energetic, I can lead when given the chance, I can figure problems out in unconventional ways. I feel the need to point this out purely for any reader's generous interest to help me out....sorry for how tacky this is going to sound...I'm a very attractive woman. Unconventionally attractive in my opinion (hello adult acne) but my appearance seems to have a significant effect on people when I interact with them. I hate having to describe this! I'm mentioning it because it hasn't worked as an asset for me yet, I don't think. Picture a 5'10, fit, overwhelmingly friendly blonde in a power business suit. Legally Blonde meets actually down to Earth, professional, and even socially awkward when you get to know me personally. I've been turned down and judged for my appearance and have actually had to turn to zero makeup and loose clothing to be taken seriously. I know some of you are rolling your eyes but this is a genuine issue for me. What I'm trying to get at is...does a career exist that would need attractive and highly intelligent people with an intuitive skill and understanding for humanities? A job environment where looks are either irrelevant or a preferred plus? Again, really sorry if I haven't described this in a more modest manner, it bothers me too and is cringey to describe myself in this way. To sum up, I can be presentable on demand and I can fine-tune or adjust my social settings depending on who I am talking to. I know how to talk to luxury-oriented critical types, business men, Type-A's, children, gamers, teens (I was a suicide counsler for a little while for troubled teens) and animals. LOL! I don't know, people! I'm blushing! Sorry! I'm being honest though! (Let me babysit your dog please.) \n\nUpon first impression someone would suggest that I be a spokesperson or a model. Great, I roll my eyes each time, but then after talking to me I'm always told that being a counselor or psychologist is \"my calling.\" Truth be told I am too sensitive for my own good and would never be able to carry the weight of other's trying times without taking it home with me. I become very invested in people I barely know should they signal that they need my help. I have to selfishly say that I cannot imagine helping people for pay and would not want that sort of pressure. Nor do I have the backbone for it.\n\nAfter a lot of research I've landed possible fitting careers for someone like me but its seemingly still kind of a reach:\nBrand Strategist / Director / Ambassador \nCreative Strategist \nMarketing Researcher / Media Planning \n\nI am capable of understanding analytics and utilizing them to solve problems. An example would be an extensive study on a particular target market and getting down and dirty with marketing acquisition. But my real dream is to work with a creative team where I don;t necessarily MAKE the work. Its all up in my head. Ok...if I had to describe my dream job casually it would be one that would enable me to call the shots on creative strategy decisions for a particular campaign, event, design, would demand that I travel and meet with high ranked reps or clients (I love that kind of pressure to represent and perform), would have me work alongside directors, and ultimately would utilize my educated baseline knowledge and experience on how marketing, demographics, trends, and how people generally work either in isolated groups or an entire community as a whole. I'm always expanding my cultural intelligence as well. I've been able to connect exceptionally well with almost all nationalities with a genuine interest in getting to know and respecting their customs.\n\nWhat do you guys think? Am I making the right move by considering something like \"Creative Strategist\" that would perfectly combine my Marketing Degree and natural born ability as an innovator and communicator?  Is there any one else out there with a similar dilemma? \n\nAn artist who can't draw. (Or super behind by art industry standard.) And a strategist who can't do numbers. HA! What dooooooo?????",
    "title": "Business Careers for Creatives & Empaths? (ENFP)",
    "subreddit": "careerguidance",
    "timestamp": 1504726728,
    "score": 5,
    "keyword": "woman artist"
  },
  {
    "text": "Teenage Crisis: What should I do with my life? Hey, guys! I'll try to get to the point, as I hate when others drag on in their writing.\nSo, I'm a 16 yo kid, I'm poor (single parent, low wages) and a minority (although I pass as an American). I used to be one of the really smart kids when I was little (winning awards and stuff) but that's changed over the years. I'm a little less active in school, I feel less smart, find it hard to get motivated and am mostly depressed all the time.\nThat said, I am excited for college. I have a scholarship set up already (basically I get to go to uni for free). I'm excited for uni for several reasons: mostly because I look forward to being free of the hindrances of living with my mom (an elderly, sick woman who I love, but who makes me feel old, too, sometimes) but also because I want to FINALLY be myself and pursue my interests. My aunt (a doctor) tells me I should become a doctor too. She thinks if I work hard enough and get off my ass and pursue the dream, I can achieve it. Other people have straight-up told me I'm dumb and lazy and irresponsible and would make an awful doctor. I've been thinking about healthcare, business, law/politics and construction/agriculture mainly as fields I'm interested in.\nFacts about me\nSmarts: 3.8 gpa, mostly A student (and that's when I'm lazy) but I still feel like I'm dumb, probably because I hate myself. I'm a procrastinator, and that makes me hate myself most of the time and I don't know how to stop.\nPros: I'm artistic, creative, good with my hands, imaginative and good at analyzing literature & interpreting stuff, helping others, reading (i love reading) writing, expressing my thoughts, and -sometimes- teaching.\nCons: I'm lazy (trying to be better, though), depressed, slightly erratic, spontaneous, self-belittling, introverted.\nThings I like: Art, Literature Science (even tho I love it, I suck at it sometimes), History, Politics, Social Sciences, Psychology, Health Science\nThings I suck at/would probably suck at: Math, Physics, Engineering, Finances\nI'm torn between wanting to stay here and pursue a cheaper education which probably guarantees more money and moving out in the future OR leaving as soon as I have my bachelor's degree and studying while working & living on my own. I really, really want to live on my own as I HATE my current living situation. But I'm also open to staying, especially if it means a better situation with work in the future.\nWhat do you think? What should I do? What should I study?",
    "title": "Teenage Crisis: What should I do with my life?",
    "subreddit": "careerguidance",
    "timestamp": 1505965898,
    "score": 2,
    "keyword": "woman artist"
  },
  {
    "text": "Uncomfortable situation in a kindergarten class. Hello! So this literally just happened and I just need to vent. I work as a behavioral therapist primarily in the home but on some ocassions at school. Well, today I was working with a child during art class. The class is lead by the most air headed individual I've ever met. She has no control of the class, is constantly giving these little five year olds assignments they can't do making no effort to include the child I work with who has special needs, and just does dumb shit. The school is a nut free environment, because allergies, and yet the other week she brought a big ass tub of peanut butter to make a bird feeder with. The class freaked out on her about how some kids in class were allergic, I reminded her it's a nut free school and she said she didn't know. \n\nFast forward to today, after a ridiculous collage assignment we have artist of the day time. Now this is usually inappropriate as well, she picks artists, elaborated on their lives and deaths (sometimes including inappropriate information about how one artist tried to kill themselves and the other hated women) and will like have little discussions with the class about how artists died. It's just weird and inappropriate for a bunch of five year olds. Well today she picks an artist, I forgot his name, who basically tended to draw and paint lot of scenes about Boy Scouts and political issues going in. Well, she's flipping through this book showing them pictures and talking about it and then lands on a picture of Ruby being escorted going to school. It's a great painting and I wouldn't mind have had a problem with it if it wasn't for her commentary. \n\nHome girl keeps going on and on and on about how cute it is. Like \"awww look at this little girl going to school. Are those officers? Yeah those are officers taking her to school how lucky is she!\" And she's showing the class and I'm like \"I think that's Ruby Bridges going to the first desegregated school.\" And she says like \"yeah, isn't she so cute? She just looks like she's having so much fun.\" And as she makes her rounds around the class, I realize he n word is written on the wall Ruby is walking in front of. These kids are kindergarteners yes, but they're a year ahead in terms of academics and all know how to read. And it just irked me so, so, so much. She is a white woman, by the way. \n\nLuckily none of the kids tried to pronounce what it was or anything. And while I get it's just a painting she shouldn't have even showed that picture. A book full of paintings by this dude and you chose this Inez she could have used it as an age appropriate lesson on how it was dangerous for her to go to school or something that wasn't as ridiculous as that. I don't think I can like complain to the school about her or anything it's just really really annoying.",
    "title": "Uncomfortable situation in a kindergarten class.",
    "subreddit": "blackladies",
    "timestamp": 1490104480,
    "score": 71,
    "keyword": "woman artist"
  },
  {
    "text": "Is it Eurocentric of me to wonder why a Chinese artist makes sculptures of white women? Okay let me explain\n\n[Here is a pic of the artist and her sculpture](https://i.redd.it/zg8lweixf3oz.jpg)\n\n[She's really good. Here is some more work and background](http://mymodernmet.com/realistic-sculptures-luo-li-rong/)\n\nSome people on a reddit thread were arguing with a white guy who asked this same question. They said that it is his Eurocentric view that makes him assume this sculpture is a white woman.\n\nSo...\n\na) am I being an asshole for even questioning her preference? Because I'm going to fess up right now and say that seeing her next to her sculpture my mind just went straight to self-hate for some reason. And I'm just like, \"woah, I should take a step back. Why'd I go there so fast?\" I mean, it's obvious she has strong European influence, why not leave it at that? \n\nb) me and the white guy diverged because then he started talking about how there are a lot of white anime characters. He had a pic of a \"white\" one and then an \"asian\" and there was hardly a difference, imo. He could easily have claimed the Asian one was white. It was just hair color and bigger eyes that made the difference to him. \n\nc) I don't know that much about art and I can't help but feel like I looked at this in the simplest way possible. \n\nd) It made me realize if I were an artist I don't think I would ever draw/sculpt/paint white people.\n\ne: oh if you are a POC feel free to chime in, not just black ladies",
    "title": "Is it Eurocentric of me to wonder why a Chinese artist makes sculptures of white women?",
    "subreddit": "blackladies",
    "timestamp": 1507658300,
    "score": 35,
    "keyword": "woman artist"
  },
  {
    "text": "Angry Letter I Wrote 2 Years Ago I can’t help but to think the only real reason I can’t seem to get any type of  production artist/ graphic design/ or screen printing position is because I’m a young black female. I usually hate throwing the race card in but I don’t know where else to turn. Never mind the fact that I have the degree required for these companies in the first place. It’s strange how every time I contact these companies when I see that there is a new space open they’re either “too busy” to take a minute to talk to me or the position has been filled. I polish my resume and cover letter well and because my name isn’t ethnic sounding I usually get asked to come in for an interview (Why is that still a thing in 2015?) Professionally dressed and well spoken. Only to keep getting turned down because I’m not the blonde Brittany stereotype that was assumed on paper.\n \nI can’t even seem to get a position at art retail stores. I don’t seem to fit the mostly white male hipster vibe most of them seem to have. When asked how I could contribute to the sales I explained how I do my own illustration and how I can give others that come into the store my own input on supplies and materials. Even left business cards at the end of the interview but I either get told that I’m too over qualified or too under qualified and don’t get the position. Most of the yelp reviews of one art supply store in particular was saying how most the sales associates don’t even know their products at all. \n\nThe summer between my junior and senior year of college I had applied to an AC Moore where the hiring manger was an alumni of the school I was going to and saw how qualified I was but did I get hired nope! I went back a few weeks later to pick up supplies for a watercolor painting I wanted to do and I happened to pick up a sheet of Arches cold press watercolor paper that didn’t have a code bar. The red haired girl ringing me up got confused and to this day that statement still rings in my head as she asked her co-workers “How much is this poster board?” I was done literally just done right then and there. I didn’t get hired but this girl who does not even know the difference between watercolor paper and poster board got hired probably solely on her looks alone.\n\nSame thing goes for all those companies that turned me down. One screen printing place had a manager that told me that he couldn’t hire me because he couldn’t afford to pay me. (But he sure as hell paid for a damn chiropractor the same day he let me go and spent half the day shooting hoops smh). Not all young black people like myself are the way Fox News likes to portray us; most of us have goals and aspirations outside of twerking or being labeled “thugs”\n\nI’m not “right” for those jobs but I sure as hell was qualified to waste seven months of my life working in a burger joint. Not once I did have the energy to even do my illustration pick up a pencil or paintbrush because of that dead end low paying barely making it job. Didn’t learn any new pen and ink styles I wanted to further develop but I was pretty damn good at salting fries all day. I was tired all the time and at 22 to 23 years old I should have all the energy in the world but I didn’t. In fact when my manger let me go he had just hired his brother as a line cook despite him not shaving his Santa beard and working the grill (nasty) must be nice.\n\nSo now I’m back to square one once more trying to hopefully get employed again soon. But right now my main focus is trying to get new artwork done since I spent the past year just kind of drifting because of financial worries. I have lost sight of this is something that I love and it’s not a job it’s me building a career. I still dream of being a children’s book illustrator and I’m not ready to throw in the towel just yet. In fact I want to strive to be the very first African American woman to win the Caldecott Medal. That the type of quality illustration I want to be making and if I ever get to that level they’ll be the ones sorry for overlooking me.",
    "title": "Angry Letter I Wrote 2 Years Ago",
    "subreddit": "blackladies",
    "timestamp": 1498281014,
    "score": 15,
    "keyword": "woman artist"
  },
  {
    "text": "If you’re a man with a camera, you’re automatically branded a creep I used to work semi-professionally as a photographer.  What do I mean by that?  Essentially I was part time.  I had a great job as a software engineer that I liked and didn’t want to give up, but in my off hours I liked switching gears by earning extra dollars via photography.  I specialized in taking photos of the performing arts such as musical artists, plays, circuses, etc.  It was fun.  It was a very different challenge from writing code.  \n\nSo this 16 year-old girl found my web site and liked what I saw.  She needed some quality photos for her school’s yearbook and approached me to take them.  She asked me to take photos appropriate to the yearbook.  Not once did she ever request any nudity or anything else inappropriate.  She had an after school job and enough money to pay my rates.  Everything seemed completely legit.  Of course, I was well aware of the stereotypes that would brand me some kind of sick perv if I photographed a teenage girl.  I therefore turned to other photographers for advice on putting together a contract that would protect me legally.  She wanted a photos of her together with her horse.  There would be photos of her riding it, grooming it, and just standing beside it.  Nothing wrong with that, of course.  I still wanted a contract to protect me legally so that I would not end up falsely accused of any wrongdoing.  A protective instinct kicked in because I knew how hyper-negative people get toward men, especially a man with a camera.  \n\nI asked other photographers on a photography forum online if there were some kind of standard protective contract I could use.  Some photographers responded with good advice on where I could get such a thing.  Some also said I should require at least one parent present at the shoot.  Good advice.  However, others went berserk, accusing me of being some kind of perv out to rape that girl.  One asshole claimed that if it were his daughter he would immediately contact the police and the courts and get a restraining order against me.  He acted like I had proposed to make kiddie porn.  We’re talking about a photo shoot of a fully clothed girl in normal pictures with her horse – feeding it, riding it, normal stuff.  These were photos that were appropriate to a high school yearbook.  \n\nThese male-bashing bigots totally ignored my explanation of the content of the shoot and just assumed I would ask her to take her clothes off and do pervy things and that it would end with me raping her.  No amount of setting the record straight did any good.  It was unreal the hateful assumptions people made.  Some photographers came to my defense, appalled as I was at the overreaction.  Some correctly said that photographers photograph all ages.  Duh.  It totally depends on the content of the photos as to whether it’s appropriate.  It’s unreal how some people heard “fully clothed girl riding a horse” and translated that to “perv raping a teenager.”  \n\nI ended up doing the shoot, no thanks to the male-bashing bigots.  It went great.  I had a liability contract and I had her father present at the shoot.  Great guy, and great girl.  They were awesome people.  Neither of them made any of the absurd assumptions some idiots had made.  This was a case of a young woman who had earned her own money at a job and had chosen to spend it on some high quality photos.  Nothing more.  It’s unreal how some people will twist something like that into something sick.  \n\nOther photographers have told me about similar situations where they’re assumed to be some kind of perv because they have a camera with a telephoto lens.  If you’re a man and you take a high-end camera to a beach, you risk getting pestered and even arrested by police.  That’s a reason why I won’t even do beach photography.  Nowadays, I won’t even photograph someone who’s underage unless I know the people really well.  I was lucky at this shoot that they turned out to be terrific people, but if I had gotten the witch hunt idiots, it could have been dangerous for me.  I’m 100 percent certain if I were a woman, the whole overreaction and branding me as some kind of creep or perv would never have gone down.  “Girl with her horse” – he must be a sicko.  It’s unreal.",
    "title": "If you’re a man with a camera, you’re automatically branded a creep",
    "subreddit": "MensRights",
    "timestamp": 1487540346,
    "score": 70,
    "keyword": "woman artist"
  },
  {
    "text": "Isn't it illegal to refuse service based on gender? (my experience with waxing salons) I'll try to keep this brief:\n\n  I'm an artist and have been subsidizing my income by working as an art model for a few years.  Because of this, I have to take extra steps to be fully groomed.  This involves waxing and shaving.  Because there are certain areas that one can not easily reach on ones body, I decided at one point that I would pay a professional to do certain things for me.\n\nI got turned down by about a dozen (no exaggeration;  It might have been more in fact) salons that refused to provide the service for men.  One woman actually said to me, \"No, we don't do Man-zilians (Brazilians for men).\"  I was basically given the boot by tons of places that said \"women only.\"  Turns out most of these salons don't like to serve men because they think we're all a bunch of perverts coming in for the wrong reasons.  It was near impossible, but I had to get it done.  I spent almost a week and a half looking for a place, and it was getting incredibly embarrassing for me (this was what discrimination actually feels like).  I finally found someone who would provide the service to me. \n\n*side note: She was nice, but what I found ironic was that while she was performing the waxing [we had a lengthy discussion about news], the topic of Rachel Dolezal came up and she said something about how women already have it much harder than men.  I didn't know how to react, given the circumstances*",
    "title": "Isn't it illegal to refuse service based on gender? (my experience with waxing salons)",
    "subreddit": "MensRights",
    "timestamp": 1484823258,
    "score": 59,
    "keyword": "woman artist"
  },
  {
    "text": "Feminist Terrorist Attack Masterpost * [The Bolivian anarcha-feminist collective known as Mujeres Creando gained worldwide fame in 2001 when they \\(armed with dynamite and Molotov Cocktails\\) attacked The Bolivian Banking Supervisory Agency demanding that all debt owed by any woman in the country be removed. When riot police arrived feminist protesters fought against them by throwing Molotov cocktails at police cruisers.](https://en.wikipedia.org/wiki/Mujeres_Creando)\n\n* [In 1982 in Canada a feminist terrorist sect known as The “Wimmin’s Fire Brigade” firebombed a chain of pornographic video rental stores as part of a plan to intimate the Canadian government into changing the laws to outlaw pornography.](https://en.wikipedia.org/wiki/Squamish_Five#Red_Hot_Video_firebombing) \n\n* [The National Encounter of Women is a yearly feminist conference that occurs in South America where close to 20,000 feminists meet for workshops and think tank discussions. The conference is usually marked as well with widespread violence being committed by the feminists who attend. In 2007 the anti-catholic sentiment \\(due to the catholic church being against abortion\\) held by a large number of women there boiled over and the mob of feminists started targeting catholic feminist women at the convention going into to a workshop to physically and sexually assault many of them and force them out of the conference. After the feminists announced their plans to attack a local cathedral police sent riot police to protect the area and the feminist groups instead just attacked and looted several local businesses instead.](http://www.catholicnewsagency.com/news/catholic_women_in_argentina_target_of_attacks_at_national_encounter_of_women/)\n\n* [In 2013 Catholics in San Juan who knew the history of the The National Encounter of Women decided to go to the local cathedral and protect it from being attacked by feminists when the convention was being held their. The 1500 Catholics stood outside the cathedral hands locked in non violence to try and help protect it from the feminists who planned to storm and destroy the church. The 7000 \\(many topless\\) feminist protesters attacked the group of Catholics. Spraying cans of spray paint in their eyes, throwing glass bottles at them, attempting to molest at least several of the men guarding the cathedral along with them committing other practices of violence. Despite this the pacifist Catholics did not fight back even to protect themselves in self defense.](https://www.lifesitenews.com/news/horror-mob-of-topless-pro-abort-feminists-attacks-rosary-praying-men-defend)\n\n* [The Zapatista Army of National Liberation is a Pro-Feminist Paramilitary guerrilla rebel group which has been in a war with Mexico since 1994. The group is so focused on feminist ideas that the first declaration of demands the terrorist group sent to the Mexican government was a document entitled The Women’s Revolutionary Law which was a list of “rights” they demanded all women get, these rights included the right to having preferential health services when they go to clinics and the right to participate in the violent overthrow of the government.\n](https://en.wikipedia.org/wiki/Zapatista_Army_of_National_Liberation)\n\n* [Swedish politician Göran Hägglund despite being a strong supporter of women’s and gay rights was attacked by a member of an LGBT queer anarcho-feminist group due to him “discouraging LGBT rights\". It’s still unclear what exactly Hägglund has done to discourage those rights due to him staunchly supporting the gay community.](https://en.wikipedia.org/wiki/G%C3%B6ran_H%C3%A4gglund#cite_note-2)\n\n* [American Radical Feminist Jane Alpert was responsible over the course of five years for bombing 8 corporate and federal buildings. Whose ranks include Chase Manhattan, The Offices or General Motors and The New York City Police Headquarters. In Alpert’s surrender statement she claimed achieving work in the feminist movement was her major goal for committing these acts of terrorism. And in her Manifesto “Mother Right” she called for others to do the same in order to defeat the patriarchy.](https://en.wikipedia.org/wiki/Jane_Alpert)\n\n* [Feminists sent death threats to Erin Pizzey, the British woman who founded the world’s first Domestic Violence shelter. Because, she said women can be as cruel and violent as men, and then feminists ended up mutilating her pet dog to send a warning to her after she refuses to leave the country.\nBefore this incident Erin Pizzey had previously been involved with the British Women’s Liberation Movement but left the group after overhearing plans for them to commit a terrorist attack on the upscale London women’s fashion store, “Biba.” The group later was responsible for a protest of The Miss World competition where the group attempted to shut down the event by attacking the models with smoke bombs.](https://en.wikipedia.org/wiki/Erin_Pizzey#Overview)\n\n* [University of Delaware professor Suzanne Steinmetz published a study showing evidence that in cases of domestic violence women are just as likely to abuse their husbands as husbands would be to abuse their wives. Feminists responded to this by sending death threats to Steinmetz and her children threatening organizers of speaking engagements that invited her to speak and sending a bomb threat to shut down a speaking engagement she had, forcing her to lose her job.](http://www.ifeminists.net/introduction/editorials/2005/0525roberts.html)\n\n* [After Richard Gelles and Murray Straus of the American Sociological Association simply published a survey showing the rate of male domestic violence victims feminists started a campaign of harassment contacting and threatening anyone they could find even slightly related to either of two and calling in bomb threats to conference centers and buildings where they were scheduled to present.](http://breakingthescience.org/RichardGelles_MissingPersonsOfDV.php)\n\n* [In 2015 Feminist forced the Society of Professional Journalists \\(the oldest journalistic ethics association in the United States\\) annual conference to be evacuated after calling in bomb threats to the police as retaliation against the conference having a panel on Gamergate.](http://www.polygon.com/2015/8/16/9161311/bomb-threat-shuts-down-spj-panel-discussing-gamergate)\n\n* [During the August Revolution in Burkina Faso. The Burkinabe Women’s Liberation Movement along with other Marxist groups helped stage a coup to overthrow the French Colonial Government and then instated Marxist Rebel Thomas Sankara as the country’s new leader. Sankara on behalf of the Burkinabe feminists passed laws making female circumcision illegal along with the passing these women’s rights laws his administration was famous for ushering a new era of human rights abuses in which many of the political opponents of the The Burkinabe Women’s Liberation Movement were either arrested without cause, tortured or executed in illegal extrusions killings.](https://en.wikipedia.org/wiki/Thomas_Sankara_and_the_Burkinabe_Women%27s_Liberation_Movement#Women.E2.80.99s_Liberation_Movement)\n\n* [The Radical Eco-Feminist group Deep Green Resistance which was founded in 2011 and is currently active in 7 countries, The group was founded by a self described feminist warrior and preaches for lone wolf terrorists to attack every part of civilian, from bombing airports to open firing on farmers on country fairs even going as far as to call for rape and assassinations against figures who are opposed to them. The group’s goal is for the destruction of industrial civilization and the return of a matriarchal hunter gatherer lifestyle. Though to give feminists credit several magazines and feminist groups have condoned their actions, not because they preaching for genocide and indiscriminate killings but due to the fact that they do not allow trans women to go to their terrorist training camps.](https://en.wikipedia.org/wiki/Deep_Green_Resistance)\n\n* [A group known as The Women’s Brigade of Weather Underground, whose motto is literally,  \"Build a militant women’s movement that commits itself to the destruction of Amerikkkan imperialism and exploit the man’s chauvinism as a strategic weakness.“ was an ultra-extremist feminist terrorist sect whom was responsible for bombing the Center for International Affairs at Harvard University and The Offices of The Department of Health and Human Services in San Francisco as part of a celebration for National Woman’s Day.](https://en.wikipedia.org/wiki/Women%27s_Brigade_of_Weather_Underground)\n\n* [The violent Feminist power group M.E.K also known as People’s Mujahedin of Iran has been labeled as a terrorist organization by both the United Nations and NATO they are believed to be responsible for several terrorist attacks around Iran which has left dozens dead. The group was founded in 1965 with the stated goal of overthrowing the Iranian Shah but after the Shahs regime ending the group changed significantly going through a point in which they assassinated the President and Prime Minister of Iran in 1981. Eventually in 1985 radical feminist Maryam Rajavi took control of the group and ushered in another wave of terror attacks and shifted the focus of the group to being permanently about pushing feminist agendas, under her rule Rajivi ordered the assassination of several high level government officials in various countries and organized a bombing campaign targeting civilians.  In 2005, Human Rights Watch issued a report describing prison camps within run by the M.E.K in which people kidnapped by the terrorist group were held captive tortured and raped. Maryam Rajavi still leads the group today and has been praised by the international feminist community for her work on behalf of women being honored by both the Feminist Peace Network and globally recognized Feminist Professor Donna M. Hughes and even being invited to give a speech as the keynote speaker for the International Woman’s Day celebration in France. In 2015 M.E.K was also believed to be responsible for a string of murders targeting Iranian scientists and educators.](https://en.wikipedia.org/wiki/People%27s_Mujahedin_of_Iran)\n\n* [Cumann na mBan was an all female feminist paramilitary organisation, that during the Easter Rising sent 200 armed women across Dublin to help Irish-Nationalists seize major locations around the city. During the armed rebellion one of these women Constance Markievicz a British Suffragist famously took over a post office along with several other female fighters and used the building to set up a sniper nest where they carried out sniper attacks on British troops and succeeded in murdering at least 3 police officers and several more soldiers. Within 5 days the feminist group along with their allies in the IRA had succeeded in killing 132 British soldiers and local police officers along with killing at least 254 other civilians. Dozens of Irish rebel forces groups were part of the attack during the Easter Rising but historians agree Cumann na mBan was the most violent and influential of these groups with the women in it making up a fifth of the Irish rebels at the time.](https://en.wikipedia.org/wiki/Cumann_na_mBan)\n\n\n* [The Women’s Social and Political Union was one of the most famous and influential feminist groups in the history of the United Kingdom. Along with this they happened to be one of the most militant and violent committing almost nightly arson attacks on random churches, businesses and private homes regardless of the owners view on feminism. The group also attempted to burn down Chancellor David Lloyd George’s home, cut public telephone wires, sent letter bombs to various politicians and businesses, destroyed the Kew Garden greenhouses which held the world’s single largest collection of living plants and is now a United Nations World Heritage site. Tried to rush the house of commons. And attempted to assassinate British Prime Minister Herbert Henry Asquith. On top of this the majority of the violence perpetrated by the group wasn’t even at people who were against feminism.](https://en.wikipedia.org/wiki/Women%27s_Social_and_Political_Union) \n\n* [Rote Zora was a militant feminist group from Germany who used guerrilla warfare tactics to terrorize west Germany by bombing over 45 buildings from 1977 to 1995. The group targeted people, businesses and groups whom they thought exploited women such as sex shops, makeup companies and The Federal Constitutional Court of Germany.](https://en.wikipedia.org/wiki/Rote_Zora)\n\n* [Mary Richardson a Canadian feminist \\(who would later lead women’s section of the Nazi Sympathizer group known as The British Union of Fascists\\) entered the National Gallery in London and used a meat clever to slash The Rokeby Venus a 450 year old painting created by Diego Velázquez who is one of the most famous Spanish artists in history. She was quoted as giving the reason for her doing this as a protest of the government trying to prosecute the feminist terrorist Emmeline Pankhurst for her crimes against the public. Along with this famous attack Mary Richardson also committed numerous other acts of arson and vandalism along with bombing a railway station in the name of feminism.](https://en.wikipedia.org/wiki/Mary_Richardson)\n\n* [In 2015 in the city of Odessa a large group of Ukrainian citizens worried about the growing Totalitarian state of their country organized a protest against Fascism to show their opposition for the way their country was changing. In response to this protest a large group of Maidan Fascists and Neo-Nazis planned to meet the anti-protesters and silence them. Among these Neo-Nazis and openly Fascist supporting extremists was Femen leader Levgeniia Kraizman who took pictures of herself wearing a FEMEN tee shirt and marching with the Neo-Nazis as she posed in front of burning cars in which the Fascists had overturned to intimidate the protesters. After the anti-fascists refused to leave the Neo-Nazis and Fascists along with Kraizman and other feminists and Femen members invited to the pro-fascist Nazi rally began attacking the anti-fascist protesters. Police were unable to stop the violence. The Neo-Nazis and Fascist who were much better armed took no time to begin killing the anti-fascist protesters, open firing and beating as many to death as they could find along with burning alive anyone they could catch. Further clashes in Ukraine between the groups outside of this one incident in the later weeks left 48 dead, 247 injured \\(27 shot, 31 stabbed\\) and 99 hospitalized and 123 arrested.](https://www.indybay.org/newsitems/2014/05/19/18755970.php?show_comments=1)",
    "title": "Feminist Terrorist Attack Masterpost",
    "subreddit": "MensRights",
    "timestamp": 1489004208,
    "score": 14,
    "keyword": "woman artist"
  },
  {
    "text": "For your information - a note about Linda Nochlin's \"Why Have There Been No Great Women Artists?\" If you haven't yet heard, the feminist Art Historian Linda Nochlin passed away earlier.\n\nIf you haven't yet heard of her, you likely will over the next few days or so.\n\nSpecifically, you will probably hear - and see - the following quote from the 1971 essay 'Why Have There Been No Great Women Artists?' that made her name and reputation:\n\n> If, as John Stuart Mill suggested, we tend to accept whatever *is* as natural, this is just as true in the realm of academic investigation as it is in our social arrangements. In the former, too, “natural” assumptions must be questioned and the mythic basis of much so-called “fact” brought to light. And it is here that the very position of woman as an acknowledged outsider, the maverick “she” instead of the presumably neutral “one”—in reality the white-male-position-accepted-as-natural, or the hidden “he” as the subject of all scholarly predicates—is a decided advantage, rather than merely a hindrance of a subjective distortion.\n\n> In the field of art history, the white Western male viewpoint, unconsciously accepted as the viewpoint of the art historian, may—and does—prove to be inadequate not merely on moral and ethical grounds, or because it is elitist, but on purely intellectual ones. \n\nHowever, you are very, *very* unlikely to see some of her other comments made in the same essay - precisely because to many modern feminists nowadays it would be a practical heresy:\n\n> The fact of the matter is that there have been no supremely great women artists, as far as we know, although there have been many interesting and very good ones who remain insufficiently investigated or appreciated; nor have there been any great Lithuanian jazz pianists, nor Eskimo tennis players, no matter how much we might wish there had been. That this should be the case is regrettable, but no amount of manipulating the historical or critical evidence will alter the situation; nor will accusations of male-chauvinist distortion of history. The fact, dear sisters, is that there are no women equivalents for Michelangelo or Rembrandt, Delacroix or Cézanne, Picasso or Matisse, or even, in very recent times, for de Kooning or Warhol, any more than there are Black American equivalents for the same. If there actually were large numbers of “hidden” great women artists, or if there really should be different standards for women’s art as opposed to men’s—and one can’t have it both ways—then what are the feminists fighting for? If women have in fact achieved the same status as men in the arts, then the status quo is fine as it is.\n\n[ ... ]\n\n> Now the “Woman Problem,” like all human problems, so-called (and the very idea of calling anything to do with human beings a “problem” is, of course, a fairly recent one) is not amenable to “solution” at all, since what human problems involve is re-interpretation of the nature of the situation, or a radical alteration of stance or program on the part of the “problems” themselves. Thus women and their situation in the arts, as in other realms of endeavor, are not a “problem” to be viewed through the eyes of the dominant male power elite. Instead, women must conceive of themselves as potentially, if not actually, equal subjects, and must be willing to look the facts of their situation full in the face, without self-pity, or cop-outs; at the same time they must view their situation with that high degree of emotional and intellectual commitment necessary to create a world in which equal achievement will be not only made possible but actively encouraged by social institutions.\n\nI find it interesting that she is likely to be lauded as \"groundbreaking\" or \"pioneering\" as a feminist and celebrated by people who - if they actually cared to read the essay they are celebrating, would determine to dig up her corpse for the purpose of defiling it.\n\nI'd say it's worth your while to read the whole thing (archived [here](http://archive.is/F4eFQ#selection-629.0-637.429))\n\nEspecially the parts below:\n\n> “Why have there been no great women artists?” The question tolls reproachfully in the background of most discussions of the so-called woman problem [ ... ] The feminist’s first reaction is to swallow the bait, hook, line and sinker, and to attempt to answer the question as it is put: i.e., to dig up examples of worthy or insufficiently appreciated women artists throughout history; to rehabilitate rather modest, if interesting and productive careers; to “re-discover” forgotten flower-painters or David-followers and make out a case for them ...\n\n> Another attempt to answer the question involves shifting the ground slightly and asserting, as some contemporary feminists do, that there is a different kind of “greatness” for women’s art than for men’s [ ... ] No subtle essence of femininity would seem to link the work of [other women artists;] women artists and writers would seem to be closer to other artists and writers of their own period and outlook than they are to each other.\n\n> Women artists are more inward-looking, more delicate and nuanced in their treatment of their medium, it may be asserted. But which of the women artists cited above is more inward-turning than Redon, more subtle and nuanced in the handling of pigment than Corot? Is Fragonard more or less feminine than Mme. Vigée-Lebrun? \n\n**TL;DR** Feminist art historian has passed away aged 86; You're likely to see or hear a lot about her in the press and on social media in the form of inspirational quote, moody looking memes & etc. but I reckon 99% of people sharing her story won't have a clue what she actually wrote and would be quite appalled if they actually did e.g. she wrote that: \"The fact of the matter is that there have been no supremely great women artists, as far as we know, although there have been many interesting and very good ones [ ...] no amount of manipulating the historical or critical evidence will alter the situation; nor will accusations of male-chauvinist distortion of history. The fact, dear sisters, is that there are no women equivalents for Michelangelo or Rembrandt, Delacroix or Cézanne, Picasso or Matisse ...\"",
    "title": "For your information - a note about Linda Nochlin's \"Why Have There Been No Great Women Artists?\"",
    "subreddit": "MensRights",
    "timestamp": 1509400586,
    "score": 10,
    "keyword": "woman artist"
  },
  {
    "text": "The disposability of men: \"Long Black Veil\", the ultimate White Knight anthem **\"She stood in the crowd and shed not a tear\"**\n\nI'm a working musician and the band leader is going to do Long Black Veil so I need to learn it. It's covered by every male roots artist at some point in their career. [Johnny Cash](https://www.youtube.com/watch?v=5pYA46dyKh4), [Mick Jagger](https://www.youtube.com/watch?v=4F-4rY4g4Do), [The Black Crowes](https://www.youtube.com/watch?v=IvwlMoeqURk) ... you get the idea.\n\nIt's an homage to male disposability. The core idea: a woman's honor is worth dying for. Literally, a man's life is equal in value to a woman's reputation.\n\n**Lyrics**\n\n    Ten years ago, on a cold dark night\n    Someone was killed, 'neath the town hall light\n    There were few at the scene, but they all agreed\n    That the man who ran, looked a lot like me\n    \n    The judge said son, what is your alibi\n    If you were somewhere else, then you won't have to die\n    I spoke not a word, thou it meant my life\n    For I'd been in the arms of my best friend's wife\n    \n    She walks these hills in a long black veil\n    She visits my grave when the night winds wail\n    Nobody knows, nobody sees\n    Nobody knows but me\n    \n    Oh, the scaffold is high and eternity's near\n    She stood in the crowd and shed not a tear\n    But late at night, when the north wind blows\n    In a long black veil, she cries ov're my bones\n\n    She walks these hills in a long black veil\n    She visits my grave when the night winds wail\n    Nobody knows, nobody sees\n    Nobody knows but me\n\nhttps://en.wikipedia.org/wiki/Long_Black_Veil",
    "title": "The disposability of men: \"Long Black Veil\", the ultimate White Knight anthem",
    "subreddit": "MensRights",
    "timestamp": 1498856967,
    "score": 4,
    "keyword": "woman artist"
  },
  {
    "text": "Woman Excerpt from *All Things Considered* by G.K. Chesterton, Chapter 12:\n\n>\"Would not our women be spared the drudgery of cooking and all its attendant worries, leaving them free for higher culture?\" The first thing that occurs to me to say about this is very simple, and is, I imagine, a part of all our experience. If my correspondent can find any way of preventing women from worrying, he will indeed be a remarkable man. I think the matter is a much deeper one. First of all, my correspondent overlooks a distinction which is elementary in our human nature. Theoretically, I suppose, every one would like to be freed from worries. But nobody in the world would always like to be freed from worrying occupations. I should very much like (as far as my feelings at the moment go) to be free from the consuming nuisance of writing this article. But it does not follow that I should like to be free from the consuming nuisance of being a journalist. **Because we are worried about a thing, it does not follow that we are not interested in it. The truth is the other way. If we are not interested, why on earth should we be worried? Women are worried about housekeeping, but those that are most interested are the most worried.** Women are still more worried about their husbands and their children. And I suppose if we strangled the children and poleaxed the husbands it would leave women free for higher culture. That is, it would leave them free to begin to worry about that. For women would worry about higher culture as much as they worry about everything else.\n>\n>I believe this way of talking about women and their higher culture is almost entirely a growth of the classes which (unlike the journalistic class to which I belong) have always a reasonable amount of money. One odd thing I specially notice. Those who write like this seem entirely to forget the existence of the working and wage-earning classes. **They say eternally, like my correspondent, that the ordinary woman is always a drudge. And what, in the name of the Nine Gods, is the ordinary man? These people seem to think that the ordinary man is a Cabinet Minister. They are always talking about man going forth to wield power, to carve his own way, to stamp his individuality on the world, to command and to be obeyed. This may be true of a certain class. Dukes, perhaps, are not drudges; but, then, neither are Duchesses.** The Ladies and Gentlemen of the Smart Set are quite free for the higher culture, which consists chiefly of motoring and Bridge. But the ordinary man who typifies and constitutes the millions that make up our civilisation is no more free for the higher culture than his wife is.\n>\n>Indeed, he is not so free. **Of the two sexes the woman is in the more powerful position. For the average woman is at the head of something with which she can do as she likes; the average man has to obey orders and do nothing else.** He has to put one dull brick on another dull brick, and do nothing else; he has to add one dull figure to another dull figure, and do nothing else. The woman's world is a small one, perhaps, but she can alter it. **The woman can tell the tradesman with whom she deals some realistic things about himself. The clerk who does this to the manager generally gets the sack, or shall we say (to avoid the vulgarism), finds himself free for higher culture.** Above all, as I said in my previous article, the woman does work which is in some small degree creative and individual. She can put the flowers or the furniture in fancy arrangements of her own. I fear the bricklayer cannot put the bricks in fancy arrangements of his own, without disaster to himself and others. If the woman is only putting a patch into a carpet, she can choose the thing with regard to colour. I fear it would not do for the office boy dispatching a parcel to choose his stamps with a view to colour; to prefer the tender mauve of the sixpenny to the crude scarlet of the penny stamp. A woman cooking may not always cook artistically; still she can cook artistically. She can introduce a personal and imperceptible alteration into the composition of a soup. The clerk is not encouraged to introduce a personal and imperceptible alteration into the figures in a ledger.\n\n--------------------------------------------------\n\nNote that I have my disagreements with Chesterton (he was talking about me in *The Song of the Strange Ascetic*); he was fundamentally conservative while I am fundamentally liberal, but he was forthright about his views, held them honestly, and changed them when he felt it necessary.\n\nI would much rather be friends with someone like that with whom I disagree with than someone who agrees with me perfectly, but is dishonest, manipulative and closed-minded.\n\nYou don't have to agree with me, just don't try to bullshit me :)",
    "title": "Woman",
    "subreddit": "MensRights",
    "timestamp": 1512315306,
    "score": 4,
    "keyword": "woman artist"
  },
  {
    "text": "For Women's Day I Made a List of Badass Women Who Impacted History. **Interview with Mae Jemison - First Black Lady In Space:**\nhttp://www.makers.com/mae-jemison\n\n\n**Draw My Life Video about Ada Lovelace:**\nhttps://www.youtube.com/watch?v=FQ7FcNWBc20\n\n\n**List of Women Who Worked at Bletchley Park:**\nhttp://www.bletchleyparkresearch.co.uk/research-notes/women-codebreakers/\n\n\n**Mary Shelley's Biography:**\nhttps://www.youtube.com/watch?v=E4p96vqI3zA\n\n\n**Drunk History of Marsha P. Johnson** \nhttp://www.cc.com/video-clips/98p5r3/drunk-history-marsha-p--johnson-sparks-the-stonewall-riots\n\n\n**Carol Shaw - First Female Game Developer for Atari**\nhttp://www.vintagecomputing.com/index.php/archives/800\n\n\n**Female Fighters of Kurdistan:**\nhttps://www.vice.com/en_us/article/female-fighters-of-kurdistan-part-1\n\n\n**Mujeres Libres** \nhttp://flag.blackened.net/revolt/ws98/ws54_mujeres_libres.html\n\n\n**Sojourner Truth - Wrote \"Ain’t I A Woman\"**\nHer speech: \nhttp://www.sojournertruth.org/Library/Speeches/AintIAWoman.htm\nCartoon about her: \nhttps://www.youtube.com/watch?v=TrVek_dWsmg\n\n\n**Barbara Hepworth - British Sculptor:** \nThere is also a lot about women in art on this page.\nhttps://www.khanacademy.org/partner-content/tate/women-in-art/women-as-artists/v/barbara-hepworth \n\n\n**Eartha Kitt on Compromise:**\nhttps://www.youtube.com/watch?v=IGYwf7e_cr8\nMore about Eratha: \nhttp://earthakitt.com/eartha/\n\n\n**Dame Helen Mirren Fighting Sexism Way Back** \nhttps://www.youtube.com/watch?v=5VuvyItN3es\n\nMore on Dame Helen Mirren: \nhttp://www.marieclaire.com/celebrity/news/a21481/helen-mirren-makers-video-exclusive/\n\n\n**Rupi Kaur - Author of Milk and Honey:**\nhttps://www.youtube.com/watch?v=RlToQQfSlLA\n\n\n**Ana Navarro - Republican News Reporter:**\nAna Navarro has spoken out about Trump and Racism many times.\nhttp://www.cnn.com/videos/tv/2017/01/29/navarro-republican-consciousness-cnntv.cnn\n\nArticle about her: \nhttp://www.newyorker.com/culture/persons-of-interest/ana-navarro-and-the-p-word \n \n\n**Emma Watson** \nhttps://www.theguardian.com/film/2017/mar/05/emma-watson-vanity-fair-cover-feminism\n\n\n\n\n\n\nNote: This list is not an exhaustive list, just women I personally admire and wanted to share with you all. A lot of the women in my list work in technology as that is what I love, but please add more women we should know about in the comments!",
    "title": "For Women's Day I Made a List of Badass Women Who Impacted History.",
    "subreddit": "Feminism",
    "timestamp": 1489012308,
    "score": 15,
    "keyword": "woman artist"
  },
  {
    "text": "Music artists that bring out your most powerful inner woman here: I'll start: Sinead Oconnnor",
    "title": "Music artists that bring out your most powerful inner woman here:",
    "subreddit": "Feminism",
    "timestamp": 1483844877,
    "score": 1,
    "keyword": "woman artist"
  }
]