[
  {
    "text": "Which we’ll known woman artist has the sexiest short hair cut?",
    "title": "Which we’ll known woman artist has the sexiest short hair cut?",
    "subreddit": "AskReddit",
    "timestamp": 1567320906,
    "score": 2,
    "keyword": "woman artist"
  },
  {
    "text": "Tattoo artists of Reddit, do you smell a woman’s pussy odor when doing tattoos down town?",
    "title": "Tattoo artists of Reddit, do you smell a woman’s pussy odor when doing tattoos down town?",
    "subreddit": "AskReddit",
    "timestamp": 1572280898,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "Jet crashed and like the show Lost you survive, you and 5 other people. 1 is a black man, 1 is a woman, 1 is a comedian, 1 is a genius, and last but not least 1 is an artist. You've the power to assign who they are... what's your list?",
    "title": "Jet crashed and like the show Lost you survive, you and 5 other people. 1 is a black man, 1 is a woman, 1 is a comedian, 1 is a genius, and last but not least 1 is an artist. You've the power to assign who they are... what's your list?",
    "subreddit": "AskReddit",
    "timestamp": 1564652058,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "Cosplay is NOT Consent I am going to share my story of a brief sexual assault that was so bold it was almost mind blowing.\nI have been attending the same Wizard World Comic-Con with my boyfriend for 5 years. I have cosplayed for 4 of them, and have only had a problem on this one day. I understand that some people don't get the idea of cosplay, but I enjoy dressing in costumes and I enjoy making my costumes. Overall, I love cosplay! If a woman feels comfortable wearing a certain clothes, then she has that right and shouldnt be treated poorly or taken advantage of because if it.\nSo this last year I dressed as Poison Ivy, I worked for over a month on the costume sewing each little ivy leaf to the bathing suit. \nIt started off like any normal day at the convention. My boyfriend was walking beside me and people would stop and ask for pictures with me and I obliged. As the day went on my feet started hurting (because heels suck) and my boyfriend started walking a bit ahead of me, without realizing it. First incident was I felt a hand brush my thigh as I walked through a sea of people, at first I thought it was nothing but my gut told me something was off. So I told my boyfriend and an artist at the booth confirmed that it was definitely an intentional grab, having witnessed it. By the time I processed what had happened the guy was long gone though. We were able to get a discription from the artist at the booth we were near that saw the whole thing.\nWe kept an eye out but went on with our day and soon forgot about it. Then as we were in the entrance hall getting ready to leave I saw something out of the corner of my eye and began to turn around. As I did I felt someone grab at my ass and barely caught a glimpse of him standing upright and trying to walk away. \nWALK!\nLike he didn't just violate someone!\nAll I could do in the moment was shout \"HEY YOU FUCKER! THAT'S NOT OKAY!!\" At the top of my lungs. The room went quiet for a moment and he started running. A guy checking wrist bands, employed by wizard world tried to stop him, but they are usually older individuals. My boyfriend took off after him, but came back empty handed, and security was called. They asked me to please press charges if they found the guy and I agreed. One female security guard asked me to describe him, and I tried but my mind was a mess in the moment. \"You don't know what he looked like? And he touched you earlier?\" She asked, and I could hear the judgement in her voice. I did my best to reply, but I bit back at her with \"I didn't realize what happened until he was long gone, and I never got a good look at him.\" The building's security guard refused to go through security footage to find the guy though, and that was it. We never found him. The one female security guard was a bit harsh and not very sympathetic. The other cosplayers saw what he was doing, but said nothing. That being said, some did sit with me while I cried and security and my bf looked for the guy. Overall Wizard world security was great and I do believe they did everything they could to find him, even having people looking for him the next day.\nWhen I happened, initially I was angry that it happened and then I was angry and I felt violated. I almost felt ashamed if myself for some reason. I could hear my heart beating in my ears, and I cried, and I was freezing all of the sudden.  Then, after talking to the wonderful security guards of wizard world and having my boyfriend back with me I was at peace with myself and what happened (kind of).\nWe went back to the hotel and my boyfriend said we are never coming back to this comic Con and asked me to not cosplay the next two days. My reply was, \"I refuse to let that needle dick control my life in anyway. Security did what they could, there was no way they we're going to find him. I am wearing this costume that I worked hard on again tomorrow, because that is my choice and I'm not letting him or anyone else scare me into giving up something I enjoy.\" My boyfriend understood and was behind it 100%.\nI guess I'm sharing this because I think it is important to report sexual assault even if nothing comes of it, and it's important to not let it define you. To me, that gave the creep all the power and I wasn't about that. Also I wasn't to spread awareness that just because someone cosplays it does not mean you can take pics without consent or touch without consent. My clothing is not consent, the word \"yes.\" That is true with everything. Sexual harrasment and assault is a huge problem for cosplayers, both men and women.\nShout out to Wizard World security though, because they did their best and they really did make me feel safe and for the most part were very sympathetic.\n\nTLDR: Dressed as poison ivy for a Comic-Con and some guy touched me without consent. Security tried to find him but couldn't. I decided to say \"Fuck that needle dick.\" And went dressed as poison ivy again because worked hella hard on that costume.",
    "title": "Cosplay is NOT Consent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548116562,
    "score": 154,
    "keyword": "woman artist"
  },
  {
    "text": "\"You said you work alone - I DON'T APPRECIATE BEING LIED TO!!\" i work in a small print studio. i screenprint shirts and totebags for local businesses and bands and things. i operate on an appointment only schedule because i'm working alone and if someone walks in while i'm printing i can't exactly stop and help them with whatever (usually stupid) question they have. i have a woman who helps me a couple hours a week; reclaiming screens, folding shirts, general shop assistant work. she gets to print her stuff here for free after hours - as do a couple other artist friends.\n\nlast friday, as i'm eating dinner between printing, a man comes in - without an appointment - and walks right behind the counter. leans over my food and starts trying to look at my emails and price lists, etc. i redirect him back to the customer area and we start to discuss a shirt he's brought with him. he wants to add a custom label to his cheap-as-fuck shirt so i explain that printing on the inside of a very thin shirt would show through to the back. he asks why no one else has warned him about this and i explain that because i run this studio by myself, i do sales and the printing, i'm going to know the ins and outs a little better than the uninitiated sales staff at a larger print shop. he seems excited about this. he asks if he could come in and watch me work. maybe assist me? i kind of laugh it off and change the subject.\n\nafter far too long, my dinner is cold and i ask him to leave the shirt, email his artwork and i'll get back to him. we don't print single shirts but if i have time next week i'll do a test for you and see if it bleeds through. i have a spot removal gun that will allow me to remove the print if it does bleed through. he says, \"let's do it now!\" and i explain i'm eating... it's hours of prep... i have other orders to print... etc.\n\nhe comes behind the counter again with his hard drive. i'm so shocked by his brazenness i don't fight it and drag a file from his hard drive to mine and he leaves.\n\nmonday comes, i print go to print out his label artwork and i realize when i dragged the files i only grabbed the SMALL.\n\ni send him an email that says,   \n*\"The shirt you dropped off is LARGE but I only saved the SMALL label - can you send the others?\"*\n\nhe does but the letters are very small. like, less than a pixel wide for some of the fonts. i try to shoot the screen 3 times - it keeps blowing out. i eventually get one that works and print it but the text is so small that the ink can barely get through the screen so the print isn't great. i email him to tell him this - ask him to thicken the lines, resend it and i'll try again. i can't do another free sample so i'll get an invoice going once i've got the new art.\n\nthe next morning i come into the studio and the woman who assists me says, \"some guy came in and took that shirt while i was printing some stuff here last night.\" she's kind of shook. he came in late at night and we work in an industrial area that doesn't see much action after dark and, again, we work on appointment only.\n\ni go to the computer to email him and remind him our policies when i see he's already emailed me.  \n*\"HOW FUCKING STUPID CAN YOU BE?!?!?! I GIVE YOU AN XL SHIRT AND YOU PUT A LARGE LABEL ON IT LIKE AN IDIOT! What gives you the right to destroy my brand? You too stupid to understand sizing?! THE LABEL LOOKS LIKE SHIT YOU MORON!!!! I can't believe you just ruined my shirt. YOU'RE A LIAR AND AN IDIOT! You said you work alone - I DON'T APPRECIATE BEING LIED TO!! i don't know why your fucking stupid brain thought I wasn't going to pay you! It's called quoting and invoicing - look it up on google.\"*\n\ni am so livid and fucking freaked out at this point. who has that kind of reaction? why did he want me to be there alone? who told him to pick up the shirt before i had a chance to fix it? also, i labelled the shirt correctly. i responded to his email with a forward of the previous email about the shirt size, increased the font to 300px, attached a photo of the LARGE tag that i removed from the shirt and blocked his email.\n\ni see a notification light on my spam folder later in the day, he's emailed back:  \n*\"I guess I grabbed the wrong shirt. So sorry.\"*\n\ni push DELETE FOREVER.",
    "title": "\"You said you work alone - I DON'T APPRECIATE BEING LIED TO!!\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1574275027,
    "score": 118,
    "keyword": "woman artist"
  },
  {
    "text": "Update:I(22f) am jealous of my best friend (22f) and I think I just ruined our friendship So I posted this [https://www.reddit.com/r/TwoXChromosomes/comments/d578qx/i22f\\_am\\_jealous\\_of\\_my\\_best\\_friend\\_22f\\_and\\_i\\_think/](https://www.reddit.com/r/TwoXChromosomes/comments/d578qx/i22f_am_jealous_of_my_best_friend_22f_and_i_think/) the other day and I figured I would give an update because I talked to her.\n\n&#x200B;\n\nSo I got together with her this weekend for a girls night in. She knows I have been going through some stuff and she reached out to me. \n\n&#x200B;\n\nWe got together watched movies played video games ate pizza and stuff and we talked, and cried, and hugged. I told her about how I felt around her and she cried and hugged me and I cried too. She told me she never wanted me to feel that way and that I didn't have to look like her to be beautiful. She used to be a model and she said this is one of the reasons she stopped. She didn't like being the standard other women were expected to look like and she didn't like her image making other women feel bad about themselves. She said she hated that she was doing that to me. I told her it wasn't her fault at all. It was mine. We talked about the girl in high school she stood up for, she said she told her that her worth and value didn't come from the attention of men. She told her she wasn't flattered or empowered to top their list. She said she wanted me to know the same thing. My value doesn't come from the male gaze. \n\n&#x200B;\n\nWe talked a lot about what she loved about me. Since you guys made a point of me not complimenting myself in the last post I'll list some of the things she said. She said I was smart and funny and a talented artist, that I was insightful and caring. She reminded me I was the first friend she made when she moved to our state. Her mom had abandoned her and she was lonely and sad I was the first person to be nice to her and be her friend. I stood up for her when my friends didn't want to include her. She said shes never forgotten the kindness I showed her when she first moved here. She reminded me that in middle school she wasn't the prettiest girl either she hadn't yet grown into the drop dead gorgeous bombshell she is now. Sort of ugly duckling thing She grew into a beautiful swan so she remembers what its like to feel bad about yourself and she doesn't want me to feel that way. We talked about a lot. \n\n&#x200B;\n\nA few things that really stuck in my mind though, She said being pretty isn't always wonderful. Yes she acknowledges that there is a certain privilege that comes with it but theres another edge to the sword. She said she is never taken seriously She said being pretty is the only value people believe she has at first. She is always having to prove all the time she is more then a pretty face and hot body. For all the attention she gets from men she never knows when a man is actually interested in her or her body. She never knows if a man really likes her or just sees her as a hot chick to conquer. This is definitely not a problem I have...She also says that while it may seem great to have men interested all the time its not. She cant go to the gym or get a cup of coffee without getting approached by men that it gets tiresome and frustrating. I thought back to when she said she was never taken seriously and I started to cry when I realized even her best friend rolls her eyes and disregards her complaints about always being the center of unwanted attention. She also said I had things she wished she had like a good relationship with her mother...or just a decent human being for a mother. \n\n&#x200B;\n\nWe talked about a lot of stuff she wanted to know what she could do to help me when I was feeling this way, and to be honest with her about when I was feeling overshadowed or not as good and that she wanted to help build me up. She said if I wanted she would take me to the gym as her guest and she would work with me about getting into shape. She reminded me that she is an only child and I am her sister and she loved me.  \n\n&#x200B;\n\nMy best friend is a sweet kind hearted and loving woman. She suffered a lot through her childhood and I really didn't deserve her kindness after how I treated her. I love her to death.",
    "title": "Update:I(22f) am jealous of my best friend (22f) and I think I just ruined our friendship",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1569162324,
    "score": 39,
    "keyword": "woman artist"
  },
  {
    "text": "Sayragul Sauytbay's firsthand testimony about what happens to women in China's camps is heartbreaking I already knew that China's \"re-education\" camps were like prisons intended to strip the ethnic minorities of their identities, but had no idea how bad it was until I read [this](https://www.haaretz.com/world-news/.premium.MAGAZINE-a-million-people-are-jailed-at-china-s-gulags-i-escaped-here-s-what-goes-on-inside-1.7994216) article.\n\nMore awareness needs to be brought about such injustice, people need to pressure their leaders so that countries put more pressure on China to stop these atrocities.\n\n&#x200B;\n\nFor the triumph of evil, good people just need to stay silent.\n\n&#x200B;\n\nThe article is so much worth reading it for yourself, but here are some of the excerpts that just made my heart sink:\n\n&#x200B;\n\n>Sauytbay estimates that there were about 2,500 inmates in the camp. The  oldest person she met was a woman of 84; the youngest, a boy of 13.  “There were schoolchildren and workers, businessmen and writers, nurses  and doctors, artists and simple peasants who had never been to the  city.”\n\n&#x200B;\n\n>“I will give you an example. There was an old  woman in the camp who had been a shepherd before she was arrested. She  was taken to the camp because she was accused of speaking with someone  from abroad by phone. This was a woman who not only did not have a  phone, she didn’t even know how to use one. On the page of sins the  inmates were forced to fill out, she wrote that the call she had been  accused of making never took place. In response she was immediately  punished. I saw her when she returned. She was covered with blood, she  had no fingernails and her skin was flayed.”  \n>  \n>On one occasion, Sauytbay  herself was punished. “One night, about 70 new prisoners were brought to  the camp,” she recalls. “One of them was an elderly Kazakh woman who  hadn’t even had time to take her shoes. She spotted me as being Kazakh  and asked for my help. She begged me to get her out of there and she  embraced me. I did not reciprocate her embrace, but I was punished  anyway. I was beaten and deprived of food for two days.”\n\n&#x200B;\n\n>“The inmates would be given pills or injections.  They were told it was to prevent diseases, but the nurses told me  secretly that the pills were dangerous and that I should not take them.”  \n>  \n>*What happened to those who did take them?*  \n>  \n>“The pills had different  kinds of effects. Some prisoners were cognitively weakened. Women  stopped getting their period and men became sterile.” (That, at least,  was a widely circulated rumor.)\n\n&#x200B;\n\n&#x200B;\n\n>The fate of the women in the camp was  particularly harsh, Sauytbay notes: “On an everyday basis the policemen  took the pretty girls with them, and they didn’t come back to the rooms  all night. The police had unlimited power. They could take whoever they  wanted. There were also cases of gang rape. In one of the classes I  taught, one of those victims entered half an hour after the start of the  lesson. The police ordered her to sit down, but she just couldn’t do  it, so they took her to the black room for punishment.”  \n>  \n>Tears stream down Sauytbay’s  face when she tells the grimmest story from her time in the camp. “One  day, the police told us they were going to check to see whether our  reeducation was succeeding, whether we were developing properly. They  took 200 inmates outside, men and women, and told one of the women to  confess her sins. She stood before us and declared that she had been a  bad person, but now that she had learned Chinese she had become a better  person. When she was done speaking, the policemen ordered her to  disrobe and simply raped her one after the other, in front of everyone.  While they were raping her they checked to see how we were reacting.  People who turned their head or closed their eyes, and those who looked  angry or shocked, were taken away and we never saw them again. It was  awful. I will never forget the feeling of helplessness, of not being  able to help her. After that happened, it was hard for me to sleep at  night.”\n\n&#x200B;\n\n>Testimony from others incarcerated in Chinese  camps are similar to Sauytbay’s account: the abduction with a black sack  over the head, life in shackles, and medications that cause cognitive  decline and sterility. Sauytbay’s accounts of sexual assaults has  recently been significantly reinforced by accounts from other former  inmates of camps in Xinjiang published by The Washington Post  and The Independent, in London. A number of women stated that they were  raped, others described coerced abortions and the forced insertion of  contraceptive devices.",
    "title": "Sayragul Sauytbay's firsthand testimony about what happens to women in China's camps is heartbreaking",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1571482155,
    "score": 33,
    "keyword": "woman artist"
  },
  {
    "text": "What career for someone \"smart\" who hates academics and controlled environments? Im doing a degree because I wanted to leave home and I was expected to because I was smart in school. I'm in the middle of my 3rd year out of 4 and I'm on a year abroad. But I hate everything about writing reports and stuff and I don't think there's anything I want to do with this degree. I want something hands on and creative. I hate being controlled. The only time I have discipline and motivation is when I'm in charge. So I can't stand the idea of most jobs.\n\nJobs I've considered in my adolescence were author, illustrator/comicbook artist etc/game designer/entrepreneur/guitarist but I'm always told \"oh you can be an artist or such whilst doing another job and move into the art side if it takes off, have sth stable too\". Which now I've spent so much time not working out what I want to do is a fair point because I'm an adult now and I need stable money. I'm currently considering barbering because it's self employed, stable, creative and plays into one of my passions. I really care about the power of working on ones image to transform one's life. And I have ideas of how barbering could really help me pursue that idea. On a small scale I would be helping people shape up and feel confident but I think it's scaleable. I'm a woman interested in barbering and I think I could work on helping LGBT youth with confidence through this. People who like me grew up being forced into certain gender roles and being bullied for being themselves but are learning to take pride in themselves and their image. Like working on my image really changed my life. I dunno where that would take me and it might lead out of barbering but it's a skill that would always serve me. And even if I don't do that or even if I do, it's a profession that would be non-stressful enough that I would be able to actually do other creative things around it and figure out a future. There was one barber I heard from online that even said working in barbering and doing music on the side was an amazing mix because he just felt creative all the time but had sth stable. But this is just an idea I came up with the last couple days when I realised how many barbering technique videos id been watching so don't take it too seriously.\n\nMy mum thinks that if I don't get a job that requires like a master's then I will become bored because I'm smart. Maybe she's right. Tbh I chose my degree in order to get away from her easily because she was terrorising me for my sexuality, not because it was exciting and challenging to me. I chose the easiest thing I could. Maybe if I just chose better it would be fine. Maybe I'm just bored because I  didn't challenge myself as she said. The fact that I never had to study to get straight As in school might be why I hate school so much now. But I can't stand being a university student. I like partying and I like having an easy place to make friends and learn how to be an adult. That's about it. I'm getting pretty restless with that dossing around tho. I did used to like studying at some point tho. I loved reading and history and stuff. And I'm a pretty theoretical thinking person. Im an INTP I think and I've been told so many times that I am excessively logical about feelings. I like to overanalyze everything and I'm terrible at executing. So I dunno maybe that sort of personality is suited to some sort of traditional smart career. I can't really tell whether I'm just a rebel for rebels sake or whether I really shouldve never bothered going to uni when I didn't want to at all.\n\nWhat do you think? What sort of career is good for a supposedly \"smart\" person that can't stand being in the traditional path for one moment longer? Preferably sth that would help me pay off my hefty and entirely unecessary huge student loans? I'm not looking to be a rockstar or even hugely rich just happy and not super controlled.\n\nOr do you think i should try again with uni? In which case how the hell do I do that? Anyone know what happens when you drop out of UK uni and how to move on?\n\nOr should I just finish like my mum said when I tried to drop out in 2nd year? I managed to become more positive and productive by taking the attitude that I would just finish but it didn't really last.",
    "title": "What career for someone \"smart\" who hates academics and controlled environments?",
    "subreddit": "careerguidance",
    "timestamp": 1548050237,
    "score": 3,
    "keyword": "woman artist"
  },
  {
    "text": "I am a 30 year old full time artist. What career can. I change to that will sustain me in the coming decades? I am a 30 year old woman with a BFA in fine arts. I am a full time artist in a very niche market. I love what I do. However I fear that as our climate changes and our ways of life adapt, people may want to spend less on luxury goods. I fear my market will disappear.\n\nI want to begin studying something that will be useful 10 or 20 years down the line. I thought of welding or a similar trade as I am good with my hands, but I don't know if I am too old to start that career. My husband is in IT and suggested I join him there, but I don't know where to start. I've also thought about nursing so I feel like I am helping people, but again, am I too old?\n\nI don't plan on having children. I just want to be useful until my time comes. I have been going through a bit of a crisis, so please be patient with me.",
    "title": "I am a 30 year old full time artist. What career can. I change to that will sustain me in the coming decades?",
    "subreddit": "careerguidance",
    "timestamp": 1577559195,
    "score": 3,
    "keyword": "woman artist"
  },
  {
    "text": "Portrait of a Black Italian woman dating from the mid-1500s, painted by a student at the school of artist Paolo Veronese.",
    "title": "Portrait of a Black Italian woman dating from the mid-1500s, painted by a student at the school of artist Paolo Veronese.",
    "subreddit": "blackladies",
    "timestamp": 1557187261,
    "score": 540,
    "keyword": "woman artist"
  },
  {
    "text": "Meet the artist who received backlash for painting God as a black woman",
    "title": "Meet the artist who received backlash for painting God as a black woman",
    "subreddit": "blackladies",
    "timestamp": 1559472588,
    "score": 239,
    "keyword": "woman artist"
  },
  {
    "text": "Why did so many black celebrities go to see slave play? So I never heard about this play the first time it opened. But I saw a post about it on Jake Gyllenhaal's Instagram and the name made me look it up.\n\nA play about slave/master roleplay for modern interracial couples. From one review I read there's a scene in which the black woman raped and thanks her white master.\n\nThe creator is a gay black man who clearly has a white fetish as he has written about it in the past. His first play was about a young black artist in a relationship with an old white art collector.\n\nI was gonna cancel Gyllenhaal for producing this. But then I realised how many black celebrities went and praised this play? Zendaya, Rihanna, Tessa Thompson, Zazzie Beets, Whoopi Goldberg, Janelle Monae, Regina King. I dont want to assume they would support something so bad. So am I miss interpretating it? Anyone here seen it?",
    "title": "Why did so many black celebrities go to see slave play?",
    "subreddit": "blackladies",
    "timestamp": 1570670183,
    "score": 36,
    "keyword": "woman artist"
  },
  {
    "text": "Jermaine Dupri is annoying. The sexism is annoying. Honestly, if it really wasn't the fact that he made every sexual woman on a stripper. Playing on some hip-hop Madonna/Whore complex (because simply put an explicitly sexual woman=/=stripper; and thinking that way is narrow minded and ignorant).\n\nInstead of admitting his ignorance that he just doesn't know enough women to comment (or even hyping up his own female artist. What's he doing with her career?) to speak on favorites and asking recommendations he really just insults all of female rap. Because you can't take the entirety of female rap musical content and say it's stripping. You just can't, it's wrong, that's not accurate.\n\nAnd now he's doing this female cypher which 1. makes this all seem planned and 2. I hope no self-respecting woman emcee does seeing as how he really just disrespected you AND your peers. But I see a lot of artists being literal pick mes in the comments. (And tbh, even if I was a \"concious\" and \"lyrical\" female emcee I wouldn't want fans from that platform but that's just me)",
    "title": "Jermaine Dupri is annoying. The sexism is annoying.",
    "subreddit": "blackladies",
    "timestamp": 1562987909,
    "score": 27,
    "keyword": "woman artist"
  },
  {
    "text": "Anyone else stop watching Bollywood films because of Anti Blackness? Anyone else stop watching Bollywood films because of Anti Blackness?\n\nI am half black and half white and grew up watching Bollywood (Indian) movies thanks to being introduced by an Indian neighbor. I fell in love with the romance, the fashion, music, dancing and the storylines. I wanted to move to India and marry an Indian man. Also sometimes people thought I was part Indian which made me feel\nEven more connected.\n\nAs I got older, however, I started to realize how colorist and anti-black the Indian Culture was. In the movies, I started noticing how most of the women had pale skin and sometimes there would be comments like “at least your wife is not dark.” I realized that I was supporting a movie industry that discriminated against people with my skin color (light brown/ caramel) and race and I was not okay with that so I distanced myself away from watching the movies. I also had some prejudice experiences where some Indian people would give me dirty looks when I was out with an Indian man. I realized that I was experiencing more prejudice from the Indian community for dating an Indian guy than I normally did from the white community when I was with a white guy. I remember in middle school, this Indian guy and I really liked each other and then one day he started giving me the cold shoulder. Who knows why? In my mind, though, I wonder if his family told him to stop talking to me because I was part black.. \n\nI have a white friend who is obsessed with Bollywood movies and told me she wants move to India because she felt so welcomed there. I felt some resentment and envy because i know a big part of her feeling welcomed has to do with her white privilege and the fact that Indian culture worship white skin. If I went to India, I doubt I would feel as welcomed as her. She may even have a chance at being a dancer in a Bollywood movie——something I dreamed of happening when I was young but soon realized the unlikelihood of that happening. If they don’t embrace their own dark Indian people, how would they embrace a part black woman?\n\nI struggle also because a part of me really wants to start watching Bollywood movies again as they are so artistic and incredible.. but then it doesn’t feel right because of their anti blackness.\n\nYeah.. wanted to get out of my feelings of hurt, rejection, and resentment I have from what I learned of Bollywood and Indian culture. I’m wondering if anyone else relates?",
    "title": "Anyone else stop watching Bollywood films because of Anti Blackness?",
    "subreddit": "blackladies",
    "timestamp": 1555753205,
    "score": 23,
    "keyword": "woman artist"
  },
  {
    "text": "Figure Drawing So as an artist I enjoy going to figure drawing sessions where I get to drawn the human figure from a live model. I've been good to these type of sessions since I was sixteen. It usually for adults but they allow mature high school juniors and seniors as along as you're at least sixteen or older.  \n\nAnyway I still go as adult and I'll usually go when I'm off from work and have the money and time. Sessions are about 8-10 dollars and you bring your own supplies and you can draw or paint from the figure for about three hours.\n\nLately the sessions I've been going to have been having a lot of black female models. THANK GOD. My drawings have been more lively and vivid. For the longest time a lot of the models have been stick figure skinny white women and it annoys me.\n\nI don't mind sometimes but switch it up a little. More black female models or other women of color. Or hell some male models would be nice too those are also rare. And I mean young male models because anytime there is a man model he is usually old.\n\nI actually packed up and left early from a session because I just wasn't feeling the model and my drawings sucked. Granted not every day is a good drawing day but I fell like that's what it was.\n\nI'm at a point now where I'm just going to wait and see who the model is before I set up. If I'm not feeling the model I'm leaving and that's no disrespect to the model personally I'm just tired of drawing the same type of white woman.\n\n It made me think of what Toni Morrison said when she was asked once about how come she only writes about black people and when was she going to write about white people. Like damn. I just want to see different people model or at least models that have my likeness.",
    "title": "Figure Drawing",
    "subreddit": "blackladies",
    "timestamp": 1574017133,
    "score": 17,
    "keyword": "woman artist"
  },
  {
    "text": "Airbnb host is violating boundaries like abusive mom Airbnb host is violating boundaries like abusive mom\n\nI moved into an Airbnb over a week ago. I needed a place to stay for 2.5 weeks before I move into my new place on May 1st when I will be fully free from ties of my sexually abusive autistic dad and Narcissist mom.\n\nI have about over a week left before the big move and I am going to stick through it... but my host is sooo triggering. I swear she either has borderline personality disorder or narcissistic personality disorder. She is an artistic, middle class, liberal, very green, Caucasian woman. I am a 27 y/o mixed black woman.\n\nWhen I first moved in and met her, I told I was going to get my luggage from my other place. I came back later in the day around 8:30 pm and as I was struggling with my luggage and opening the door (she has unique doors that have different ways of opening them and I have never used them before) she sat on her computer and didn’t help. But when I knocked on the door telling her I was having trouble getting in, she rudely said, “no one else has had problem using those keys. And be careful about bumping my door glass.” Then she followed me up the stairs and said, “you should probably remove some clothes out of your suitcase because you’ll probably have to carry your suitcase. You break it, you buy it. It’s in my rules.” \n\nThen the next day, I had issues locking her door when I was leaving and In her rules, it says if you leave the door locked, you get kicked out of the house. So I was concerned and wanted to make sure I locked the door right. So I ended up knocking on her door to wake her. She didn’t even answer my question but complained she was going back to bed because she was tired.\nWhen I returned later that day, I apologized for moving in later and also for waking up and she said, “yeah, because you woke me up, I couldn’t go on my schedule bike ride..” Then she says, “you are going to have to practice opening the door. You seem intelligent, I don’t understand why you are having so much trouble.” So rude and what a backhanded comment.\n\nThen she started making signs in the house to remind me to be more green—like being careful about using too many paper towels and what is recycled and not. Then I tell her I make tea in the morning and she was like use my kettle, it is quicker and less noisy. I tell her the only issue is the kettle has tap water and I use spring water. So she storms out of the room and says, “Yeah, well that’s absolutely ridiculous! I drink tap water and I’m just fine. I would be more concerned about the BPA in the plastic the spring water is in if I was you!” I just said “hmmm.” Just because I am living in her home, doesn’t mean I have to start breaking my values.\n\nThen the next day, she sends me a message that she wants to teach me how to recycle and compost. I’d like to add that I know the basics of recycling but the way she is treating me, she is acting like I don’t know anything. She ends up explaining that paper towels cannot be recycled with food grease on them and that my tea bag paper cover cannot be recycled because the ink is made of wax. She tells me whenever guests come, she feels it is her duty to educate and she knows she doesn’t walk the talk of being green completely because she still drives cars and used airplanes. I thanked her for the education and thought her micromanaging was over.. but then I get home from work today and open my door and see sheets of paper put underneath my door with examples of what to recycle and compost. I was mad because of the boundary violation of her shoving her unsolicited advice literally in my physical space. So I took the papers and put them on her kitchen table. She saw that and quietly said hi.\n\nI decided for these weeks while I stay at her place, I was just going to eat out because I didn’t want to be micro managed, watched and criticized. She is extremely triggering because my mom was just like her—violating boundaries, unsolicited advice, and no apologies for abusive comments.\n\nI feel like I am walking on egg shells and I met another version of my mom. The fact that she speaks to me as a stranger like this appalling. I’m not surprised she is single and alone in her house. I also am triggered because Her behavior reminds me of some racist white Coworkers in past jobs where they often watched me closely/suspiciously and felt they had to teach me “their ways” maybe because they expected me to be uncivilized. I wonder if she treats her white guests like this—watching them as closely and feeling like she has to educate them. Although her other white guest next door made a comment that she is really picky about having things a certain way as he joked about one of her signs about the paper towels was for me.\n\nAnyone relate? What would you do if you were in my shoes?",
    "title": "Airbnb host is violating boundaries like abusive mom",
    "subreddit": "blackladies",
    "timestamp": 1555981087,
    "score": 14,
    "keyword": "woman artist"
  },
  {
    "text": "Confusion About Identity Hello all!\n\nSo, I grew up with baby boomer parents and all throughout my childhood they vilified what became known as black culture. Like, what became known as ebonics/aave was completely demonized in my household. Rap and hip hop were completely demonized as well as all the fashion and dancing that came out of it. And note, this wasn't just gangster rap, it was like all of it. R&B for the most part, was lumped in with stuff like gangster rap, save a few artists like Boyz2Men, Mariah Carey, and some others. \n\nI did grow up listening to black music from the 80s and before; as well as Jazz artists. But, being a 24 year old black woman I find it hard to relate to anyone that participates in black culture and I always feel really strange when someone assumes I know something about it (I'm black, so why wouldn't they?) and I can't respond with anything. \n\nI honestly am really confused about who I am concerning culture. On one hand, I really want to get into black culture because it feels like a large part of my identity that I have looked down upon for so long due to my parents. But on the other hand, I have no idea where to begin and I don't want to mix culture with stereotyping.\n\nAnd honestly, it's not just music; it's everything. Like, even in college when I tried to join black organizations there was this huge feeling of *I don't belong here* because it seemed like everyone had similar mannerisms and experiences, but me. \n\nI'm just so confused. Anyone else been in this situation or have any advice?\n\n**P.S:** And to note, my parents are black. They just grew up in the 50s before modern black culture was a thing. So when it started taking hold, they saw it as something to be avoided. When I've asked them about my confusion with culture, this is what they told me. They always said, \"You're an American, you're not black. Other people will see you as that and ascribe things to you, but you're American. That's it.\"",
    "title": "Confusion About Identity",
    "subreddit": "blackladies",
    "timestamp": 1547340218,
    "score": 13,
    "keyword": "woman artist"
  },
  {
    "text": "Anyone else find this article for an exhibition of the arrival of the first slaves in America bizarre? e: i added the link! \n\nIt feels like coded language, made to be as neutral sounding as possible. [It quotes a black woman though and the photos are great. From Columbia University.](https://news.columbia.edu/news/exhibition-african-americans-jamestown-art-history-archives)\n\n**An Exhibition Celebrates the Legacy of Jamestown**\n\n** “20 and Odd: The 400-Year Anniversary of 1619\" at the LeRoy Neiman Gallery commemorates the arrival of the first Africans in the American colonies.**\n\nWhen the earliest documented Africans arrived in 1619 in Jamestown, Virginia, the first permanent English settlement in the American colonies, they were recorded as “20 and odd Negroes,” who disembarked from an English pirate ship flying a Dutch flag.\n\n20 and Odd: The 400-Year Anniversary of 1619 commemorates the arrival of these Africans who landed in Jamestown. The exhibition opens at the LeRoy Neiman Gallery on August 30, 2019 and will be on view through September 30, 2019. Through images, documents and other archival materials, and contemporary art, the exhibition explores this event and its historical implications from the 17th through the 21st centuries.\n\n“The 20 and odd Africans signify the integral importance of Western Africa in the development and prosperity of the New World and, more specifically, the central role of Africans in transforming what would become the United States into a political, cultural and economic world power,” said Kalia Brooks Nelson, an adjunct professor in the African American and African Diaspora Studies Department who curated the exhibition.\n\nThe works on display are from collections that are housed at Columbia’s Rare Book and Manuscript Library as well as collections and archives at the New York Public Library and the Library of Congress\n\n“These objects provide insight into what the texture of life would have been like for Africans in the conflicted space of the New World, and are also the basis from which to consider contemporary art that reflects attitudes, discord, popular culture and personal accounts about Africa and the descendants of African people as foundational actors in the emergence of the Atlantic World,” said Nelson.\n\nArtists with pieces in the exhibition include Sanford Biggers, Thomas Askew, Pamela Phatsimo Sunstrum, Hank Willis Thomas, Paula Wilson, Hale Woodruff and Adama Delphine Fawundu, a 2018 School of the Arts graduate, whose site-specific mural, Tales from the Mano River, will cover the walls of the lobby in Miller Theatre through June 2020.",
    "title": "Anyone else find this article for an exhibition of the arrival of the first slaves in America bizarre?",
    "subreddit": "blackladies",
    "timestamp": 1569364394,
    "score": 8,
    "keyword": "woman artist"
  },
  {
    "text": "The 'Story Quilts' legacy of artist Faith Ringgold. Her work is part hand painted, woven and messages written onto quilts - her great, great, great Grandmother was an enslaved woman who made quilts for plantation masters:",
    "title": "The 'Story Quilts' legacy of artist Faith Ringgold. Her work is part hand painted, woven and messages written onto quilts - her great, great, great Grandmother was an enslaved woman who made quilts for plantation masters:",
    "subreddit": "blackladies",
    "timestamp": 1570111308,
    "score": 4,
    "keyword": "woman artist"
  },
  {
    "text": "Ownership and Acceptance of Your Identity How have the 88Rising artists (or other notable Asian artists) influenced the relationship you have with your identity? As someone who identifies as an Asian American woman, music from the Chengdu group, the Higher Brothers, specifically “Made in China”, helped me take charge of my Japanese-Hawaiian roots. When I went to an 88rising show, I sang my heart out and even almost cried at certain points. I was not ashamed. I relished in my Asian heritage. I was proud. Anyone else have similar feelings or experiences?",
    "title": "Ownership and Acceptance of Your Identity",
    "subreddit": "asianamerican",
    "timestamp": 1556662229,
    "score": 1,
    "keyword": "woman artist"
  },
  {
    "text": "Is this some kind of \"hypergamy culture\" or just my imagination? Hi Men's Rights:\n\nSo I've been musing on something tonight. I'm 32 years old and single (by choice.) I've never really had an American girlfriend, or Western girlfriend for that matter. I've dated Brazilian, East European, and Southeast Asian women among other ethnicities. Even back in university, in the states, it was the foreign exchange students who were interested in me and vice versa. I'm usually invisible to American women. But I don't care so much because it's not like I have a lack of options, and besides I'm much more attracted to exotic women with accents etc so... no complaints with my love life.\n\nSo I'm back to living out of a backpack and traveling around the world. Here's what I've noticed: wherever I go, hanging out in hostels, it's always the shorter stature guys like me or shorter (I'm 5'8-5'9) who are single OR have non-Western girlfriends with them. So if I see a guy who looks like me, \\[is American or Western\\] and he's with his girlfriend, it's always like \"this is Yuko from Japan\" or something. But every time I see some pretty Aussie, English or American girl, her boyfriend is ALWAYS some huge guy... 6'3, 6'4, with a pretty face, and either really masculine looking OR completely immasculated and she's bossing him around constantly. Both dynamics I find a bit odd.\n\nI don't think I've ever seen a Western couple where the guy wasn't hitting all those criteria. Otherwise, the pretty Western women are single. So, it's either they're with that X-perfect guy, or no guy at all. Most often, they're by themselves or with girlfriends, but I've never seen a Western woman with a guy who looks even similar to me. And that's really an observation from years of traveling.\n\nDoes this mean I am being \"weeded out\" of Western rampant hypergamy, or is it my imagination? Is the fact foreign women don't seem to care evidence that it's Western culture promoting this to an extreme level and resulting in this phenomenon? Basically, in my experience, including my failed days trying to be a kind of pickup artist back in the states, fellow American women are open to talk to me or become friends but very closed off romantically. With foreign women, things turn romantic quite naturally and it happens more often than not and doesn't even require a lot of thought. It's a bit like, eh, I'm being hardcore judged by fellow Westerners and being systematically weeded for not being a pretty enough, tall enough bloke.\n\n(I might add, given I've dated some really beautiful women in my life, the fact Western women immediately rule me out means I feel bad for those \"alpha males\" who get stuck with the Americans while I get the better girls!!)\n\nIs this just me going crazy or is this a real thing?",
    "title": "Is this some kind of \"hypergamy culture\" or just my imagination?",
    "subreddit": "MensRights",
    "timestamp": 1552677502,
    "score": 25,
    "keyword": "woman artist"
  },
  {
    "text": "Men's Rights glossary MRA. MRM. Incel. PUA. Red Pill. Femcel. There’s all sorts of weird words and groups and it can be really confusing when you get here. This is to help explain what’s up with all these groups and explain some of the common terminology and groups. With this you can untangle the acronym spaghetti. \n\nThe first term to know about is the manosphere. Lots of men have gotten online and forged communities of shared interest and a lot of them are forged around male interests. Women may well have a place in these communities but men tend to drive the narrative. [This](https://ibb.co/dJh60Jx) is a diagram noting some of the common famous ones.\n\nThe media likes to conflate a lot of these, but a lot of them don’t really like each other much. This is to help you understand what they are, and who is friends with who. The above graph notes some of the main male dominated group, notes who is friendly with who, and says what they want from their movement. \n\nA lot of these groups are what’s called feminist or anti feminist. Feminists are a group of people who want to help women be better off in society. Anti feminists believe that feminists as a group are hurting men and women and should be opposed, although they may be fine with many individual feminists. \n\nLets go through the groups one by one.\n\n**MRAs**\n\nThese are people who want to stand up for the rights of men and make a better world. We generally can get laid, unlike other groups, and often have had serious problems because of our skills at getting laid. Divorced men and men seeking custody of their kids are major members. Other major groups include men seeking to protect boys from unwanted circumcision, men seeking prison reform, and mothers and fathers seeking educational reform, and children seeking relief from harsh teachers and bureaucracies. \n\nWe believe in better relationships with women and them showing proper respect by not beating us up or insulting us. The legal systems can be very harsh on a man who is attacked by a woman and the courts often take men’s children away. We are anti feminist generally because feminists have made laws that hurt us like the duluth model which says men are always violent and is the main domestic violence model in the USA.\n\nWe are mostly male, but with some prominent women among us, and tend to lean egalitarian and liberal with a substantial wing of conservatives.\n\nWe are friendly with MGTOW who just want to be left alone, and traditional conservatives who we respect for seeking a good model of society. We have regular issues with incels (people who can’t get laid) but are sympathetic to them, dislike male feminists, and sometimes respect PUA (people learning the art of seduction) and sometimes get annoyed by them. We dislike white nationalists, and sometimes are friendly with gamergate people and alt right people.\n\nKey terminology.\n\nThe Red Pill. This refers to the idea of gaining greater awareness of the shitty situation of men. Popularized by avoiceformen and Cassie Jaye and her film The Red Pill. \n\nNAFALT. Not all feminists are like that. This may be quoted at people who say that not all feminists are bad. Since the mainstream institutions are making laws that hurt men we have issues with them.\n\nMGM. Male genitalia mutilation. An emotive term for circumcision that compares it to female genital mutilation. \n\nIntactivists. A group of activists against male circumcision.\n\nMRM. Men’s rights movement. The general term for all of us. \n\nAVFM. Avoiceformen, a very popular men’s rights website.\n\nToxic Masculinity. A widely hated term that feminists tend to use on men, generally seen as hostile use of stereotypes to control men. \n\nPatriarchy. The idea that men rule society. MRAs generally believe that a small minority of men and women at the top rule society, politicians and business tycoons, and that both men and women have varying degrees of power. In the modern world feminists and women often rule the world. Feminists tend to believe all men are dominant in society.\n\nApex fallacy. A popular idea that feminists assume all men have the power and privilege of kings and presidents.\n\nMen Going Their Own Way\n\nThese are men who have gotten tired of living in a hard world where interaction is dangerous and mostly avoid interacting with women. They’re generally friendly with the MRM and there’s a lot of overlap with us. They want to be treated better and with respect, but don’t especially want much else from women. They generally don’t like feminists much.\n\n**Tradcons**\n\nChristian, Islamic, other traditions which want a return to traditional male values and a stable family. They often want women to be submissive and respectful, to regularly have sex with them, and to remain faithful and honest. While MRAs don’t generally believe in traditional values like that and don’t believe in forcing such on people we often make strong and good friendships with those who just want to marry a cute woman and stay at home. Many of the female MRAs value this lifestyle because lots of people like staying at home and being pampered. \n\nDalrock is a famous blog example of this. \n\nTradcons are generally friendly with us, though they have a fair number of fights with male feminists and pua. Often they try to use pick up artist skills to better please their wife, and pick up artists are unhappy with this. \n\n**Incels**\n\nInvoluntarily celibrate people. These are people who, normally due to unattractiveness or poor social skills have trouble getting with women. In the modern world there’s a strong tradition to shame men who are less attractive who approach women which makes it very hard for these men to find partners. They generally want good relationships and to get laid with women, but due to hard experiences are often doubtful of respect. \n\nA small number of them have been violent. Being in a very shitty situation tends to radicalize them. MRAs generally don’t like them much, even if they are sympathetic. It would be better for many incels if they could join a supportive and less sexist group, and bullying them is bad. Lumping them in with MRAs is unhelpful. Since they’re often depressed they tend to have fights with everyone. \n\nKey Terminology.\n\nFemcel. Female incel.\n\nBlack pill. A sad idea that the world is shitty and terrible. \n\nOmega. A term for a male at the bottom of society, aka incels.\n\nChad and Stacey. A term for sexy males and women at the top of society. \n\n**Pick Up Artist**\n\nMost famously, the red pill community. People who seek to build their sexiness so they can get laid. There are feminist pick up artists and variants, but the most famous sort is rather sexist and rather committed to lifting, sleeping with lots of women, and always being confident. They don’t care about relationships with women as much and expect respect only when they prove their value to women.\n\nThey don’t care about the general respect of women, and want to build up their sexiness so they can get laid more. They get fit and sexy and be confident and women will like them more, ideally. They’re pretty sexist and commonly call women sluts.\n\nLots of MRAs, Trad Cons, and Incels like some of their ideas, but their sexism and roughness makes long term friendships tricky. We like being sexier, but don’t want to be with lots of women.\n\nHeartiste is a major blog of theirs, as was Roosh. \n\nKey Terminology.\n\nCuckold. Someone who gains pleasure from other men having sex with their partner. A common insult.\n\nBull. The dude, often black, who has sex with the cuckold’s partner. \n\nAlpha and Beta. The idea that some males are dominant in society and get to fuck women and some men are less dominant and get to comfort them. Alpha fucks, and beta bucks. \n\nHypergamy. The idea that women don’t form strong relationships with men, but always look to upgrade. \n\nFrame. Be confident and you can get laid. Superior frame gets you laid. Have more masculine energy than women.\n\nShit tests. Tests women give to men which are hurtful so they can prove their worth.\n\nSpinning plates. Flirt with multiple women so you can get laid more. \n\nSexual market value. The idea that each person has a fairly fixed sexiness to others they should work on improving.\n\nFDS. A rival female seduction group seeking to gain success in female resource. Female Dating Strategies.\n\n**White nationalists**\n\nA small group of people who could probably all fit in a single hotel. They hate people of other races and are loud and violent. Their circles never really intersect with MRA circles. They’re assholes, no one likes nazis much.\n\n**Gamergate**\n\nThe gaming industry has lots of feminists in it and some have picked fights with gamers. Occasionally their issues cross paths with ours, but there’s no formal affiliation. \n\n**Alt Right/ Trumpets**\n\nPeople who believe that the alt right is the best and want Trump to rule America forever. There are some right wing MRAs, but more are left wing. Our main complication is that feminists are left wing, so we can never get anything done siding with left wing people.\n\nRegardless, while they sometimes intersect we’re not formal allies. \n\n**Menslib/ male feminists**\n\nA group of male feminists who believe that they can be better people by following feminist ideology. Since feminists don’t like men much this leads to much frustration for them. They generally let feminist ideology rule their lives and talk a lot about how to improve their mental health through it.\n\nThey can’t ask for respect since they need to accept feminist criticisms, such as being called people \"who are trash inside” \"dirtbags who are barely able to function\" or constantly being seen as a threat of rape murder and violence, they can’t ask for sex since that would be misogynistic, so they hope that by constantly working to be patient, non-threatening, they can slowly change the just negative conceptions feminists have about men by doing things like teaching three year olds to not sexually harass women. \n\nThey generally hate incels and autistic people since socially awkward men annoy feminists, hate PUA because those people want sex from women, hate MRA for wanting men to get respect, hate trad cons for many reasons, and generally dislike pretty much everyone else in the manosphere. \n\nKey Terminology\n\nPatriarchy. Toxic cultural ideas of masculinity that harm men and women, leading to men being unhealthy, repressing their feelings, and hurting women.\n\nThe Blue Pill. Rejecting the red pill, following feminist ideology.\n\nToxic Masculinity. A idea about how men’s refusal to share their emotions and aggression and violence leads to social problems.\n\nThat's my summary for new people, hope it helps people. If you see any common terminology missing or have any suggestions for better helping newcomers to the MRA movement, do say. Thanks for reading.",
    "title": "Men's Rights glossary",
    "subreddit": "MensRights",
    "timestamp": 1575689393,
    "score": 16,
    "keyword": "woman artist"
  },
  {
    "text": "Seattle NYE Fireworks Show Features only Female Artists Imagine if this was flipped.  People would be losing their minds.\n\n\"The theme for this year's show is Celebrate Woman.  Every song of the show's soundtrack performed by a female artist will be simulcast on KISS 106.1 FM.\nThe finale song will be “Respect” by Aretha Franklin, who died this year.\n\"\n\nhttps://www.kiro7.com/news/local/new-light-show-added-to-this-year-s-new-year-s-celebration-at-space-needle/896857641",
    "title": "Seattle NYE Fireworks Show Features only Female Artists",
    "subreddit": "MensRights",
    "timestamp": 1546330488,
    "score": 11,
    "keyword": "woman artist"
  },
  {
    "text": "Why are so many popular make up artists men? I'm a man with a background in Sociology and am interested mostly in power and subjugation. Feminist ideas and literature fascinate me however I obviously lack the experience of being a woman and thus my feminism is often admittedly defined by ignorance.   \n\n\nWith that in mind I hope I can ask this without a pre supposed opinion or stance.  \n\n\nSocietally hair and make up is a feminine staple so it seems a bit jarring that these feminine idols are male? I am absolutely supportive of men practicing femininity and being celebrated doing so but it seems strange that men are the most celebrated hair and make up practitioners and relevant feminine icons in the hair/make up Youtube paradigm.  \n\n\nI asked my girlfriend (who watches and introduced me to James Charles, Jeffree Starr etc.) and she is unsure. Her explanation is that they are just exceptional make up artists but i'm not sure that makes sense. She added that most top make up artists who work with female celebrities etc. are men which I find intriguing. I should add she is not approaching the question from the same kind of feminist reading as myself instead just the female experience.  \n\n\nLiterally any contribution or suggested reading is welcome.",
    "title": "Why are so many popular make up artists men?",
    "subreddit": "Feminism",
    "timestamp": 1566039429,
    "score": 18,
    "keyword": "woman artist"
  },
  {
    "text": "Art Show focusing on strong women - suggestions wanted! So there was recently a huge shitfest in my city where a well-known artist was blasted when 20+ women came forward with accusations of assault and disgusting, misogynistic behavior. He's gone, his career is done, good riddance. \n\nA local coffee shop is hosting an art show dedicated to women (I'm including trans and gender queer women in this as well) and I want to submit a piece for the show...but I'm having trouble picking someone noteworthy to paint. \n\nI'm a cis queer white woman, and there's enough emphasis on white women in history and their accomplishments, so ideally I'd like to highlight WoC, trans women, women who have done great things (scientifically, politically, socially, artistically, i'm open) but don't hit the spotlight. \n\nI'd love suggestions of women to depict that, you feel, should be recognized. Thank you!",
    "title": "Art Show focusing on strong women - suggestions wanted!",
    "subreddit": "Feminism",
    "timestamp": 1550796924,
    "score": 0,
    "keyword": "woman artist"
  },
  {
    "text": "Prominent boob-centric manga artist shocks fans by revealing she’s a beautiful buxom woman",
    "title": "Prominent boob-centric manga artist shocks fans by revealing she’s a beautiful buxom woman",
    "subreddit": "Feminism",
    "timestamp": 1550921318,
    "score": 0,
    "keyword": "woman artist"
  }
]